{"url":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/","title":"Mugash Forced effect on to Catch an Orc","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=998233","commentId":998233,"userName":"Tracker1","timestamp":1393542759,"content":"After Mugash is defeated it says to attach him to a hero and exhaust that hero, the hero will no longer be able to ready.\n\nQuestion. Does the hero Mugash attaches to have to be ready when attached, or can he be attached to a tapped hero?\n\nNot sure if the exhausting the hero is to prevent a player form attaching mugash to Spirt Glorfindel with LoV, and still questing with Glorf, or if the exhausting a hero is part of the requirment for capturing him, which makes it a bit more challenging if the hero can not be used for attack strength.\n\nAlso, if there is no hero to attach him to what happens to Mugash after he is defeated. Does the damage just remain on him, and a hero can be exhausted to capture him after refresh or does he have to be defeated again?\n\nThe simplest rule would be just attach him to an exhausted hero and then they can not ready, but the way it is written makes it seem that the hero must be ready and them exhaust to capture him.\n\nHow is it supposed to work?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=998302","commentId":998302,"userName":"Bullroarer Took","timestamp":1393548387,"content":"It was curious wording I agree.  I think he can be attached to an exhausted hero.  The card doesn't say what to do if no one can exhaust for him though and so I think that waiting a turn also works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=998324","commentId":998324,"userName":"Tracker1","timestamp":1393550786,"content":"Sent in for official response"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=999731","commentId":999731,"userName":"jjeagle","timestamp":1393695174,"content":"I would be fairly confident that you can attach Mugash to an exhausted hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=1000107","commentId":1000107,"userName":"GrandSpleen","timestamp":1393739465,"content":"Agree with jjeagle, otherwise it would say \"Exhaust a hero to...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/100233-mugash-forced-effect-on-to-catch-an-orc/?do=findComment&comment=1001489","commentId":1001489,"userName":"Tracker1","timestamp":1393876580,"content":"Official response\n\nExhausting the hero Mugash is attached to is an effect, not a cost. So, you can attach Mugash to a hero who is already exhausted. The effect of keeping that hero exhausted is to represent that hero struggling to keep the orc restrained since it doesn't seem likely that someone escorting a large, captive orc could also explore or fight.\n\nI believe your second question was predicated on the idea that Mugash could not be attached to a previously exhausted hero because if there were no heroes in play the players would have lost the game. As it is, Mugash will always be attached to a hero when he is defeated.\n\nCaleb"}]}