{"url":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/","title":"multiple Hero versions for each sphere","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=998471","commentId":998471,"userName":"Catastrophic09","timestamp":1393567643,"content":"I'm starting to think we won't see heroes for every sphere. Right now some heroes have two versions and it would be really cool if for example Aragorn was in each sphere because if he was your favorite character you could now always use him and have the flexibility to build any deck. Now that FFG has announced we'll only get one actual hero in The Road Darkens (besides Frodo) I don't think they will continue the trend of four heroes per Saga. I'm still super sad about this but here's one potential reason... In the Campaign mode for these Saga's there are penalties for switching your heroes out but not for switching a version of a hero. So if you had four versions of each hero you can swap them out and deck built to a certain sphere with no penalty. And another big reason we may not get heroes in multiple spheres is that some characters really only fit well into one or two spheres such as Boromir who's two versions seem perfect already.\n\n \n\nWhat do you all think, will we get more versions of certain heroes and do you want more versions??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=998569","commentId":998569,"userName":"Noccus","timestamp":1393582103,"content":"Well if they can fit Pippin in Lore everything is possible.\n\nSo I'd say yes, in time we might see a hero version of everybody and their once named family members in the book in every sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=998602","commentId":998602,"userName":"Kcall07","timestamp":1393586468,"content":"I definitely want more versions. I was very disappointed with the amount of new heroes in the next saga expansion. I wrote in an earlier post about how I felt ffg had focused too much on covering every aspect of middle earth at the expense of the feel of the core story. Legolas is a fantastic card, but after playing him so many times since the game came out I certainly wouldn't say no to a new option. Most of the core characters fit thematically in different spheres and I feel it would increase the customisation options dramatically. Star Wars has already done this to great effect and it's only had one cycle. I know a lot of people spoke out against this after the some of the duplicate characters in the past and it's clear the designers listened. With so many key saga quests coming up - hunting the orcs, helms deep etc. I want as many ways to play these with the actual heroes involved. Not just a 32 starting threat three hunters deck (the only current option).\n\nEdited February 28, 2014 by Kcall07"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=999118","commentId":999118,"userName":"Narsil0420","timestamp":1393624842,"content":"I think we'll see a new Legolas and Gimli (if not Aragorn also) in the first Two Towers expansion which is why we're probably not going to get them in The Road Darkens"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=999391","commentId":999391,"userName":"Catastrophic09","timestamp":1393650885,"content":"Hmm good thoughts, yeah Noccus the spheres for the hobbits were somewhat surprising so who knows what we could get! And yes options are very nice, a version of The Three Hunters that synergises would be epic and almost expected in the TT. Time will tell!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=999760","commentId":999760,"userName":"Kcall07","timestamp":1393697762,"content":"Perhaps we will, but if the only hero in the road darkens is gandalf, like some have speculated, then there will never be a saga boromir.\n\nI hope the core heroes get some acknowledgment, like attachments that work well with their abilities. Anduril, lothlorien gifts, etc. Although if they are all just boons that will be very disappointing too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1000362","commentId":1000362,"userName":"Scroll Lock","timestamp":1393776427,"content":"I hope we will have 4 heroes in TT. But I don't expect it. Since now, sagas will probably only have 1 hero. Legolas, Gimli, Aragorn and Erkenbrand/Théoden in 1 box would be too awesome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1000562","commentId":1000562,"userName":"Kcall07","timestamp":1393794536,"content":"I think you are right, probably one hero per box from now on which is a shame. Otherwise, even if they wanted to avoid duplicate heroes in the road darkens they could have included elves like Haldir, Arwen or Galadriel. I hope I'm wrong, or my anticipation for the saga expansions would decrease."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1000639","commentId":1000639,"userName":"chuckles","timestamp":1393800462,"content":"Will we get a different sphere for each hero? I doubt it. Not sure if the game last long enough, maybe it could happen for the most well loved heroes. (+1 for wanting alternatives for The three Hunters)\n\n \n\nDo I want. Yes - though not at the expense of getting totally new heroes. I wouldn't want more than a couple of repeated heroes per cycle... of course if FFG reverted to having more hero's in the Saga boxes ...still gutted about only having only one new hero in the Saga box. I know it wasn't promised... but there was a precedent and expectation... and now disappointment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1001706","commentId":1001706,"userName":"Catastrophic09","timestamp":1393886971,"content":"Ugh I really hope we don't only get one hero from now on in Saga's because it seems we would never get The Three Hunters unless they were all in one box\n\n \n\n> I hope we will have 4 heroes in TT. But I don't expect it. Since now, sagas will probably only have 1 hero. Legolas, Gimli, Aragorn and Erkenbrand/Théoden in 1 box would be too awesome.\n\nand this does almost seem too good to be true but the only way to get heroes like Erkenbrand who we haven't even seen yet or finally another version of Legolas or Gimli is in the Saga's which can pump out several heroes. The one hero per AP just doesn't seem enough to cover the ground of epic heroes and this game probably only has a couple years left..\n\n \n\nBut anyways if Gandalf is the hero for Road Darkens that could be why he's the only hero but also what will they do for the Sagas that are separate from Frodo and Sam, will there still be a Fellowship Sphere hero in those or two or three normal playable heroes.. that could be good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1001772","commentId":1001772,"userName":"Dain Ironfoot","timestamp":1393889821,"content":"> I hope we will have 4 heroes in TT. But I don't expect it. Since now, sagas will probably only have 1 hero. Legolas, Gimli, Aragorn and Erkenbrand/Théoden in 1 box would be too awesome.\n\nno one should have assumed we would always have four, and we shouldn't assume that - going forward - there will always be 1.\n\n :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1001778","commentId":1001778,"userName":"Narsil0420","timestamp":1393890015,"content":"My guess is for the TT Aragorn story box, Aragorn as a Fellowship hero Legolas Lore and Gimli Leadership. You heard it here first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1002200","commentId":1002200,"userName":"lleimmoen","timestamp":1393930437,"content":"It all depends on how long the game runs. Saga is problematic in the hero distribution because the designers want to stick with the story, and also the fact the box will be playable with the core-only. So, as for the Road Darkens, the decision was rather straight-forward, Aragorn, Legolas, Gimli are all in the core set, thus there was no reason for them to appear, since the design team does not want a new player to have two boxes in his collection and have a hero in both, then Boromir was the only other logical option but he has already appeared as a hero in two other sets, so here came problem with long-term players, and Boromir will likely appear as an ally because old-time players do not want a third hero copy and new players need at least one of the character.\n\nFuture sagas may as well gain more heroes again, I would think Théoden and Éomer might enter again in Saga 3 (either hero or ally) and Treebeard should be obvious. But probably no Éowyn then since she is in the core box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1002446","commentId":1002446,"userName":"Kcall07","timestamp":1393950548,"content":"I understand why the decision was made, I just disagree with it. Saga only players (if there is such a thing) will already have four boxes by the time the road darkens comes out. Lots of time to get accustomed with the idea of a second version of a hero. More heroes increases the boxes playability, not diminishes it. The hobbits that came in the black riders worked perfectly together and with the quests. The heroes from the core set, great though they all are, will not. And besides, some thought must also be given to long term players, who have been using the same versions of Legolas and Gimli for years now.\n\nAll I know is that, personally speaking, the road darkens was my most anticipated expansion for this game, and now my enthusiasm has decreased significantly. And to think well only get one saga hero per box is a bleak thought indeed, going forward. I'm sure I'm not alone in feeling this. That is why I disagree with the decision."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1002471","commentId":1002471,"userName":"Dain Ironfoot","timestamp":1393951821,"content":"> And besides, some thought must also be given to long term players, who have been using the same versions of Legolas and Gimli for years now.\n> \n> All I know is that, personally speaking, the road darkens was my most anticipated expansion for this game, and now my enthusiasm has decreased significantly. And to think well only get one saga hero per box is a bleak thought indeed, going forward. I'm sure I'm not alone in feeling this. That is why I disagree with the decision.\n\n \n\nwho says thought wasn't given by the designers?\n\n \n\nwe could/probably will get ally versions of boromir, legolas, and gimli at some point in the sagas. we might even get hero versions of them. no one knows (except the designers) what's in store for the long term.\n\n \n\nat the same time, i'm totally cool with getting new heroes, that don't already have incarnations in the game. someone earlier mentioned treebeard, that would be awesome. others have mentioned a second version of theoden. there are still 4 boxes to go - and i'm sure we'll get a healthy mix of heroes after the road darkens. there are lots of characters left to represent the struggles of the free peoples of middle earth.\n\n \n\ni understand the disappointment in only 1 hero in this box - though i don't share it - but to take disappointment and assume we won't be getting more than 1 hero, or there's been no/little future thought to the sagas seems premature to me.\n\nEdited March 4, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100248-multiple-hero-versions-for-each-sphere/?do=findComment&comment=1002519","commentId":1002519,"userName":"Tracker1","timestamp":1393954460,"content":"There is always the possibility that the last hero in the Road Darkens will have 4 versions. Gandalf in each sphere! There is my prediction."}]}