{"url":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/","title":"Solo Play - A House Rule Variant I&#039;ve Found I Like","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000176","commentId":1000176,"userName":"FeloniusBard","timestamp":1393751273,"content":"So, first post ever on these forums . . . \"Long time reader, first time poster, yada yada yada.\"  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAnyway, having really just gotten into the LotR LCG in the last four months, I've really struggled with the idea that to really enjoy \"solo\" play, you have to play two-handed. \n\n \n\nI really, really don't want to have to play two-handed, for a number of reasons. First, there's the time involved to build a second effective deck (it's bad enough to come up with ONE full deck concept I really like, and fits thematically---yes, I'm one of those crazy thematic players who simply can't abide putting Eowyn in with a bunch of dwarves). Two-handed also takes longer to actually play, since you're constantly having to switch hands, you have to track two separate threat trackers, two separate card draws, etc. \n\n \n\nSo as an experiment, I came up with a house rule variant for solo play that I've found incredibly enjoyable, and thought I'd share it. Granted, it's not as \"pure\" as just playing two-handed, and I haven't really analyzed its effects on the action economy and game balance. But regardless I find it incredibly fun, and it eases up a bit on the absolute pain of the harder (difficulty 5+) quests. \n\n \n\nThe basic concept is as follows: \n\n \n\n 1. Add a fourth hero to your hero pool. This hero gains a resource normally, and in all respects acts just the same as all the other heroes. \n 2. Your starting threat level is equal to the 2 highest threat heroes plus the lowest threat hero. E.g., with Aragorn, Elrond, Spirit Glorfindel, and Legolas, you'd have a starting threat of 30 (13 for El, 12 for Ar, 5 for Glor; Legolas is ignored).\n\n 3. Search your player deck for one non-unique ally costing 3 or less resources, and belongs to the same sphere of influence as one of your heroes. Put that ally into play at no cost.\n\n 4. All encounter effects / card effects read as if there is only a single player.\n 5. You draw the standard number of cards (6) for one player.\n 6. Now here's the most important part --- most of the time in single player, the \"First Player\" token doesn't come into play. So what I do instead is swap out the first player token for a coin of some kind, something with heads / tails (I have an oversized coin my wife picked up at a convention a few years ago that works perfectly). What happens is on each turn, the coin alternates from \"heads\" to \"tails\" / \"tails\" to \"heads.\" Depending on which side of the coin you're on, the number of cards you draw from the encounter deck changes from 1 to 2. Typically I treat \"heads\" as the \"green light\" side of the coin, and only draw one encounter card. Tails is the \"red light\" side of the coin, and I draw 2 encounter cards when tails is showing. \n 7. The same number of cards to draw also applies for the player during the resource phase---when the coin is on heads, as a player I only get to draw one card. When the coin is tails, I get to draw two cards from my deck. To mitigate the slightly faster card draw, I'll typically raise the minimum deck size when I use this variant to 60 cards.\n 8. Also, when the coin is on \"heads,\" any cards with \"ranged\" effects can be put to use (e.g., Bard the Bowman). \n\nThe coin flip happens during the resource phase immediately following the player card draw. So for example, on the first turn, the player would draw their card normally during the resource phase, and place the coin into play on the \"heads\" side. For the first round, you'd only draw one card from the encounter deck.\n\n \n\nAt the start of the next turn (turn 2) during the resource phase, as a player you'd draw one card, since \"heads\" is showing. Then you'd immediately flip the coin over to \"tails.\" During the turn 2 questing phase, you'd draw 2 encounter deck cards. Then during the resource phase of turn 3, you'd draw 2 cards into your player deck, then flip the coin back to \"heads.\" \n\n \n\nThis has a couple of main effects that I like: \n\n \n\n * It's much easier to build multi-sphere decks that can handle more situations (i.e., not having any healing because you just can't fit in any Lore cards into your deck). \n * It adds a new dimension to the questing phase. When the coin is on the tails / \"red light\" side, there's a definite ramp up in tension.\n * It makes it much, much easier to not get totally brutalized on your first turn by a bad draw.\n * If you want to use your solo deck in a multiplayer game, it's much easier to simply remove the 4th hero and tweak a little. When you go back to solo play, add back the 4th hero and any removed cards. \n\nIf there's any drawbacks, it's that this variant does make it easier than normal to bring out neutral cards, especially Gandalf, since you now have 4 resources collected each turn instead of 3. But in my experience, this isn't a huge deal, I've found that it raised my win ratio on the harder quests from around 15%, to around 45%, which was exactly what I wanted it to accomplish. \n\n \n\nIf you try this out and it feels too \"easy,\" then you can simply tweak any of the house rules to suit your desired level of difficulty. \n\n \n\nFor example:\n\n \n\n * Ignore Rule 3 (i.e., only add the 4th hero; do not add the free ally).\n * Don't alternate the player card draw; only draw 1 card during resource phase.\n * Start the game off on the \"tails\" side of the coin, meaning you'll draw two encounter cards during the first questing phase. \n * Treat all encounter card effects as if there were two players.\n * Keep the fourth hero, but only allow him / her to be used during the \"tails\" side of the coin.\n * The fourth hero only collects resources during a \"tails\" side resource phase. \n * The fourth hero can use all of his / her abilities, and your company is treated as having access to the fourth hero's sphere of influence, but the fourth hero never collects resources. In essence, you treat the fourth hero's sphere of influence as a \"song\" card, attached to one other hero of your choice.\n\nEdited March 2, 2014 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000192","commentId":1000192,"userName":"MyNeighbourTrololo","timestamp":1393754631,"content":"Cards are drawn not during the refresh phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000270","commentId":1000270,"userName":"shoreless","timestamp":1393767530,"content":"Anyways. This is interesting, Bard, and good work! Looks like you've put a lot of thought in to this. I may have to give it a whirl myself (I like the coin idea particularly).\n\n \n\nPlease, I'm curious: did you try easy mode [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/easy-mode/LOTR_Easy_Mode.pdf] and dislike it? Your variant is an interesting critique to it, whether you meant it to be or not. Thanks for sharing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000486","commentId":1000486,"userName":"FeloniusBard","timestamp":1393785839,"content":"You're right, thanks Trololo, I've updated the rules verbiage to show the card draw during resource phase.\n\n \n\nShipwreck -- No, I've never seriously considered easy mode. The whole point of these house rules is to minimize the amount of \"deck fiddling\" I have to do to port decks between solo play and multi-play. Using the \"easy mode\" rules just adds one more layer of fiddly-ness, since I now have to go through each encounter deck before hand to remove the appropriate cards. \n\n \n\nI really just wanted to have a viable way to play ONE deck without beating my head against the wall, without having to create a second player hand or change the encounter deck for \"easy mode.\" Plus, I want to experience all of the encounter card effects as written so I can understand how to counter them when I'm playing multiplayer. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000543","commentId":1000543,"userName":"legolas18","timestamp":1393791881,"content":"This is interesting. I never liked solo play with one deck, because it made easy quests too easy and hard quests too hard. But maybe I'll try this out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000678","commentId":1000678,"userName":"Glowwyrm","timestamp":1393802742,"content":"Very cool idea.  I usually play two-fisted, but I like solo sometimes.  This sounds like it unlocks some of the extra synergy available in two player but with only one deck.  One thing I like is that you make use of ranged in a solo game.  Maybe characters with sentinel could get plus one defense on a red light turn, or something like that.  It's an interesting approach to the game and could be a fresh way to approach some older scenarios solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000894","commentId":1000894,"userName":"booored","timestamp":1393822169,"content":"this house rule looks much like any other to me.. a way to make the game less challenging. Still more power to you .. if you like it play it.. others may try it and like it as well...\n\n \n\nMy Initial Thoughts (not having tried it)\n\n * Saying Solo play with 1 deck is unplayable is ridicules. It isn't, in fact I feel it is far and away a better experience than 2 handed. Witch is just fiddly and annoying unless you play on a computer and that defeats the entire point of a physical card game in the first place. Every quest is very beatable 1 handed, it just requires deeper deck building skills and piloting skills. Now yes some quests do not fire as well solo.. but that can be said for any amount of hands, including 2. It is cool if you do not like solo, but not only is it playable.. it is the preferred way to play for many people.\n\n * Changing the resourcing and threat stuff will DRASTICALLY effect the game, Threat is there to limit heroes who have the strongest abilities in the game. Your stating with a 4th massively powerful card, a 4th resource so you can play even more massively powerful cards on turn 1 and you have a free 0 cost fetch of a unique card.. eg a massively powerful card. This doesn't even take into account dropping 4 costs every turn, dropping 5 / 6 drops every 2nd turn and STILL getting a cheaper drop on turn 1 of that 5 cost 2 turn drop. Seriously... this is so crazy overpowered I can not really see how there is even a game left here.\n\n * The massive card draw is just insane. There is no justification for this in any way apart form you wanting to have a larger deck and burn though it with out building the deck design to do that your self. Still if you are going to play 2 decks, say 60-70 cards.. this could be a needed requirement. Not sure how I feel about this.. would have to test it.\n\n * I think the coin idea is a pretty good one. I like that the \"next player\" text flips it early and adds those cards back into solo. FYI, First and Last player both activate in solo already.. only \"next player\" fizzles. In fact I think this is a pretty great idea and if you took out some of the other crazy this could be a good solo rule set.\n\nHow I would modify your rules.\n\n * up to 4 Heroes\n * 2 Combat Zones - so like playing 2 handed you retain the Ranged, Sentinel, and Optional Engagement stuff. The heroes can be spread out as you like in those 2 zones.\n * You only have a single threat level.. lets say max of 55, so you still have to worry about threat and the hero choice is still a painful one between what you want and what you can afford.\n * Coin determines witch \"zone\" is the active zone. When ever the text \"Next Player\" appears flip the coin. The card effects the zone the coin now points to.\n * When a coin has activated a certain zone, allies can only be played into that area, but resources can be used to pay by all Heroes.\n * Only the active zone receives resources, but card effects can give them resources as normal.\n * Always draw 2 cards into your hand at the end of a turn\n * Always draw 2 encounter cards every time you quest.\n\nI think you have some good ideas with this coin thing. I know where your cumming from here as holding 2 hands and using 2 draw decks and 2 threat meters is a MASSIVE pain in my ass and a big reason I hate playing multihanded outside of lackey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1000931","commentId":1000931,"userName":"FeloniusBard","timestamp":1393827608,"content":"> this house rule looks much like any other to me.. a way to make the game less challenging. Still more power to you .. if you like it play it.. others may try it and like it as well...\n> \n>  \n> \n> My Initial Thoughts (not having tried it)\n> \n>  * Saying Solo play with 1 deck is unplayable is ridicules. It isn't, in fact I feel it is far and away a better experience than 2 handed. Witch is just fiddly and annoying unless you play on a computer and that defeats the entire point of a physical card game in the first place. Every quest is very beatable 1 handed, it just requires deeper deck building skills and piloting skills. Now yes some quests do not fire as well solo.. but that can be said for any amount of hands, including 2. It is cool if you do not like solo, but not only is it playable.. it is the preferred way to play for many people.\n> \n>  * Changing the resourcing and threat stuff will DRASTICALLY effect the game, Threat is there to limit heroes who have the strongest abilities in the game. Your stating with a 4th massively powerful card, a 4th resource so you can play even more massively powerful cards on turn 1 and you have a free 0 cost fetch of a unique card.. eg a massively powerful card. This doesn't even take into account dropping 4 costs every turn, dropping 5 / 6 drops every 2nd turn and STILL getting a cheaper drop on turn 1 of that 5 cost 2 turn drop. Seriously... this is so crazy overpowered I can not really see how there is even a game left here.\n> \n>  * The massive card draw is just insane. There is no justification for this in any way apart form you wanting to have a larger deck and burn though it with out building the deck design to do that your self. Still if you are going to play 2 decks, say 60-70 cards.. this could be a needed requirement. Not sure how I feel about this.. would have to test it.\n> \n>  * I think the coin idea is a pretty good one. I like that the \"next player\" text flips it early and adds those cards back into solo. FYI, First and Last player both activate in solo already.. only \"next player\" fizzles. In fact I think this is a pretty great idea and if you took out some of the other crazy this could be a good solo rule set.\n> \n> How I would modify your rules.\n> \n>  * up to 4 Heroes\n>  * 2 Combat Zones - so like playing 2 handed you retain the Ranged, Sentinel, and Optional Engagement stuff. The heroes can be spread out as you like in those 2 zones.\n>  * You only have a single threat level.. lets say max of 55, so you still have to worry about threat and the hero choice is still a painful one between what you want and what you can afford.\n>  * Coin determines witch \"zone\" is the active zone. When ever the text \"Next Player\" appears flip the coin. The card effects the zone the coin now points to.\n>  * When a coin has activated a certain zone, allies can only be played into that area, but resources can be used to pay by all Heroes.\n>  * Only the active zone receives resources, but card effects can give them resources as normal.\n>  * Always draw 2 cards into your hand at the end of a turn\n>  * Always draw 2 encounter cards every time you quest.\n> \n> I think you have some good ideas with this coin thing. I know where your cumming from here as holding 2 hands and using 2 draw decks and 2 threat meters is a MASSIVE pain in my ass and a big reason I hate playing multihanded outside of lackey.\n\n \n\nThanks for the comments! I don't think solo play rules-as-written is unplayable . . . I personally just tend to find it unenjoyable, for the simple fact that on the harder quests (difficulty 5+), 8 times out of 10 playing solo RAW, I lose in the first 2-3 rounds, because I simply didn't have enough firepower at my disposal. \n\n \n\nSo far, it doesn't appear to be too overpowered for the higher-difficulty quests. I still consistently lose half the time, I'm just not losing 80+ percent of the time. For the easier quests (4 and under), I'll generally toss out Rule 3, and / or start the coin on \"tails.\"\n\n \n\nThe overall resource balance actually isn't as out of whack as I think you're envisioning, booored. In a full \"two-handed\" config, you'd be getting six resources each turn anyway, even if you have to spread them out over two separate hands and six heroes, instead of 4 resources for four heroes. The extra ally in Rule 3 is in some ways the bigger \"kicker\" in terms of scaling the difficulty. You get extra questing points / attack / defense, and an instant \"chump\" blocker out of the gate at no cost. Even with the extra hero, as soon as you hit \"tails,\" or get a couple of surges on consecutive turns, you're still scrambling to keep up.\n\n \n\nI've actually seriously considered implementing the \"combat zones\" idea, where two of the heroes reside on opposite \"zones,\" allowing ranged / sentinel to interact with them.\n\n \n\nIt probably does need a little tweaking to get the difficulty scaling right (e.g., after some playtesting, I'm beginning to think you should start in \"tails\" mode all the time), but to me it's not that far off.\n\n \n\nAnd I enjoy this variant more than enough that I simply don't see myself playing \"two-handed\" pretty much ever. \n\nEdited March 3, 2014 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1001195","commentId":1001195,"userName":"MechaBri.Zilla","timestamp":1393861890,"content":"The great thing here is that the game belongs to you and you can do what you like with it.\n\n \n\nPersonally, I think the thought that went into this is pretty amazing.  I might give it a shot.  I'm still sort of a newb, and don't get to play a ton because I have to work it in around baby feeding schedules at the moment.  For now I'll probably keep up with RAW, until I feel like I have a good grip on them so that I can understand what the changes do better.\n\n \n\nI'm also not a huge fan of playing two handed... Primarily because it's best if I can try to finish the game in a 30-45 minute window, after that I usually have to leave it for a bit, and find it difficult to remember where I was in the game.  Playing two handed seems to extend the play time quite a bit for me.  But, as I'm still new, a lot of that will probably go away as I learn the cards and strategies better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1001722","commentId":1001722,"userName":"Catastrophic09","timestamp":1393887958,"content":"Very nice idea! I think you've found a cool balance between 2 handed solo and pure solo.  The problem I have with solo is that you only reveal one encounter card each time and the encounter deck really can't synergize and work against you and you don't see many of the cards.  So this lets you see more every other turn and is balanced out with an extra hero, I'll have to give this a try next time I play.  And yes 2 handed can take more time but I do like the synergies that come from two full hands and the more you do 2 handed the more natural it becomes but this is a great idea for those who don't like 2 handed! Some house rules like this can be epic and if it increases how you enjoy or experience the game, do it!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1002651","commentId":1002651,"userName":"Boris_the_Dwarf","timestamp":1393961425,"content":"I'm a solo player most of the time and I've never played two-handed, except when I was testing a support deck that I thought would be fun for when my wife plays. If solo play is too challenging, I'd recommend working on deck building rather than changing the way the game is played. I love the fourth hero idea but the rest seems very complicated to me.\n\nEdited March 4, 2014 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1002882","commentId":1002882,"userName":"FeloniusBard","timestamp":1393972305,"content":"The way I've laid it out probably makes it sound more complicated than it is. \n\n \n\nAt it's simplest, it's, \"Put a coin on the table, and switch sides every turn. When it's heads, draw one card for the encounter deck and yourself. When it's tails, draw two cards for the encounter deck and yourself. Have an extra hero, and one extra ally to start.\" \n\n \n\nAll the rest is just window dressing and tweaking. \n\nEdited March 5, 2014 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1003309","commentId":1003309,"userName":"Nerdmeister","timestamp":1394004672,"content":"This actually seems quite a good solo-variant.\n\nNot that I think I will be trying it myself, but I have to give you credit for the amount of tweaking you have done to make this seem like truly playing it solo but with a bit more oomph on both player and encounter side. Many times in solo I get the feeling I am not truly getting the challenge, that the encounter deck is meant to pose (unless the game drags on perhaps). Maybe this mode should be called solo+ or playing 1½-handed? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nA small point I would like to make is how you assume that it is just easy to return the deck to 2-player mode by removing a hero and taking out some cards. When building decks for 2-player it is the general consensus that the 2 decks are built together; each specializing on certain aspects of the game, whereas a solo deck will usually try to cover most bases by itself.\n\nA deck that covers most bases (solo deck) doesn´t easily lend itself to be tweaked into a specialist role.\n\n \n\nOther than that small point: kudos to you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1003574","commentId":1003574,"userName":"KennedyHawk2","timestamp":1394034077,"content":"> Cards are drawn not during the refresh phase.\n\n \n\nSuper useful comment! Great feedback.\n\n \n\nAnyways...\n\n \n\nThanks for the detailed guidelines to this alternative form of play. I'll try it out this weekend as it looks fun :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nEdited March 5, 2014 by KennedyHawk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1015558","commentId":1015558,"userName":"FeloniusBard","timestamp":1395072197,"content":"So I've been playtesting this variant a little bit more, and I continue to find it more enjoyable than regular solo play. \n\n \n\nAnd it doesn't appear to be too easy, either. I went 1/4 over the weekend testing this against one of Feonix's custom scenarios (The Old Forest) . . . Even with a fairly optimized Elladan/Elrohir/Aragorn/Beravor combo, I got soundly thrashed in three straight attempts.\n\n \n\nAnd after experimenting with the \"zone\" concept, I'm definitely going to add it to the house rules. When you engage an enemy, you have to engage one \"zone\" or the other, and play off of the ranged / sentinel card effects appropriately. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1017569","commentId":1017569,"userName":"Troymk1","timestamp":1395194387,"content":"If I play Solo I play 4 handed.\n\n \n\nBut I guess I am an outlier  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=1018155","commentId":1018155,"userName":"Demoncow","timestamp":1395235421,"content":"Solo 4 handed is the way to do it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3327926","commentId":3327926,"userName":"roblyon","timestamp":1526062230,"content":"When you say Solo 4 handed, you mean 4 heroes, right . . ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3328019","commentId":3328019,"userName":"Wandalf the Gizzard","timestamp":1526064814,"content":"> 42 minutes ago, roblyon said:\n> \n> When you say Solo 4 handed, you mean 4 heroes, right . . ?\n\nHe means four different decks+heroes, so that would be twelve heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3328072","commentId":3328072,"userName":"roblyon","timestamp":1526066367,"content":"Holy crap!  Need to graft on a second brain for that!\n\nTrying 4 heroes here currently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3328372","commentId":3328372,"userName":"Wandalf the Gizzard","timestamp":1526080048,"content":"Well, technically three extra brains. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nJust to clarify, that's four different decks, as if you were four people each playing their own deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3328515","commentId":3328515,"userName":"roblyon","timestamp":1526089537,"content":"Right.  12 Heroes.  No thanks.\n\n \n\nBut I am about to experiment with LotR Highlander.  I've got all of the cards and will take one of each player card and make a single ongoing draw deck.\n\n \n\nWill take 4 heroes.  One from each race that left Rivendell:  Elven, Human, Dwarven and Hobbit, also representing each of the 4 spheres.\n\n \n\nAnd see what happens.  I did this successfully with Magic.  It's a highly random, easy to run format and will intro me to all the cards.\n\n \n\nSome HRs will of course apply.  Will figure those out as I go along.\n\n \n\nI see CoC Highlander has been explored already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3329144","commentId":3329144,"userName":"Eryx_UK","timestamp":1526151733,"content":"For solo play I run four heroes, but I don't count the threat for the lowest hero, and each hero starts with 2 resources. I also don't bother with shadow effects when playing solo because they are too strong for solo in my opinion. It seems to be nicely balance out the solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3329152","commentId":3329152,"userName":"roblyon","timestamp":1526152017,"content":"Thanks for the tip. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100367-solo-play-a-house-rule-variant-ive-found-i-like/?do=findComment&comment=3329630","commentId":3329630,"userName":"Hannibal_pjv","timestamp":1526205605,"content":"I give you one tip for the treath.\n\none hero normally have a treath level of 7-9. The starting treath with four heroes would be H1+H2+H3+H4-7\n\n(the amount that get reduced should be tested. Maybe it should be 6 or 5 to reduce the benefits of having four heroes... but that would require playtesting by experient player that normally play solo one handed with normal three heroes)\n\nso you get one ”free” hero, but if you use expensive heroes, your starting treath is higher than using cheap heroes. So you can not game the system, by using three expensive and one cheap, like in this version.\n\ni like the two zones idea! Otherwice this seems too easy, but have to test this out."}]}