{"url":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/","title":"VOI To Catch an orc Stage 2B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=999635","commentId":999635,"userName":"jjeagle","timestamp":1393687769,"content":"I think I know the answer to this one, but what do people think?\n\n \n\nStage 2B of To Catch an Orc reads: \"Response: After questing successfully, cancel all progress that would be placed on this stage. Then, place 1 time counter on this stage. Or, if Mugash is in play, advance to stage 3.\"\n\n \n\nMy interpretation of the \"Then\" clause [see the \"Ered Nimrais\" thread for lengthy discussion and official ruling] is that, if you have quested successfully but were not going to place any progress on the stage (because of an active location), therefore the \"Then\" clause will fail because no progress has been cancelled. Does this sound right? It passes the \"make things harder for the player\" test."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=999712","commentId":999712,"userName":"Tracker1","timestamp":1393693941,"content":"I have played it that progress must be placed on the quest cards, so if you quest sucessfully but only place tokens on the active location then you do not add a time token. This seems the way it was intended, and yes it makes it very difficult, since some locations have 6 quest points to get through. For solo, I have needed to be prepared to quest for over 10 will on the 2nd round. Losing time tokes is the worst thing that can happen during this stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=999714","commentId":999714,"userName":"jjeagle","timestamp":1393694078,"content":"Good, glad we are in agreement!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000284","commentId":1000284,"userName":"PsychoRocka","timestamp":1393769127,"content":"It does just say after questing successfully though so does it matter if tokens are placed on a location or the quest itself? Seems to me either way you get a time counter, that's how I've been playing at least.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000288","commentId":1000288,"userName":"PsychoRocka","timestamp":1393769313,"content":"It seems to say cancel all progress tokens because the quest card does not even use progress tokens, it only cares about time counters and whether or not mugash is in play. Would love to see an official answer for this"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000299","commentId":1000299,"userName":"Tracker1","timestamp":1393770594,"content":"If questing sucessfuly was all that mattered that would make it much easier. Curious to know which way is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000372","commentId":1000372,"userName":"GrandSpleen","timestamp":1393777213,"content":"Yeah, looks confusing.  It could easily have said, \"After placing progress on this stage....\" but they chose the other wording.  Has anyone sent in for a ruling?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000786","commentId":1000786,"userName":"Tracker1","timestamp":1393811559,"content":"We should definitely get a ruling for this. This can make a really big difference during this quest stage. Most decks will be able to quest successfully, but it take a serious willpower deck to always put progress on the quest stage. Once the time goes off early in the game, you will probably never quest successfully again, and it is pretty much game over, that plus encounter cards potentially removing tokens makes it a really tough feat to accomplish. I'm fine if that's how it should be played, since that's the way i have been playing it, but it just limits the types of decks I will try against it.\n\nI have sent in a few rules question already, anyone else care to bug Caleb?\n\nDo you think developers ever read these forums? Would be real nice if they just ironed this stuff out rather than us all sit around and speculate. It would be a real nice thing for them do especially right after the AP or expansion was released, they should expect to see players questions at that time?\n\nEdited March 3, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000859","commentId":1000859,"userName":"PsychoRocka","timestamp":1393818414,"content":"It really does make a massive difference! I can ask Caleb if you tell me how? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\nIf you do need to place progress on the actual stage I fear I'll never beat the quest =( \nGot close to beating it last night playing that you just have to quest successfully.... killed his single guard (playing two handed) and had the staging area more or less clear only to have Orc Hunter and Take Cover surge together into four cards on the turn Mugash himself came out (asfaloth got him out via search, then I quested), leading to an unsuccessful questing phase, time counters running out and me getting utterly smashed by half the enemies in the deck coming out all at once.....\nIt seems I was not quiet enough while hunting the fearsome orc captain and ended up alerting his entire personal guardwho proceeded to feed me to orc hounds"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1000956","commentId":1000956,"userName":"jjeagle","timestamp":1393831868,"content":"I've put in a request - will report back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1001007","commentId":1001007,"userName":"PsychoRocka","timestamp":1393838059,"content":"Sorry I meant to say something in regards to the last part of your post tracker. Really good idea, considering how the game is only getting more complex it would be so good to have someone from ffg after each AP or expansion is released hang out on the forums for a bit so that any rules questions could be quickly clarified. In the forums there could be like an \"official rulings\" or \"ask the developers\" section!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1001261","commentId":1001261,"userName":"jjeagle","timestamp":1393865745,"content":"Official answer received: it is the \"harder\" interpretation.\n\n \n\n\"You are correct about stage 2B, the \"Then\" clause is conditional on canceling progress that would be placed \"on this stage.\" Therefore, the players must place at least 1 progress onto the quest in order to cancel that progress and add 1 time counter. This wording was deliberate to make the choice of whether or not to travel to a location, and which location to travel to, a tense decision. If you quest successfully, but all of your progress is absorbed by the active location, then you will not be able to add a time counter to the quest.\"\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1001765","commentId":1001765,"userName":"GrandSpleen","timestamp":1393889349,"content":"Good clarification, thanks for that!  Guess I haven't truly \"won\" yet.. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002033","commentId":1002033,"userName":"PsychoRocka","timestamp":1393911699,"content":"Wow... I am so shocked at that ruling, easily the most badly worded mechanism so far in my opinion. Just wow.... the quest is pretty much impossible unless you make a deck utterly and specifically for it that is just the ultimate in questing and willpower... and even then you could easily lose. I'm pretty dissapointed by this, makes me feel like the quest is badly designed, especially when every other aspect of it works so well. I mean of course you should have to change your deck/decks up fairly often to take on new quests and mechanisms, I had to gut like a third or maybe more like quarter of both my decks for Voice Of Isengard overall (for all three quests) but you should not have to make a deck specifically to beat one quest or just be doomed to never win it...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002036","commentId":1002036,"userName":"PsychoRocka","timestamp":1393912081,"content":"Feels wrong thematically as well, questing unsuccessfully = you weren't sneaky/careful enough and have been discovered. Questing successfully is like you have gone further and further into the mountain range successfully avoiding patrols in your search etc. Questing successfully but only putting progress on the active location is getting caught? How did you not just hide somewhere in that location considering you made \"progress\"...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002097","commentId":1002097,"userName":"jjeagle","timestamp":1393917099,"content":"> Wow... I am so shocked at that ruling, easily the most badly worded mechanism so far in my opinion. Just wow.... the quest is pretty much impossible unless you make a deck utterly and specifically for it that is just the ultimate in questing and willpower... and even then you could easily lose. I'm pretty dissapointed by this, makes me feel like the quest is badly designed, especially when every other aspect of it works so well. I mean of course you should have to change your deck/decks up fairly often to take on new quests and mechanisms, I had to gut like a third or maybe more like quarter of both my decks for Voice Of Isengard overall (for all three quests) but you should not have to make a deck specifically to beat one quest or just be doomed to never win it....\n\n \n\nI don't agree with you here. Firstly, I think the wording is pretty clear. Secondly, it is beatable without specific deck-building - I have beaten it with an unchanged Gondor deck from the ATS cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002161","commentId":1002161,"userName":"PsychoRocka","timestamp":1393926259,"content":"I respect your opinion but to me it definitely states \"after questing successfully\" and only adds the whole \"remove any progress tokens placed on this stage\" because it is a quest card that does need, interact with or in any way use progress tokens for anything. And doesnt infer or state that progress tokens must be placed for this to happen simply that you must quest successfully.\n\nAs much as the other ruling is official and i have to accept it, Im sticking to my guns; it's totally worded in a way that supports my interpretation. We will have to agree to disagree! =)\n\nThe only thing I will concede is that I suppose the concept is that unless you put progress on the quest itself you have thematically not made progress in your actual search and have instead only explored a location (even though y'know your kinda searching for him IN these locations... That have search.. And bring him into play......)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002186","commentId":1002186,"userName":"Tracker1","timestamp":1393928577,"content":"Well thematically i think it works the way they ruled it. If you do not clear the active location to make progress on the quest stage, then technically you did not \"really\" quest successfully for the purpose of searching for Mugash. If you quest successfully and just put progress on the active location but not the quest, then you really did not quest successfully for the purpose of the quest and maybe you are stuck in the mountains at the end the end of the round which makes it easier for you lose time. When time runs out you are attracting more attention to yourself and it gets more difficult. I like it and it makes theme and storyline richer, it should be a challenge to find him.\n\n@phycorocka. I have not tried in 2 or more player game, but one hand solo i have beaten it with a few different deck build, and it is one of my favorite new quests because of the difficulty, even when I think I have control of the board things can go drastically wrong. I think they did an excellent job with this quest and it has lots of replayability, since mugash and/or his guard or both can show up after any successful search, that adds a lot of tension to the game, and most times I dread flipping those cards early in the game, but I have even had some victories when Mugash is the first card drawn.. But you are right it is going to take certain types of decks to beat this. But we have a few options to choose from. If you are playing 2 handed i would think one Spirit deck and a tactics deck should work.\n\nIn terms of the wording on the card, I was a little puzzled at first, but I did interpret it the way the designers intended, but it looks like a number of other players thought otherwise, so the card could have been worded better to avoid this confusion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002596","commentId":1002596,"userName":"Mndela","timestamp":1393958323,"content":"I think the words of the text could be better, true. It must avoid bad interpretations. Each player have to read faqs or forums to know the correct way.\n\nWell, but it is not a very bad point.\n\n \n\n \n\nOne theme has been released: specific decks. I like the idea. Since VoI to the future, each scenario could demand specific decks. Why not? The dificult level must increase, the first age of CORE and Mirkwoods is past, a new age is coming, you must be ready for each step you must across...., muuuaaahahaha\n\nPD: the Progressions Series is more important than only a fan way to play.\n\nEdited March 4, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002901","commentId":1002901,"userName":"GrandSpleen","timestamp":1393973115,"content":">  \n> \n> One theme has been released: specific decks. I like the idea. Since VoI to the future, each scenario could demand specific decks. Why not?\n\n \n\nI don't like the idea at all... you can make things difficult without invalidating a variety of deck archetypes.  This approach to quest design limits your freedom to explore with a variety of decks, instead making deckbuilding an exercise in finding the right \"key\" to each \"lock.\"\n\n \n\nIt also really closes the game off to new players, and restricts gameplay on a given night.  If you want to bring Lotr LCG to your game night and play with some folks who haven't played before, good luck spending 2 hours coming up with 4 decks that can beat To Catch an Orc and then go and stand a chance against Druadan Forest followed by Peril in Pelargir.  No, that kind of quest design just limits your game night choices and forces you into playing a bunch of similar quests.  If you want to experience diversity in quest types, the setup time required to make adequate decks is enormous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1002924","commentId":1002924,"userName":"PsychoRocka","timestamp":1393974398,"content":">  \n> \n> >  \n> > \n> > One theme has been released: specific decks. I like the idea. Since VoI to the future, each scenario could demand specific decks. Why not?\n> \n>  \n> \n> I don't like the idea at all... you can make things difficult without invalidating a variety of deck archetypes.  This approach to quest design limits your freedom to explore with a variety of decks, instead making deckbuilding an exercise in finding the right \"key\" to each \"lock.\"\n> \n>  \n> \n> It also really closes the game off to new players, and restricts gameplay on a given night.  If you want to bring Lotr LCG to your game night and play with some folks who haven't played before, good luck spending 2 hours coming up with 4 decks that can beat To Catch an Orc and then go and stand a chance against Druadan Forest followed by Peril in Pelargir.  No, that kind of quest design just limits your game night choices and forces you into playing a bunch of similar quests.  If you want to experience diversity in quest types, the setup time required to make adequate decks is enormous.\n> \n>  \n\nYeah I really don't have the time to completely rebuild my deck every time I want to play a quest just for that quest. I already have a sideboard for both my decks of about 6-10 cards for quests where certain cards are almost useless (for example swapping out my Power of Orthancs in quests that have no condition attachments, swapping out Ancient Mathoms when playing Dunland trap and taking out Arwen/Gildor when playing quests they are Objective Allies ) which is actually quite fun, its an extension of your deck to deal with quests that are a bit more unique or require specific strategies. Having to make a deck to deal with each quest though? No thank you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1003086","commentId":1003086,"userName":"Dain Ironfoot","timestamp":1393984274,"content":"> Wow... I am so shocked at that ruling, easily the most badly worded mechanism so far in my opinion. Just wow.... the quest is pretty much impossible unless you make a deck utterly and specifically for it that is just the ultimate in questing and willpower... and even then you could easily lose. I'm pretty dissapointed by this, makes me feel like the quest is badly designed, especially when every other aspect of it works so well. I mean of course you should have to change your deck/decks up fairly often to take on new quests and mechanisms, I had to gut like a third or maybe more like quarter of both my decks for Voice Of Isengard overall (for all three quests) but you should not have to make a deck specifically to beat one quest or just be doomed to never win it....\n\ni played this quest 3 player \"blind\" (no deck tweaking) and we won just fine.\n\n \n\nalso, i do think the wording is clear (but perhaps, could be clearer) - you cannot cancel progress that would be placed on the quest card if there is no progress being placed. therefore, you cannot do what the rest of the card says.\n\n \n\nmaybe it's the formal logic, conditional statement side of me (If A ---> then B; if not B ---> then not A) that helped make it clearer, i don't know.\n\n \n\ni'd wager the \"questing successfully\" part is there to negate things like legolas placing progress on the quest card - via non-questing - and that wouldn't add a time counter.\n\nEdited March 5, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1170304","commentId":1170304,"userName":"raven614","timestamp":1406321457,"content":"Another question on that same card it reads Or, if Mugash is in play advance to stage 3. So can you advance as soon as Mugash is in play like after the combat stage or do you have to do it when you have Mugash in play and quested successfully with a progress token on the quest card during the quest stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100324-voi-to-catch-an-orc-stage-2b/?do=findComment&comment=1170653","commentId":1170653,"userName":"ricedwlit","timestamp":1406340854,"content":"> Another question on that same card it reads Or, if Mugash is in play advance to stage 3. So can you advance as soon as Mugash is in play like after the combat stage or do you have to do it when you have Mugash in play and quested successfully with a progress token on the quest card during the quest stage.\n\nThe \"Or clause\" is part of the Response for questing successfully, so it needs to be during the quest stage."}]}