{"url":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/","title":"Goldenrod&#039;s questions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/?do=findComment&comment=1002917","commentId":1002917,"userName":"Goldenrod","timestamp":1393973968,"content":"Hello,\n\n \n\nFirst of all, is there a search option here, didn't found any? I don't want to scroll at 35 pages of questions each time I have a problem. I will have many questions but not at the same time, I'll have more each time I try a new quest, and right now I am only at The Hunt for Gollum.\n\n \n\nCORE:\n\n18 - Longbeard Orc Slayer: Does he also damage cards that you put as orcs with cards such as Tower Gate?\n\n \n\n23 - Sneak Attack: If you use that card to play Gandalf in the quest phase, does he goes back to your hand afterward?\n\n \n\n47 - Strenght of Will: If you used that card while traveling, fully exploring it, can you travel to another location?\n\n \n\n74 - King Spider: What hapen when that card is revealed during step 1A of a quest?\n\n \n\n81 - Wolf Rider: When this carsd is revealed as a shadow card, do you give another shadow card to the previous enemy?\n\n \n\n83 - Goblin Sniper: Can he be attacked by cards like Dunhere?\n\n \n\n \n\nTHE HUNT FOR GOLLUM:\n\n19 - The West Bank: Is the enemy base attack value is printed value? If that card is dealt as a shadow card to Hunters from Mordor with 1 clue in play, is that enemy strenght 6 or 8?\n\n \n\n21 - Hunters from Mordor: If a Hunters of Mordor is dealt a Hunters of Mordor as a shadow card, discarding clue cards in the process, does his attack value revert back to 2?\n\n \n\n22 - False Lead: Can you shuffle a clue that is still guarded in the staging area and if so, what happen to the cards guarding it?\n\n \n\n \n\nCONFLICT AT THE CARROCK:\n\n29 - Born Aloft: Ally is defending and would receive damage that would kill him, can you discard that card instead to return him to your hand?\n\n \n\n \n\nA JOURNEY TO RHOSGOBEL:\n\n52 - Parting Gifts: Can it be from 1 player to another?\n\n \n\n56 - Ancient Mathom: If a location have the same number of progress token as its quest points while in the staging area, you don't draw the 3 cards?\n\n \n\n58 - Infighting: The enemy may be engaged to another player?\n\n \n\n61 - Radagast's Request: If you heal Wilyador with Radagast, you remove him from the Game? Can you play him again?\n\n \n\n68 - Swarming Insects: \"than each other character\"... are they combined or each separated?\n\n \n\n \n\nTHE HILLS OF EMYN MUIL:\n\n76 - Meneldor's Flight: Can you return an eagle after choosing it to defend or before being killed?\n\n \n\nIs a location in the staging area that have enough progess tokens is considered explored or just the active location?\n\n \n\nTHE DEAD MARSHES:\n\nNo questions yet!\n\n \n\nRETURN TO MIRKWOOD:\n\nNo questions yet!\n\nEdited March 5, 2014 by Goldenrod"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/?do=findComment&comment=1003183","commentId":1003183,"userName":"GrandSpleen","timestamp":1393991393,"content":"Wow, that is a huge laundry list!  Many of these are answered in the official FAQ, and here is the link to that FAQ: \n\n http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ.pdf]\n\n \n\nThere is a Search option at the very tippy top of the page. Scroll way to the top and it is in the center, with a magnifying glass above and to the right of the FFG logo.\n\n \n\nI'll answer a couple of questions, but don't have time to look at them all...  do take a look at that FAQ.  It'll answer many as well.  \n\n-------------------------------------------\n\nLongbeard Orc Slayer will not damage \"orcs\" generated by Tower Gate because:\n\n\"Q: Do the Orc Guards generated by the effects of the\nTower Gate location card and the Out of the Dungeons\nquest card have the Orc Trait?\nA: No. Face down cards do not have traits unless the\ntrait is gained through a card effect.\"\n \nDunhere can attack Goblin Sniper and any other enemy in the staging area, unless the enemy's card says \"Immune to player card effects.\"  \n \nGandalf will return to your hand at the end of the phase that you play him in.  Yes, this means you can trigger his ability for only 1 Leadership resource.\n \nResolve all When Revealed effects that are revealed during setup, such as King Spider -- you'll have to exhaust characters during setup for that one.\n \nYou can only travel to one location per turn during the travel phase.  If you use Strength of Will to fully explore the location, you cannot travel again -- but you can use a card like this one: http://hallofbeorn.com/Cards/Details/Thror's-Map-THOHaUH [http://hallofbeorn.com/Cards/Details/Thror%27s-Map-THOHaUH]\n \nWhen Wolf Rider comes up as a shadow card, you do not give the original enemy an additional shadow card.\n \nOK, I'll tap out for now.. \nEdited March 5, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/?do=findComment&comment=1003378","commentId":1003378,"userName":"alogos","timestamp":1394013720,"content":"Goblin sniper can be attacked by dunhere \n\n \n\nWest Bank : never saw that question before, well, I would say base = printed.\n\n \n\nHunter from Mordor : shadow effect resolve before resolving damage, so yes, his attack would be decreased\n\n \n\nFalse lead : yes, and nothing happen.\n\n \n\nBorn aloft : yes, but you have to still assign the damage and the attack would now be undefended.\n\n \n\nParting gift : from player who plays it to anyone\n\n \n\nMathom : yes, location don't need to be the active location to be explored.\n\n \n\nInfighting : doesn't matter from where to where.\n\n \n\nRadagast : yes, and yes. Same with Glorfindel but you can't play him again....\n\n \n\nSwarm : separated\n\n \n\nFlight : same as before\n\n \n\nLocation : same as before"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/?do=findComment&comment=1003451","commentId":1003451,"userName":"Goldenrod","timestamp":1394023693,"content":"So when you shuffle a guarded clue card from the staging area with False Lead, the card guarding it stays in the staging area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100563-goldenrods-questions/?do=findComment&comment=1003489","commentId":1003489,"userName":"alogos","timestamp":1394027211,"content":"Well, this is how I played it, but there is not really something clearly written about it..."}]}