{"url":"https://community.fantasyflightgames.com/topic/100590-getting-started/","title":"Getting started","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003376","commentId":1003376,"userName":"privateer5","timestamp":1394013691,"content":"Hi all\n\nI have just purchased one core set and plan to get another so up to four my friends can play\n\nWhat else would you recommend me to get ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003385","commentId":1003385,"userName":"MyNeighbourTrololo","timestamp":1394014287,"content":"Everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003414","commentId":1003414,"userName":"Nerdmeister","timestamp":1394018371,"content":"If you want something a bit more constructive, I´d say get the packs in the order of their release, possibly try to get the different cycles in one go if possible. Then see how much you enjoy it and if you are hungry for more then buy the next cycle and so on. The different cycles are all predated by a deluxe expansion required to play the cycle in question and the cycles themselves consist of 6 small packs, with a few player cards and the encounter cards for a quest.\n\n \n\nThe order of release for the cycles and deluxe expansions are:\n\nCore Set (duh ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png])\n\nShadows of Mirkwood cycle\n\nKhazad-dûm deluxe expansion\n\nDwarrowdelf cycle\n\nHeirs of Numenor deluxe expansion\n\nAgainst the Shadow cycle\n\nVoice of Isengard deluxe expansion\n\nThe Ring-maker cycle (in progress)\n\n \n\n \n\nOr if you prefer you can get the saga expansions, which are supposed to be playable with just the core set and depict specific events from The Hobbit and The Lord of the Rings books. In order of release they are:\n\n \n\nThe Hobbit - Over Hill and Under Hill\n\nThe Hobbit - On the Doorstep\n\nThe Lord of the Rings - The Black Riders\n\nThe Lord of the Rings - The Road Darkens (upcoming)\n\n...more The Lord of the Rings coming\n\n \n\nEach of these expansions also come with player cards.\n\nHope you find this somewhat useful"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003436","commentId":1003436,"userName":"privateer5","timestamp":1394021510,"content":"Ok thanks that dose help\n\nI guess shadows of mirkwood doesn't get a delax expansion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003438","commentId":1003438,"userName":"privateer5","timestamp":1394021731,"content":"How many delax expansion do you need to buy just one or two ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003452","commentId":1003452,"userName":"Nerdmeister","timestamp":1394023712,"content":"You only need one deluxe expansion for the following cycle.\n\n \n\nAlso Shadows of Mirkwood´s \"deluxe expansion\" is the core set. The encounter cards from the core set are used to build the encounter decks in SoM"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003658","commentId":1003658,"userName":"Style75","timestamp":1394039066,"content":"I highly recommend that before you rush out and start buying, you read the new player's buying guide [http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] put together by \"Tales from the Cards\".  It gives a detailed breakdown of all the products and of what use they'd be to new players based on how you plan to play the game.\n\n \n\nAfter that, browse the other new player guides [http://talesfromthecards.wordpress.com/new-player-guides/] that he has on his site, they're all very useful and have a ton of tips to make the game a lot more fun.\n\n \n\nWelcome to the community!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1003890","commentId":1003890,"userName":"MyNeighbourTrololo","timestamp":1394052702,"content":"Seriously, dude. Get everything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1004080","commentId":1004080,"userName":"FeloniusBard","timestamp":1394062624,"content":"I ask myself this same question all the time --- \"What am I getting next?\" \n\n \n\nI'm still very early in my collection. Currently I have 1 core set, Hunt for Gollum, Conflict at Carrock, Hills of Emyn Muil, Khazad-Dum, and Foundations of Stone. \n\n \n\nMy current next three purchases are going to be Redhorn Gate, Passage to Rivendell, and Watcher in the Water, probably in that order (I've always liked the sons of Elrond, both in the books and thematically for this game). \n\n \n\nIf I were to do it over, I would go in this order: \n\n \n\nStart with Khazad-dum. It gives you the best access point to some of the best quests, heroes, and player cards in the game. \n\n \n\nOnce you have Khazad-dum, it's then time to choose your preferred deck \"flavor.\" If you like dwarves, your next purchases should be in some order, Return to Mirkwood (for the most indispensable Dwarf hero, Dain Ironfoot), and both Hobbit saga expansions (Over Hill and Under Hill, On the Doorstep). \n\n \n\nIf you're interested in elves / Elrond / Glorfindel, pickup Foundations of Stone, Shadow and Flame, and Watcher in the Water, in some order (I personally am getting Redhorn Gate and Road to Rivendell specifically for Elladan and Elrohir). \n\n \n\nOnce you have Khazad-Dum, and 2-3 more adventure packs, get the Black Riders. I LOVE the Black Riders quests. The perfect balance of difficulty, fun, and thematic elements. So, so awesome. There's some very good player cards too, though many are Hobbit-themed. \n\n \n\nAt some point, you'll want to pick up Conflict at Carrock, maybe along the way. Spirit Frodo is a fantastic hero, and Burning Brand + Song of Lore are universally awesome in every possible deck, plus you get a very fun quest.\n\n \n\nIf you want to explore Gondor, go ahead and get Heirs of Numenor. I really like the player cards and heroes (fantastic heroes!) . . . but I wouldn't even attempt the quests until you have a minimum of 5 other expansions. The quests are downright brutal. \n\n \n\nAfter that, do some research on what cards you think will fit your playstyle. \n\n \n\nProbably the only purchase I'm really \"disappointed\" in so far is Hills of Emyn Muil . . . but even then, I got my Songs of Travel (which I use in nearly every deck) Ride to Ruin, Gildor Inglorion, and the Riddermark's finest. \n\nEdited March 5, 2014 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1004362","commentId":1004362,"userName":"Nerdmeister","timestamp":1394089831,"content":"> Seriously, dude. Get everything.\n\nSo privateer goes out and buys everything, on your advice.\n\nComes to the conclusion that the game isn´t for him anyway or is overwhelmed by too much information and gives it up on that grounds.\n\nAnd you end up being a massive c**k because the guy just spend hundreds of dollars on something he won´t be using and that´s \"not your fault\"\n\nThat scenario isn´t too unlikely.\n\nJust because you and I love the game doesn´t mean everyone else will automatically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1004473","commentId":1004473,"userName":"privateer5","timestamp":1394105299,"content":"Thanks for the advice guys"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1004483","commentId":1004483,"userName":"MyNeighbourTrololo","timestamp":1394106291,"content":">  \n> \n> > Seriously, dude. Get everything.\n> \n> So privateer goes out and buys everything, on your advice.\n> \n> Comes to the conclusion that the game isn´t for him anyway or is overwhelmed by too much information and gives it up on that grounds.\n> \n> And you end up being a massive c**k because the guy just spend hundreds of dollars on something he won´t be using and that´s \"not your fault\"\n> \n> That scenario isn´t too unlikely.\n> \n> Just because you and I love the game doesn´t mean everyone else will automatically.\n> \n>  \n\nHe will. I GAREN-tee it... get it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1005253","commentId":1005253,"userName":"FreddieG","timestamp":1394141951,"content":"I'm fairly new to the game as well, having just started in December, but I've been picking up an adventure pack just about every week or two. \n\n \n\nWe played through the Mirkwood Cycle and it was just fine - no major fireworks, but it was a nice progression and really helps your card pool. The game really does get better and better the more cards you get. We played through in order, just for the fun of it.\n\n \n\nSecond, I picked up the first Hobbit expansion, which again introduces some great new cards for your deck and 4 new heroes (it also comes with more Gandolfs, which function just a bit differently).\n\n \n\nI'm moving on to Kazad Dum now.\n\n \n\nI never did purchase a second core set. Instead I just got the tokens and counters on ebay for like $7 - and it's great having plenty of tokens, even for two player games. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1005297","commentId":1005297,"userName":"Catastrophic09","timestamp":1394143569,"content":"> Hi all\n> \n> I have just purchased one core set and plan to get another so up to four my friends can play\n> \n> What else would you recommend me to get ?\n\nYou do not need 2 Core Sets to play four player, thats a big misconception.  The only reason they say that is because you may be tight on cards at first and perhaps low on tokens but you can just get those on Ebay if you really think you need them.  After you buy a couple expansions you will have plenty of cards and heroes to choose from and your money will be spent more effectively getting new content and not 75% duplicate cards that you can't use from a second core.\n\n \n\nDefinitely check out the links Style75 mentioned and I would personally suggest looking at Saga's first since they have the most player cards and heroes compared to Adventure Packs.  And also what are your interests? Gondor- get Heirs of Numenor, Dwarves and Elves- Khazad Dum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1005639","commentId":1005639,"userName":"imjodokast","timestamp":1394163021,"content":"I just recently got into the game. (Via a trade)\n\nI got two core sets and two adventure packs from the first cycle. The new buyer's guide from the link above is great. I did get the two packs I liked most.\n\n \n\nIf I had to start over;\n\nI would get one core set, then Khazad-dum followed by the The Hobbit - Over Hill and Under Hill.\n\nI like deck building, and this feels like a good way to get a good pool of player cards. Those two deluxe sets also seem to have a good deal of synergy. From there if I felt like I really needed a second core set I would get one or just cherry pick the adventure packs I liked from the first cycle. (again that new buyer's guide is great is great.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1006072","commentId":1006072,"userName":"privateer5","timestamp":1394197717,"content":"This is great advice guys\n\nNo one has mentioned the print on demand sets yet"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1006112","commentId":1006112,"userName":"Glaurung","timestamp":1394201742,"content":"Actually is quite easy in my opinion. Just start to buy everything from begin Core set, Mirkwood cycle, MAO and so on.  In order the packs was release…… "},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1006375","commentId":1006375,"userName":"Style75","timestamp":1394214325,"content":"The print on demand sets are encounter cards only, no player cards at all. Furthermore, they are all expert level scenarios designed for an extreme challenge. At this stage in your collection, your money is much better spent on packs that will increase your player card pool. The POD packs are really fun, but you can safely save them for later once you've got the player cards to make them survivable. The nice thing about the POD packs is that you don't have to worry about them being sold out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1008182","commentId":1008182,"userName":"privateer5","timestamp":1394419491,"content":"Thank for the\n\nHelp\n\nPicked up a core set and all the shadow of mirkwood cycle yesterday\n\nThink that will keep me and my friend busy for a while"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100590-getting-started/?do=findComment&comment=1047543","commentId":1047543,"userName":"dizpatcher","timestamp":1397360587,"content":"> Actually is quite easy in my opinion. Just start to buy everything from begin Core set, Mirkwood cycle, MAO and so on.  In order the packs was release…… \n\nWhat he said.  I love playing them in order."}]}