{"url":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/","title":"question about quest card Journey along the Anduin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/?do=findComment&comment=1005853","commentId":1005853,"userName":"dizpatcher","timestamp":1394175638,"content":"New guy here. Beat two hill trolls. I was kind of proud of myself, then...... I don't understand the next quest card.\n\nI get the reveal extra card part, but what is: Do not make engagement checks during the encounter phase.\n\nIs it just a free-for-all? Engage everyone? Take your pick.\n\nSorry, I don't get it, and I bet the answer is so easy i will smack my head."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/?do=findComment&comment=1005874","commentId":1005874,"userName":"alogos","timestamp":1394177836,"content":"During the encounter phase, enemy make engagement checks and will automaticaly engages you if your threat is too high.\n\nBut before those enemies check, you can optionnaly force engagement with one.\n\nEnemies engaged will leave the staging area, not counting their threat for the quest phase but will attack you in the combat phase.\n\nSo if you skip engement check, you will have enemies pilling up in the staging area unless you optionnaly engage one yourself each turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/?do=findComment&comment=1007421","commentId":1007421,"userName":"tacomen253","timestamp":1394322382,"content":"> New guy here. Beat two hill trolls. I was kind of proud of myself, then...... I don't understand the next quest card.\n> \n> I get the reveal extra card part, but what is: Do not make engagement checks during the encounter phase.\n> \n> Is it just a free-for-all? Engage everyone? Take your pick.\n> \n> Sorry, I don't get it, and I bet the answer is so easy i will smack my head.\n\nIn the Encounter Phase there are 2 steps in this order:\n\nStep 1: Player Engagement\n\nEach player has the option to engage one enemy in the staging area.\n\nStep 2: Engagement Checks\n\nPlayers must make a series of engagement checks, to see if any of the enemies remaining in the staging area engage them.\n\nThe 2nd quest card(Anduin Passage) states \"do not make engagement checks during the Encounter Phase.\" So simply this means skip step 2 of the encounter phase.\n\n \n\nSo for example: Assume the staging area is empty during the start of the quest phase. During the Staging Step Dol Guldur Orcs, and Eastern Crows are revealed to the staging area. Eastern Crows has surge which reveals Misty Mountain Goblins into the staging area. So there are 3 enemies in the staging area with a combined threat strength of 5, and you only get to optionally engage 1. Then after any actions you may take it is on to the Combat Phase, and a shadow card is immediately dealt to the enemy you decided to engage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/?do=findComment&comment=1007561","commentId":1007561,"userName":"dizpatcher","timestamp":1394342265,"content":"So if I have 2 characters that I could attack or defend with, I can only choose one enemy to engage?+"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100752-question-about-quest-card-journey-along-the-anduin/?do=findComment&comment=1007587","commentId":1007587,"userName":"GrandSpleen","timestamp":1394346695,"content":"Yes, the number of characters you have is irrelevant.  You can only have **optional** engagement per round in the engagement phase.  But you are forced to engaged all enemies whose engagement cost is higher than your threat (unless otherwise stated by card effects--- such as Journey Down the Anduin's second stage).\n\n \n\nYou may still use card effects to engage enemies, such as the Son of Arnor's effect."}]}