{"url":"https://community.fantasyflightgames.com/topic/100830-question-about-forest-snare/","title":"question about forest snare","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100830-question-about-forest-snare/?do=findComment&comment=1007102","commentId":1007102,"userName":"dizpatcher","timestamp":1394275586,"content":"Since Forest Snare is an attachment, and attachments can't be played during engagement, I suppose I have to take a beating from the big Hill Troll up on the hill for a whole round before I can attach it to the Troll?\n\nI'm also not quite sure about the timing of Sneak Attack with Gandalf either. Beginning of encounter or players attack phase? Pop in to defend. I don't know. I'm lost on that one. AND . . am I right that if you use Sneak Attack w/Gandalf, its only until the end of phase, but if big G is played/paid for from hand like normal play he sticks around till refresh time.\n\nI know these must be easy questions, but this game is a brain buster for we newbie folk."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100830-question-about-forest-snare/?do=findComment&comment=1007107","commentId":1007107,"userName":"jjeagle","timestamp":1394276540,"content":"1. You are right about Forest Snare - though there are tricks to avoid this problem, eg Son of Arnor then Forest Snare in the planning phase.\n\n \n\n2. I don't quite understand what you are asking about Sneak Attack - you can play this action (with Gandalf or any other ally) whenever you have an action window. So you can play him at the start of the quest phase (and quest with him), in the combat phase (to attack/defend)....\n\n \n\n3. Yes, you are right about the difference between Sneak-Gandalf (end of the phase) and normal Gandalf (end of the round)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100830-question-about-forest-snare/?do=findComment&comment=1007108","commentId":1007108,"userName":"dizpatcher","timestamp":1394277577,"content":"Yeah, I didn'tword it well, but you hit it right on the head of what I was asking about,by breaking into those two phase / groups.\n\nThanks so much."}]}