{"url":"https://community.fantasyflightgames.com/topic/100883-couple-of-questions/","title":"Couple of questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100883-couple-of-questions/?do=findComment&comment=1007632","commentId":1007632,"userName":"Chris51261","timestamp":1394355180,"content":"Couple of things I ran into playing through Nightmare Journey Down the Anduin, was hoping for help. First: if I have two copies of Gondorian Fire on one hero, can I pay two resources to activate the both of them? Or does the \"limit once per phase\" text prevent this? Also, is it possible to exhaust a character simply because you want to? Or do they have to perform some action that causes them to exhaust? At the end when you're skipping the questing phase I really needed Arwen to exhaust, lol. Anyway, thanks in advance for any help! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100883-couple-of-questions/?do=findComment&comment=1007651","commentId":1007651,"userName":"Nerdmeister","timestamp":1394358777,"content":"You are only able to activate gondorian fire once per phase. But if you have two, which does not appear to be limited, you should be able to activate both of them independently.\n\n \n\nYou cannot exhaust a character simply because you want to. However there are a few cards which require exhausting characters in order for them to work. You could play around with those if you want to activate Arwen\n\n \n\nmed_strength-of-will-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_strength-of-will-core.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100883-couple-of-questions/?do=findComment&comment=1007976","commentId":1007976,"userName":"Chris51261","timestamp":1394396792,"content":"That's how I read it too. I know you can only activate each once, but I didn't think one should have any bearing on the other. I thought I had read somewhere someone talking about exhausting a character, but I haven't read anywhere that you can do that so what you've said makes sense. Thanks. =)"}]}