{"url":"https://community.fantasyflightgames.com/topic/100995-troll-attack/","title":"Troll Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1008982","commentId":1008982,"userName":"Chris51261","timestamp":1394490203,"content":"So in another attempt at beating Journey down the Anduin Nightmare, I got Troll Attack as a shadow card when a hill troll attacked. Can someone explain to me how this works when you're defending with a character using sentinel? Do I remove him from defense, then resolve the attack against both players? And since it's Tactics Boromir, can I re-ready him to defend the other player again? (Arwen giving sentinel)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1009284","commentId":1009284,"userName":"Nerdmeister","timestamp":1394522477,"content":"Don´t have the card in front of me so can´t remember the shadow effect´s wording. Though if it instructs you to attack another player after the current attack then you should have a few windows to ready Boromir between the steps of the attack.\n\nNot sure if there is more crucial wording on the shadow card. Maybe you could post the exact wording?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1009311","commentId":1009311,"userName":"Chris51261","timestamp":1394526702,"content":"Shadow: If attacking enemy was a troll, resolve this attack against each player. (Attack is undefended against each player not engaged with this enemy.) I had him engaged with one of my decks, but I was defending with the other. Hope that clears it up. =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1009330","commentId":1009330,"userName":"Nerdmeister","timestamp":1394528899,"content":"Well presumably that means that the attack resolves against each player at the same time. And since declaration of defenders-step has been passed and the card specifically states that all other attacks are undefended, you cannot use Boromir in this fashion. Even though you can ready him before the damage is applied there is no new window to declare defenders.\n\nNasty shadow effect. I would recommend using Balin for something like that.\n\n \n\nmed_balin-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_balin-otd.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1009866","commentId":1009866,"userName":"Noccus","timestamp":1394566704,"content":"Indeed this is a very nasty shadow effect. It kills heroes in multi player, plain and simple.\n\nAnyways, the question you asked about sentinel blocking is legal.\n\nSince you declared him a blocker before the shadow card was dealt it's fine.\n\nThough the troll is still considered engaged with the other deck, the shadow effect makes it attack the sentinel hero deck again, and the attack goes undefended...ouch..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1009985","commentId":1009985,"userName":"Chris51261","timestamp":1394572818,"content":"Yeah. This whole quest has been awful for me. I can be doing great right up until stage 3, and I'll get like 4 surges, the treachery that brings back something from the victory display, and maybe a couple \"deal one damage to each exhausted character\" thrown in there. Lol. This last attempt was the closest I've come and then this happened. Oh well. =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1010354","commentId":1010354,"userName":"Nerdmeister","timestamp":1394608719,"content":"> the shadow effect makes it attack the sentinel hero deck again, and the attack goes undefended...ouch...\n\nIt makes the troll attack the player with the sentinel char. Assigning damage from that undefended attack could be to any of the heroes on that side of the table, not just the one with sentinel.\n\n \n\nAlternatively if you have the setup:\n\nmed_white-tower-watchman-tdf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_white-tower-watchman-tdf.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/100995-troll-attack/?do=findComment&comment=1010565","commentId":1010565,"userName":"Noccus","timestamp":1394636939,"content":">  \n> \n> > the shadow effect makes it attack the sentinel hero DECK again, and the attack goes undefended...ouch...\n> \n> It makes the troll attack the player with the sentinel char. Assigning damage from that undefended attack could be to any of the heroes on that side of the table, not just the one with sentinel.\n> \n>  \n> \n>  \n> \n> I know.\n> \n> I probably used unlogical wording with \"sentinel hero deck\" Where deck means player. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}