{"url":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/","title":"A few questions concerning certain cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1011624","commentId":1011624,"userName":"Serazu","timestamp":1394717794,"content":"Good day.\n\n \n\nThere's a couple of questions I have, concerning the following:\n\n \n\n1. Second Deep [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/shadow-and-flame/second-deep-saf]\n\n \n\nWhat happens if it's the active location, but the Balrog has no damage tokens on it? Are any progress tokens put directly on the quest card or no progress tokens are put at all till I bleed the Balrog? I determined that the tokens are put on the quest card (there's already a disadvantage there, since I'm stuck with that as an active location till Balrog is dealt damage), but I may be wrong.\n\n \n\n2. Escape to the Quays [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/heirs-of-numenor/escape-to-the-quays-hon]\n\n \n\nErr, what I already ask in that page. I repeat it here:\n\n \n\n> \"When Revealed: Each player searches the encounter deck and discard pile for 1 enemy and adds it to the staging area.\"\n> \n> Does the forced effect of the 3b side of the quest apply to the above? I believe not, since, by the time the when revealed.. effect was triggered, we were still in the 3a part of the quest. Correct?\n> \n>  \n\n \n\n \n\nMany thanks to you.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1011752","commentId":1011752,"userName":"alogos","timestamp":1394725204,"content":"1. Progress token cannot bypass the active location if it is not explicitl stated.\n\n2. Enemies added to the staging area without being revealed are not revealed, so the 3b of the quest would not apply whatever is the answer to your question... (and I think it should be like you said)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1012640","commentId":1012640,"userName":"Serazu","timestamp":1394795780,"content":"> 1. Progress token cannot bypass the active location if it is not explicitl stated.\n> \n>  \n\n \n\n1. If I exhaust Asfaloth [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/foundations-of-stone/asfaloth-fos] to place Progress tokens on Doors of Durin [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/the-watcher-in-the-water/doors-of-durin-twitw], those will be put into the quest card, since it's specifically stated on the card text. Correct?\n\n \n\n2. To the West-door [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/the-watcher-in-the-water/to-the-west-door-twitw]\n\n \n\nCards that are not put into the staging area, such as Treacheries, resolve their effect and then are discarded, right?\n\n \n\n3. Ill Purpose [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/the-watcher-in-the-water/ill-purpose-twitw]\n\n \n\nThe threat raise is equal to the threat of the cards that stayed in the staging area AFTER the engaging of enemies as dictated by the card; in other words, the locations that stayed behind are those who add their threat, right?\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1012931","commentId":1012931,"userName":"Nerdmeister","timestamp":1394814331,"content":"Correct on all accounts"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028314","commentId":1028314,"userName":"Serazu","timestamp":1395875747,"content":"I play this game since its beginning, so I shouldn't ask such obvious questions, still it's better to be safe than sorry.\n\n \n\n1. Whenever an effect asks to reveal the top X cards from the encounter deck and there are less than X cards left, I reveal the cards that are left and then stop. Then, at the staging step of the quest phase of the next round, I shuffle the encounter discard pile to form a new encounter deck (and then reveal a card from it, as per the usual flow of the game). Correct? I'm asking because this is how I did it in the final stage of the Fords of Isen quest: I revealed less than the cards I had in hand at the time, since there were fewer cards left in the encounter deck.\n\n \n\n2. How do you treat all the effects in the aforementioned quest that call to search for \"1 different Dunland\" in solo game? In multi there's no problem: each player has to pick a Dunland with a different name than the one(s) picked by his teammates (if possible, of course). In solo, what I suspect has to be done is for one Dunland to either be picked at random or deliberately by the player. Correct?\n\n \n\n3. Continuing the above, if I play solo and there's a D Tribesman already in play, do I have to pick any D but the Tribesman, so as to have as big a variety as possible?\n\n \n\n4. Grima\n\n \n\n> If free of encounters, the first player gains control of Gríma.\n> \n>  \n\n \n\nAnd by this, I gain control of Grima, whenever the Isle passes to my victory display and he has no encounter card attached. It's like the \"guarded\" keyword really. Correct?\n\n \n\n5. To Catch an Orc 1A quest\n\n \n\nIf I play solo, is only Mugash shuffled into my 20-card deck? No guards?\n\n \n\nThanks.\n\nEdited March 26, 2014 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028740","commentId":1028740,"userName":"Nerdmeister","timestamp":1395905643,"content":"1) The encounter deck gets reshuffled whenever it is empty during the quest phase\n\n \n\n2) You just pick any Dunland enemy you want. It is not possible for a solo player to pick non-different enemies when only picking one.\n\n \n\n3) Since this is it´s own instance, you do not take enemies already in play into account. Unless specifically stated, which it is not.\n\n \n\n4) Can´t remember if the quest or attached location has any other stipulations in this regard. Look to them. The guarded keyword states that you must draw one more card to guard the guarded card. The means of taking control of such cards may differ widely. So no this is not like the guarded keyword as Grima specifically states which card is attached to it; even if seemingly a bit alike.\n\n \n\n5) Only Mugash"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028841","commentId":1028841,"userName":"Serazu","timestamp":1395920438,"content":"> 1) The encounter deck gets reshuffled whenever it is empty during the quest phase\n> \n>  \n\n \n\nI know that. What I want to know is, in the case I described, do I just draw the cards left in the deck and that's it or do I draw the cards left and then, at the quest phase, I shuffle the discard pile back into a new deck and keep drawing till the X number is reached? I did the former.\n\n \n\n> 4) Can´t remember if the quest or attached location has any other stipulations in this regard. Look to them. The guarded keyword states that you must draw one more card to guard the guarded card. The means of taking control of such cards may differ widely. So no this is not like the guarded keyword as Grima specifically states which card is attached to it; even if seemingly a bit alike.\n> \n>  \n\n \n\nUnless memory fails, there are no other stipulations. So, do I just take control of him when I claim the Islet as an explored location? Other than that, I used the guarded instance as an example of an encounter card with another card attached on it.\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028853","commentId":1028853,"userName":"Nerdmeister","timestamp":1395921421,"content":"1) As the rules stand now you do not reshuffle the deck until the quest phase, unless stated otherwise\n\n \n\n4) In that case: yes you take control of Grima immediately "},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028883","commentId":1028883,"userName":"Serazu","timestamp":1395923591,"content":"> 1) As the rules stand now you do not reshuffle the deck until the quest phase, unless stated otherwise\n> \n>  \n> \n>  \n\n \n\n:-)\n\n \n\nYes, I know that the deck is reshuffled then. What I'm asking is whether, at the quest phase, I continue revealing cards till X cards are revealed as the 3B of the quest card dictated. I believe not, but I may be wrong here.\n\n \n\nThanks.\n\nEdited March 27, 2014 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028892","commentId":1028892,"userName":"alogos","timestamp":1395924086,"content":"You have all the answers needed...\n\nYou are maybe concern by the difference of drawing cards one by one and revealing X cards in one go... in that case, you always reveal cards one by one.\n\nYou might also be confused with the term \"reveal\" which include drawing the card, reveal it, and add it to the staging area, and the term \"look at\" where if you would look at 5 cards in a 3 cards-deck, you would not reshuffle the deck since lookin at does not change the location of the cards while you are looking at them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028903","commentId":1028903,"userName":"Nerdmeister","timestamp":1395924651,"content":"Core Rules p 14\n\n\"If the encounter deck is ever empty during the quest phase, the encounter discard pile is shuffled and reset back into the encounter deck.\"\n\n \n\nSo if you are revealing X cards during the encounter phase and you run out of cards then you shuffle it because that is what you do \"If the encounter deck is ever empty during the quest phase\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1028971","commentId":1028971,"userName":"Serazu","timestamp":1395929075,"content":"No objections here. All are clear. In the case I write about however, the encounter deck was spent at the Refresh phase, due to 3B's Forced effect, before I had the chance to discard X cards (there were less than X remaining). So, I discarded whatever I could and then, at the quest phase, I reshuffled the discard pile into a new deck per the rules. I did not continue discarding however till the number X was supposed to be reached. To give you an example, the Forced effect dictated to discard, let's say, 6 cards and there were only 2 in the deck left. I discarded those 2 and, at the quest phase, I made a new deck out of the discard pile. I did not discard another 4 cards however. Was I right? This is my question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1029241","commentId":1029241,"userName":"alogos","timestamp":1395939104,"content":"Oh... ok, I understand now... well, the answer is no. If you fail to resolves an effect, it should not resume when you can.\n\nIf you draw a treachery that say \"discard 1 ally\", and you don't have one, don't discard the next one you play.\n\nOnly lasting effect should be considered over a period of time, revealing card is not a lasting effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1029510","commentId":1029510,"userName":"Serazu","timestamp":1395950292,"content":"Thank you guys. I suspected so, but I had to be sure; I wouldn't want to be called a cheater by the Dark Lord. I 've heard he makes a pretty bad enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1030118","commentId":1030118,"userName":"PsychoRocka","timestamp":1395996168,"content":"Oh man I always shuffle the discard pile if the encounter deck has run out and I need to draw cards from it whether that's from staging, enemies needing shadow cards or a treachery effect.... So just so I have this 100% correct, if during the combat phase I have engaged enemies who need shadow cards, if the encounter deck has no cards left they get no shadow cards that round?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1030159","commentId":1030159,"userName":"Nerdmeister","timestamp":1396001423,"content":"> Oh man I always shuffle the discard pile if the encounter deck has run out and I need to draw cards from it whether that's from staging, enemies needing shadow cards or a treachery effect.... So just so I have this 100% correct, if during the combat phase I have engaged enemies who need shadow cards, if the encounter deck has no cards left they get no shadow cards that round?\n\nCorrect.\n\nThough remember that if during staging you draw the last card of the encounter deck, even if you don´t have to draw more for the rest of the quest phase, you still shuffle the discard pile into a new deck because the encounter deck is then \"empty during the quest phase\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1030472","commentId":1030472,"userName":"Serazu","timestamp":1396022946,"content":"Sorry for bombarding you with questions, but it's the first time I play the VoI quests and there are some issues.\n\n \n\nThose questions have to do with the Searching for Mugash 2B quest card:\n\n \n\n1. It's Time 2. Still, if I am successful on my first quest attempt at the very beginning, I may put a third counter on it. Am I allowed to do that or is the 2 the absolute limit?\n\n \n\n2.\n\n> After questing successfully, cancel all progress that would be placed on this stage\n> \n>  \n\n \n\nper the card's description. So, let's say that I quest for a total willpower of 7, no enemies or locations are in the staging area to reduce this number and the location that needs 6 progress tokens to be defeated is the active one. Normally, I would put the seventh progress token on the quest card. In this case however, I put nothing on it and I add a time counter instead. Correct?\n\n \n\n3. What would happen if, in the above example, I quested for 6? I would still have quested successfully (as the quest demands), but all 6 of my progress tokens would go to the active location and there would be no spare one to put on the quest card (no progress would have been placed on this stage, again as the quest demands) and turn it into a time counter.  What would happen here? I'm tending to think that I wouldn't put a time counter, but I may be wrong.\n\n \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1030804","commentId":1030804,"userName":"GrandSpleen","timestamp":1396038051,"content":"Time counters - there's no limit to the number of time counters you can place on a card.  The Time X value just tells you how many should be placed initially.\n\n \n\nFor your two scenarios re: questing in To Catch an Orc:\n\nYes, if you quest for +7 progress and have a 6-quest point location, put all 6 tokens and clear that location, cancel the 1 progress that would go on the quest and put a time counter on it instead.\n\n \n\nIf you quest for 6, clear the location but do *not* put a time counter on the card.  This was clarified recently by Caleb.  You have to have progress that actually should be placed on the quest card before you are able to cancel it and put a time counter on the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1099479","commentId":1099479,"userName":"Serazu","timestamp":1401212724,"content":"1. Concerning the Dol Guldur quest, apart from defeating the Nazgul and placing seven progress tokens on the 3B quest card, is it also paramount to have all three objectives under my control, as well? It is a prerequisite to advance from 2B to 3A, but there is no mention of it in the victory conditions. I take it that they are not necessary, but am I correct?\n\n \n\n2. Since the aforementioned objectives are also considered attachments, when certain effects force me to discard an attachment, I may choose to discard one of those instead of my usual (and beneficial) ones. Right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1099823","commentId":1099823,"userName":"alogos","timestamp":1401229789,"content":"1. You can lose them after 2B is passed, as it is not a requirement for winning.\n\n2. You don't own attachement that come from the encounter deck. Some objective will specically say that you gain control of them though. Read the card and you shall have the answer, I think they use the \"claim\" word sometimes, and I would not say I'm 100% sure it's the same. I'll read the corerules again..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1143368","commentId":1143368,"userName":"Serazu","timestamp":1404482907,"content":"Old Hatreds [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-voice-of-isengard/old-hatreds-voi] (and other such cards)\n\n \n\nWhen the quest card the attachment is attached to moves to the used pile, the attachment is discarded - right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1143496","commentId":1143496,"userName":"alogos","timestamp":1404491682,"content":"yes, it is discarded when the quest card it is attached to is discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1361763","commentId":1361763,"userName":"Serazu","timestamp":1418148241,"content":"Good day to you. There are a couple of issues that call for further clarification concerning the Celebrimbor's Secret quest:\n\n \n\n1. Orc Hunter [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-voice-of-isengard/orc-hunter-voi]\n\n \n\nI have 1 Time counter left on, let's say, the first quest card [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/celebrimbor-s-secret/the-ruins-of-ost-in-edhil-r1269]; that last counter is removed and then Bellach [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/celebrimbor-s-secret/bellach-r1281]'s Scour effect triggers. I pick the Hunter. I resolve its \"When revealed\" effect. Can I pick the second option (remove 1 time counter from the current quest) and suffer no ill effect? I tell you that because the \"Place 3 time counters on this stage\" of the quest card has not happened yet, since I am still in the \"trigger each Scour effect\" part of the quest card, so, by the time the Hunter triggers, there are no time counters on the quest card.\n\n \n\n2. Continuing the above question, what happens when I am presented with a choice between an effect that cannot take place and an effect that can take place? Do I always have to pick the effect that can take place, much like in other card games?\n\n \n\n3. City Remains [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/celebrimbor-s-secret/city-remains-r1275]\n\n \n\nWhat happens when the topmost Scour effect in my discard pile is Prowling Orc [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/celebrimbor-s-secret/prowling-orc-r1278]? Does he return to play and engage the first player? I do not know whether the location's \"if able\" sentence applies here or not.\n\n \n\n4. Continuing the above, what happens if Collapsed Tower [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/celebrimbor-s-secret/collapsed-tower-r1273] is the card with the topmost scour effect? Does it return from the discard pile to the staging area with 2 damage on it?\n\n \n\nMany thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1362152","commentId":1362152,"userName":"ricedwlit","timestamp":1418169828,"content":"1. Bellachs' Scour effect says to \"add to the staging area\" which means you do not resolve \"when revealed\" effects on the selected cards.  This has been clarified in the FAQ (reveal is shorthand for reveal and add, but add is just add; when revealed effects are not triggered by adding).\n\n \n\n2. Depends on how the choice is  worded. If the phrase is \"must either x or y\" then you have to attempt x and if that is not possible, then y occurs (if possible). See FAQ for more details: http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ-Printer-Friendly.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ-Printer-Friendly.pdf]\n\n \n\n3. I would say that the effect triggers: the orc engages the player with the highest threat and then makes an attack.\n\n \n\n4. I'd move it to the staging with 2 damage on it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101214-a-few-questions-concerning-certain-cards/?do=findComment&comment=1362188","commentId":1362188,"userName":"Serazu","timestamp":1418172315,"content":"Thank you. Three more questions:\n\n \n\nWith the addition of Galadriel in my card pool, I wanted to see in practice whether she destroys the Shadow and Flame quest (she does). Then, a matter came up which I hadn't faced before till now:\n\n \n\n1. If my threat is 0, then I am not engaged with the balrog. Can I attack him though or do I have to be engaged with him to do so? (effectively meaning that, whenever my threat is at 0 the balrog does not harm me, but I do not harm him either)\n\n \n\n2. If the balrog has 0 hit points left and I use Dark Pit [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/shadow-and-flame/dark-pit-saf]'s effect to banish him, discarding the last 3 cards of my deck and those 3 have a cumulative cost of 0, what happens then? Have I missed my chance to defeat him and finish the quest? \n\n \n\n3. Is there such thing as negative hit points or, much like in the threat case, 0 is the absolute minimum?\n\n \n\nty"}]}