{"url":"https://community.fantasyflightgames.com/topic/101446-forced-to-buy-expansions/","title":"Forced to buy expansions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101446-forced-to-buy-expansions/?do=findComment&comment=1014628","commentId":1014628,"userName":"RoxasFIN","timestamp":1394995089,"content":"So is it true that you're actually forced to buy expansions to get an good deck?\n\n \n\nHere talks an newbie who has played the introductionary quest for like, 6-8 times now? I've used different decks and either solo or ''two-handed'' each time and i've lost before getting even half-way of the first stage.\n\n \n\nOnce, with spirit/leadership deck i finally got to the very last stage but that didint took long when i was completely wiped out. There is just never enough resources to get cards to play, allies doesn't last enough to be useful which means i cant quest, i cant defend myself and i cant attack everything they throw at me.\n\n \n\nI only have core set and The Hobbit: On the doorstep. But i guess those doesn't offer good enough of cards to actually beat the INTRODUCTIONARY quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101446-forced-to-buy-expansions/?do=findComment&comment=1015990","commentId":1015990,"userName":"Catastrophic09","timestamp":1395092113,"content":"Hi welcome to the game! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  There is a lot I could say about your questions but to simply answer the first questions- yes, you do need to buy expansions to build better decks.  Although the Core set has some great cards many other good cards come in other expansions so you'll only have better cards to choose from and better decks with the more expansions you get BUT that doesn't mean you need all expansions.  Some have better cards than others and of course some have certain cards you may want (if you like dwarves, get the Hobbit boxes).\n\n \n\nThe intro quest Passage Through Mirkwood shouldn't be too difficult (so I wonder if you're doing something wrong?) but the last one is still extremely difficult even with a larger card pool.  My first suggestions are to go with one of the original play experiences mentioned in the rule book: don't give enemies shadow cards.  This can make things a lot easier and more manageable.  Also check out the rules for easy mode [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/easy-mode/LOTR_Easy_Mode.pdf] as this makes the game much better when you don't have a lot of cards yet.\n\n \n\nCheck out this site and the helpful links for some good information: new player guide [http://talesfromthecards.wordpress.com/new-player-guides/]\n\n \n\nThis is a Living Card Game remember so it is expected for players to buy many expansions as the game continually grows.  But you may get by with just buying a few to play occasionally and still have fun especially if you use some of the above mentioned rules making the game less difficult."}]}