{"url":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/","title":"When EXACTLY is Treachery card discarded (Hungry Troll)?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/?do=findComment&comment=1015381","commentId":1015381,"userName":"krokodiler","timestamp":1395063875,"content":"I reveal Hungry Troll, there are no Trolls in Staging so it gains Surge. So I reveal A suspicious crow with its When revealed effect: Reveal the top card of the encounter discard pile and add it to the staging area, if able. Should I first discard Hungry Troll and then reveal it again from discard pile? Or should I reveal card that is already on top of Encounter discard pile (it's No campfire, so it's even worse...) and apply its effects, and after that finally discard that Hungry Troll card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/?do=findComment&comment=1015463","commentId":1015463,"userName":"alogos","timestamp":1395068839,"content":"Surge effect is to draw an additionnal card during staging, not to draw and reveal another one while it is resolving.\n\nSo you would have discarded the card before drawing the next one.\n\n \n\nThere are some card that reveal additionnal card before being discarded as it is not a surge but a \"when revealed\" effect that make players reveals more cards. But in case of surge, fully resolve the card, discard it, and draw the next one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/?do=findComment&comment=1016376","commentId":1016376,"userName":"krokodiler","timestamp":1395129522,"content":"OK, thanks.\n\nSo, first resolve Hungry Troll, discard it, then apply its Surge (which in this case gets me reveal it again from discard pile due to A suspicious crow, so it gets Surge again...)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/?do=findComment&comment=1029160","commentId":1029160,"userName":"philkav","timestamp":1395936197,"content":"What about treachery cards that have a lasting effect (like until the end of the phase or round) ? I usually keep those around as a reminder until they no longer apply. Are they 'officially' discarded after being revealed or after their effect has run its course ? This will usually not matter, of course, but I still wonder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101521-when-exactly-is-treachery-card-discarded-hungry-troll/?do=findComment&comment=1029234","commentId":1029234,"userName":"alogos","timestamp":1395938931,"content":"> When a treachery card is revealed\n> \n> from the encounter deck, its text effects are resolved\n> \n> immediately, and it is then placed in the encounter\n> \n> discard pile.\n> \n>  \n\n \n\nSame thing with sneak attack, you discard sneak attack when you play it, you don't keep sneak attack in play until the end of the phase (I hope...)"}]}