{"url":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/","title":"Lotr LCG Experiment","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015480","commentId":1015480,"userName":"Tracker1","timestamp":1395069555,"content":"I have often wondered what would happen if you give 2 players the same heroes and player card deck along with an encounter deck, where each deck has the cards arranged in the same order. Of course these decks would be arranged by a third party, since players should not know the order of cards, but they should be familiar with what cards are in the deck. The decks are not shuffled prior to the game. Each player will draw the same 7 cards and cards off the encounter deck will be the same, unless something alters the flow. The player card deck would also need to have no cards that require the deck to be shuffled, and a scenario would have to be chosen that does not require the encounter deck to be shuffled either. Ideally each player would play in a different areas, so they could not see each others games. To really get the most out of the experiment each player would write down a play by play account of the game, or the games could be filmed and analyzed later.\n\nSo, why would this be interesting?\n\nWell, my main question is do players make the same choices when faced with the same circumstances? Basically are we robots playing this game, or do we each make different choices that when added up alter the course of the game dramatically. Of course to take this one step further, it would be cool to see the difference in choices amongst experienced and beginner players, and we probably would see a difference there. But if we took 2 players that are experienced with the mechanics of a scenario and the player cards in the deck, will there be a difference? And if so what choices were made and how did it influence the outcome.\n\nSorry that the scientist in me is coming out, but i think it would be neat to see. Unfortunately i do not play Octgn, since it seems like that would be easiest place to set this up if a third player was willing to organize the decks. Doing it with actual cards takes a bit more investment.\n\nAnyway, if anyone ever tries this post it here, i am real curious to hear or see what happened, or if anyone has the mad scientist syndrome like me, and wants to try it out with me we can figure it out how to make it work. We might even be able to post the results in the Journal of Applied Psychology. Ha!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015512","commentId":1015512,"userName":"Raven1015","timestamp":1395070639,"content":"I've kind of curious about this myself. Not as in-depth as your experiment, mind you  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] , but I have wondered at how players differ in their choices and how much of an impact strategic decision-making has in this game. To my mind, there are a few places where players can and seem to differ in their strategy as opposed to the decks they build:\n\n \n\n- How conservative/aggressive they are with committing to the quest\n\n- The priority they place on getting certain kinds of cards out (deciding whether Unexpected Courage or a willpower ally should be played first, for example)\n\n- How willing they are to risk taking an undefended attack\n\n \n\nThere are undoubtedly more, but those are the ones that pop to mind first. In general, it seems like one of the central places that players could differ is in their general tolerance for risk-taking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015592","commentId":1015592,"userName":"Tracker1","timestamp":1395073868,"content":"> I've kind of curious about this myself. Not as in-depth as your experiment, mind you  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] , but I have wondered at how players differ in their choices and how much of an impact strategic decision-making has in this game. To my mind, there are a few places where players can and seem to differ in their strategy as opposed to the decks they build:\n> \n>  \n> \n> - How conservative/aggressive they are with committing to the quest\n> \n> - The priority they place on getting certain kinds of cards out (deciding whether Unexpected Courage or a willpower ally should be played first, for example)\n> \n> - How willing they are to risk taking an undefended attack\n> \n>  \n> \n> There are undoubtedly more, but those are the ones that pop to mind first. In general, it seems like one of the central places that players could differ is in their general tolerance for risk-taking.\n\nYes, those are some areas where even experienced players will vary based on different play styles, so it is unlikely that the same results would be seen under the guidelines I proposed, probably a very small chance that a game would be played exactly the same way, since there are so many minor decisions to be made.\n\nI have often heard that this game can be very mechanical with players just analyzing numbers, but if a player has a pool of 20 wp to commit to the quest how much do different players actually commit, and which characters will they select to quest? I am sure there would be lots of variety. All it takes is 1 Necromancer's Reach to change the number of allies in play, and how much progress would be placed on the quest would vary too, so players eventually would be starting different quest cards out of sync, and then it goes on and on from there.\n\nIt's hard to know how much variety is out there in player decisions without looking out some of these situations, but I am not sure what it adds to game play, although it might reveal the types of choices that are made that produce less desirable results compared to another choice. This all can get pretty complex throughout the entirety of a game.\n\nAlthough, It might not even be necessary to complete a whole game, instead players can just note where different decisions were made. This could happen early in the game, and if 2 players were near by they could check in after each round, and then discuss any differences in choices and why."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015636","commentId":1015636,"userName":"Spurries","timestamp":1395076400,"content":"You need to get on OCTGN and we can make this happen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015705","commentId":1015705,"userName":"ossderossmane","timestamp":1395079695,"content":"OCTGN is definitely the way to do that. Should be very possible to put the decks in random but identical orders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1015826","commentId":1015826,"userName":"joezim007","timestamp":1395084368,"content":"I have no doubt that players make different choices in these situations. I know this for a couple reasons:\n\n1) More than once I've gone back and changed decisions in the middle of a turn (only things that are completely retraceable obviously)\n\n2) Whenever I read people's playthroughs or watch them, I often find myself wondering why they aren't making certain choices. Dan from Hall of Beorn has always been great at relaying his reasonings, but even then I differ from him in many instances.\n\n \n\nI'm sure there will be many similar decisions, but I guarantee that there will be plenty of areas where they differ, just like people differ a lot when making decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1016184","commentId":1016184,"userName":"tacomen253","timestamp":1395104092,"content":"I think there is an optimal decision for every situation, except that very few has mastered their decks to the point where they know what the best decision is (I have yet to hardly master any decks). Also people do not always play with the exact same deck against the same quest deck all the time which means you may have to make some changes to your decisions based on the new cards and the old ones that left. If you play with a specific deck against a specific quest deck for long enough you can learn the best possible decision for every situation against that quest deck. So considering all the variables were equal between the two, after an extend period of training and coordination 2 people would make the exact same decisions. That is my hypothesis at least  ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1016201","commentId":1016201,"userName":"Tracker1","timestamp":1395105378,"content":"> I think there is an optimal decision for every situation, except that very few has mastered their decks to the point where they know what the best decision is (I have yet to hardly master any decks). Also people do not always play with the exact same deck against the same quest deck all the time which means you may have to make some changes to your decisions based on the new cards and the old ones that left. If you play with a specific deck against a specific quest deck for long enough you can learn the best possible decision for every situation against that quest deck. So considering all the variables were equal between the two, after an extend period of training and coordination 2 people would make the exact same decisions. That is my hypothesis at least  ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nThat may be the case, but it would take a number of plays to find out the best strategy, and each player, based on experience might come to the optimal solution at a different speed. My question really wants to know about the first attempt two players take at the same arranged encounter deck with the same player card deck. Will the follow the same decision tree, or will they deviate. Their chocies even if they are same may not be the best, since they still do not know what the encounter deck has in store.\n\nHere is an example, you have two leaderhip heroes and Spirit glorfindel in your deck. You draw steward of gondor and light of valinor in your opening hand and also have a 2 cost leadership ally in hand? How many players are going play those three cards opening round? Of course this may depend on the scenario, but for the most part i would think the large majority of players would play the cards. Chocies of how much will power to commit may be different, but in some case it will be the same. I tend to think that many players will follow a similar route at least for the first few rounds, and then things will probably start to deviate.\n\n@ Spurries I Need to get a PC to get on Octgn, it's on the wish list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1016577","commentId":1016577,"userName":"Tracker1","timestamp":1395150877,"content":"I have stepped this up a notch. Some one at the BoardGame Geek site indicated that this method was often used in some Card Game tournements. I think it would probably be a great way to conduct a tournament for Lotr LCG, because then ieach game is really is about each player's choices with all else being equal.\n\nI put together the following ideas to get the ball rolling.\n\nUnfortunately, it will be with actual cards.\n\nHere is what I am thinking to set it up.\n\nI'll create a pretty straight forward deck for players to use. It will only use one core set so not to exclude anyone. Currently I am thinking Eowyn, Glorfindel sp, and Beregond. Each has a pretty defined role. I'll also pick one scenario. I'm thinking 7th level, since I do not think the encounter deck is ever shuffled, unless the deck is reset, at that point if you have not won yet you automatically lose. I'm open to suggestion on either of those choices.\n\nWhat I'll do is post the player deck a few days in advance so players can build the deck, play a few games with it on 7th level or whatever. This way they can get accustomed to the deck and challenges of the scenario.\n\nNext, and this is the part where it get's a little tricky, I'll postthe encounter deck order and player card order in spoiler fashion with dropdown when clicked on. A participant must not click on that spoiler. They will need a friend or spouse set up the decks for them. Once the decks are set, do not shuffle! Play the game and record, What cards were played, how much willpower, and what characters were sent on the quest etc. the more detail the better. Final score would be calculated in the end with FFG scoring system, and a winner would be declared. I would be happy to make up a template to record the information on a form to make it easy fill out each round.\n\nI'd like to participate, and I really don't care if i win. So, ask (probably beg) my wife to shuffle and then type in the encounter sets and player card decks. You will just have to trust me on that, but even so I will forfeit my right to be winner, just in case others are concerned. Of course every one else would be under the same honor code so not sure i matters. This is for fun right.\n\nSo, I realize this would take a bit of investment in time and I am willing to give out some Geekgold for participating.\n\nIf you don't have a BGG account you could easily get one if this is important to you.\n\nThis is the breakdown based on the number of participants.\n\n51-100 participants each get 1 geekgold\n\n21-50 participants 2 GG each\n\n11-20 participants 5 GG each\n\n1-10 participants 10 GG each\n\nThe winner will get 30 Geekgold enough for an avatar! Or if you do not have BGG account I will always like your posts.\n\nOne disclaimer: if multiple people win with the same score I will not have enough GG, so the participant GG will only be awarded, and some extra depending on how close I am to Geek bankruptcy.\n\nAny thoughts on this? Anyone interested?\n\nEdited March 18, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1016584","commentId":1016584,"userName":"Fanfan","timestamp":1395151656,"content":"I am interested.\n\n \n\nJust an advice: avoid card that shuffle decks in your deck design.\n\n \n\nA suggestion for a pre-built deck: we could just use the pre-built mono-sphere base decks, or the ones from the hobbit expension. Some of the most mind-challenging games I have had were when playing Escape from Dol-Guldur 2-handed with 2 random basic 30-card decks. It is doable but not a walk in the park."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1016622","commentId":1016622,"userName":"Tracker1","timestamp":1395153610,"content":"> I am interested.\n> \n>  \n> \n> Just an advice: avoid card that shuffle decks in your deck design.\n> \n>  \n> \n> A suggestion for a pre-built deck: we could just use the pre-built mono-sphere base decks, or the ones from the hobbit expension. Some of the most mind-challenging games I have had were when playing Escape from Dol-Guldur 2-handed with 2 random basic 30-card decks. It is doable but not a walk in the park.\n\nGoodpoint, it might be good to use a deck i did not come up with.\n\nI looked theough some old FFG articles, and this Gondor deck might be suitable for 7th level.\n\nhttp://www.fantasyflightgames.com/edge_news.asp?eidn=4119 [http://www.fantasyflightgames.com/edge_news.asp?eidn=4119]\n\nThey had 4 decks from the Dwarodelf posted but I did not find any of them to intriguing. Also some Rohan decks were posted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1018130","commentId":1018130,"userName":"Spurries","timestamp":1395234024,"content":"Sounds fun.  Maybe someone nice can set up two OCTGN .08d files and post them somewhere, so participants wont need to look at them either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1018290","commentId":1018290,"userName":"Scroll Lock","timestamp":1395242042,"content":"Actually, the game won't be the same from 1st engaging with enemies. 1 more shadow card changes everything. But what about this: Shadow cards are dealt from the bottom of the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101528-lotr-lcg-experiment/?do=findComment&comment=1018529","commentId":1018529,"userName":"Tracker1","timestamp":1395249901,"content":"> Actually, the game won't be the same from 1st engaging with enemies. 1 more shadow card changes everything. But what about this: Shadow cards are dealt from the bottom of the encounter deck.\n\n \n\nI am not actually concerned with the encounter deck getting out of sync in different players games.  SInce the different choices they made are what get the decks out of sync, so there should definitely be some variety, as long as every one starts with the same set of circumstances, from that point it can go any direction.\n\n \n\nI 'm actually getting some pretty good interest over at the BGG site.  Maybe up to 10 participants total."}]}