{"url":"https://community.fantasyflightgames.com/topic/101651-lying-in-wait/","title":"Lying in Wait","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101651-lying-in-wait/?do=findComment&comment=1017142","commentId":1017142,"userName":"cyberlettuce","timestamp":1395178608,"content":"A question regarding the 'Lying in Wait' treachery card from the blood of Gondor. \n\n \n\nWhen Revealed: The first player turns each hidden card in his play area face up. Resolve the \"when revealed\" effects of each encounter card turned faceup by the effect. If a location is turned face up, add it to the staging area.\n\n \n\nWhat happens when an enemy is revealed by this card? Does it engage as normal or is it just discarded? I can see the card is tring to activate treachery and location hidden cards but the title 'lying in wait' suggests enemies are waiting to leap out as well..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101651-lying-in-wait/?do=findComment&comment=1017990","commentId":1017990,"userName":"alogos","timestamp":1395222275,"content":"Why would it be discarded ? just turn it face up..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101651-lying-in-wait/?do=findComment&comment=1020363","commentId":1020363,"userName":"Catastrophic09","timestamp":1395350747,"content":"Good question, this card isn't very clear for what to do with enemies and the title and picture certainly suggests enemies would attack you... however this is what I do: resolve anything that has \"When Revealed\" and if a card is a location add it to the staging area just as the card says to do but I also just discard enemies because the card doesn't tell you to add them to the staging area along with locations.  So I only do what the card says and discard enemies and this still is often a nasty effect and would make this scenario extremely difficult if you also added enemies to the staging area as you would be swamped activating all location, treachery and enemy cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101651-lying-in-wait/?do=findComment&comment=1020683","commentId":1020683,"userName":"alogos","timestamp":1395365549,"content":"Again... why do you want to discard enemies that are turned face up ?\n\n>  \n> \n>  \n> \n> When a player is instructed to turn his hidden cards\n> faceup, he turns each hidden card in his play area faceup\n> one at a time. If a player turns a hidden card faceup and\n> it is an enemy, he immediately engages that enemy. If a\n> player turns a hidden card faceup and it is a treachery or\n> a location, he immediately discards that card.\n\n \n\nThe card doesn't tell you anything special about enemies cards, so follow the basic rules."}]}