{"url":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/","title":"What makes Dain and Glorfindel so good???","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1019465","commentId":1019465,"userName":"Ozil23","timestamp":1395295123,"content":"Ok, so I have heard that the two most powerful heroes in the game are either Glorfindel or Dain. Therefore I would like to know why are they so great. What are your thoughts on theses 2 heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1019484","commentId":1019484,"userName":"lleimmoen","timestamp":1395298340,"content":"Spirit Glorfindel has the best ratio of threat cost / willpower; or threat cost / attack; or threat cost / hit points (closely followed by Beorn there) but the latter are probably not as important as the first.\n\n \n\nNow, when you take three heroes for a deck, you should look at their opening stats as the first round is often crucial for a further development of a quest. For a majority of quest you will be needing willpower from your heroes first (unless it is battle or siege, and for battle Glorfindel is just as good). At the same time, you might also be in need not to engage some enemies on round 1, usually unless you have some great combat prowess, usually connected to the Tactics sphere. And Glorfindel provides wonderfully in this regard (also considering Light of Valinor which can he pay for himself will allow him to both quest and attack with his great stats from round 1), and thus he fits perfectly almost every deck where you run Spirit cards. I do not think it is a problem as we should soon see decks that will either not have Spirit or will be based around trait synergies other than Noldor, and thus Glorfindel will not apply for such decks anyways, and will duly find his place with other Noldor or an all-over-the-place trait deck.\n\n \n\nAs I have just said in the other thread, I think Dain should get an errata, because he does not have any competition within the Dwarven trait, it makes no sense - mechanically - not to run him. But I never play him, and would always prefer the companions of Thorin (him included) for more entertainment.\n\nEdited March 20, 2014 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1019506","commentId":1019506,"userName":"Glaurung","timestamp":1395300898,"content":"From begin i always tell Beravur, Protector of Lorien cry for Errata…….  and now is there…….. Unlimited card draw in the game and unlimited hand size will bring to some new crazy  combo in the future no doubt….\n\n \n\nTo be honest i don't think now Dain need Errata……Now with a NMode he is ok. SInce without him Dwarfs will be suck all the time…….\n\n \n\nGlorifindel also very powerful hero……..But errata probably no…… Maybe Loragorn but…i see how is doom deck work so without him no one will play doom deck…..\n\n \n\nTo be honest i think now game is quite balanced…..But really what i talking about is N mode….. SInce Normal is to easy most of the time for power deck… And really serious game, rules clarification is not really needed until you start play a serious which is mean most of the time NM……\n\n \n\nFor Tournament i think just need to have a ban list of certain cards to make a deck building more interesting but this is a privilege of current Tournament Director."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1020166","commentId":1020166,"userName":"Noccus","timestamp":1395341203,"content":"> Ok, so I have heard that the two most powerful heroes in the game are either Glorfindel or Dain. Therefore I would like to know why are they so great. What are your thoughts on theses 2 heroes?\n\nIn a nutshell:\n\nGlorfindel: 5 threat instead of 12. Great stats, specially with 3 attack as a spirit hero.\n\nAdd to that: light of valinor, rivendell blade & asfaloth, and you got yourself a monster that can quest for free, hit hard, take 4 dmg, & eat locations. He fits almost every deck too.\n\nDain: less all round, but if you got a dwarf deck, he just buffs the whole **** club.\n\nJust stuff a load of dwarves in a deck with him and you will get the picture. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1020253","commentId":1020253,"userName":"leptokurt","timestamp":1395345715,"content":"They're not Fatty Bolger.\n\nEdited March 20, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1020327","commentId":1020327,"userName":"Demoncow","timestamp":1395349211,"content":"> They're not Fatty Bolger.\n\nFatty is the one and only hero in my card pool I have never used. His stats plus ability say it all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1020342","commentId":1020342,"userName":"Catastrophic09","timestamp":1395349723,"content":"They both come from a time where the game needed more powerful cards because many struggled with this games difficulty but I think they went too far for some, these two in particular.\n\nGlorfindel has the lowest threat in the whole game! and because threat is such a big aspect of this game you want heroes with low threat and then his stats are amazing and ability is easy to work around or nullify. Many cards play well with him also.\n\nAs for Dain his stats alone are great, he is the second best defender of heroes for the whole game! His ability is ridiculous even if you use him to defend because you still get a huge boost in willpower which is hard to come by and often you don't even need his attack bonus. His ability should be limited to characters under your control or allies only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101795-what-makes-dain-and-glorfindel-so-good/?do=findComment&comment=1020351","commentId":1020351,"userName":"FreddieG","timestamp":1395350201,"content":"We've been playing with:\n\n \n\nLeadership: Dain, Thorin, Gloin (or Bifur for easy mixed)\n\n \n\nTactics: Beorn, Gimli, Thalin\n\n \n\nAnd have been slamming through quests."}]}