{"url":"https://community.fantasyflightgames.com/topic/101753-sam-gamgee-engage-vs-engaged/","title":"Sam Gamgee - &quot;engage&quot; vs &quot;engaged&quot;?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101753-sam-gamgee-engage-vs-engaged/?do=findComment&comment=1018897","commentId":1018897,"userName":"Entilzah","timestamp":1395262138,"content":"This may seem silly, but we are having a disagreement about it.\n\n \n\nSam's card says that \"after you engage an enemy . . .\" you get the bonus. I understand that if you engage more than one enemy with higher engagement cost, his bonus [+1] stacks.\n\n \n\nThe disagreement is whether it only applies to the first time you engage an enemy or any time you are engaged with the enemy.\n\n \n\nFor example: using a Hobbit deck, I pull higher-cost enemies, but they sometimes take 2 turns to kill. If an enemy of higher cost is still in front of me the next turn, and I optionally pull another one, I have just newly engaged one, but I am then engaged with two enemies of higher cost. Does Sam's bonus only apply to the new one or to both of them? Should his card text be understood as, \"after you first engage . . . \"?\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101753-sam-gamgee-engage-vs-engaged/?do=findComment&comment=1019016","commentId":1019016,"userName":"GrandSpleen","timestamp":1395267245,"content":"Only applies to the new one.  \"Engage\" refers to the action of moving an enemy -- who is NOT currently in your play area -- into your play area.  \"Engaged\" refers to enemies that are currently in a player's play area.  \n\n \n\nUsually the enemy comes from the staging area, but with certain card effects it could also come from another player, or straight from the encounter deck (bypassing the staging area), etc.\n\n \n\n\"First, each player has the option to engage one enemy\n\nin the staging area. This is done by moving the enemy\nfrom the staging area and placing it in front of the\nengaging player.\" (manual)\n\n \n\nYou could buff Sam up with some card tricks, though not very practical ones.  If you were use a card like \"A Light in the Dark\" you could take an enemy who is already engaged with you, put him back into the staging area, then engage him again during the Encounter Phase or via a card like the new Westfold Outrider.  You would then get +1 for all of Sam's stats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101753-sam-gamgee-engage-vs-engaged/?do=findComment&comment=1020378","commentId":1020378,"userName":"Catastrophic09","timestamp":1395352045,"content":"Another question about Sam: you can only engage one enemy by your choice but what if an enemy engages you via encounter or quest card with a higher threat? The quest card on A Shadow of the Past says if you fail a hide test Nazgul enemies engage you- so you fail and then a Nazgul engages you, does Sam ready and get stat boosts and Pippin draws you a card if you had him also?? That seems too good and I would say you only activate their abilities if you engage enemies but it has been clarified that enemy cards trigger their engage abilities whether you engage them or they engage you- it's the same. So do you only get those hobbit bonuses if you engage?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101753-sam-gamgee-engage-vs-engaged/?do=findComment&comment=1020653","commentId":1020653,"userName":"alogos","timestamp":1395364377,"content":"Yes, you engaging enemies and enemies engaging you is the same."}]}