{"url":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/","title":"Shadow Cards for a second attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1018935","commentId":1018935,"userName":"Kcall07","timestamp":1395263838,"content":"When a shadow card instructs an enemy to make another attack do they get another shadow card? Many thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1018936","commentId":1018936,"userName":"Demoncow","timestamp":1395263888,"content":"Yes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1018972","commentId":1018972,"userName":"tacomen253","timestamp":1395265445,"content":"When an enemy makes an additional attack, discard all of its previously dealt shadow cards before dealing it a new shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1099918","commentId":1099918,"userName":"AlanRDH","timestamp":1401236391,"content":"Is there an official ruling on the \"yes\" answer and that the Shadow cards are discarded? I wondered about this question myself and came up with the following answer:\n\nOn page 18 of the rulebook, dealing Shadow Cards is part of the Combat Phase itself (at the very beginning of it), and is independent of the enemies' actual attacks. It states:\n\n\"At the beginning of the combat phase, the players deal 1 shadow card to each engaged enemy.\"\n\nAfter this comes 4 steps under the heading of \"Resolving Enemy Attacks.\" I would interpret the additional attack to do just these 4 steps, as the only time the players are instructed to deal Shadow Cards is when every engaged enemy gets one.\n\nIn regards to discarding Shadow Cards, at the bottom of page 20 the rulebook reads:\n\n\"At the end of the combat phase, discard all shadow cards that were dealt this round.\"\n\nSo if an enemy gets a Shadow that gives +1 attack and gets a 2nd Shadow that gives it an additional attack, it would have +1 attack for both attacks, and have no additional Shadow Card dealt (unless the Shadow Card specifically says to deal one, which some do). Then, at the end of the Combat Phase, all Shadow Cards in play are discarded.\n\nAny thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1099956","commentId":1099956,"userName":"PsychoRocka","timestamp":1401239179,"content":"But if the attack is outside of the combat phase, for example Huorns in Into Fangorn and the Dunland enemy who attacks every time you draw a card, then there is no shadow card dealt, correct?\n\n \n\nReally don't understand why a second attack during combat phase warrants a new shadow card as shadow cards are part of the combat phase itself and not just a built in rule for enemy attacks. I do obviously play that they get a second one if there is a second attack during combat but I'd like to see clarification that this is definitely the case as I really don't think it should be... its bad enough they are attacking a second time, do they really need a shadow effect that makes them attack a third time? or exhausts one character resulting in it being undefended etc? I know shadow (and treacheries) cards are more or less the main way the encounter deck puts the pressure on but is it really necessary for enemies to be dealt shadow cards when they make additional/extra attacks on top of the first official one that already has a shadow card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1099988","commentId":1099988,"userName":"GrandSpleen","timestamp":1401242149,"content":"Yes there is an official answer, it's in the FAQ:\n\n \n\n(1.42) Additional attacks by an enemy\nWhen an enemy makes an additional attack, discard all\nof its previously dealt shadow cards before dealing it a\nnew shadow card.\n \nedit: tacomen quoted that too but didn't give the source, so alan didn't recognize it as official... just clarifying here.\nEdited May 28, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1100033","commentId":1100033,"userName":"PsychoRocka","timestamp":1401246524,"content":"Yeah fair enough, I knew it was in there somewhere but wanted to see exactly what it said in case it was at all unclear or ambiguous. It does say \"additional attack\" so it seems to only affect enemies that are making an \"additional attack\" and not enemies attacking during say, the resource, questing or travel phase.\n\nTherefore:\n\nffg_haradrim-elite-hon.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_haradrim-elite-hon.jpg]\nWould not be dealt a shadow card for his forced attack when he enters play.\n\nffg_angry-huorn-voi.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_angry-huorn-voi.jpg]\nWould not be dealt a shadow card when it attacks during the resource phase\n\n \n\nand lastly\nffg_dunland-berserker-voi.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_dunland-berserker-voi.jpg]\nWould not be dealt a shadow card for his attacks when you draw\n\n \n\nDoes this all seem right? It does specify additional attacks and these are not additional attacks per say (in most cases are before the combat phase so are not additional and are before the combat phase regular attacks.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1100048","commentId":1100048,"userName":"GrandSpleen","timestamp":1401247588,"content":"These would all get shadow cards... There is a different piece in the FAQ that addresses it:\n\n \n\n(1.26) Enemy attacks outside of the combat phase\n\nIf an enemy attacks outside of the combat phase, it is\nstill dealt a shadow card at the beginning of the attack.\nThen follow the 4 steps under Phase 6 “Combat” in the\nrules. Any shadow cards dealt to the attacking enemy\nare discarded after the attack resolves.\nEdited May 28, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1100065","commentId":1100065,"userName":"AlanRDH","timestamp":1401249198,"content":"Thanks for the FAQ check GrandSpleen. Even though you are correct, I agree with PsychoRocka that an additional attack is brutal enough without a Shadow Card. But at least I now know how to resolve those additional attacks.\n\nEdited May 28, 2014 by AlanRDH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101755-shadow-cards-for-a-second-attack/?do=findComment&comment=1100091","commentId":1100091,"userName":"PsychoRocka","timestamp":1401250938,"content":"Yeah that's just brutal and retarded.... Ah well rules are rules =\\"}]}