{"url":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/","title":"New Breakfast Article- Gondor deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1020280","commentId":1020280,"userName":"Catastrophic09","timestamp":1395347478,"content":"Check out the new article [http://www.fantasyflightgames.com/edge_news.asp?eidn=4708] for refreshed interest in Gondor as it becomes a better support deck with the most newly developed Rohan cards available."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1020302","commentId":1020302,"userName":"Noccus","timestamp":1395348163,"content":"This is the part I like best in the article, a bit of a spoiler on what we can expect in the ring maker cycle:\n\nAnd the best part is, with The Ring-maker cycle on its way, both of these decks can hope to see a few new cards, including support for the Noble and Warrior traits to make Imrahil a true prince or Boromir a true captain, and you might even hear a famous song that Éomer once sang upon the fields of Pelennor as he unsheathed his sword…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1020328","commentId":1020328,"userName":"Catastrophic09","timestamp":1395349215,"content":"Yes! the end is the best part of the article!  It's occasionally nice to see decks and play suggestions but previews of what to come is so exciting!!  I'm really looking forward to seeing more support for traits: epic combat boosts for Warriors, power and splendor for Noble, Healer, Scout, there's tons of silly traits that have been thrown on many cards (craftsman, minstrel, archer) and a lot of traits have been inconsistent- the healer trait is on some cards but not all that actually have healing abilities.  So I'm hoping they continue, be more consistent and bring synergy for traits so we can built a Warrior deck or Noble deck and much more!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1020801","commentId":1020801,"userName":"Glaurung","timestamp":1395374672,"content":"To be honest all this deck building Threats is quite useless. Until they revealed some new cards or info…..\n\n \n\nBetter FFG give that Job for Tracker1. Will be much better…..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1020808","commentId":1020808,"userName":"Dain Ironfoot","timestamp":1395375307,"content":"> To be honest all this deck building Threats is quite useless. Until they revealed some new cards or info…..\n> \n>  \n> \n> Better FFG give that Job for Tracker1. Will be much better…...\n\nwell, the article did release new info.\n\n \n\nand they post deck/strategy articles for all the LCGs, and i think they are fun. it's nice to have something different between articles about cards.\n\n \n\ni'd rather have a deck article than nothing at all.\n\nEdited March 21, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1021023","commentId":1021023,"userName":"shoreless","timestamp":1395400744,"content":"I want an after action report of a two player game using this deck and the Rohan deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1021348","commentId":1021348,"userName":"lleimmoen","timestamp":1395417623,"content":"> To be honest all this deck building Threats is quite useless. Until they revealed some new cards or info…..\n> \n>  \n> \n> Better FFG give that Job for Tracker1. Will be much better…...\n\nOk, this is another example of your absolute nonsense. You really think you know who can play the game, right? Well, I have seen some pretty terrible decks made by you, to be honest. And if someone wants to see Tracker's decks, he can just go and see them on the boards. I myself prefer seeing something from the designers from time to time, though I do not always agree with the selection either (and I am sure I have made many useless decks myself). It is good to know what goes through the heads of those who create the challenges."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1021351","commentId":1021351,"userName":"lleimmoen","timestamp":1395417824,"content":"> Yes! the end is the best part of the article!  It's occasionally nice to see decks and play suggestions but previews of what to come is so exciting!!  I'm really looking forward to seeing more support for traits: epic combat boosts for Warriors, power and splendor for Noble, Healer, Scout, there's tons of silly traits that have been thrown on many cards (craftsman, minstrel, archer) and a lot of traits have been inconsistent- the healer trait is on some cards but not all that actually have healing abilities.  So I'm hoping they continue, be more consistent and bring synergy for traits so we can built a Warrior deck or Noble deck and much more!\n\nI would also like this best, but I do remain sceptical. Sometimes \"support\" for a trait only means a single card. I am not sure how much they can fill in this time, I sure do hope a lot. I would like to see many traits fleshed out, yes, not only nations but skills as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1021392","commentId":1021392,"userName":"GrandSpleen","timestamp":1395420357,"content":">  I would like to see many traits fleshed out, yes,\n> \n>  \n\n \n\nsomehow this phrasing struck me as very Gollum-esque."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1022161","commentId":1022161,"userName":"Tracker1","timestamp":1395456689,"content":"> To be honest all this deck building Threats is quite useless. Until they revealed some new cards or info…..\n> \n>  \n> \n> Better FFG give that Job for Tracker1. Will be much better…...\n\nHa, I can use the extra cash.\n\n \n\nEvaluating a decks usefulness i really in the eye of the beholder.  Every once in awhile I'll try to put a deck together that another player created, and it just does not work for me, even though they are having a blast playing it and they think it is quite good, and it probably is for them.  \n\n \n\nI am sure some players who try a deck of mine will not like the deck at all, and that's to be expected.  I'm actually kind of shocked when someone actually tries a deck.\n\n \n\nMany comments about a a players deck design in these forums are based on just a reading of the post.  So, unless we actually try the deck it's hard to know how well it works, and if the deck matches the creators play-style and not yours that deck might seem like crap if you tried it.\n\n \n\nThe bottom line for me is did I or the guy who created the deck have fun playing the deck, and did the deck try to do something a little different than what's already out there.  I really enjoy reading about those types of decks, even if the deck seems useless, because there might be some cool combo they are using that was not apparent to me before.\n\n \n\nI think a bit of a problem in this game, with it's limited card pool, is that many cool card combos are becoming too obvious, and it make it difficult for a deck builder to come up with something that feels really original.  If players don't feel this way let's start seeing some more decks out there in the strategy forum that give us all some more tools to work with.\n\n \n\nAnother problem, and this might sound kind of nutty, is we need some more broken cards.  Sure many of us hate these type of cards, but they certainly lead to some interesting deck designs.  The other thing is that right now many of the really good decks already rely on broken cards and combos, and basically I want more broken cards to choose from, rather than relying on the same set of cards.  Look, I would rather have a bunch of interesting powerful cards to build decks around then a bunch of well balanced sh*tty cards sitting in a box.  I'd rather build lot's of different power decks that have a chance at beating a number of scenarios, then build a unique deck of crappy cards that only works on a few quests.  \n\n \n\nBasically, I want to have lot's of really great player cards to choose from that replace the old crutches, and become new crutches, then I can mix and match crutches. let's face it balanced cards are boring, but I will work **** hard to try and make them exciting, but in the end I'll still just go back to the crutches because they get the job done. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/101856-new-breakfast-article-gondor-deck/?do=findComment&comment=1022185","commentId":1022185,"userName":"Tracker1","timestamp":1395458674,"content":"I just wanted to clarify something in my post above, calling for more \"broken cards\".\n\nI don't mean broken like they just destroy all game mechanics infinite loop type stuff.\n\n \n\nI think a real problem for deck combinations lies with the heroes we have.  we have some pretty good player cards, but the heroes really limit creating more cool decks then there already are. the big problem lies in the threat cost.\n\n \n\nI am absolutely sick of 11+ threat heroes.  It's difficult to  create a deck with 3 heroes like this if the starting threat is too high.  Why do the majority of heroes need to have there stats sum up to their threat?  Of course, sp glorfindel is going to be abused.  the problem is now that his hero exists, if they do more low threat heros with powerful stats there is nothing to prevent paring them together, unless there is some restriction about those types of paring.   Even 2 threat less then the sum of a hero's stats could make a card  more playable with some other high threat heroes.  I think this is a area that can be played arond with a bit more, since I am kind of tired of this formula.  It is really starting to limit the stat distribuion that heros can have, and pretty soon all heroes are going to start to look the same, other than special ability.  Why not have a 1/1/1 7 hp hero for 8 threat cost, or a 3/0/3 3 hp hero for 7 threat, or a 0/6/0 1 hp hero  for 8 threat.   Whacky combinations could be quite cool, and make deck building choices more interesting.  "}]}