{"url":"https://community.fantasyflightgames.com/topic/101901-my-solo-challenge-and-to-glaurung/","title":"My Solo Challenge (and to Glaurung)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101901-my-solo-challenge-and-to-glaurung/?do=findComment&comment=1020779","commentId":1020779,"userName":"Troymk1","timestamp":1395372179,"content":"So Firstly, After making exclusively Dwarf Decks to play through the Hobbit Saga Quests, I resolved to make entirely new decks to get away from that paradigm. Also since The New Cycle would be based around Gondor (This was some months ago) I determined that I would make decks containing NO Dwarf or Hobbit Heroes. \n\n \n\nI wanted my friends to be able to pick up and play these decks fairly easily so I created the following\n\n \n\nAn Outlands Deck\n\nAn Elrond/Vilya Deck\n\nAn All Tactics Deck\n\nA Rohan Deck\n\n \n\nI recently went back to these and re-tweaked them with all the cards that have come out. \n\n \n\nThe heroes being used are Aragorn, Boromir, Hurluin (All Leadership)  31\n\nElrond, Glofindel (Spirit) and Beravor   28\n\nBeregond, Eomer, Hama (All Tactics)   29\n\nEowyn, Dunhere, (Both Spirit) & Theodred (Leadership) 25\n\n \n\nAnyway I am currently going back through the Heirs of Numenor deluxe set quests and laughing at how ridiculously hard the quests are with 4 players.\n\n \n\n \n\nI challenge anyone to set up a 4 player solo game just to have a look at the difficulty, but mainly this goes out to Glaurung \n\n \n\nYou have to be consistent in how you place everything. You can see in the photo attached that I have the encounter deck and staging area upper middle and two decks to either side.  Cards in play are vertical to me and my hand(s) are horizontal at the sides of the table \n\n \n\nAlso certain memory tricks do help, for example characters committed to a quest get tilted 45 degrees, whereas characters exhausted for other reasons get the full 90 degree turn. \n\n \n\nhttp://www.boardgamegeek.com/image/1965837/troymk1 [http://www.boardgamegeek.com/image/1965837/troymk1]\n\n \n\nBasic sequence of play is plan your turn for 20 minutes, then execute the Quest phase and watch the pandemonium as at least 4 encounter cards hit the table :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \nIt's a totally different experience  have fun gentleman (and ladies)\n \nYours\n \nTroy"}]}