{"url":"https://community.fantasyflightgames.com/topic/101915-victory-points/","title":"Victory Points","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1020990","commentId":1020990,"userName":"Mndela","timestamp":1395397114,"content":"Sometimes i seem that victory points system is useless, or at least out of phase.\n\n \n\nI think it was good at the first of game, in the core. But when system-log was fixed (about +10 points each round), the victory points became very old face.\n\n \n\nI'd suggest: a new system, but simply: in the final score, victory points are multiplied by number of rounds....\n\n \n\n--> victory points x number of rounds\n\n \n\n \n\nThen victory would make more sense, in the actual score system\n\nEdited March 21, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1020999","commentId":1020999,"userName":"MyNeighbourTrololo","timestamp":1395397935,"content":"The point of victory points is not just score. The main purpose of them is gameplay one - complete removal of given adversary from the game once legally gotten rid of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1021001","commentId":1021001,"userName":"Nerdmeister","timestamp":1395398015,"content":"So you would prefer to penalize a long game much harder than the +10 points/round and reward people who play threat reduction ludicrously much?\n\n \n\nI am personally not a fan of the +10 points/round because it rewards fast decks. But to shift it to a system which rewards both fast play (even more) and threat reduction (by the vast amount this suggestion entails) is an even worse idea IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1021020","commentId":1021020,"userName":"Mndela","timestamp":1395400420,"content":"mmmmh, i see,\n\nmaybe is too much victory points x number of rounds.\n\n \n\nBut i dont know, i feel actually is too few. When you reach to kill the troll, even 2 trolls! (Anduin) and you only gets 8 victory points..., how i say.... better not combat against the 2nd troll.\n\n \n\n \n\nIn LOTR-LCG, could be good try to search cards with victory points even if they are hard to defeat.\n\nEdited March 21, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1021029","commentId":1021029,"userName":"Nerdmeister","timestamp":1395401276,"content":">  \n> \n> But i dont know, i feel actually is too few. When you reach to kill the troll, even 2 trolls! (Anduin) and you only gets 8 victory points..., how i say.... better not combat against the 2nd troll.\n> \n>  \n\n \n\nI might be misinterpreting you (and please tell me if I do) but it sounds like you want to ad the victory points from defeated encounter cards to your score.\n\nIn this game you subtract the encounter card victory value from your score, because a low score is what you want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1021166","commentId":1021166,"userName":"Mndela","timestamp":1395410832,"content":"Yes, of course, you are ok. Me too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/101915-victory-points/?do=findComment&comment=1021281","commentId":1021281,"userName":"joezim007","timestamp":1395415240,"content":"Yea, he's saying to multiply the victory points by the number of rounds, then subtract that number from the score. This is completely ridiculous though, especially when we're talking about The Hills of Emyn Muil, where you're required to get 20 victory points, which would mean that you should stall the game as long as possible because every round will end up subtracting 10 points from your score instead of adding 10, so you could potentially get a large negative number for the score.\n\nThis applies to any quest where you can attain more than 10 victory points.\n\nEdited March 21, 2014 by joezim007"}]}