{"url":"https://community.fantasyflightgames.com/topic/102023-few-questions-during-roast-mutton/","title":"Few questions during Roast Mutton","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102023-few-questions-during-roast-mutton/?do=findComment&comment=1022417","commentId":1022417,"userName":"talbot","timestamp":1395491964,"content":"Here's a two that came up last night:\n\n \n\nCan a Sacked character's attachments trigger? Specifically can I trigger Goblin Cleaver if it is attached to a Sacked character. I would think that the intent of the game seems to say no - but I suppose an argument can be made that the character isn't doing the triggering. Since my wife was getting frustrated after several losses to this deck we let it trigger.\n\n \n\nAfter that...\n\nEnd of the game approaches and success in sight. We have 2 cards left in the encounter deck. Troll Cave is the current location. We quest like mad; well enough to defeat the 5 threat that is already in the staging area already (3 times over in fact!) Problem is we stage the two cards and now the encounter deck is empty. Do we even finish resolving the last card? Or get to successfully finish questing and finish exploring Troll Cave?\n\n \n\nRoast Mutton 2B says Forced: If there are no Troll enemies left in play, or if there are no cards left in the encounter deck, advance to the next stage.\n\n \n\nDoes the fact that we had a active location get in the way of the quest stage advancing? If not, what happens to a active location if the quest it is on advances?\n\n \n\nWe look forward to your insights!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/102023-few-questions-during-roast-mutton/?do=findComment&comment=1022478","commentId":1022478,"userName":"GrandSpleen","timestamp":1395497592,"content":"You can use attachments as per usual even when the character is sacked.  It's not very thematic, but there's nothing in the rules to prohibit it.  Feel free to 'house rule' it if you want a more thematic experience :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAs for the troll cave, I think the Forced effect will have to trigger before you have a chance to place any progress tokens, if you have revealed the last cards in the deck during the staging step.  But I'd like to hear others' thoughts as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102023-few-questions-during-roast-mutton/?do=findComment&comment=1022672","commentId":1022672,"userName":"alogos","timestamp":1395515325,"content":"Well, you have to advance to the next stage. Having a current location does not change anything because it's an effect, not a regular advancement.\n\nMoreover, you will advance before resolving the last card drawn, because they are considered out of the deck before you reveal them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102023-few-questions-during-roast-mutton/?do=findComment&comment=1024613","commentId":1024613,"userName":"talbot","timestamp":1395677474,"content":"Thanks all!"}]}