{"url":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/","title":"Riddling Gollum","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1022847","commentId":1022847,"userName":"Bodasafa","timestamp":1395530817,"content":"Any suggestions on how to keep Bilbo alive? The most travel tokens I have been able to get on him before he fails 3 riddles and dies is 4 tokens. Without attachment or Treasure cards assigned to him he takes one damage token everytime Gollum attackes him. I drew a Bilbo treasure card but as far as I know I can't attach it to him. Drawing double the cards in the staging area during every quest phase is hard but managable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1022891","commentId":1022891,"userName":"GrandSpleen","timestamp":1395534136,"content":"You either leave it to luck, or you design your deck to make answering riddles easier.  This means including lots of cards from the same sphere (monosphere is at an advantage here) and lots of cards of the same type (allies!) and lots of cards of the same cost, just as much as you can stomach it.  This really stacks the odds in your favor when you answer riddles.\n\n \n\nAnd in truth, I've never done that... never needed to.  But knowing your deck composition is really important if you want to increase your chances of guessing correctly.  Once I made a spreadsheet of all the cards in my (and my partner's) deck by sphere, cost, and type, and crossed them off as I went along, keeping a running tally of the number of cards remaining for each sphere/type/cost so I could guess more accurately.  Bleh, what a headache!  I prefer the drama of just guessing these days."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1023109","commentId":1023109,"userName":"Glaurung","timestamp":1395554480,"content":"There is actually no way to save Bilbo. But mono decks is really good against this quest. What i like about it is very unpredictable and you you never know what can happen. It is like a Nightmare in normal! Cool quest! We play it 2 days ago with very powerful mono deck (leadership and spirit) and was destroy it by Gollum and wolfs on  the last stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1023157","commentId":1023157,"userName":"Mndela","timestamp":1395567074,"content":"I usually play here an spirit monosphere. Tones of allies with 2 cost. You win the riddles sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1024109","commentId":1024109,"userName":"JsBingley","timestamp":1395640414,"content":"Bring all 3 cost dwarf allies in your deck ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102067-riddling-gollum/?do=findComment&comment=1024377","commentId":1024377,"userName":"FreddieG","timestamp":1395670798,"content":"Echoing the mono-sphere."}]}