{"url":"https://community.fantasyflightgames.com/topic/102130-engaging/","title":"Engaging!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102130-engaging/?do=findComment&comment=1023678","commentId":1023678,"userName":"Aladdynsane","timestamp":1395606567,"content":"Hello everyone! This is my first post on the forums and unfortunately I can't find a search function, though I cannot imaging someone has not asked this question before. Then again, maybe I'm overthinking it and it is obvious to everyone else. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nMy question - is there a difference in a player optionally engaging an enemy and it being forced to engage a player because of their threat level? For example, some enemies read, \"After [this enemy] engages a player, [this bad thing happens.]\" Can you get around that type of effect by optionally engaging an enemy, thus you are engaging it, it doesn't engage you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102130-engaging/?do=findComment&comment=1023710","commentId":1023710,"userName":"zeb","timestamp":1395608306,"content":"No, engaging is the same either way. This has been clarified in the rulebook:\n\n \n\n\"Whether an enemy is engaged through an engagement\n\ncheck, through a card effect, or through a player’s\n\nchoice, the end result is the same, with the enemy\n\nand the player engaging one another. In all cases, the\n\nplayer is considered to have engaged the enemy and the\n\nenemy is considered to have engaged the player\"\n\n \n\nYou have to use some Responses to cancel the bad things!\n\nEdited March 23, 2014 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102130-engaging/?do=findComment&comment=1023730","commentId":1023730,"userName":"Aladdynsane","timestamp":1395609956,"content":"Thanks. Not sure how I missed that portion of the rulebook. Guess I've been playing that wrong. No wonder I've had that feeling lately that I've been \"cheating\" the game in some way. I play solo so I don't have anyone to double check me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102130-engaging/?do=findComment&comment=1023779","commentId":1023779,"userName":"zeb","timestamp":1395613421,"content":"Don't worry, this has been asked many times!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102130-engaging/?do=findComment&comment=1024395","commentId":1024395,"userName":"FreddieG","timestamp":1395671455,"content":"I was unable to get my brain around all the rules just by referencing the rule book. The only way I learned was to get your hands dirty playing and check out anything that doesn't make sense. Also, just reading through this form, starting from the early posts, really sheds a lot of light on common misunderstandings.\n\n \n\nBTW, the search is at the very top of the page - very, very top - above the navigation bar.\n\n \n\nAnd remember, it's a game, not a religion - play for enjoyment."}]}