{"url":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/","title":"Do you like the Corse Set?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028276","commentId":1028276,"userName":"Gizlivadi","timestamp":1395873610,"content":"I was wondering as of recent on your opinion... what do you guys think of the core set of this game, like, as a product, without considering the expansions? The balance, characters, art, etc Like just a game in its own.\n\n \n\nI personally dislike the core set, especially compared to other expansions, not because of the balance of spheres, but because I don't really like the setting and art... I know what they were going for, but it's just not my taste really.\n\nEdited March 26, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028323","commentId":1028323,"userName":"iznax","timestamp":1395875957,"content":"The setting is really a mater of taste 100% so this is relevant. Beyond that the core set of every LCG is more like a demo game and in LOTR this more the case, 30 card deck is not even a \"real\" one if you know what i mean and the deck building options, which is 50% of the game, are almost none. The 3 quest tho are great, an excellent introductory quest, one of the best all around quests and one of the best (if not the best) hard quests.\n\n \n\nP.S. sry for my english."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028327","commentId":1028327,"userName":"Gizlivadi","timestamp":1395876240,"content":"Lol screw it just noticed Corse set, I f***** up, someone should change it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028342","commentId":1028342,"userName":"DevastazioneH88","timestamp":1395876879,"content":"I think the core set is one of the best products they printed. It has a setting that I personally enjoy, balanced heroes, pretty good art (in my opinion), and a great pool of cards (most of them are so useful as to be still used massively in many decks)...If I had to vote for best single product choosing from the Core Set, all the APs, Saga Expansions, Deluxe Expansios and POD I think I would probably vote for the Core Set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028546","commentId":1028546,"userName":"Glaurung","timestamp":1395889023,"content":"Hmmmm if you don't  like a core set how you cam like the game at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1028791","commentId":1028791,"userName":"Kcall07","timestamp":1395913288,"content":"I agree. I find the core set to be one of the games weakest products. The setting, the art and the difficulty spikes especially. I really started to get into the game during KD and Dwarrowdelf. I'm glad they're are nightmare versions of the core quests now as I prefer to play them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029028","commentId":1029028,"userName":"Bullroarer Took","timestamp":1395931450,"content":"I find it too rough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029080","commentId":1029080,"userName":"Noccus","timestamp":1395933329,"content":"Obviously, it was their start on the game mechanism, so there's bound to be some faults and stuff to smooth out.\n\nActually, the 2nd quest is still largely viewed as a well balanced quest.\n\nThe first is just a demo but works fine as well.\n\nYet they did go a little overboard on the last one, specially with the few cards people had to choose from at the time.\n\nI think the decks are ok for a 30 card set only.\n\nThey give a pretty good idea on what each sphere is good at.\n\nFor me, the only really dumb thing is the lack of 3 copies of every card.\n\nBut this has been discussed so many times, let's not go there.\n\nSo yea, I like the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029081","commentId":1029081,"userName":"Distractionbeast","timestamp":1395933448,"content":"I liked the core set a lot when I was first introduced to it.  I love Tolkien and I love card/board games (especially co-op), so it was a perfect fit for me.  The mechanics were intriguing and the quests showcased the potential for me.  Deckbuilding was difficult of course, but at the time, Dwarrowdelf was already out, so I knew all I needed was to start collecting to get a better experience.  Overall, it sold me on the concept, so I'd have to give it a big thumbs up!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029114","commentId":1029114,"userName":"Raven1015","timestamp":1395934723,"content":"It's hard for me to be at all objective, since I have such nostalgic love for the Core Set. Overall, I think it was good for what it was, my main gripe would just have been better help for new players. New players should not have to go to a forum to figure out that the reason they're losing is because you can't win with a mono-Tactics Core Set deck. There should have been, at minimum, some pre-built dual-sphere deck lists in the instruction manual for players to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029339","commentId":1029339,"userName":"danpoage","timestamp":1395943106,"content":"Agreed, I definitely have nostalgia for the Core Set. If it wasn't as good as it is, I never would have started playing this game.I do wish that the starter decks were designed differently. If I had a honey cake for every time I heard a new player ask about using the Tactics starter deck against Passage Through Mirkwood, I would have a trove of desserts. It makes little sense to me that a good portion of the cards in the Core Set cannot be played, as-is, against the Core Set scenarios. There is so much to like about this game, but I do wish that the Core Set was a smoother introduction for new players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1029865","commentId":1029865,"userName":"Mndela","timestamp":1395965816,"content":"My opinion:\n\n \n\nThe core set alone is not good game, because it was designed for being only the first step of a very big game. So thinking about it as alone, it is an incomplete game.\n\nBut comparing with another steps (for example, expansions), core set is one of the better works of the all game, even until today. By lots of reasons: card effects, characters, quests, artwork..., and a long etc.\n\nEdited March 28, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1038839","commentId":1038839,"userName":"FeloniusBard","timestamp":1396643491,"content":"I think general consensus both here and at places like BoardGameGeek is that the core set is \"good\" in that it's the introductory starting point to a fantastic game.\n\n \n\nThe actual product itself is largely incomplete---and the \"incompleteness\" feels purposeful. Fantasy Flight produced it fully intending that people were going to buy multiple expansions, and / or two core sets out of the gate.\n\n \n\nOh, and let's not even mention the ridiculousness of the setup for the box itself in actually storing the cards, tokens, and counters. \n\n \n\nIn my opinion the core set should have included 2 copies of 12 different cards per sphere for a total of 96 cards + 4 Gandalfs = 100 total player cards . . . or exactly enough for two full player decks. I'd have included the first two quests, and stripped out the Dol Guldur quest entirely (who can beat it with just the core cards anyway? Totally ridiculous to include it). I'd have included an additional 4 heroes, and lowered the overall MSRP to $29.99. \n\n \n\nThen, for $29.99, introduce \"Deluxe Expansion 1,\" which includes another 80 player cards (10 new cards per sphere x 2 copies each), another 4 heroes, the Dol Guldur Expansion, and another quest that acts as an intro to the Mirkwood cycle.\n\n \n\nOr, just bite the bullet, and put the Core + Deluxe Expansion 1 into a \"master\" set for $60. \n\n \n\nThen for $19.99 each, I'd have released a core deck \"booster\" for both the core and Deluxe 1, which would include an additional 2 copies each of the player cards in the set. These would only include the player cards; no additional heroes or quests. \n\n \n\nThus, you have multiple ways to fill out your initial decks. You can pick up just the core, and have two full decks; you can pick up the Core + Deluxe 1 to get 3 full decks; get Core 1 + the Deluxe booster if you only want player cards; Core + Core booster and have 4 copies of the core, or all four products and have 4 copies of each of the core and Deluxe 1 cards. \n\n \n\nThis way, you're not overpaying twice for a core set just to get more player cards, where the extra heroes and encounter cards are a total waste of money. \n\nEdited April 4, 2014 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102422-do-you-like-the-corse-set/?do=findComment&comment=1039380","commentId":1039380,"userName":"Olorin93","timestamp":1396700525,"content":"I like the core set, but I got into this game relatively late and so bought APs and expansions almost immediately. I imagine the deck-building options must be very limited with the core set only. It's a good box, though. I like the art and heroes, and I think the threat trackers, rule book and other accessories have a \"quality feel\" to them.\n\n \n\nI do think the core set could have included some beginner guides, though, including the suggestion not to play mono-sphere decks (at least not in solo play) if you keep losing."}]}