{"url":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/","title":"Bofur/Nori related question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028050","commentId":1028050,"userName":"silverthorn","timestamp":1395862601,"content":"If I play Bofur for one resource and then use Nori's ability to reduce my threat then Bofur goes back to my hand would I get the threat reduction if I play him again next turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028122","commentId":1028122,"userName":"GrandSpleen","timestamp":1395865503,"content":"This used to work, but it was pretty broken and has since received errata.  Nori's response (see the current FAQ) should read:\n\n \n\n\"Response: After you play a Dwarf character from your hand, reduce your threat by 1.\"  (his response used to trigger whenever a dwarf \"entered play\")\n\n \n\nBofur's ability allows you to \"put Bofur into play from your hand.\"  The wording here is important: \"put into play\" simply \"play\" are different and interact with rules differently.  Nori's response will not trigger when using Bofur's ability because he is not \"played\" from your hand, but \"put into play\" from your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028200","commentId":1028200,"userName":"silverthorn","timestamp":1395868229,"content":"Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028585","commentId":1028585,"userName":"kyrie","timestamp":1395891739,"content":"Here's the ruling he is referring to:\n\n \n\n(1.16) The phrase “put into play” \nIf a card effect uses the phrase “put into play,” it means \nthat the card enters play through a card effect instead \nof through the normal process of paying resources and \nplaying the card from hand. “Put into play” effects \nare not considered to be playing the card, and will not \ntrigger any effects that refer to a card being played. \n“Put into play” will, however, trigger any effects that \noccur when a card “enters play”.\n \nNori OHUH 3 \nShould read: “Response: After you play a Dwarf \ncharacter from your hand, reduce your threat by 1.\n \n \nHowever, I simply ignore the errata Nori received so that I can benefit from his threat reduction more, especially from card effects such as A Very Good Tale. Otherwise, his effect is minimal because with Dwarves you tend to bring them into play through unconventional means. In my opinion, I don't think the combo was broken (not anymore than Dain Ironfoot or Glorfindel at least). That's the nice thing about this game, you can play with or without errata, depending on what experience you want to have.\n \nTo each his own in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028736","commentId":1028736,"userName":"Nerdmeister","timestamp":1395905054,"content":">  \n> \n>  I don't think the combo was broken \n> \n>  \n\nYes it was.\n\nBringing characters into play through unconventional means is usually reward enough in itself. Adding threat reduction to that (and basically voiding all other threat reduction cards) was simply just too much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102406-bofurnori-related-question/?do=findComment&comment=1028948","commentId":1028948,"userName":"GrandSpleen","timestamp":1395927710,"content":"The Bofur/Nori combo alone was enough to negate one of the game's basic functional mechanics (+1 threat each turn).  That was a problem.  But as you say, to each his own and no one's forcing you to play with errata."}]}