{"url":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/","title":"Hero Count (2014 update)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1029981","commentId":1029981,"userName":"Pharmboys2013","timestamp":1395976550,"content":"To start, all the credit goes to user Ileimmoen for originally creating this topic idea and compiling this complex list.\n\n \n\nAs we wait for the Dunland Trap to drop and wait in eager anticipation of other AP announcements, I thought it would be a good time to revive the list to try and gain some perspective into what we may see for the rest of the Ring Maker cycle\n\n \n\nTactics 13\n\nLegolas (Silvan), Gimli (Dwarf), Thalin (Dwarf), Brand Son of Bain (Dale), Boromir (Gondor), Elladan (Noldor), Háma (Rohan), Beorn (Beorning), Beregond (Gondor), Bard the Bowman (Esgaroth), Théoden (Rohan), Merry (Hobbit), Eomer (Rohan)\n\nLeadership 12\n\nAragorn (Dúnedain), Théodred (Rohan), Glóin (Dwarf),  Imrahil (Gondor), Dáin Ironfoot (Dwarf), Elrohir (Noldor), Thorin (Dwarf), Boromir (Gondor), Balin (Dwarf), Hirluin the Fair (Outlands), Sam Gamgee (Hobbit), Celeborn (Silvan)\n\nSpirit 12\n\nEleanor (Gondor), Dúnhere (Rohan), Éowyn (Rohan), Frodo Baggins (Hobbit), Dwalin (Dwarf), Glorfindel (Noldor), Nori (Dwarf), Óin (Dwarf), Pippin (Hobbit), Caldara (Gondor), Fatty Bolger (Hobbit), Unconfirmed hero from \"The Three Trials\"\n\nLore 13\n\nGlorfindel (Noldor), Beravor (Dúnedain), Denethor (Gondor), Bilbo Baggins (Hobbit), Bifur (Dwarf), Aragorn (Dúnedain), Elrond (Noldor), Ori (Dwarf), Bombur (Dwarf), Mirlonde (Silvan), Faramir (Gondor), Pippin (Hobbit), Grima (Rohan)\n\n \n\nNoldor 5* (Tactics 1, Leadership 1, Spirit 1, Lore 2)\n\nSilvan 4 (Tactics 1, Leadership 1, Lore 1, Unconfirmed hero from \"Trouble in Tharbad\")\n\nDúnedain 3* (Leadership 1, Lore 2)\n\nGondor 8* (Tactics 2, Leadership 2, Spirit 2, Lore 2)\n\nOutlands 1 (Leadership)\n\nRohan 7 (Tactics 3, Leadership 1, Spirit 2, Lore 1)\n\nEsgaroth 1 (Tactics)\n\nDale 1 (Tactics)\n\nBeorning 1 (Tactics)\n\nHobbit 7* (Tactics 1, Leadership 1, Spirit 3, Lore 2)\n\nDwarf 12 (Tactics 2, Leadership 4, Spirit 3, Lore 3)\n\n \n\n*including the double (Glorfindel, Aragorn, Boromir, Pippin)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1030095","commentId":1030095,"userName":"lleimmoen","timestamp":1395990645,"content":"Oh yeah. I should have, haha. I have always been interested in statistics.\n\nIn the future, we could have the list with all the traits, including warrior, ranger, noble, etc., there are not so many afterwards. I might do it after this cycle is over.\n\nAs for the prediction for the pack 2 and 3 of the cycle Dúnedain Spirit hero for the former and Silvan Lore hero for the latter (ffg-made, featured on the cover of the box and Haldir of Lórien)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1030936","commentId":1030936,"userName":"Pharmboys2013","timestamp":1396043496,"content":"> Oh yeah. I should have, haha. I have always been interested in statistics.\n> \n> In the future, we could have the list with all the traits, including warrior, ranger, noble, etc., there are not so many afterwards. I might do it after this cycle is over.\n> \n> As for the prediction for the pack 2 and 3 of the cycle Dúnedain Spirit hero for the former and Silvan Lore hero for the latter (ffg-made, featured on the cover of the box and Haldir of Lórien).\n\n \n\nI agree that a dunedain spirit hero is all but a lock for the 2nd AP.  I really want to see Haldir as the hero for the 3rd AP and it would make the most sense to keep him Lore but I can see FFG changing his sphere like they did with Haldir or just going completely out there with a non-canon hero (although i think the latter is less likely considering the likelihood of getting a FFG created hero before hand)\n\n \n\nIf we do get a lore hero in the 3rd AP i'd be surprised if we get any more Lore heroes the rest of the cycle.  We'll almost certainly get another spirit and leadership hero between the 4th-6th AP or else their counts will be as many as 2 behind the other spheres.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1031342","commentId":1031342,"userName":"Scroll Lock","timestamp":1396098327,"content":"Against the Shadow had 2 heroes for each sphere. I think that will happen in each cycle since now. And The Road Darkens will give that 1 hero to spirit or leadership."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1031358","commentId":1031358,"userName":"MyNeighbourTrololo","timestamp":1396101023,"content":"> Against the Shadow had 2 heroes for each sphere. I think that will happen in each cycle since now. And The Road Darkens will give that 1 hero to spirit or leadership.\n\nOr neutral."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102548-hero-count-2014-update/?do=findComment&comment=1031548","commentId":1031548,"userName":"lleimmoen","timestamp":1396119859,"content":"Yeah, Denethor and Faramir go against the stream, their ally versions not matching their hero ones. But then again, it seems very likely that soon we will see ally versions of heroes who already feature twice (Boromir, for instance, very likely for the saga), so it is bound to happen.\n\n \n\nTwo for each sphere (delux plus cycle) seems only natural to me."}]}