{"url":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/","title":"Beginner decks questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032189","commentId":1032189,"userName":"shimond","timestamp":1396189296,"content":"Hi guys, \n\n \n\ni bought the game some time ago but i start playing recently, i only own the basic set:\n\n \n\n- Are the 30 cards basic deck enough to play all 3 adventures of basic set?\n\n- Is it possible to create 50 cards decks with only basic set?\n\n- what is a good initial mix of heroes/spheres to start deckbuilding? Does it make sense to do it with only starter set?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032194","commentId":1032194,"userName":"MyNeighbourTrololo","timestamp":1396189807,"content":"1) First quest - probably. Second quest is extremely strong and will require some fine deck tuning. Third quest is almost impossible, good luck on this one.\n\n2) Technically it is possible. Really - not needed.\n\n3) You won't go far by monosphere decks from core set so you'll need to mix them if you want any chance of winning.\n\n \n\nhttp://www.boardgamegeek.com/article/15143183 [http://www.boardgamegeek.com/article/15143183]\n\nCheck this article. Will do ya good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032199","commentId":1032199,"userName":"shimond","timestamp":1396190268,"content":"Extremely useful answers, thanks.\n\n \n\nAs follow up questions:\n\n \n\n- Suggestion for a deck built with basic set? 3 heros / 2 spheres?\n\n \n\nWhat about Aragorn + 1 other leadership hero + Eowin?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032203","commentId":1032203,"userName":"MyNeighbourTrololo","timestamp":1396190500,"content":"Check the article I linked in my post, It'll answer most of your questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032206","commentId":1032206,"userName":"shimond","timestamp":1396190977,"content":"thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032398","commentId":1032398,"userName":"Scroll Lock","timestamp":1396206320,"content":"If you want to play Aragorn, try him with Theodred. Interesting combo.\n\nFor Journey along the Anduin I approve Denethor-Eowyn-Dunhere. That is the 1st deck I won with against that quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032407","commentId":1032407,"userName":"tacomen253","timestamp":1396206924,"content":"That link has a good article. I do not believe your core set deck for solo is written in stone though. I believe your deck should be whatever spheres you think you work best with is. Also the deck in that article does not meet the minimum 50 cards required for a legal deck (although I agree a solo 50-card deck  is difficult with only 1 core set).\n\n \n\nWhen I got my single core set in December I played every sphere in just about every way I can to find out what worked best for me. Unlike a lot of solo players I never play with the spirit sphere as I am just terrible with it. The spheres I play best with is leadership/lore, and I was able to beat Passage Through Mirkwood, and Journey Along the Anduin with a legal deck only using 1 core set (you wont beat Escape from Dol Guldur with experience/skill, only pure luck on solo with a core set).\n\n \n\nWhen I only had the core set the heroes I used were Aragorn/Denethor/Glorfindel on Passage through Mirkwood, and Beravor/Denethor/Gloin on Journey Along the Anduin. Since I did not record my exact decks back then, and I do not know of any blogs/articles that has examples of a legal deck using just a single core set I recommend that you start searching around in the forums here [https://community.fantasyflightgames.com/index.php?app=core&module=search&do=search&andor_type=&sid=0d600c5fcd5c0fdc3bd0aa1859348f27&search_app_filters%5Bforums%5D%5BsortKey%5D=date&cType=forum&cId=250&search_app_filters%5Bforums%5D%5BsortKey%5D=date&search_term=core+set&search_app=forums] for deck examples. \n\n \n\nP.S. Welcome back to LotR LCG! ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032827","commentId":1032827,"userName":"shimond","timestamp":1396244238,"content":"I ordered the first expansion :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI have to say the article from BGG is super useful, i tried the \"illegal\" deck and i won the first adventure, but it wasn't easy, the game is amazing.\n\n \n\nRule question, Snowburn scout put a advancement token in a location on staging, that means tha the location become immediately active as the group has traveled there or it stays in staging and another location can be chosen to travel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1032840","commentId":1032840,"userName":"MyNeighbourTrololo","timestamp":1396245577,"content":"It just adds the progress, nothing more. Even better, if you can put enough progress on a location in staging area, then it will be explored without ever becoming active. Can pretty useful (Necromansers Pass, Brown Lands)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/102730-beginner-decks-questions/?do=findComment&comment=1039267","commentId":1039267,"userName":"McDog3","timestamp":1396678552,"content":"Here is another really good resource for beginning deck building, I started playing the game only a few months ago and this proved to be invaluable in helping me understand the key concepts of the game (and for creating my initial dual-sphere decks).  In the blog Mr. Beorn goes through each of the core set quests using only core set cards and provides in-depth analysis on the cards included in the decks he built.  He continues this through the entire Shadows of Mirkwood AP cycle, adding new cards from each AP into the deck as he progresses.\n\n \n\nhttp://hallofbeorn.wordpress.com/beorns-path/ [http://hallofbeorn.wordpress.com/beorns-path/]\n\n \n\nAs a side note, I honestly wouldn't pay too much attention to the fact that a \"tournament legal\" deck size is 50 when all you have is the core set.  With only the core set, the card pool is so limited that I find it silly to artificially inflate a deck to 50 cards by including bad and not-very-good cards.  This isn't a game where you play competitively against other people, so unless you want to immediately start comparing scores with other people, starting with a deck of under 50 cards is just fine.  If you stick with the game and really love it, I would gradually up your deck size as you go through the AP's because by the time you get through the Shadows of Mirkwood cycle you'll have plenty of cards at your disposal to flesh out some decent 50 card decks.\n\nEdited April 5, 2014 by McDog3"}]}