{"url":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/","title":"Heroes That Just Work for You","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1038902","commentId":1038902,"userName":"FeloniusBard","timestamp":1396646357,"content":"This is different than just \"Heroes That are Mechanically the Best\" or \"Most Superior.\" \n\n \n\nI'm wondering which heroes you simply like playing the best, regardless of their overall effectiveness and utility. This could be because you like their artwork, you like the characters from the source material, or just because they produce a type of playstyle that's appealing to you. \n\n \n\nFor me, simply put, it's Elladan and Elrohir. \n\n \n\nMechanically, they're good, though hardly \"optimal\" for building the most powerful decks in the game. But there's just something about being able to \"break\" the action economy right out of the gate, both for attack and defense that appeals to me.\n\n \n\nAs a game player, I've always favored \"well-rounded\" approaches to games. In RPGs, for example, I'm the type of player that has to dabble in everything; I never want to specialize, or feel like I'm \"trapped\" in a niche. The thing about Elladan and Elrohir, is that you can fit them into different playstyles very easily simply by swapping the third hero, and adjusting the allies / attachments in your deck to fit a need or theme. \n\n \n\nThe weakness, obviously, is that you're pretty much forced to run them as a tri-sphere, which can be hard, and limits some deck building options. \n\n \n\nBut I've just found I really enjoy playing with them---Rivendell Blade for Elladan, Dunedain Warning for Elrohir, along with the Dunedain and Rivendell allies. My most common tag-along is Lore Aragorn, for versatility. \n\n \n\nThey're usable with all of the Noldor-trait cards too, and other than in the dedicated Gondor quests, are almost always thematically appropriate. In the fiction of Tolkien, seeing the twins in Erebor, or Moria, or Mirkwood, or Lothlorien, wouldn't be a strange sight. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1038919","commentId":1038919,"userName":"Bullroarer Took","timestamp":1396647164,"content":"I used the Ninja twins throughout Moria, and am just waiting for Arwen to build another deck with them.  But to answer your question:\n\n \n\nGlorfindel for obvious reasons.  Loragorn & Boromir make a potent combo.  Elrond & Mirlond (his enabler) are also potent.  I really want to get to the point where I can play elves two fisted.  Hopefully by the end of this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1038974","commentId":1038974,"userName":"Mndela","timestamp":1396650174,"content":"I reallly enjoy when i play twins. And when the 3rd hero is legolas i have in my hands a combat machine. I suffer, however, in quest, when i feel we need willpowe and thinking about to 'lose' one round one of the twins only for increase our willpower by 2.\n\nBut i think the most powerfull of twins is when they are in diferents players.\n\nEdited April 4, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039117","commentId":1039117,"userName":"PsychoRocka","timestamp":1396662230,"content":"I also use the twins with legolas, I play two handed though so use loragorn, spiritfindel and elrond In the other deck as the questing deck, works heaps well! Elrohir, Elladan and legolas to a lesser extent are definitely my favourite hero's. nothing is better than having gondorian shield, Dunedain warning and steward of gondor on elrohir while arwen gives him another +1 defense and sentinel allowing him to block almost every attack every turn, when I manage to get song of wisdom and burning brand on him too.... Just awesome! Then elladan legolas and glorfindel with their daggers of westerness and rivendell blades clean house =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039121","commentId":1039121,"userName":"PsychoRocka","timestamp":1396662474,"content":"> I reallly enjoy when i play twins. And when the 3rd hero is legolas i have in my hands a combat machine. I suffer, however, in quest, when i feel we need willpowe and thinking about to 'lose' one round one of the twins only for increase our willpower by 2.\n> \n> But i think the most powerfull of twins is when they are in diferents players.\n\nYeah I often have this issue too, early game if need be I quest with elladan and hope legolas and glorfindel can handle **** on their own (I put rivendell bow on glorfindel when I can) and then attempt to get enough questing power built up with the other deck so I can start using elladan for combat!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039144","commentId":1039144,"userName":"GrandSpleen","timestamp":1396664491,"content":"We've been rocking Sam in a number of decks.  He just fits so well in any deck, even if there is no leadership you can use him to splash in power cards like Steward of Gondor.  Another leadership hero that works for us in many decks is Balin -- fantastic hero, we use him and bring no shadow cancellation, freeing up card slots.  And he enables King Under the Mountain in your deck as well!\n\nEdited April 5, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039227","commentId":1039227,"userName":"legolas18","timestamp":1396674893,"content":"I really enjoy using Beregond. I love putting stuff like Gondorian Shield and Spear of the Citadel on him for free. Also Bard, even though sometimes he 's not as useful as other heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039242","commentId":1039242,"userName":"McDog3","timestamp":1396675712,"content":"I've only been playing for a few months and I only have the card pool up to the 2nd Dwarrowdelf AP currently (the rest of that cycle is on its way  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ).  That said, so far one of my favorites has been Tactics Boromir, for similar reasons that OP has said about Elladan and Elrohir.  I really like Boromir's versatility when it comes to being able to quest, attack, and/or defend provided you can take the threat.  I too tend to create more \"well-rounded\" RPG characters in games, so Boromir appeals to my personality in this sense.  I generally run him with some spirit to get easy threat reduction access.  Back when I was using mainly eagles for my Tactics build, there was no greater sense of satisfaction than the times I could pull off getting support of the eagles on Boromir with a buffed up Eagles of the Misty Mountains.  Do I need a super defender this round?  Boromir.  Do I instead need a super attacker this round?  Boromir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039280","commentId":1039280,"userName":"player1922162","timestamp":1396680337,"content":"Beregond is my favorite hero. Also a huge fan of Éomer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039286","commentId":1039286,"userName":"MyNeighbourTrololo","timestamp":1396681460,"content":"Eowyn, period."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039315","commentId":1039315,"userName":"leptokurt","timestamp":1396687071,"content":"Beregond, as he stands for all which makes Gondor so cool.\n\n \n\nFrodo, because of his ability and low threat. I like it when i don't have to fear to be whiped out with the next big enemy revealed from the encounter deck.\n\n \n\nTheodred. He is not as useful as he once was because of all the new resource generating player cards. Still, he feels like an old friend that I spent a long time with, and his ability allows you a greater flexibility when choosing your strategy. His picture always seems to shout at me \"Sorry, I really wished I had that one point WP more, dude, but  look at how ferocious I'm leading that quest Theodred-style!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039354","commentId":1039354,"userName":"Mndela","timestamp":1396695830,"content":"Bifur is the most played for me. He is very very good when you play bisphere or trishpere. Bifur alone in lore is enough to play all lore cards you want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039512","commentId":1039512,"userName":"Scroll Lock","timestamp":1396717601,"content":"Prince Imrahil is just amazing for me. I also like Dunhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1039972","commentId":1039972,"userName":"Nickpes","timestamp":1396757423,"content":"I would say Glorfindel, and then would be Beregond, Elrond, legolas and Loragorn\n\nGlorfindel is an obvious case.\n\nBeregond as said is what Gonor stands for. I use to add him the shield and either the spear or the plate. I feel safe with this guy around\n\nElrond with Vilya is a combination i really lake, buildind my game turn to turn in order to becaome as powerfull i would like. But the new VoI mechanism like fast games so maybe it is time for Elrond to travel back to Valinor\n\nLegolas is tactics which I like, and also helps on quests with his ability. With a rivendel blade he is deadly\n\nLoragorn, i think most is for his ability, he stats are good also but if i was not for his ability -and his card illustration which I love- maybe he would not be part of my decks that often"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1040051","commentId":1040051,"userName":"player1761766","timestamp":1396767719,"content":"As leptokurt says, Theodred feels so much like an old friend that I always enjoy bringing him back to the table. So many of the early games I played were with Theodred and Dunhere as an adventuring duo, who would bring along a random friend to bulk out the fellowship to three. \n\n \n\nI've recently been really enjoying dwarves once more, and there are three that particularly stick out for me here - Ori, Nori and Oin. I find it especially difficult to choose between the last two, as I really like both of them, but while Nori looks so much fun (he's hoisting a tankard, after all!!!), Oin is usually the most useful for me as I so rarely use tactics to any great extent that I'd need an actual hero. \n\n \n\nAs far as art goes - Faramir and Theoden. They're just awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1040098","commentId":1040098,"userName":"chuckles","timestamp":1396776588,"content":"I'm a big fan of the epic heroes that have or suit having lots of attachments. (Also useful low threat heroes). So it seemed like Christmas when the Dwarrowdelf AP's were released. Elrond, Glorfindel & Legolas who become that much more awesome with blades and the Hands upon the bow event. Being able to run all three together solo made for much happiness, for me. (though also a little like easy mode for some of the quests :/)\n\n \n\nSimilarly when they released the hobbits: Sam, Merry & Pippin using Trackers awesome attachment heavy happy hobbit deck, where Sam regularly had more than a dozen attachments was brilliantly fun for me!\n\n \n\nOn a side note I really like it when new attachments, allies, events or other heroes revitalise existing heroes like:\n\nDunhere (dagger/spear), Eowyn (Lay), Boromir (Shield). \n\nEdited April 6, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1043830","commentId":1043830,"userName":"joezim007","timestamp":1397078106,"content":"I've always loved Legolas and Beregond, They were in the first decks I built and they are just beast. Legolas with a Blade of Gondolin can clear most locations, which can be HUGE, especially for enabling Northen Tracker/Asfaloth to take care of them in the staging area. There are only 2 other heroes that really contend with Beregond as a defender: Beorn and Boromir, and both of them are really only contenders because of the built-in action advantage. Neither of them have enough starting defense (and Beorn's can't be pushed up at all), so I stick with Beregond. It's also too easy (and cheap) to boost his defense even higher with Gondorian Shield and Citadel Plate for a total of 2 resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1043896","commentId":1043896,"userName":"Demoncow","timestamp":1397082101,"content":"> It's also too easy (and cheap) to boost his defense even higher with Gondorian Shield and Citadel Plate for a total of 2 resources.\n\nCrazy good combo, although I prefer gondorian shield and spear of the citadel for zero resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1043911","commentId":1043911,"userName":"Pharmboys2013","timestamp":1397083142,"content":"Beregond is definitely a big one for me, theres just a certain peace of mind that comes with having an impenetrable wall for all your blocking needs.\n\n \n\nElrond is another, the extra point of healing can make a difference especially in scenarios with a lot of archery, plus i find Vilya fun to tinker around with\n\n \n\nTheodred also is a non-obvious one that comes to mind.  He's a low threat leadership hero which are really few and far between (just him and Sam are under 10 i think ((Hirluin doesnt count)).  Also, that extra resource is always extremely helpful in smoothing out costs, although his WP leaves something to be desired"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1043949","commentId":1043949,"userName":"Demoncow","timestamp":1397085587,"content":">  \n> \n>  \n> \n> Theodred also is a non-obvious one that comes to mind.  He's a low threat leadership hero which are really few and far between (just him and Sam are under 10 i think ((Hirluin doesnt count)).\n\nGloin and Balin have 9 threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1044060","commentId":1044060,"userName":"Pharmboys2013","timestamp":1397092950,"content":"> > Theodred also is a non-obvious one that comes to mind.  He's a low threat leadership hero which are really few and far between (just him and Sam are under 10 i think ((Hirluin doesnt count)).\n> \n> Gloin and Balin have 9 threat.\n\nAh, thank u"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1044103","commentId":1044103,"userName":"joezim007","timestamp":1397096343,"content":">  \n> \n> > It's also too easy (and cheap) to boost his defense even higher with Gondorian Shield and Citadel Plate for a total of 2 resources.\n> \n> Crazy good combo, although I prefer gondorian shield and spear of the citadel for zero resources.\n> \n>  \n\n \n\nYea, it depends on the quest I guess. If there are hard hitters, or a lot of enemies, I'll opt for more health so I survive more big hits or take some undefended attacks, but if there are enemies that I need some help cutting down, I'll use the spear. It's a touch choice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1047869","commentId":1047869,"userName":"silverthorn","timestamp":1397405676,"content":"I think I've hit my favourite combination of heroes, namely Beorn, Eowyn and Legolas. I'm not so sure about the other deck I've been using (Sam Lore Pippin, Merry) since the Tactics/Spirit deck seems to do 90% of the work. I may have to experiment with another deck.\n\nEdited April 13, 2014 by silverthorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1048034","commentId":1048034,"userName":"Noccus","timestamp":1397417755,"content":"As most of the obvious choices have been named, I'll give Eleanor a honorable mention here.\n\nIn multi-player this gal saved our butts countless times.\n\nShe might be less useful single-player, I don't know.\n\nBut with several people around the table she'll almost always get to counter something nasty.\n\nVery useful. And she can be equipped with a gondorian shield too, so when not used to counter, she makes a fine defender.\n\nEdited April 13, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1048053","commentId":1048053,"userName":"Pharmboys2013","timestamp":1397418862,"content":"> As most of the obvious choices have been named, I'll give Eleanor a honorable mention here.\n> \n> In multi-player this gal saved our butts countless times.\n> \n> She might be less useful single-player, I don't know.\n> \n> But with several people around the table she'll almost always get to counter something nasty.\n> \n> Very useful. And she can be equipped with a gondorian shield too, so when not used to counter, she makes a fine defender.\n\n \n\nI agree that gondorian shield has really made Eleanor quite useful and not as one dimensional as she previously was.  Even with her 3 HP, having 4 def can really make you feel comfortable most enemies (although if they had 4 or more attack i'd be leery of shadow cards).  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1048413","commentId":1048413,"userName":"7theye","timestamp":1397443392,"content":"I assume that you mean for us to comment on 'non-traditional' heroes that do not jump out as powerful (ie - not Dain, Spirit Glorfindel, Legolas, Eowyn etc).\n\n \n\nSome heroes that I use that others may not are:\n\n \n\na) 'super cool hero' Beorn (as he was refered to by Mathew on the progression series): amazing early game hero that you can use to tank attacks and not worry about defense or attack for a couple of rounds letting you get out a bunch of questers and make good progress\n\n \n\nb) Boromir: Like Brandon has often said, the tactics version is a beast! in some quests (ie - massing at osgiliath) where action advantage is paramount he cannot be beat. Partner him with Loragon or Spirit Glorfindel to avoid the threat problem\n\n \n\nc) Dunhere: with the new dagger that has come out and various methods to push enemies back into the staging area, paring him with Faramir can make a interesting deck that can work well in certain quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1048704","commentId":1048704,"userName":"ana4","timestamp":1397473226,"content":"I basically agree with all of the above. I am a big fan of Boromir, as a character in the book, so I was very happy to see him so well designed in the game. Massing at Osgiliath was indeed the quest that won me over in terms of mechanics. However, the Leadership version, though I had not believe so in the time of its release, is more than competitive. It is a great fun to play a mono-Leadership Gondor deck with Boromir being the center piece, turning cheap allies effective force.\n\n \n\nDúnhere is excellent. The whole staging area attack is so strong, no defenders, no nasty shadow effects.\n\n \n\nAnd also Beorn, he can sort of take Tactics Borormir's place, he does even better in the beginning, because it may well be you need both, the action advantage and keep the treat relatively low. Plus, now, there are more and more tricks to cooperate with Beorn though he is immune to player cards. I had a game in which Beorn was taking damage after damage, I sacrificed him in mid-game once I got Landroval. Then in the end, the other player revived him with Fortune or Fate. And often you can just abuse the ability till he hits 9 damage, especially if you do not care about score. Plus, the newly previwed Close Call will make things even better for Beorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049284","commentId":1049284,"userName":"divinityofnumber","timestamp":1397506726,"content":"I've always been fond of Lore Glorfindel. He can quest like a boss, attack like a boss, can handle some damage, and allows you to do some minimal healing without having to dedicate deck slots to heal effects. He is better than many give him credit for. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049882","commentId":1049882,"userName":"ana4","timestamp":1397548987,"content":"Definitely, the above is a very good point, Lore Glorfindel, especially if combined with Spirit and Light of Valinor. He is really overlooked because of the Spirit version but in a deck where you can manage threat (Spirit is again a natural choice as the other sphere), he is great, 3 willpower, 3 attack, and the minor ability can be quite a useful one. I now wish he was named differently and I could play him with the Spirit Glorfindel, haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049922","commentId":1049922,"userName":"Nerdmeister","timestamp":1397554555,"content":"Lore Glorfindel plus Elrond for the heal boost. You get very decent healing right from the start so I´m with divinity on this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049925","commentId":1049925,"userName":"MyNeighbourTrololo","timestamp":1397554698,"content":"How are you going to handle so much threat of Lore Glorfindel and Elrond combined with any other hero in existance?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049935","commentId":1049935,"userName":"Nerdmeister","timestamp":1397556737,"content":"> How are you going to handle so much threat of Lore Glorfindel and Elrond combined with any other hero in existance?\n\nDivide the Glorfindel and Elrond among 2 players?\n\nPlay with only 2 heroes?\n\nInclude a low-threat hero (hobbits anyone)?\n\nHave some threat reduction?\n\nHave a spirit player focus threat reduction on you?\n\nHave a tactics player ready to defend you with sentinel / feint / quick strike etc?\n\nLore is trap-sphere. Use them?\n\nDefend with Elrond (Burning Brand works well and if he gets damaged a bit you heal with Glorfindel) and attack with Glorfindel?\n\nLots of other options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049943","commentId":1049943,"userName":"MyNeighbourTrololo","timestamp":1397557946,"content":"Dividing heroes will require at least two players :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nPlaying with only 2 heroes will cripple your efforts.\n\nLowest 3-hero starting threat you can muster is 30(which is a lot) and will force you to stick into Lore exclusively.\n\nGood luck to you on threat reduction with two lore heroes as basis, lol.\n\nTwo players, once again.\n\nAnd again, two players.\n\nThere is only so much traps you can use.\n\nAnd who will you quest with?\n\nLots of drawbacks.\n\nEdited April 15, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049954","commentId":1049954,"userName":"Nerdmeister","timestamp":1397559227,"content":"Not every strategy is for solo players. Just like not every strategy is for multiplayer.\n\nAlot of people here seem to enjoy playing 2-handed as well (not that I am a fan of it myself).\n\nIf you build deck for only a single player (where you might want to cover multiple spheres with one deck), than you do it vastly different from the get-go than people building decks for multiplayer (where mono-color decks is more prevalent). \n\nSo please refrain from berating suggestions based on the number of players in the game as builds vary widely on that basis.\n\n \n\nIf you want it to stand a bit more on it´s own then Light of Valinor works equally well on other heroes besides spirit Glorfindel as far as I´m informed.\n\n \n\nNot really many drawbacks if you have just one more player; been using it quite successfully myself (albeit not particularly often).\n\nEdited April 15, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049967","commentId":1049967,"userName":"MyNeighbourTrololo","timestamp":1397560940,"content":"Not saying it's impossibru, saying it's gonna be hard, even in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049978","commentId":1049978,"userName":"Nerdmeister","timestamp":1397562536,"content":"All I can suggest on that front is that you try out how it works for you.\n\n \n\nWhich of course doesn´t help you much if you exclusively play solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049979","commentId":1049979,"userName":"ZanzibarLand","timestamp":1397562647,"content":"Elrond, Eowyn and Bifur, threat 29\n\nGlorfindel, legolas, Mirlonde, threat 28\n\nDoesn't seem unusable at all.\n\nEven swap out Bifur or Mirlonde for a hobbit if 29 is too high. Even swap for a dwarf like Oin if you wanted tactics attachments or events. Balin for shadow cancellation, or Theoden/gloin for resource generation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049988","commentId":1049988,"userName":"7theye","timestamp":1397564075,"content":"The problem with lore glorfindel is that the spirit version is better.\n\nWhereas the lore one has a helping ability, with warden if healing it's often not needed as he's more cost effective.\n\nIn terms of the threat, spirit glorfindel is about 7 cheaper. That's more then a Glandrens Greetings can reduce your threat, which costs more than a warden of healing. So, basically if you get LOV in turn 1 or 2 his threat is about 6-7 lower.\n\nSo of we. Want to compare apples to apples:\n\nA warden of healing and spirit glorfindel is cheaper and better healing then a lore glorfindel and a Glandrens greeting bc his upkeep for healing is worse then the wardens. As such, spirit would be the better choice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1049991","commentId":1049991,"userName":"Nerdmeister","timestamp":1397565732,"content":"> if you get LOV in turn 1 or 2 his threat is about 6-7 lower.\n> \n> So of we. Want to compare apples to apples:\n> \n> A warden of healing and spirit glorfindel is cheaper and better healing then a lore glorfindel and a Glandrens greeting bc his upkeep for healing is worse then the wardens. As such, spirit would be the better choice\n\nIF you get LoV in turn 1 or 2 and IF you get warden of healing.\n\nSome of the point the Glorfindel/Elrond combo is that you can factor decent healing into the equation from the beginning without thinking of card draw.\n\nAlso some players who care a bit less about score, as well as having alternatives to dealing with enemies (here the healing helps), might be tempted to not care about threat at neither beginning nor end of the game; as long as it stays low enough.\n\n \n\nSaying flat out that spirit Glor is better than lore Glor doesn´t take that many perspectives into consideration; they each have their uses. I just happen to think that lore Glor is generally underrated as an alternative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050055","commentId":1050055,"userName":"ana4","timestamp":1397571230,"content":"I myself care little if I finish the game with 48 or 24, I enjoy higher threat decks. However, they are risky, more enemies jump at you before you can prepare and you can also hit 50 more easily. The best thing about Spirit Glorfindel is that you can combine him with 2 high threat heroes and still be alright. And then you can only use him for attack or with Light of Valinor if you fear further threat increase. And of course, he is the only Spirit Noldor hero so far, thus he has got direct access to Elrond's Counsel, helping things further.\n\n \n\nAs I said above, Lore Glorfindel has become a very good hero, and he will get even better as we see more Noldor support (there still has been little despite the heroes)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050069","commentId":1050069,"userName":"Brownmantle","timestamp":1397571843,"content":"I enjoy playing the Halflings. It's really challenging, thematic, and now that Black Riders is out, you can actually WIN every once in a while. No more super sad secrecy gamble, Merry has arrived."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050084","commentId":1050084,"userName":"MyNeighbourTrololo","timestamp":1397572341,"content":"I don't know who would care for score and why, I personally care about threat becaue it provides you so much needed breather, delays your natural defeat and makes threat boosting effects less devastating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050101","commentId":1050101,"userName":"divinityofnumber","timestamp":1397573685,"content":"> How are you going to handle so much threat of Lore Glorfindel and Elrond combined with any other hero in existance?\n\n \n\nRun Elrond's Counsel, Core Gandalf, Dwarven Tomb (to recur Elrond's Counsel if you really need to). Also, Lore Glorfindel is great because you have the Lore resources to play Asfoloth on him. So, he ends up being able to quest for 3, attack for 3, put two progress tokens on a location per round, and also can heal any other character. Beast. Run him with some Spirit and you can also get Light of Valinor on him. Super good. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050353","commentId":1050353,"userName":"ana4","timestamp":1397584846,"content":"Lore Glorfindel, Spirit Frodo, Tactics Legolas, and I am sure you can win a majority of the quests. Light of Valinor, Arwen, Counsel, Weapons, Asfaloth, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050387","commentId":1050387,"userName":"Raven1015","timestamp":1397586275,"content":"Lore Glorfindel is definitely underrated. For awhile, I was plowing through all the quests with mono-Leadership on one hand and mono-Lore, including Lore Glorfindel, on the other. I was able to beat most of the quests in the game, and had a memorable experience with Into Ithilien where I ended up a single progress token shy of victory. Anyway, Spirit Glorfindel is clearly the superior version, but that doesn't detract from the fact that Lore Glorfindel has his uses: not using Spirit sphere, playing mono-Lore, want something different, sick of Spirfindel's face, etc.\n\nEdited April 15, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050450","commentId":1050450,"userName":"Noccus","timestamp":1397588566,"content":"Yea I know that feeling. I'm REALLY spirfindeled-out.\n\nHe was such a auto include I did not look anywhere else for a while.\n\nHaven't been using him for some time now, and I don't see him returning in the near future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050470","commentId":1050470,"userName":"Raven1015","timestamp":1397589279,"content":"What I'm really hoping for is another Spirit hero with high attack. I don't think we should get a ton, as it's important to keep those sphere distinctions, but I'd like another 3 attack Spirit hero for my mono-Spirit decks that is NOT Glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1050493","commentId":1050493,"userName":"Noccus","timestamp":1397589892,"content":"You might get your wish with a spirit Boromir or Aragorn version at some point.\n\nBut I don't see that happening any time soon.\n\nMy buddy mainly plays mono spirit now and faces the same problem: no attack power whatsoever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051162","commentId":1051162,"userName":"Nerdmeister","timestamp":1397632433,"content":"> What I'm really hoping for is another Spirit hero with high attack. I don't think we should get a ton, as it's important to keep those sphere distinctions, but I'd like another 3 attack Spirit hero for my mono-Spirit decks that is NOT Glorfindel.\n\nWell... Dunhere is 3 attack if you work his ability :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nThat is probably not what you meant but I think he puts emphasis on the type of spirit hero able to pull off a high(ish) damage attack in a way that still keeps the distinction of spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051228","commentId":1051228,"userName":"ZanzibarLand","timestamp":1397638386,"content":"While we are talking about spirit Glorfindel, I want to bring up something that seems odd to me. Why is it that his stats equal 12, but his threat is an insane 5, less than Hobbits. I know it's only 7 turns of questing, but it still seems too low to me. Is anyone else in agreeance? Speaking of Hobbits, Bilbos threat of 9 seems crazy as well, paying three threat for his ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051275","commentId":1051275,"userName":"Nerdmeister","timestamp":1397643352,"content":">  Speaking of Hobbits, Bilbos threat of 9 seems crazy as well, paying three threat for his ability.\n\nThese days I only seem to use Bilbo when I play solo. He has a kind of ability that gets less good the more players there are since at 1-player he ups your round draw by 100% but in 4-player he only ups it by 25%.\n\nFor solo-play I think his threat cost is quite reasonable. Though more players I´ll at least agree it is up for debate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051278","commentId":1051278,"userName":"ZanzibarLand","timestamp":1397643925,"content":"Yeah I guess you're right. I didn't think about the fact that its double draw for single player. Just seems like odd logic to arrive at the 9. No one else, even Elrond who has two powerful abilities, pays more than 1 for theirs.\n\nEdited April 16, 2014 by ZanzibarLand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051363","commentId":1051363,"userName":"ana4","timestamp":1397652874,"content":"These problems come from the time of the youth of the game. Like in everything, when you are new to it, you make more mistakes, and some learn from them. I believe the trend is good for the game: we see less and less mistakes, though I would still like to see the old mistakes corrected wherever possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103187-heroes-that-just-work-for-you/?do=findComment&comment=1051368","commentId":1051368,"userName":"MyNeighbourTrololo","timestamp":1397653113,"content":"Just beated A Shadow of the Past with Bilbo, Loppin and Sam. Bilbo was an MPV, defending against 3 Nazguls each turn without taking a scarch."}]}