{"url":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/","title":"Starting out questions.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1039749","commentId":1039749,"userName":"Elber","timestamp":1396736780,"content":"Hi All\n\nI am thinking about starting to collect the Lord of the rings card game and have a few questions I hope you can answer!\n\n \n\nThe way I understand it the core set comes with a load of cards and you build decks out of that?\n\n \n\n \n\nCan you play this game 4 player? How would it work if you can and would this involve buying two core sets and then making sure there are no doubles?? Does it work well?\n\n \n\n \n\nIs there a set expansion path or recommended path to take when thinking about expanding?\n\n \n\nIs there longevity in this game? I used to play magic and am looking towards this as a cheaper option as well as combining card games with LOTR.\n\n \n\nThanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1039755","commentId":1039755,"userName":"entMoot","timestamp":1396737752,"content":"Hi! I'm relatively new to the game, myself and have not regretted jumping on board from the MtG-train.\n\n \n\nThe core set comes with four 30-card starter decks and 3 scenarios. It is difficult to beat the 2nd and 3rd quest when playing solo with the starter decks, but it is possible to build good decks for two players with one core set.\n\n \n\nThe main reason to buy multiple core sets is to get more copies of some of the powerful staples. A deck can have up to 3 copies of a card, but the core set had several 2x and 1x cards (all other sets contain 3x each player card, so no problem there). The reason the game-box suggests a second core set for 3-4 players is more tokens and threat counters, which can be replaced by dice.\n\n \n\nMy strategy was to buy from the first cycle of adventure packs, Shadows of Mirkwood first, and continue roughly chronologically. Each adventure pack contains a new scenario and player cards that expand your options for deckbuilding (new heroes, etc). It was definitely good to start with just the core set for a few weeks to see how I enjoyed the game though, before sinking the cash.\n\n \n\nA good reference to start with is: http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1039852","commentId":1039852,"userName":"shoreless","timestamp":1396744168,"content":"Everything the Ent said.\n\n \n\nI think the best way to enjoy the game would be put a regular play group together and then just progress through all the expansions together chronologically. There is an advantage to having the whole card pool at your disposal, but it could also be overwhelming. Take your time and enjoy!\n\n \n\nWelcome to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1040289","commentId":1040289,"userName":"Ihavebadluck","timestamp":1396802771,"content":"> Everything the Ent said.\n> \n>  \n> \n> I think the best way to enjoy the game would be put a regular play group together and then just progress through all the expansions together chronologically. There is an advantage to having the whole card pool at your disposal, but it could also be overwhelming. Take your time and enjoy!\n> \n>  \n> \n> Welcome to the game.\n\nso you buy all the expansions in one cycle before moving to the next? like you wouldn't recommend getting all of the bigger expansions first (like heirs of numenor and I believe khazad dum)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1040306","commentId":1040306,"userName":"shoreless","timestamp":1396804421,"content":"No and the reason is this: the big boxes go with their respective cycles, stylistically and mechanically. So, unless you really want the player cards I'd say do it in order. Jumping from Khazad-dum to Heirs of Numenor, for example, would feel wonky at best."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1040406","commentId":1040406,"userName":"ossderossmane","timestamp":1396814829,"content":"Also, as far as I know the big boxes provide a worse ratio of player cards vs. encounter cards.\n\n \n\nA possible exception could be the saga boxes. Has anyone tried jumping directly to the hobbit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1040488","commentId":1040488,"userName":"iznax","timestamp":1396825124,"content":"> No and the reason is this: the big boxes go with their respective cycles, stylistically and mechanically. So, unless you really want the player cards I'd say do it in order. Jumping from Khazad-dum to Heirs of Numenor, for example, would feel wonky at best.\n\nJumping to Heirs of Numenor feels wonky no matter what :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nMy advice is to follow the cycles in order and  get the sagas when ever you like. The cycle expansions, AP and Deluxe, where build given that you have all previews, the sagas tho where build given that you have only the core set, said by the designers not me ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nP.S. sry for my english"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1040510","commentId":1040510,"userName":"Glowwyrm","timestamp":1396828863,"content":"Shadows of Mirkwood was out of print when I started playing, so I jumped to the Hobbit Saga boxes.  They were definitely on the tough side, but I was able to beat the quests (this was before they came out with Easy mode, which could be a good option for you).  Plus, If you're into dwarves, those two boxes will give you everything you need to build some awesome dwarf decks.  It was a fun and thematic way to get into the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1055976","commentId":1055976,"userName":"Elber","timestamp":1398036412,"content":"Great Thank you for your replies :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103256-starting-out-questions/?do=findComment&comment=1056355","commentId":1056355,"userName":"Rapier1","timestamp":1398079667,"content":"I went core, then Khazard-Dum; (Then backfilled the mirkwood cycle before going on chronologically).  This was because I felt that the core + Khazard-Dum made a better first and second present to my wife than the core + some small expansions. (Also Khazard-Dum had just come out right when I was looking to get something at christmas having bought the core the previous birthday :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n\n \n\nHowever we had a lot of trouble with Khazard-Dum with only those two expansions and I enjoyed Khazard-Dum a lot more after getting the card pool expansion of the mirkwood cycle.\n\n \n\nWhatever you do, do not go straight to Heirs of Numenor - I think that is the hardest set of quests you can get which come with player cards.\n\n \n\nEdit: As for four player - the quickest way to get the card pool for 4 player is to buy two core sets. However I have only one and after the first two cycles I think you have enough cards that any of the 4 players can play whatever they want.\n\n \n\nObviously you could go mad and every player could have their own copy of everything (which would let you run the same exact deck four times if you wanted - with only hero changes).\n\nEdited April 21, 2014 by Rapier"}]}