{"url":"https://community.fantasyflightgames.com/topic/103273-pvp/","title":"PvP","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103273-pvp/?do=findComment&comment=1039924","commentId":1039924,"userName":"Ihavebadluck","timestamp":1396751697,"content":"just wondering but has anyone created a way to do this PvP instead of/ in addition to co-op?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103273-pvp/?do=findComment&comment=1039963","commentId":1039963,"userName":"Raven1015","timestamp":1396756375,"content":"It's been talked about since the beginning of the game but no one has ever put together an actual variant of this type (to my knowledge anyway). I think it would be possible to create a version where one player controls the encounter deck, but it would take some balancing and experimenting to get it right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103273-pvp/?do=findComment&comment=1039982","commentId":1039982,"userName":"Bullroarer Took","timestamp":1396758692,"content":"It would have to be like Knizia's \"Sauron\" variant I think. Imagine someone controlling the encounter deck who got to draw 6cards at the beginning of the game and draw a new card just before he/she had to play a card. So \"Sauron\" would get to choose the nastiest encounter cards and shadow cards to play out of his hand at the most appropriate times.\n\nI think even Glaurung would be challenged.\n\nWe've discussed trying to turn this game into a conventional PvP game and I don't think it would work. But I would love to see it somehow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103273-pvp/?do=findComment&comment=1040029","commentId":1040029,"userName":"Glaurung","timestamp":1396765271,"content":"> It would have to be like Knizia's \"Sauron\" variant I think. Imagine someone controlling the encounter deck who got to draw 6cards at the beginning of the game and draw a new card just before he/she had to play a card. So \"Sauron\" would get to choose the nastiest encounter cards and shadow cards to play out of his hand at the most appropriate times.\n> \n> I think even Glaurung would be challenged.\n> \n> We've discussed trying to turn this game into a conventional PvP game and I don't think it would work. But I would love to see it somehow.\n\nI believe with Current Encounter cards no possible to make pvp since then Sauron will always win. Encounter cards just to powerful already, so if you start to play them in right order players don't have a chance.\n\n \n\nBut they can make a new special encounter cards for the Sauron players yes that can be possible. But i don't think FFG ail do that…for what?  but in the end of the day you never know……."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103273-pvp/?do=findComment&comment=1040053","commentId":1040053,"userName":"MyNeighbourTrololo","timestamp":1396768033,"content":"I played as \"Sauron\" once, but it was rather to ease the game for newcomers than to challenge them. Of course I was trying to keep healthy level of challenge in the game, but I wasn't trying to stomp them into the ground... while I totally could.\n\n \n\nIt was simple: during staging step I drawn two times more cards than should be revealed normally and revealed required amount, shuffling the rest back into the ecnounter deck. To be more precise, it was a 2 player game, so I drawn 4 cards, revealed 2 and shuffled other 2 back. When card surged, I drawn 2 cards, revealed 1 and shuffled back 1.\n\n \n\nFor shadow, I drawn exact amount of encounter cards equal to enemies engaged and placed them as I wished.\n\n \n\nPretty simple, eh."}]}