{"url":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/","title":"morgul vale and blood of gondor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045433","commentId":1045433,"userName":"Ihavebadluck","timestamp":1397178980,"content":"did you guys like the quests/enemy deck(idk what its officially called) from the title APs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045447","commentId":1045447,"userName":"shoreless","timestamp":1397179781,"content":"Yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045456","commentId":1045456,"userName":"Ihavebadluck","timestamp":1397180312,"content":"if I currently have heirs of numenor assault on osgiliath encounter at amon din and the black riders expansions. should these 2 be the ones I get next?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045494","commentId":1045494,"userName":"GrandSpleen","timestamp":1397182907,"content":"Morgul Vale is a great quest and pretty unique.  Blood of Gondor was OK but a little underwhelming in my opinion.  If you are looking for recommendations, I have a high opinion of the quests in both of the Hobbit saga boxes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045718","commentId":1045718,"userName":"PsychoRocka","timestamp":1397202865,"content":"I really like Blood of Gondor, it can be hard but is fun, is a cool way of doing an ambush quest (hidden cards etc) and not overly difficult. Morgul Vale came out right after I first got into the game so I bought it just to add to my collection as well as for player cards. I played it back then a bunch of times (my deckbuilding and playing skills weren't very good back then) and I got absolutely smashed every time.\nSince totally pimping my two decks out, learning to play a lot better and using the quest log I've only attempted it twice and lost both times. Murzag and Alcarnon are not so bad (beat them both, both times) but the Nazgul destroyed me. To be more specific its more-so the additional encounter cards revealed when you get to stage 3 than the Nazgul that really brought the pain. Also it was threating out both times that made me lose and not combat.\nIts a pretty fun quest though with two mini bosses and a big bad boss at the end. Will be super satisfying when I decide to play it some more and beat it!\n\nAll the encounter cards in the actual Morgul Vale box are awesome but I don't like some of the lose-more ridiculously powerful encounter cards that are a part of the quest but are taken from the HoN box. Like Morgul Spider (with his MINIMUM 9 attack every time he comes out against me), Orc Vanguard (this card just shouldn't exist, those stats with that ability is just plain stupid) and The Power of Mordor (which to be honest was totally fine to deal with until we were told that it also does actually count Murzag, Alcarnon and the Nazgul but obviously does not shuffle them back into the deck... just brings out an extra card + any when revealed effects etc)\n\nLong story short, I quite like blood of gondor, don't like morgul vale as much but it is a cool quest. Both are worth buying but if you don't already have Druadan Forest and Stewards Fear I'd maybe get them first, they are easier, just as fun (in my opinion) and also have good player cards =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1045858","commentId":1045858,"userName":"Scroll Lock","timestamp":1397217007,"content":"Morgul Vale is one of the hardest quests in the game. You need massive battle strength but also some questing to avoid raising threat (there are many high threat cards, 3-5 threat). \n\nI have not played Blood of Gondor as I could not buy it anywhere, but as I am looking that you have EaAD and AoO, you may like Blood of Gondor player cards, as it gives you 1 new trap and 1 new ranger ally. So if you like rangers, buy it!!!\n\n \n\nI think you would like Stewards Fear for its awesome quest (some people say it is best quest ever) and it also gives you Outlands. You may like to try them out, as without this pack, you will never use \"Men of the West\", \"Sword of Morthond\" and \"Lord of Morthond\" from your APs.\n\n\nSooo, buy Stewards Fear and Blood of Gondor.\n\nEdited April 11, 2014 by Scroll Lock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1046433","commentId":1046433,"userName":"Ihavebadluck","timestamp":1397244554,"content":"don't lots of people dislike outlands?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1046444","commentId":1046444,"userName":"Scroll Lock","timestamp":1397245141,"content":"Does not matter, if you like them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnd trying new style is always fun. And if you want to buy AP for quest, buy SF!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1049695","commentId":1049695,"userName":"chuckles","timestamp":1397528177,"content":"The Stewards Fear's quest is worth getting whether you are a fan of Outlanders or not... and even if it wasn't the following two cards may well be worth the price of admission by themselves:\n\n \n\n1) Gondorian Shield     - One of the most loved cards of the cycle.\n\n2) Mithrandir's Advice  - Mono Lore deck staple.\n\nEdited April 15, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1050229","commentId":1050229,"userName":"Style75","timestamp":1397579719,"content":"The Steward's Fear is my favorite quest of the cycle. This was a flavor grandslam as you really feel like you're exploring the city trying to unravel the conspiracy. It has really good replay value and doesn't require a gimmicky deck build to complete. Just be aware that it can be a very long quest which turns a lot of people off. You'll have lots of turns where it's just questing and no combat and then all of a sudden there's a big explosion of violence. I like that style of play ( I think it backs up the flavor of the quest) but it's not for everyone.\n\n \n\nThe trick with outlands cards is to not be afraid to sprinkle some of them in a regular deck. Throw in a few of those swordsmen and the knights of the swan and you get cost effective ally support. Outlands does not have to be an all or nothing option. ALSO.... playing a full on outlands deck lets you try out the most difficult scenarios to get a feel for how it will play through. This will give you the knowledge necessary to build a new deck that can beat those quests. I really believe that a full on Outlands deck was intended to be an optional way to play easy mode with all of the hard cards left in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1050396","commentId":1050396,"userName":"Raven1015","timestamp":1397586792,"content":">  \n> \n> The trick with outlands cards is to not be afraid to sprinkle some of them in a regular deck. Throw in a few of those swordsmen and the knights of the swan and you get cost effective ally support. Outlands does not have to be an all or nothing option. ALSO.... playing a full on outlands deck lets you try out the most difficult scenarios to get a feel for how it will play through. This will give you the knowledge necessary to build a new deck that can beat those quests. I really believe that a full on Outlands deck was intended to be an optional way to play easy mode with all of the hard cards left in the game.\n\n \n\nThis. Ethir Swordsman and Knights of the Swan are super useful allies to splash into any Spirit or Tactics decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103626-morgul-vale-and-blood-of-gondor/?do=findComment&comment=1050440","commentId":1050440,"userName":"Noccus","timestamp":1397588268,"content":"To the OP:\n\nBoth are fine quests imo.\n\nReally, the general quality of the quests in the AtS cycle is quite high."}]}