{"url":"https://community.fantasyflightgames.com/topic/103756-this-should-be-easy-but-well/","title":"This should be easy,  , But well. .","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103756-this-should-be-easy-but-well/?do=findComment&comment=1047346","commentId":1047346,"userName":"dizpatcher","timestamp":1397337839,"content":"Conflict at the Carrick.\n\nIf I have not passed the first quest 1B, But my threat level reaches 34. Do the trolls still remain out of play?\n\nanother question:\n\nI was lucky enough to have resources availabe to snare 3 trolls in one round after they came into play. Do their (the trolls) card abilities still count while they are snared? . eample;\n\n+ attack, plus +1 defense, add 3 threats? BTW: this a nasty encounter deck.\n\nAnd another question: (sorry so many questions, but I love this game and want to be doing it right) Can Quick Strike exhaust a character, and have that character attack a card in the staging area?\n\nHunt for Gollum: When exacly can you take a clue from the staging area. As soon as it is revealed, do you have to wait until a certain phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103756-this-should-be-easy-but-well/?do=findComment&comment=1047542","commentId":1047542,"userName":"entMoot","timestamp":1397360274,"content":"You only make engagement checks against enemies in the staging area. Since the unique trolls are not in the game until you defeat 1B, they do not qualify as being in the staging area and furthermore cannot be targeted by player cards.\n\n \n\nI believe the trolls all say that as long as they are engaged with a player, they give the bonus. So unless you move them back to the staging area through another card effect they will still buff each other even if they can not attack due to the Forest Snare (or Feint, etc.).\n\n \n\nUnless another card effect gives the character the ability to attack enemies in the staging area (such as Dunhere or Forth Eorlingas!) you can not target enemies in the staging area.\n\n \n\nThe Signs of Gollum are Guarded, which means that you reveal the next encounter card and attach it to the Clue. The response on the Clue say that to claim the clue there can be no encounters attached to the clue. This happens normally after resolving for a treachery, being explored for a location, or defeated for an enemy. You can only claim the clue as a response to your questing successfully. This can only happen during the Questing phase of the turn.\n\n \n\nI hope that clears up your questions. Let me know if any of that doesn't make sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103756-this-should-be-easy-but-well/?do=findComment&comment=1047550","commentId":1047550,"userName":"dizpatcher","timestamp":1397361021,"content":"That last one - The signs of Gollum - was really helpful, because that one really had me stuck.  (The others were very helpful too - You gave me verification of what I thought - or thought I thought!! )\n\n \n\nAnyway - Thanx for the great answers. You hit them on right on the head. \n\n \n\nThanx again.\n\nEdited April 13, 2014 by dizpatcher"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103756-this-should-be-easy-but-well/?do=findComment&comment=1049496","commentId":1049496,"userName":"tacomen253","timestamp":1397515467,"content":"entMoot did a great job with his explanation, and I would just like to expand on the trolls a touch. Their abilities still work even when they are snared, except specifically for Ruperts [http://hallofbeorn.com/HallOfBeorn_deploy/Cards/Details/Rupert-CatC] ability which is not passive compared to the other trolls (it is forced only when Rupert himself attacks).\n\n \n\nI agree with you dizpatcher that this is a pretty tough quest. To go off topic for a moment, the strategy commonly used for this quest is to prioritize keeping your threat low so that during stage 2 you can effectively manage troll engagements by \"optionally engaging\" (remember only 1 enemy can be \"optionally\" engaged per turn) rather then through \"engagement checks\". So since the trolls engagement costs are 34 make sure your threat is no more than 31 by the time you engage your first troll (assuming you have no threat reduction immediately available, or Son's of Arnor [http://hallofbeorn.com/HallOfBeorn_deploy/Cards/Details/Son-of-Arnor-Core] type abilities). Now engaging trolls are one thing but eliminating them is a different story that I will leave to you."}]}