{"url":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/","title":"Another prisoner question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048670","commentId":1048670,"userName":"Nerdmeister","timestamp":1397467305,"content":"I´m almost embarrassed about this because I have been playing the game a long time.\n\n \n\nMy lotr buddy and I revisited Escape from Dol Guldur to play it nightmare style with 2 mono decks (to better mitigate the effect of losing a hero to prisoner).\n\nTwo of the heroes I played where Éomer and Beregond and during setup Beregond becomes the prisoner.\n\nIt being quite a long time ago I cannot remember if the prisoner is considered to be out of play (for rules purposes). We were both leaning towards that, yes he is considered to be out of play which would in turn trigger Éomer´s ability for the rest of the round and, in this case, allow him to kill a round-1 enemy in one go (an important point since my last hero, Háma, had been forcibly exhausted).\n\nSo in short: is the prisoner considered to be out of play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048730","commentId":1048730,"userName":"alogos","timestamp":1397475726,"content":"I didn't find any element that says the hero is out of play.\n\nSeems like Eormer should not get the +2 atk."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048768","commentId":1048768,"userName":"Nerdmeister","timestamp":1397479095,"content":"Neither did I really.\n\nBut apparently there is no effect, besides quest-text, that can affect the prisoner; in that regard it reminds me about the ruling of the victory display, that cards in the victory display are out of play but can still be affected by the game if the right circumstances appear. I am here specifically thinking of Caradhras from The Redhorn Gate.\n\n \n\nThough to extrapolate on what it means if the prisoner is not out of play it must mean that he is in-play?\n\nIf he is in-play could not the argument be made (wether it is a strong point is another matter) that he can have attachments played on him? Since playing an attachment is not the same as \"using\" a character, which is what the quest-text specifically prohibits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048813","commentId":1048813,"userName":"alogos","timestamp":1397482759,"content":"Sure, argument were made ...\n\n \n\nhttp://community.fantasyflightgames.com/index.php?/topic/97427-captured-hero-of-dol-guldur-in-your-control/#entry960757 [https://community.fantasyflightgames.com/index.php?/topic/97427-captured-hero-of-dol-guldur-in-your-control/#entry960757]\n\n \n\nI looked at the step 2B and it's pretty sure that he is in play, the instruction is just to flip him up, not to bring him back in play, so it means he was always in play..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048858","commentId":1048858,"userName":"Nerdmeister","timestamp":1397485766,"content":"> the instruction is just to flip him up, not to bring him back in play, so it means he was always in play...\n\nLooked at that same wording myself. There are a lot of effects which bring cards into play without specifically saying to bring the card into play; by that token does that mean all those cards are always in-play?\n\n \n\nI know I am being a bit difficult with this but I can´t find the definitive closing argument on this one way or the other right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1048970","commentId":1048970,"userName":"GrandSpleen","timestamp":1397490963,"content":"The official response that alogos linked to states that the prisoner is definitely \"in play.\"  I don't know if you can extend that to any facedown card on the table, though.  Cards under the Misty Mountain Eagles -- they go out of play before you can trigger the Response, so is the Response putting that card into play?  I guess so, but since it is facedown you can ignore its type, cost, stats, abilities, etc., anything that would interact with other cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103844-another-prisoner-question/?do=findComment&comment=1049864","commentId":1049864,"userName":"Nerdmeister","timestamp":1397545106,"content":"Ok thanks for clearing it up, Grand. Only had like 1 minute yesterday to peruse the link and write a response before I had to dash out of the office."}]}