{"url":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/","title":"The Nin-in-Eilph","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048913","commentId":1048913,"userName":"MyNeighbourTrololo","timestamp":1397488192,"content":"MEC29-box-right.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/MEC29-box-right.png]\n\nMEC29-cardfan-01.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/MEC29-cardfan-01.png]\nMEC29-cardfan-02.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/MEC29-cardfan-02.png]\n\nMEC29-cardfan-03.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/MEC29-cardfan-03.png]\nfollow-me.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/cards/follow-me.png]\n\n \n\nwingfoot.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-ringmaker/cards/wingfoot.png]\n\nEdited April 14, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048923","commentId":1048923,"userName":"Demoncow","timestamp":1397488722,"content":"Wingfoot looks amazing, art and ability!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048965","commentId":1048965,"userName":"GrandSpleen","timestamp":1397490683,"content":"yay for Wingfoot, I enjoy decks that scry, and effects that work well with them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Good news for our ranger friends: Elladan, Elrohir, Aragorn, Beravor, and Faramir.  And surely that new Dunedain hero coming will also have the Ranger trait.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048968","commentId":1048968,"userName":"monkeyrama","timestamp":1397490824,"content":"Wingfoot is very nice. I like the added bonus of a card draw for Follow Me! It's quite a fascinating card as it is, but that's a nice touch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048985","commentId":1048985,"userName":"13thcaesar","timestamp":1397491558,"content":"After Neeker-Breekers see that the developers played in LOTR Online  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1048995","commentId":1048995,"userName":"Karlson","timestamp":1397491975,"content":"I wish we could see the full stats and description on that Mirkwood Pioneer ally.  This is probably my favorite of all four of the featured upcoming AP's.  Love me some Rangers!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049028","commentId":1049028,"userName":"Bullroarer Took","timestamp":1397493872,"content":"> After Neeker-Breekers see that the developers played in LOTR Online  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nYou realize there were books too right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049032","commentId":1049032,"userName":"Bullroarer Took","timestamp":1397494073,"content":"There are so many ways to abuse Silvan Refugee now.  You can even double dip with Children of the Sea and Island Amid Peril.\n\n \n\nSilvan is on the table.  Play Children of the Sea for a 2 point WP boost, after questing play Island Amid Peril to return the Refugee that was going to return anyway.  (Granted it's only a 1 point threat reduction so you might want to save it for something else.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049055","commentId":1049055,"userName":"13thcaesar","timestamp":1397495461,"content":">  \n> \n> > After Neeker-Breekers see that the developers played in LOTR Online  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> You realize there were books too right?\n> \n>  \n\n \n\nI read Lotr, Hobbit, Children of Hurin and The Silmarillion but in Polish translation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049061","commentId":1049061,"userName":"13thcaesar","timestamp":1397495659,"content":"Okay I checked the Wiki, and indeed were in LOTR. I remember now ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049078","commentId":1049078,"userName":"Scroll Lock","timestamp":1397496895,"content":"Mhhhm, Mirkwood Pioneer looks interesting. Reminds me of old Tom Bombadil. And I am excited about its ability, it looks like he will be attached to an encounter and make it out of play until the end of the phase or something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049079","commentId":1049079,"userName":"ana4","timestamp":1397496990,"content":"As I guessed in the other thread, it really seems there will be a returning Silvan event for every sphere. It may be hard to create a four-sphere deck with them, especially the Tactics might seem out of place there (despite Legolas) but I can imagine Leadership, Spirit, Lore deck that bounces Silvan allies back and forth. It seems to me now that the Tree People (previewed with Dunland Trap) is a bit stronger than Island Amid Perils but the more the merrier here. And yes, as said above, Children of the Sea combos wonderfully with these events, especially for Silvan Refugee. He quests for 5 with Celeborn for one resource in total (if you have the other two cards) and you get to either lower your threat or likely put a different Silvan ally into play for combat.\n\n \n\nWingfoot is great, too. Lore really can do with action advantage and Denethor or Henamarth make sure they get it. With them, this is as good as Light of Valinor (Rangers vs. Noldor / Lore vs. Spirit)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049084","commentId":1049084,"userName":"Noccus","timestamp":1397497258,"content":"The quest also sounds really fun too.\n\nLike FoS & steward's fear with multiple possible directions.\n\nI love those.\n\nAnd like others stated, wingfoot is indeed amazing.\n\nMore so in multi-player, as the chances go way up to guess something that will pop up.\n\nReally like this pack!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049135","commentId":1049135,"userName":"Olorin93","timestamp":1397499678,"content":"This looks great! Wingfoot will make Denethor and Henamarth more relevant. Can't wait for this cycle to begin! Also really looking forward to the final AP - the name is very promising for us Noldor players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049214","commentId":1049214,"userName":"Gizlivadi","timestamp":1397503319,"content":"I am very very impressed! We knew this location was coming, sure, but what I really liked about the spoiled cards is the art. Finally, we got light, bright colors for our encounter cards instead of dark gray blurs, and though this may sound extremely geeky, I absolutely love the art on Wingfoot. Time we got clear blue skies depicted on a card! Give that artist more comissions!\n\n \n\nAs for the cards themselves, they look pretty good so far, and the quest with its random stages looks very promising. I got a feeling this will be my favorite cycle so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049251","commentId":1049251,"userName":"ana4","timestamp":1397505031,"content":"> yay for Wingfoot, I enjoy decks that scry, and effects that work well with them :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Good news for our ranger friends: Elladan, Elrohir, Aragorn, Beravor, and Faramir.  And surely that new Dunedain hero coming will also have the Ranger trait..\n\nSurely he will have a Ranger trait (since it says a Ranger hero) but not sure about the Dúnedain one, haha. I am guessing more along the Gondor Ranger line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049264","commentId":1049264,"userName":"Style75","timestamp":1397505748,"content":"\"I Stand Amid Perils\" is going to combo so nicely with not only the upcoming sylvan cards but the existing noldor/silvan synergies. I'm calling it now.... Elrond + Vilya + I stand amid perils + Map of Earnil + lots of 3 or 4 cost sylvan allies will be a key power combo. Throw in some stargazer to seal the deal. You can then save your Galadrim's Greetings for other players. Add Elrond's council and then you're getting into secrecy territory if you also have Mirlonde with Bifur. With secrecy you could add resourceful and needful to know. You'll need \"Protector of Lorien\" to dump the cards going back to your hand or you'll get pounded by the dunlendings (not an issue with quests outside the current cycle) and \"Will of the West\" will be critical to avoid milling yourself out of the game. The only problem I see with this deck is that it'll take a few turns to get all the pieces in place and many quests hit you hard right out of the gates so you'll need a partner who can pull all the heat away from you and keep it way until you can keep a few allies on the table. Still, this is definitely doable.\n\n \n\nLook out Dain, the Silvan/Noldor deck is going to be a powerhouse to rival the dwarves!  I just hope Gondor gets thrown a few bones this cycle to make a gondor deck to match the power of these other factions.\n\n \n\n\"Follow Me\" is going to be hugely powerful for certain quests. Really powerful. Combine this with three Tomes of Atanator (I know it's unique, just play them one after the other) and you can lock down the first player token for pretty much the duration of a quest. This is really important for many quests where the first player is always get picked on by the encounter deck. You could have the leadership deck configured for whatever the problem is and it would free up the other deck designs to ignore the hate on the first player.\n\n \n\nWingfoot is really great in every way, and I especially like that they are boosting traits although I wish was for characters and not just heroes. I don't think that would break the card in any way. I fully expect to one day get Aragorn as an ally and it would be nice to be able to play this on him.\n\n \n\nThe quest itself sounds really fun. I enjoy semi-random quests and fighting some creatures will be a refreshing change from the steady diet of humanoids we've been seeing for the last two cycles. Superficially it appears to look like the deadmarshes without gollum, but I think that's a good think and I'm sure it'll have its own spin on how it plays out. I'm really looking forward to seeing the locations from this set.\n\n \n\nOverall, this AP cycle is shaping up to be the best yet. I'm very excited!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049465","commentId":1049465,"userName":"chuckles","timestamp":1397514119,"content":"> There are so many ways to abuse Silvan Refugee now.  You can even double dip with Children of the Sea and Island Amid Peril.\n> \n>  \n> \n> Silvan is on the table.  Play Children of the Sea for a 2 point WP boost, after questing play Island Amid Peril to return the Refugee that was going to return anyway.  (Granted it's only a 1 point threat reduction so you might want to save it for something else.)\n\n \n\nYes and Naith Scout would be another option... or perhaps more accurately, this is another way get Naith Scout back into your hand to play again. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049471","commentId":1049471,"userName":"Pharmboys2013","timestamp":1397514322,"content":"Wow, really great preview.  The quest itself looks like a blast, the random quest stage mechanics always make for a good and unpredictable time and I agree with Gizlivadi that I am also looking forward to a set of unconventional enemies, the more diverse our foes the more unique the playing experiences IMO.\n\n \n\nThe player cards provided a nice little treat as well.\n\n \n\n Island Amid Perils, whilst oddly named, is a really good effect, more powerful than the tactics returning silvan card and even has the potential to combo with its arguably more powerful cousin the tree people.  Everyone already knows this, but i cant overstate how exciting silvan is going to be to play.  No doubt in my mind that Celeborn, Glorfindel (spirit), and Elrond is going to be the new power deck.  I can see the \"broken\" topics springing up already.  Makes me all the more anxious to see who the Silvan hero we get in Trouble in Tharbad is and if he/she ties into what will be an established archetype at that point.\n\n \n\nI seem to be in the minority, but I cant really see myself using \"Follow me!\" much.  The Hammer-Stroke is arguably a better card for the same purpose and is a better sphere match too.  Dont get me wrong, I can see it having its uses...but with a 50 card deck I'm just not going to make space for it.  In a multiplayer game I would think that at least 1 character is using tactics anyway to either drop Hammer-Stroke or have enough Heroes/allies with Ranged/Sentinel that it doesnt matter.  The art is kind of off too so theres that.\n\n \n\nWingfoot is amazing.  I think it instantly helps the credibility of Faramir as he can put all those extra stat points to good use with some action advantage and makes him an even better battle keyword quester than he already was.  Beravor is perhaps the best candidate as she could quest and trigger her ability almost every turn providing an insanely consistent and strong source of card draw.  It is also obviously a keen fit on Aragorn, but I'm almost disappointed in the fact that despite them being different spheres this almost instantly makes Leadership Aragorn not necessarily obsolete, but by far the lesser of the two versions by now a wide margin....hes practically the new lore glorfindel.  Side note on the card: unless I already know what the top card is from scrying, I see no reason why anyone wouldnt pick \"enemy\" everytime.  Unless they already have an enemy engaged with them they need to kill, it likely doesnt matter if you dont \"hit\" it on a location or treachery because killing enemies is what the extra action advantage is mostly used for...unless your Beravor (srysly this makes her OP again.  Wingfoot is to Beravor is as Dagger of Westernesse was to Dunhere...reviving old heroes that have lost a step)\n\n \n\nLastly, while we didnt get a glimpse of the hero, the fact we know that they're a Ranger can help drive some speculation.  I instantly thought of Halbarad, especially since this cycle seems to have some Dunedain support.  The only other notable Ranger I can think of immediately is the Ithilien Ranger Mablung which would be cool to see as well.  Then again maybe they'll surprise us with an FFG created hero.\n\n \n\nexciting stuff\n\nEdited April 14, 2014 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049597","commentId":1049597,"userName":"Gizlivadi","timestamp":1397521149,"content":"hopefully it's Halbarad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049699","commentId":1049699,"userName":"PsychoRocka","timestamp":1397528672,"content":"Art and mechanics on the enemies are awesome! =) this quest looks like its gonna be epicly fun. I wish this and trouble in Tharbad were coming out before dunland trap and three trials :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049721","commentId":1049721,"userName":"Pharmboys2013","timestamp":1397530770,"content":"Just had another thought on Wingfoot ~ it pairs nicely with ranger bow as well.  Putting the bow on a hero always seemed like a bit of a waste of an action but now could be a solid strategy especially if those extra copies of ithilien tracker dont want to pop out of your deck.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049885","commentId":1049885,"userName":"ana4","timestamp":1397549316,"content":">  \n> \n>  \n> \n>  Island Amid Perils, whilst oddly named, is a really good effect, more powerful than the tactics returning silvan card and even has the potential to combo with its arguably more powerful cousin the tree people.  Everyone already knows this, but i cant overstate how exciting silvan is going to be to play.  No doubt in my mind that Celeborn, Glorfindel (spirit), and Elrond is going to be the new power deck.  I can see the \"broken\" topics springing up already.  Makes me all the more anxious to see who the Silvan hero we get in Trouble in Tharbad is and if he/she ties into what will be an established archetype at that point.\n\nI run them right now, or for about a month since Celeborn was previewed: Celeborn, Elrond, Glorfindel. But mark my words, I do not think it will be long till this line-up becomes obsolete once we get Galadriel and Haldir, both all but confirmed, Haldir in the third pack and Galadriel surely later as this cycle deals with Celebrimbor's secret.\n\nThe Tree People is an amazing card, Island Amid Perils is good enough, we can expect a nice Leadership event too. Naith Guide is excellent, Galadhrim Minstrel will search for something (check the preview) and we can expect a 2-cost Spirit Silvan ally. All together this will be an extremely exciting deck, especially if either Galadriel (very likely) or Haldir add a bit of synergy. Celeborn himself however, is turning the bouncing Silvan allies into an extreme force."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049887","commentId":1049887,"userName":"ana4","timestamp":1397549391,"content":"> Just had another thought on Wingfoot ~ it pairs nicely with ranger bow as well.  Putting the bow on a hero always seemed like a bit of a waste of an action but now could be a solid strategy especially if those extra copies of ithilien tracker dont want to pop out of your deck.  \n\nYes again. Faramir was screaming for action advantage, now he can quest for 2 (3 when Visionary Leadership is around) and be ready to attack to shoot the bow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049895","commentId":1049895,"userName":"ana4","timestamp":1397550627,"content":">  \n> \n>  \n> \n> Wingfoot ... this almost instantly makes Leadership Aragorn not necessarily obsolete, but by far the lesser of the two versions by now a wide margin...\n> \n>  \n\nAnother good point. When Prince Imrahil was released, I was in a really suppressed minority thinking that he will be better than Leadership Aragorn. Well, of course all this depends, but I think right now it is quite safe to think Imrahil finds his place much more easily than Aragorn. Characters leave play in so many different types of decks so regularly that you can almost always count on a free action, whilst resources are precious in many a deck. Of course, Aragorn has his artifacts to the rescue and the Dúnedain synergy will surely develop as well, but Strider is the one to pick, especially with Wingfoot coming up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1049960","commentId":1049960,"userName":"shoreless","timestamp":1397560115,"content":"I wonder why they went with Nin-in-Eilph instead of just 'Swanfleet'? I suppose it's just a change of pace. After all, the first expansion was Khazad-dûm and not just 'Moria'...that and Nin-in-Eilph will (1) sound hilarious when we all try to pronounce it and (2) has a much more ominous cadence than 'Swanfleet', which may already be part of the My Little Pony CCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050038","commentId":1050038,"userName":"MyNeighbourTrololo","timestamp":1397569967,"content":"No one seems to mention it, so I will:\n\nI'm extremely thrilled for this Ancient Marsh Dweller.\n\nLovecraft is my favorite type of creature, nameless ones are my favorite enemies in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050042","commentId":1050042,"userName":"Bullroarer Took","timestamp":1397570290,"content":"The Ancient Marsh Dweller is for real too. I have a hunch Glaurung will be feeding it dwarves by the dozen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050081","commentId":1050081,"userName":"Scroll Lock","timestamp":1397572253,"content":"I like that they are making enemy engagement cost higher. I hate when some enemies have 5, 12 of 17 engagement cost. It is impossible to avoid them! Making them \"1 threat engagement\" would not change anything. But all the Dunland enemies had 30+ engagement (except for one) and most of the spoiled enemies are over this magic 30, too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050347","commentId":1050347,"userName":"ana4","timestamp":1397584582,"content":"Yeah, this is a great point above. I did not get it why there were some 15, 10 or even 5 engagement cost enemies in the core set, for instance. I think it could in general be like this:\n\n1 -- for obvious reasons, auto-engagement\n\n20 -- to be avoided only with secrecy\n\n30 -- to be avoided with a lower threat starters, or with threat reduction\n\n35 -- giving Dúnhere and Rohan or Ranger decks without threat reduction some time\n\n40 -- biggies\n\n50 -- enemies that enjoy staying in the staging area"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050379","commentId":1050379,"userName":"Raven1015","timestamp":1397585866,"content":"Leadership Aragorn will continue to be relevant, especially for mono-Leadership decks, thanks to Sword that was Broken and his other Aragorn-specific toys, as well as his overall stat balance. Resources aren't too big a deal in Leadership and it's usually pretty easy to use his ability every turn, especially if you use the old, reliable Theodred combo. On the other hand, i'm super excited for Wingfoot, especially in that it is providing much-needed readying for Lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050455","commentId":1050455,"userName":"Noccus","timestamp":1397588785,"content":"> Yeah, this is a great point above. I did not get it why there were some 15, 10 or even 5 engagement cost enemies in the core set, for instance. I think it could in general be like this:\n> \n> 1 -- for obvious reasons, auto-engagement\n> \n> 20 -- to be avoided only with secrecy\n> \n> 30 -- to be avoided with a lower threat starters, or with threat reduction\n> \n> 35 -- giving Dúnhere and Rohan or Ranger decks without threat reduction some time\n> \n> 40 -- biggies\n> \n> 50 -- enemies that enjoy staying in the staging area\n\nThis should be a sticky post for all the devs to read.\n\nOf course the should be exceptions, but the point stands.\n\nI couldn't agree more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050632","commentId":1050632,"userName":"Karlson","timestamp":1397595575,"content":"I rarely use Leadership Aragorn now, but use his Lore version all the time.  All these Ranger additions are going to make him that much more potent in one of my favorite tri-sphere decks: Frodo, Sam, and Aragorn.\n\n \n\nI was curious as to how many Ranger heroes are currently in the card pool, so I did a quick search in the Hall of Beorn's database:  Both Aragorns, Beravor, Elladan, Elrohir, and Faramir.  We'll also get the new one in this particular AP and I'd be willing to bet that they'll be one in another AP as well (The Three Trials, perhaps?)  \n\n \n\nI'm excited to get more use out of Faramir.  As much as I want to like him, he usually falls flat in quests, but this single attachment will really make him excellent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1050961","commentId":1050961,"userName":"Pharmboys2013","timestamp":1397613079,"content":"> Leadership Aragorn will continue to be relevant, especially for mono-Leadership decks, thanks to Sword that was Broken and his other Aragorn-specific toys, as well as his overall stat balance. Resources aren't too big a deal in Leadership and it's usually pretty easy to use his ability every turn, especially if you use the old, reliable Theodred combo. On the other hand, i'm super excited for Wingfoot, especially in that it is providing much-needed readying for Lore.\n\nBefore writing my bit on the potential obsoleteness of leadership Aragorn I did in fact consider sword that was broken as the preeminent reason he would see continued use, but then I also thought about how the two Glorfindels again and how even though Asfaloth, his best attachment, is lore, that hasn't really caused anyone to use the old one over the new one especially with the readying tool matching the latter. A very similar scenario may now exist with the two Aragorns although I do acknowledge there is a significant difference between the playability of 2 (Asfaloth) cost cards compared to 3 ( StwB) cost cards. Perhaps it'll be best to see until after the AP is released and make a pool to tally how people have been playing of using the two versions with the new cards available. Time will tell"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051052","commentId":1051052,"userName":"Sinamil2","timestamp":1397620506,"content":"I still enjoy playing Leadership Aragorn for an artifact deck as his attachment to give leadership is expensive and the only one redundant (stone gives spirit, ring gives lore).  He also has good traits to go along with being a ranger and can easily help in playing a first turn SoG.  Just my two cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051096","commentId":1051096,"userName":"Nickpes","timestamp":1397625378,"content":"> Galadriel and Haldir, both all but confirmed, Haldir in the third pack and Galadriel surely later as this cycle deals with Celebrimbor's secret.\n\nMaybe i missed some info, but why do you think Haldir will be on the 3rd? He suits me just fine as the ranger hero in the Nin In Eilph AP as the ranger Hero"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051170","commentId":1051170,"userName":"ana4","timestamp":1397632792,"content":"No, I do not think so. I do not think they will meddle with Ranger trait for Silvan. If anything, Haldir will be a scout, Rúmil is after all. A Silvan hero is mentioned in the third pack announcement, I cannot think of a better choice than Haldir.\n\nThe Ranger hero will more likely be of Ithilien or Eriador."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051188","commentId":1051188,"userName":"Nerdmeister","timestamp":1397634810,"content":"I think that comparing the two Aragorn´s to Wingfoot in a vacuum isn´t really the way to go about it.\n\nThere are plenty of decent ranger questers to attach Wingfoot to so that you´d have both leadership Aragorn plus another hero to quest and unexhaust. Also Wingfoot requires you to draw it (duh) before being able to use it whereas Aragorn is ready for action from round 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051227","commentId":1051227,"userName":"Nickpes","timestamp":1397638187,"content":"> No, I do not think so. I do not think they will meddle with Ranger trait for Silvan. If anything, Haldir will be a scout, Rúmil is after all. A Silvan hero is mentioned in the third pack announcement, I cannot think of a better choice than Haldir.\n> \n> The Ranger hero will more likely be of Ithilien or Eriador.\n\nI see your point. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051234","commentId":1051234,"userName":"Attercop","timestamp":1397638630,"content":"> hopefully it's Halbarad\n\nI have a feeling that this new ranger could be the woman on the front of the second Adventure pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051257","commentId":1051257,"userName":"ana4","timestamp":1397641925,"content":"Oh, you think they messed up again? Haha. No, I think the woman is a Dúnedain hero for that pack (Three Trials) and we get a Ranger hero (Gondor or Dúnedain, probably the former then) for Nin-in-Eilph."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051379","commentId":1051379,"userName":"Scroll Lock","timestamp":1397654256,"content":"I hope they did not forget about Rohan. I hope we will get at least 1 more rohan hero. 3 rohan tactics cards from VoI do not make tactics rohan built :/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1051479","commentId":1051479,"userName":"ana4","timestamp":1397659999,"content":"But remember, Rohan will probably get another boost with the third saga, it is all in Rohan... though Ents shall come to war then too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1052120","commentId":1052120,"userName":"Pharmboys2013","timestamp":1397689515,"content":"I feel like Rohan has already got a lot to make them a fun group to play with...or at least they have more now than gondor did at this point for their cycle.  We already know we'll be getting more \"mount\" support and i'm sure some allies will trickle in as well.  I'd be surprised if we dont get a Rohan hero as well in either the 5th or 6th AP (5th is probably a better bet considering the 6th seems primed for an epic elf character given the title of the AP)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1054696","commentId":1054696,"userName":"Noccus","timestamp":1397902807,"content":"Think this cycle's design goal was to mainly fill up some gaps.\n\nWhich is a very good thing imo.\n\nOnly Silvan seems to get really much attention and development as a deck style.\n\nThey stated secrecy support & trait support, which was sorely needed.\n\nYou can't have everything, so I see this cycle as a jack of all trades really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1055651","commentId":1055651,"userName":"Gizlivadi","timestamp":1398009457,"content":"On another note, does the Ancient marsh-dweller have a beak? Btw these new creature enemies are great! But is there a lore reference for such a thing as the marsh-dweller? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1055681","commentId":1055681,"userName":"GrandSpleen","timestamp":1398011622,"content":"I don't know recall reading source material for these creatures -- either it's a minor mention in something I've read, or they come from something I haven't read -- but Tolkien was not often given to detailed physical descriptions.  His interests lied elsewhere.  Hence the 'controversies' about elves' ears, Balrogs' wings, even the color of Legolas's hair."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1055798","commentId":1055798,"userName":"Noccus","timestamp":1398021102,"content":"> I don't know recall reading source material for these creatures -- either it's a minor mention in something I've read, or they come from something I haven't read -- but Tolkien was not often given to detailed physical descriptions. His interests lied elsewhere. Hence the 'controversies' about elves' ears, Balrogs' wings, even the color of Legolas's hair.\n\nIt's not that it wasn't his interest, he was even known to love to create these kind of enigmas.\n\nThe best example is tom bombadil.\n\nOn the marsh dweller: i don't recall anything like it, but it has been years since I read anything Tolkien.\n\nIt might be some lesser watcher in the water type of thing?\n\nI'm interested now too. Google time!\n\nEdited April 20, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1073744","commentId":1073744,"userName":"Sinamil2","timestamp":1399351104,"content":"I really hope they add Galadriel as a scrying hero, Denethor seems lonely in that role.  My dream Galadriel is a Spirit version with 10/3/1/2/4 who can scry a card per player but raises everyone's threat by the number of cards scryed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1073802","commentId":1073802,"userName":"MyNeighbourTrololo","timestamp":1399355201,"content":"> I really hope they add Galadriel as a scrying hero, Denethor seems lonely in that role.  My dream Galadriel is a Spirit version with 10/3/1/2/4 who can scry a card per player but raises everyone's threat by the number of cards scryed.\n\nSounds very similliar to Palantir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1074361","commentId":1074361,"userName":"Narsil0420","timestamp":1399395251,"content":"> I really hope they add Galadriel as a scrying hero, Denethor seems lonely in that role.  My dream Galadriel is a Spirit version with 10/3/1/2/4 who can scry a card per player but raises everyone's threat by the number of cards scryed.\n\n \n\nYou didn't have to wait long to find out what she does!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/103870-the-nin-in-eilph/?do=findComment&comment=1075238","commentId":1075238,"userName":"Sinamil2","timestamp":1399442770,"content":"Yeah, pretty incredible I think and getting me very excited for the Silvan decks."}]}