{"url":"https://community.fantasyflightgames.com/topic/104011-epic-moments/","title":"Epic Moments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1051232","commentId":1051232,"userName":"Mndela","timestamp":1397638601,"content":"Uf, my english is limited but i think this is a good idea to post, and i hope i can explain it here: post epic moments.\n\n \n\nThis post is open for players that can display moments in his game that they could play good combos, good lucky, etc.\n\n \n\nThe only limitation i would add is games about minimum 3 players (becasue if not, you can repeat games easily until to reach the epic play you are thinking about to want to play).\n\n \n\n \n\nMmmmh, better one example. The example that it moves me finallly to open this post:\n\n \n\nIn 4 players, i was playing a caldara deck. In Fords of Isern, when we pass to 3a, and we added 4 more dunlendan enemies to staging. In that moment there was 10 enemies in staging, i had Damrod... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] and i used. -10 threat i got. But i used Caldara to return Damrod to play and i returned to use.\n\nThis is a epic moment: -20 threat by Damrod in only one round.\n\nEdited April 16, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1051432","commentId":1051432,"userName":"Dwarf king Bronze beard","timestamp":1397657386,"content":"Well i dont remember what guest i played with my friend, but situation was this: My friend had Aragorn with sword that was broken and myself had Faramir in play and when we guested i used Faramirs ability to give all my friends charecters 1wp and with that sword, only my friends will power was over 40! It was pretty cool XD\n\n \n\nOh and other was when i played into the pit: My starting hand had 1 gandalf and 2 sneak attacks, then when i guested i tougth that i dont need to use my gandalf sneak attack combo (i know i was so stupid) and then i got that sudden pitfall trachery card and my hero died! O_O\n\nPretty nice...then try again XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1051438","commentId":1051438,"userName":"7theye","timestamp":1397657635,"content":"I remember one game (believe it was Carrock) when I had the last troll and all of my hereos were either dead or exhausted and as the troll was going to attack and kill the last one a sneak attack gandalf did him in :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Gandalf saves the day just like the scene in the Hobbits!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1057756","commentId":1057756,"userName":"Mndela","timestamp":1398179102,"content":"Last games i have played a Gloin deck. 50 cards around to get tones of resources using Gloin's hability.\n\nWell, one of the allies is Longbear Map-Maker. It is thought when i can't spend more resources, i have empty hand, etc.\n\n \n\nM1179.png [http://hallofbeorn.com/Images/Cards/M1179.png]\n\n \n\nAnd it is true, he is very powerful ally! I have won the 2 last games thanks to his hability. For example Foundations of Stone. First comment the cards that are good for him: Bifur (lore and can get one more resource for his hability); stewards on Bifur; 2 errand riders to change resources from Gloin to Bifur. Total 6 resources each round for increase the wp of Longbeard Map-Maker. And remember his first 1wp impressed, and +1 bonus by my 3rd hero: Dain.\n\n1. I had tones of resources on Bifur first time i used, in 2b. We quested a lot and we needed 7 wp points to pass to 3a. No problem, i could spend them thanks to Map-Maker.\n\n2. Alone in 3b, i could pass in the first round without problems thanks to him (i got a 11quest poinst card).\n\n3. And finally when all friends return to join in 4a. Just was revealed a good location (and this is the better epic moment between so many here, lol): Mithril Lode\n\nM1483.png [http://hallofbeorn.com/Images/Cards/M1483.png]\n\nWe win at the same round, we traveled here and i could use Longbeard Map-Maker in refresh phase (before was exhausted). I got thanks to Bifur, Stewards, etc., the enough willpower to trigger the text of the location and place 11 progress tokens on 4b, just to win the game. Lol, without arriving quest phase! Very very good because i never thought it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited April 22, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1070203","commentId":1070203,"userName":"Bullroarer Took","timestamp":1399047724,"content":"Had a pretty epic moment this morning... I was playing Redhorn Gate with the Hobbits With Attitude deck and ready to move to stage 3B.  Pippen already had a copy of Freezing Cold attached (-2 WP, hero can't quest, if a hero ever has two copies of freezing cold attached discard from play).  So I'm on stage 2B and I quest like heck with everyone, including a hard cast Gandalf.  I exhaust Faramir to give everyone a +1 WP boost (knowing that Caradharas is going to give a -1 WP, if a character ever has 0 WP discard from play).  I figure Pippen is a goner...\n\n \n\nReveal a second copy of Freezing Cold!  Attach to Pippen, discard from play.  But wait!  Return Landroval to my hand and put Pippen back in play with no Freezing Cold attached and 1 wound.  Games ends two turns later and Pippen shaken but not stirred."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1070307","commentId":1070307,"userName":"Mndela","timestamp":1399051729,"content":"Congratulations, i like to play Caldara here and i attach to her the Freezing Cold ^^.\n\n \n\nPD: how did Pippin die?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1070309","commentId":1070309,"userName":"MyNeighbourTrololo","timestamp":1399051768,"content":"Landroval can't save heroes from being discarded, he can save them from being destroyed. So, misplay on your side."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1070428","commentId":1070428,"userName":"Bullroarer Took","timestamp":1399057566,"content":"AAAArrrrrrrrgggggghhhhhh!!!!!!!\n\n \n\nThe first time I ever try to Landroval's ability and I eff it up.  So Pippen dies, but Arwen still makes it.\n\n \n\nMndela - Card 3b says to discard any character with WP of 0 or less."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1070517","commentId":1070517,"userName":"7theye","timestamp":1399062217,"content":"Had a great morgul vale today. One deck threats out, 2 wounds on the nazgul and only tactics deck with 47threat and legolas and beorn and beregond. Hard cast gandlaf with my last 5. 3 wounds on nazgul. Figure with no questers have to go for broke here. He quests for 4(no questers otherwise) and I reveal Orc vanguard. Defend the nazgul with beregond and SOC and he goes to 4 wounds but kills beregond. Defend vanguard with chump but get shadow that raises threat by 2 to 49. Legolas kills the vanguard with a black arrow and beorn kills the nazgul just before refreshing to 50 threat.\n\nSo epic! Last possible play and beregond falls killing nazgul and legolas and beorn kill the board with gandalf arriving to save day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1071051","commentId":1071051,"userName":"Mndela","timestamp":1399122056,"content":"A wizard is never late... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] , only comes the last round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1112296","commentId":1112296,"userName":"Mndela","timestamp":1402159387,"content":"Today me and one friend have played 2 nightmare quests: Anduin and Hunt for Gollum. We won both, even making higscore.\n\n \n\nI played a Gondor leadership deck. Good deck: a lot of allies, cheap gondor allies (playing Imrahil), and a lot of quest points (playing Aragorn + Sword broken, visionary leadership)....\n\nBut the another player played a monosphere lore deck. Almost no allies, and the heroes were Pippin, Bifur and Mirlonde. But power control about the encounter deck....\n\n \n\nThe epic moment was:\n\nHunter of Gollum, in 2b, 4 tokens to explore the quest card. Agh! We placed 6 tokens... we need 4 more! Omg... we can't delay more time, nightmare cards are coming....lol.\n\nSolution: the lore guy played Ravens of the mountain.\n\nM1634.png [http://hallofbeorn.com/Images/Cards/M1634.png]\n\n \n\nIt was revealed the eagle, but this event doesnt 'look', so it was not engaged. Yeah! Oh, but.... we need 2 more progress tokens, ****! We must wait one more round in adittion.\n\nBut... no problem! Scroll of Isildur.... Ravens was recycled and... lets go! The next card (the deck is reshuffled) was a 2 threat card. We pass!\n\n \n\nReally lore cards make the life in the middle-earth more more easy. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nPD: the hero exhausted by Ravens was Pippin with 2 Fast Hitch\n\nEdited June 7, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1112459","commentId":1112459,"userName":"GrandSpleen","timestamp":1402171610,"content":"Actually Ravens of the Mountain does instruct you to \"look\" at the card -- they errata'd the card a couple of FAQ versions below.  Doesn't look like this would affect your win though.\n\n \n\nOld:\n\nravens-of-the-mountain.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/FAQ-updates/ravens-of-the-mountain.png]\n\n \n\nNew:\n\nM1634.png [http://hallofbeorn.com/Images/Cards/M1634.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1112597","commentId":1112597,"userName":"DurinIII","timestamp":1402181401,"content":"I had an epic all-heroes-and-allies-dead-moment when I played against Assault on Osgiliath earlier today. I was stomped to death by 5 enemies: Uruk Soldier, Orc Arbalesters, two Southron Commanders and...wait for it...a Mumak! I got slaughtered during this combat phase. I usually fare very well against this quest as it can end rather quickly when you don't reveal too many Osgiliath locations. This time however, the enemies flooded out early and stomped me dead! \n\n \n\nI have had so many cool epic moments in my favor that I can't even remember a good one right now! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1112964","commentId":1112964,"userName":"Mndela","timestamp":1402221382,"content":"I knew Ravens was errated, but i didnt know there was the 'look' word. But, as you say, it doesnt affect the win. Thanks anyway.\n\n \n\nPD: Dunhill --> it is an epic fail ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1113100","commentId":1113100,"userName":"richsabre","timestamp":1402239814,"content":"Epic moments = my first real multiplayer game after around 1.5 years solo play. I know its not 'In game epic' but its still epic :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n \n\nIn momet epicness... the first and only time I flew through return to mirkwood solo when it was still seen as near impossible... only time I ever bothered it solo :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1143498","commentId":1143498,"userName":"PsychoRocka","timestamp":1404491714,"content":"Finally just beat The Watcher in the Water without killing the Watcher and by escaping through the doors of durin, heres what I put in my notes for the quest log:\n\n \n\nUsed the doors of durin successfully for the first time ever! A tentacle killed Elladan shortly after the watcher came out as I arrived at the second stage. This weakened Elrohir and put me in a bad position (still had a mountain warg harrasing me and very low resources on Elrohir to defend with as well as no steward on him..) so I tried the doors just for fun discarding 3 cards total one of which was Gildor Inglorion, the revealed encouter card? GRASPING TENTACLE! G and G! the doors of durin opened and the next turn I quested with everyone for a total of 15 willpower against 9 threat getting 6 progress and finishing the stage with the victory points from the doors and 6 progress tokens. Every other time I've beaten this quest I've killed the watcher, actually looked a bit grim and like it would possibly be a loss until the luck of the doors came through for once, awesome game!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1302241","commentId":1302241,"userName":"silverthorn","timestamp":1413487905,"content":"Deleted due to rampant stupidity on my part.\n\nEdited October 16, 2014 by silverthorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1302837","commentId":1302837,"userName":"PsychoRocka","timestamp":1413538900,"content":"Killing The Balrog in Journey in the Dark is pretty goddamn epic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1302851","commentId":1302851,"userName":"Dwarf king Bronze beard","timestamp":1413539921,"content":"> Finally just beat The Watcher in the Water without killing the Watcher and by escaping through the doors of durin, heres what I put in my notes for the quest log:\n> \n>  \n> \n> Used the doors of durin successfully for the first time ever! A tentacle killed Elladan shortly after the watcher came out as I arrived at the second stage. This weakened Elrohir and put me in a bad position (still had a mountain warg harrasing me and very low resources on Elrohir to defend with as well as no steward on him..) so I tried the doors just for fun discarding 3 cards total one of which was Gildor Inglorion, the revealed encouter card? GRASPING TENTACLE! G and G! the doors of durin opened and the next turn I quested with everyone for a total of 15 willpower against 9 threat getting 6 progress and finishing the stage with the victory points from the doors and 6 progress tokens. Every other time I've beaten this quest I've killed the watcher, actually looked a bit grim and like it would possibly be a loss until the luck of the doors came through for once, awesome game!!!\n\nI usually try to get past Doors Of Durin, but now i could try to beat watcher. It´s going to be epic :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1336645","commentId":1336645,"userName":"Mndela","timestamp":1416184170,"content":"Uah..., we have just won Dunland Trap in 4 players. Always someone does it, it is an epic moment. Ufff. We suffered a lot all the time. Boern first round defending gave us time to increase our power, Ravenhill Tracker + Northern Tracker (in 3b) explored some critical locations, Eleanor (no comments), Sneak-Gandalf-Book, Thor's Key, Elrohir + Parting Gifs + Miruvor..., Good Meal + Sam + Down Take you all discarding shadows the first round, Strengh of Arm ready all allies (Gandalf included ^^), Emery played for free, she defended a hard attack, she was recycled by dwarven tomb and returned to put in play attacking when heroes just needed only +1 attack to kill the enemy, Campfire tales in the correct moment without triggering bad forceds, wow... tones of epic plays.\n\nEdited November 17, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1336743","commentId":1336743,"userName":"divinityofnumber","timestamp":1416191322,"content":"4-players\nEncounter at Amon Din\nYesterday afternoon\n\n \n\nAfter about 5 turns, I had some very bad luck and was out of the game. The other three players continued to struggle a bit, having way more dead villagers than rescued villagers for virtually the entire game. The three of them start to get close to winning, but then reveal that treachery card that adds +1 threat to each player for each dead villager...and there were 14 dead villagers...this would have sent two of the remaining three players out of the game. Luckily, one player has A Test of Will, and cancels that treachery...only to have the next card be the same thing! So, that put two players out of the game, and the remaining player dangerously close to being gone (48 threat). The next round ends up where there are 16 dead villagers and 16 rescued villagers, an active location with 1 villager that could be saved, and the only remaining player in the game at 49 threat. She sent every single bit of willpower in and we all crossed our fingers and it was EXACTLY enough, saving one villager and ending the game. \n\n \n\nThat was one of the best games I have ever played. Three of the four players gone, only one villager that could be saved, with currently an equal amount of rescued and dead villagers, the only remaining player at 49 threat, and she quested with exactly enough willpower to finish off the active location and save that last villager. So epic.  \n\nEdited November 17, 2014 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1336899","commentId":1336899,"userName":"TwiceBorn","timestamp":1416211895,"content":"Some of my most epic games are ones that I have lost...\n\n \n\nEscape from Dol Guldur, straight solo using 50-card decks built from Core set cards only\n\n \n\nHeroes: Aragorn, Eowyn, Legolas\n\n \n\nIn this game, I went 28 rounds in Escape from Dol Guldur, waiting for the Shadow Key which got shuffled into the encounter deck by the Dungeon Jailor to reappear (and it did… when my threat was at 49 and claiming it would have put me over 50… reached 50 during the refresh phase anyway  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] ).\n\n \n\nLegolas randomly selected as prisoner. Stage 2 reached by round 5. Legolas rescued by round 6. Ungoliant’s Spawn dead round 8. Shadow Key in discard pile (drawn as Shadow effect after shuffled into encounter deck by Dungeon Jailer). Legolas killed by hummerhorn round 16. Nazgul dead round 17. Game ended round 28, when threat reached 50 (engaged with Chieftain Ufthak, attacking at +13!). Shadow Key emerged from encounter deck on round 28, when threat at 49. 35+ tokens on stage 2, but could not proceed to stage 3 without Shadow Key. Killed Nazgul, Ungoliant’s Spawn, Dungeon Jailer x2, hummerhorn.\n\n \n\nEscape from Dol Guldur, two-handed using 50-card decks from single Core set only\n\n \n\nHeroes hand 1: Eowyn, Legolas, Denethor\n\nHeroes hand 2: Aragorn, Theodred, Eleanor\n\n \n\nThe beginning and end of this quest felt like it came out of a fantasy horror movie… I could totally picture it in my mind, especially the final scene.\n\n \n\nEleanor randomly selected as prisoner (and Caught in a Web). Chieftain Ufthak in play round 1. Stage 2 and Eleanor rescued (by Legolas attack) round 5. Engaged with Nazgul, Ungoliant’s Spawn, and Dol Guldur Beastmaster round 6. Nazgul dead round 7. Ungoliant’s Spawn dead round 7. Encounter deck reshuffled round 8. Round 8: 6 heroes vs. Dungeon Jailor x2, Dol Guldur Beastmaster x2 and Cavern Guardian. Stage 3 round 10 (Planning phase). Ungoliant’s Spawn and King Spider revealed by encounter deck, Hummerhorns already in staging area (threat 40 both hands); all characters save Aragorn committed to quest/exhausted and quest fails by 1 due to Ungoliant’s Spawn’s “when revealed” power; Eowyn, Legolas, Denethor and Theodred die from undefended damage (enemies now also included Orc Guards vs. each side). End of same round (10), Aragorn dies from Shadow Key damage at end of round. Eleanor left with Citadel Guards x2, but threat exceeds 50 round 11 (and she is Caught in a Web and Iron Shackles is revealed by encounter deck and slapped on her (on first player deck).  So the prisoner was given false hope of rescue. As Eleanor and her rescuers made their final rush to escape the dungeons in stage 3, all of her hero-friends, allies and rescuers were killed (save for 2 Citadel Guards) at the last second, she got caught in a web and then was slapped into iron shackles then dragged back into the dungeons as her threat reached 50… it's as if the enemies had been playing with her mind all along… Sick, and memorable... \n\n \n\nEscape from Dol Guldur, straight solo using 50-card decks built from Core set cards only\n\n \n\nHeroes: Aragorn, Eowyn, Denethor\n\n \n\nDenethor randomly selected as prisoner. Threat down to 22 during round 3. Stage 2 round 6. Denethor rescued round 7. Eowyn and Nazgul dead round 9. Stage 3 round 15. Denethor killed by Hummerhorns round 16. Threat reached 50 end of round 16 (because of Under the Shadow treachery that raised my threat by 3!)… 6 progress tokens on stage 3, would have won next round!!! Felt victorious and totally crushed at the same time… epic game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1336905","commentId":1336905,"userName":"TwiceBorn","timestamp":1416212397,"content":"And now for a truly epic victory...\n\n \n\nEscape from Dol Guldur, two-handed using 50-card decks built from single Core set only\n\n \n\nHeroes hand 1: Eowyn, Legolas, Denethor\n\nHeroes hand 2: Aragorn, Theodred, Eleanor\n\n \n\nEleanor randomly selected as prisoner. Legolas = Steward of Gondor on round 1. Beorn in play round 2, Celebrian’s Stone on Aragorn round 2. Stage 2 end of round 2. Eleanor rescued round 3, optionally engaged Nazgul. Beorn goes berserk, and he, Legolas, and Miner of the Iron Hills kill Nazgul in round 3. Cycled through encounter deck end of round 6. Beorn back in play round 7. Beorn goes berserk again and kills Ungoliant's Spawn in round 8. Nazgul returns round 11, preventing heroes from claiming 2 objectives and going to stage 3 for fear of damage/threat gain). Cycled through entire encounter deck a second time by round 11. Nazgul destroyed for second time in round 12. Stage 3 round 13 (Planning phase) - Galadhrim's Greetings had reduced each side's threat by 2 or would have exceeded 50 when claiming Shadow Key and Dungeon Torch; quested successfully to escape dungeons/win game. Legolas was Steward of Gondor this game. Last round, Denethor, Eowyn and Legolas engaged with/fled from Dungeon Jailor, Dol Guldur Beastmaster, Orc Guard; Aragorn, Theodred and Eleanor engaged with/fled from Dol Guldur Orcs, Cavern Guardian, Orc Guard). Took a lot of hits throughout game that were absorbed by Citadel Plate on Denethor and Aragorn; Denethor also had Dark Knowledge and Self-Preservation, Aragorn Unexpected Courage. Eowyn claimed Gandalf's Map and Dungeon Torch, Theodred claimed Shadow Key. One more round and would have lost game… totally epic victory! VP = Hummerhorns.  \n\nEdited November 17, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1340783","commentId":1340783,"userName":"PsychoRocka","timestamp":1416491421,"content":"not necessarily an epic moment as much as a really proud moment in my last game against To Catch An Orc.\n\nI used to have a lot of trouble against this quest but in this game I had an awesome start with O Lorien and a few other awesome early cards (first time using O Lorien) and got a very good early footing against the encounter deck. Loaded up Haldir BIG TIME so that he could take out most enemies in staging and Legolas and various allies would clean up others. Loaded up Elrohir to be a super defender as well. Then I slightly broke the quest... for about 6 or so turns I was able to clear most of or all of the staging area and kill all enemies but couldn't trigger enough search effects to reveal Mugash... I had already taken out his guard coming out of the lore/spirit's out of play deck fairly early on the turn it was revealed after feinting it. I was able to get phenomal draws from the search keyword most turns and had two feints and two feigned voices throughout the game and two galadhon archers to bounce with them (one of the times I took out a tough enemy on one hitpoint left using this combo) as well as amazing cards with the spirit/lore deck such as two Galadriel's Handmaidens, two Northern Trackers, Gildors Counsel and others. I just could not get Mugash out but was easily able to place 6 to 10+ progress tokens on the quest stage each turn putting a new time counter on it bouncing it back and forth between 1 and 2 over these several turns.\n\nEventually by keeping a Mugash's Lair in play and exploring a last seventh copy of Mehadras in the game I was able to Search the last three cards in the tactics/leadership out of play deck and reveal Mugash at last!\n\nI was able to smash his ugly orc face in immediately (with a point or two of damage to spare to boot!) and two of his orc cronies as well! I even had the time counters run out ONCE on stage 2 the turn before Mugash appeared but I regained control fairly easily (with help of Gandalf, Orophin and the ally he returned to my hand) when a copy of Take Cover! that I couldn't counter appeared and cleared many of my 1 hitpoint allies whilst several surges triggerred and I was unable to put progress tokens on the quest stage after losing alot of questing power from dead allies. I was able to clear enough locations with Asfaloth and kill all enemies that appeared on stage 3 that on the second turn and with only one time counter left I was able to risk a massive questing push of 32 and managed to put 15 counters straight on quest stage 3 (which already had one progress token) and quest to victory right before Mugash became unattached.\n\nFelt pretty good (albeit slighty boring and frustrating) being able to easily crush the encounter deck and consistently place a time counter and clear the staging area over many turns before Mugash appeared buidling a massive army and many attachents in the process. I then crushed Mugash instantly and crushed stage 3 over two turns even after having stage two's nasty time effect trigger thanks to a badly timed Take Cover!. I did have luck on my side but my decks absolutely shined and by saving Orophin for a board wipe I knew would come at some point and various other combos/strategies I pulled off it was as much me as it was luck.\n\nDefinitely a very courage boosting game, back to trying to get a second win against Nin-In-Eilph (which I've been unable to do and found the quest much harder now since my first win) with my new changes to my decks.\n\nMay (fairly likely) just get smashed but at least this game was great! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1342543","commentId":1342543,"userName":"TragicTheBlathering","timestamp":1416603258,"content":"I had a strange one, a few days ago. I was playing a solo game of \"Khaz 3/3 - Flight from Moria\".\n\nTurn 0\n\n• 27 Start Threat\n\n• Draw 6\n• Reveal 1st encounter card (1b)\n\n• Chance Encounter (nothing in discard, gains surge)\n\n• New Delivery (On stage 1, gains surge)\n\n• Massing in the Deep (+1 Threat, Surge 1)\n\n• 28 Threat\n\n• A Foe from Beyond\n\nNow this was hilarious. Stage 1b says..\n\n\"When Revealed: Reveal 1 encounter card per player, and add it to the staging area. THEN, add A Presence in the Dark to your victory display.\"\n\nSo, as this is all in the \"reveal\" step at the start of those instructions before the then, there was no victory points in my display so the Nameless Fear was still 0,0,0. So no damage.\n\n• Add Presence in the Dark to Victory Pile\n\n• Nameless Fear is now 2,2,2\n\n• Quest for 4.\n\n• Reveal 2b of quest card\n\n• Narrow Paths, now I am questing for 2.\n\n• Reveal Encounter Card\n\n• Undisturbed Bones - No Allies no damage.\n\n• 2 threat, 2 quest, no threat gain.\n\n• Refresh (29 Threat)\n\n \n\nTurn 1\n\n• Quest for 4\n\n• Flip to side 2b (Narrow Paths)\n\n• Reveal Mountain Roots\n\n• 3 threat, 4 Quest\n\n• Place 1 Token on Quest card\n\n• Fetch Abandoned tools and ADD it to the staging area (so guarded dose not trigger)\n\n• Travel to Mountain Roots\n\n• Tap Boromir to claim Abandoned Tools\n\n• Bypass Quest\n\n• Refresh (30 Threat)\n\n \n\nTurn 2\n\n• Cast The Galadhrim's Greeting -6 Threat. (Frodo 3-3=0)\n\n• 24 Threat\n\n• Cast Narvi's Belt (Gimli (3-2=1)\n\n• Quest for 4\n\n• Reveal 2b (Escape from Darkness)\n\n• Reveal Stray Golbin (1,1,1)\n\n• 3 Threat, 1 Travel, Questing for 4\n\n• Tap Belt and pick Spirit\n\n• Cast Bofur for 1 spirit and add 2 Quest power (Gloin 1-1=0)\n\n• 4 Threat, 1 Travel, Questing for 6\n\n• No threat gain\n\n• Complete Mountain Road\n\n• Engage Stray Goblin\n\n• Deal Shadow Card\n\n• Defend with Boromir\n\n• Cast Swift Strike (Boromir 3-2=1)\n\n• Stray Goblin Dies.\n\n• Refresh Phase, Untap Boromir 4 times, +4 Threat, +4 tokens on quest card\n\n• 28 Threat\n\n• Escape From Darkness has 4 tokens...\n\n• Game Over.\n\n \n\n \n\nTurn 2, No Damage, No Dead Heroes, 28 Threat. == 48points.\n\n \n\nWTF.\n\n \n\nStrangest game ever. The real funny thing was drawing all those surges at the start and then the big evil Foe from Beyond one.. and it having no effect as the Nameless Fear at this time was 0,0,0. I have never once seen that before ever.\n\n \n\nMaybe not epic.. but this was a quest to remember, a unique version of Escape From Moria I felt!\n\n \n\nhehe\n\n \n\n(Hope I got that down all correctly)\n\nEdited November 21, 2014 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1342729","commentId":1342729,"userName":"Mndela","timestamp":1416611839,"content":"Playing Caldara in a bisphere deck. In the Ring Goes Suth with 2 more friends. We just past to 3b and the Watcher combats. We only had for attack: Radagast, Gandalf and Haldir beating up to 4. The total attack was 9. So we only deal 4 damage to Watcher, when we need 6 damage to get Frodo free and commit and win the next round before Watcher kill us. We thought a lot how to increase our power... Oh wait, i had a West-rider (the ally that changes of controller paying an spirit resource), and i had 2 resources on Eowyn. Ok nice, and all the allies were just ready by Strength Arms... but, not enough, we would need only one more.... wait! Let me check my discard pile.... yeah! Another West-rider!!! I use Caldara to bring to me, and i pay to pass him to the player attacker... cool, we deal 6 damage to Watcher.\n\nNext round we made a 'run you fools' commit a lot and yes, we won. Epic Caldara in bisphere deck!!! 156 score in 3 players. A very good score... epic score ^^\n\nEdited November 21, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1343908","commentId":1343908,"userName":"Scroll Lock","timestamp":1416751184,"content":"It was not an epic moment, it was more like a biggest plot twist in the history of my LOTR LCG playing.\n\nI was trying out my new two cooperative decks (Eowyn, Glorfindel, Sam and Haldir, Beregond) on Road to Rivendell. Everyrthing went ok although there was one sleeping sentry in very bad moment, but I did it to the stage 3. Staging area was clear and I had questing power of 15 (many allies died for sleeping sentry and other nasty treacheries). I ned 7 points for the quest card+ active location. I also had 1 secret paths in my hand. I did not send Arwen for quest cos she had 1 damage.\n1st card: sleeping sentry. Ok, good that I did not send her. But 1 ally died and everyone is exhausted. Luckily I am gonna win the game this round so I wont need them...\n2nd card: Orc Ambush.\n\nOrc-Ambush.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Road-to-Rivendell/Orc-Ambush.png]\n\nThere were no orc enemies in the staging area so I had to return all orcs in discard pile. I RETURNED 16 ORC ENEMIES TO THE STAGING AREA!!! I was laughing like I was crazy when returning orcs 1 by 1 to the staging area.\n3rd card (cos of surge) was some location. Both decks raised threat by 20 or something.\n\nThey crushed me in the same round. 14 attacks went undefended.\n\nEdited November 23, 2014 by Scroll Lock"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1343953","commentId":1343953,"userName":"joezim007","timestamp":1416757276,"content":"Oh man that sucks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1344012","commentId":1344012,"userName":"Mndela","timestamp":1416763395,"content":"It is an epic fail ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1344356","commentId":1344356,"userName":"TwiceBorn","timestamp":1416798807,"content":"Ouch… "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1347938","commentId":1347938,"userName":"CaffeineAddict","timestamp":1417036672,"content":"Not so much an epic moment, as what felt like an epic set of games... I recently acquired the second half of the dwarrodelf Nightmare cycle, and the Heirs of Numenor Nightmare decks. I'd previously been struggling to get passed the Watcher in the Water Nightmare, mainly due to having very few cards in my deck that can pass The Doors of Durin.\n\n \n\nSo yesterday evening, I made a few tweaks to the deck I've been using (Gandalf, Elrond and Glorfindel), and tried again...\n\n \n\nI beat Watcher in the water after a lucky hit on doors of durin, then beat the long dark Nightmare twice, and Foundations of Stone Nightmare. Then I went for Shadow and Flame Nightmare, lost the first but beat it on the second and third attempts. Then I followed up with a victory over Nightmare Peril in Pelargir.\n\nDidn't have time to go for the remaining heirs quests, but beating five new nightmare quests in a row in one evening felt pretty epic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1347962","commentId":1347962,"userName":"Mndela","timestamp":1417038552,"content":"Epic evening ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1348138","commentId":1348138,"userName":"PsychoRocka","timestamp":1417047238,"content":"> Not so much an epic moment, as what felt like an epic set of games... I recently acquired the second half of the dwarrodelf Nightmare cycle, and the Heirs of Numenor Nightmare decks. I'd previously been struggling to get passed the Watcher in the Water Nightmare, mainly due to having very few cards in my deck that can pass The Doors of Durin.\n> \n>  \n> \n> So yesterday evening, I made a few tweaks to the deck I've been using (Gandalf, Elrond and Glorfindel), and tried again...\n> \n>  \n> \n> I beat Watcher in the water after a lucky hit on doors of durin, then beat the long dark Nightmare twice, and Foundations of Stone Nightmare. Then I went for Shadow and Flame Nightmare, lost the first but beat it on the second and third attempts. Then I followed up with a victory over Nightmare Peril in Pelargir.\n> \n> Didn't have time to go for the remaining heirs quests, but beating five new nightmare quests in a row in one evening felt pretty epic.\n\nhow in the world did you beat nightmare shadow and flame and foundations that easily..... unless you got MEGA MEGA lucky or spent a while building decks very specifically for those quests this does not sound doable at all......\n\nDid you use Galadriel hero or Burning Brand for Shadow and Flame? If not how on earth did you beat it second and third attempt without Blazing Grip or Morgoth's Bidding crippling your characters. \n\n \n\nEDIT: I guess you could have removed the shadow card from Durin's Bane every turn with Gandalfs Staff..... AND he can be the recipient of Burning Brand as well..... yet another reason the Gandalf hero is way overpowered.... if you play solo and get his staff out he just shuts down Durins Bane COMPLETELY. At least even Galadriel cannot guarantee safety as many doomed cards can raise your threat and stop her from keeping you on 0 threat and Burning Brand can only be put on Lore heroes so you would need to load them up with defense boosters big time or have LOTS of available healing for them to be able to defend against Durin's Bane each turn or alternatively would need to get a Song of Wisdom AND THEN burning brand on your non-lore defensive hero. All of this requires a minimum of two cards and potentially more whereas with Gandalf you just need his staff and his stellar base stats...\n\n \n\nDOUBLE EDIT: Oh wait thats right the staff can't remove shadow cards from a unique enemy which Durin's Bane is.... my bad....\n\nyeah still no idea how you did this second attempt and then beat it on the third attempt AS WELL.\n\nI've beaten pretty much all the other nightmare quests (other than foundations and the new HoN ones which I don't have yet) and have found this one to easily be the hardest to date (again excluding HoN as I haven't tried it) and have gotten stomped by it like ten times or something so I'm just shocked at how easily and quickly you were able to beat it, not implying anything at all it just seems wrong.... or some insanely good luck. \n\nEdited November 27, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1348404","commentId":1348404,"userName":"CaffeineAddict","timestamp":1417070682,"content":"writing in a hurry before I leave for work, so this may not be too coherent:\n\n\n\nNo Galadriel or Burning Brand, this was still the Gandalf, Elrond and Glorfindel deck. It's similar to the one that’s been discussed at length in the strategy section (though not identical).\n\nThere was a fairly large army of Eagles involved, along with Arwen, Northern Trackers, and a few other allies.\n\n\n\nI used some early threat reduction to give myself a couple of turns of breathing room before having to deal with Durin's Bane, and quested through the first stage as quickly as possible. Gandalfs ability and Vilya were key to pumping out allies very quickly, and sacrificing lots of eagles to build up a beefy eagle of the misty mountains, who eventually had enough defence to deal with the attacks unscathed. Desendant of Thorondor was a good sacrifice here, as he deals the balrog 2 when you play him, sacrifices himself as a defender (but has more then 1 hit point so nasty shadow effects don't kill him and leave the attack undefended), and then deals another two when he leaves play, and then makes the misty mountain eagle stronger.\n\n\n\nGandalf, Glorfindel and the allies made a pretty strong fighting force for attacking, and Flame of Arnor helped, sometimes using wizard pipe to put an expensive card on top of my deck.\n\n\n\nBlazing Grip didn't hurt too much, as I defended with allies with more than one hit point (most of the time), and never with my heroes with their necessary attachments.\n\nMorgoth's bidding is more annoying, but I didn't see it too often, and had sufficient allies to defend multiple times.\n\n\n\nGetting through the quest stages as quickly as possible was fairly key, to minimize the number of times durin's bane could actually attack.\n\nEdit: to fix some typos.\n\nEdited November 27, 2014 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1348943","commentId":1348943,"userName":"PsychoRocka","timestamp":1417128828,"content":"Hmmmmm well you've done two things! Impress me and also further my opinion that the Gandalf hero is far too powerful  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nYour use of Eagles of the Misty Mountains is pretty clever (no attachments to remove, more than one health and after sacrificing several other eagles they can actually block most damage from Durin's Bane altogether, especially buffed with Arwen). Thorondor is also a good pick!\n\nSo good work on your strategy and win! It does look like Gandalf was quite largely responsible however as without him you wouldn't have been able to play allies so fast. I also still don't think a nightmare deck like that should be so easily beatable.\n\nEdited November 27, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349191","commentId":1349191,"userName":"Raven1015","timestamp":1417156665,"content":"So far I beat Nightmare Shadow and Flame with a Dwarf deck. Nori keeping my threat at 0 felt kind of cheese, but it got the job done. I do want to see if I can rack up a victory without one of the power decks.\n\nEdited November 28, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349195","commentId":1349195,"userName":"PsychoRocka","timestamp":1417157138,"content":"> So far I beat Nightmare Shadow and Flame with a Dwarf deck. Nori keeping my threat at 0 felt kind of cheese, but it got the job done. I do want to see if I can rack up a victory without one of the power decks.\n\nYeah like I'm tempted to use Galadriel but I don't want to have to use her just to beat it I want to do it with my normal decks =\\\n\nI've come so **** close several times... thought I had it once for sure and then got decimated. I've also lost a few times during the first turn and once on staging as well though =P\n\nEdited November 28, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349209","commentId":1349209,"userName":"Nerdmeister","timestamp":1417159476,"content":">  \n> \n> • Refresh Phase, Untap Boromir 4 times, +4 Threat, +4 tokens on quest card\n> \n>  \n\nCan´t be bothered to look for it right now but IIRC, abandoned tools was changed so it can only be used once per turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349243","commentId":1349243,"userName":"MyNeighbourTrololo","timestamp":1417162371,"content":"I think it was in a nigthmare quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349288","commentId":1349288,"userName":"Nerdmeister","timestamp":1417167989,"content":"Hmm might be.\n\nGuess I´ll go home and have a look at the NM cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349325","commentId":1349325,"userName":"MyNeighbourTrololo","timestamp":1417174376,"content":"Flight-from-Moria-Nightmare-SetupA.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Flight-from-Moria-Nightmare/Flight-from-Moria-Nightmare-SetupA.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349360","commentId":1349360,"userName":"gandalfDK","timestamp":1417177522,"content":"Abandoned-Tools.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Abandoned-Tools.png]\n\nSearch-for-an-Exit-Escape-from-Darkness. [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Search-for-an-Exit-Escape-from-Darkness.png]\n\n \n\nAnd there is nothing in the FAQ that says you can't exhaust Boromir 4 times. But\n\nYou are correct about the Nightmare Quest FFM. Then you can't exhaust 4 times. Flight-from-Moria-Nightmare-SetupA.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Flight-from-Moria-Nightmare/Flight-from-Moria-Nightmare-SetupA.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349412","commentId":1349412,"userName":"Nerdmeister","timestamp":1417182304,"content":"Seems like indisputable scientific evidence about the tools.\n\n \n\nAlso:\n\nHas someone claimed that you can´t exhaust Boromir 4 times? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1349585","commentId":1349585,"userName":"gandalfDK","timestamp":1417190615,"content":"> Seems like indisputable scientific evidence about the tools.\n> \n>  \n> \n> Also:\n> \n> Has someone claimed that you can´t exhaust Boromir 4 times? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nYes  :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]  Okay, maybe not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1350183","commentId":1350183,"userName":"Mndela","timestamp":1417217402,"content":"Last round in Rivendel Nmare, 3 players, we were going good, very good. But a Crevain is in staging. One has Test of Will but cant use. We fear the worst: an sleeping centry or Orc ambush. Omg! We can't kill it!!! No Hands upon the Bow, one Thorondor, but not enough to kill it..., no way. One friend says: i have .... (which would you think? ^^): Saruman!!! All people raising 3 points saying 'yeah! sure!'. Crevain was out of game and we could cancel treachery. Finally next cards revealed weren't nasty treachery, but anyway: Saruman was EPIC.\n\nEdited November 28, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1350505","commentId":1350505,"userName":"Glaurung","timestamp":1417234808,"content":"Yes Saruman is quite interesting card. Give you a lot if versatility in different ways. 1 card per deck very useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1352202","commentId":1352202,"userName":"Teamjimby","timestamp":1417396493,"content":"Had a pretty epic moment today with GrandSpleen.  We were playing A Knife in the Dark campaign mode and I was running Galadriel/Pippin/Sam to go with his Celeborn/Haldir/Legolas.  We were about to clear Midgewater and quest phase 2B and make our way onto quest phase 3 where you add all the Nazgul to the staging area.\n\n \n\nWe were in pretty good shape and our threats were low enough that we wouldn't have to engage the Witch King or a couple of the nazgul.  Unfortunately there were already 2 spys in the staging area because we had to travel to Midgewater.  So, we would probably have to fight 2 or 3 spys and 2 nazgul this turn.  Not great, but manageable.  We commit to the quest and what comes out?\n\nSquint-Eyed-Southerner.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Black-Riders/Squint-Eyed-Southerner.jpg]Unwanted-Attention.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Black-Riders/Unwanted-Attention.jpg]\n\nAnd of course, since we are playing campaign mode:\n\nThe-Ring-Draws-Them.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Black-Riders/The-Ring-Draws-Them.jpg]\n\nHe drew the unwanted attention and was only questing with Celeborn, so we had to shuffle another ringwraith into the deck.  Of course, then all the Nazgul and the Witch King appeared in the staging area and immediately engaged me.  All of the sudden I had 9 enemies engaged with me, 8 of which were attacking for 4+.  Also, since I had two Riders from Mordor, all of my characters had -2 willpower, so I needed someone with 4 willpower to block the Witch King.  Luckily, Sam got +6 to all his stats from the engagement, so he was able to block without taking any damage (1 attack blocked).  Another lucky thing was that there were only 2 cards left in the deck, so I didn't have to worry about many nasty shadow effects. \n\n \n\nBesides Sam, all I had in play at that point was a Defender of the Naith (w/ Celeborn), a Silvan Tracker (w/ Celeborn), Galadhrim Minstrel, Bill the Pony, an exhausted Galadriel's Handmaiden, and then Sam had one more action (fast hitch) at +6 attack/defense.  The defender blocked the one lighter attack, taking no damage (2 blocked).  I played tree people to pull back the Handmaiden, ready my defender, and put another defender in play.  Now my two defenders could block two enemies with 4 attack and take one damage each (4 blocked).  Then I played feigned voices to pull back a defender (5 blocked) and ready the other defender.  The Silvan tracker blocked a 4 attack, taking 2 damage (6 blocked).  The remaining 3 were chump blocked with my remaining defender, Bill, and minstrel.  In summary, 9 enemies blocked, only 3 allies killed, no hero damage, and I even had Sam available to attack for 7 and take out a couple Nazgul with the help of Haldir, Legolas, and some archers. \n\n \n\nTwo sneak attack Gandalfs the next round let us take out a few more enemies.  Another turn or two later and all the enemies were killed and we won the quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1352316","commentId":1352316,"userName":"GrandSpleen","timestamp":1417407217,"content":"He had to put progress tokens on the enemies so we could remember which ones had already attacked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1352587","commentId":1352587,"userName":"joezim007","timestamp":1417439863,"content":"That is pretty sweet. Gotta love Silvans! And Sam! Even though they don't tend to defend well, they somehow manage to kick butt anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1353043","commentId":1353043,"userName":"CaffeineAddict","timestamp":1417467723,"content":"> Hmmmmm well you've done two things! Impress me and also further my opinion that the Gandalf hero is far too powerful  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n> Your use of Eagles of the Misty Mountains is pretty clever (no attachments to remove, more than one health and after sacrificing several other eagles they can actually block most damage from Durin's Bane altogether, especially buffed with Arwen). Thorondor is also a good pick!\n> \n> So good work on your strategy and win! It does look like Gandalf was quite largely responsible however as without him you wouldn't have been able to play allies so fast. I also still don't think a nightmare deck like that should be so easily beatable.\n\n \n\nFinally got around to trying Into Ithilien and Seige of Cair Andros Nightmare - Won Ithilien first try, and cair andros on the second attempt (bad starting draw game one, got overwhelmed too quickly). Gandalf was largely responsible there too, so yes I agree he is perhaps a bit too strong. I'm having fun playing him at the moment, but it might be better long term if he was toned down in some way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1353086","commentId":1353086,"userName":"Teamjimby","timestamp":1417469882,"content":"> Hmmmmm well you've done two things! Impress me and also further my opinion that the Gandalf hero is far too powerful  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n> Your use of Eagles of the Misty Mountains is pretty clever (no attachments to remove, more than one health and after sacrificing several other eagles they can actually block most damage from Durin's Bane altogether, especially buffed with Arwen). Thorondor is also a good pick!\n> \n> So good work on your strategy and win! It does look like Gandalf was quite largely responsible however as without him you wouldn't have been able to play allies so fast. I also still don't think a nightmare deck like that should be so easily beatable.\n\nDon't the fallen eagles that buff Eagles of the Misty Mountains count as attachments?  I'm pretty sure Blazing Grip would take them out (although at least not undefended)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1353294","commentId":1353294,"userName":"PsychoRocka","timestamp":1417483701,"content":"Hmmm you might be right!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1363284","commentId":1363284,"userName":"Mndela","timestamp":1418247923,"content":"Desperate Alliance runs a lot of well with dwarfs.\n\n \n\nEach time i play the deck that i have i usually play DA 2 or 3 times. And it helps a lot, with the next combos: Thorin with Narvi's Belt and Stewards (and Zigil). Usually Thorin gets 6 resources each round (or more, for example, Hidden Caches with Zigil, or KingUnderMountain...).\n\n \n\nThe epic moment was: 2 players, plenty of orcs, 3 orcs engaged to each one (one of the enemies was a big troll), 3 orcs in staging..., a lot of new orcs were coming... we must make a 'runyoufools' or die forever.\n\nOk, epic moment --> Thorin reaches up to 15 resources (Zigil + Imladris get 2 Hidden Caches, the deck had 10 cards, and Caches were returned by Ered Nimrais). The other friend had Longbeard Mapmaker. You can see the great combo:\n\n1. Desperate Aliance\n\n2. Narvi's Belt getting lore resources\n\n3. Add 15 wp to the quest by Longbeard Mapmaker\n\n \n\nAnd we won sure. ^^ Epic Alliance!\n\nEdited December 10, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1367506","commentId":1367506,"userName":"PsychoRocka","timestamp":1418608061,"content":"Just beat Journey in the Dark two handed without the Balrog appearing.... I thought this was nigh impossible and only doable with Dain and co/Outlands/Gandalf Hero but just did it with my Silvan/Noldor decks!!!\n\nSo insanely happy and proud of myself right now hahahaha :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nSmashed through stage 1 on the third turn, would have cleared it faster except had a bunch of Mines of Mora appear so they soaked up a lot of progress. Also managed to use Power of Orthanc to get Grevious Wound out of play after it got attached to Glorfindel. Got to stage 2 and slayed three enemies right off the bat. Then on the second turn at stage 2 I had a very worrying moment where They Are Coming appeared and I got swarmed, had to feint and feigned voices two attacks defend 2 others and take one undefended. Had a hasty stroke to cancel any additional damage from the undefended attack. Managed to slay two more enemies but came up a point short. On the start of the next turn during planning I played Galadhon Archer and sneak attack Gandalf doing 5 damage to a Mordor Uruks and putting the last resource point on Stage 2 propelling me to stage 3 and reducing the counters on doom doom doom from 5 to 3. Huge push this turn and 5 progress on stage 3. Next turn travel to The Great Bridge, clear it and put another 5 progress on Stage 3, Doom doom doom now has 1 token left on it.....\n\nLast turn I use Gildor's ability to swap a hasty stroke for a test of will and do my last big questing push, cancel a last copy of We Cannot Get Out (that would have killed many heroes and lead to a loss) and quested to victory right before the last token could be removed from doom doom doom!!!!!!!!!!!!\n\nNo Balrog to fight and only two burdens instead of 4, no fallen hero, no need for Fortune or fate!\n\nFIRST GODDAMN ATTEMPT AS WELL WITH MY NEW SILVAN DECK/MODIFICATIONS TO DECK SINCE IM PLAYING A NEW CAMPAIGN! Literally could not have been sweeter!\n\n \n\nThe damage I had on characters in play due to SEVERAL copies of We Cannot Get Out appearing throughout the game as well as a couple of nasty attacks early on that did damage is as following:\n\n \n\nLore/spirit deck:\n\nElrond 3 damage, only 1 hitpoint remaining\n\nHaldir 2 damage, only 1 hitpoint remaining\n\nGlorfindel 4 damage, only 1 hitpoint remaining\n\nArwen 1 damage, only 1 hitpoint remaining\n\nFrodo Baggins 1 damage, only 1 hitpoint remaining\n\nGildor Boon ally before I allowed him to leave play so I could play the Lore ally version, 2 damage, only 1 hitpoint remaining\n\n \n\nTactics/Leadership Deck\n\nCeleborn 3 damage, only 1 hitpoint remaining\n\nElrohir, 4 damage, only 2 hitpoints remaining (elven mail attached)\n\nElladan, 2 damage, only 2 hitpoints remaining\n\n \n\nSo literally a single extra point of damage to most heroes would have resulted in a fallen hero and loss (the plan was to replay the stage till I could advance with only two burdens and no fallen heroes but I thought this would need to include fortune and fate for sure) and a single extra copy of We Cannot Get Out or even not being able to cancel that last one with the test of will I retrieved with Gildor would have also resulted in a loss. I only had ONE copy of Fool of a Took appear throughout the game and another copy would have also sealed my doom. I also had two shadow effects that affected the lore/spirit player even through Elrohir was defending with Sentinel that would have lost the game if the defending player had been the leadership/tactics deck as two defensive attachments would have been removed from Elrohir and he would have died from damage already on him and the damage done by these attacks (mines of moria shadow effect), this removed almost all attachments from the lore/spirit side however which wasn't very pleasant. I also fought both Great Cave Trolls and killed one. I also did not let a SINGLE ally leave play from being destroyed throughout the entire game so did not have Overcome By Grief attach to anyone at any point.\n\n \n\nStill in shock over somehow managing to do this! SO MANY things could have gone wrong or not worked out and my hope was razor thin but several well timed cancellations, tricks and combos got me there!\n\nEpic addition to my personal saga campaign. Horrible Horrible score considering I have no victory point boost from defeating the Balrog, had a million damage on heroes and a final threat of 43 for each player (had to lower it for both players a few times...) but don't care at all considering I managed this and only get two burdens, no fallen hero and no insanely hard to pull off Fortune or Fate combo again.\n\nEdited April 9, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1367625","commentId":1367625,"userName":"GrandSpleen","timestamp":1418616621,"content":"Very nice, I too thought it nigh impossible to get through Journey in the Dark without the Balrog showing up in a multiplayer game.  Glad to hear that it's possible, and with an unexpected deck archetype!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1401904","commentId":1401904,"userName":"Mndela","timestamp":1421019491,"content":"3 players in Road to Rivendel Nmare mode. When we advance to 2b and a lot of enemies engaged with us:\n\nOne player had Erkbrand and he played lighting beacons. Only he defended all 8 orcs (with the nasty shadows of this scenario, canceling by his ability -of Erk-).\n\nNext round same. ^^ Very good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1454577","commentId":1454577,"userName":"Mndela","timestamp":1424305949,"content":"In Old Forest 3 players. A lot of good moments:\n\n1. One player played 3 copies of Campfire Tales, in 2nd round. One next to one..., it's true.\n\n2. One player played 3 copies of Elrond Counsil, one next to one, lol. Just when another player asked if he wanted to decrease his threat by grettings, or each player -2.\n\n3. Last round: one players played 3 copies of Strengh of Arms, with Faramir boosting... raising the wp up to 130 points!!! Insane.\n\n...i past to that player (to increase the Faramir's Boost): Rider (paying one spirit resource), Took (managing threat) and 2 heroes by 2 copies of Desperate Aliance. He also played Ever Vigilant on Faramir, and Atanator Book to return to play... lol 130 wp, true.\n\n \n\nAlso good moments like: Erkenbrand + GilGalad + Fate and Destiny; Defender of the West on Erestor; Taking Initiative killing an enemy with 2 hitpoints left..., well epic game, sure. 157 hcore finally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1500707","commentId":1500707,"userName":"Bullroarer Took","timestamp":1426973843,"content":"I just drew four Blocking Wargs in a row followed by Southron Support. (And this is with the errata!). Just wrecked my board and led to a loss a few turns later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1518236","commentId":1518236,"userName":"Eu8L1ch","timestamp":1427830725,"content":"Last saturday night, playing on OCTGN with Jban and Mndela...\n\nQuest is Antlered Crown, which is renown for the draw-punishing mechanics, as some other quests in that cycle.\n\nWe have one questing deck (Galadriel, Grima, Balin), one doomed support deck (Aragorn (Lore), Frodo, Sam; both Jban's decks) and my Haldir fighting deck (Haldir, Beravor, Pippin).\n\nBoth the doomed support and the Haldir decks rely heavily on card draw so we were a little bit scared since the game before we got both quest attachments during first staging; however this time we get none first round and are able to build up our forces quickly: doomed makes us draw and gain resources, while questing starts churning out allies like never and Haldir kills all the few enemies that pop up. However staging is full of locations so we need to make a swift move and clear them, or we're gonna get overwhelmed by Time effects!\n\nGood for us that both quest and support decks have trackers, but we really need to get them out quickly if we are to have a chance.\n\nRound 2, staging: we get both attachments that damage for draw but we are able to quest pass stage I so they get immediately discarded. We have one tracker in play, but after passing quest locations in staging have +2 quest points. Bad.\n\nEnd of round 2: we really need to speed up pace, Mndela in refresh is about to draw 5 by P&T when the impossible happens: Jban asks him to draw. Mndela at first doesn't understand so Jban shows us his Message from Elrond. For those of you who don't know Mndela, he really really really loves drawing cards (but I suspect we all do :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]), however, with a remarkably selfess act he agrees to giving the P&T away! Jban is then able to trigger Doomed combo, drawing his whole deck, giving us additional +2 resources, +4 cards AND resets our threat!\n\nNext round we get 2 Trackers in play: Jban has another one in hand but no resources to pay for it but we absolutely need the third tracker to clear most of the locations in staging. Guess what? Message of Elrond again! He passes his Tracker to Mndela who plays it immediately (Tracker at the end of the round will be reshuffled in a 3-cards deck, so pretty good chances of drawing him again ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ).so we are able to clear a bunch of locations in the staging, which is now pretty empty sinc e enemies had no chance against Haldir and his forest of attachments.\n\nRound 4: we are able to advance to stage 3 and Boss comes in: I play Feint and we wait for the next round in which we can damage him.\n\nSo, fifth and final round: we clear Raven Chief's Camp, Haldir feints him again then proceeds to one-shotting him with his Black Arrow and the help of a well-armed Silvan Tracker. GG, and final score of 104 (High Score, I believe)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1525153","commentId":1525153,"userName":"Jban","timestamp":1428061383,"content":"It was a lovely game, I can confirm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1525302","commentId":1525302,"userName":"Mndela","timestamp":1428064719,"content":"Yesterday also was epic: Anduin nmare with Faramir hero and Brand... ^^. My wp was up to 7 no more, Jban 1!, and Eu8 13 or around. Brand ready Beravor to draw (or Faramir if we need more attacks), and Idraen (she had a trackerbow).\n\nMy traps were very good, Mischief killing 1 snipper, Advice Warning (boosting Faramir a lot), Infighting, Ithilien Lookout discarded a spwan troll when no were Hill Troll in play, etc... all was played in the best just moment. And Brand had attack up to 7 points (and Erk defended, and no healers!). Very interesting game.\n\nEdited April 3, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1549989","commentId":1549989,"userName":"PsychoRocka","timestamp":1428583019,"content":"So I managed to beat Journey in the Dark before the Balrog appeared again but with my new hero line up. I decided to redo the saga campaign so that I would be ready with Halbarad replacing Celeborn when Treason of Saruman comes out. I've been dreading Journey in the Dark and after several concedes thought I may just have to beat it and leave the Balrog in play and take all four burdens with me. After 5 concedes on stage 2 and 3 concedes after setup (if at any point on stage 2 I knew I did not have enough counters on doom, doom, doom to finish the quest without the Balrog appearing I would concede and start again) I managed to pull it off!!!! I had to use my copy of Ho, Tom Bombadil earned from Fog on the Barrow Downs and remove it from the campaign pool, all three copies of Gandalf were used, first turn Asfaloth  was CRUCIAL (and Darkened Hallway as one of the first locations during setup and instantly exploring it with Asfaloth without another location being revealed from its effect) and two test of wills (one cancelling fool of a took and the other canceling They Are Coming! on the first turn) were all used and it was an epic and ridiculously nerve wracking game. I managed to clear stage 1 on the second turn giving me lots of time to clear stage 2 (this was the fastest I had gotten to stage 2 in all my attempts) and managed to kill the first of the six enemies required to advance immediately.  Within 2 more turns I had killed the Orc Chieftain and two more enemies. I managed to do this by using a sneak attack Gandalf during planning, drawing three cards with the effect and drawing a Dunedain Hunter and immediately playing it drawing an enemy from the encounter deck. Without this and two enemies appearing during one questing phase on the last possible turn left to kill the last two enemies required I would have failed. I got extremely lucky that on the last possible turn two enemies were revealed during staging!!! I killed these two easily and advanced immediately during the combat phase to stage 3 and the amount of counters on doom, doom, doom went down to 3. I easily placed 5 progress the following turn and easily dealt with what was revealed and what the quest stage had revealed the previous turn as I had built up a large force of allies (two Warden of Healings healing every single turn was also extremely crucial, this quest pumps out so much goddamn damage from treacheries, archery etc) and still had a last gandalf to immediately kill a lesser foe and help quest. The following turn I had Fool of a Took revealed.... I was extremely angry and shocked at my luck for a good 20 to 30 seconds before I realised I had Ho, Tom Bombadil in hand and could use it in this crucial moment! The second card revealed? GILDOR! Last turn a Many Pillared Hall and We Cannot Get out were revealed and I could easily place damage across various allies and easily quested to victory with a surplus of 14 or so willpower before the final counter of doom, doom, doom could be revealed and avoided the Balrog by the absolute slimmest margin thanks to plenty of luck, patience and strategy. I had to keep a pen and note book next to me the last few nights whilst attempting this feat to plan out exactly what I needed to do to try and attempt this feat, thank goodness I did as I found it extremely helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1551913","commentId":1551913,"userName":"Ecthelion III","timestamp":1428639142,"content":"I was playing The Weather Hills with my Tactergorn (Tactics Aragorn)-Halbarad-Beregond deck.  I was the first player and Amon Forn was the active location, which makes each Orc enemy revealed from the encounter deck make an additional attack against me.  I was already engaged with an Angmar Marauder and my friend was engaged with a Cornered Orc.  Halbarad had 3 damage on him, Beregond had 2, and my Dunedain Hunter had 2.  All of my heroes were ready, as well as Ally Boromir and a Dunedain Hunter.\n\n \n\nSince I was playing with a friend, 2 cards were revealed from the encounter deck that round.  Naturally, given my luck, 2 Cornered Orcs pop out of the deck.  It was at that point that I realized I would be facing 7 attacks that round, since the Orcs make immediate attacks because of Amon Forn and attack when they engage because of their printed effects.  NOOOOOOOOO!  I wanted to flip the table over!  I really was wishing Aragorn carried a chaingun at that point, whatever thematic wrongs that would entail.\n\n \n\nRolling with it, Ally Boromir defends one of the immediate attacks (taking damage and readying) and my friend's sentinel defender blocks the other.  The two Orcs then come down to engage me.  Against their immediate attacks upon engagement, Halbarad defends one and Boromir defends the other, readying once more although crippled down to 1 HP by a shadow effect.\n\n \n\nFinally, the time actually comes for NORMAL attacks during the combat phase.  Beregond stands firm against the Angmar Marauder.  My only ready characters against the following attacks from Cornered Orcs are Tactergorn and mostly-dead Boromir and Dunedain Hunter.  I take the first attack undefended with a sigh.  The shadow is... Weathered Hilltop!  2 damage goes on Aragorn. \n\n \n\nBut should I take the next attack undefended?  The risk is high, but I decide to take it.  I reluctantly reach toward the shadow card, hesitant to flip it....\n\n \n\nANGMAR CAPTAIN!\n\n \n\nSalvation to mankind!\n\n(Except Aragorn, who's a little worse for wear, but who cares about him anyway?)\n\n \n\nNow it's my turn.  Boromir relentlessly cuts down a Cornered Orc and Aragorn takes the other one, bringing the Orc from my friend's side.  The Dunedain Hunter finishes him with a couple of arrows.  I can almost see the expression on the Angmar Marauder's face (well, actually, I can see it, but anyway...) as he realizes that 7 attacks against fearless Rangers are no excuse for them not to clear the board.  Well, except for him, but his turns are numbered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1562732","commentId":1562732,"userName":"Seastan","timestamp":1428859422,"content":"I was playing Watcher in the Water nightmare with Xelv the other day. We are at the final stage with high-40s threat. We just trashed most of our hands last turn trying to solve the Doors of Durin and failed. We get a very nasty draw from the encounter deck resulting in a failure and +6 threat, killing Xelv, but I am safe after a Council+Greeting bring me down.\n\n \n\nI trash a couple more cards and fail the Doors again, about to give up at this point. Next turn I use King Under the Mountain and find Gandalf , which is great because I've still got 2 sneak attacks in hand (I had been discarding extra Stewards for the Doors attempts). I drop a sneak+Gandalf to lower threat, quest, and then pick Gandalf back up. I decide to discard Gandalf and Sneak for a last Hail Mary attempt at the Doors of Durin, and turn up... a Grasping Tentacle!\n\n \n\nAt this point I've got a Boromir sitting there with two Gondorian Fire's and 14 resources in his pool. Discarding two resources puts him up to 3+25 attack, just enough to take out the Nightmare Watcher's 7+21 health. After that, it's a short quest to victory!\n\n \n\nAlthough I had a lot of fun late in the game, it wouldn't have been possible without Xelv's help through the first 90%. Thanks Xelv!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1562885","commentId":1562885,"userName":"Mndela","timestamp":1428861452,"content":"Epic discard ^^. A wizard never is late"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1601427","commentId":1601427,"userName":"koriakin97","timestamp":1430468750,"content":"I was playing Nightmare Road to Rivendell. On the last stage, 5 progress left. I revealed Orc ambush. There were no enemies in the staging area, so it put back all enemies from the discard pile. There were 14, with combined attack of 50. Fortunately I managed to put this 5 progress tokens. I have never encountered so many enemies even in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1601500","commentId":1601500,"userName":"PsychoRocka","timestamp":1430475983,"content":"> I was playing Nightmare Road to Rivendell. On the last stage, 5 progress left. I revealed Orc ambush. There were no enemies in the staging area, so it put back all enemies from the discard pile. There were 14, with combined attack of 50. Fortunately I managed to put this 5 progress tokens. I have never encountered so many enemies even in multiplayer.\n\nYeah Orc Ambush can be so brutal, I had it trigger once and it returned I think maybe only ten or so enemies but I was not as close to the finish as you so got utterly decimated by one hell of an ambush!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1602969","commentId":1602969,"userName":"PsychoRocka","timestamp":1430570447,"content":"So unlike most it seems I was having A LOT of difficulty beating Helms Deep in the new saga expansion Treason of Saruman but just got an absolutely amazing victory against it!\n\n \n\nFirst off I am not going to stage 1B and shuffling a copy of Poisoned Counsel into each of my decks and am starting at stage 2A immediately which makes the quest far far harder. I lost 5 games in a row before my victory and got utterly slaughtered in 3 of these 5 losses.\n\nWith 7 tokens on Defense of Helms Deep I played the last quest phase before advancing to stage 5 and ended up with EXACTLY 7 progress on stage 4B (1 away from an instant loss) during this round before immediately advancing to stage 5.\nDuring combat on the second last round with 7 enemies in play (6 engaged with my combat deck and one engaged with my questing deck) I not only had to risk an undefended attack from an enemy with 3 attack strength with the questing deck which resulted in no shadow effect and no hero death (a single extra point of damage would have killed Elrond/Haldir and lead to an instant conceding of the game as I need and want to win with all heroes intact) as well as having to use and remove from my campaign pool Vial of Galadriel so I could also take 2 of the attacks made against the combat deck undefended (Elrohir blocked the other four attacks). Won on 47 and 43 threat, had pretty amazing draws and starting hands yet it was still insanely insanely hard, I had MANY locations appear throughout the game which helped slow the tide of enemies at key points allowing me to use leadership resources to get allies out rather than using them to defend multiple attacks with Elrohir. Used two sneak attack Gandalfs and played him three other times for the full cost of 5 often with the help of Aragorn's resources. Could not have been a closer or more nail biting game.... was possibly harder than getting through Moria without facing the Balrog and definitely required the use of Phial of Galadriel. Bit sad I no longer have the Vial but am very happy I don't have to take any copies of Poisoned Counsel with me. Now time to try and beat the third quest without earning Voice of Saruman and earning Palantir of Orthanc at the same time! :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\nEdited May 2, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1862446","commentId":1862446,"userName":"Mndela","timestamp":1445641159,"content":"Really cool game: with eu8l1ch and tonski in octgn...\n\n \n\nKnife in the Dark nmare.\n\n \n\n2 days ago eu8l1ch and me tried this scenario a lot of times, and always we lost. Very hard, always nazguls, and finally 5 nazguls in last quest card.\n\n \n\nToday i have played the rossiel cards, the victory pile effect cards: none-returns, door is closed, leave no trade, out of wild, keen-lances. And... it was very easy! We reached to place 4 nazguls to discard pile (2 of them were ringwrights, however).\n\n2 nazguls by none-returns, and 1 more by out-of-wild, and 1 more by scout ahead.\n\n18 cards in discard pile finally, also nasty locations and treacheries were out by out of wild (recycled by scroll), and played some door is closed to cancel when they were going to enter to the game.\n\n \n\nVery fun way of playing that victory discard mode! Congratulations to designers...\n\n \n\nFinal score: 129 (record guiness)\n\nEdited October 23, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1862681","commentId":1862681,"userName":"TwiceBorn","timestamp":1445661549,"content":"Just started playing the Heirs of Numenor quests for the first time over the last month or so, and this past week has been dedicated to overcoming Siege of Cair Andros straight solo progression style. I heard people complain about the difficulty of Into Ithilien (found it tough, but not quite as hard as anticipated), but I thought Cair Andros was way harder! \n\n \n\nFinally beat it today, though (after MANY attempts), on the 10th round. I lost Beregond in round 9, and a Mumak was revealed by the encounter deck during round 9 staging and engaged, but my survivors quickly raced to victory in round 10... if I didn't achieve victory then and there during battle questing, it would have been game over! What a rush!\n\n \n\nI think Cair Andros is up there with Escape from Dol Guldur in terms of difficulty for straight solo, progression style. Awesome quest, though.\n\n \n\nAnd now, on to play through HoN once again, this time 2-handed (but still progression style). \n\nEdited October 24, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1862791","commentId":1862791,"userName":"DurinVoronwe","timestamp":1445672496,"content":"Do my victory against the Morgul Vale by discarding Boromir to put the last damage to the nasgül count?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1862923","commentId":1862923,"userName":"sappidus","timestamp":1445689361,"content":"> Do my victory against the Morgul Vale by discarding Boromir to put the last damage to the nasgül count?\n\n \n\nAll reasonable uses of Boromir's discard power count. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1863001","commentId":1863001,"userName":"Lecitadin","timestamp":1445695776,"content":"My epic moment was when I found a player card I taught lost, Gondorian Shield."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1864516","commentId":1864516,"userName":"Ryodu","timestamp":1445822518,"content":"My epic moment happened a few weeks ago, two of my good friends and myself played The Ring Goes South. For friend A, this would be the 5th or 6th play session we've had together. We've tried The Ring Goes South before and failed twice. For Friend B this was only his 2nd session and he never got to finish his first due to time constraints.\n\n \n\nWe were going through the quest alright but near the end things started to get rough. A few untimely shadow cards and an unavoidable \"Fallen Into Evil\" left us wounded and down a Hero right around the time the Watcher came out.\n\n \n\nWe eeked out 6 damage on the watcher while the enemies and locations continued to pile up. We had one turn left, with enough enemies in the staging area that we would either die in combat or lose the quest altogether as Doors of Durin had 7 damage already on it. We quested with everything we had, keeping Faramir up as well as Eleanor in case a shadow caused our defeat. If we got through questing we would win. First card came up, no big deal, just a warg. Second card came up and it was the hound, bringing on some surge, which surged into Lust for the Ring. Thankfully we just put it on Beregond, which didn't matter too much. The last card came out and we were fine, questing for roughly 60 to the staging area's 27. We had won after about two hours of trudging our way towards the Misty Mountains.\n\n \n\nIt was one of those now or never moments. It was tense but epic. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1880157","commentId":1880157,"userName":"Mndela","timestamp":1446738479,"content":"It is not epic-moment. It mus be 'hilarious' moment:\n\nPlayind Massing Osgiliath, i keep engaged 2 snagas waiting Ranger of Ithilien as shadow card to get him. At least 1 copy of him. During some rounds, finally the other player resolves to play it:\n\nDawn-Take-You-All.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Return-to-Mirkwood/Dawn-Take-You-All.png]\n\nWhen he and me chose enemy to discard its shadows, both shadows cards were.... agh! Ranger of Ithilien!!! Hilarious!!!\n\nRanger-of-Ithilien.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Massing-at-Osgiliath/Ranger-of-Ithilien.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=1880349","commentId":1880349,"userName":"Bullroarer Took","timestamp":1446744222,"content":"Ouch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2101384","commentId":2101384,"userName":"Mndela","timestamp":1457998993,"content":"Fist time i get 2 boomint ents with 11 attack boost, no more comments ^^:\n\n \n\n1wg9jPH.png [http://i.imgur.com/1wg9jPH.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2174178","commentId":2174178,"userName":"DurinVoronwe","timestamp":1460919686,"content":"I had another epic moment today, when I played a dunedain deck  at 38 threat with my noldor-playing friend at 48 threat against Helms Deep. We were on the last stage, and I had 13 enemies engaged. My one-turn-more-alive cards was used up, except from a Hour of Wrath, so we would not survive another turn. I could use the wrath, but no one of my heroes was strong enough to take down all enemies alone (and I had too few allies to help him). At no hope, I suddenly saw the way to victory. A legacy of Numenor in my hand. It meant my friend sacrificed himself by threat, but the threat from the legacy was enough to push me into valour mode. Then, together, my heroes smashed the 13 enemies into pieces and we won!\n\n \n\nOne of the biggest sacrifices I have seen in this game so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2174232","commentId":2174232,"userName":"Mndela","timestamp":1460923891,"content":"Poor friend ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2174674","commentId":2174674,"userName":"PsychoRocka","timestamp":1460961716,"content":"holy Eru that is one hell of a sacrifice....\n\nWere you playing campaign mode...? If so isn't that three heroes straight on the fallen heroes list if you continue on...?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2174812","commentId":2174812,"userName":"DurinVoronwe","timestamp":1460978987,"content":"> holy Eru that is one hell of a sacrifice....\n> \n> Were you playing campaign mode...? If so isn't that three heroes straight on the fallen heroes list if you continue on...?\n\nYes, it was quite the sacrifice, and felt like I was Feanor at the kin-slaying things in Tol Eressëa when I killed all the elves... Or even more like Ar-Pharazon - Numenor is the end of the elves.\n\n \n\nNo, we weren´t playing Campaign mode. Then we would have taken a loss and try again later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2418514","commentId":2418514,"userName":"PsychoRocka","timestamp":1474100174,"content":"Thread Resurrection!\n\nJust finished one of the most epic games I've ever played. First 100% legit win on Ruins of Belegost as well!\n \n\nI have beaten the quest once before but probably missed a few triggers or made a few mistakes whereas this time I played extremely carefully to make sure I didn't miss anything or do anything incorrectly.\n\nThis was the third attempt at this quest today after two losses.\n\nMy final score (without counting rounds) was 64\n\nCombat deck on 41 threat and Questing deck on 40 threat.\n\n17 victory points and no damage on heroes. I was able to manage healing really well thanks to a good setup fairly early on. It became ridiculous later in the game with x3 Elven light in my discard pile/hand as well as 2 Imladris Caregivers and 2 Silver Harps in play for the questing deck. I also played all 3 copies of Galadrim Healer at key moments to heal as much as possible with each one.\nI had to use every single threat reduction card that was in the quest deck and used Gandalf to drop threat multiple times for the combat deck as well.\n\nI used the following decks with a few new changes not yet made on ringsdb (Faramir instead of Arod and Ranger Summons instead of Descendants of Kings): http://ringsdb.com/fellowship/view/1101 [http://ringsdb.com/fellowship/view/1101]\n\nHere is what my final board state was upon victory:\n\nThe Grey Company Deck:\n\n41 Threat\n\n-Aragorn with Map of Ered Luin attached.\n\n-Legolas with Rivendell Blade, Dagger of Westernesse, Unexpected Courage, Book of Aules Children and Keys of Belegost attached.\n\n-Gimli with Steward of Gondor, Gondorian Shield, Armoured Destrier, Unexpected Courage and x3 Dunedain Warning attached.\n\nThe following allies in play: Halbarad, Faramir, Eldahir, x2 Guardian of Arnor and a Fornost Bowman\n \n\nThe combat deck lost a handful of allies across the course of the game due to enemy attacks and that treachery that makes each player discard an ally. Gimli became an absolute beast of a defender and attacker as well at key moments thanks to two copies of Tides of Fate that were used to boost both his defence and attack (one of which was against Naurlug!).\n\nAragorn had StwB attached but lost it due to me discarding it instead of assigning a whole bunch of damage due to a nasty shadow effect midgame. Faramir soon replaced its effect to a stronger degree however boosting the questing decks characters instead. Sneak attack Gandalf's were used to deal damage and reduce threat as were hard casted Gandalfs.\n\nI had to use two copies of Feint and two copies of Sterner than Steel at critical moments to keep afloat.\n\nHands Upon the bow was used twice to clear out the weak goblin enemies from staging preventing them from making attacks and at one point this actually placed the last 2 progress points necessary to clear a quest stage which also helped escape Naurlug who was in play at the time! The combat deck performed admirably and although it took a while to get all the right pieces in play it eventually allowed me to have an absolute wall of defense as well as plenty of offensive power.\n\nNoldor Discard + Draw Deck:\n40 Threat\n-Arwen with x2 Silver Harp attached.\n\n-Elrond with Cloak of Lorien, Vilya, Unexpected Courage, Light of Valinor, Elven Mail, Gondorian Shield and Burning Brand attached.\n\n-Galdor with Dwarven Torch and Blue Mountain Gem attached.\n\n Guardian of Rivendell (with Cloak of Lorien attached), Gildor Inglorion, Glorfindel, x2 Northern Tracker, x2 Imladris Caregiver, x2 Imaladris Stargazer, Haldir, x2 Galadriel's Handmaiden and a Galadrim Healer.\n\n \n\nThe questing deck also lost a handful of allies due to that nasty treachery. I also discarded a few allies to power Arwen's ability or provide much needed healing. Galdor's ability was used pretty early on to draw a new hand of six cards and after that Elven Light paired with 2 copies of Imladris Stargazer gave me plenty of card draw/deck manipulation. Because I was able to get a second copy of the Stargazer out fairly early to mid game I was then able to manipulate the top of both decks every turn which was insanely beneficial and allowed me to draw cards I actually needed first and build up my board state far more quickly and efficiently. The questing deck actually run out of cards on the third last turn and then used all of its last cards and just continued to recycle Elven Light to heal damage. Elrond with Burning Brand and his various other attachments was an absolutely KEY defender and with sentinel and shadow cancellation he stopped countless shadow effects from resolving. Armoured Destrier helped with this but the Brand was just amazing. On various turns rather than using Elrond to activate Vilya, ready with UC, quest without exhausting with LoV and then defend once I would instead just quest and then defend twice with UC and not use Vilya if this was necessary. Elrond and Gimli were equally as important as far as defence is concerned.\n\nEssentially it was one long hard slog... I had to fight the nasty Lurker of the Depths at Stage 2A but was able to destroy it as fast as it is possible to within three turns (Gandalf bomb did the last 4 damage) and managed to escape Stage 2 right as Naurlug appeared.\nI got stuck in a loop of the Stage 3's and visited each one at least once and some of them multiple times until I was finally able to get to Stage 4. I was able to pretty easily escape Naurlug every time I was on a Stage 3 except for the very first copy of Stage 3 where I had to fight him off for a few turns before I was able to eventually move on. This was because no second Loot objective appeared for several turns and I got stuck unable to advance even with plenty of progress on the current stage! At Stage 4 I was able to clear Naurlugs lair straight away the turn after I arrived there and eventually had every loot objective except for the sword attached to heroes. I fought Naurlug across two more turns doing 17 damage to him the first time I was able to damage him and then a further 15 damage the following turn killing him and putting the total amount of damage on him up to a whopping 32! On the last stage I was able to avoid several nasty shadow effects during his attacks thanks to Armoured Destrier and Burning Brand and thanks to this avoided extra attacks and effects.\n\nIt was such a long grueling game but it was such an epic victory and domination of a quest that normally wipes the floor with me mid to late game. Two Northern Trackers clearing literally 7 or 8 locations in the staging area across two turns was a massively key moment towards the end that let me quest with extreme ease and focus on combat and getting to the finish line. I used test of will a full 5 times (two dwarven tombs) against various treacheries and as mentioned above used two copies of Sterner than Steel as well. Going to be a long time before I play this particular quest again as this was the best result I have ever achieved playing it! That and the fact I haven't played all that many quests with my new three hunters deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2448831","commentId":2448831,"userName":"deepeewastaken","timestamp":1475962954,"content":"-\n\nEdited November 29, 2016 by deepeewastaken"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2448876","commentId":2448876,"userName":"PsychoRocka","timestamp":1475966665,"content":"I hate to do this to you but Steward of Gondor is unique so you can't have more than one in play at once.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=2474539","commentId":2474539,"userName":"Mndela","timestamp":1477432346,"content":"This is the happiness:\n\n \n\nzdQBwkL.jpg [http://i.imgur.com/zdQBwkL.jpg]\n\n \n\nEach player played a copy of it. And the other player had more cards in hand.\n\nPreferring this event than a copy of test-of-will\n\n:D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104011-epic-moments/?do=findComment&comment=3244554","commentId":3244554,"userName":"gpd924","timestamp":1520661281,"content":"> On 11/23/2014 at 5:59 AM, Scroll Lock said:\n> \n> It was not an epic moment, it was more like a biggest plot twist in the history of my LOTR LCG playing.\n> \n> I was trying out my new two cooperative decks (Eowyn, Glorfindel, Sam and Haldir, Beregond) on Road to Rivendell. Everyrthing went ok although there was one sleeping sentry in very bad moment, but I did it to the stage 3. Staging area was clear and I had questing power of 15 (many allies died for sleeping sentry and other nasty treacheries). I ned 7 points for the quest card+ active location. I also had 1 secret paths in my hand. I did not send Arwen for quest cos she had 1 damage.\n> 1st card: sleeping sentry. Ok, good that I did not send her. But 1 ally died and everyone is exhausted. Luckily I am gonna win the game this round so I wont need them...\n> 2nd card: Orc Ambush.\n> \n> Orc-Ambush.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Road-to-Rivendell/Orc-Ambush.png]\n> \n> There were no orc enemies in the staging area so I had to return all orcs in discard pile. I RETURNED 16 ORC ENEMIES TO THE STAGING AREA!!! I was laughing like I was crazy when returning orcs 1 by 1 to the staging area.\n> 3rd card (cos of surge) was some location. Both decks raised threat by 20 or something.\n> \n> They crushed me in the same round. 14 attacks went undefended.\n\nIf I ever saw that happen to me, I would have easily quit the game after WAYYYYY less than 16 orcs were brought back."}]}