{"url":"https://community.fantasyflightgames.com/topic/104143-events-during-planning-phase/","title":"Events during Planning phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104143-events-during-planning-phase/?do=findComment&comment=1052820","commentId":1052820,"userName":"tacomen253","timestamp":1397750396,"content":"So I have been going back and forth on this question. In this exact order, can I...?\n\n1) Play an attachment. (Steward of Gondor [http://hallofbeorn.com/HallOfBeorn_deploy/Cards/Details/Steward-of-Gondor-Core]).\n\n2) Use that attachments action.\n\n3) Play an ally (using the fresh resources from SoG).\n\n \n\nAt first I use to play as though #2 was only legal after I was all done playing allies, attachments. But then when I look at the back of the rules of play on the Turn Sequences there is green at every sequence in the planning phase. Green=Any player can take actions generally... When I am told I can take actions \"generally\" I assume that the order stated at the beginning is correct.\n\n \n\nWould others agree that the order I played is legal? \n\n \n\nI just realized about 14 hours after I posted, that my topic title has pretty much nothing to do with my question lol... oops (I was sorta in a rush)\n\nEdited April 18, 2014 by tacomen253"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104143-events-during-planning-phase/?do=findComment&comment=1052832","commentId":1052832,"userName":"Demoncow","timestamp":1397750951,"content":"You can do all three."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104143-events-during-planning-phase/?do=findComment&comment=1053237","commentId":1053237,"userName":"Catastrophic09","timestamp":1397772380,"content":"I also wonder about this because I thought I heard an argument somewhere saying you could NOT use the fresh resources from Steward of Gondor that very phase to pay for more things but it is in the green zone so it seems you should be able to unless buying attachments and allies is suppose to happen simultaneously so you then don't have the ability to buy more allies or attachments with those fresh SoG resources..\n\n \n\nBut.. I always use Envoy of Pelargir and often use the resource she gives me right away which is similar except you have to exhaust the Steward of Gondor... but simply, I think you can do what you have mentioned above because it's all in the green action window.  Does anyone else want to correct me on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104143-events-during-planning-phase/?do=findComment&comment=1054385","commentId":1054385,"userName":"tacomen253","timestamp":1397865146,"content":"Thanks you two for your responses. For now I will continue playing in the order of my first post, using SoG to generate resources so that I can play other attachments, or allies in the same planning phase."}]}