{"url":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/","title":"Future Fellowship Sphere Heroes??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053214","commentId":1053214,"userName":"Catastrophic09","timestamp":1397771238,"content":"I have no idea how the developers will handle the future Saga boxes concerning the Fellowship Sphere heroes. There's times where the fellowship is broken up in four groups: Pippin and Gandalf in Gondor, Aragorn Legolas and Gimli, Merry with the Rohirrim, and then Sam and Frodo.  Just looking at the first box for the Two Towers won't there have to be a version of Aragorn, Legolas or Gimli in the Fellowship Sphere? It would be annoying to have Aragorn (or any of them) as the Fellowship Sphere hero because you then can't use other versions of him during those quests... or could there be a Three Hunters card representing the Fellowship Sphere instead of an actual hero?\n\n \n\nI'm just really interested in how they will handle all of this after the breaking of the Fellowship.. any ideas or speculations??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053238","commentId":1053238,"userName":"Rapier1","timestamp":1397772473,"content":"A three hunters fellowship sphere card (+ a new version of each of the three hunters) would be pretty nice for that box to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053242","commentId":1053242,"userName":"Rapier1","timestamp":1397772595,"content":"To be honest I really don't like that they're cutting the two towers up into only 2 boxes (I feel like it could easily have been 9 quests). I actually think the lord of the rings sagas should have been 3 expansions per book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053243","commentId":1053243,"userName":"Raven1015","timestamp":1397772729,"content":"Imagine if Gollum was the Fellowship hero of the last expansion.  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]   It'll probably be Frodo, but still...exhaust to bite sounds intriguing.\n\nEdited April 17, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053279","commentId":1053279,"userName":"Catastrophic09","timestamp":1397775055,"content":"> To be honest I really don't like that they're cutting the two towers up into only 2 boxes (I feel like it could easily have been 9 quests). I actually think the lord of the rings sagas should have been 3 expansions per book.\n\nI totally agree, there is a lot to cover and therefore a lot that will be missed. The three quests for that box will likely be Pursuing the orcs who have Merry and Pippin, the battle at Helms Deep and then maybe an ent siege on Isengard!\n\n \n\n> Imagine if Gollum was the Fellowship hero of the last expansion.  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]   It'll probably be Frodo, but still...exhaust to bite sounds intriguing.\n\nI thought that same thing! and would actually like that so we can use whichever Frodo and Sam character we wanted.  He is their guide and should be present with their quests in the coming Saga boxes so maybe he could be the Fellowship Sphere hero instead of Frodo and then we wouldn't still need the objective Gollum card.  But if the Fellowship Sphere stays true to it's name could Gollum really be part of it? and what about the Ring and the Ring-bearer trait??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053315","commentId":1053315,"userName":"Rapier1","timestamp":1397778487,"content":"I'm expecting to see at least one saga expansion that needs to release multiple fellowship heroes because of how they've chosen to split the books up.\n\n \n\n(I do hold out a slim hope that we might get additional expansions later designed to fill in the \"missed\" quests and extend the campaign)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053477","commentId":1053477,"userName":"7theye","timestamp":1397794371,"content":"You guys are pinheads. Each book will be 2 boxes. It's been confirmed in the campaign mode description. It's a total of 18 quests - ie 6 boxes of 3 quests.\n\nDon't you guys reach the book that comes with the black riders?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053525","commentId":1053525,"userName":"entMoot","timestamp":1397798211,"content":"> You guys are pinheads. Each book will be 2 boxes. It's been confirmed in the campaign mode description. It's a total of 18 quests - ie 6 boxes of 3 quests.\n> \n> Don't you guys reach the book that comes with the black riders?\n\nI don't think anyone was arguing that there wouldn't be 2 boxes for each novel, just that they wish there would be more than 2 so that the quests could be more detail-oriented. Personally I am content with the model they've chosen, since the trilogy is split into 6 different books.\n\n \n\nAs for future fellowship heroes, I don't know if I like the Fellowship sphere idea after The Road Darkens (at least for the non-Frodo quests). As mentioned, there is no longer a fellowship after this point in the story! Maybe they could have Gandalf the White as the Fellowship hero if they feel compelled to include it? I personally hope that they print a new Aragorn, Gimli, and Legolas hero trio akin to Merry, Pippin, and Sam Gamgee in the Black Riders expansion, so I'd rather not have one of them be in the Fellowship sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053663","commentId":1053663,"userName":"Rapier1","timestamp":1397816555,"content":"> You guys are pinheads. Each book will be 2 boxes. It's been confirmed in the campaign mode description. It's a total of 18 quests - ie 6 boxes of 3 quests.\n> \n> Don't you guys reach the book that comes with the black riders?\n\n \n\nI did read that... hence my expression of dislike for their choice? Do you not read posts before commenting on them?\n\nAlso because they've confirmed that does not mean they won't (after releasing all of it) not eventually decide to release additional quests to fill out some of the parts of the saga that are being skirted over. Which is what I'm hoping they do now because of their choice of not having the saga expansions be long enough (in my mind) to cover all the quests that it could have been.\n\nAnother possibility would be POD expansions to fill in the gaps... I just don't understand why they've chosen to lock themselves out of some of the source material content that they could have had. (For example missing out the barrow downs and tom bombadil's forest, and missing out the elf king's halls in the hobbit expansions). \n\n \n\nAs for the fellowship sphere - I don't really like it.  We'll see how it works when Frodo isn't around, it does (like the baggin's sphere) create the opportunity to make interesting quest design so that may justify it's existence even if it's a bit awkward. Alternatively it may be replaced by a different (the similar mechanic) when the fellowship is broken.\n\nOne thing we may see is multiple fellowship sphere heroes (this will become necessary if they want to pick the most iconic quests) So for instance, we might get Pippin and Merry (so that we can do both of their important quests).\n\nEdited April 18, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053683","commentId":1053683,"userName":"MyNeighbourTrololo","timestamp":1397819174,"content":"I hope to see Boromir and Aragorn as Ring Bearers. (I would say Gollum too, but I hope to see Gollum as regular hero, as I stated multiple times previously)\n\nEdited April 18, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053881","commentId":1053881,"userName":"Rapier1","timestamp":1397834878,"content":"Another thing I would like is for them to make it possible for us to deviate more from the books, (for instance)\n\nIf we get a fellowship hero in every box (6 total) but then the rules allow us to use any fellowship hero for any quest (and give them each different powers) - then we could play a lot more \"what if?\" and still have the ability to play with the correct ring bearers if we wished.\n\nI'm not sure how likely this is though. (Again maybe it's a future POD expansion)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053923","commentId":1053923,"userName":"MyNeighbourTrololo","timestamp":1397838091,"content":"Well, if they will release alternative ring-bearer, nothing would prohibit us from starting campaign over from shadow of the past with new ring-bearer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053978","commentId":1053978,"userName":"Bullroarer Took","timestamp":1397840679,"content":"I did not think we would see Gollum as a hero, but then we got Grima and so I'm not going to guess about that anymore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1053994","commentId":1053994,"userName":"Rapier1","timestamp":1397841287,"content":"> I did not think we would see Gollum as a hero, but then we got Grima and so I'm not going to guess about that anymore.\n\n \n\nIf they wanted to give us Gollum as a hero it would probably need to be in the ring bearer sphere. (Or else he would be a hero that can't work in a lot of quests that already have unique Gollum cards in them; which I think is 4)\n\nOn the other hand he would (like Grima) be a really neat fit for the doomed mechanic and if we ever get a standard card bilbo's ring it would be nice to have him as an alternative target for those rings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1054034","commentId":1054034,"userName":"MyNeighbourTrololo","timestamp":1397843560,"content":"4 is not that much. Faramir is forbidden in many quests too, yet he exists in both hero and ally incarnations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1056878","commentId":1056878,"userName":"Catastrophic09","timestamp":1398111750,"content":"I'm also not the biggest fan of the Fellowship Sphere.  The Baggins sphere in the Hobbit boxes seemed good because it gave a unique feel to the quests and I was fine not being able to play that version of Biblo outside of the Hobbit boxes.  But now we have this Fellowship Sphere which can't only be one hero throughout these Saga's because the Fellowship gets broken and I really don't want some of my favorite characters (Aragorn or Gimli) in this Fellowship Sphere because we are then restricted and can't play other versions of them in that quest.  So I'm expecting some disappointment in these future Sagas because I don't know how they can pull off making the Fellowship sphere work well amid the broken fellowship.\n\n \n\nAs for alternate ring-bearers, I too would like a chance to have an alternate world and chance to play things out differently. That \"what if\" aspect is exciting and would give amazing replay value for these Sagas.  To do this they should have a Fellowship Sphere attachment that gives the title \"Ring-bearer\" so the Ring can then be attached to a different hero.  Then they can forget needing an actual hero in the Fellowship sphere as this attachment would replace that.  But of course Helms Deep and such has no connection to the Ring-bearer so I hope those quests play normal and awesome and aren't ruined with one of our favorite heroes getting stuck in this Fellowship sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057277","commentId":1057277,"userName":"Glaurung","timestamp":1398132377,"content":"to be honest I dont like at all those saga expansions.... but ok I play it.. I really like apack formats since they are unlimited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057361","commentId":1057361,"userName":"7theye","timestamp":1398136997,"content":"> to be honest I dont like at all those saga expansions.... but ok I play it.. I really like apack formats since they are unlimited.\n\nTotally agree. Also all these limits on caress that can only be used in the saga alone and keeping track of burdens and boons and being forced to use the same hereos each quest is too limiting for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057455","commentId":1057455,"userName":"MyNeighbourTrololo","timestamp":1398144407,"content":">  \n> \n> > to be honest I dont like at all those saga expansions.... but ok I play it.. I really like apack formats since they are unlimited.\n> \n> Totally agree. Also all these limits on caress that can only be used in the saga alone and keeping track of burdens and boons and being forced to use the same hereos each quest is too limiting for me.\n> \n>  \n\nDid you knew that you could play quests from saga boxes outside of campaign mode?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057503","commentId":1057503,"userName":"HeavyKaragh","timestamp":1398151063,"content":"> Another possibility would be POD expansions to fill in the gaps... I just don't understand why they've chosen to lock themselves out of some of the source material content that they could have had. (For example missing out the barrow downs and tom bombadil's forest, and missing out the elf king's halls in the hobbit expansions). \n\n \n\nThey have already done this with the Battle of Lake-Town. Probably they'll do it again. Anyway, this has already been discussed: they could make 18 scenarios per book, but they have to limit themselves for the sake of game's wealth. Otherwise we'd be reaching mount doom on 2020. Or worse, we may never reach it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057558","commentId":1057558,"userName":"Rapier1","timestamp":1398161487,"content":">  \n> \n> > Another possibility would be POD expansions to fill in the gaps... I just don't understand why they've chosen to lock themselves out of some of the source material content that they could have had. (For example missing out the barrow downs and tom bombadil's forest, and missing out the elf king's halls in the hobbit expansions). \n> \n>  \n> \n> They have already done this with the Battle of Lake-Town. Probably they'll do it again. Anyway, this has already been discussed: they could make 18 scenarios per book, but they have to limit themselves for the sake of game's wealth. Otherwise we'd be reaching mount doom on 2020. Or worse, we may never reach it.\n> \n>  \n\n \n\nAh but, they could design the quests so that we get to mount doom early (it's a cool quest obviously) but with the intention of back filling later - which is what I'm getting at.\n\nAlso if Battle of Lake-town was a saga POD it would work with the saga rules (use of treasures ect.) Instead I think it's a different iteration of that thematic event. However I would like to see POD expansions that build on the sagas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104169-future-fellowship-sphere-heroes/?do=findComment&comment=1057609","commentId":1057609,"userName":"ZanzibarLand","timestamp":1398169318,"content":"I don't think they'll keep the fellowship sphere passed the end of the Fellowship of the Ring, for obvious reasons. They might give up on the campaign sphere altogether or add something else. Who knows.\n\n2 boxes for Baggins, 2 boxes for Fellowship. It isn't a huge point, but it's sort of a point.\n\nI really don't think people should be so worried, especially about things we won't see for a few years maybe. We all love the game and there's very few things that we see wrong with it. Lets just wait and see, and be positive."}]}