{"url":"https://community.fantasyflightgames.com/topic/104475-despair-shadow-effect/","title":"Despair shadow effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104475-despair-shadow-effect/?do=findComment&comment=1056608","commentId":1056608,"userName":"Dwarf king Bronze beard","timestamp":1398097827,"content":"So i played journey along anduin guest and hill troll attacked to gimli and it was delat by wolf rider and wolf rider was dealt that despair shadow card (defending charecter doesnt count its defense) so my guestion is: Does that despair effect still remains during that hill troll´s attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104475-despair-shadow-effect/?do=findComment&comment=1056609","commentId":1056609,"userName":"Dwarf king Bronze beard","timestamp":1398097853,"content":"I hope not..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104475-despair-shadow-effect/?do=findComment&comment=1056674","commentId":1056674,"userName":"GrandSpleen","timestamp":1398101606,"content":"You know, I guess I've never thought much about this before, but it seems to me that shadow effects are only active for that individual attack, unless otherwise stated on the card.  If an enemy attacks twice due to a card effect, you discard all shadow cards before the new attack.  In this situation I would read it that the defending character's defense is only modified until the attack is fully resolved.  The Wolf Rider attacks during shadow effect resolution for the Hill Troll, but after the attack is resolved I'd think the shadow text is no longer affecting Gimli.  You would then proceed to finish the Hill Troll's attack as per usual.  Not super confident about this answer, however.\n\n \n\nIn your situation though, I don't think Gimli would be allowed to defend against both attacks.  Gimli is exhausted after you declare him the defender of the Hill Troll's attack.  Then when the Wolf Rider comes out, you have to declare a new defender -- no action window to ready Gimli, even if you have Unexpected Courage or some other readying effect, so far as I can tell.  However, if you readied Gimli immediately after declaring him as a defender against the Hill Troll's attack (and before flipping over the Hill Troll's shadow card), then he would be eligible to defend against the Wolf Rider's subsequent attack as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104475-despair-shadow-effect/?do=findComment&comment=1058123","commentId":1058123,"userName":"Dwarf king Bronze beard","timestamp":1398192126,"content":"Well i am pretty shure that is rigth answer, thanks :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}