{"url":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/","title":"Saruman´s ability","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057531","commentId":1057531,"userName":"Nerdmeister","timestamp":1398155858,"content":"med_saruman-voi.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_saruman-voi.jpg]\n\n \n\nPlayed Hunt for Gollum nightmare the other day and I called on this bad boy to help us out. I decided to remove a Hunter from Mordor, who had a clue card attached (there were 3 clue cards in play at this point so the hunters were really annoying). During staging, another Hunter from Mordor gets revealed and we got to discussing wether or not the clue card attached to the first Hunter from Mordor is also considered to be out-of-play?\n\n \n\nWe both leaned towards that when you remove a card from play (or consider it to be out-of-play) then the same goes for any attachments on those cards. Much like when a card leaves play from natural causes (gets explored or killed) it also affects all the attachments on that card. So that is how we played it.\n\n \n\nThe wording though: the chosen enemy or location is considered to be out of play, kinda bothers me. It seems to suggest that it might only be the chosen card and not it´s attachments.\n\nSo even though we did get to the consensus that attachments are also out-of-play it still has been nagging at the back of my mind.\n\nAnyone have some thoughts on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057555","commentId":1057555,"userName":"Glaurung","timestamp":1398161047,"content":"from the first view attachments will be removed with a card what he attach.....but there is can be some other solutions... if hero remove from the game all attachments in him is discarded. so Clues should back to the staging area..... good question... we need a Caleb answer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057650","commentId":1057650,"userName":"leptokurt","timestamp":1398172861,"content":"Well, if the guard of the clue card is out of play, it isn't guarded anymore. In your case the Hunter was attached to the clue card and not the other way around. So IMO the clue card looses it's attachment is is stiill in play and free available. However, what is going to happen once the Hunter returns? Is he going to return as an attachment or not? (My guess is that he won't)\n\n \n\nOtherwise I tend to agree with Glaurung. If the clue card was attached to the Hunter, it should also go back to the staging area.\n\nEdited April 22, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057793","commentId":1057793,"userName":"Mndela","timestamp":1398180588,"content":"And attachments of Nazguls, in Black Riders? Do they discard?\n\n \n\nPale-Blade.jpg [http://hallofbeorn.com/Images/Cards/The-Black-Riders/Pale-Blade.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057853","commentId":1057853,"userName":"GrandSpleen","timestamp":1398182558,"content":"You know, I think a guarded objective will just have to become unattached in this scenario.  Look at the manual text:\n\n\"An encounter card\n\nattached to a guarded objective is dealt with in the\nfollowing method, depending on its card type:\nEnemy: The enemy leaves play, either by being\ndefeated or as the result of a card effect.\nLocation: The location leaves play, either by being\nfully explored or as the result of a card effect.\"\n \nThe enemy (or location) has  \"left play\" as \"the result of a card effect.\"  ...right?\n \nFor the Nazgul attachments, I guess they get discarded?  I think official clarification would be nice here...\nEdited April 22, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104523-saruman%C2%B4s-ability/?do=findComment&comment=1057927","commentId":1057927,"userName":"Noccus","timestamp":1398185542,"content":"Think you got it right grandspleen.\n\nWith your rule book quote there's no need for a official ruling imo.\n\nThe clue is a objective card, and the other is a treachery.\n\nThat's the difference.\n\nCrystal clear I say."}]}