{"url":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/","title":"A crazy theory???","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060739","commentId":1060739,"userName":"Ozil23","timestamp":1398358420,"content":"Ok so last night, I got thinking about this. I saw a photo from cotr where they were using a ton of glorfindels in one quest.  Over the course of this game we have received a lot of heroes(51 heroes). There have been multiple versions of some heroes, Bilbo and Frodo have 3-2 versions but these versions are used mainly in saga boxes or expansions. But there are also 3 other heroes which have a multiple version. We are talking about Boromir, Aragorn and Glorfindel. I know most of you know a lot about lotr, silmarillion and the hobbit, but for those who does not, there have been 2 persones of each one. \n\nBoromir: The first one was the steward of gondor prior to any lotr event, he conquered osgiliath and was feared by the witch king. The second one would be the one we all know so no explanation.\n\nGlorfindel (I am of the group that thinks that there is only one Glorfindel but still) the first one was the super glorfindel that killed a balrog in the silmarillion, the second helped frodo get to rivendell in the fords of isen.\n\nAragorn: The first was the fifth chieftain of the dunedain, and the second one was the last of isildur, elessar, etc.\n\n \n\nSo what if each version is one character and not the same\n\nBoromir tactics: Boromir from the fotr\n\nBoromir leadership: Steward of gondor\n\nSpirit Glorfindel: The first glorfindel\n\nLore Glorfindel: The second glorfindel\n\nLore Aragorn: Elessar\n\nLeadership Aragorn: The first aragorn\n\n \n\nI think my theory is irrelevant and they are meant to be the same guy, but i thought i might post it in here to see what you guys think???\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060747","commentId":1060747,"userName":"mr.thomasschmidt","timestamp":1398358683,"content":"Wow. That's pretty deep! Never thought about it like that. Nice mind work there :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060769","commentId":1060769,"userName":"MyNeighbourTrololo","timestamp":1398359387,"content":"A crazy theory indeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060774","commentId":1060774,"userName":"leptokurt","timestamp":1398359562,"content":"I'm also two people!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060777","commentId":1060777,"userName":"leptokurt","timestamp":1398359582,"content":"Wait, I'm not..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060783","commentId":1060783,"userName":"CJMatos","timestamp":1398359817,"content":"As to Aragorn, don't think so.\n\n \n\nAs we have Aragorn II (Ellessar) in both situations, the Lore one (strider) is clearly the Aragorn we meet in Bree and the Leadership is the one we have on the Return of the King, speaking as to the books' history...\n\n \n\n \n\nAs for Boromir, despite the Steward [http://lotr.wikia.com/wiki/Boromir_(Steward)] one does great deeds, both of Boromir's were a great leaders for the Gondor people... So the Boromir son of Denethor can be both cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1060804","commentId":1060804,"userName":"-nebur-","timestamp":1398360595,"content":"Nice theory which you found out there...never noticed before.\n\nBut there is another hero with 2 versions:\n\n \n\nPippin\n\n \n\nhm...wait, I remember that Sam named one of his sons Pippin...\n\n---> theory approved :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1061017","commentId":1061017,"userName":"Gizlivadi","timestamp":1398369831,"content":"Interesting theory, but I really doubt it since core Aragorn is clearly carrying the sword that was broken before the reforging in fotr, and the other one is obviously strider."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1061339","commentId":1061339,"userName":"ZanzibarLand","timestamp":1398398051,"content":"Just going with the theory for something to do, who else could pop up as a double?\n\nDain is one of the Durin reincarnation-y guys, right? Is Gimli one of the Durins?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1061527","commentId":1061527,"userName":"shoreless","timestamp":1398424265,"content":"It's pretty clear that each character is the one from LOTR (or The Hobbit), but it would make for a fun variant to have these 'blasts from the pasts' come and travel through Middle-earth. Master of Lore should be on this one..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1061537","commentId":1061537,"userName":"MyNeighbourTrololo","timestamp":1398425345,"content":"Don't forget about the duplicates of heroes in ally form."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1062695","commentId":1062695,"userName":"Kerstoid","timestamp":1398484628,"content":"> It's pretty clear that each character is the one from LOTR (or The Hobbit), but it would make for a fun variant to have these 'blasts from the pasts' come and travel through Middle-earth. Master of Lore should be on this one...\n\nYou shouldn't tempt me!\n\n \n\nHere's all you might want to know and more: https://masteroflore.wordpress.com/2014/04/26/special-feature-the-others/ [https://masteroflore.wordpress.com/2014/04/26/special-feature-the-others/]\n\n \n\nThanks for the awesome idea Ozil23!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1062817","commentId":1062817,"userName":"leptokurt","timestamp":1398499970,"content":"Seriously, none of the above mentioned has been two persons. You don't hit a button when you get a new sword and crown and then you're someone else. You don't change your person just because you travel to Rivendell (if you don't meet a horde of Nazguls on your way and get a scratch by a poisoned weapon, that is). If anything, these cards represent different aspects of a person. Aragorn is clearly be to meant the Dunedain ranger that we met in LOTR. The lore one being Aragorn from the beginning until their arrival in Rohan, the leadership one being the Aragorn that went public and fought the forces of Mordor as a battle commander."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1063628","commentId":1063628,"userName":"asfaloth","timestamp":1398589843,"content":"Glorfindel from Silmarillion and Glorfindel during Lord of the rings are the same person as Tolkien said."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1063810","commentId":1063810,"userName":"Gizlivadi","timestamp":1398612766,"content":"> the leadership one being the Aragorn that went public and fought the forces of Mordor as a battle commander.\n\n \n\nWhy do people keep saying this? Narsil was reforged in the Fellowship of the ring, long before he went public, and the art depicts the broken sword, not the reforged one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1063887","commentId":1063887,"userName":"leptokurt","timestamp":1398619257,"content":">  \n> \n> > the leadership one being the Aragorn that went public and fought the forces of Mordor as a battle commander.\n> \n>  \n> \n> Why do people keep saying this? Narsil was reforged in the Fellowship of the ring, long before he went public, and the art depicts the broken sword, not the reforged one.\n> \n>  \n\nAnd the Hobbits never left the shire prior to LOTR, but still they fought many a battle in this game. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Btw, the art of a card doesn't define the time in which the character was acting. It is just an example of many possible ways to portray a character.\n\n \n\nThe spheres and character stats are not about historical accuracy, but about the different sides of persona. And no one can seriously deny that Aragorn stepped up to his leadeship role only after Gandalf fell in Moria."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1063907","commentId":1063907,"userName":"Gizlivadi","timestamp":1398621001,"content":"So if I see a Gandalf ally with a white robe in the art it doesnt mean it's supposed to be Gandalf the White? I'm sure that it's not the case for every hero, but there are many in which the art shows from which \"when\" the character is as a card as well. The two Boromirs for example are very clear as to which facet is which, and I'm sure they'll be forced to make either a new hero or ally card for him in the new saga expansion which is the same facet as the tactics one (I'm hoping a tactics ally). \n\n \n\n \n\n>  And no one can seriously deny that Aragorn stepped up to his leadeship role only after Gandalf fell in Moria.\n> \n>  \n\n \n\nI deny it. While he became the new leader of the fellowship after Gandalf fell, he had been a leader of men and a great warrior long before he joined the fellowship. He had been Chieftain of the Dúnedain and had fought alongside Theoden and Ecthelion and undertook long journeys, even though he wasn't yet trying to reclain the throne. Don't forget we have some heavy Dúnedain flavor in leadership, and that's why I believe Core Aragorn is supposed to represent that, the ranger yet noble facet of him, which fits perfectly in the timeframe of the Core Set. \n\nEdited April 27, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1064351","commentId":1064351,"userName":"leptokurt","timestamp":1398666140,"content":"Well, perhaps we have a different view of what we call leadership. To me leadership is something that you do 24/7, and not only when you're actions are needed. Additionally you have to accept that role yourself. I think Aragorn didn't lead himself, but the others simply followed him (because they exactly knew what he stood for and yeah, because he was that awesome). He inspires people to follow him because of his actions, but not because he actively steps up as their leader.\n\n \n\nOh, and the fact that someone who has royal blood running through his veins spends his working time scouting the forests could easily interpreted an attempt to avoid the burden of leadership, which is kinda Aragorn's main problem in LOTR.\n\n \n\n \n\nAs for the pics,  if you're right I ask you which facet of Frodo is represented by his pic, and which by his ability? :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1064623","commentId":1064623,"userName":"Gizlivadi","timestamp":1398693963,"content":">  \n> \n>  \n> \n> As for the pics,  if you're right I ask you which facet of Frodo is represented by his pic, and which by his ability? :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]\n\n \n\nCatC Frodo? Both represent him during the years prior to setting out on the quest, I believe. He has the ring, but he still hasn't gone out to destroy it.\n\n \n\nAnyway, ideological discussions aside, it would be nice if we could get some answer as to which facet of Aragorn is represented by his Leadership version, though I still firmly believe that it's supposed to be a \"generic\" version of Aragorn, before the Lotr and the reforging. Don't forget that even though the original timeline of this game has probably been forgotten for the most part, the Core set at least is subject to it, and thus I think it couldn't be Aragorn as captain of Gondor in the RotK the one represented in his Core version. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104704-a-crazy-theory/?do=findComment&comment=1064704","commentId":1064704,"userName":"leptokurt","timestamp":1398697155,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > As for the pics,  if you're right I ask you which facet of Frodo is represented by his pic, and which by his ability? :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]\n> \n>  \n> \n> CatC Frodo? Both represent him during the years prior to setting out on the quest, I believe. He has the ring, but he still hasn't gone out to destroy it.\n> \n>  \n> \n> Anyway, ideological discussions aside, it would be nice if we could get some answer as to which facet of Aragorn is represented by his Leadership version, though I still firmly believe that it's supposed to be a \"generic\" version of Aragorn, before the Lotr and the reforging. Don't forget that even though the original timeline of this game has probably been forgotten for the most part, the Core set at least is subject to it, and thus I think it couldn't be Aragorn as captain of Gondor in the RotK the one represented in his Core version. \n> \n>  \n\nThat might be the case. The question is if they already thought about adding multiple versions of a character at the beginning of the game (probably yes) and how to deal with these different versions (probably not so much). Let's not forget that in the core set they had to put three heroes into each sphere, so they were not as free to select a special sphere for a hero than in the adventure packs. Perhaps Aragorn hot that icon just because the other spheres didn't fit or were already used by other heroes. So a generic version seem like something plausible. You're probably also right about the timeline issue.\n\nEdited April 28, 2014 by leptokurt"}]}