{"url":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/","title":"Is there a &quot;rogue like&quot; hero?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064412","commentId":1064412,"userName":"BioDio","timestamp":1398674347,"content":"Hey there!\n\n \n\nHave this game since it's release, played a lot at the time with a friend, and completed the Mirkwood cicle.\n\n \n\nI got back recently, and was wondering, is there a rogue like hero in any of the adventure packs? I really like \"rogue\" / \"assassin\" characters (preference female).\n\n \n\nAlso, can someone explain what's the difference from those big expansions, like Khazam-Dum, from the smaller adventure packs?\n\n \n\nAlso, can someone give me a good website with the full card list? Can't seem to find one.\n\n \n\nThanks =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064425","commentId":1064425,"userName":"Rapier1","timestamp":1398675729,"content":"hallofbeorn or cardgamedb both have card lists (just search for either of those in google and you'll be able to find them).\n\nThere isn't really a rouge/assassin hero in Lord of the Rings - the source material just doesn't support that kind of shady anti-hero. The heroes are basically beacons of light against the encroaching shadow that taints all men.\n\nSome of the hobbits might play a bit like a rogue though (avoiding enemies) or some of the rangers (setting traps). The best way to start with  the hobbits is to buy black-riders. The rangers and traps are spread out all over the place so I would recommend you use the card list sites to work out what you'd want to start with.\n\nThe small adventure packs contain one new adventure, one new hero, and nine new player cards (3 copies of each, 2 from each sphere and one neutral sphere). They're meant to be played in order (1 - 6 in a given cycle) although this is mainly for fluff rather than any game reason.\n\nThe larger packs contain three adventures. two new heroes and \"more\" player cards (I think the three big box expansions have different numbers of player cards but all of them contain more than nine new ones). The big box expansions are needed to run the adventures in the little expansions that come after them. Khazard Dum > Dwarrowdelf. Heirs of Numeneor > Against the Shadow. Voice of Isenguard > Ringmaker.  \n\nThis is because the big box expansions contain extra cards that they don't use but which get used during the later cycle they're associated with. Mirkwood only requires the core set (the core set also contains cards it doesn't use that are needed in mirkwood).\n\nFinally the saga expansions: These contain a lot more heroes (4 or 5) some new player cards, and all the cards you need for three adventures. The saga expansions are designed to be played in order (Hobbit 1 then Hobbit 2) and the second saga wouldn't really work as well without owning the first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064432","commentId":1064432,"userName":"BioDio","timestamp":1398676335,"content":"@Rapier\n\n \n\nWow, thanks for the reply =)\n\nReally helpful! For now, I'm re-playing the core set and mirkwood in solo. After I finish everything, I'm thinking in starting a new expansion. I don't wan't anything too hard, and one that has a nice experience to it (one that is a cool adventure with cool mechanics), so, what do you recommend? (mind you that, once I get one of those big expansions, I'm gonna buy the small scenarios of that expnasion).\n\n \n\nHmmm, I remembered that, I have the \"Massing at Osgiliath\" too... Those print-on-demand scenarios only need the core game right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064447","commentId":1064447,"userName":"MyNeighbourTrololo","timestamp":1398678292,"content":"Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064448","commentId":1064448,"userName":"lleimmoen","timestamp":1398678315,"content":"I am not really into fantasy outside of Tolkien, so I might have a bit of wrong idea of the term (in terms of the genre) but I would guess Dúnhere plays like that with the staging area attack. Rohan may be supporting this as Forth Éorlingas allow any Rohan heroes to attack into the staging area. Then there are cards like Westfold Outrider (again Rohan), Knight of Minas Tirith (mono-Tactics only) or Son of Arnor who help you deal with enemies without them attacking you first. And then there are rangers..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064455","commentId":1064455,"userName":"MyNeighbourTrololo","timestamp":1398678756,"content":"Well, yes, technically, Dunhere is most assassiniest assassin money can buy in this game, but this dude already had core set, so I suppose he knows about him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064458","commentId":1064458,"userName":"BioDio","timestamp":1398678963,"content":"> Faramir.\n\n \n\nJust searched, awesome I really liked the card!\n\nIt has that assassination feel, but, it's kinda weird because, as an assassin you should kill a lonely character stealthy, like, instead of - get +1 attack for each enemy - it should be - get -1 attack for each enemy (but Faramir base attack should be like.. 5 or something) - that would feel more assasin like.\n\n \n\nAnyway, it's something like this yeah... some burst damage. I also like the other stats.\n\nThis is a cool card =)\n\nEdited April 28, 2014 by BioDio"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064460","commentId":1064460,"userName":"Rapier1","timestamp":1398679027,"content":"The print on demand scenarios are split in to two types;\n\n \n\nOsgiliath, Lake town and Stone are very hard (for the time they came out at least) scenarios that don't require anything except the core.\n\n \n\nThe nightmare scenarios require you to already own the associated scenario (so to play Nightmare Hunt for Gollum you need the nightmare pack and the original pack).\n\nRing-maker isn't complete so I can't tell you how good that would be. However if you wanted to jump into it, it supports Rohan and probably Isenguard, it has a few cool new mechanics like doom being in player decks (as a cost on some player cards).\n\nKhazhad Dun and Dwarrowdelf have some okay mechanics but more staple than intersting, a nice difficulty and some really strong heroes. Lots of dwarf support.\n\nHeirs of Numenur and Against the Shadow has some amazing mechanics but is also very difficult, mainly supporting gondor/rohan and mono-colour decks.\n\nI think Against the shadow is really really good, but if you find the game hard I would go for the other one first. \n\nEdited April 28, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064467","commentId":1064467,"userName":"BioDio","timestamp":1398680032,"content":"> Heirs of Numenur and Against the Shadow has some amazing mechanics but is also very difficult, mainly supporting gondor/rohan and mono-colour decks.\n> \n> I think Against the shadow is really really good, but if you find the game hard I would go for the other one first. \n\n \n\nFor solo play with only the core set + mirkwood cicle + the Heirs of Numenur, you think it's hard to come up with a good deck? I probably won't play this game with another player for quite some time, so, it'll be solo for me.\n\n \n\nCan you give me an example of a cool mechanic in that set? =)\n\n \n\n(just to be sure, in order to play Against the Shadow, I need the Heirs of Numenur, right?)\n\nEdited April 28, 2014 by BioDio"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064479","commentId":1064479,"userName":"MyNeighbourTrololo","timestamp":1398681193,"content":">  \n> \n> > Faramir.\n> \n>  \n> \n> Just searched, awesome I really liked the card!\n> \n> It has that assassination feel, but, it's kinda weird because, as an assassin you should kill a lonely character stealthy, like, instead of - get +1 attack for each enemy - it should be - get -1 attack for each enemy (but Faramir base attack should be like.. 5 or something) - that would feel more assasin like.\n> \n>  \n> \n> Anyway, it's something like this yeah... some burst damage. I also like the other stats.\n> \n> This is a cool card =)\n> \n>  \n\nThe point of assassins in this game is being able to kill something before it can engage you. Which is rangers are all about. Faramir gets bonus attack for  each enemy in the staging area, i.e. not engaged with you. So, the more enemies are not yet engaged - the stronger Faramir is. \n\n \n\nFor assassin-like heroes, also check Bard the Bowman and, probably, well-equpped, hobbit-surrounded Merry.\n\nEdited April 28, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064495","commentId":1064495,"userName":"Rapier1","timestamp":1398683963,"content":">  \n> \n> > Heirs of Numenur and Against the Shadow has some amazing mechanics but is also very difficult, mainly supporting gondor/rohan and mono-colour decks.\n> > \n> > I think Against the shadow is really really good, but if you find the game hard I would go for the other one first. \n> \n>  \n> \n> For solo play with only the core set + mirkwood cicle + the Heirs of Numenur, you think it's hard to come up with a good deck? I probably won't play this game with another player for quite some time, so, it'll be solo for me.\n> \n>  \n> \n> Can you give me an example of a cool mechanic in that set? =)\n> \n>  \n> \n> (just to be sure, in order to play Against the Shadow, I need the Heirs of Numenur, right?)\n> \n>  \n\n \n\nBeing able to quest with defence instead of willpower on some of the quests. Having locations that take damage and you lose the quest if the locations take too much damage.\n\nOn the other hand I think you may find it quite hard to build solo decks that can beat Numenuor and Against the shadow (which is correct btw, you need Heirs to play against the shadow).\n\nSomeone that plays more solo would probably be able to give you better ideas with the chances you'd have to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064501","commentId":1064501,"userName":"BioDio","timestamp":1398684553,"content":"Thanks for all of your insight, it was helpfull to make me up to date with this game.\n\n \n\nAfter I beat Mirkwood cicle again, and get the hang of the game and deck building again (since.... ... the deck I made up yesterday in some minutes, lost 2x vs the 1st quest of the core set... lol... I feel embarassed).\n\n \n\nI stopped playing those massive nerdy games, but, I love this card game, it's awesome that you can solo. I always wished a game like this. I feel that solo is like a puzzle, and you need to find the correct pieces to be able to win, without the need to someone to save you =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064508","commentId":1064508,"userName":"lleimmoen","timestamp":1398684775,"content":"And it is easy to play alone with two decks. Really takes little away whilst adding the experience of 2-player game which is often quite different from the real \"solo\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064514","commentId":1064514,"userName":"BioDio","timestamp":1398685182,"content":"> And it is easy to play alone with two decks. Really takes little away whilst adding the experience of 2-player game which is often quite different from the real \"solo\".\n\n \n\nSorry didn't understood what you said =x\n\nYou recommend me to play with 2 decks, like, as if I was playing for the 2 players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064560","commentId":1064560,"userName":"Mndela","timestamp":1398689493,"content":"Rogue trait sounds and makes more sense as enemy card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1064568","commentId":1064568,"userName":"lleimmoen","timestamp":1398689946,"content":">  \n> \n> > And it is easy to play alone with two decks. Really takes little away whilst adding the experience of 2-player game which is often quite different from the real \"solo\".\n> \n>  \n> \n> Sorry didn't understood what you said =x\n> \n> You recommend me to play with 2 decks, like, as if I was playing for the 2 players?\n> \n>  \n\nYeah, sorry, I was a bit vague. I saw you praised the game for being able to play it alone, so I just suggested (had you not tried it before) that it may also be a good experience to play it with 2 decks -- just as if there were another player, in case you do not have other players in your area... The real coop is better, of course, but this alternative is not too bad either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1065891","commentId":1065891,"userName":"shoreless","timestamp":1398769649,"content":"Yeah, Secrecy is really the only 'stealthy' deck type. There aren't equivalents to the Rogue/Assassin in terms of theme but you can definitely a configure a deck to play kind of like a Rogue RPG character.\n\n \n\nUnseen Strike, Quick Strike, or the staging area attack options like the gentlemen above suggested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104961-is-there-a-rogue-like-hero/?do=findComment&comment=1065919","commentId":1065919,"userName":"BioDio","timestamp":1398772119,"content":"> Yeah, Secrecy is really the only 'stealthy' deck type. There aren't equivalents to the Rogue/Assassin in terms of theme but you can definitely a configure a deck to play kind of like a Rogue RPG character.\n> \n>  \n> \n> Unseen Strike, Quick Strike, or the staging area attack options like the gentlemen above suggested.\n\n \n\nI've been looking over all the cards that exist, and yeah, I was thinking something like that would be possible.\n\nStill, for solo play, that might be too extreme =p and besides, I'm not gonna buy all the expansions on one go, but, I decided to follow the releases (except for the saga, for now), that means, once I play lots of games again on Mirkwood cicle, I'll buy Kazum dum (or whatever it's called).\n\nIn the meantime I might get a play group, and if so, I'll try something like that, it seems really cool ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"}]}