{"url":"https://community.fantasyflightgames.com/topic/104965-how-ironic/","title":"How ironic...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064487","commentId":1064487,"userName":"MyNeighbourTrololo","timestamp":1398682420,"content":"...that best scrying card in the game, in my opinion, is Longbeard Elder. Yes, a leadership ally. With all tha fuss around lore. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064496","commentId":1064496,"userName":"Rapier1","timestamp":1398684191,"content":"Not sure I agree - he gets scry 1 after committing to the quest, but he basically gets -1 willpower if he does this. Also the action windows are bit tight here, can you even prevent the next card from coming after committing characters to the quest?\n\nYou certainly don't get the flexibility of being able to scry shadow effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064505","commentId":1064505,"userName":"MyNeighbourTrololo","timestamp":1398684660,"content":"The point is, Longbeard Elder is cheap, toough, non-unique leadership dwarf(!) quester. If you're playing solo - as soon as you get one out, you'll always know whats coming (save for surges), by just committing him to the quest, i.e. doing what's he is supposed to do and also getting little extra if scryed card happens to be a location.\n\n \n\nBut now that you brought up timing, I'm a bit confused. I was playing it as \"exhaust him, look at the top card of the ecnounter deck, then decide who I need to commit next\"... But now I'm starting to remember that something about character commitment step being one whole thing, meaning that Longbeard Elder's ability might be triggered after all characters have finished committing?.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064521","commentId":1064521,"userName":"alogos","timestamp":1398685756,"content":"Yes, in solo.\n\nIn multi, player that play after him can commit accordingly (but you only scry 1...)\n\nIf he is controlled by last player, it does nothing. That's why the \"taking the first player token\" spoiled card might be usefull."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064526","commentId":1064526,"userName":"MyNeighbourTrololo","timestamp":1398686194,"content":"I wanted to define him as best solo scrying card, but then I remembered that most other scrying effects are 1 card too, and those which are  not  are very optional."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064542","commentId":1064542,"userName":"Mndela","timestamp":1398688218,"content":"The rule is like Thréodred. Commiting characthers are simultany, at the same moment, and just after, the responses are triggered, so the scrying Longbeard effect only is good for next players.\n\n \n\nFor me Longbeard is good when you have scryed the encounter deck and you know the next top encounter cards is a location. Or to use another scrying bonus (to know is next top card has high threat cost and use the event lore secrecy card, for example). Or if the next player needs to know probability of nasty shadows (like damage exhausted character) of encounter deck in the preparation phase.\n\nEdited April 28, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064570","commentId":1064570,"userName":"Nerdmeister","timestamp":1398690211,"content":"med_henamarth-riversong-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_henamarth-riversong-core.jpg]\n\nIs cheaper and can be triggered pretty much when you feel like it. Granted he is unique but if you put 3 of him in you can use the one on the table for chump blocking and just ad a new one next round or as an easy discard for a multitude of other cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064637","commentId":1064637,"userName":"booored","timestamp":1398694442,"content":"Longbeard is NOT a scry'n card.\n\nIt reveals the card as it commits to the quest, so sure you see the card, but it is to late to do anything. There is only reaction windows until the last card is revealed from the encounter deck.\n\nYou do not pick cards to commit one after each other. You pick them and they all commit at the exact same time. The commit is a single time window, regardless of who you \"tap\" to commit first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064644","commentId":1064644,"userName":"MyNeighbourTrololo","timestamp":1398694686,"content":"He can't quest while at it, he will die first thing in the morning if something happens to damage him, he brings no bonus with his ability. And there is only 1 copy of him in the core set.\n\nEdited April 28, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1064647","commentId":1064647,"userName":"alogos","timestamp":1398694709,"content":"@Bored. each players commit separatly, and resolved their commiting response before the next commit anyone.\n\n \n\nMoreover, you can still play cards after commiting everyone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065301","commentId":1065301,"userName":"booored","timestamp":1398717654,"content":"no you can't"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065354","commentId":1065354,"userName":"Rapier1","timestamp":1398720352,"content":"> @Bored. each players commit separatly, and resolved their commiting response before the next commit anyone.\n> \n>  \n> \n> Moreover, you can still play cards after commiting everyone.\n\n \n\nPlayer two can play actions after player one has committed to the quest. Player one can only use triggered reactions (like the scry effect from longbeard) at this point.\n\nI would argue it's not scry at all in solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065367","commentId":1065367,"userName":"Raven1015","timestamp":1398720963,"content":"Players have to commit characters in turn order. However, as per the rulebook, they can take actions generally and in any order.\n\n \n\nrules.jpg [http://talesfromthecards.files.wordpress.com/2014/04/rules.jpg]\n\n \n\nrules2.jpg [http://talesfromthecards.files.wordpress.com/2014/04/rules2.jpg]\n\n \n\nNote that this means in solo play, you could commit all your characters, scry with Longbeard, then play something like Expecting Mischief. However, this scrying can't help you decide who to commit in the first place or what to play during planning, so it's limited scrying.\n\nEdited April 28, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065764","commentId":1065764,"userName":"Nerdmeister","timestamp":1398751037,"content":"> He can't quest while at it, he will die first thing in the morning if something happens to damage him, he brings no bonus with his ability. And there is only 1 copy of him in the core set.\n\nHe is cheaper and can be triggered pretty much when you feel like it. A good trade-off when compared to a 3-cost ally who will still only quest for 1 most of the time if your primary job for him is to scry anyway.\n\nIf you´re worried about loosing him to damage, just use his ability at the end of the round, so he doesn´t fall victim to encounter cards that punish exhausted characters (will also let you throw him in as a last-minute cheap defender if things heat up). It´s really not that much of bother.\n\nAs for only 1 in the core set, just proxy him. The argument about limited cards in the core set, while a valid point in it´s own right, is a whole other discussion. Many people, myself included, have voiced their opinion that FFG ought to sell completion packs for their LCGs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065805","commentId":1065805,"userName":"Glaurung","timestamp":1398757618,"content":"> no you can't\n\nyou can play action before and after commit charachters to the quest before staging.\n\naction window\n\ncommit characters\n\naction window\n\nstaging"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065824","commentId":1065824,"userName":"alogos","timestamp":1398760482,"content":"> no you can't\n\n \n\nyes you can\n\n \n\nnow what ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065867","commentId":1065867,"userName":"Rapier1","timestamp":1398767314,"content":"I'd much rather have unlimited scrying frankly - I think longbeard elder on his own is a terrible card without Dain he's pretty poor imo.\n\nEdited April 29, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065911","commentId":1065911,"userName":"MyNeighbourTrololo","timestamp":1398771503,"content":"Map-maker? Yes, he is bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065932","commentId":1065932,"userName":"Rapier1","timestamp":1398773284,"content":"> Map-maker? Yes, he is bad.\n\n \n\nI fixed that to elder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065936","commentId":1065936,"userName":"MyNeighbourTrololo","timestamp":1398773607,"content":">  \n> \n> > Map-maker? Yes, he is bad.\n> \n>  \n> \n> I fixed that to elder.\n> \n>  \n\nToo late, there is no turning back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1065972","commentId":1065972,"userName":"Rapier1","timestamp":1398776183,"content":">  \n> \n> >  \n> > \n> > > Map-maker? Yes, he is bad.\n> > \n> >  \n> > \n> > I fixed that to elder.\n> > \n> >  \n> \n> Too late, there is no turning back.\n> \n>  \n\n \n\nHaha, what I mean is, I meant elder :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] not that I didn't make the mistake because I did (and didn't catch it till you pointed it out).\n\nI think the Elder is okay because he's a dwarf more than because of his abilities. His ability is generally poor but sometimes good - combined with other scry effects (say denethor) guaranteeing that you know whether to trigger the ability or not its really good - on it's own I'm not sure it's going to beat out other scry effects.\n\nOf course Denethor is a hero so his ability costs a lot more to the player - then again you basically take him for the ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1066895","commentId":1066895,"userName":"booored","timestamp":1398828808,"content":"you are all reading that graphic wrong.\n\nThere is a action window during the commitment step, it is all green. So you can tap more toons or play events or w/e as you tap \"to commit\" BUT all the characters AS ONE commit at the end of that phase and IMMEDIATELY the reveal occurs. There is no order, of tapping 1 and then the other.\n\nThink of it as selecting the cards to quest. You select 3 cards. Then they all go questing together at the same instant. Then the reveal happens during the staging step.\n\nYou can futz with your selection.. select more, choose to unselect them, tap action speed attachments, play events etc etc.. but when your done and everything is selected and finalized... you then \"commit them\" to the quest.. they all go off questing together as one. The act of \"committing\" them ends the phase, your now in the staging step and there is no action window until the end of the staging.\n\nIt works thematically as well. Like if you and I were going on a quest would you leave early? Or would we leave together. We sit at the pub and decide who is going, and then as a single group we go out to quest.\n\nEdited April 30, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1066922","commentId":1066922,"userName":"GrandSpleen","timestamp":1398831659,"content":"\"Players have the opportunity to take\n\nactions and play event cards at the end of each step.\" (page 14, core set manual)\n \nImmediately after that, \"Step 1\" is given as \"Commit characters\" and Step 2 is given as \"Staging\" (still page 14).  There is an action window after committing characters, and before staging.\n \nAnd further, because committing characters takes place during a \"green\" window in the graphic at the end of the manual, \"any player may take actions generally, or between the game steps stated in the rules.\"  So player 2 can take actions after player 1 (who just might control a Longbeard Elder) has committed characters to the quest, and before player 2 himself commits characters.  \nEdited April 30, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1066931","commentId":1066931,"userName":"GrandSpleen","timestamp":1398832052,"content":">  \n> \n> I would argue it's not scry at all in solo play.\n> \n>  \n\n \n\nIt's still scry, just really weak scry :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Imagine you have a Westfold Outrider in play.  If the next card coming out is a treachery that says \"raise your threat by 1 for each enemy in the staging area,\" it might behoove you to trigger the Outrider's effect and snag an enemy in the staging area.  Maybe that enemy was going to engage you anyway, and saving one point of threat allows you to engage only 1 enemy, instead of 2 or 3 who were lurking in the staging area.  Thanks Longbeard Elder!\n\n \n\nIt could happen!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1066969","commentId":1066969,"userName":"leptokurt","timestamp":1398837354,"content":"I sent a question to Caleb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067009","commentId":1067009,"userName":"ZanzibarLand","timestamp":1398843269,"content":"Always best to check with the Big Boss."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067023","commentId":1067023,"userName":"Mndela","timestamp":1398844628,"content":">  \n> \n> >  \n> > \n> > I would argue it's not scry at all in solo play.\n> > \n> >  \n> \n>  \n> \n> It's still scry, just really weak scry :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Imagine you have a Westfold Outrider in play.  If the next card coming out is a treachery that says \"raise your threat by 1 for each enemy in the staging area,\" it might behoove you to trigger the Outrider's effect and snag an enemy in the staging area.  Maybe that enemy was going to engage you anyway, and saving one point of threat allows you to engage only 1 enemy, instead of 2 or 3 who were lurking in the staging area.  Thanks Longbeard Elder!\n> \n>  \n> \n> It could happen!\n> \n>  \n\n \n\nOr this:\n\n \n\nRode-Like-a-Gale.jpg [http://hallofbeorn.com/Images/Cards/The-Black-Riders/Rode-Like-a-Gale.jpg]\n\n \n\nYou use westfold to engage a nazgul and it doesnt gain surge ^^. It is like playing Counsil Gildor, but only with 2 resources (the cost of westfold-rider)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067043","commentId":1067043,"userName":"alogos","timestamp":1398846337,"content":"> I sent a question to Caleb.\n\n \n\nAll I see is Booored being counter argued with quote from the rulebook. \n\nAlso, I had the other part already :\n\n \n\n\n\n> Page 14 of the rule book says “Players commit characters to the quest as a team, starting with the first player, and then proceeding clockwise around the table.” That means that players commit their characters to the quest one at a time in turn order. Player 1 must resolve committing characters to the quest before player 2 has the opportunity to commit his characters. If player 1 wants to use Aragorn’s Response effect, then it must be activated immediately after he commits to the quest. This will be resolved before player 2 has had the option to commit characters to the quest.\n\n \n\nWith this, it answer our question entirely.\n\nEdited April 30, 2014 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067483","commentId":1067483,"userName":"leptokurt","timestamp":1398878189,"content":"Here is the official answer which is quite clear:\n\n \n\n> Hi Jörg,\n> Good to hear from you again.\n> Players commit characters to the quest during a green action window. That means it is possible to take actions both before and after committing characters to the quest. For example, I can play Sneak Attack to put Gandalf into play and trigger his Response effect before committing characters to the quest. That will allow me to commit Gandalf to the quest as well.\n> Furthermore, after I have committed characters to the quest, I can still take actions before proceeding to the staging step. For example, I can play Elrond’s Counsel to increase my willpower by 1 and lower my threat by 3 before any “when revealed” effects might raise my threat.\n> With regard to the Longbeard Elder’s ability specifically: because his Response triggers after committing him to the quest, you can look at the top card of the encounter deck and there is still an opportunity for you to take an action afterwards. So, you could see that the top card of the deck is an enemy and decide to play the event Expecting Mischief in order to deal 2 damage to that enemy when it is revealed during the staging step.\n> I haven’t actually tried that combo yet, but now that it’s been mentioned I think I will!\n> Cheers,\n> Caleb\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067578","commentId":1067578,"userName":"MyNeighbourTrololo","timestamp":1398882750,"content":"Blood Caleb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067842","commentId":1067842,"userName":"Raven1015","timestamp":1398892349,"content":"He even used my same Longbeard Elder/Expecting Mischief example.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1067890","commentId":1067890,"userName":"leptokurt","timestamp":1398894601,"content":"> He even used my same Longbeard Elder/Expecting Mischief example.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYeah, that was great. I didn't even mention that combo, but he immediatly came up with it. Great minds think alike, it appears.\n\n \n\nAnd I have to say that Caleb is really a friendly and nice guy. I asked him how they can handle all these rules and that I'm glad that even the designers can learns something new about the game. His response:\n\n \n\n> We keep pretty busy, but we’re also happiest that way. It’s always great to get questions & comments from our players because that’s a great indicator of the game’s vitality. \n> Another fun part of working on the game is when players discover combos that we haven’t thought of, like the Longbeard Elder & Expecting Mischief. I can’t believe I haven’t done that yet. I even have both of those cards in the same deck! I just don’t think I’ve ever had the option to play both at the same time.\n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1068013","commentId":1068013,"userName":"Khamul The Easterling","timestamp":1398901692,"content":"> Map-maker? Yes, he is bad.\n\nLongbeard Map-Maker is amazing!!  I made a secrecy Bifur, Theodred deck with Map-Maker as the key card and he quested for around 7-10 each round.  By using Bifur's ability, steward of gondor, and a couple copies of resourceful, and other random resource acceleration effects, Bifur was able to pay for plenty of will power using Map-Makers ability.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1068265","commentId":1068265,"userName":"MyNeighbourTrololo","timestamp":1398921097,"content":"Let's face it: 1 resource per 1 willpower for one phase if a poor ratio and in most situations is not worth it, and without it characters stats are poor and are better replaced with someone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1068328","commentId":1068328,"userName":"leptokurt","timestamp":1398929560,"content":"> Let's face it: 1 resource per 1 willpower for one phase if a poor ratio and in most situations is not worth it, and without it characters stats are poor and are better replaced with someone else.\n\nHe's not excellent, but he is certainly not a bad card.* As in most cases, it depends on the deck you're playing. And the scenario. Mapmaker shines when you have to rush through a quest (Return to Mirkwood). He also guarantees that you just make enough progress so that you don't get to the next quest card (Conflict at the Carrock). He's helpful when you want built a deck with low WP and more ATT, and in times when your hand is empty or full of crap.\n\n \n\nHis stats aren't too bad, but it's true that with ever cool lore card that we get he gets less and less useful.\n\n \n\n \n\n* you really should learn that there is a large range of variety of adjectives to describe the worthiness of a card; try not use the most extreme scalings as a start for your reasoning, because you're obviously not (yet) able to step down from these extreme one sided opinions; there is a reason why people like to argue with you --> you're one-sided opinion is an easy target ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1068341","commentId":1068341,"userName":"booored","timestamp":1398930884,"content":"from Celeb\n\n \n\nCommitting characters to the quest occurs during a green action window, so players may take actions both before and after committing characters to the quest. Players commit their characters to the quest as a group, starting with the first player. So, if I am the first player, I commit all the characters I want to quest at once, then trigger any Response effects such as the Longbeard Elder’s. Then the next player commits all of his characters to the quest. After all players have committed characters to the quest they still have the opportunity to take actions before proceeding to the staging step. For example, if I saw a treachery card that would raise my threat level to 50 with the Longbeard Elder, I could play Elrond’s Council to lower my threat by 3 before the staging step in order to prevent myself from being eliminated when that treachery is revealed.\nOne thing I cannot do after committing characters to the quest is decide to remove any number of those characters or commit additional characters. That can only be done through special abilities such as Late Adventurer. So, if Longbeard Elder showed me a very high threat strength location on top of the encounter deck, I could not decide at that point to commit more characters to the quest in order to add their willpower. However, in a multiplayer game where I was the first player, I could use that knowledge to advise my teammates to commit more willpower to the quest.\n \nIn solo play, you can still take actions before and after committing characters to the quest before advancing to the staging step.\n\n\n \n\n> \"Players have the opportunity to take\n> \n> actions and play event cards at the end of each step.\" (page 14, core set manual)\n\n \n\nSo Spleen pretty much nailed it.\n \nOh well, yet another rule that breaks theme and makes the game easier.. I'll keep playing it my way, as it is better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/104965-how-ironic/?do=findComment&comment=1068377","commentId":1068377,"userName":"MyNeighbourTrololo","timestamp":1398935153,"content":">  \n> \n> Oh well, yet another rule that breaks theme and makes the game easier.. I'll keep playing it my way, as it is better.\n> \n>  \n\n \n\nLoled extremely hard  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"}]}