{"url":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/","title":"Rider of the Mark timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069133","commentId":1069133,"userName":"MyNeighbourTrololo","timestamp":1398975622,"content":"med_rider-of-the-mark-rtr.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_rider-of-the-mark-rtr.jpg]\n\n \n\nAs far as I remember, there is several action windows during the enemy attack resolving, one of which is between flipping'n'resolving shadow card and dealing damage from attack.\n\n \n\nSo, lets assume, the revealed shadow card is +3 attack, if we spend this 1 resource and give Rider of the Mark to the player being attacked and discard already flipped and resolved card - will +3 attack bonus vanish?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069204","commentId":1069204,"userName":"Rapier1","timestamp":1398978558,"content":"There's an action window between resolve shadow cards and determine combat damage. \n\nPersonally I would say that you can indeed use rider of the mark to discard a shadow card (thereby removing it's effect) after it's been revealed and before the combat damage. You do however have to have already decided to commit a defender or not if you wait for this stage.\n\nP.s. this should probably have been in the rules forum not the general forum.\n\n \n\n \n\nEdit: To clarify that my person take on this (that shadow cards that add combat damage should be different from other shadow cards) is not supported by the developers. Which is a shame.\n\nEdited May 4, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069230","commentId":1069230,"userName":"MyNeighbourTrololo","timestamp":1398979661,"content":"Well, that's was kinda the window I was talking about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069251","commentId":1069251,"userName":"leptokurt","timestamp":1398980222,"content":"Of course you can do this. Isn't that the whole sense of that card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069258","commentId":1069258,"userName":"Rapier1","timestamp":1398980387,"content":"> Well, that's was kinda the window I was talking about.\n\n \n\nWhy respond like this? If you already know about the window why ask the question?\n\nOr did you want to hear the slightly less intuitive alternative interpretation, which is that the shadow card has already been resolved and the +3 attack remains even if it's now discarded?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069320","commentId":1069320,"userName":"danpoage","timestamp":1398983211,"content":"Trolls, trolls, trolls,\n\nEverywhere I go, I see trolls.\nTrolls on the highway,\n\nTrolls at the cafe,\n\nTrolls under the bridge,\n\nTrolls raid my fridge.\n\nI would gladly share honey, not hoard;\n\nNow they even want to troll the message boards.\n\n \n\nTrolls of extraordinary size,\n\nSecret trolls, you don't even realize.\n\nHappy go lucky bear, they say.\n\nAll I want to do is play.\n\nEvery time I think the coast is clear,\n\nSome new troll appears.\n\nAsking questions, with answers known,\n\nThe trolls even invade my hall, and home.\n\n \n\nTrolly trolly trolly, down in the valley\n\nPlease go to Cirith Ungol,\n\nI hear it's nice this time of year.  \n\nEdited May 1, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069336","commentId":1069336,"userName":"MyNeighbourTrololo","timestamp":1398983677,"content":">  \n> \n> > Well, that's was kinda the window I was talking about.\n> \n>  \n> \n> Why respond like this? If you already know about the window why ask the question?\n> \n> Or did you want to hear the slightly less intuitive alternative interpretation, which is that the shadow card has already been resolved and the +3 attack remains even if it's now discarded?\n> \n>  \n\nI asked not about the window, but about if shadow card effect will stick if it was resolved but physical card got discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069337","commentId":1069337,"userName":"Mndela","timestamp":1398983684,"content":"From this post (trolling themes away :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])i have thought an idea that i hadn't never got!\n\n \n\nYes, you can keep your rider after reveal shadow card, and if you see that the shadow is bad atm, you can cancel passing him. Ok, i always did his effect after dealing the shadow card but before it was revealed.\n\n \n\nNice idea, but anyway, you must know the encounter cards, you must know if there are immediate shadow card bad effects or only they add power attack to the enemy.\n\n \n\n....\n\n \n\nIf no shadow cards, no shadow effecs then. It is like another attack by same enemy, the first shadow card must be discarded and his effect, then, is out. Then new shadow card is the card that matters now.\n\nEdited May 1, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069338","commentId":1069338,"userName":"MyNeighbourTrololo","timestamp":1398983717,"content":"> Of course you can do this. Isn't that the whole sense of that card?\n\n \n\nYou could gamble, discarding not yet resolved shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069355","commentId":1069355,"userName":"Mndela","timestamp":1398984263,"content":"In adittion, this is the reason for the card Dawn Take You All reads: discard 1 facedown shadow cards...\n\n \n\nM1265.png [http://hallofbeorn.com/Images/Cards/M1265.png]\n\n \n\nIf you can discard shadow cards revealed..., it would be very very powerful. You can wait until you need!\n\n \n\nSo if this text is added it is because players could 'remove' out the shadow effects discarding the shadow cards.\n\n \n\nConclusion: rider can discard shadow cards even if they are revealed, and the shadow effect is out then.\n\n \n\nPD: but if shadow effect was immediate, no window for play actions, no window for play rider for cancelling. too late. Only Hasty Stroke, Dunedain Watcher or Balin as a response could do something.\n\n \n\n \n\nThe last reason is pretty clear: a card discarded, out of game, doesnt count his text.\n\nEdited May 1, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069368","commentId":1069368,"userName":"MyNeighbourTrololo","timestamp":1398984636,"content":"I wonder why they separated his ability into two parts? It could have been easily put into just one action. Is there anything else in the game that could make him change controlling player?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069404","commentId":1069404,"userName":"Mndela","timestamp":1398986265,"content":"Sure, a lot.\n\n \n\nSometimes, one player needs an extra character in combat phase. Or to gain the +1 wp bonus of SwordBroken or Faramir, HailStones....\n\nThe hability i would say is change controler (like Emery), and in adittion can discard a shadow card.\n\n \n\nIn Lonely Mountain is very cool ^^\n\nEdited May 1, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069414","commentId":1069414,"userName":"MyNeighbourTrololo","timestamp":1398986658,"content":"I mean, effects that could force Rider of the Mark change controller, aside from his action."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069415","commentId":1069415,"userName":"Rapier1","timestamp":1398986743,"content":"> I wonder why they separated his ability into two parts? It could have been easily put into just one action. Is there anything else in the game that could make him change controlling player?\n\n \n\nIt's to make it optional on the discard. So you could transfer the extra character and then choose not to trigger the response which you might do if you for instance had an enemy that had a negative effect if it has no shadow card, or didn't have a card with a shadow effect this round - wargs often have this design.\n\nIf it was all in the action step I guess they could have written \" may\" but then the response word already has may by the default rules so it's probably for consistency reasons.\n\n \n\nEdit: Another possibility is that they want to keep the possibility of future design - an enemy that negates responses for instance would be able to prevent the discard but not the transfer of control.\n\nEdited May 1, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069541","commentId":1069541,"userName":"kainveus","timestamp":1398995600,"content":"I think those shadow effects triggered when its revealed. for example, +3 atk, this effect wouldn't be canceled even if you discard the shadow card,because if the shadow card is no effect, then Khazad!Khazad! should never have any effect because its in your discard pile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069542","commentId":1069542,"userName":"kainveus","timestamp":1398995657,"content":"shadow card are not attachments, its like event card played by enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069751","commentId":1069751,"userName":"ricedwlit","timestamp":1399011560,"content":"Dug this up from a BGG [http://boardgamegeek.com/article/11116560#11116560] posting regarding timing for this very card: (TL;DR: While RIder of the Mark can remove a shadow card after it's revealed, removing the card doesn't cancel any effect such as bonus to attack).\n\nRe: Shadow effect of Chieftain of the Pit vs Ride of the Mark (shadow effect timing)\n\n \n\nAn official response is in!\n\nCaleb wrote:\nIf a shadow card is discarded by card effect, then the players do not resolve its shadow effect.\nHowever, there is no action window for Rider of the Mark to be used after a shadow card is revealed during combat. Step 3 of Resolving Enemy Attacks (when shadow cards are revealed) must be completely resolved before the players can take actions.\nTo take advantage of the Rider of the Mark's ability, you need to trigger it before a shadow card is revealed.\nCheers,\nCaleb\n\nSo it seems my interpretation of events was correct. After the effect happens (such as +\n\npic1055044.png [http://cf.geekdo-images.com/images/pic1055044.png] [http://boardgamegeek.com/image/1055044]\n\n), the effect does not depend on the shadow card's continued existence but rather naturally times out.\n \n\nellareth wrote:\nWait, I am confused about this part.\n\nEvent cards are discarded after their effect has been resolved, so I have always discarded Blade Mastery at the end of phase when the boost was over.\n\nHave I been playing wrongly this entire time? Do you discard event cards such as Blade Mastery, Sneak Attack, Feint, Thicket of Sphere right after you play them without waiting for their effect to be fully over (i.e. wait till end of phase)?\n\nSimilarly, the effect of an event card is not dependent on the card being \"in play\". Rather the card immediately goes to the discard pile. You could certainly leave the card on the table to help you remember the effect, but it isn't necessary. \n\nEdit. Here's what I posed to FFG:\n\nfyrian wrote:\nIf a shadow card is discarded (using Rider of the Mark's ability for example) after it is revealed but before its effect influences the game, does the Shadow effect still occur?\n\nFor example, suppose an attacking enemy is dealt Dol Guldur orcs as a shadow card. Then after the shadow card is revealed but before the attacker deals combat damage, Rider of the Mark is used to discard the shadow card. Does the attacker still get the +Attack bonus from Dol Guldur orcs?\n\nIf the attacker does get the +Attack bonus in the previous example, are there any shadow effects (to your immediate knowledge) that could be canceled by Rider of the Mark after the shadow card is revealed? (The original question specifically was if Chieftain of the Pit's shadow ability could be canceled.)\n\nI think, \"To take advantage of the Rider of the Mark's ability, you need to trigger it before a shadow card is revealed,\" is pretty clear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069780","commentId":1069780,"userName":"MyNeighbourTrololo","timestamp":1399015416,"content":"So, gambling it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069843","commentId":1069843,"userName":"Mndela","timestamp":1399024956,"content":"Thanks ricedwlit, i was wrong. Now, it is cleared."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069876","commentId":1069876,"userName":"Rapier1","timestamp":1399027666,"content":"This is less interesting sadly. Although it is more consistent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069878","commentId":1069878,"userName":"kyrie","timestamp":1399027878,"content":"If Rider of the Mark was a response and it said cancelled the effect, then you could use it. But that is not the case (See Balin, Hasty Stroke)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069880","commentId":1069880,"userName":"Rapier1","timestamp":1399028158,"content":"> If Rider of the Mark was a response and it said cancelled the effect, then you could use it. But that is not the case (See Balin, Hasty Stroke).\n\n \n\nWell true. Even when I was writing the reply I didn't think it would work on (say) raise your threat by X where x is the number of goblins engaged with you.\n\nI do think it would be a bit more interesting in the +attack or ignore defence cards could be discarded. But it's more consistent this way.\n\n \n\n \n\nEdit: I've never actually used Rider of the Mark at at all - do people rate it as  good card?\n\nEdited May 2, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069896","commentId":1069896,"userName":"MyNeighbourTrololo","timestamp":1399030152,"content":"I would use him when I'll get my hands on him. He'll make a good foundation for secure undefended attacks.\n\n \n\nHe quests decently, he's not going to die as soon as necromancer's reach shows up, and his ability does not requires him to be ready. He's like comes with implanted one-time hasty stroke of sorts. That's in multiplayer of course. No need to use him in solo.\n\nEdited May 2, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1069899","commentId":1069899,"userName":"Mndela","timestamp":1399030570,"content":"Yes, good ally. I have included him in some decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070024","commentId":1070024,"userName":"kyrie","timestamp":1399039388,"content":"Rider of the Mark can \"lock down\" Smaug the Magnificent in the Hobbit quest \"Lonely Mountain\" if you are playing with two players. Pass the Rider of the Mark from the second to the first player when you engage the dragon to discard his shadow card and thus prevent the dragon from making additional attacks. Since Smaug's forced effect is contingent upon if the shadow card has a burgle effect, shadow cancellation will not work--you need to discard the card altogether before it is revealed and so Rider of the Mark is the perfect card for him. Just make sure each player is playing at least one Spirit hero (or song of travel).\n\n \n\nOutside of this quest, I do not use him though. But he really does make it easier to gather all the treasures in this quest. I have had the dragon attack I think 5 or 6 times in a row one game when I did not use Rider of the Mark.\n\nEdited May 2, 2014 by kyrie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070042","commentId":1070042,"userName":"Pericles","timestamp":1399040241,"content":"That's a clever use of the card, kyrie.  Nice job!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070716","commentId":1070716,"userName":"Nerdmeister","timestamp":1399073932,"content":"> Rider of the Mark can \"lock down\" Smaug the Magnificent in the Hobbit quest \"Lonely Mountain\" if you are playing with two players. Pass the Rider of the Mark from the second to the first player when you engage the dragon to discard his shadow card and thus prevent the dragon from making additional attacks\n\nWon´t Smaug´s \"immune to player card effects\"-clause kick in for his shadow card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070723","commentId":1070723,"userName":"MyNeighbourTrololo","timestamp":1399074265,"content":"Nope."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070731","commentId":1070731,"userName":"kyrie","timestamp":1399074936,"content":"Since Rider of the Mark targets his shadow cards, and not Smaug himself, it's legal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105233-rider-of-the-mark-timing/?do=findComment&comment=1070968","commentId":1070968,"userName":"alogos","timestamp":1399107784,"content":"Also an official answer from Caleb :\n\n \n\n>  \n> \n>  \n> \n> Q: Can Dunedain Watcher cancel a shadow effect from an immune-to-player-card-effect enemy? It seems by the wording that Dawn Take you All should not work, can you confirm it?\n> \n> A: Shadow cards are also separate from the enemies that they are dealt to. So a player may use Dawn Take You All to discard a shadow card from an enemy that is immune to player card effects."}]}