{"url":"https://community.fantasyflightgames.com/topic/105253-morgul-vale-help/","title":"Morgul vale help!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/105253-morgul-vale-help/?do=findComment&comment=1069478","commentId":1069478,"userName":"7theye","timestamp":1398991274,"content":"A question about how to handle the final stage with Nazgul\n\nHe can only take 1 damage per attack. Now, bc they didn't make lord alcaron and other captains victory points they can come back. So now I can have alcaron back in play after he died. Is this how you are supposed to play it?? Seems thematically stupid.\n\nAlso if you feint Alcaron do you have to look at his whole shadow forced effect or ignore it?\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105253-morgul-vale-help/?do=findComment&comment=1069573","commentId":1069573,"userName":"GrandSpleen","timestamp":1398997591,"content":"Yes, you're right: they can come back.  It doesn't make a lot of sense thematically if you consider them \"dead\" after they go into the discard pile (which is how the rulebook spells it out for us).  But you could, instead, consider them \"defeated\" -- maybe they retreated, or were knocked out... you can make it work if you have a mind to.\n\n \n\nIf you use Feint against Alcaron, you can ignore his Forced text since the shadow card will never be revealed (and his Forced text triggers off the shadow card).  (and his other Forced text resolves off him attacking)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105253-morgul-vale-help/?do=findComment&comment=1069705","commentId":1069705,"userName":"ricedwlit","timestamp":1399006307,"content":"Regarding reducing the damage to the Nazgul to one: don't overlook dealing him direct damage in order to defeat him sooner. For example, each instance of Hail of stones or Infighting could deal one damage.  A Dwarrowdelf's axe can also prove useful (since it's counted \"after the attack\")."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105253-morgul-vale-help/?do=findComment&comment=1069735","commentId":1069735,"userName":"PsychoRocka","timestamp":1399009121,"content":"Morgul road helps against him too, when I first got the quest I was like what? Do one damage to an enemy or remove 1 progress from to the tower? Definitely remove progress!! But yeah the 1 damage is amazingly helpful against the nazgul, in fact pretty sure the single victory I have against this stage so far would have been yet another defeat if not for morgul road!"}]}