{"url":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/","title":"Cards that could have been better...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071341","commentId":1071341,"userName":"MyNeighbourTrololo","timestamp":1399152606,"content":"This article is an expression of my sadness for missed opportunities that could actually have been a valid deck picks.\n\nI'll only list extremes in this article.\n\n \n\nmed_gandalfs-search-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_gandalfs-search-core.jpg]\n\n \n\nSummary: Well, this is just plain bad. This card expects us to pay loads of resources just for little top of the deck rearrange + drawing of 1 card. There is little to no use for this card in any deck at all, even if you have nothing to replace it with.\n\nSalvation: Card cost should have been set to 0-1(or even exhaustion of Lore character/hero) and X in the card text tied to something else, like number of Lore heroes you control, or else. Even then, card would be optional, but at least considerable.\n\n \n\n \n\nmed_power-in-the-earth-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_power-in-the-earth-core.jpg]\n\nSummary: Should I even say something? A waste of a slot in your deck.\n\nSalvation: Lowering the cost to 0 and/or boosting threat reduction to -2 would be most straightforward solution which would give it some potential. Upping the cost to 3~ and lowering the threat of attached location to 0 would be another pseudo-decent solution.\n\n \n\n \n\nmed_the-favor-of-the-lady-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_the-favor-of-the-lady-core.jpg]\n\nSummary: 1 willpower at the cost of 2 SPIRIT resources? No, thanks. By the way, Dunedain Quest suffers the same fate, but at least it's from rich Leadership sphere.\n\nSalvation: Reducing cost to 1. As simple as that.\n\n \n\n \n\nmed_ancestral-knowledge-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_ancestral-knowledge-kd.jpg]\n\nSummary: This card contains one of the worst game design flaws - being tied to a very specific element of the ENCOUNTER deck. And cards is very limited on without it (requires a dwarf, requires it to exhaust, can only target the active location). And with all those limits, it still costs you a resource.\n\nSalvation: Just make it less restricted and more reliable. Like, dropping this location trait thingy, so it can exhaust any character to place the progress, but if you exhaust a Dwarf, you get additional progress.\n\n \n\n \n\nmed_ever-onward-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_ever-onward-kd.jpg]\n\nSummary: While being so simple, it's so situational for the given cost. It targets only one player, it costs 3, it assumes you're gonna fail at questing, and it will sit in your hand for long before you'll have a real reason to play it. In most of the cases it's just better to build willpower to quest instead of canceling the threat from failing it.\n\nSalvation: This one is extremely tough, I see no immediate solution to make it worth a slot in a leadership deck. Lowering a cost to 2 would be a nice touch.\n\n \n\n \n\nmed_bombur-rtr.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_bombur-rtr.jpg]\n\nSummary: Another case of the worst game design, this ally costs a lot and brings nothing but Power in the Earth action in the quests outside of the Khazad cycle. \n\nSalvation: Simply making him the location version of Ithilien Tracker would solve the issue.\n\n \n\n \n\nmed_ever-my-heart-rises-tld.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_ever-my-heart-rises-tld.jpg]\n\nSummary: And here we go again. There is a few of Mountain location appearances outside of the Khazad-dum. Tying card to a location trait will most certainly make sure this card is never seen.\n\nSalvation: Increasing cost to 1, making it unique and removing the location trait requirement. \n\n \n\n \n\nmed_keeping-count-trg.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_keeping-count-trg.jpg]\n\nSummary: It requires you a lot of copies, it requires you to kill stuff, and it negates itself when you actually utilize it's bonus. Oh, and it destroys your resource token supply if you actually attempt to use it.\n\nSalvation: The card should be reworked completely. I would make it a response attachment, which gives attached hero bonus attack when an enemy is destroyed without attached hero participating.\n\n \n\n \n\nmed_taking-initiative-trg.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_taking-initiative-trg.jpg]\n\nSummary: A failed attempt to complement the secrecy pool. Hardly usable and too random, does not rewards you enough if you can actually pull the effect.\n\nSalvation: Should have been simply a 2 cost card with Secrecy 2 keyword. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071368","commentId":1071368,"userName":"Bullroarer Took","timestamp":1399155663,"content":"Sword that was Broken (Leadership) should have given Aragorn a different icon than Leadership. Since the Stone gives Spirit and the Ring gives Lore, I guess it should have been Tactics.\n\nEdited May 3, 2014 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071375","commentId":1071375,"userName":"MyNeighbourTrololo","timestamp":1399156809,"content":"> Sword that was Broken (Leadership) should have given Aragorn a different icon than Leadership. Since the Stone gives Spirit and the Ring gives Lore, I guess it should have been Tactics.\n\nI think it was intended for Loragorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071382","commentId":1071382,"userName":"Mndela","timestamp":1399158366,"content":"For me Ever Ownard and Galdalf Search are the cards i haven't never played. All the others i have played in some time, and run good (depening of the quest and the deck, of course)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071403","commentId":1071403,"userName":"Bullroarer Took","timestamp":1399160375,"content":"> > Sword that was Broken (Leadership) should have given Aragorn a different icon than Leadership. Since the Stone gives Spirit and the Ring gives Lore, I guess it should have been Tactics.\n> \n> I think it was intended for Loragorn.\n\nSure it was, but I think they should have made it Lore gives Tactics or Leadership gives Tactics or... My point is simply that at some point it looks like you should have been able to equip one flavor of Aragorn and chain the attachments so he has all four colors. It's no big deal, but as you said, it's a missed opportunity in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071422","commentId":1071422,"userName":"Noccus","timestamp":1399163238,"content":"http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/ [http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071599","commentId":1071599,"userName":"MyNeighbourTrololo","timestamp":1399186363,"content":"> http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/ [http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/]\n\nNone of the listed cards are listed here. Those listed in Beorn's article can be decent enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1071923","commentId":1071923,"userName":"Mndela","timestamp":1399226686,"content":"Sword that was Broken is good even without giving leadership sphere.\n\nEdited May 4, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1072467","commentId":1072467,"userName":"Nerdmeister","timestamp":1399282080,"content":"These cards seem quite valid to me when taking sphere, cost, utility, restricted etc into consideration.\n\nNot all the cards are equally powerful against every scenario but that´s not a bad thing in my book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073003","commentId":1073003,"userName":"Morithain","timestamp":1399311159,"content":"The location specific cards require you to tailor your deck to the scenario.  Some people like this, others don't.  When I'm doing Khazad adventures I like to include Bombur and a few of the other cards you mention here.  So they're useless outside of underground adventures--so what?  Take 'em out before you play an adventure like that.  Problem solved.  Kind of like ranger spikes are useless in Into Fangorn, but amazing everywhere else.  Replace them with something.  That's part of the fun for me.\n\n \n\nThat said, I *never* use power in the earth, Gandalf's search, or ever onward, and rarely use favor of the Lady.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073139","commentId":1073139,"userName":"Nerdmeister","timestamp":1399316691,"content":"> That said, I *never* use power in the earth, Gandalf's search, or ever onward, and rarely use favor of the Lady.  \n\nNot that I have really been using power in the earth much since core myself but against an encounter deck with too many locations to explore or with locations that do something nasty when revealed, traveled to, explored, placed progress onto that you do not want to see coming from the encounter deck again or have very little wish to explore, it could be usable as a permanent solution to downgrade the sting of the threat.\n\nAfter all if someone is willing to pay 2 resources for Favor of the Lady then it should be no problem paying only 1 resource for something which amounts to the same quest-wise; that is if your solution to a nasty location effect is the let it stay in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073250","commentId":1073250,"userName":"MyNeighbourTrololo","timestamp":1399321763,"content":"> So they're useless outside of underground adventures--so what?  Take 'em out before you play an adventure like that.  Problem solved.  Kind of like ranger spikes are useless in Into Fangorn, but amazing everywhere else.  Replace them with something.  That's part of the fun for me.\n\n \n\nMy problem is that they are dead anywhere outside of khazad, while they could have been alive and breathing through most of the game. That's the difference with ranger spikes. Rangers spikes are amazing anywhere outside of Into Fangorn - one little very specific quest. Those mountain-oriented cards are useless EVERYWHERE outside of Khazad, except for several quests. And thats bad. The card slots wasted, could have been something awesome, giving me more options for universal deckbuilding. They share a hatred spot in my heart near the cards like Vilya, which attach to a named card. The only difference is that Vilya is tied to a player card, which gives you more versatility on where you can use it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073260","commentId":1073260,"userName":"Morithain","timestamp":1399322278,"content":"Indeed, so it seems that you prefer building universal decks, or at least decks that are nearly-universal.  The underground/mountain cards are definitely useless outside of Khazad.  What's wrong with only using them for Khazad adventures?  Just take them out if you're playing anything else and replace them with something more useful for the adventure you're getting ready to go on--problem solved.  When playing Khazad adventures, put them back in.  Done and done.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073305","commentId":1073305,"userName":"MyNeighbourTrololo","timestamp":1399324314,"content":"How to point out more clearly to you that dependence of a player card to a very specific encounter card is a cancer for the low card pool game like this? \n\nNothing wrong with using them only for Khazad advantures. What was wrong is creating them tied to Khazad advantures. Imagine if all cards were so tied to the encounter sets they were released with... what deckbuilding would have left to us?\n\nYou don't seem to understand that they have killed potential for the versatile card pool with this waste of a cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073368","commentId":1073368,"userName":"Johnny Awesome","timestamp":1399326775,"content":"I don't have a problem with location specific player cards like the ones that are only good in Moria.\n\n \n\nThings like Gandalf Search though (completely useless) should never have seen the light of day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073481","commentId":1073481,"userName":"Morithain","timestamp":1399331767,"content":"No, I get it.  You don't like location specific cards.  I don't mind them and I don't feel like it is a waste of cards, especially since we may not have seen the last of the \"underground\"  or \"mountain\" locations.  You have to admit, underground and mountain specific dwarf cards makes a lot of sense thematically.  But to each his/her own.  You have to make a balance of universal vs. specific cards to make for an interesting combination of choices.  All that said, the other cards you mentioned, like Gandalf Search, Power in the Earth, etc., I haven't found to be all that useful.  They're just too little bang for too much buck.\n\nEdited May 5, 2014 by Morithain"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073500","commentId":1073500,"userName":"MyNeighbourTrololo","timestamp":1399332636,"content":"I don't like encounter-related specific cards. Imagine if in Against the Shadow cycle card had looked something like \"Old Hatreds, Attachment. Attach to a Hero. After Harad enemy is revealed from the encounter deck, ready attached hero to deal 1 damage to that enemy.\" and stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073634","commentId":1073634,"userName":"ricedwlit","timestamp":1399341255,"content":"> I don't like encounter-related specific cards. Imagine if in Against the Shadow cycle card had looked something like \"Old Hatreds, Attachment. Attach to a Hero. After Harad enemy is revealed from the encounter deck, ready attached hero to deal 1 damage to that enemy.\" and stuff.\n\nI'lll go on he record as saying I would enjoy this card, especially for a quest such as \"Into Ithilien\" Yes, it would be encounter-related specific ... but I don't see cards like that as being an automatic waste provided they appear in moderation.\n\n \n\nConsider that the encounter cards in each Adventure pack are, by there very nature, somewhat encounter specific since they are tailor made for that Adventure. This makes it hard to scale up against an ever growing player card pool.  So, if the player cards are sometimes not universal, fine with me.  And, in the future, we may find a time when these cards find another use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073663","commentId":1073663,"userName":"Noccus","timestamp":1399344692,"content":"> > http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/ [http://talesfromthecards.wordpress.com/2013/08/13/learning-to-love-the-bad-cards/]\n> \n> None of the listed cards are listed here. Those listed in Beorn's article can be decent enough.\n\nI'm well aware of that. You're missing the point.\n\nThe point is that there are several reasons why bad, mediocre, and good cards exist.\n\nEdited May 6, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073664","commentId":1073664,"userName":"Gizlivadi","timestamp":1399344744,"content":"I like encounter trait-specific player cards. What I don't like is the inconsistency and randomness of those traits in the encounter cards themselves. In Meccg, all location cards had a specific type (Wilderness, Ruins, Coast, etc) and there were lots of player cards that interacted with these traits because you were bound to see at least some of them in a game. Thus, there were lots of advantages to having, say, a Ranger in your company because there were good ranger cards that interacted with Wilderness sites, for instance. The problem of this game is not precisely that we are restricted by the scenario (as opposed to the sandbox gameplay of Meccg), but because there is not rhyme or reason as to put incredibly random and useless traits on locations such as Underwater, Hills, etc. This is just a theory that I haven't really thought deeply, but if we had, say, 5 or 6 different types of locations and ALL of the locations belonged to at least one of them, there would be much more consistency and cards like Ever My Heart Rises would be much more playable, albeit still scenario or cycle specific. For enemies, this is a bit different since most of the traits repeat a lot (can you say Orc?) but they still suffer from the same problem IMO.\n\nEdited May 6, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073669","commentId":1073669,"userName":"Noccus","timestamp":1399344854,"content":"> I don't have a problem with location specific player cards like the ones that are only good in Moria.\n> \n> Things like Gandalf Search though (completely useless) should never have seen the light of day.\n\nThere's a use for Gandalf's search.\n\nYou can make your deck smaller, so you get to the cards you want faster.\n\nHow? When you draw GS, pay 1 to draw a card.\n\nPresto! Fewer cards in your deck.\n\nEdited May 6, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105398-cards-that-could-have-been-better/?do=findComment&comment=1073811","commentId":1073811,"userName":"Nerdmeister","timestamp":1399355866,"content":">  All that said, the other cards you mentioned, like Gandalf Search, Power in the Earth, etc., I haven't found to be all that useful.  They're just too little bang for too much buck.\n\nAgain: not that I have been using it awful lot myself, but in regards to Gandalf´s Search I could imagine a sort of deck that tries to rely on a lot of different types of events and only include (for the sake of the argument) one copy of said event, in order to have a whole host of different answers to potential problems to problems. This has the advantage of potentially being able to have a tailored solution to every problem but also the distinct disadvantage of losing deck consistency. Part of the solution to such an inconsistency could be to include Imladris Stargazer and Gandalf´s Search in a combo; if you can remember the order of your deck after using Imladris Stargazer then Gandalf´s Search practically ups your hand size by 5 cards; the challenge then is to be able to determine which of those events is most likely to have potential (to reduce cost of GS) as well as remembering the order. To reduce the strain on resources I´d recommend events with as low a cost as possible."}]}