{"url":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/","title":"Advantages of Having Only 1 Core Set","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1078857","commentId":1078857,"userName":"kyrie","timestamp":1399656397,"content":"I've been debating as to whether or not I should purchase an additional core set recently with the release of the updated card texts and all. However, I have thought it through and found that, although there are easily identifiable advantages in owning multiple core sets, there are also great advantages (believe it or not) in only owning one core set.\n\n \n\n \n\nHere are three advantages to owning one core set:\n\n \n\n1. You save money (obviously).\n\n \n\nMoney does not grow on trees (or does it?). With extra cash, you can use it to buy other expansions (one core set runs for about $31 on Amazon right now, which is equivalent of more than 2 adventure packs or about 1.5 saga expansions).\n\n \n\n \n\n2. You increase your variety/creativity in decision-making when building decks.\n\n \n\nSince the core set does not come with 3 of every card, you force yourself to choose alternative cards to add to your deck. For example, you would like more shadow cancellation than just 2 Hasty Strokes, so you decide to build around Balin, or add a Dawn Take You All or Dunedain Watcher to your deck. Or, since you are running Spirit, you add the new attachment Silver Lamp to help planning during the combat phase. If you owned another core set, you could simply just add a third Hasty Stroke since it is most straightforward and arguably better than the others. However, with only 2 in one core set, you are forced to think \"outside the box\" and find other ways to help with enemy attacks. Hence, you add variety to your decision-making and deck, which adds a greater sense of creativity to the game for you.\n\n \n\n \n\n3. You \"fix\" the problem of over-powered and broken player cards and at the same time increase the game's difficulty level.\n\n \n\nRecently, there has been much discussion and debate on the forum about over-powered/broken player cards (e.g., \"The Problem of Unexpected Courage\"). Admittedly, the core set contains some of the more powerful player cards in the game (Unexpected Courage, Steward of Gondor, A Test of Will, Feint, Horn of Gondor, etc.). Many players complain about the fact that Fantasy Flight did not include 3 copies of each card in the core set, and so we are \"forced\" to buy a second (or third) core set to complete our collection and, more importantly, increase the power of our decks. However, I would argue that this is not so much a drawback as it is a \"built-in\" limitation of over-powered/broken cards. In limiting yourself to using only 1 copy of Unexpected Courage, you not only open up variety to other readying effects, you also increase the challenge of the game (something which is not always a bad thing nor something we do not want, or why else would they release Nightmare mode?).\n\n \n\nAnyways, I think this is the greatest advantage of only owning one core set, as it forces you to play less powerful cards and hence increase the game's difficulty, which is something I personally am always looking for (I really enjoy the Nightmare scenarios). Of course, you can easily own 5 Core sets and still limit your use of the player cards, but let's be honest, people buy additional core sets for those 1 copy and 2 copy powerful cards, but, ironically, in the next breath complain about how over-powered and broken they are. An easy solution to fix these cards it to simply only have one core set. I realize there are other reasons for getting another core set (like extra tokens, threat-trackers, the updated text, easy-mode rings, multi-player decks), however, I simply wanted to share some advantages to not owning another set for those who are on the fence about it as I.\n\n \n\nPlease feel free to leave your thoughts/comments/disagreements below.\n\nEdited May 9, 2014 by kyrie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1078895","commentId":1078895,"userName":"MyNeighbourTrololo","timestamp":1399658942,"content":"Artificial difficulty is not a good thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1078907","commentId":1078907,"userName":"tacomen253","timestamp":1399659565,"content":"I like this thread. I personally only have 1 core set. Mainly because of your number 1 reason, it saves money! I am a college student... so I do not have money to spend on 3 core sets (yet!). I never even thought about your other 2 points though. It is kinda nice to know I am using more strategy compared to others who may be using 2-3 core sets.\n\n \n\nAlthough if I could afford 3 core sets... I probably would get them  :rolleyes: [//content.invisioncic.com/Mfantflight/emoticons/default_rolleyes.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1078927","commentId":1078927,"userName":"Rapier1","timestamp":1399660846,"content":"Number 1 is a very convincing argument - as much as I love this game I like other things too. This is the main argument (backed up by a similar theme of not wanting to be wasteful of 90% of the components in the game on the second and third boxes)\n\nI'm afraid I find that your other two arguments less compelling. I would always rather have more choice for cards available up to the legally allowed limit. I can limit myself perfectly fine to make use of all the cards I own without having the limitation of not owning all the cards.\n\nNumber 2 is a nice idea, but you can implement these limitations yourself.\n\nNumber 3 is a a point of great contention. Generally the cards that you do not get 3 of are better than the cards that you do. This leads to an increased difficulty certainly. However it's not one you can't force on yourself if you did have all the cards avalaible to you. \n\nI feel like really everyone would choose to have 3 of every card in the core set if they'd been given the option and that Fantasy Flight knew that. I understand them wanting to hit price points - and I understand them not wanting to offer those missing cards in a cheaper format because of people being willing to buy multiple core sets.\n\nI just think they should have made any cards that didn't come in sets of 3 as limit 1 per deck cards and solved the problem - sadly they didn't think of that rule until Path of Need."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1078935","commentId":1078935,"userName":"klaymen_sk","timestamp":1399661046,"content":"I think the point #3 should be slightly changed:\n\nYou \"fix\" the problem of some over-powered and broken player cards and at the same time increase the game's difficulty level.\n\nOwning one core set doesn't change a **** about Dáin Ironfoot, Outlands or Spiritfindel for example. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1079169","commentId":1079169,"userName":"leptokurt","timestamp":1399671469,"content":"Amen. It's obviously better to play with only one core set. One is the number for manly men. Two and three is for wussies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1079177","commentId":1079177,"userName":"Khamul The Easterling","timestamp":1399672186,"content":">  Two and three is for wussies.\n\nAnd people with higher incomes. (not me) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1079182","commentId":1079182,"userName":"Demoncow","timestamp":1399672970,"content":"One is the way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1079359","commentId":1079359,"userName":"Noccus","timestamp":1399685590,"content":"The main reason why I have 1 (and a half) core set is my logic that it is meant to be played that way.\n\nOf course there are no rules for this, but my reasoning is that there is only 1 copy of some power cards in there for a reason.\n\nThey state in the manual that if you play multi-player, it might be a good idea to pick up another copy.\n\nThat said, I do have access to 3 other sets through my buddy though, so I'm spoiled that way, but I don't think I would get another core set if this was not the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1079649","commentId":1079649,"userName":"born to lose","timestamp":1399710611,"content":"Advantages, yes you save money.\n\n \n\nThen you proxy, and have your cake and eat it too :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1080688","commentId":1080688,"userName":"Olorin93","timestamp":1399829473,"content":"I have considered getting a second core set for the sake of Unexpected Courage and A Test of Will, but it's not exactly free. I'd rather save my money for the Ringmaker cycle! Will keep pondering this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1080715","commentId":1080715,"userName":"klaymen_sk","timestamp":1399831708,"content":"I for one don't regret getting a second core set. Now a third one, that would need some serious rationalisation and price cut."},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1081373","commentId":1081373,"userName":"richsabre","timestamp":1399886776,"content":"I have played this game since its release, and up until around the saga packs time, I played with 1 core set....got along just fine ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] so yes its completely fine, but then again, if you only collect 1 game like I do...want another core set, and hint at someone as a gift idea...cough cough :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] then its not a bad idea\n\nRich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1081384","commentId":1081384,"userName":"lleimmoen","timestamp":1399888951,"content":"> Amen. It's obviously better to play with only one core set. One is the number for manly men. Two and three is for wussies.\n\nUff, I am glad I bought six. Or does that make one a double-wuss?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/105903-advantages-of-having-only-1-core-set/?do=findComment&comment=1081385","commentId":1081385,"userName":"lleimmoen","timestamp":1399889031,"content":"On a more serious note, I agree it is perfectly possible to play with one core set now. It was harder to make a good deck in the beginning with just one. Overall, I think it was wrong to make the core set so, and totally inconsistent with the subsequent releases."}]}