{"url":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/","title":"Gandalf vs Gandalf","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081286","commentId":1081286,"userName":"lleimmoen","timestamp":1399877758,"content":"Regardless of whether we see a hero Gandalf in the Road Darkens, I want to delve a little into the core vs saga ally Gandalf. It seems there is a strong consensus that the core is just outright better but though I totally see how awesome the core version is I also find the saga version totally awesome.\n\n \n\nThe core is of course more versatile. In a deck without threat reduction, the core is probably always a better option. But without Leadership, I never play the core version any more (not having Sneak Attack and resource acceleration). Then in a deck that starts low on threat and/or have threat reduction, I really prefer the saga version. For five resources (and you have got options like Vilya or Elf-stone) you get a super character. And just for a single copy of Elrond's Counsel, you get him for two rounds and still end up lower on the threat. In fact, having him in play for four rounds will only increase your threat by six. This is of course not an option for a mono-Tactics deck or even mono-Lore where every resource is so preciouss but in a Glorfindel or Elrond based deck, this may not be a great deal at all. I find majority of my games take between six and eight rounds to complete, thus in the shorter ones, Gandalf can be present from say round 2 or 3 till the end without doing much damage to your threat level -- unless you are really running against it (like Return to Mirkwood, for instance).\n\n \n\nHow is it for you? Is the saga version gathering dust or treading the Wild?\n\nEdited May 12, 2014 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081303","commentId":1081303,"userName":"MyNeighbourTrololo","timestamp":1399879754,"content":"I take hobbit one into the decks with low starting threat or means to mitigate threat increase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081318","commentId":1081318,"userName":"lleimmoen","timestamp":1399880858,"content":"Yeah, just as I do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081368","commentId":1081368,"userName":"richsabre","timestamp":1399886196,"content":"yes...good points there. I like to have saga Gandalf in with strider. keep him in for as long as possible then discard him the same round I reset my threat. as you say, the core one is great also - I like to think of core as a fast burst of power, and the saga as a more controlled effect :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nRich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081551","commentId":1081551,"userName":"Rapier1","timestamp":1399904256,"content":"> yes...good points there. I like to have saga Gandalf in with strider. keep him in for as long as possible then discard him the same round I reset my threat. as you say, the core one is great also - I like to think of core as a fast burst of power, and the saga as a more controlled effect :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> Rich\n\n \n\nWhy do you discard him when you reset your threat? (I'd have thought that Strider would allow you to run this Gandalf for the whole game).\n\nMy main problem with the new Gandalf is that being able to quest for 4 and do something else is nice - but having a direct damage card at all is extremely rare - threat reduction outside of spirit is also very rare, and card draw outside of lore is somewhat rare. \n\nEssentially the core Gandalf grants three very good abilities (+4 to one of the stats), that are either rare in general, or rare within spheres. He can easily fit into any deck because any of his abilities is worth it's 5 cost depending on what you need.\n\nBy contrast the Gandalf of the Saga's is just, not as impressive. +4 to questing and one other ability every turn (for increased threat) is pretty nice, but we can easily get +willpower from other sources, and a 1 cost ally that dies defending is arguably a better cost than Gandalf costing you 1 threat a turn - even if he works every turn.\n\nThis version of Gandalf is also powerful, but only really useful if you can negate threat gain (Strider, spirit sphere) or can't get willpower easily any other way (some mono-tactics decks). I think what he needed to really make him have a place was the ability to take undefended damage on himself (on top of the abilities he now has) - this would have made him more of the hero replacement he's clearly meant to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081589","commentId":1081589,"userName":"ZanzibarLand","timestamp":1399906427,"content":"Doesnt saga Gandalf raise your threat by 2?\n\nEdited May 12, 2014 by ZanzibarLand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1081783","commentId":1081783,"userName":"Raven1015","timestamp":1399914173,"content":"I find the OHaUH Gandalf to be underrated. I would say that Core Gandalf is more generally useful because of his abilities, but OHaUH Gandalf can make a decisive difference in many quests (he's particularly good for battle/siege quests, by the way). It's not just a matter of getting additional willpower. You're getting 4 extra points of willpower (like getting another Eowyn on the table), plus another 4 points of attack (or defense if you really need it). This can be the difference between consistently keeping the board clear of enemies and having to leave some on the table. While running him in low threat decks and decks with threat reduction is recommended, he actually isn't restricted to those setting. A deck with a higher threat that focuses on simply sprinting through a quest can actually make good use of Gandalf 2.0 as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1082301","commentId":1082301,"userName":"DurinIII","timestamp":1399935978,"content":"Yes, he does raise your threat by 2 each round you choose to keep him in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1082339","commentId":1082339,"userName":"7theye","timestamp":1399937766,"content":"New galadrial hero really helps core gandalf become more like saga one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1082693","commentId":1082693,"userName":"ZanzibarLand","timestamp":1399961273,"content":"> New galadrial hero really helps core gandalf become more like saga one\n\nHow so?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1082764","commentId":1082764,"userName":"lleimmoen","timestamp":1399966605,"content":">  \n> \n> > New galadrial hero really helps core gandalf become more like saga one\n> \n> How so?\n> \n>  \n\nThat he does not exhaust to quest. It does not make him linger longer, no, but I agree Galadriel makes the core version of Gandalf even better. Not only for playing him from hand but also when you Sneak Attack him for quest, and play Word of Command after (because he is ready). I know I am repeating myself but I find that combo very, very powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1083124","commentId":1083124,"userName":"ZanzibarLand","timestamp":1399992637,"content":"> > > New galadrial hero really helps core gandalf become more like saga one\n> > \n> > How so?\n> \n> That he does not exhaust to quest. It does not make him linger longer, no, but I agree Galadriel makes the core version of Gandalf even better. Not only for playing him from hand but also when you Sneak Attack him for quest, and play Word of Command after (because he is ready). I know I am repeating myself but I find that combo very, very powerful.\n\nYeah of course, sorry. I had her adding willpower, card draw and threat reduction in my head as her three abilities. I forgot that last bit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1083143","commentId":1083143,"userName":"ana4","timestamp":1399993348,"content":"Yes, the ally not-exhausting ability of Galadriel is the bit I deem most powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1083779","commentId":1083779,"userName":"ZanzibarLand","timestamp":1400031531,"content":"I think I need the cards in front of me and to do playing with them. Even so, I still make mistakes with Elrond and Vilya, forgetting the spirit sphere or something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1086343","commentId":1086343,"userName":"Catastrophic09","timestamp":1400187010,"content":"I agree with what most people have already said. Core Gandalf is versatile bringing needed card draw, threat reduction and direct damage to any deck which is super useful BUT I definitely think OHaUH Gandalf is underrated- he is very similar to the new Doomed X mechanic since he speeds things up for a player allowing them to get a great quester and attacker/defender each round meaning you should beat quests faster and thus the threat gain each round shouldn't be a problem.  I would say that Core Gandalf is better in multiplayer while OHaUH is best in solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1086794","commentId":1086794,"userName":"leptokurt","timestamp":1400220271,"content":"I play core Gandalf more often than his hobbit counterpart. The latter only comes into play when my nie up lacks WPor ATT,  or if there are some nasty nasty enemies with nasty forced effects (Zealous Traitor) in the encounter deck. The core version is very good when you have a tough boss fight on the end or when you play with tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1086803","commentId":1086803,"userName":"ana4","timestamp":1400221827,"content":"> I agree with what most people have already said. Core Gandalf is versatile bringing needed card draw, threat reduction and direct damage to any deck which is super useful BUT I definitely think OHaUH Gandalf is underrated- he is very similar to the new Doomed X mechanic since he speeds things up for a player allowing them to get a great quester and attacker/defender each round meaning you should beat quests faster and thus the threat gain each round shouldn't be a problem.  I would say that Core Gandalf is better in multiplayer while OHaUH is best in solo.\n\nYes, he is like that in solo, but in coop, it is a different story, since he only raises your threat. I think that is the greatest problem I have with the doomed mechanic because I mostly play coop and it is hard to control. With saga Gandalf, however, it is usually that the player with him is lower on threat than the other player so it makes almost no difference to have him raise the threat a few times. I always run him with Glorfindel and Elrond's Counsel, so he can linger quite a bit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1089884","commentId":1089884,"userName":"Courchevel","timestamp":1400497340,"content":"For me, the main draw-back of saga Gandalf is due to his uniqueness for multiplayer games. I know, both are unique, however, the uniqueness draw-back is mostly applying to the saga Gandalf.\n\nIn multiplayer games, having the saga Gandalf in play will prevent the other players to sneak their core Gandalf in play. In some multiplayer games, with every players running 3 copy of Core Gandalf, you can see core Gandalf appearing every turn (let’s say, after turn 3), and sometimes more than once per turn thanks to sneak attack. On the other hand, as soon as a player put the saga Gandalf in play, other players are denied to play one of their most powerful problem-solving card in their deck (core Gandalf due to his versatile aspects).\n\n \n\nFor solo construction, which I like less, there is some pretty powerful decks running the saga Gandalf, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1089903","commentId":1089903,"userName":"SilvanBouncer","timestamp":1400498991,"content":"I so agree with Courchevel with what he says about the main draw back of saga Gandalf locking out core Gandalf. It's because core Gandalf is neutral, and thus, can be paid for by any sphere. At the very least, saga Gandalf could leave during a game, but if a hero Gandalf were to join the fray, ally Gandalfs are locked out for the entire game. This might be a point of contention in games with multiple players. So, it feels like a hero Gandalf would scale badly the more players there are. A hero Gandalf better well compensate for this, otherwise there'll be a dose of resentment around the gaming table against the player who effectively monopolises the Gandalf character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1089910","commentId":1089910,"userName":"ana4","timestamp":1400499486,"content":"Yes, the card pool is growing, it is not only a matter of Gandalf as Boromir, Aragorn, Glorfindel, Beorn, etc., they all have different versions now. However, Gandalf is a very strong (and Neutral) card, so the problem is perhaps more pronounced. Of course, when you play coop, you should have a master plan for all the decks before you set sail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106067-gandalf-vs-gandalf/?do=findComment&comment=1090216","commentId":1090216,"userName":"danpoage","timestamp":1400516152,"content":"Hobbit Gandalf is amazing in Secrecy decks. Especially once you have Arwen by his side, you have a 4 willpower quester who can then serve as a sentinel defender for 5. In Secrecy decks where most of your heroes (and many of your allies) are squishy, this is essential for dealing with more powerful enemies. As everyone else has mentioned, which Gandalf is better really depends on the deck. I don't think I've ever used Hobbit Gandalf in a deck with more than one Tactics hero, for example. The fact that both versions are powerful, yet very different from each other is a testament to excellent design.\n\nIn addition to Word of Command, another combo to mention is that Hobbit Gandalf is amazing with A Very Good Tale. You can commit him to the quest and still add his 5 cost to your total for that card. This makes it much easier to field expensive allies like Gildor, Faramir and (my favorite) Core Set Beorn.\n\nEdited May 19, 2014 by danpoage"}]}