{"url":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/","title":"Third world LoTR problems","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084383","commentId":1084383,"userName":"Mich the One","timestamp":1400079576,"content":"Hey guys, I am afraid this post may not be overly interesting to all of you, but bear with me for a while if you want to hear a fellow gamer's story. \n\n \n\nI am a LoTR LCG fan from Poland. So far I have got all the LoTR LCG products published (everything up to and including Voice of Isengard). My collection includes two core sets and nightmare mode cards. Since I live in Poland I have been buying all the sets and packs in Polish, from the local Polish LoTR LCG game publisher \"Galakta\". From what I see they are pretty much an exclusive publisher/distributor of FFG products in Poland. Though I am almost sure they are not in any way part of FFG's capital group.\n\n \n\nAnd today I learned that the Polish LoTR LCG line has been discontinued and will no longer be available in Polish, except for perhaps one more Saga box (but even that is not certain). The reason for this is very low sales in Poland. Galakta's representative was quoted online saying that the Polish \"Morgul Vale\" has sold in around 150 copies. This figure is shocking (what a niche player am I in this part of the world, eh?) and I guess it explains perfectly why it is not economically viable to keep publishing the cards in Polish. I know this is not a mainstream thing, but hell, 150? In a 40 mln people country? Geez, the Polish game market is a cripple.\n\n \n\nSo, my problem is obvious: since LoTR LCG is absolutely my favourite game ever, and at the moment I just cannot imagine being left out of the journey, I will therefore now buy English cards. This should not be a problem language-wise since my command of English is decent enough to play and enjoy the game. But the fact that I will have to mix Polish and English cards... just.. argh, this sucks. Those three boxes full of cards sitting on my shelf is a collection. And now it will all turn to a weird, internally inconsistent mix-up. I am not too afraid of screwing up the rules or keywords because I dwell in LoTR game forums anyway and already know all the English terms. But the collector's side of me is sick. \n\n \n\nTherefore, I am debating with myself acquiring all of LoTR LCG in English, all from scratch. But the potential cost of it just strangles me. Imagine paying TWICE for the same thing, just to update the language of the game. And is it even possible at the moment to get it all in English?  Eh, I guess I will just not do it :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nI now know better than to start collecting any game but in original language. The risk of discontinuation is too **** high. Seems pretty obvious now. But I guess it has never occurred to me earlier, I thought we were doing quite well (150! what an anus mundi I live in).\n\n \n\nAs a side note, if you are interested: Netrunner LCG is also discontinued in Poland. Whereas Star Wars is not, but I am quite sure SW execution is simply put off for few months. You can read this between the lines from the interviews with Galakta's folks.\n\n \n\nSo that is it. Just wanted to share the pain. I know, I know, not the end of the world, this may sound as an imaginary problem. But, man, I just feel left out from the ride.\n\n \n\nAnyway, thanks for reading, any thoughts and ideas are welcome.\n\n \n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084428","commentId":1084428,"userName":"mr.thomasschmidt","timestamp":1400082221,"content":"I feel your pain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084442","commentId":1084442,"userName":"Glaurung","timestamp":1400083011,"content":" i always play English card actually…believe me is the best play game on the own language. You learn other language as well. One of the best way to learn language is play game and listen songs. Good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084448","commentId":1084448,"userName":"DurinIII","timestamp":1400083182,"content":"Sorry about your problem. I can imagine I would be conflicted in your situation. If I was a die hard collector then I would probably go ahead and rebuy the English versions. Easy for me to say though, I only know one language. One thing I am a stickler about though is consistentcy in my collections."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084461","commentId":1084461,"userName":"klaymen_sk","timestamp":1400083651,"content":"Mich, be glad that you got so many expansions from your distributor. Blackfire, who distributes FFG's games in Czech Republic and Slovakia is in the process of releasing the first cycle (IIRC The Dead Marshes are upcoming) and I've heard that they contemplate stopping the game probably after Khazad-dûm. That means whose English is not sufficient for the English version is pretty much screwed when compared to you.\n\n \n\nThis is the reason why I avoid localised games like a plague, expecially those with many expansions existing or expected.\n\n \n\nAnyways, to your problem - you may try to sell your Polish collection and start buying English version for those money, or just as you have said, mix it together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084473","commentId":1084473,"userName":"Noccus","timestamp":1400083950,"content":"That is a nasty situation indeed mate.\n\nEverything I buy is in English, even if there is a Dutch version around.\n\nBut that won't help you now, will it.\n\nYou could maybe buy 1 pack at a time slowly at a rate that your wallet won't hurt so much?\n\nOtherwise, I see no choice but to mix the languages...not fun...\n\nAlso, Poland is not a 3rd world country! Give yourself some credit, Poland has been doing very well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084479","commentId":1084479,"userName":"MyNeighbourTrololo","timestamp":1400084115,"content":"While I'm living in the third world country, I would never buy LotR on the ukrainian or russian language. Translation issues, horrible wording, delays in releases and all this in combination with increased price. No, thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084550","commentId":1084550,"userName":"Rapier1","timestamp":1400087423,"content":"I have magic the gathering cards in another language (the french cards are cheaper than UK ones). As a collector I would look on the alternative language cards as enhancing your collection (two cards in different languages).\n\n \n\nAlternatively if you buy everything there was in Polish you will have completed your collection. (Another way of looking at it). The English cards would be the start of a new collection.\n\n \n\nIt sucks though -  is there another Polish company that might pick the game up?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084820","commentId":1084820,"userName":"asfaloth","timestamp":1400098224,"content":"I mix my spanish version with some english cards from time to time and there are not too many problems with it as long as you understand english. Once you know the text of the card in your own language you even dont notice if the card is written in english at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1084842","commentId":1084842,"userName":"Olorin93","timestamp":1400099200,"content":"No one has made the effort of translating the game into Swedish, so my friends and I use the English originals. Wouldn't have bought Swedish ones if they existed, I think - I think the LotR reads better in English.\n\nYou have my sympathies, but I'd advise you to keep your Polish cards. If you keep playing, you will soon know most of them by heart and won't have to read the texts.\n\nAnd look at it this way: there is a large variety of cultures and languages in Middle-Earth. Not everyone spoke each other's languages. These cards tell you about heroes and deeds from thousands of years ago - but it is inevitable that more than one person would live to tell about them. The Mirkwood, Dwarrowdelf and Gondor cycles were chronicled in the Common Tongue. Now the elves will tell their story, and their language is at first alien to you - and to take part in their struggle, you need to learn their tongue!\n\nThat's the best thematic explanation I can come up with right now.\n\nEdited May 14, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1085554","commentId":1085554,"userName":"Mich the One","timestamp":1400146724,"content":"Thanks for replies, guys, your insight is nice to hear.\n\n \n\n>  i always play English card actually…believe me is the best play game on the own language. You learn other language as well. One of the best way to learn language is play game and listen songs. Good luck!\n\n \n\nI agree. I just got the Polish versions because it was more convenient: the core set was all over the local game stores, and the English version I would have had to order from abroad. So it was just not well thought out. And yes, learning English through games is the best way to learn. Now everything is being localised: games, books, articles. When I was younger and capitalism was not ripe at all in this part of the World I needed to learn at least some basic English to play games on my Commodore or to \"read\" a comic book at a library. It seriously prompted me to learn, it got me really determined to understand all this world fo tales that was not present then in Polish.\n\n \n\n> Mich, be glad that you got so many expansions from your distributor. Blackfire, who distributes FFG's games in Czech Republic and Slovakia is in the process of releasing the first cycle (IIRC The Dead Marshes are upcoming) and I've heard that they contemplate stopping the game probably after Khazad-dûm. That means whose English is not sufficient for the English version is pretty much screwed when compared to you.\n\n \n\nThanks, klaymen. Seeing what happened to Polish LoTR, you can indeed congratulate yourself on the foresight of not venturing into Slovakian version :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] And yes, you are right, I can count myself lucky. Not everyone speaks English and I do feel sorry for the fans who need to rely on Polish translation. In my case mixing of Polish cards with English ones is just a matter of taste and consistency, but for some people this whole thing just made further gaming impossible. And those guys are fans and love the story as much as we do.\n\n \n\nIt is generally a very unfortunate thing that happened. It removes trust to local publishers. Imagine a new cool LCG comes out. Which conscious gamer will buy Polish edition now? Not a lot of people, I would imagine. And that is very unfortunate because it will kill the local market of importing new games from FFG and other foreign companies. Localised versions are key for popularising the game. I guess you and I are more into games so would have heard of LoTR anyway, but I know of lots of people who like and play board/card games but limit themselves to what they see at the store shelf. And just \"hardcore\" gamers are not enough to sustain the LCG market, not in Easter Europe at least I think. Your stories of a weak publication practices in Slovakia only reinforce my judgement. So to original versions you and I shall remain faithful now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n> You could maybe buy 1 pack at a time slowly at a rate that your wallet won't hurt so much?\n> Otherwise, I see no choice but to mix the languages...not fun...\n> \n> Also, Poland is not a 3rd world country! Give yourself some credit, Poland has been doing very well!\n\n \n\nHey, Noccus, buing pack per pack seems reasonable. It is just my fear that the stock will run out, I am now paranoid :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] But seriously, yes, this is the way to go.\n\n \n\nAnd on behalf of my country I do thank you! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Yes, Poland has been doing quite well the past two decades. So many things has changed for the better, thanks for noticing! It is just in the gaming world we are a backwards, medieval, non-electrified, poo-behind-the-barn land ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1085560","commentId":1085560,"userName":"ana4","timestamp":1400147398,"content":"I am not a native speaker but even when my English was very poor, I could already play Magic -- though I am sure I was making many mistakes. So, whilst I see it is sad that the native language product is being discontinued (which is probably the case in my home country as well), I agree with those who support the English version. English so global these days, that learning it through a game you enjoy, is never a bad idea, I feel. I just hope my retailer does not stop bringing the English version as well -- I am not sure what the sales of it are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106245-third-world-lotr-problems/?do=findComment&comment=1086936","commentId":1086936,"userName":"Mich the One","timestamp":1400239272,"content":"> No one has made the effort of translating the game into Swedish, so my friends and I use the English originals. Wouldn't have bought Swedish ones if they existed, I think - I think the LotR reads better in English.\n\n \n\nI see. Maybe it is a stereotype, but is in it not so that in Sweden basically everyone speaks English?\n\n \n\nOh, and I agree LoTR definitely reads better in English. I remember once there was a thread with scans of cards form around the world, and it struck me that (I believe) French cards even had the original names of characters changed - there were hobbits named Frodon Sacquet and Bilbon Sacquet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] heh, that would be hard to endure, wouldn't it? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}