{"url":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/","title":"Newbie Questions...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1084937","commentId":1084937,"userName":"DarkFalcon","timestamp":1400104492,"content":"Just started my very first game (solo) today playing the Passage Through Mirkwood scenario, and I've played 3 rounds so far, but I've run into quite a few confused moments already (probably due to my inexperience with card games in general, this is the very first one I play in fact.) So forgive me if the questions are silly but here they go:\n\n \n\n(1) Do you HAVE to commit character(s) to a quest every round? (And if not, what happens if you don't.)\n\n(2) Can you commit on a quest while being engaged with enemies from the previous round? (And if so, what is different (if anything) from committing on a quest while not being engaged with enemies.)\n\n(3) When using the \"Feint\" combat action, should you still draw a shadow card for that enemy? Since the enemy wont be able to attack my guess is no, but I'm not 100%. And what happens to the shadow card if I should draw one? Should it just be discarded immediately?\n\n(4) The Forest Spiders, is their +1 attack damage only for the first round of combat?\n\n(5) The \"Sentinel\" keyword, has it no function in solo play?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1085009","commentId":1085009,"userName":"Rapier1","timestamp":1400107626,"content":"1) You don't have to. If you fail to beat the total threat of the cards in the staging area (top left number) you have to raise your threat dial by the amount that you didn't overcome. (you lose if you hit 50).\n\n2) You can commit to characters to the quest while engaged - it makes no difference to the quest stage. (It just means they won't be able to defend or attack the enemies)\n\n3) It gets a shadow card. The card does nothing as the enemy never attacks (so it can't reveal it's shadow card) It gets discarded after you've done all the attacks on that player.\n\n4) It is for the first round only (technically its whenever they engage a player - so if you sent them back to teh staging area and they engaged again it would trigger a second time). Enemies only engage you the first time you pull them out the staging area. The other times they count as already engaged with you.\n\n5) That's true, it as no effect in solo play.\n\n\nI hope that helps, and I hope you enjoy your games.\n\nEdited May 14, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1085023","commentId":1085023,"userName":"DarkFalcon","timestamp":1400108354,"content":"Thank you very much, that was helpful! =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1086094","commentId":1086094,"userName":"DarkFalcon","timestamp":1400175398,"content":"Hehe... I lost my first game BADLY, but had a blast anyway, so that's okey.. =P\n\n \n\nGot some more things I'm uncertain about though.\n\n \n\n1. Forest Gate, it says \"you may draw 2 cards\"... well, what cards? It doesn't say. I assume player cards?\n\n2. If you don't commit any characters on a quest, is the encounter deck still drawn in the quest phase? (my guess is yes..)\n\n3. Caught in a web,\n\na) Can you pay 2 resources at any phase of the round to remove the web and ready the character again, or does it have to be in the refresh phase you do this?\n\nb) If a character with web on him travels to \"Old Forest Road\", can you ready him and remove the web?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1086100","commentId":1086100,"userName":"richsabre","timestamp":1400175762,"content":"1. yes, player cards ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n2.  yes, no characters means you quest for 0, and you still draw from encounter deck\n\n3. it has to be during the refresh phase you pay the 2 resources\n\n    yes, there is nothing to stop the character readying - there are encounter cards in later packs that do this, but they specifically say 'character cannot ready' ...this card just says it cannot naturally ready during the refresh phase...so unexpected courage could still work for example\n\nhope these help\n\nRichard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106280-newbie-questions/?do=findComment&comment=1086107","commentId":1086107,"userName":"DarkFalcon","timestamp":1400176071,"content":"Yep, that solved my confusion!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  I appreciate it!"}]}