{"url":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/","title":"My Favorite Dwarf Deck That Is Quite Broken","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085105","commentId":1085105,"userName":"DurinIII","timestamp":1400113068,"content":"So, I have built a deck with Thorin, Ori, and Bombur. It is the only deck that I can consistently stomp most quests with. I just played the Woeses quest and ended up having 15 characters in play (including heroes) as well as only having 5 cards left in my deck. I had an average hand of 10 cards the entire game and I always had resources in my heroes' pools so that the Hunter cards never even fired an arrow. \n\n \n\nThe purpose of sharing this post is to find out if any of you have constructed a similar deck with these results. \n\n \n\nNow, before many of you inform me that such a deck is indeed broken, boring, and overplayed, I want to tell you that yes, I know it is all of these to some extent :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . However, I love using this deck against particular quests whose difficulty drives me up-he-wall sometime, because I can usually beat the crap out of them!\n\n \n\nBaruk Khazâd! Khazâd ai-mênu!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085135","commentId":1085135,"userName":"Rapier1","timestamp":1400115311,"content":"My wife ran this deck alongside my Dain/Nori/Oin deck when we played the dwarfs through the hobbit saga. We found the decks to be pretty **** powerful (As is the dwarven way).\n\n \n\nEdited May 15, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085444","commentId":1085444,"userName":"ana4","timestamp":1400133637,"content":"I believe you both. But for some reason, just as with Outlands, the satisfaction was not there after destroying the quest. Which is strange in a way, because when I do the same with Elrond and Glorfindel, and I have Gildor and Trackers and all out and I absolutely own the board, it does feel good. Maybe I am just biased toward the Elves, but I find the Dwarven and Outlands (especially) strategy too straightforward and little satisfying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085447","commentId":1085447,"userName":"ana4","timestamp":1400133674,"content":"ps: At least with the Dwarves, trying to win without Daín feels better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085610","commentId":1085610,"userName":"richsabre","timestamp":1400151223,"content":"Yeah, I love dwarves, as I often said :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] but I agree with Ana...sometimes it can feel too easy....However, given that I suck so bad at this game at times, I rarely have the problem of feeling like im winning too much haha ...thank god I love Tolkien! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nStrangely enough I have never had much luck with Thorin, which is a shame because I love the card...I guess im using the wrong heroes with him\n\nRich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085617","commentId":1085617,"userName":"Rapier1","timestamp":1400151357,"content":"Dwarfs are nice to play sometimes - I wouldn't want to play them all the time. \n\nI tend to find Spirit Glorfindel is easier than dwarfs personally, but I think that's because I prefer his style."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085646","commentId":1085646,"userName":"DurinIII","timestamp":1400153380,"content":"Yeah Rich, once you play a 2 cost, Lore, Dwarf ally on turn 1, so that on turn 2 your drawing a second card from Oin and an extra resource from Thorin, then you realize how sick Thorin can be. :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106290-my-favorite-dwarf-deck-that-is-quite-broken/?do=findComment&comment=1085759","commentId":1085759,"userName":"ana4","timestamp":1400159498,"content":"> Dwarfs are nice to play sometimes - I wouldn't want to play them all the time. \n> \n> I tend to find Spirit Glorfindel is easier than dwarfs personally, but I think that's because I prefer his style.\n\nYeah, he is easy to use, he fits everywhere but I still never get tired of him, mostly because I love the character from the book,  and partly because of the superb art. What is interesting about the hero is that you can find so many interesting line-ups for him - even many thematic ones now. He can join Strider and the Dúnedain on their exploits, help Hobbits to find their way, or become a member of a High Elven Council."}]}