{"url":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/","title":"New player - where would you start?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086369","commentId":1086369,"userName":"Lorimez","timestamp":1400187910,"content":"Hi all.\n\n \n\nThanks for taking the time to read this.\n\n \n\nI've just bought the core set and already I'm ridiculously excited about playing this game! I've seen the FFG guidance video and I'm deciding to invest in some more sets of adventures/Saga's.\n\n \n\nFrom what I can see is that the SAGA sets are designed to be played as a slightly different set up in that some cards are particular to that set and that some SAGA sets link on - The Black riders + new one due to be released soon. Adventure packs can be played in an order but appear to be the way to increase your deck choices.\n\n \n\nMy real questions are:\n\n \n\n1. Do I invest in the SAGA sets and play them solo/duo? (Really like the story element to them tbh)\n\n \n\n2. Am I better to invest in adventure sets to increase my card/hero choices?\n\n \n\nAny advice is gratefully received.\n\n \n\n \n\nLorimez"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086386","commentId":1086386,"userName":"7theye","timestamp":1400188723,"content":"It depends. The sagas follow the books and movies so if you like that then get them. The expansions and 6 APs are also a cycle and the newer one even has a story that flows through it but it's a made up quest.\n\nYou can beat the sagas without other cards. FFG has a deck list at the back of the book in the saga that gives you two decks to beat the scenarios with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086406","commentId":1086406,"userName":"CJMatos","timestamp":1400189205,"content":"This will help you a bit\n\n \n\nhttp://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\n \n\nI would say go in order, if you can"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086521","commentId":1086521,"userName":"DurinIII","timestamp":1400196039,"content":"Welcom Lorimez,\n\n \n\nI would tend to agree with CJMatos: I would start purchasing them in order. I started buying this game the month the core set was first released because I was anticipating it that much! I have purchased every adventure pack, delux adventure pack, saga boxes and Gen-con only quests since then. The only cards I haven't purchased yet are the \"nightmare mode\" add-ons. So there are a lot of cards that you don't have yet!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nSo, a lot depends on your love for Lord of the Rings collecting and your budget. My opinion is that each set available for purchase has at least one (usually more) very powerful and important player cards (the cards to customize your decks with) that you are going to want to own if you stick with this game. So, in this regard, I would advise you to simply start collecting in order. If so, the adventure pack \"Hunt for Gollum\" would be the next box you want!\n\n \n\nCheers, and happy questing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086753","commentId":1086753,"userName":"ZanzibarLand","timestamp":1400213652,"content":"Do you know the difference between all the sets? That link is very helpful but doesn't explain the very basics.\n\nYour Core set (biggest box) is followed by 6 adventure packs (small box, 60 cards, 1 new hero) that make up a cycle, the first is Shadows of Mirkwood. After this cycle you will need the Deluxe expansion (medium box, 160 approx cards, 2 new heroes) for the next 6 adventure packs. Khazad Dum for Dwarrowdelf etc.\n\nThe saga boxes follow Tolkien's books, are mostly stand alone (you only need the core set), come in a medium box with 160 approx cards and 4 heroes (typically).\n\nHope this helps, I remember how confusing it all seemed when I first started, now I scarily know the names of all of them.\n\nEdited May 16, 2014 by ZanzibarLand"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086822","commentId":1086822,"userName":"Lorimez","timestamp":1400223588,"content":"Thank you very much for your help.\n\n \n\nIt certainly takes a long while to find out about how all the packs interact with each other! Surprised FFG hasn't considered some sort of guide for newbies . . .\n\n \n\nThink I'll buy the SAGA sets as those follow the story and then I'll also begin investing in the adventure cycles starting with the Mirkwood ones.\n\n \n\nThanks once again - the kind people above have really helped. :-)\n\n \n\nRegards\n\n \n\nLorimez"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086838","commentId":1086838,"userName":"ZanzibarLand","timestamp":1400227078,"content":"> Thank you very much for your help.\n> \n>  \n> \n> It certainly takes a long while to find out about how all the packs interact with each other! Surprised FFG hasn't considered some sort of guide for newbies . . .\n> \n>  \n> \n> Think I'll buy the SAGA sets as those follow the story and then I'll also begin investing in the adventure cycles starting with the Mirkwood ones.\n> \n>  \n> \n> Thanks once again - the kind people above have really helped. :-)\n> \n>  \n> \n> Regards\n> \n>  \n> \n> Lorimez\n\nLet us know how you go. Good luck and have fun :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086881","commentId":1086881,"userName":"richsabre","timestamp":1400231975,"content":"I would say...and I don't want to sound ominous here because whatever you buy, you will love it - that the saga quests will be rather difficult with just core set and no adventure packs.\n\n \n\nbut if you don't mind a challenge, then go for it ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1086972","commentId":1086972,"userName":"Mich the One","timestamp":1400242418,"content":"Hey Lorimez. One thing good to know if you are starting: first do not worry if you struggle at first. I was awful at the beginning and was losing almost all the games. It helped to get myself familiar with the game by using the \"easy mode\" (or the \"thematic mode\" as some call it) on the quests that I found unbeatable at the time. Do not be afraid of using the easy mode, it gives you some handicap for the quests for which you might not have the proper cards. And then when you feel stronger you can play the standard rules.Easy mode rules are to be found on the official FFG site for download.\n\n \n\nAs for buying order, I would advise you to buy sets in the order of publishing. This way you are taken on the trip the way it was created. As a rule of thumb, the earlier the quest, the easier they are. And less complex in terms of rules. And the player cards usually complement the quest (not true all the time, but quite often).\n\n \n\nSo if I were you I would buy first the adventure packs from the \"Mirkwood\" cycle. And (if possible) start with the earliest, and follow in order. Apart from the gameplay, there is also a story that unfolds, so it is nice to follow it in order. After you get and play the six \"Mirkwood\" adventure packs you will be already familiar with the game and you will need no guidance :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nBut in any case if a theme of any expansion appeals to you (Saga included) - get it, and do not worry about the order! The only exception is that in the very beginning I would not buy the deluxe expansion \"Heirs of Numenor\" or the Print on Demand special GenCon quests. I found them absolutely too difficult for my beginner games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1087388","commentId":1087388,"userName":"RayLancer","timestamp":1400265080,"content":"I've been playing with the core set for the past few weeks. I've been tempted to jump into Khazad Dum and Darrowdelf due to the characters in that set... And elves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1087404","commentId":1087404,"userName":"Noccus","timestamp":1400265921,"content":"> I've been playing with the core set for the past few weeks. I've been tempted to jump into Khazad Dum and Darrowdelf due to the characters in that set... And elves.\n\nIt's your choice alone really.\n\nKD & dwarrowdelf is a great cycle, I started there too.\n\nBut that was before HoN was out.\n\nYou don't have to buy the packs in order.\n\nClick JCMatos his link for a buying guide to get a better idea on what packs you might want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1087425","commentId":1087425,"userName":"Raven1015","timestamp":1400266989,"content":"> Do you know the difference between all the sets? That link is very helpful but doesn't explain the very basics.\n> \n>  \n\n \n\nThat was a great suggestion. I've added a section on basic information to the buying guide."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106369-new-player-where-would-you-start/?do=findComment&comment=1087698","commentId":1087698,"userName":"ZanzibarLand","timestamp":1400284777,"content":"> > Do you know the difference between all the sets? That link is very helpful but doesn't explain the very basics.\n> \n>  \n> \n> That was a great suggestion. I've added a section on basic information to the buying guide.\n\nAwesome, thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}