{"url":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/","title":"Opinions and Expansion Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085463","commentId":1085463,"userName":"Eru Il\\u00f9vatar2","timestamp":1400135846,"content":"Hello!\n\nTwo quick questions for everyone:\n\n \n\n1) I am strongly considering purchasing and getting into this game (huge Tolkien fan), do you guys recommend it? Why or why not? (Just want opinions because it will cost a fair bit of $$)\n\n2) Can you use new cards from expansions (ie: heroes, encounters, new card types like treasures, etc...) in earlier expansions?\n\n \n\nThanks!\n\nEdited May 15, 2014 by Eru Iluvatar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085506","commentId":1085506,"userName":"Noccus","timestamp":1400141141,"content":"Hi,\n\n1. Yes, BUT: it has a steep learning curve & high difficulty rate. Be ready to lose the first few attempts. If you're ok with that, you'll be fine, as it is a great game and very rewarding when you win.\n\n2. Yes, you can mix it up however you like. The only rule on the player deck is 3 copies per card per deck.\n\nEdited May 15, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085541","commentId":1085541,"userName":"mr.thomasschmidt","timestamp":1400145198,"content":"What noccus said but wanted to add that it is highly possible to play the two player variant as a solo player. What I have experienced with this game (been playing since the start and has everything in it) is that the most time consuming part is the deck building. Maybe not so strange considering it is a deck building game after all ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] I play exclusively solo and always the two player variant and find it great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085640","commentId":1085640,"userName":"richsabre","timestamp":1400153105,"content":"ah! its me ..oh wait, no it isn't :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nfrom a fellow Tolkien obsessed person - I will say just one thing - get this game!! I have collected everything from this game, and have about £500 of cards, and I regret not a single penny of it ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png])) Solo play option, excellent artwork, excellent writing, good knowledge of theme, based on the novel...what else can one ask for? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085882","commentId":1085882,"userName":"7theye","timestamp":1400165212,"content":"I think your second question was answered.\n\nWith the first one it's hard to say. This game has positives and negatives.\n\nIt's a geat co-op game to play with friends if you don't like competitive stuff. It's got a steep learning curve and is very expensive. The core semis incomplete and most gamers have 2-3 sets which is stupid.\n\nUnlike other games such as starvwars etc this game is MUCH more dependant on the expansions. You only get three quests in the core set and the third one is really hard with just the core cards. So you will get bored of them pretty fast. Unlike other games where you can keep playing the same set of cards against different opponents here you only have 1 opponent so it's gets duller from a replay POV. So you need to buy expansions and they are not cheap. Even more expensive is the nightmare stuff that incredibly costs a lot for 15 cards or so on top of needing the core quest. As well, it requires a lot of deck building and isn't pick up and play - if you play in groups you can't teach it easily be I requires a lot of thoughtful deck building.\n\nSo in short it's expensive and you need to buy a lot of expansions or else it gets old fast and requires a lot of deck building and isn't easy to hand to a new gamer to learn.\n\nIf you can stomach this it is truly one of the most rewarding gsme experiences you will have!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085943","commentId":1085943,"userName":"GrandSpleen","timestamp":1400167576,"content":">  most gamers have 2-3 sets which is stupid.\n\n \n\nI'm gonna call you on that and say no, probably \"most\" gamers don't have 2-3 sets.\n\n \n\nYou might get away with saying something like \"many of the gamers who are enthusiastic enough to post on online forums about this game have 2-3 sets.\"  But definitely that is a subset of folks who play the game and may not be so representative of the larger population...\n\n \n\nAh, hyperbole."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1085954","commentId":1085954,"userName":"richsabre","timestamp":1400168138,"content":"I think I did one of my famous (infamous? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) polls on who has what...I mean, that would give an indication to regular posters at least :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086042","commentId":1086042,"userName":"7theye","timestamp":1400172579,"content":"> > most gamers have 2-3 sets which is stupid.\n> \n>  \n> \n> I'm gonna call you on that and say no, probably \"most\" gamers don't have 2-3 sets.\n> \n>  \n> \n> You might get away with saying something like \"many of the gamers who are enthusiastic enough to post on online forums about this game have 2-3 sets.\"  But definitely that is a subset of folks who play the game and may not be so representative of the larger population...\n> \n>  \n> \n> Ah, hyperbole.\n\nIt's very common to have more than 1 set. I was early pointing out that in FFGs greediness they have not given a complete set in one core box"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086126","commentId":1086126,"userName":"Eru Il\\u00f9vatar2","timestamp":1400176535,"content":"Thanks for the answers! Sounds like a friendly player community too  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nWhen you guys say more than one set, are you meaning more than one core set so that you can play with up to 4 people? If so, couldn't you just use a normal piece of paper to keep track of threat points and then only need the one core set?\n\nEdited May 15, 2014 by Eru Iluvatar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086201","commentId":1086201,"userName":"richsabre","timestamp":1400180780,"content":"yes you can haha :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] but it means you have a very limited card pool .... so its basically you can play 4 player if you improvise, but its much more fun with 2 core sets ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nrich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086297","commentId":1086297,"userName":"Eru Il\\u00f9vatar2","timestamp":1400184960,"content":"Alrighty, thanks! What about the expansions though, will you need two of each expansion to play with 4 people too haha!?\n\nEdited May 15, 2014 by Eru Iluvatar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086395","commentId":1086395,"userName":"7theye","timestamp":1400188971,"content":"The core set only has 1 or 2 of some of the really good cards. People that are serious about the game and want to play the harder quests usually buy at least two to get more of the good cards. FFG decided to be greedy and not give us three of each card for purely monetary reasons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086405","commentId":1086405,"userName":"Catastrophic09","timestamp":1400189199,"content":"I would highly recommend getting into this game because it is amazing!!! If you love Tolkien, great artwork, and a super fun game for 1-4 people you should definitely get this game.  It's my favorite and I can't recommend it enough.  Check out these new player guides [http://talesfromthecards.wordpress.com/new-player-guides/] for great resources. I only have 1 core set and am very happy with that as I would rather put money into new packs than duplicating what I have.\n\n \n\nSo YES! get this game!!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086681","commentId":1086681,"userName":"tacomen253","timestamp":1400207163,"content":"> Alrighty, thanks! What about the expansions though, will you need two of each expansion to play with 4 people too haha!?\n\nPretty much yeah. Each expansion comes with 3 copies of each respective card. For most optimal decks each copy of that card is required which means each person will have to get that expansion. If you have 4 people you would need 4 expansions for optimal results. This game can easily get more costly than other card games. If you are willing to pay the cash though this is a great game to get into.\n\n \n\nThe Quest Log is a great feature where you can log the quests you have completed. You can use the Quest Log to review previous quests you have completed to see how can improve, or use it to share and compare quests with friends. This forum is a nice place to go also, most of the people are pretty nice. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086694","commentId":1086694,"userName":"tacomen253","timestamp":1400208346,"content":">  \n> \n> >  most gamers have 2-3 sets which is stupid.\n> \n>  \n> \n> I'm gonna call you on that and say no, probably \"most\" gamers don't have 2-3 sets.\n> \n>  \n> \n> You might get away with saying something like \"many of the gamers who are enthusiastic enough to post on online forums about this game have 2-3 sets.\"  But definitely that is a subset of folks who play the game and may not be so representative of the larger population...\n> \n>  \n> \n> Ah, hyperbole.\n> \n>  \n\nNow as for this comment, I have to defend 7theye here. There is no reason to call people out like that, you could have been a bit more tact. What he said actually has some merit to it, but you call it hyperbole? Do you have any hard evidence of your claim Mr. Spleen?\n\nEdited May 16, 2014 by tacomen253"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1086741","commentId":1086741,"userName":"GrandSpleen","timestamp":1400212686,"content":"Well, sorry if it came off as tactless, you lose a lot on the internet when you strip off tone of voice and meaningful eyebrows.\n\n \n\nBut it was definitely hyperbole.  I was just objecting to saying that \"most\" players own more than 1.  I think at best you can say that \"half\" of all serious players have more than 1 core set.\n\n \n\nI maintain that you can't generalize about the whole player base of the game from the set of die-hard fans who spend their time on forums dedicated to the game.  But if you DO want to do that, check out rich's aforementioned poll [https://community.fantasyflightgames.com/index.php?/topic/83673-poll-how-many-core-sets-do-you-own/] and you've got nearly a 50% split (17 to 20 - 45% to 55%) for \"players who have 1 core set\" vs. \"players who have more than 1.\"  So it's a hard sell to say that most serious players will have more than one.  Unless you are happy with \"most\" simply meaning the slim majority.\n\n \n\nAdd to that number all the players who aren't interested enough to come on to the forum.... you can reasonably assume they'll only have 1 set.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1087305","commentId":1087305,"userName":"tacomen253","timestamp":1400260766,"content":"My interpretation of the poll results shows that there were 20 single core set owners, and that there were 24 multiple core set owners. This shows that multiple core sets was 20% more common than single core sets, or a split of 40-60.\n\n \n\nIn your results you say it was a 17 single core set users, and 20 multiple core set users? That is close to my result, technically 41.18-58.82. So we have very similar results that are leaning towards multiple core set users. The bad thing is that I doubt we that we have enough results to meet the requirements of the central limit theorem, so this poll could be very misleading. So I cannot reasonably assume anything. But neither theory hyperbole. Is it fair to agree to disagree and go have some shots?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1087436","commentId":1087436,"userName":"Noccus","timestamp":1400268148,"content":"Errr, I'm not an American...so do you mean shots as in BANG! BANG! or more like glug glug...CHEERS!!??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1087524","commentId":1087524,"userName":"tacomen253","timestamp":1400274334,"content":"> Errr, I'm not an American...so do you mean shots as in BANG! BANG! or more like glug glug...CHEERS!!??\n\nWell we do love our guns so I can see the confusion, but it means drinking  ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1087786","commentId":1087786,"userName":"GrandSpleen","timestamp":1400292122,"content":"shots it is!  since our numbers don't match up though:\n\n \n\nI was just looking at the results posted on the first post in the thread.  you seemed to have different numbers, did you do something different?  Copy/paste from first post:\n\n1…17\n2…5\n3…12\n4…1\n5…1\n6…1\n\n \n\npeople who have 1 core set: 17.   People with more than 1: 5+12+1+1+1 = 20.   37 total responses.  17/37 = 46% of respondents used only 1 core set.  20/37 = 54% of respondents used 2, 3, 4, 5, or 6 core sets.\n\n \n\nAnyway, it's just a little poll.  37 is not a big number, so even adding 5 respondents could make a significant impact on the %.  And 5 people are.... just 5 people.  Really nothing for generalization about :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1093018","commentId":1093018,"userName":"Morithain","timestamp":1400687770,"content":"Ok, so lot's of people complaining about the cost of core sets, APs, all that.  I say:\n\n \n\nWhatever dudes...have you SEEN how much $$$ people sink into MtG cards?  It's insane.  And for me, this is a far superior game to MtG.  I tried, I mean really tried to get into it.  But it just bored me silly.  The theme is \"over-the-top generic fantasy whatevers\", the game play is typically imbalanced, there's an insane amount of powercreep, and there's absolutely no story or narrative feel to it.  \n\n \n\nI'm a theme player, through and through, and I like to imagine the events of the game playing out in my head--that's whats really enjoyable about this game, is that the setting is clear, coherent and awesome (because TOLKIEN) and the play itself is very easy to visualize except in rare cases (like eagles flying into Moria, or Sam Gamgee being the Steward of Gondor), which are easy to explain away.\n\n \n\nSo, I say go for it, it's a lot of fun, awesome solo and coop play, and you'll love it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106309-opinions-and-expansion-cards/?do=findComment&comment=1095683","commentId":1095683,"userName":"Mich the One","timestamp":1400860593,"content":"> 1) I am strongly considering purchasing and getting into this game (huge Tolkien fan), do you guys recommend it? Why or why not? (Just want opinions because it will cost a fair bit of $$)\n\n \n\nFor a Tolkien fan (and I take form your name that you are quite into the lore) the game is absolutely worth getting for the art and for the positively Tolkienesque climate of the game. Granted, the game might be hard at first. But if you sink some time into it (and some money to expand your card pool) then it rewards you with a well-designed and flexible tool to experience adventures in Middle-earth.\n\n \n\nThe creators of the game respect the lore and seem to me to be very competent with the topics. I find LoTR LCG to be a fantastic extension of the Tolkien experience. You will be able to follow the stories, places and characters you know from the Tolkien canon. But you will also visit in your imagination sites and events that were only hinted or discussed occasionally.\n\n \n\nIf you are mad about Tolkien and generally find board/card games to be your thing, I do not see how you would not love this game."}]}