{"url":"https://community.fantasyflightgames.com/topic/106370-simple-question/","title":"Simple question...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106370-simple-question/?do=findComment&comment=1086373","commentId":1086373,"userName":"Ozil23","timestamp":1400188144,"content":"I have a question about a double action in a round by the same hero. Let's suppose I have a card that lets me ready my character, can I use the character again in the same round?? For example can I:\n\n \n\nGlorfindel with light of valinor: He does'nt exhaust for the first time so can I quest again with him?\n\n \n\nBoromir Tactics: Can I attack an enemy, then ready and attack again to make it 6 attack against that character?\n\n \n\nAny hero with Unexpected Courage: Can I use the hero twice on the same round( either questing or attacking)\n\n \n\nOr with an ally like Faramir, can I exhaust him twice( the second through a card effect) to add +2 to each character??\n\n \n\nVery well that's it, thank you for your consideration\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106370-simple-question/?do=findComment&comment=1086383","commentId":1086383,"userName":"ossderossmane","timestamp":1400188554,"content":"You cannot quest twice and you cannot attack the same opponent twice. Quest and attack or attack  two different enemies is fine. for Faramir, I see nothing specifically prohibiting it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106370-simple-question/?do=findComment&comment=1086529","commentId":1086529,"userName":"DurinIII","timestamp":1400196304,"content":"With unexpected courage you can use the hero twice in the same round. For example, Elrond has an unexhausted unexpected courage attached to him. You quest with Elrond during the quest phase and now he is exhausted. An enemy comes down to fight you. You then exhaust unexpected courage to ready Elrond. Now Elrond exhausts in order to defend against said enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106370-simple-question/?do=findComment&comment=1086659","commentId":1086659,"userName":"tacomen253","timestamp":1400204667,"content":"I agree with the 2 above me. Another thing is that some actions have the \"limit once per round\" text also which means that even if you did ready the card through some special effect you would still not be able to use it if have already used it once that round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106370-simple-question/?do=findComment&comment=1086746","commentId":1086746,"userName":"ZanzibarLand","timestamp":1400212962,"content":"I was accidentally doing this same thing when I first started. You need to think of it a little differently.\n\nWhen you have enemies engaged with you, you select one as the attacker, select a defender, resolve. Continue till you have no more attacking enemies.\n\nThen you choose an enemy to attack, assign attackers, resolve. Again, continue until all enemies have had assigned attackers. Whether they survived or not.\n\nYou would ready between where I've said 'continue' but the enemy is spend for that turn regarding either being defended against or attacked.\n\nI'll just keep an eye on this, if someone with experience could tell me I'm right in thinking this."}]}