{"url":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/","title":"Kahzad-dum - narrow paths","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/?do=findComment&comment=1087627","commentId":1087627,"userName":"player723290","timestamp":1400280091,"content":"Hi guys,\n\nCan someone explains me the dinamics of this quest?\n\nWhen Revealed: Each player chooses 1 questing character he controls. Each questing character not chosen does not count its willpower until the end of the turn. Forced: After placing the 1st progress token on Narrow Paths, search the encounter deck and discard pile for Abandoned Tools and add it to the staging area, if able. Players may bypas this quest card at the end of the combat phase.\n\nOnly a character counts his willpower, So why should I use more than one hero in My quest?\n\nI don't understand..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/?do=findComment&comment=1087781","commentId":1087781,"userName":"GrandSpleen","timestamp":1400291615,"content":"It sounds like you are looking at side 2B before you decide who will commit to the quest.  \n\n \n\nIn Flight from Moria, you aren't supposed to flip the quest card to side 2B until after you have committed characters to the quest.  So, at the time that you are deciding who will quest, you are looking at side 2A of this card and don't know what quest you will be facing.  If you get \"Narrow Paths\" it's tough luck -- any heroes you have questing won't contribute, except for the one you choose.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/?do=findComment&comment=1087980","commentId":1087980,"userName":"player723290","timestamp":1400324088,"content":"Ok, it's all clear now\n\nThanks...\n\nVery difficult when you have a lot of victory points!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/?do=findComment&comment=2612646","commentId":2612646,"userName":"Randyman","timestamp":1485548354,"content":"Furthermore, when you claim the Abandoned Tools as a result of putting a progress token on Narrow Paths, do you also pull an Encounter Card to attach to, and 'guard' the tools? ... or does this objective remain unguarded since it was not 'revealed'? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106459-kahzad-dum-narrow-paths/?do=findComment&comment=2612805","commentId":2612805,"userName":"PocketWraith","timestamp":1485555382,"content":"Guarded only triggers if the card is revealed, that was ruled on somewhere."}]}