{"url":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/","title":"Legacy of Numenor is amazing.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087506","commentId":1087506,"userName":"MyNeighbourTrololo","timestamp":1400273153,"content":"Just FYI. Been playing multiplayer games with the Leadershit player having it in their deck and it was awesome. It gives you so much needed early kick and is totally worth the threat, even for high threat decks like mine tactics. \n\n \n\nLess effective in threat-heavy and objective-oriented quests(those you can pass only by fulfilling something specific, other than achieving progress on the quest card), but in a regular beat-it-up quest it's just a must have.\n\n \n\nDesclaimer: This thread exists because some people expected a lot from this card but were utterly dissapointed at the release. I didn't expected much from it, but now I'm a fan.\n\nEdited May 16, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087710","commentId":1087710,"userName":"DurinIII","timestamp":1400285277,"content":"It's a very intriguing card that I haven't played yet. Thanks for the positive information!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087771","commentId":1087771,"userName":"Sinamil2","timestamp":1400291016,"content":"I think the card is amazing as well, for 4 threat you can have what amounts to an extra planning phase (minus the card draw).  I actually took it out of my Dain/Ori/Thalin on OCTGN because I was demolishing scenarios (including a few nightmare quests) when I drew it with Legacy of Durin in my opening hand.  Not sure how someone could be disappointed, any less as far as threat cost and it would be way OP, maybe even on par with SoG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087861","commentId":1087861,"userName":"Glaurung","timestamp":1400301260,"content":"Yes sure this card is really cool with 4 players since your first round can be very effective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087902","commentId":1087902,"userName":"leptokurt","timestamp":1400308427,"content":"It's also cool for solo players for the reasons mentioned. It's a situational card that I don't play everytime, but there are points in a game where these extra resources can be crucial."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087903","commentId":1087903,"userName":"lleimmoen","timestamp":1400308449,"content":"I have been one of those who expected the world of it -- it seemed natural this card would be a win -- but my experience is very different from the OP. So far, all the decks have been doing better without the card that with it. I will not give it up on the card, I think it must be good, but it is trying its best to prove otherwise. It is also that I do not change decks for quests, so if it works well in one but is obstractive in another, it is not great for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087904","commentId":1087904,"userName":"lleimmoen","timestamp":1400308570,"content":"> It's also cool for solo players for the reasons mentioned. It's a situational card that I don't play everytime, but there are points in a game where these extra resources can be crucial.\n\nI find the doomed cards working better solo with Strider. I mean my coop games are quick but still, Tactics start at 30+ usually, you play a few doomed cards and their hitting 40, encounter plays a few tricks and you can be staring 50 in the eye on round 5 or 6 which the game hardly ever lasts less."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1087937","commentId":1087937,"userName":"richsabre","timestamp":1400314778,"content":"yes, I agree - strider and doomed is what I have been running since getting Voice. Put in some threat reduction and that 4 threat isn't so bad :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1088183","commentId":1088183,"userName":"ricedwlit","timestamp":1400349429,"content":"With the new Doomed cards I find that Gandalf (from Core) is almost always being used for threat reduction.  This is such a turn from when the game first came out when I almost exclusively used him for dealing damage (I'm looking at you, Troll)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1088552","commentId":1088552,"userName":"Kerstoid","timestamp":1400377817,"content":"I think that playing with Legacy of Númenor should be called Intermediate Mode.\n\n \n\nNormal Mode = 1 starting resource, no difficult card removal\n\nEasy Mode = 2 starting resources, difficult cards are removed\n\nIntermediate Mode = 2 starting resources, no difficult card removal, +4 threat\n\n \n\nIt can be quite powerful, especially in the first hand!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1089059","commentId":1089059,"userName":"Pharmboys2013","timestamp":1400430963,"content":"I at first thought the raise of 4 was too high but after using the card it is certainly justified, I've had a lot of success with the card and not just with decks running Strider either"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1089275","commentId":1089275,"userName":"awp832","timestamp":1400442521,"content":"I've found it's a card thats use is entirely dependent on when you draw it.   4 Threat for a turn-1 extra resource boost?  Yes please.  But 4 threat for 1 resource per hero when you're on like turn 5 just doesn't seem that impressive anymore.   If you want to run this card you almost have to run 3 of them just so you're as likely as possible to draw it in your opening hand, (or you could run the Seeing Stone, but then it's effectively 5 threat), and then your other 2 copies of it are pretty dead draws.  \n\nLegacy of Numenor is definitely something to play if you have a smart way of massive threat reduction,  such as Strider or Elrond's Council.   I don't think I would use the card outside of that.   If you're playing multiplayer you really need to have threat reduction covered across the board.   One Strider on the table isn't going to cut it.\n\nOverall.   it's not bad,  but I think Ancient Knowledge and Power of the Orthanc are the all-stars of the Doomed cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106449-legacy-of-numenor-is-amazing/?do=findComment&comment=1089856","commentId":1089856,"userName":"ana4","timestamp":1400492605,"content":"I mostly agree with the above, I do not find it straightforward at all. Still, sometimes it can actually be better to play the card right in the end when you know if you quest through this quest phase you win, and if you do not you get swallowed by shadow. In a similar way, some quests really punish you early for going over certain threshold, and three extra resources may not save you.\n\n \n\nAs for coop, yes, it is much harder to work with the threat reduction, but the boost may be more powerful as different decks can overpower the odds in different ways thanks to added resources."}]}