{"url":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/","title":"Balancing Tactic","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091339","commentId":1091339,"userName":"EclatK","timestamp":1400587870,"content":"Hello people,\n\n \n\nAs much as I like tactic, I find them to much monopurpose.\n\nThey should be able to do a bit more than just smashing things.\n\n \n\nSo yeah, they do this great, but they, in my opinion, lacks some balance.\n\n \n\nI d'like to compare it to spirit, which is the total opposite of tactic.\n\nSpirit quest really well, but they have some realy cool other heroes with nice utility power that are fun to play. More, they even have some fighter heroes, (or that are not bad in combat).\n\n \n\nBut for tactic, I think they could use a very cheap heros that could eiser bring some nice utility power (some treat reduction, or damage prevention) or that could could significantly improve questing. Making tactic more viable as a mono tactic deck, or just more diverse.\n\n \n\nSo, what do you thing about this, and do you have some ideas on how to balance tactic?\n\n \n\nAs usual, english is not my native language and I am sorry for all the mistakes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091340","commentId":1091340,"userName":"richsabre","timestamp":1400587988,"content":"well, its not really balancing, as it keeps them for the single purpose of smashing enemies, but I pair them with a questing deck and play two handed. usually a spirit lore deck, or spirit lore leadership\n\n \n\nhowever, legolas with blades of gondolin is a good way to make some progress (literally) instead of just killing enemies ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091341","commentId":1091341,"userName":"MyNeighbourTrololo","timestamp":1400588154,"content":"> well, its not really balancing, as it keeps them for the single purpose of smashing enemies, but I pair them with a questing deck and play two handed. usually a spirit lore deck, or spirit lore leadership\n> \n>  \n> \n> however, legolas with blades of gondolin is a good way to make some progress (literally) instead of just killing enemies ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI would say \"while\" instead of \"instead\"  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091344","commentId":1091344,"userName":"ZanzibarLand","timestamp":1400588320,"content":"More cards like Trained for War is a good straight. I've never used the card but I can imagine it would help a lot. Definitely not a full 'fix'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091356","commentId":1091356,"userName":"Rapier1","timestamp":1400588810,"content":"The major problem for tactics is that it excels at an area of the game which every other sphere also can do.\n\nSpirit and Lore both have clear niches. Leadership is less obvious but it's primarily to do with underlying mechanics of the game like resource manipulation.\n\nTactics is supremely good at fighting - but it isn't good enough that you have to have tactics (the other spheres can all fight almost as well, and defend almost as well). It does need something to be it's own.\n\nSiege and Battle mechanics were a good idea for tactics to let them use what they're good at to do things that other sphere could do. I feel like Tactics just lacks a dimension compared to the other spheres even though it's my favorite.\n\nIt needs something new but also at the fundamental level, which is very difficult to add in retroactively. Personally I think that tactics rather than spirit, should have had the shadow card cancellation theme and then it would probably have been okay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091431","commentId":1091431,"userName":"Distractionbeast","timestamp":1400592680,"content":"> The major problem for tactics is that it excels at an area of the game which every other sphere also can do.\n> \n> Spirit and Lore both have clear niches. Leadership is less obvious but it's primarily to do with underlying mechanics of the game like resource manipulation.\n> \n> Tactics is supremely good at fighting - but it isn't good enough that you have to have tactics (the other spheres can all fight almost as well, and defend almost as well). It does need something to be it's own.\n> \n> Siege and Battle mechanics were a good idea for tactics to let them use what they're good at to do things that other sphere could do. I feel like Tactics just lacks a dimension compared to the other spheres even though it's my favorite.\n> \n> It needs something new but also at the fundamental level, which is very difficult to add in retroactively. Personally I think that tactics rather than spirit, should have had the shadow card cancellation theme and then it would probably have been okay.\n\nI get your point, but I don't totally agree.  Tactics does have some fairly unique power, especially in the realm of combat, and while other spheres can do it, as a general rule they can't do it as well.\n\n \n\nExamples:\n\n \n\nGondorian shield - best single defense card evar.  \n\nRivendell Blade - very few other means to repeatedly bypass defense to deal damage (Mirkwood Runner and some events, but all are less reliable/powerful)\n\nLegolas - and Blade of Gondolin - only reliable means of gaining progress by fighting.  I've splashed tactics just to include him because of the frequency of combat in some scenarios.  You just can't get this kind of benefit elsewhere.\n\nFeint - best delay tactic for combat.  Cheap, no drawbacks, no special conditions.\n\nGimli - reliable high-damage-dealer with the Dwarf trait.  No other hero can so easily and naturally achieve his attack power permanently.  He's an archery sponge.  Give him Citadel Plate (tactics) and a Dwarven Axe (tactics) or a Khazad Khazad (tactics) to give him some unbelievable strength.\n\nBeregond - 4 defense.  Sentinel.  Gondor.  Discounted attachments.  Nuff said.\n\n \n\n \n\nWhile I do agree that tactics feels a bit flat compared to other spheres, I don't think it's really balance that it needs.  It does basically one thing, but it does it far better and more easily than any other sphere.  As long as most scenarios feature combat as prominently as they have lately, I think Tactics will continue to be a strong pillar of deckbuilding - even if there is no specific need to fill.\n\n \n\nThe enemies have gotten tougher and stronger over the course of the game, which makes it harder and harder for the other spheres to keep up on their own.  I've found that I generally need Tactics to some degree to win most scenarios.  \n\n \n\nAs for the idea of shadow cancellation belonging to tactics, I disagree.  I like some of the combat support being split up - like shadow manipulation and healing.  Otherwise, Tactics would dominate too much of the game.  Combat is practically half of the game mechanics (with questing being the other half)!  It must be divided if you want to keep all spheres equally invested.\n\nEdited May 20, 2014 by Distractionbeast"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091461","commentId":1091461,"userName":"Morithain","timestamp":1400593937,"content":"Combine the Hammer-Stroke and Hama-Thicket of Spears recycle and you effectively nullify pretty much all enemies in the game for several turns if not indefinitely.  It's pretty beastly.  Add Théoden and your tactics heroes can actually quest decently too.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091476","commentId":1091476,"userName":"Bullroarer Took","timestamp":1400594672,"content":"In my opinion Tactic's weakness comes from the basic framework of the game. First, you have to Quest on every turn, but you don't necessarily have to fight every turn. And second, the first part of combat, defending, is so often handled by the chump blocker at no penalty.\n\nBattle and Siege did give tactics a boost, but they can't keep going to that well, and they will probably never change the victory point scoring to \"add five points for each dead ally\", but it would change the way people play if they did."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091523","commentId":1091523,"userName":"Distractionbeast","timestamp":1400596799,"content":"> In my opinion Tactic's weakness comes from the basic framework of the game. First, you have to Quest on every turn, but you don't necessarily have to fight every turn. And second, the first part of combat, defending, is so often handled by the chump blocker at no penalty.\n> \n> Battle and Siege did give tactics a boost, but they can't keep going to that well, and they will probably never change the victory point scoring to \"add five points for each dead ally\", but it would change the way people play if they did.\n\n \n\nThat's interesting.  When I play, I generally deal with combat on every turn (in most scenarios).  A bad round of questing doesn't usually lose the game, while a bad round of combat can.  In some cases, I'll skip questing on the first round to dedicate more resources to combat and try to clear out the staging area for more productive questing in future rounds.\n\n \n\nIn those few scenarios that are not combat-heavy, I will attempt them without Tactics, but most scenarios feature enough that it's almost necessary.\n\n \n\nNot to degenerate your point - this is just my experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091858","commentId":1091858,"userName":"Rapier1","timestamp":1400609455,"content":"Distractionbeast, you do raise a good alternative.\n\nInstead of making Tactics work at something else, we could go for the option of making it so the combat that other spheres can do isn't really good enough (example: harder enemies).\n\n \n\nHowever I feel that you risk creating a sitatuation where people then start to feel (Exactly as you said) that tactics is necessary.\n\n \n\nIf we balance the combat so that tactics superior combat ability is necessary to get through quests then we'll severely hamper deck building (similar to how Eowyn's far superior questing ability in the core set makes it hard to play without her).\n\nThis would certainly work to keep tactics relevant and special, but I think that it would be poorer for the game in general. Which is why I would prefer tactics to be rounded out into some new avenue that only it gets.\n\nI'm just not sure what it would be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091865","commentId":1091865,"userName":"Noccus","timestamp":1400609924,"content":"Tactics should get cards that can remove a location from the game in staging area or something.\n\nThis should be limited to some traits on a location, otherwise it would be too powerful.\n\nThematically this can be a catapult destroying a fort or ruin, or a forest or field that is set on fire or something by exhausting a hero.\n\nThis would not give you progress directly, but does help with the threat management."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091902","commentId":1091902,"userName":"Distractionbeast","timestamp":1400611396,"content":"> Distractionbeast, you do raise a good alternative.\n> \n> Instead of making Tactics work at something else, we could go for the option of making it so the combat that other spheres can do isn't really good enough (example: harder enemies).\n> \n>  \n> \n> However I feel that you risk creating a sitatuation where people then start to feel (Exactly as you said) that tactics is necessary.\n> \n>  \n> \n> If we balance the combat so that tactics superior combat ability is necessary to get through quests then we'll severely hamper deck building (similar to how Eowyn's far superior questing ability in the core set makes it hard to play without her).\n> \n> This would certainly work to keep tactics relevant and special, but I think that it would be poorer for the game in general. Which is why I would prefer tactics to be rounded out into some new avenue that only it gets.\n> \n> I'm just not sure what it would be.\n\n \n\nI can see that.  I wasn't advocating making enemies tougher.  I was observing that they have been getting tougher.  Based on my recent experiences, Tactics is balanced due to the rising difficulty of enemies in general.  \n\n \n\nAt a high level, I think this is a dangerous trend - it creates so much upward progression in combat difficulty that earlier quests become ridiculously easy and later ones require more and more specific strategies to overcome.  \n\n \n\nActually, instead of trying to add additional mechanics to Tactics, I'd rather if it just slowed down the power creep.  Instead of permanent defense and attack upgrades, provide more situational or temporary ones.  Make tactics work to manipulate the battlefield to get the most out their cards.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1091973","commentId":1091973,"userName":"player1761766","timestamp":1400613826,"content":"I have to say that I tend to do without Tactics, my decks are exclusively lore/spirit/leadership combinations. Rapier's point about tactics' specialty being possible in the other spheres is something I heartily agree with - while I do include certain weapons that are brought out with song of battle or narvi's belt, by and large I've pretty much left the sphere alone since the early days. To the point where I don't know the cards nearly as well as I do for the other three. It's a bit sad, really, because a significant chunk of each new release I effectively ignore, as I can usually play without it.\n\n \n\nI would like to see something else for the sphere to do - my first thought was something like ally manipulation, reflecting a marshalling of the troops or something - but as Distractionbeast suggests, what tactics does so well is a significant part of the game, defending and attacking. To give them anything else seems to overload the sphere, and would potentially tip the balance of abilities that are currently shared out. \n\n \n\nI should probably give Tactics another look, that is one massive stack of cards that is not getting used..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1092086","commentId":1092086,"userName":"Bullroarer Took","timestamp":1400617095,"content":"When Glaurung starts playing Tactics I will know it has turned the corner."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1092136","commentId":1092136,"userName":"Nickpes","timestamp":1400619534,"content":"I have won nearly all quests using solo mono tactics deck. (Not tried VoI, have not yet managed to win Dol Guldur, Return to Mirkwood, the quest with the snowstorms, lake town ... I think thats all). It is not that hard to do, you just need to find the way to use your cards. I used Legolas, Hama and Beregond as heroes. Trained for war and Legolas with blade of Gondolin where the most important cards. Once i quested with 32!!! Using trained for war to win massing at osgiliath.\n\nI am planning to try using Theoden, Hama and maybe Legolas or Merry, in the second option Merry will quest and the others will do the rest. Hama is a card you must have to be able to recycle trained far war or thicket of spears (which leaves your heroes open to do other stuff)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1092726","commentId":1092726,"userName":"EclatK","timestamp":1400671830,"content":"I totaly agree with rapier on this.\n\nBut my aim is to make tactic a bit less specialized. As stated before, the other sphere can do pretty everything without tactics whereas tactic cannot.\n\n \n\nIt seems possible to quest with mono tactic, but, I really just don't like the fact that tactic will only be the fighter.\n\n \n\nThey could have some healing ability or some allies manipulations, to give them the possibility to interact with more aspect of the games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1092877","commentId":1092877,"userName":"wizerdrea","timestamp":1400682269,"content":"I personally think that tactics is fairly good but I do also agree that it could use a little bit more since it does see to be a little more specialized and less diverse than the other spheres.  I think that all we need to do to see what tactics might need is to look no further than the name.  When looking up tactics in a dictionary I got: Tactic an action or strategy carefully planned to achieve a specific end.  I think that all tactics needs is to be more tactical.  We do have some of that already with the really powerful event but I definitely think that tactics could use a little more.  I have a couple of ideas that I think could be fun in tactics.  Since a tactic is \"an action or strategy carefully planned\"  I think it would be fun to have a few more planning phase actions to provide the feeing of actually planning although not to many because I think that would make tactics really awful and not fun to play, but a few here and there could be really fun in my opinion.  How ever I also think that to use proper tactics you need to be able to act quickly without much warning in order to act before the enemy does and not be destroyed.  I think their are already some cards that do this like Quick Strike, Straight Shot, and Swift Strike but I definitely think that tactics could use a few more.  Another thing I thin tactics could use is more cards like Stand Together and Keeping Count which allow your characters to work together.  If I was a military tactician I think I would spend a lot of time trying to coordinate different units together and actual have an army of solders working together rather than just a bunch of men with swords.  I don't think that tactics has very many thins that actually allow your characters to work together as units and I would really like to see more cards like this.  When facing an enemy it is important to realize when a strategic retreat or maneuver is required in order to avoid the main force of the enemies onslaught.  Cards such as Feint and Thicket of Spears can represent these maneuvers.  To many more cards like this could make tactics overpowered, but a few more could be really nice.  I agree with the idea some people have already mentioned of allowing tactics to manipulate the battlefield because if you think about it if I was devising tactic for and army part of m plans would involve putting the enemy exactly where I want them.  We already have a few cards like this.  The Hammer-stroke is one such card and Trained for war is another, although it might not seem it, because it forces the enemy to face you in battle.  My last idea for tactics is to get a few more cards like Gondorian Discipline that allow you to respond the the worst.  I think some more card like this would be nice because there are not really an cards except this one that allow you to cancel damage and if I was tactics in my battle plan I would be prepared to at the last minute save someone from getting killed.  I do not think that these cards would necessarily represent someone healing the solder but would rather represent a character avoiding injury at the last moment do to proper planning and action. \n\n \n\nThose are all of my ideas for tactics.  I would like to see some of these in future releases.  Although I do realize that if the tactics sphere got all of these thing it would probably be overpowered but I would like to see some of these ideas and concepts appear more in tactic, because right know I don't feel like tactics is very tactical.  Maybe it is just because I fail to use it right or see the power of the cards, but to me tactics kind of feels like brute force rather than carful planning and using tactics.  To me when you are playing tactic you are basically defending and attack with a big defensive character and then attacking with a strong character loaded up with weapons no tactical planning needed.  I does sometimes feel like you had flashes of tactical brilliance when you play a good event that is just perfect for the particularly moment but it does not feel like you are using tactics and tactical planning most of the time but rather brute force.  That said I really do like the sphere and love and enjoy many of the cards.  In fact I think that one of the beast cards in the entire game is in tactics, Landroval (and I do think that Landroval represents a good example of a card representing tactical strategy).\n\nEdited May 21, 2014 by wizerdrea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1093294","commentId":1093294,"userName":"EclatK","timestamp":1400698620,"content":"I really like your comment, it realy fit this tread. I too feel that when playing tactic, it is more rewarding in efficiency to have a strong defense and strong offense than trying to outsmart the oppenent with real tactic.\n\n \n\nWe could imagine some event that would be linked to location keyword.\n\nLike if you are fighting in a forest, you can create an ambush and gives the opportunity to attack any opponent of the board.\n\n \n\nIn rocky mountain, you could choose how many oppenents attack this round.\n\n \n\nIn clear field you could prevent shadow.\n\n \n\nThose events would be linked to the battlefield which would make them more immersive and more situationnal.\n\n \n\nI'd like too see cards with multiples effect that you can choose depending of the situation, a bit like miruvor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1093435","commentId":1093435,"userName":"Distractionbeast","timestamp":1400703158,"content":"Some random ideas:\n\n \n\nBrilliant Execution (event) Cost: 2\n\nAction:  Place 1 progress token on the current quest for each enemy destroyed this phase.\n\n \n\n \n\nNo Rest for the Weary (event) Cost: X\n\nX equals the number of players in the game.  \n\nQuest Action: For each enemy revealed by the encounter deck this phase, you may ready 1 ally you control.\n\n \n\n \n\nCut Off (attachment) Cost: 1\n\nAttach to an enemy in the staging area.  The first shadow card dealt to the attached enemy each phase is discarded without resolving.\n\n \n\nDeep Wound (attachment) Cost: 1\n\nAttach to an enemy with at least 1 damage.  Attached enemy gets -2 (attack power).\n\n \n\n \n\nAnswering the Call (event) Cost: 1\n\nAction:  Until the end of the phase, all tactics characters gain Sentinel.\n\n \n\n \n\nEnemy of the Shadow (unique) (attachment) Cost: 3\n\nAttach to a tactics hero.  Attached hero gains +1 willpower for each point of damage on him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1093579","commentId":1093579,"userName":"booored","timestamp":1400709102,"content":"> So, what do you thing about this, and do you have some ideas on how to balance tactic?\n\nBalance? There is strong arguments tactics in imba. In multiplayer tactics decks are so strong it is sorta insane. Still I think tactics is fine as it is. They have put some effort to allow it to run better for solo plays, as in real solo players not that retarded two handed crap. The addition of Outlands really allows Solo tactics decks to pull in some powerful quest power now for a tiny spirit splash for example.\n\nIf your limiting your builds to full mono you are going to have problems, but that isn't the spheres problem it is yours. Why limit your self to solo spheres? There are plenty of strong mainly tactics decks for solo players, and for multiplayer tactics shine as ubr powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1093635","commentId":1093635,"userName":"Raven1015","timestamp":1400711817,"content":"I like the idea of planning action events for Tactics to represent setting battle tactics in advance. These could work kind of like plots in Game of Thrones, as they could give you some advantages and some possible disadvantages. Something like a defensive formation that gives you defensive bonuses, but at the expense of attack. Playing these during planning would require you to make plans without perfect information (unless you have scrying available), which makes thematic and gameplay sense.\n\n \n\nFor my two cents, I think Tactics is fine as is. It takes care of combat very well, which is a whole big portion of the game. Sure, you can often do without it in solo play, but it can be invaluable in multiplayer to deal with hordes of enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1093834","commentId":1093834,"userName":"PsychoRocka","timestamp":1400725624,"content":">  \n> \n> > So, what do you thing about this, and do you have some ideas on how to balance tactic?\n> \n> Balance? There is strong arguments tactics in imba. In multiplayer tactics decks are so strong it is sorta insane. Still I think tactics is fine as it is. They have put some effort to allow it to run better for solo plays, as in real solo players not that retarded two handed crap. The addition of Outlands really allows Solo tactics decks to pull in some powerful quest power now for a tiny spirit splash for example.\n> \n> If your limiting your builds to full mono you are going to have problems, but that isn't the spheres problem it is yours. Why limit your self to solo spheres? There are plenty of strong mainly tactics decks for solo players, and for multiplayer tactics shine as ubr powerful.\n> \n>  \n\n\"retarded two handed crap\"\n\nNo respect at all for other players, ah well you wont get any either then.\n\n \n\nEdited May 22, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1094271","commentId":1094271,"userName":"Mndela","timestamp":1400766527,"content":"If there is a balanced mono-tactics solo deck, it would be the most powerful deck. If tactics could quest good without problems, there isn't any orc that want to combat against it.\n\n \n\nI think the game has a good balance atm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1094331","commentId":1094331,"userName":"Distractionbeast","timestamp":1400768866,"content":"I was just thinking - what if tactics adopted an additional mechanic (limited use) where bonuses could be gained in combat by flipping and discarding cards from your deck and doing a cost or type check?  Basically mirroring the shadow card mechanic from the enemies.  \n\n \n\nIt would be manipulatable with the right splash cards, but I could see that being an interesting risk/reward mechanic.\n\n \n\nexample:\n\n \n\nevent Cost: 1\n\nAction:  Discard the top card of your deck to give +X attack power to a tactics hero until the end of the phase.  X is the cost of the discarded card.  (limit once per phase)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1094484","commentId":1094484,"userName":"Johnny Awesome","timestamp":1400775805,"content":"IMO no major changes are needed for Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1095550","commentId":1095550,"userName":"booored","timestamp":1400854717,"content":"> If there is a balanced mono-tactics solo deck, it would be the most powerful deck.\n\nNot really.\n\n \n\nStill you can do ma near mono tactic deck running a small spirit splash using outlands to power the questing. While solo decks required the splash to be tactics, you can not make a winner deck that can crush most scenario where almost every card is tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1095622","commentId":1095622,"userName":"scottindeed","timestamp":1400858011,"content":"\"retarded two handed crap\"\n\n \n\nThis is the second thread I've opened where you've used that vulgar term for a style of play that I enjoy immensely.  Please try to have respect for others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1097743","commentId":1097743,"userName":"JsBingley","timestamp":1401068467,"content":"> I have won nearly all quests using solo mono tactics deck. (Not tried VoI, have not yet managed to win Dol Guldur, Return to Mirkwood, the quest with the snowstorms, lake town ... I think thats all). It is not that hard to do, you just need to find the way to use your cards. I used Legolas, Hama and Beregond as heroes. Trained for war and Legolas with blade of Gondolin where the most important cards. Once i quested with 32!!! Using trained for war to win massing at osgiliath.\n> \n> I am planning to try using Theoden, Hama and maybe Legolas or Merry, in the second option Merry will quest and the others will do the rest. Hama is a card you must have to be able to recycle trained far war or thicket of spears (which leaves your heroes open to do other stuff).\n\nI use Theodon, Merry and Legolas with Eagle theme to solo, Theodon and Merry have 6 will power, and it's OK in most situation, if I can survive the first few turns with Radagast, \"horn of Gondor\" or 1-2 resourceful, it will be easy in the later game, because of ealges of misty mountains, 6 Gandalf(Gandalf+born aloft, even \"to the eyrie\"), and \"trained for war\"+map for emergency.\n\nEdited May 26, 2014 by JsBingley"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1098034","commentId":1098034,"userName":"DurinIII","timestamp":1401110640,"content":"Yeah. The advent of Theoden has made the solo Tactic deck much more possible. But, solo Tactics is still the hardest to win with of all the spheres namely because of a lack of quest-able allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1098515","commentId":1098515,"userName":"Serazu","timestamp":1401143392,"content":"> How ever I also think that to use proper tactics you need to be able to act quickly without much warning in order to act before the enemy does and not be destroyed.  I think their are already some cards that do this like Quick Strike, Straight Shot, and Swift Strike but I definitely think that tactics could use a few more.\n\n \n\nThere is also this excellent card:\n\n \n\nhttp://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/shadow-and-flame/hands-upon-the-bow-saf [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/dwarrowdelf/shadow-and-flame/hands-upon-the-bow-saf]\n\n \n\nAs for questing, introducing a hero (a military genius or plain simply a militarist) who, at a cost, be it spending resources, discarding or exhausting (though the latter perhaps should be avoided, as there are several cards already available to provide standing), (s)he adds either \"battle\" or \"siege\" in the current quest, would surely help the sphere in the questing aspect. What is more important is that a hero with such an ability would probably be unimportant in melee games, since (s)he would cause frustration to other players who utilize other spheres (mainly spirit), but would really help things in solo games where tactics, let's accept it, is the weakest of the spheres.\n\nEdited May 26, 2014 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1098613","commentId":1098613,"userName":"Ihavebadluck","timestamp":1401149386,"content":"not sure if this was mentioned but theoden + merry = decent questing theodens ability (assuming it applies to him as well) gives both 3 willpower. then if you (assuming you want all tactics) take hero beorn you can block and attack until you get the allies necessary to defend yourself (preferably defender of rammas) and "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1099514","commentId":1099514,"userName":"Distractionbeast","timestamp":1401215337,"content":"> As for questing, introducing a hero (a military genius or plain simply a militarist) who, at a cost, be it spending resources, discarding or exhausting (though the latter perhaps should be avoided, as there are several cards already available to provide standing), (s)he adds either \"battle\" or \"siege\" in the current quest, would surely help the sphere in the questing aspect. What is more important is that a hero with such an ability would probably be unimportant in melee games, since (s)he would cause frustration to other players who utilize other spheres (mainly spirit), but would really help things in solo games where tactics, let's accept it, is the weakest of the spheres.\n\n \n\nNice idea.  What if it only affected the player who activates the ability?  Like, until the end of the phase, characters you control can use (attack) instead of (will)...  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1099538","commentId":1099538,"userName":"Serazu","timestamp":1401216750,"content":">  \n> \n> > As for questing, introducing a hero (a military genius or plain simply a militarist) who, at a cost, be it spending resources, discarding or exhausting (though the latter perhaps should be avoided, as there are several cards already available to provide standing), (s)he adds either \"battle\" or \"siege\" in the current quest, would surely help the sphere in the questing aspect. What is more important is that a hero with such an ability would probably be unimportant in melee games, since (s)he would cause frustration to other players who utilize other spheres (mainly spirit), but would really help things in solo games where tactics, let's accept it, is the weakest of the spheres.\n> \n>  \n> \n> Nice idea.  What if it only affected the player who activates the ability?  Like, until the end of the phase, characters you control can use (attack) instead of (will)...  \n> \n>  \n\n \n\nEven better. This way, (s)he would be applicable in multi games, as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1099910","commentId":1099910,"userName":"ZanzibarLand","timestamp":1401235840,"content":"I like this idea. Sounds awesome and totally realistic for tactics. Any notable tacticians in LOTR?\n\nI just had a thought, tell me what you guys think. An attachment that does the same, title, 2 cost of something, can only be played if all heroes are tactics? It's a bit like Prepare for war, but still. I like the attachments a lot, how as spirit Glorfindel is better with light of valinor, and Elrond is better with Vilya.\n\nIf you can attach Visionary leadership to someone, I'm sure you can attach battlefield tactician."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1100245","commentId":1100245,"userName":"Serazu","timestamp":1401269896,"content":"> I like this idea. Sounds awesome and totally realistic for tactics. Any notable tacticians in LOTR?\n\n \n\nGrimbold [http://en.wikipedia.org/wiki/Grimbold] for instance. Note that not only did he excel at defending the Fords (hence the \"Siege\"), but he also organized the break out and the ensuing counter-attack (hence the \"Battle\").\n\n \n\nConsidering your idea, I like it and consider it necessary to aid tactics in the questing aspect. I believe it would be better to be given a hero to do this though. A hero is always more robust and trustworthy than an attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106717-balancing-tactic/?do=findComment&comment=1101736","commentId":1101736,"userName":"ZanzibarLand","timestamp":1401367982,"content":"> > I like this idea. Sounds awesome and totally realistic for tactics. Any notable tacticians in LOTR?\n> \n> Grimbold [http://en.wikipedia.org/wiki/Grimbold] for instance. Note that not only did he excel at defending the Fords (hence the \"Siege\"), but he also organized the break out and the ensuing counter-attack (hence the \"Battle\").\n> \n> Considering your idea, I like it and consider it necessary to aid tactics in the questing aspect. I believe it would be better to be given a hero to do this though. A hero is always more robust and trustworthy than an attachment.\n\nI was thinking attachment more so for two reasons.\n\nHaving a more versatile attachment for than a new hero for just this reason. But heroes having a clear role (Beregond) isn't a bad thing any.\n\nAnd, I thought it could breathe new life into existing heroes, but 2/3 reused old heroes is still good. If you wanted to make a tactics rohan deck but couldn't cos the new tactician is Gondor, I wouldn't be that fussed, but theme is very important to some people.\n\nEdited May 29, 2014 by ZanzibarLand"}]}