{"url":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/","title":"Heroes you never play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091602","commentId":1091602,"userName":"Khamul The Easterling","timestamp":1400599681,"content":"Look through your hero cards.....which ones are you like \"wow It's been ages since I've used him!\"  This isn't a \"what is the worst hero\" question, instead it's a \"what is a hero you don't like or don't play\"\n\nFor me it has to be:\n\n \n\n1. Oin - I never liked his ability....it's not bad, its just something I don't like to build a deck around\n\n \n\n2. Elladan & Elrohir - They are so simple that they aren't very interesting or fun to me\n\n \n\n3. Beorn - He's good and fun.  For whatever reason though, I think I've only used him once ever which was when I first got Over Hill a long time ago...\n\n \n\nBerevor - When you use her, you might as well have 2 heroes and a boon that reads \"Draw 2 cards each round\"  You almost never use her stats or any of that stuff.  She's a rather boring hero\n\n \n\n5. Fatty Bolger - He's cool in multi-player but I only do that so often....\n\n \n\n6. Dwalin - He's fun but he's only good against quests that have lots of orcs.....which there are few of...\n\n \n\n7. Gloin - Boring.......\n\n \n\n8. Grima - I used him quite a bit when I got VoI but I just don't like him.  I don't know.....I think I just don't like the deck type he needs.  I like maybe 1-2 different doomed cards in my deck (really 3-6 because of each copy) but I just don't like the full scale doomed decks.\n\n \n\n \n\nHeroes that aren't very good but I still use:\n\n \n\nPippin Spirit - I made a (S)Pippin, Bilbo, Spirit Glorfindel deck that I liked and was pretty cool \n\n \n\nBrand Son of Bain - He's fun in multi-player\n\n \n\nFaramir - Amazing artwork.....cool stats and ability.....a favorite character...those make up for the relatively weak he is\n\n \n\nEleanor - Gondorian shield saved her.  She now can defend properly\n\n \n\n \n\n \n\n \n\n \n\nHow about you guys?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091720","commentId":1091720,"userName":"MyNeighbourTrololo","timestamp":1400604247,"content":"I take it you're a solo player. In multiplayer, if you don't have Eleanor - odds are you're going to lose a lot. \n\n \n\nFor me - I don't know... there is a lot of heroes I didn't actually used, but this is because I build strict decks.\n\nI don't think there is a hero I wouldn't use... oh, wait. Spirit Pippin.\n\nEdited May 20, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091826","commentId":1091826,"userName":"Nickpes","timestamp":1400607768,"content":"Lore Bilbo, Brand son of Bain, Candara ... But i plan to use them some day, just to have used them all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091840","commentId":1091840,"userName":"Tracker1","timestamp":1400608361,"content":"There are many heroes that get very little use in my solo decks. I try to use most heroes when they first come out, but only a few stand the test of time.\n\nThere is a bit of a difference between heroes that i never/rarely use and heroes that don't even get considered when building a new deck. Some heroes I no longer use, but at one time I had a very good deck with them, and I'll consider them for new decks, even if they don't make the cut.\n\nHowever, some heroes are even outside of considering for a deck, since I can't figure a way to build a deck around them at all.\n\nMy top 2 never used heroes are Brand and Bard. Both abilities rely on ranged attacks, so naturally that makes them very limited for the solo player, and Legolas outcompetes them in every way.\n\nAll the other heroes are usually considered. Most Dwarves I rarely use but when trying different dwarf decks, I'll consider each of the heroes and experiment with a few of them. Even a hero like spirit pippin has the Hobbit trait so, he can find a way into a deck if I put my mind to it, but Bard and Brand have no trait synergy so that's another strike againt them. Beorn is another hero like this, but his hero card is interesting enough to find a way to build a deck around.\n\nIf Dale and Esgaroth see some love then there may be hope for them, but it would have to be pretty major to turn the tides."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091846","commentId":1091846,"userName":"Noccus","timestamp":1400608855,"content":"I've never used, or seen Spippin been used on the table.\n\nAnd I don't think I ever will.\n\nOther then that, my group rolls with plenty different heroes now a days.\n\nOf course we see some more then others.\n\nBut your list kind of amazes me Khamul.\n\nThere are some really good & fun heroes in there.\n\nOh well, tastes differ I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091912","commentId":1091912,"userName":"leptokurt","timestamp":1400611914,"content":"I never played Bard and all the equipment we got to boost him. Shame that Dunhere is so much better than Brand with all the new Rohan cards. At least in solo player mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091945","commentId":1091945,"userName":"RayLancer","timestamp":1400612986,"content":"I've been wanting to like Eleanor more. I only have the core set and I am still going through the quests. But I may have to cherry pick some of the other cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1091949","commentId":1091949,"userName":"MyNeighbourTrololo","timestamp":1400613040,"content":"Bard is a dope in multiplayer. Right now I can't imagine our existance without him. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1092439","commentId":1092439,"userName":"Pharmboys2013","timestamp":1400639915,"content":"Gloin- I used to use him a good bit with the dwarf revolution at the time of the first hobbit box hes become pretty outdated.  Things like Thorin and We Are Not Idle have become safer options for resource generation when playing dwarves and although he can be used outside that archetype I personally would rather run a lower cost leadership hero like Theodred who can provide resources or Sam for his will power.  The newer ally doesnt help either\n\n \n\nGimli- He's another one that has just gotten stale for me.  Obviously he used to be an all-star but with so many newer tactics heroes I havent pulled him out of my binder for a while.  Doesnt help hes off color for trait synergy too\n\n \n\nGlorfindel (lore)- obvious statement is obvious\n\n \n\nBilbo Baggins- I've just never found him worth investing in.  That inflated threat cost is intimidating and when considering giving him the necessary attachments to make him worth while it becomes a large deck investment that might better be on a different hero altogether.  I realize he's likely better in multiplayer which i occasionally play but as mostly solo he doesnt see use by me.\n\n \n\nBrand son of Bain- I realize hes great in multiplayer but this is a subjective topic so since i play mostly solo I dont use him.  At the very least with his grandfather Bard I've experimented with great yew bow decks.\n\n \n\nDwalin- A limited ability, a good ally version, and better alternatives in the same sphere make this here a bit of a dud for me.  I really want to like him though, I really do.\n\n \n\nPippin (spirit)- Someday i'll try and make him work...someday \n\n \n\nFatty Bolger- I used him once in multiplayer after black riders was released and he was admittedly useful but when looking at utility spirit heroes I think Eleanor is generally a better choice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1092676","commentId":1092676,"userName":"richsabre","timestamp":1400666185,"content":"Bard - he came out in the days when I only played solo and since then I don't like him in my decks - the reason being I use usually a quest deck and a tactics mono deck that draws all enemies into...I usually don't need his ability\n\n \n\nEleanor - yeah she has that ability, but ive gotten along fine without her for 3 years now...\n\n \n\nThorin - why oh why havnt I?!!!\n\n \n\nI switch about a lot and play a lot so use I would say those are the only ones I hardly ever use. there is also heroes I havnt gotten around to building a deck around like grima, but im working on it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1093621","commentId":1093621,"userName":"booored","timestamp":1400711291,"content":"I've made decks with everyone, but there are heroes I use rarely or even only when I specifically go out of my way to use them. You know when you make a deck saying.. \"hey lets use this dude I never use.\"\n\nI greatly dislike high threat heroes. So anything with a 11 I rarely use. While Aragorns and Borimiers and stuff are not bad heroes, I just dislike using them and they only ever go in if I am tooling a deck to use them, or there is a function I need in the deck they provide to gain a high win ratio in a certain quest. So pretty much most 11 cost heroes are rare, besides the obvious power houses like Dain.\n\nStill I think that the heroes are pretty good in this game, eveyone of them has goo points and there are no really useless ones. You can build pretty strong decks from any of them if you try.\n\nI suppose the Prince and by extension the newer Eomer guy has seen little action for me but I have a feeling that they may see some action once the bounce cards of the new sylvian sets come into play. They are reported to all come in and out of play as a faction characteristic, this should power those heroes well. They kinda work in Eagle decks, but not really as good as they seam.\n\nBrand while one of the most crazy powerful multiplayer heroes has little solo power, same with Bard.\n\nBeorn is also a bit \"meh\" for me. There are 3 decent decks for solo I have made for him, all revolving around Fortune of Fate or Landreval. Still, as a solo player I love attachments and find him kinda limited. I just feel that like many he is a multiplayer hero, as solo players need utility and specialization like him can be a problem.\n\nDwalin is also not used much by me, I find that he is two conditional. While orcs are common it is not hard to find alternatives to him during testing. I think if he had 3 attack he would be really elevated, as it is you need to boost his attack to make him worth it.\n\nGimli, except for a few specialist quests you just do not need his power. His ability ios just massive over kill. with points of dmg never getting used, as it obliterated the mob with tons ot spare. usually it is the better choice to go a lower threat hero.\n\nWhile Lore Glorfindel had his day, I can not remember last time I pulled him out, though there isa strong vilvia deck that runs him I built recently that owns pretty much everything.\n\nThis is the thing.. all the heroes have some merit if you look for it. Some are better than others, but winning this game is so easy that deck building becomes almost the point of the game. You sculpt your difficulty by building less powerful decks. While power decks will always exist you can make good decks out of ay of them.\n\nThis is a god thing, as one day a card will gte printed or a trait wil be invented and suddenly that hero that has been in thew wings will become a godlike.\n\nEdited May 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1093767","commentId":1093767,"userName":"joezim007","timestamp":1400720151,"content":"Honestly, new heroes are coming out faster than I can try them (I don't get to play much :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] ) so I \"never play\" most heroes. I've only put 18 of the 48 \"real\" heroes (not including the saga-specific heroes) through their paces and I'll never catch up. Sadly, my deck building seems to be sucking too, so I'm not getting good experiences with most of the ones I've tried either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1093787","commentId":1093787,"userName":"Pharmboys2013","timestamp":1400721828,"content":"> Honestly, new heroes are coming out faster than I can try them (I don't get to play much :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] ) so I \"never play\" most heroes. I've only put 18 of the 48 \"real\" heroes (not including the saga-specific heroes) through their paces and I'll never catch up. Sadly, my deck building seems to be sucking too, so I'm not getting good experiences with most of the ones I've tried either.\n\n \n\n:blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1094238","commentId":1094238,"userName":"Mndela","timestamp":1400765044,"content":"Caldara is very very good. Inside the correct deck, it could be a very good deck for all scenarios. Even playing solo.\n\n \n\nFatty is very good hero. But you must be an experimented player to know his powerful. Sometimes, just resolving the quest phase, we need little more wp to pass the quest, and we say: 'if Fatty would be here'... The question is not only reduce the threat of another players, the question is pass quest card (or explore active location) soon, before more cards going to be revealed.\n\n \n\nSpirit Pippin. Ok, his ability is hard to use, but he is a very good spirit hero with low treath. Sometimes is the ideal hero for the low threat deck you want.\n\n \n\nBilbo is underrated. Because is not immediate effect. But he is making able powerful hands.\n\n \n\nGimli can be the most hard attacker in the game, up to 20 attack points in only one bit.\n\n \n\nGloin inside the correct deck is a huge mine of resources. I have seen him making undefendeds agains a troll and the mash adder [http://hallofbeorn.com/Cards/Details/Marsh-Adder-Core] in the same combat phase, you wonder....\n\n \n\nOin, simply, is not bad.\n\n \n\n---------------------------------------------------------\n\n \n\nHowever, in my opinion, the heroes i feel difficulty to play them are:\n\n \n\nFaramir lore: only quest him first round Into Ithlien is poor for me.\n\n \n\nGrima: i'd like more doomed cards, to group them with Grima.\n\n \n\nDwalin: i still haven't found the correct deck for him.\n\nEdited May 22, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1094258","commentId":1094258,"userName":"joezim007","timestamp":1400766042,"content":">  \n> \n> > Honestly, new heroes are coming out faster than I can try them (I don't get to play much :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] ) so I \"never play\" most heroes. I've only put 18 of the 48 \"real\" heroes (not including the saga-specific heroes) through their paces and I'll never catch up. Sadly, my deck building seems to be sucking too, so I'm not getting good experiences with most of the ones I've tried either.\n> \n>  \n> \n> :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]\n> \n>  \n\n \n\nMaybe if someone would take over my role as dad, and take some of my hours at work, I could play more :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095564","commentId":1095564,"userName":"booored","timestamp":1400855416,"content":"> Grima: i'd like more doomed cards, to group them with Grima.\n\n \n\nGrima is the backbone of the current Outlands of the Smash face and auto-win class of decks. His ability gets 6 cards out for 0 cost from Lore and Tactics and also can reduce another 3 to 2 cost. Outlands has always been quick with the correct hand, but with Grima you can practicly dump the crads on the table at sonic speeds. Grima is lore as well so you get warden, card draw ..\n\n \n\nHard to diss a hero when he is part of one of the strongest decks in the game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095655","commentId":1095655,"userName":"Distractionbeast","timestamp":1400859542,"content":"FYI, Beorn is great for first turn battle questing.  I've used him VERY effectively for that purpose.  When playing solo, he can pretty safely be the only quester, freeing up your other heroes and allies to do everything else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095725","commentId":1095725,"userName":"Morithain","timestamp":1400861732,"content":"Mndela, can you explain how on earth you use Caldera to any great effect?  She seems really quite useless.  Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095758","commentId":1095758,"userName":"Mndela","timestamp":1400862810,"content":"> Mndela, can you explain how on earth you use Caldera to any great effect?  She seems really quite useless.  Thanks.\n\n \n\nI have a deck around her (there are several, however):\n\n \n\nHeroes: Eowyn · Caldara · Frodo\n\n \n\nEowyn for discard allies (to recycle with Caldara), and Frodo to defend undefendeds more than 2 damage (if not, you can deal the 2 damage to Caldara, and after use his ability :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])\n\nYour start willpower is 8, nothing bad!\n\n \n\nAllies:\n\nImportant for mulligan: Zigil --> because, even if you dont reach resources he helps you to discard cards (Caldara can be used first round with lucky!)\n\nEmery --> you discard 3 cards and it is for free\n\n(Hidden Cache is inside this deck - with Zigil and Emery sure you win resources)\n\nImladris, of course, when Zigil and Imladris are in game you are the most powerful in the middle earth :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Even if this combo is in discard pile, recycle it by Caldara is good. In 2 rounds you return Caldara for sure thanks to their resources.\n\nThe most poweful spirit allies, of course ^^: Damrod, Elfhelm, Nortern Tracker... you can reach up to 8 attack points in a normal game.\n\nAnotehr allies .... riddermark finest, arwen, pelargir shipwright (great quester).\n\n \n\nEvents:\n\nFate and Destiny, for sure ^^\n\nDwarf Tomb, to recycle Fate and Destiny, or the card you want atm, feel free ^^\n\nTest of Will (or mathom, depend of the quest, but mathom generaly no need here, you no need cards in hand, you need cards in discard ^^)\n\nStand and Fight, if you have discarded an a good ally and it is too expensive to recycle with Caldara just in this moment and you need just now, for example, Imladris by Zigil first round, or the horse-mark to remove a nasty location in staging... lots of options.\n\nHidden Cache, you know\n\nHasty Stroke or Wild of West, depend of the quest.\n\n \n\nAttachments:\n\nGood meal, for frodo (to use more easily Fate Destiny, even Stand and Fight if you need for help)\n\nMiruvor, when you are going to discard Caldara, and dont want to lose her resource, you 'pass' the resource to frodo, for example, and, generaly, return to deck, it combs well with zigil ^^\n\nand the star card: Map of Earnil! to recycle Fate Destiny (counsel: play it before discarding caldara ^^, it is cheaper)\n\n \n\nIt runs good solo, and very very good in multiplayer, it quests a lot and can combat very well in adittion. can cancel treacheries, can defend with centinel (Frodo-Arwen) and can return heroes lost from another friends (with Caldara's permission ^^), can remove lots of locations from staging, lots of options!\n\nEdited May 23, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095778","commentId":1095778,"userName":"Tracker1","timestamp":1400863605,"content":"> Mndela, can you explain how on earth you use Caldera to any great effect?  She seems really quite useless.  Thanks.\n\nShe's really good, I put her in my top ten best heroes.\n\nCheck out this deck.\n\nhttp://community.fantasyflightgames.com/index.php?/topic/95374-mono-spirit-solo-caldara-deck/ [https://community.fantasyflightgames.com/index.php?/topic/95374-mono-spirit-solo-caldara-deck/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1095839","commentId":1095839,"userName":"RayLancer","timestamp":1400866645,"content":"> > Mndela, can you explain how on earth you use Caldera to any great effect?  She seems really quite useless.  Thanks.\n> \n> She's really good, I put her in my top ten best heroes.\n> \n> Check out this deck.http://community.fantasyflightgames.com/index.php?/topic/95374-mono-spirit-solo-caldara-deck/ [https://community.fantasyflightgames.com/index.php?/topic/95374-mono-spirit-solo-caldara-deck/]\n\nSeems like a neat deck but I only have one core for Fate or Fortune. I guess I could proxy to try it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096306","commentId":1096306,"userName":"booored","timestamp":1400895670,"content":"> She's really good, I put her in my top ten best heroes.\n\n\n\n \n\n\n\nShe isn't that good. She is a fine example of the game deck building for you. She makes a powerful deck but it is like one of the easiest decks to build in the game, you just throw in all your fav spirit cards.. end of deck building. Eveyone and their dog made it the instanrt she as spoiled and if you look at the decks posted that are practically the same. A good hero is able to be used in a viriatry of deck.. not a single deck. I would rate her as a interesting hero.. fun for a while to play with but ultimatly boaring and not usable in the larger scheme of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096536","commentId":1096536,"userName":"SilvanBouncer","timestamp":1400923054,"content":"Theoden. Despite his heroic stats, I don't think his theme translates into helpful gameplay. E.g. why would Beorn feel inspired by his presence? I also find the practice of a Tactics player questing, even carrying a portion of the questing load, an inefficient way to play Tactics. I don't really know Middle Earth lore all that well, but he could've used a special attachment the likes of Vilya or Nenya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096544","commentId":1096544,"userName":"MyNeighbourTrololo","timestamp":1400923999,"content":"Beorn wouldn't - he is immune to player card effects. I actually constucrted a decently successful mono tactics deck. Theoden and Merry questing for 6, Legolas killing and getting additional progress, while allies defend and help quest/attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096572","commentId":1096572,"userName":"Tracker1","timestamp":1400931420,"content":"> > She's really good, I put her in my top ten best heroes.\n> \n>  \n> \n> She isn't that good. She is a fine example of the game deck building for you. She makes a powerful deck but it is like one of the easiest decks to build in the game, you just throw in all your fav spirit cards.. end of deck building. Eveyone and their dog made it the instanrt she as spoiled and if you look at the decks posted that are practically the same. A good hero is able to be used in a viriatry of deck.. not a single deck. I would rate her as a interesting hero.. fun for a while to play with but ultimatly boaring and not usable in the larger scheme of the game.\n\nTrue"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096873","commentId":1096873,"userName":"Demoncow","timestamp":1400966267,"content":"> Beorn wouldn't - he is immune to player card effects. I actually constucrted a decently successful mono tactics deck. Theoden and Merry questing for 6, Legolas killing and getting additional progress, while allies defend and help quest/attack.\n\nRecently used a deck just like it, powerful combo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096878","commentId":1096878,"userName":"leptokurt","timestamp":1400966681,"content":">  \n> \n> However, in my opinion, the heroes i feel difficulty to play them are:\n> \n>  \n> \n> Faramir lore: only quest him first round Into Ithlien is poor for me.\n> \n>  \n> \n> Grima: i'd like more doomed cards, to group them with Grima.\n> \n>  \n> \n> Dwalin: i still haven't found the correct deck for him.\n\nCompletely forgot about how Faramir sucks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096879","commentId":1096879,"userName":"MyNeighbourTrololo","timestamp":1400966925,"content":"WHy do you need more doomed cards for Grima? His speciality is turning cards into doomed ones, ore making cards that already doomed even more doomed, he wouldn't receive any special kind of treatment from a doomed card any more than any other hero will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096896","commentId":1096896,"userName":"joezim007","timestamp":1400969267,"content":"> WHy do you need more doomed cards for Grima? His speciality is turning cards into doomed ones, ore making cards that already doomed even more doomed, he wouldn't receive any special kind of treatment from a doomed card any more than any other hero will.\n\nI don't think he was saying they'd make him directly better. I think he meant that doomed decks in general need some more love, which would make Grima more useful because he fits best in doomed decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1096926","commentId":1096926,"userName":"Mndela","timestamp":1400973784,"content":">  \n> \n> > She's really good, I put her in my top ten best heroes.\n> \n>  \n> She isn't that good. She is a fine example of the game deck building for you. She makes a powerful deck but it is like one of the easiest decks to build in the game, you just throw in all your fav spirit cards.. end of deck building. Eveyone and their dog made it the instanrt she as spoiled and if you look at the decks posted that are practically the same. A good hero is able to be used in a viriatry of deck.. not a single deck. I would rate her as a interesting hero.. fun for a while to play with but ultimatly boaring and not usable in the larger scheme of the game.\n> \n>  \n\n \n\nHirluin also only runs in an specific deck and nobody says nothing about it.\n\nEdited May 24, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106731-heroes-you-never-play/?do=findComment&comment=1097143","commentId":1097143,"userName":"booored","timestamp":1400999706,"content":"um... I am pretty sure everyone says that about him. He is exactly like Calandra.\n\n \n\n \n\n> FYI, Beorn is great for first turn battle questing.  I've used him VERY effectively for that purpose.  When playing solo, he can pretty safely be the only quester, freeing up your other heroes and allies to do everything else.\n\n \n\nhmm... interesting. That is in fact a cool idea. Put him in but utilising him as a battle quester, not as a mob killer. You can even use his health pool for undefended attacks. As you tapping him 1st thing in quest phase each time anyway, his \"no player card effects\" thing is practically irrelevent. He still has the attachment problem, but still.\n\n \n\nReally cool use of Beorn. Hadn't ever thought of that. I've always gone for heroes with evenish questing and attack and defense so they can handle all situations depending what quest card is out. Might have to hit the card pool when I get home!\n\nEdited May 25, 2014 by booored"}]}