{"url":"https://community.fantasyflightgames.com/topic/106716-questions-from-a-beginner/","title":"Questions from a Beginner","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106716-questions-from-a-beginner/?do=findComment&comment=1091333","commentId":1091333,"userName":"Abirum","timestamp":1400587539,"content":"So i am just getting started with lotr lcg made by FFGs. just got 2 core sets a while back.\n\n1st when do i flip the top card of the encounter deck? during questing and when enemies attack? Does any creatures that pop up atk ur questers?\n\n2nd how does mulliganing work in this game, is there a limit on how many times u can do this, and do u draw 1 less card or a full 6? this is often necessary since u might need to start with 1 or 2 key cards for the quest.\n\n3rd  Does the troll even engage u if he is forest snared? Can i atk and kill it once its engagement cost is reached?.\n\n4th when does armor negate damage in this game?\n\nthanks for the Help in advance.\n\nEdited May 20, 2014 by Abirum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106716-questions-from-a-beginner/?do=findComment&comment=1091380","commentId":1091380,"userName":"richsabre","timestamp":1400590076,"content":"1.it is in the 'staging step' ...this is after you have committed your heroes to the quest. you also give each attacking enemy a shadow card, which is revealed only during their actual attack\n\n \n\n2. you can mulligan once. you shuffle 6 cards back into your deck and draw 6 cards afresh - but you must keep those new cards and cannot do it again\n\n \n\n3. you cannot forest snare an enemy not engaged with you - and given you need to play snare during the planning phase, you need to take at least 1 attack off it, if you are using the snare..unless you use faint or something similar. you can kill it as normal though, snare just prevents IT from attack you\n\n \n\n4. armour is taken off attack stats. so if an enemy attacks with +7 and you have 2 defence (which is what I think you mean by armour?) then it gives 5 damage\n\n \n\nhope this helps"}]}