{"url":"https://community.fantasyflightgames.com/topic/106814-advice-on-a-threat-deck/","title":"Advice on a threat deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/106814-advice-on-a-threat-deck/?do=findComment&comment=1092901","commentId":1092901,"userName":"wizerdrea","timestamp":1400683451,"content":"I want to build a threat deck that raises and lowers my threat.  I real want to be able to have cards like Palantir, Saruman, and Gandalf(Hobbit saga) in the deck and not be hurt by them.  Could you please give me advice and help me build this deck.\n\nEdited May 21, 2014 by wizerdrea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/106814-advice-on-a-threat-deck/?do=findComment&comment=1092922","commentId":1092922,"userName":"Tracker1","timestamp":1400684196,"content":"Aragorn lore is your hero for this type of deck. Basically you can allow your threat to skyrocket and then reset it before it gets to 49.\n\nAny deck you work on building is going to need to use him, unless you go for a low threat secrecy deck, and work your way up from there, although any deck like that is going to need threat reduction cards. The nice thing about Aragorn is that you don't need to include any threat reduction cards and the deck can can totally focus on the other cards in the strategy.\n\nYou might also want to check out using Grima, since him and the keys of Orhtanc can get much needed resources to play cards.\n\nPalantir is cool theme card but generally I think it adds unnecessary threat increase for what you get from it.\n\nOther than that, check out the Strategy and deck building section and look for doomed decks to give you ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/106814-advice-on-a-threat-deck/?do=findComment&comment=1093049","commentId":1093049,"userName":"Bullroarer Took","timestamp":1400689241,"content":"To Tracker's comment I would add that you need at least one Spirit hero so you have access to Galadhrim's Geeting and preferably make it a Noldor so you can use Elrond's Council.  (Of course this screams Spirifindel.)  For further abuse add a few copies of Map of Earnil.  You can end the game with single digit threat."}]}