{"url":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/","title":"Which adventure pack to get?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096740","commentId":1096740,"userName":"rhtm70","timestamp":1400951855,"content":"Hey guys. I wanted to get the opinion of some players with more experience than me as to whether I should get Foundations of Stone or Shadow and Flame as my next adventure pack. I have the Core set, all of Mirkwood cycle, Khazad-dum, Watcher in the Water, both Hobbit expansions and Black Riders. I really like the quest in Shadow and Flame and Elrond but I know that Glorfindel and Asfaloth are good too. What do you guys think? Thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096763","commentId":1096763,"userName":"MyNeighbourTrololo","timestamp":1400953213,"content":"My vote is for Foundation of the Stone. This quest is less one-sided, so to say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096801","commentId":1096801,"userName":"Khamul The Easterling","timestamp":1400957854,"content":"In my opinion, Shadow and Flame is basically the Elrond pack.  Most people don't like the quest.(I hate it)  Its pretty boring.  If you really, really want Elrond, get Shadow and Flame.  Otherwise go for Foundations of Stone.  Foundations of Stone quest is really fun.  I personally think it gets a bit boring after maybe 4 plays if you play solo but multi-player its great.  Of the two, I would go for Foundations.  However, considering you have a good cardpool, I think I would jump over to HoN and the Against the Shadow cycle really soon.  That is the best cycle yet.  Really fun quests.  I find myself rarely playing the Dwarrowdelf quests.  I think in the last 4-5 months, of all the Dwarrowdelf cycle quests, I've played Redhorn Gate a couple times and thats it.  I think even the Mirkwood cycle quests are better.  You aren't missing much by not buying Redhorn Gate, Road to Rivendell, Long Dark, and Shadow and Flame.  Watcher in the Water and Foundations of Stone are the only packs worth picking up in the Dwarrowdelf cycle IF you are on a budget and you want to skip over the packs that aren't as good.  \n\n \n\nHave fun,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096817","commentId":1096817,"userName":"Rapier1","timestamp":1400959775,"content":"I really enjoyed Shadow and Flame as a quest (more than Foundation of Stone). However Glorefindel in spirit is undeniably the better hero. \n\nPersonally I wouldn't skip anything. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096840","commentId":1096840,"userName":"7theye","timestamp":1400961643,"content":"Spirit glorfindel is a beast"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096934","commentId":1096934,"userName":"iznax","timestamp":1400975476,"content":"As you can see is all a matter of taste, for example me and many people find  HoN and the Against the Shadow cycle to be the worst \" chapter \" of this game ( with B.R. and V.o.I. things seem to be back on track ) others think the oposite. So just follow your heart and have fun.\n\nP.S. With 3-4 players Foundations of Stone is a blast !\n\nP.S.2. sry for my English.\n\nEdited May 24, 2014 by iznax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096946","commentId":1096946,"userName":"Khamul The Easterling","timestamp":1400978438,"content":"> P.S.2. sry for my English.\n\nWhy do people always apologize for their English?  Your post's are always perfectly readable man..... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1096990","commentId":1096990,"userName":"awp832","timestamp":1400983780,"content":"personally I like the Voice of Isengard expansion.  You get the doomed cards -some of which are great-,  and Eomer and Grima are both pretty good too.    You also pave the road for yourself for the next cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1097144","commentId":1097144,"userName":"rhtm70","timestamp":1401000098,"content":"Thanks for the replies guys. After everything said on here and after my son and I got our hind quarters handed to us agains Escape from Dol Guldur I'm thinking we're definitely going for Foundations of Stone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1097385","commentId":1097385,"userName":"Bullroarer Took","timestamp":1401035588,"content":"You'll end up getting them both, but FoS is a better pack overall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1097673","commentId":1097673,"userName":"DurinIII","timestamp":1401061689,"content":"Get em all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107079-which-adventure-pack-to-get/?do=findComment&comment=1098552","commentId":1098552,"userName":"Serazu","timestamp":1401145987,"content":"Foundations of Stone and The Steward's Fear are the two greatest packs in this game. Both provide 1) MANY 2) EXCELLENT player cards and they sport two thrilling and memorable quests (though the FoS one shines less in solo games). You need to get those two packs. Concerning SaF, though several of the player cards there are quite good, I find that they did not survive unscathed the passage of time. To give you an example, my current one-deck-to-rule-them-all deck (an outlands one) still sports Glorfindel, Daeron's Runes, Asfaloth and Light of Valinor from FoS, but nothing from SaF (save Elrond when I play the... SaF quest and I want to change my usual hero line-up). All the aforementioned FoS cards are simply timeless. Imladris Stargazer from that same pack is a solid ally, as well. Go FoS and TSF and, pretty soon, you 'll find yourself using a bunch of cards from those two packs. Concerning the SaF quest, it's a titanic boss fight, something the game lacked till then (Conflict at the Carrock and especially The Watcher bore such elements too, though Shadow is the pinnacle, possibly shadowed -no pun intended- only by the Laketown).\n\nEdited May 26, 2014 by Serazu"}]}