{"url":"https://community.fantasyflightgames.com/topic/107153-shadow-effect-of-harbor-thug-who-receives-the-damage/","title":"Shadow effect of Harbor Thug -  who receives the damage?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107153-shadow-effect-of-harbor-thug-who-receives-the-damage/?do=findComment&comment=1097533","commentId":1097533,"userName":"Agesilaos","timestamp":1401047081,"content":"Hi,\n\nI am playing „Peril in Pelargir“ and have a question on the shadow effect of the enemy card „harbor thug“ (“any damage dealt by this attack is dealt to the hero with Alcaron’s scroll attached, if able”).\n\nLet’s assume I am playing a two player game. The first player has a character that is engaged with an enemy and this enemy has been dealt the shadow card \"harbor thug.\" Alcaron’s scroll, however, is attached to one of the heroes of the second player.\n\nLet’s assume further that the first player receives 2 damage from the attack. I now see two possibilities for how to deal with the shadow card effect.\n\n1) Since none of the heroes of the first player has Alcaron’s scroll attached to it, the character who was declared as the defender is dealt the 2 damage. None of the characters of the first player has Alcaron’s scroll attached to it, so the shadow effect cannot be resolved and nothing else happens.\n\n2) The character of the first player who was declared as the defender receives no damage, but the hero of the second player who has Alcaron’s scroll attached to it is dealt the 2 damage, even though the enemy was not engaged with the second player.\n\nStrictly speaking, option 1 seems more consistent with the rules because it avoids cutting across the two-player boundary when resolving effects (unless this is specifically mentioned on the card). Usually any damage assigned during an attack stays within the group of the characters that this player controls.\n\nThematically speaking, however, option 2 makes also sense, since for the theme of the scenario, the characters of the two players effectively form one group that works together to deliver the scroll safely out of Pelargir, so the harbor thug would try to single out the scroll carrier for the damage.\n\nI would be grateful for your thoughts on this.\n\nMany thanks in advance, and my apologies if this question has already been answered in a different blog/context.\n\nAgesilaos\n\nEdited May 25, 2014 by Agesilaos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107153-shadow-effect-of-harbor-thug-who-receives-the-damage/?do=findComment&comment=1097550","commentId":1097550,"userName":"klaymen_sk","timestamp":1401049764,"content":"The second option. It can be simply resolved by this:\n\n-if no hero has the scroll attached, deal damage to the defender\n\n-if there is a hero with the scroll attached, deal the damage to him, regardless of who controls him"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107153-shadow-effect-of-harbor-thug-who-receives-the-damage/?do=findComment&comment=1097905","commentId":1097905,"userName":"alogos","timestamp":1401092536,"content":"Maybe you should elaborate on this \"the two-player boundary when resolving effects\" because there is no such things... each player have there own engagement area, but effect that target all character will target character of your teamates, you can also play attachment on your teamates etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107153-shadow-effect-of-harbor-thug-who-receives-the-damage/?do=findComment&comment=1098417","commentId":1098417,"userName":"Agesilaos","timestamp":1401136128,"content":"Dear both,\n\n \n\nthanks for your prompt replies and the advice, much appreciated. I will use option #2, then.\n\n \n\nA"}]}