{"url":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/","title":"Making Rangers Viable?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098883","commentId":1098883,"userName":"joezim007","timestamp":1401168786,"content":"Ranger decks have been an interesting idea and they work a bit, but they just can't muster the numbers they need to really be strong. I've designed 2 cards that help out I think:\n\n \n\nAmbush.jpg [http://www.joezimjs.com/_uploads/Ambush.jpg]\n\n \n\nThis guy helps Faramir become more useable. He can use this to attack the staging area with at least 3 attack and hopefully take some guys down before his high starting threat becomes an issue. I also considered changing the text from \"After an enemy is added to the staging area\" to \"After a Trap is attached to an enemy\" to make it slightly more thematic. It's also a tougher requirement to hit, so I could potentially lower the cost to zero... especially if I remove the readying at the end, though I consider the readying to be somewhat thematic too because when you ambush someone you could potentially get 2 shots off on enemies before they get any retaliating effects.\n\n \n\nMablung.jpg [http://www.joezimjs.com/_uploads/Mablung.jpg]\n\n \n\nAnother Lore Ranger hero is always welcome, especially someone with somewhat lower threat. His ability is very similar to the Ambush ability, which was on purpose. I think rangers should be able to utilize their traps more efficiently to kill things before they can fight back. Having this repeatable ability on a hero makes it much more possible.\n\n \n\nWhat do you guys think? Suggestions? Do you think Ambush should trigger off of a trap attaching? Do you think I should keep the readying on there or lower the cost at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098886","commentId":1098886,"userName":"booored","timestamp":1401168973,"content":"? Ranger decks are totally viable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098891","commentId":1098891,"userName":"joezim007","timestamp":1401169386,"content":"I haven't seen one that is all that strong. If we're talking pure ranger decks (with Faramir hero), then I'm not sure how it generates enough willpower to handle quests with a noticeable number of locations. I think they handle enemies just fine, but even then, Faramir's ability is largely going to waste since your threat is generally to high to keep enemies in the staging area and there aren't many ways to attack the staging area other than Ithilien Pit for rangers.\n\n \n\nEither way, I was mostly just trying to think of ways to give the Faramir hero a bit of love.\n\nEdited May 27, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098964","commentId":1098964,"userName":"booored","timestamp":1401176955,"content":"Well, I think the problem is that many players think so black and white about this game. A \"ranger\" deck dosn't need to be all rangers. Outlands and Dain has made many deck builders think only about tribes. A few ranger cards are extreamky powerful. There is no need to just make a deck with nothing but rangers...\n\n \n\nFaramir (Ally) - One of the most powerful cards ever printed. You wana quest for 20+ even when playing solo.. this is your man. He is just famtastic.\n\n \n\nIthilien Tracker (Ally) - Bonkers powerful. Especially for solo players.\n\nIthilien Archer (Ally) - A key card for Dunhere decks to get those few guys that he can not use fis ability on. Shines in multiplayer for pushing mobs away from your mates encounter zone. Probably one of the best rangers.\n\n \n\nAnaborn.. well if your running traps it is a no brainer.\n\n \n\nAs for heroes.. Beravor, Aragorn, those elves.. pretty awesome cards.\n\n \n\nRangers are all pretty strong cards.\n\n \n\n> I was mostly just trying to think of ways to give the Faramir hero a bit of love.\n\n \n\nYeah I have made a few decks with this guy that seam to work pretty well. The problem is that if your investing in a deck to keep, push things into the staging area.,. then Dunhere is the one you turn to for attacking, and that leaves his ability a bit stale. Not all cards a created equal. I do not think it is his threat or ability.. it is just that Dunhere is so frickn good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098966","commentId":1098966,"userName":"ZanzibarLand","timestamp":1401177714,"content":"With Ambush, I feel like the exhausting of the hero should happen first. S/he would be there waiting, and so exhausted. If no one turns up, no positive is gained. But if someone turns up, no hero is premotively there to attack.\n\nI like the effects of Illitien tracker. Plus lore has scrying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1098976","commentId":1098976,"userName":"MyNeighbourTrololo","timestamp":1401178945,"content":"Rangers are not a faction, like Gondor, Dwarvers and etc. Rangers is an occupation, a class if you will. They don't need to be neither strong nor developed on a full faction scale. And there is already some spoiled ranger hero love.\n\nEdited May 27, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1099359","commentId":1099359,"userName":"Narsil0420","timestamp":1401205962,"content":"I agree that Rangers need a more consistent way to attack into the staging area. Trying to get Great Yew Bow on Faramir just takes too long"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1099618","commentId":1099618,"userName":"joezim007","timestamp":1401220547,"content":"> I agree that Rangers need a more consistent way to attack into the staging area. Trying to get Great Yew Bow on Faramir just takes too long\n\n \n\nYup, and Great Yew Bow on him fails a lot too because it's hard to keep your threat low enough to keep the enemies there. Hands Upon the Bow is probably the better option, though not reusable.\n\n \n\nOverall, I think some type of ambushing mechanic just works really well with the Ithilien Rangers thematically and mechanically, so why not?\n\n \n\n \n\n> With Ambush, I feel like the exhausting of the hero should happen first. S/he would be there waiting, and so exhausted. If no one turns up, no positive is gained. But if someone turns up, no hero is premotively there to attack.\n> \n> I like the effects of Illitien tracker. Plus lore has scrying.\n\n \n\nSitting around and waiting for an enemy to walk into a trap doesn't sound too exhausting to me. I think the cost is too high to exhaust the hero before you know that an enemy will even be revealed.\n\n \n\n \n\n> Well, I think the problem is that many players think so black and white about this game. A \"ranger\" deck dosn't need to be all rangers. Outlands and Dain has made many deck builders think only about tribes. A few ranger cards are extreamky powerful. There is no need to just make a deck with nothing but rangers...\n> \n>  \n> \n> Faramir (Ally) - One of the most powerful cards ever printed. You wana quest for 20+ even when playing solo.. this is your man. He is just famtastic.\n> \n>  \n> \n> Ithilien Tracker (Ally) - Bonkers powerful. Especially for solo players.\n> \n> Ithilien Archer (Ally) - A key card for Dunhere decks to get those few guys that he can not use fis ability on. Shines in multiplayer for pushing mobs away from your mates encounter zone. Probably one of the best rangers.\n> \n>  \n> \n> Anaborn.. well if your running traps it is a no brainer.\n> \n>  \n> \n> As for heroes.. Beravor, Aragorn, those elves.. pretty awesome cards.\n> \n>  \n> \n> Rangers are all pretty strong cards.\n> \n>  \n> \n> > I was mostly just trying to think of ways to give the Faramir hero a bit of love.\n> \n>  \n> \n> Yeah I have made a few decks with this guy that seam to work pretty well. The problem is that if your investing in a deck to keep, push things into the staging area.,. then Dunhere is the one you turn to for attacking, and that leaves his ability a bit stale. Not all cards a created equal. I do not think it is his threat or ability.. it is just that Dunhere is so frickn good.\n\n \n\nThat's a valid point and I know that they have some very strong cards. We're kinda spoiled with some of the traits being fleshed out so well that they can be standalone, and I really want that with Rangers. I just want a deck of mostly/all Ithilien/Dunedain Rangers that specializes in destroying enemies before they have a chance to do anything harmful to you.\n\n \n\n \n\n> Rangers are not a faction, like Gondor, Dwarvers and etc. Rangers is an occupation, a class if you will. They don't need to be neither strong nor developed on a full faction scale. And there is already some spoiled ranger hero love.\n\n \n\nI consider Outlands to be a subset of Gondor, and I consider Rangers to be a subset of Gondor and Dunedain, If Outlands can be so well endowed, why can't Rangers be a bit more standalone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1099627","commentId":1099627,"userName":"MyNeighbourTrololo","timestamp":1401220863,"content":"You really don't realize it? Many, if not most of the rangers are from Gondor. Gondor is a well-developed trait. You develop rangers to the scale of a faction and you gain mightiest crossover in the game. \n\n \n\nRanger are at the good spot currently. Some additional development for them wouldn't hurt, but overdeveloping them would be total excess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1099700","commentId":1099700,"userName":"joezim007","timestamp":1401223910,"content":"> You really don't realize it? Many, if not most of the rangers are from Gondor. Gondor is a well-developed trait. You develop rangers to the scale of a faction and you gain mightiest crossover in the game. \n> \n>  \n> \n> Ranger are at the good spot currently. Some additional development for them wouldn't hurt, but overdeveloping them would be total excess.\n\n \n\nI agree, especially since the \"over\" prefix in \"overdevelop\" implies excess. I also understand that since so many also have the Gondor trait, they can be buffed pretty hard by Leadership Boromir and/or Visionary Leadership, so we need to be careful or we can inadvertently create an overpowered trait.\n\n \n\nBut in any case, I'm not asking for a whole lot, am I? I'm just asking for the Rangers to be good at what they did in the books: ambushes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107266-making-rangers-viable/?do=findComment&comment=1099872","commentId":1099872,"userName":"booored","timestamp":1401233661,"content":"I'm sure new ones will be coming out. Lore needs more powerful cards for sure :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}