{"url":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/","title":"Your Favorite 5 Quests and Why","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100174","commentId":1100174,"userName":"PsychoRocka","timestamp":1401258596,"content":"Hey Guys\n\nI thought I would start a thread about what your favorite quests released thus far are and why. I'm also going to run a poll on this first post to see which quests get the most votes. You can mention other quests or have more after your top 5 but you must have a top 5 for me to add them to the poll. You don't need to put them in order either its just your favorite 5 quests not your top five from favorite to fifth favorite.\n\nHope this makes sense! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nHere are mine:\n-The Massing at Osgiliath. This quest, whilst brutal, is super fun to me. The whole theme and feeling of a huge battalion on your heels is really cool and gives the sense of impending doom. Each stage's setbacks make the quest more interesting and the rangers of Ithilien and the need to sacrifice them/a hero on stage 3 is just so well designed. When they come out as shadow cards and kill an enemy AND then enter play for you it is just too cool. I wish a few more quests had beneficial shadow effects as well as bad ones. The Witch King is awesome, very well done and fun to fight, I've only killed him once and had to flee every other time!\n\nAll of the art in this quest is really awesome as well.\n-The Battle of Five Armies. The battle of five armies is just such an epic moment in middle earth history. Elves, Men, Dwarves and Eagles all had to unite to fight the real enemy, a whole mountain load of orcs/goblins and wargs! The quest almost lives up to the real event with Bolg, Eagle allies, great mechanics and lots of goblins. The multiple stages at once is a great way to show a large battle happening across a large area and its always great trying to choose which one to have as the active quest card and which penalties to cop for the first few turns. Bodyguard of Bolg is a great card and so are the Unique locations that remove progress from each quest stage but provide victory points. Really love this quest but would have liked to have seen it on a bit more of an epic scale... more enemies (and perhaps a mechanic that brings more of them out as well) but more ally encounter cards (like the eagles) to even this out, perhaps Dwarves from the Iron Hills or Mirkwood Elves. Perhaps the nightmare version will slightly fix these issues though. Some of the art in this quest is epic also.\n-To Catch an Orc. Initially, I hated this quest. This was mainly due to my inability to beat it however :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]. Since I originally got the hang of the quest and got my first victory I run much more powerful decks and like to think I play a lot better as well. Since then I don't think I've had any more losses against it! How hard it was for me to beat (I ran very combat heavy decks that focused more on clearing the staging area and did not run very high questing power) and it forcing me to completely change my decks and adapt them not just to this quest but all quests that require high willpower (regardless of how well you can deal with combat and clearing the staging area) instantly puts this quest amongst my favorites.\n\nThe actual mechanics of the stage are really cool as well, the search mechanic works well, the second 20 card deck for each player that Mugash hides in was very cleverly designed and I feel that the Time counters work better in this quest than the other VOI quests and also feel more thematic in this quest as well (amount of time before your presence on the mountain side is detected!).\n-Encounter at Amon Din. This quest is not very difficult but for me is extremely fun. Having to keep an eye on and try your best to save villagers while also trying to make progress/hold off enemies gives the quest more depth than many others. Ghulat is an awesome boss enemy (killing villagers while he fights you and getting stronger for every one he kills) and some of the locations are really cool and have fantastic art. Love that you only win if you have saved more villagers than you have failed to save, regardless of killing Ghulat and making it through the quest. Alternative/unique win conditions are always cool. I also chose this quest as the quest for a duel I had on the forums with another member:\nhttp://community.fantasyflightgames.com/index.php?/topic/103579-duel/ [https://community.fantasyflightgames.com/index.php?/topic/103579-duel/]\nThis helped the quest become one of my favorites as well, even though I lost the duel -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]\n\n-A Knife in the Dark. Weathertop! The Prancing Pony! Bill Ferny! The Witch King! Best of the three quests in The Black Riders hands down. Ferny spying on you. Your escape from Bree only for the Nazgul to find you at Weathertop. Having to play the showdown at the Weathertop. Just awesome all round. Bill Ferny made players re think their deck strategies to pull him from staging or kill him with direct damage, if he sticks around too long or puts Nazgul in the encounter deck you are screwed on stage 3 of the quest. The art throughout this quest is amazing, especially the nazgul and their various attachments and treachery cards.\n\nHonorable Mentions\n\nNot in my top five but very close:\nThe Blood of Gondor (awesome mechanics, fun quest if you don't get brutally swarmed)\nThe Stewards Fear (always different with the plot and villain, fun but hard quest)\nOver the Misty Mountains Grim\nJourney Down the Anduin (best quest in the core set, good to test decks against)\nThe Watcher in the Water (awesome boss fight, very annoying tentacle enemies like there should be!)\n\n\n\n\nPOLL\n\n \n\nThe Massing at Osgiliath                           10 votes\n\nFoundations of Stone                                10 votes\n\nJourney Down the Anduin                             6 votes\n\nThe Stewards Fear                                     5 votes\n\nConflict at the Carrock                                  5 votes\n\nRedhorn Gate                                               5 votes\n\nThe Siege of Cair Andros                             5 votes\n\nThe Fords of Isen                                          5 votes\n\nThe Battle of Five Armies                              4 votes\n\nA Knife in the Dark                                       4 votes\n\nThe Watcher in the Water                             3 votes\n\nPeril in Pelargir                                             3 votes\n\nDungeons Deep and Caverns dim                3 votes\n\nBattle of Lake-Town                                      3 votes\n\nEncounter at Amon Din                                3 votes\n\nAssault on Osgiliath                                      2 votes\n\nDead Marshes (Nightmare)                           2 votes\n\nFlight to the Ford                                          2 votes\n\nThe Morgul Vale                                           2 votes\n\nThe Seventh Level                                       2 votes\n\nA Journey To Rhosgobel                              2 votes\n\nTo Catch an Orc                                           2 votes\n\nWe Must Away Ere Break of Day                 2 votes\n\nBlood of Gondor                                          1 vote\n\nEmyn Muil (Nightmare)                                 1 vote\n\nPassage through Mirkwood (Nightmare)      1 vote\n\nShadow and Flame                                      1 vote\n\nShadow of the Past                                      1 vote\n\nReturn to Mirkwood                                      1 vote\n\nFlight from Moria                                          1 vote\n\nEscape from Dol Guldur (Nightmare)           1 vote\n\nFlies and Spiders                                           1 vote\n\nInto the Pit                                                       1 vote\n\n \n\n \n\nEdited after iznax's vote\n\nEdited June 2, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100267","commentId":1100267,"userName":"Mndela","timestamp":1401273872,"content":"Anduin (CORE)\n\nMassing Osgiliath (PoD)\n\nBlood of Gondor\n\nMorgul Vale\n\nEmyn Muin Nightmare"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100271","commentId":1100271,"userName":"MyNeighbourTrololo","timestamp":1401274593,"content":"Steward's Fear\n\nPassage Though Mirkwood Nightmare\n\nFoundation of the Stone\n\nFords of Isen\n\nDead Marshes Nightmare"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100274","commentId":1100274,"userName":"Serazu","timestamp":1401274844,"content":"The Steward's Fear - Not only in my top-5, but my favorite as well. Tense, long and extremely atmospheric with lots of replay value. I also consider it to be the one with the strongest \"horror\" element in an epic fantasy game. Yes, there are quests with spiders, ghosts etc, out there, this one is truly chilling however. And such an original mechanic... No other quest in this game plays like this one.\n\n \n\nFoundations of Stone - The third stage of the quest is truly genius. Till then, the quest was ok, from that point onward however, it truly takes off.\n\n \n\nThe Siege of Cair Andros - What an epic! It feels like I hear the thundering roar of battle, whenever I play this one. The removing quest cards aspect is brilliant and highly thematic: the better you fare at defending, the more of the stronghold remains standing.\n\n \n\nPeril in Pelargir - A quest taken place in a shady port town, starting with a good old-fashioned inn brawl, which later goes on in the streets certainly merits a spot in the top-5. Insidious quest too: much more difficult than initially seem.\n\n \n\nShadow and Flame - A top-5 without an immense boss fight included would have been incomplete. More difficult than The Watcher (unless most of the tentacles swarm at you early on that is), plus it presents the seminal boss in the LotR saga. Shelob, the Watcher, the Witch-King, all pale before the mighty Balrog."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100300","commentId":1100300,"userName":"PsychoRocka","timestamp":1401276945,"content":"> The Siege of Cair Andros - What an epic! It feels like I hear the thundering roar of battle, whenever I play this one. The removing quest cards aspect is brilliant and highly thematic: the better you fare at defending, the more of the stronghold remains standing.\n\nOh man! I think I had this quest on my draft top 5 when I was initially thinking of creating this thread. Definitely a fantastic quest with awesome mechanics and theme. The removing quest cards and stronghold locations that take damage are indeed brilliant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100302","commentId":1100302,"userName":"Serazu","timestamp":1401277150,"content":">  \n> \n> > The Siege of Cair Andros - What an epic! It feels like I hear the thundering roar of battle, whenever I play this one. The removing quest cards aspect is brilliant and highly thematic: the better you fare at defending, the more of the stronghold remains standing.\n> \n> Oh man! I think I had this quest on my draft top 5 when I was initially thinking of creating this thread. Definitely a fantastic quest with awesome mechanics and theme. The removing quest cards and stronghold locations that take damage are indeed brilliant.\n> \n>  \n\n \n\nYeah. The desperate rush to secure the Citadel is one of the highlights of this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100351","commentId":1100351,"userName":"SilvanBouncer","timestamp":1401280741,"content":"Foundations of Stone - lots of fun, theme well executed\n\nBattle of Five Armies - epic battle\n\nSiege of Cair Andros - another epic battle\n\nRedhorn Gate - I thought theme and gameplay came together very well\n\nFlight to the Ford - Knife in the Dark at very a close second\n\nEdited May 28, 2014 by SilvanBouncer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100371","commentId":1100371,"userName":"ana4","timestamp":1401281721,"content":"Conflict at the Carrock. Do not play it anymore but even more than the core set, this had made me the fan of the game I still remain, great memories.\n\nMassing at Osgiliath. Must have played it several hundred times, probably the best out there.\n\nAssault on Osgiliath. This one proves coop is so much more interesting than solo. Lovely locations.\n\nShadow of the Past. Love the passages in the book most. And the theme is well represented. Lovely locations.\n\nFords of Isen. I know this is relatively new but I keep replaying it almost every day.\n\n \n\nI hate quests with complicated set-up, like Steward's Fear or To Catch an Orc, and never replay them (the first for being super dull as well). I used to really enjoy Anduin and Dol Guldur (coop, hated solo) but they are no longer that interesting with the current card pool, and I hate the Nightmare Mode. The Battle of Lake-town and The Battle of Five Armies are both quite interesting though the latter scales badly, being hard in the beginning and easy if you pull through toward the latter stages.\n\nEdited May 28, 2014 by Ana"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100592","commentId":1100592,"userName":"GrandSpleen","timestamp":1401290881,"content":"Steward's Fear\n\nDungeons Deep and Caverns Dim... love the drama created by the riddling mechanic.\n\nFoundations of Stone\n\nThe Redhorn Gate\n\nThe Watcher in the Water"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100606","commentId":1100606,"userName":"Khamul The Easterling","timestamp":1401291489,"content":"Dead Marshes Nightmare -  Escape tests pretty much add another phase which I enjoy.  Cool enemies.\n\nStewards Fear - Very different quest = great\n\nFords Of Isen - Like Glaurung said \"Very consistent\" I do wish Grima wasn't in it though.  I find myself hating the objective allies like Alcaron, Grima....It feels like its a easy mode component.  \n\nMassing at Osgiliath - Scales well with the number of players.  One of the best multi-player quests in my opinion. \n\nReturn to Mirkwood - Great quest.  Amazing in multi-player.  You will never get more big enemies than in this quest.  \n\n \n\nHonorable Mentions \n\nPeril in Pelargir\n\nHills of Emyn Muil Nightmare\n\nThe Long Dark (only when I play with 3+ players....very much looking forward to the Nightmare version)\n\nDruadan Forest\n\nThe Hunt for Gollum Nightmare\n\nEdited May 28, 2014 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100686","commentId":1100686,"userName":"lleimmoen","timestamp":1401294784,"content":"Conflict at the Carrock.\n\nMassing at Osgiliath.\n\nDungeons Deep and Caverns Dim.\n\nAssault on Osgiliath.\n\nA Knife in the Dark."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100697","commentId":1100697,"userName":"monkeyrama","timestamp":1401295103,"content":"Steward's Fear\n\nPeril in Pelargir\n\nMassing at Osgiliath\n\nRedhorn Gate\n\nJourney down the Anduin\n\n \n\nAll just feel really good to play. I haven't played any Nightmare scenarios yet, which by all accounts improve a lot of quests I don't really like (most of Mirkwood, sadly)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100744","commentId":1100744,"userName":"Noccus","timestamp":1401297175,"content":"1. Foundations of stone.\n\n2. Massing at Osgiliath.\n\n3. 7th level.\n\n4. Conflict at the Carrock.\n\n5. Watcher in the water.\n\nThese are all multi player votes.\n\nHaven't played the BR box yet with my group, but much looking forward to it now with all those votes for it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100750","commentId":1100750,"userName":"Noccus","timestamp":1401297454,"content":"Ack I forgot to state why!\n\n1. Love the separation part in multi player in this one. Also: nameless ones!\n\n2. Best thematic quest out there IMO. Really feels like retreating from Osgiliath.\n\n3. So much fun slaughtering piles of orcs multi player.\n\n4. Troll bashing!\n\n5. Massive boss fight! Need I say more? This quest deserves spot 4 I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100763","commentId":1100763,"userName":"Raven1015","timestamp":1401298146,"content":"In no particular order...\n\n \n\nBattle of Lake-town: Nothing quite matches the moment I felled the mighty Smaug for the first time. I do love a good boss fight, and this one matched the epic nature of the moment in the book.\n\n \n\nFoundations of Stone: Obviously loses something in solo, but I love the moment of separation, attachments and enemies getting washed away, and players having to race to reunite.\n\n \n\nWatcher in the Water: Again, I love boss fights, and I love the dilemmas the tentacles and their different effects can bring up.\n\n \n\nA Knife in the Dark: I love the entire Black Riders box, so it's hard for me to pick one, but the fierce showdown at Weathertop wins the day.\n\n \n\nSiege of Cair Andros: This, more than any other quest so far, really got across the feeling of being engaged in a big battle. There are battering rams, orc vanguards, and siege rafts flying around, while you have to protect these battleground locations. And I loved the alternate paths in this quest. I wish that we would see alternate paths used a lot more in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100773","commentId":1100773,"userName":"monkeyrama","timestamp":1401298601,"content":"> Steward's Fear\n> \n> Peril in Pelargir\n> \n> Massing at Osgiliath\n> \n> Redhorn Gate\n> \n> Journey down the Anduin\n> \n>  \n> \n> All just feel really good to play. I haven't played any Nightmare scenarios yet, which by all accounts improve a lot of quests I don't really like (most of Mirkwood, sadly).\n\n \n\nOoops, forgot the 'and why' part...\n\n \n\nSteward's Fear - comes closest to actually achieving a strong narrative which blends with the gameplay. For a card game, that's an immense achievement.\n\nPeril in Pelargir - it's tough, fun, gives a good mix of enemies to fight. I enjoy throwing combat decks at it.\n\nMassing at Osgiliath - the memories mostly. I like that it's an immediate head-scratcher from turn 1, and then adapts throughout. It's getting a lot easier to destroy these days, but at first it was very tough. But always fun.\n\nRedhorn Gate - again, the mix of enemies, treacheries, and locations was satisfying. Interesting mechanics.\n\nJourney down the Anduin - the old classic. I think overall it's often that i like quests that have a consistent first turn (Assault on Osgiliath is a good one for this, if you want it to be). I enjoy the basic problem of early on dealing with a big hitter, and then later watching the enemies build up while you're on a boat.\n\n \n\nI mostly play solo, which affects my choices. I answered with the ones that came into my head. On reflection, the first Black Riders quest is superb, and I like Into Fangorn and the Fords quests alot. But I thought it best to stick with my gut reaction 5."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100786","commentId":1100786,"userName":"ana4","timestamp":1401299139,"content":"Oh yeah, I want to add something that the above hinted at.\n\n \n\nI so much prefer the quests with a given set-up (instead of \"reveal 1 card per player\" type of set-up). The opening has a great weight on the game and sometimes the luck can be against you so badly that you are out. The random set-up intensifies this tremendously -- and can sometimes make games very easy, like if you get a treachery that won't hit you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1100885","commentId":1100885,"userName":"Nickpes","timestamp":1401304104,"content":"Hm ... Interesting\n\n1. Massing at Osgiliath , i believe it is a difficult q uest where players have to combine nearly anything in order to beat it\n\n2. Lake Town, why? Cause there is Smaug, my belovest, and i find it to be very thematic\n\n3. Foundation of Stone, its mechanism where players separate is interesting and makes it very different\n\n4. Rhosgobel ... Dont know why but i love it\n\n5. Flight to the Ford ... Cause there is nothing better than sinking the Nazguls at the ford of Bruinen using Glorfinel!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1101416","commentId":1101416,"userName":"Pharmboys2013","timestamp":1401337847,"content":"No order whatsoever but...\n\n \n\nMassing at Osgiliath- This quest has really stood the test of time.  Still a challenge but never feeling overly cheap.  Good enemies, an epic boss at the end.  The absolute relief of pulling a ranger from the encounter deck that can be sent to his death.  Scales pretty well with multiple players too.\n\n \n\nBattle of 5 Armies- This is a great quest for a lot of the reasons Massing is; challenging encounter cards, boss fight, surprise helpful encounter card with the eagle of the misty mountain.  I also really think this quest did a good job of capturing the feeling of fighting a war on multiple fronts.  I enjoy the 3 quest stages all being in play and requiring different kinds of questing.  Easily the best quest of the hobbit scenarios IMO\n\n \n\nFoundations of Stone-  I havent even played this quest for awhile but its generally considered the best quest...for good reason. I'll leave it at that.\n\n \n\nFords of Isen- A newer one, but one i have been playing A LOT.  Good mechanics (uses the \"time\" quest stages very well, to catch an orc is too punishing, and into fangorn is too easy to make a difference)  Some new unique enemies and 3 unique stages.  This one may only be on this list cause i've been playing VOI consistently since it came out but so be it.\n\n \n\nPeril in Pelagrir- Always been a big fan of this one.  I think the difficulty is just right; challenging without feeling too hard and not worth playing.  Was the first battle quest so I liked experimenting different kinds of decks on it (aka ones that were primarily tactics)  I also like the city setting too.\n\n \n\n \n\nHonorable Mention: \n\nJourney Down the Anduin\n\nConflict at the Carrock\n\nInto the Pit\n\nAssault on Osgiliath"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1101489","commentId":1101489,"userName":"danpoage","timestamp":1401344334,"content":"Siege of Cair Andros: Having the battlefields decide which path you take through this scenario was a stroke of genius. No matter which route you take, the fight is epic. It manages the rare feat of being quite difficult while still rewarding careful planning and clever strategy. Using battle grounds to take the brunt of an early onslaught of enemies just works, both as a mechanic and a thematic representation of the battleground being lost to the enemy.\n\n \n\nConflict at the Carrock: One of the first scenarios (along with Journey Along the Anduin) that emphasized playing with pace. Whereas many of the early scenarios can be quest-rushed through, this scenario really requires careful planning and developing a strategy for dealing with the trolls (Full disclosure: Troll killing is my favorite). It is not without its warts, which were mostly fixed in the Nightmare version, but it remains a fun and thematic quest. It still serves as an excellent test of how well-rounded a deck is.\n\n \n\nThe Morgul Vale: Like Ian, I enjoy a good boss fight. I also really appreciate the unique design of the Nazgûl of Minas Morgul and how To the Tower puts a clock on the game. Many earlier scenarios can be too easy, particularly with decks that have a low starting threat. This is precisely why the Time X keyword was added in the Voice of Isengard - to force players to play faster than they would otherwise play. To the Tower serves a similar purpose. Not being able to build up a huge army of allies in preparation for the Nazgûl makes this an exciting scenario. I especially like that the Nazgûl does not have immune to player card effects, so that you can still interact with him using other cards. I hope that the designers make more creative enemies like this, that require different strategies to defeat. This kind of variety ultimately makes the game better.\n\n \n\nMassing at Osgiliath: Another truly epic quest. As others have mentioned, this scenario scales very well from 1 to 4 players. The limitations on travel and some interesting shadow effects (Morgulduin is great, and by that I mean totally obnoxious) ensure that no two plays of this quest are ever the same. I also especially like the other limitations that the second and third quest cards impose. While it can be frustrating having to sacrifice a hero to stage 3 because none of the Ithilien Rangers came to your aid, this sacrifice makes complete sense thematically. The Witch-king is a truly fearsome enemy and the perfect ending to such a thrilling rush across the river.\n\n \n\nBattle of Five Armies: The mix of Battle, Siege and traditional questing is perfect. Bolg and his bodyguards are indeed fierce. I like all of the choices that this quest gives you. Depending on your deck and play styles, you can choose which quest cards go without progress in the early game and trigger their harmful effects. As the quest proceeds, progress can be removed from the active quest which puts pressure on the players to quest heavily. Enemies have perfect synergy with this mechanic as they become easier to handle as more of the fronts are won over by the players. All and all, this is one of the best examples of elegant design - where theme and mechanics blend seamlessly to create a wonderful story. Also, it has Eagle of the Misty Mountains, one of the best lifesaving objective cards ever made."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1101919","commentId":1101919,"userName":"Johnny Awesome","timestamp":1401377516,"content":"I've only played the Core, 6 Mirkwood, 3 Khazad-Dum and Redhorn Gate so far (but own everything).\n\n \n\nMy favorites in order so far:\n\n \n\nConflict at the Carrock\n\nJourney Down the Anduin\n\nJourney to Rhosgobel\n\nThe Redhorn Gate\n\nThe Seventh Level"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1102343","commentId":1102343,"userName":"Catastrophic09","timestamp":1401397751,"content":"Journey Down the Anduin- classic quest where I fell in love with this game and it's still unique and fun fighting the troll at the beginning, going down the river, enemies not engaging you and then a battle at the end\n\n \n\nThe Redhorn Gate- I really loved how characters could freeze and die in this quest (I played hero Beorn the fist time.. lol), thematically it was a blast and I really felt I was going through a snowy mountain pass\n\n \n\nFlight From Moria- All the quest cards in this one really made it seem you were travelling through Moria and searching desperately to get out\n\n \n\nThe Siege of Cair Andros- damage on locations was great and Battle and Siege keywords really made this quest feel like an epic battle of Gondor proportion!\n\n \n\nEncounter at Amon Din- this one represented the classic rescue villagers, kill orcs and be the hero which I really enjoyed even though it is really easy\n\n \n\nNotable mentions: The Fords of Isen- had a lot of fun and it's instantly one of my new favs.   Journey to Rhosgobel and Hills of Emyn Muil were also some of my early favorites of this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1102510","commentId":1102510,"userName":"Glowwyrm","timestamp":1401407278,"content":"In no particular order:\n\nFoundations of Stone: This quest never disappoints in multi-player.  It's always good fun to split and try to reunite.  While i'm glad they don't overuse the split apart mechanic, it works well here both thematically and for gameplay.\n\nJourney Along the Anduin (standard, but nightmare is good too): If I'm just feeling like a quick game, or I want to run a deck I'm testing through its paces, this is the scenario I play.  The troll is a great threat up front, the raft ride makes sense thematically and mechanically, and it's always a thrill to crash into quest stage three and see what you draw.  The randomness is typically what hurts this quest, something Nightmare helps smooth out a bit by giving consistently awful draws (instead of occasionally easy).\n\nNightmare Dol Guldur: They did such a good job upping the difficulty and theme for the Nightmare version.  Hardest quest I've ever played and it felt so good to win.  It's very thematic, rushing frantically through the dungeon locations, trying to save the prisoner before they're tortured to death, and surviving the horrible treacheries that the encounter deck throws at you (who doesn't love discarding their hand?).  And the Nazgul is actually a force to be reckoned with because he's not the only enemy in the deck to worry about. \n\nTo Catch an Orc: Giving some love to the new stuff.  Really unique mechanics, really tough setup, and a fun boss to contend with.  Plus, the added thematic fun that you are partially responsible for the uruk army that attack Helms Deep.  Whenever I lose the quest, I console myself that Middle Earth is better off.\n\nWe Must Away Ere Break of Day: It was difficult to pick any one saga quest, because I never play them individually.  So many of them are excellent, but to me, this one is the best.  They really improved on Conflict at the Carrock by giving you multiple ways to beat the scenario and the optional challenge of the treasure to collect.  It gives the scenario a lot of replayability because of all the options the players have.  I can't wait to see the nightmare version of this quest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1102717","commentId":1102717,"userName":"Pharmboys2013","timestamp":1401425152,"content":"whoever did that really great hero contest with the brackets and seeding awhile back should do one with the quests. its one thing to name a couple faves but things get really interesting when it goes head to head"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1105610","commentId":1105610,"userName":"divinityofnumber","timestamp":1401683870,"content":"In no particular order:\n\n \n\nJourney Down the Anduin\n\nFoundations of Stone\n\nWe Must Away Ere Break of Day\n\nDungeons Deep and Caverns Dim\n\nFlies and Spiders (On the Doorstep)\n\n \n\nAll of these are thematically superb, mechanically brilliant, and can provide some quite challenging sessions. I should note that I have yet to play the HoN, TBR, or VoI expansions. There are likely thing in those that would have made my list, but I have not played them yet. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1105788","commentId":1105788,"userName":"iznax","timestamp":1401699693,"content":"There are so many now that i can't really tell :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]  Any way those are probably my top 5 currently. In no particular order.\n\n \n\nInto the pit: Maybe the first quest that used locations in a really different way, the torch mechanic is also a nice touch and really thematic too\n\n \n\nThe Battle of Lake-Town: A great boss fight, the Smaug deck makes him feel alive and kicking. The burn mechanic also a great thematic touch\n\n \n\nThe Fords of Isen: A great heavy combat quest.\n\n \n\nA Knife in the Dark: What can i say for this one ?!?!?!\n\n \n\nEncounter at Amon Din: The best truly innovative mechanic so far (in my opinion)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1107566","commentId":1107566,"userName":"player1761766","timestamp":1401818788,"content":"5. The Hunt for Gollum\n\nI really like exploration quests. This one is really good, I feel, for providing a really nice and thematic quest searching for clues, particularly when the game was in its infancy and whatnot. I've not yet had a chance to play NM mode, but it looks like it's the best implementation of NM mode so far!\n\n \n\n4. The Dead Marshes\n\nI've played the Mirkwood quests so often it's unreal, but they each have something that draws me back to them all the time. I really enjoy the Escape mechanic, and generally just really like this quest!\n\n \n\n3. The Steward's Fear\n\nPerhaps the best-designed quest to date, it feels so much like a proper RPG-style game that I was completely enraptured when I first tried it out. The replayability of this one is particularly amazing.\n\n \n\n2. Foundations of Stone\n\nI only ever play this game solo, one-handed, so the splitting-off is something that I can't appreciate (though I do, theoretically). However, the Nameless Thing mechanics are truly splendid, and I really enjoy replaying this one. I also like the fact there is equipment to be found in amongst the foundations!\n\n \n\n1. The Hills of Emyn Muil\n\nNormal mode, no faffing around with NM, this quest is, for me, the most perfect LotR experience you can ever get. So much of the book is an epic quest across country, which is precisely what this quest is all about. More than that, though, the whole point of this quest is to explore Middle Earth - I mean, how awesome is that?! It's unjustly put-down, I feel, by people who would much rather kill stuff, and that's fine; but for me, this quest is just the best. \n\n \n\nHonourable mentions would definitely go to:\n\nBlood of Gondor - despite the whole Hidden Cards thing, I really liked this one. \n\nThe Morgul Vale - love the lieutants thing, like stage bosses in an old-school video game! \n\nFlies and Spiders - I just love that Poisoned mechanic!!\n\nPassage through Mirkwood - it's the first quest everyone ever plays, it's what got us all into this game, so it should be on everyone's lists, goddammit! \n\nEdited June 3, 2014 by spalanzani"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1107852","commentId":1107852,"userName":"NotAZombie","timestamp":1401832953,"content":"In no particular order:\n\n \n\n1. Massing at Osgiliath (Super fun to test decks against. I like the POD for the ease of pulling out and playing.)\n\n2. Journey Down the Anduin (its a bit easy nowadays, but it is fun to test decks against and nightmare mode makes it fun)\n\n3. Stone of Erech (Different and fun)\n\n4. Over Misty Mountains Grim (I think. Second in the first hobbit box. I love the transition from the giants to the swarms of orcs, but the merry/brand combo can seriously nerf this quest.)\n\n5. Foundations of Stone (Multi player at least. It is unique and requires some pretty dedicated deck planning)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1797607","commentId":1797607,"userName":"SauronTheGreat","timestamp":1442356350,"content":"ok I can try this but I may get it all wrong ;/\n\n1:  has to be JDtA.  There is no quest to this day that is more enjoyable.  It never gets old, even if it is not too difficult any more\n\n2: massing at osgiliath.  This one is a go to beat up orc quest.  I love the combat!\n\n3: battle of five armies.  I have no words for the epicness of this quest\n\n4: Over misty mountais grim.  Nother go to quest for combat.  it is just long enough and I love being swarmed by goblins\n\n5: seventh level.  this quest is actually surprisingly challenging multiplayer just cause you generally get at least 2 extra enemies through shadows! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1797670","commentId":1797670,"userName":"PsychoRocka","timestamp":1442358392,"content":"This is the old thread SauronTheGreat, post your favourite five on this new one I started =)\nhttps://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/ [https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1797949","commentId":1797949,"userName":"divinityofnumber","timestamp":1442369913,"content":"No particular order:\n\n \n\n1) Steward's Fear\n\n2) Watcher in the Water\n\n3) Peril in Pelargir\n\n4) Foundations of Stone\n\n5) Encounter at Amon Din\n\n \n\nI also love, as a whole, the Khazad Dum nightmare set of scenarios. Honorable mention to Fog on the Barrow Downs; so much fun to play as a group. \n\nEdited September 16, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/?do=findComment&comment=1797992","commentId":1797992,"userName":"PsychoRocka","timestamp":1442371555,"content":"Guys guys this is the old thread from a year ago, can you please post in the new thread:\nhttps://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/ [https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/]"}]}