{"url":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/","title":"New player : doubts about solo play-","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100183","commentId":1100183,"userName":"Moggrym","timestamp":1401259263,"content":"I recently started playing this lovely game but I have a feeling I'm doing something wrong with solo play.\n\n \n\nI played 10 solo games so far and won none.  Not that I need to win one, I love difficult games but somehow, I can't see how I can ever win a game when playing the starter tactics heroes.\n\n \n\nPlaying the first scenario with the starter Tactics deck I encounter the following scenario very often :  I commit Gimli and Thalin to the quest for a total of 3 will.  I keep Legolas to kill enemies to get progress points.  I have an active location buffering the scenario.\n\nAnd then, during questing the staging area fills up with locations, surpassing my heroes will of 3 and increasing my threat fast.\n\nAs no enemies appear, Legolas and my allies are out of work.  As I already have an active location (and Legolas not able to put progress tokens on it after killing enemies), I cannot remove other locations from the staging area.\n\nI accumulate threat so fast and I can in no way clear the locations.  Often, an enemy appears and I have a shot at gaining a few progress points.  But by then, it's impossible to remove all the locations in the staging area.  So I'm think I'm missing something with removing locations from the staging area.  And yes, I do shuffle the encounter deck.\n\n \n\nThe tactics deck is so depending on Legolas to generate progress tokens.\n\nAre there any other ways to gain progress except from questing and Legolas ?  \n\n \n\nI won one game, when playing it with a friend.  He was able to generate far more will then I could, so he took care of questing, helped by Thalin for his special ability.  I took care of the ennemies with Legolas and Gimli.  It makes me wonder if the game is designed to always play with two, and when solo play you just handle both decks ?\n\n \n\nI haven't played with any of the other decks, maybe the others are more doable playing solo.\n\n \n\nSo in short my questions (for tactics starterdeck):\n\n - I am correct that you can only travel to one location and while that location is active, other locations stay in staging area and there threat is always added to the quest ?  No other means of removing them from staging area.\n\n- Questing is, next to legolas ability after killing an enemy, the only way to gain progress points ?\n\n- Does solo play require you to play two decks ?\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100196","commentId":1100196,"userName":"PsychoRocka","timestamp":1401260964,"content":"-You can put progress tokens on them while they are in the staging area with cards like Asfaloth, Northern Tracker etc\n\n-More or less, but like your first question there are certain cards that will allow you to place progress on a location or quest stage\n\n-Solo play does not require you to play two decks however I very strongly recommend it. In my opinion Solo is completely different (only 1 encounter card revealed each turn during staging rather than 2) and does not allow the encounter deck to perform at its full potential and stops it from combo-ing cards together properly. I play with two decks (as though I am two players) and have a massive amount of fun playing this way, it allows me to include and use a lot more strong/fun cards in my two decks, allows me to dedicate one deck to questing/healing etc and the other to combat and lets the encounter deck function properly. Many players prefer Solo and will give you opposite advice to mine but the fact that you get to use twice as many cool player cards, all four spheres if you want to, get to run many more combos and strategies and the encounter deck will function the same as normal two player (what the game was designed for remember! 2-4 players) in my mind makes two player far superior. It is definitely worth trying out if you are new to the game.\nI personally will never play anything other than two handed (unless I make some new friends who will play with me!) and love my two decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100247","commentId":1100247,"userName":"Moggrym","timestamp":1401270194,"content":"Thanks for the feedback PsychoRocka. \n\n- I don't think the cards you mentioned are in the base deck.\n\n- I'll try playing with two decks tonight.  Hopefully this will make the game more fun.  Right now, if you only draw locations in the staging area, all fun disappears.  This game is highly depending on the correct card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100260","commentId":1100260,"userName":"PsychoRocka","timestamp":1401273126,"content":"Northern Tracker is in the core set! Try running a spirit deck and tactics deck two handed =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100379","commentId":1100379,"userName":"Klausey","timestamp":1401282315,"content":"I would highly recommended using one of the other starter decks if you are learning the game. Mono tactics is fun, but it really isn't suited to solo one-handed play, and especially not suited to solo play without \"Trained for War\", which you will not have yet.\n\n \n\nIf you prefer playing one-handed (I do as well!) you will probably fair better with Leadership or Spirit (purple and blue respectively). The core Leadership set is particularly great because Aragorn can spend 1 resource to ready after questing, giving you two hero actions each round.\n\n \n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100816","commentId":1100816,"userName":"Moggrym","timestamp":1401300474,"content":"Thanks for the feedback both.  I'll try a Leader solo play and a game with two decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1100877","commentId":1100877,"userName":"c08","timestamp":1401303373,"content":"It is deckbuliding issue, so either you need to try build a deck or copy one from other players.\n\nI've tried recently one deck based on Core set only and it is masterpiece.\n\n \n\nSpoiler Deck [http://boardgamegeek.com/thread/1108855/back-to-basics-a-killer-deck-using-only-cards-from]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1101337","commentId":1101337,"userName":"Turin865","timestamp":1401332165,"content":"> -You can put progress tokens on them while they are in the staging area with cards like Asfaloth, Northern Tracker etc\n> \n> -More or less, but like your first question there are certain cards that will allow you to place progress on a location or quest stage\n> \n> -Solo play does not require you to play two decks however I very strongly recommend it. In my opinion Solo is completely different (only 1 encounter card revealed each turn during staging rather than 2) and does not allow the encounter deck to perform at its full potential and stops it from combo-ing cards together properly. I play with two decks (as though I am two players) and have a massive amount of fun playing this way, it allows me to include and use a lot more strong/fun cards in my two decks, allows me to dedicate one deck to questing/healing etc and the other to combat and lets the encounter deck function properly. Many players prefer Solo and will give you opposite advice to mine but the fact that you get to use twice as many cool player cards, all four spheres if you want to, get to run many more combos and strategies and the encounter deck will function the same as normal two player (what the game was designed for remember! 2-4 players) in my mind makes two player far superior. It is definitely worth trying out if you are new to the game.\n> \n> I personally will never play anything other than two handed (unless I make some new friends who will play with me!) and love my two decks.\n\nI totally agree. I gave up on solo and just recently tried playing like solo but playing as two players (excuse the apparent contradiction!) . It was fun and a lot easier with 6 heroes and two decks. Still sololike but seems to be better designed to play this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1103094","commentId":1103094,"userName":"scottindeed","timestamp":1401461326,"content":"Add me to the two-handed list as well.  I've been playing like this for a while now and have never looked back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1103442","commentId":1103442,"userName":"joezim007","timestamp":1401478428,"content":"I go back and forth between true solo and two-handed solo. True solo seems like it'd be very difficult, though, with just the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104371","commentId":1104371,"userName":"booored","timestamp":1401577393,"content":"The argument between solo and two handed has many pros and cons on both sides. Here are my thoughts...\n\n \n\n2 Handed Play\n\n \n\nPro\n\n * While there are a few quests here and there some would argue work better with 1 or 3+ players the VAST majority are designed for 2. I do not think this is in doubt. This game IS a two player game that CAN be played solo or 3+. When you play 2 handed you are experiencing the game in its full glory.\n * There are many mechanics that can not function in solo. Sentinel is useless and Ranged is practically useless. These concepts are basically removed form the game.\n\nCon\n\n * 2 Handed is extremely cumbersome,  managing two decks, and two hands is just a massive pain in the ass. For me this ruins the experience. Much of the focus of the player goes into managing the \"bookkeeping\" of playing 2 handed. Picking up and putting down each hand, trying to remember tons active cards (often more) at once. The elegance of card games, a hand, a draw deck and thoughtful play is removed.\n * You need a ton of space on your table. The game already takes up a lot of room but now you need a ton more. You can not mix your allies remember. Table management becomes another chore to add to hand management.\n * If you look at YouTube videos of even extremely experienced players like CBoTR, Gruunlang, Tragic etc etc.. and listen to people on this board, even people that have been here form the 1st day of release pretty much everyone plays incorrectly. Any player that says they make no mistakes is deluded. People make errors all the time. As they are playing solo there is no one to catch these mistakes and they go unnoticed, so everyone thinks that they are playing perfectly. 2 Handed increases this error factor, due to the over complication of the mechanisms. People make mistakes solo, but people make a MASS of mistakes 2 handed.\n * Most quest are MUCH easier 2 handed. (with some exceptions)\n * Deck building is a LOT simpler. 2 Handed decks require some deck building skills, but it is very basic. There is a reason most decks that are posted are solo decks. Solo decks require skill, 2 Handed decks no so much.\n\n \n\nSolo Play\n\n \n\nPro\n\n * The game is much harder in many ways when you play solo. I would argue it takes more skill to play.\n * The deck building is extremely interesting and challenging as you need to build a single deck to overcome so many situational threats.\n * The elegance of card games is preserved. You have a hand, a play area and a draw deck. Nice and neat and manageable.\n * Surge is a hugely powerful effect in solo play.\n\nCon\n\n * While the deck building is so much better, this also means you need a larger card pool. As in more copies of core and a uptodate pack list.\n * By only revealing 1 card form the encounter deck at a time there are strong arguments that the \"original\" balance of the game is altered. I would say this is correct. While solo is balanced it IS different to 2 handed. That is not in doubt. This is most visible in games that have large monster counts. Still there is strong arguments that the quests are not unfolding \"correctly\".\n * Scry'n the deck is a bonkers powerful effect that is open to abuse. (Peaking at the top card in the encounter deck before questing) This effect has a designed limitation in multiplayer as even if you scry you only see the 1st of a minimum of 2. Leaving 1 card to always be a surprise. In seeing the entire reveal form, the encounter deck the scry effect is disproportionally increased in power.\n * Range and Con effects are reduced, as in engagement management as all cards are going to one player.\n\nThere are probably more points. Play how you like, everyone to their own. For me though, solo is where this game shines. It has the best deck building , that hardest challenge (in most cases) and the most elegant design. 2 Handed just feels to me as a way for people who suck at the game to make it easier.\n\nEdited May 31, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104377","commentId":1104377,"userName":"booored","timestamp":1401577849,"content":"> It is deckbuliding issue, so either you need to try build a deck or copy one from other players.\n> \n> I've tried recently one deck based on Core set only and it is masterpiece.\n> \n>  \n> \n> Spoiler Deck [http://boardgamegeek.com/thread/1108855/back-to-basics-a-killer-deck-using-only-cards-from]\n\n \n\nThat is a 42 card deck. It is invalid. Yes play with whatever you like.. but hey why not play with 20 cards.. or just start with all your allies in play if you are going to just make up rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104497","commentId":1104497,"userName":"PsychoRocka","timestamp":1401590099,"content":"> The argument between solo and two handed has many pros and cons on both sides. Here are my thoughts...\n> \n>  \n> \n> 2 Handed Play\n> \n>  \n> \n> Pro\n> \n>  * While there are a few quests here and there some would argue work better with 1 or 3+ players the VAST majority are designed for 2. I do not think this is in doubt. This game IS a two player game that CAN be played solo or 3+. When you play 2 handed you are experiencing the game in its full glory.\n>  * There are many mechanics that can not function in solo. Sentinel is useless and Ranged is practically useless. These concepts are basically removed form the game.\n> \n> Con\n> \n>  * 2 Handed is extremely cumbersome,  managing two decks, and two hands is just a massive pain in the ass. For me this ruins the experience. Much of the focus of the player goes into managing the \"bookkeeping\" of playing 2 handed. Picking up and putting down each hand, trying to remember tons active cards (often more) at once. The elegance of card games, a hand, a draw deck and thoughtful play is removed.\n>  * You need a ton of space on your table. The game already takes up a lot of room but now you need a ton more. You can not mix your allies remember. Table management becomes another chore to add to hand management.\n>  * If you look at YouTube videos of even extremely experienced players like CBoTR, Gruunlang, Tragic etc etc.. and listen to people on this board, even people that have been here form the 1st day of release pretty much everyone plays incorrectly. Any player that says they make no mistakes is deluded. People make errors all the time. As they are playing solo there is no one to catch these mistakes and they go unnoticed, so everyone thinks that they are playing perfectly. 2 Handed increases this error factor, due to the over complication of the mechanisms. People make mistakes solo, but people make a MASS of mistakes 2 handed.\n>  * Most quest are MUCH easier 2 handed. (with some exceptions)\n>  * Deck building is a LOT simpler. 2 Handed decks require some deck building skills, but it is very basic. There is a reason most decks that are posted are solo decks. Solo decks require skill, 2 Handed decks no so much.\n> \n>  \n> \n> Solo Play\n> \n>  \n> \n> Pro\n> \n>  * The game is much harder in many ways when you play solo. I would argue it takes more skill to play.\n>  * The deck building is extremely interesting and challenging as you need to build a single deck to overcome so many situational threats.\n>  * The elegance of card games is preserved. You have a hand, a play area and a draw deck. Nice and neat and manageable.\n>  * Surge is a hugely powerful effect in solo play.\n> \n> Con\n> \n>  * While the deck building is so much better, this also means you need a larger card pool. As in more copies of core and a uptodate pack list.\n>  * By only revealing 1 card form the encounter deck at a time there are strong arguments that the \"original\" balance of the game is altered. I would say this is correct. While solo is balanced it IS different to 2 handed. That is not in doubt. This is most visible in games that have large monster counts. Still there is strong arguments that the quests are not unfolding \"correctly\".\n>  * Scry'n the deck is a bonkers powerful effect that is open to abuse. (Peaking at the top card in the encounter deck before questing) This effect has a designed limitation in multiplayer as even if you scry you only see the 1st of a minimum of 2. Leaving 1 card to always be a surprise. In seeing the entire reveal form, the encounter deck the scry effect is disproportionally increased in power.\n>  * Range and Con effects are reduced, as in engagement management as all cards are going to one player.\n> \n> There are probably more points. Play how you like, everyone to their own. For me though, solo is where this game shines. It has the best deck building , that hardest challenge (in most cases) and the most elegant design. 2 Handed just feels to me as a way for people who suck at the game to make it easier.\n\nI disagree with everything this rude and ignorant poster has said. Also for whats its worth he has been disrespectful and rude towards two handed players and two handed play in general several times throughout these forums for no reason whatsoever. Do not take his advice on board.\n\nThe elegance of \"thoughtful play\" is in no way removed, if anything because you are playing and strategizing for two decks it is more important AND more fun. Table management is easy unless you are a child.\n\nI for one make very few mistakes, I know this for a fact, probably alot less mistakes than booooored makes.\n\nAs long as you focus on the game its the same as any other play style, simply because there is not a second player does not mean you are gonna make a million mistakes. Unless of course, you are booooooored obviously. Most quests are NOT easier two handed, thats just nonsense. Like YOU YOURSELF SAID \"This game IS a two player game that CAN be played solo or 3+. When you play 2 handed you are experiencing the game in its full glory.\" therefore playing with two players is playing the way every quest is mechanically designed for... allowing encounter cards to combo together making it more challenging.\n\nDeck building is simpler???? You have to make both decks, as perfect or thematic as you can, to also work as best they can with each other and between them cover all bases you need for both decks; healing, questing, attack, defense, threat reduction etc. Compare this to only having to make one single deck that can hold its own.\n\nSolo play does not take more skill and as you said yourself is playing in a weird variation that does not allow the encounter deck to work correctly. I just find it so ridiculous that after stating two player is the way the game was designed to play and listing some pretty big cons for solo you still somehow think solo is better? Also the way that you have written your whole post is not only severly incorrect and misleading to new players but very rude towards those who play two handed.\n\n\"2 Handed just feels to me as a way for people who suck at the game to make it easier\" ????\n\nStop insulting two handed play and other users on this forum. Probably everyone on here who plays two handed are not only much better than you at this game but use more strategy and make less mistakes than you.\n\nStop being a rude and ignorant plague on these forums.\n\nwe're all booooored of it and well and truly boooored of you\n\n \n\nEdited June 1, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104678","commentId":1104678,"userName":"Nerdmeister","timestamp":1401606733,"content":"I actually disagree with Boooored on quite a number of areas and as Psycho mostly find his mannerism insulting.\n\n \n\nOn the matter of 2-handed (which has been discussed at length elsewhere) we are close of a mind than on most issues.\n\n \n\nWhile I do not agree with the whole list, and think that it shines through pretty early where his preferences lie, there are some issues I do agree with.\n\n \n\n1) You do make more mistakes when there are more things to manage, compared to when there are fewer things to manage.\n\n \n\n2) In my opinion (and after having tried it because apparently I \"had to\" to be able to talk about it) 2-handed is easier because you always know what the other player/hand has available; this is a variant discussion on the table talk rules which, in my book, are a positive element of the game, since it minimizes the \"follow-the-king\" kind of playing (and yes I am aware that many people have vastly different opinions on the table-talk rules). By playing 2-handed you eliminate the table-talk rules and can always maximize the interactive plays between the 2 hands.\n\n \n\n3) (paraphrasing) \"I never make mistakes and only booored would\". Now who is being arrogant? Thinking oneself infallible would be the first mistake.\n\n \n\nDon´t have time to write more atm so Ill stick to these few points this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104688","commentId":1104688,"userName":"PsychoRocka","timestamp":1401607594,"content":"I said make few very mistakes not never make them, and anytime I am unsure of anything I check the FAQ and forums. Fair point though.\n\nI agre with everything else you've said though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104697","commentId":1104697,"userName":"Noccus","timestamp":1401609948,"content":"> The argument between solo and two handed has many pros and cons on both sides. Here are my thoughts...\n> \n> 2 Handed Play\n> \n> Pro\n> \n>  * While there are a few quests here and there some would argue work better with 1 or 3+ players the VAST majority are designed for 2. I do not think this is in doubt. This game IS a two player game that CAN be played solo or 3+. When you play 2 handed you are experiencing the game in its full glory.\n>  * There are many mechanics that can not function in solo. Sentinel is useless and Ranged is practically useless. These concepts are basically removed form the game.\n> \n> Con\n> \n> \n> \n>  * 2 Handed is extremely cumbersome, managing two decks, and two hands is just a massive pain in the ass. For me this ruins the experience. Much of the focus of the player goes into managing the \"bookkeeping\" of playing 2 handed. Picking up and putting down each hand, trying to remember tons active cards (often more) at once. The elegance of card games, a hand, a draw deck and thoughtful play is removed.\n>  * You need a ton of space on your table. The game already takes up a lot of room but now you need a ton more. You can not mix your allies remember. Table management becomes another chore to add to hand management.\n>  * If you look at YouTube videos of even extremely experienced players like CBoTR, Gruunlang, Tragic etc etc.. and listen to people on this board, even people that have been here form the 1st day of release pretty much everyone plays incorrectly. Any player that says they make no mistakes is deluded. People make errors all the time. As they are playing solo there is no one to catch these mistakes and they go unnoticed, so everyone thinks that they are playing perfectly. 2 Handed increases this error factor, due to the over complication of the mechanisms. People make mistakes solo, but people make a MASS of mistakes 2 handed.\n>  * Most quest are MUCH easier 2 handed. (with some exceptions)\n>  * Deck building is a LOT simpler. 2 Handed decks require some deck building skills, but it is very basic. There is a reason most decks that are posted are solo decks. Solo decks require skill, 2 Handed decks no so much.\n> \n> Solo Play\n> \n> Pro\n> \n> \n> \n>  * The game is much harder in many ways when you play solo. I would argue it takes more skill to play.\n>  * The deck building is extremely interesting and challenging as you need to build a single deck to overcome so many situational threats.\n>  * The elegance of card games is preserved. You have a hand, a play area and a draw deck. Nice and neat and manageable.\n>  * Surge is a hugely powerful effect in solo play.\n> \n> Con\n> \n> \n> \n>  * While the deck building is so much better, this also means you need a larger card pool. As in more copies of core and a uptodate pack list.\n>  * By only revealing 1 card form the encounter deck at a time there are strong arguments that the \"original\" balance of the game is altered. I would say this is correct. While solo is balanced it IS different to 2 handed. That is not in doubt. This is most visible in games that have large monster counts. Still there is strong arguments that the quests are not unfolding \"correctly\".\n>  * Scry'n the deck is a bonkers powerful effect that is open to abuse. (Peaking at the top card in the encounter deck before questing) This effect has a designed limitation in multiplayer as even if you scry you only see the 1st of a minimum of 2. Leaving 1 card to always be a surprise. In seeing the entire reveal form, the encounter deck the scry effect is disproportionally increased in power.\n>  * Range and Con effects are reduced, as in engagement management as all cards are going to one player.\n> \n> There are probably more points. Play how you like, everyone to their own. For me though, solo is where this game shines. It has the best deck building , that hardest challenge (in most cases) and the most elegant design. 2 Handed just feels to me as a way for people who suck at the game to make it easier.\n\nWhile you state these are your thoughts; did you ever stop to think these \"cons\" of yours might be \"pros\" in the eyes of other people? And vice versa? I'm not talking about myself here, but as a example from your statements to prove my point, I know there are plenty of players that like synchronizing 2 decks, without having the luxury option of multi player. In the end, I do not understand why you always get so worked up about the 2 hand thing. People play the way they like at their own table. Deal with it. Edited June 1, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1104756","commentId":1104756,"userName":"leptokurt","timestamp":1401619989,"content":"To bring the topic back to the OP:\n\n \n\nmono tactics is a very underdeveloped sphere which simply cannot stand its own in solo play. It's a brilliant support sphere in mutliplayer games, but not the slightest bit usable in solo mode.\n\n \n\nAs you will see, solo play is quite fun when you're playing the other spheres. The starter decks are all unsatisfying, IMO, so I'd advice you to build 50 card decks with two spheres. If you do that you can buld decks with one or even two tactics heroes, as you can make up for their lack of WP by using heroes that have plenty of it (Eowyn, Glorfindel)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1105220","commentId":1105220,"userName":"Nerdmeister","timestamp":1401654357,"content":"> mono tactics is a very underdeveloped sphere which simply cannot stand its own in solo play. It's a brilliant support sphere in mutliplayer games, but not the slightest bit usable in solo mode.\n\nCan´t agree whole heartedly with that assesment.\n\nWhile I admittedly have not tried it in a way I would deem exhaustive yet, I did manage to win all 3 of the Heirs of Numenor scenarios with a mono tactics setup that I made in about 20 minutes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107344-new-player-doubts-about-solo-play/?do=findComment&comment=1105344","commentId":1105344,"userName":"booored","timestamp":1401663536,"content":"The shadow cycle really opened Tactics as a solo sphere... but it didn't really get the tools until then."}]}