{"url":"https://community.fantasyflightgames.com/topic/107429-optional-engagement/","title":"Optional engagement","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107429-optional-engagement/?do=findComment&comment=1101357","commentId":1101357,"userName":"Turin865","timestamp":1401333432,"content":"I'm new to playing and cant seem to understand the point of the player optionally engaging step. It seems from the rules and other posts I have read that it is the same effect as enemy engagement. Am a correct to assume that the only advantage would be your character gets to attack first in a sense? Also if you do optionally engage does the enemy you engage draw a face down shadow card and reveal it like when they attack you? Also can all your heroes optionally engage or just one?\n\nThanks and sorry if this question is obvious. I just cant figure it out!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107429-optional-engagement/?do=findComment&comment=1101400","commentId":1101400,"userName":"PsychoRocka","timestamp":1401336770,"content":"So each player (not hero) can only optionally engage one enemy per round. I very often do so to remove an enemy from staging if its engagement cost is higher than my threat but I still want to engage it to remove its threat from the staging area and allow easier questing. \nI also optionally engage to ensure the tougher enemies will engage my combat deck and the weaker enemies will engage my questing deck. Optional engagements are very very very useful and a very important part of combat.\nAlso enemies always perform their attacks first, regardless of how they were engaged.\n\nAs well as this enemies will still gain a shadow card and its effects when attacking regardless of how they were engaged.\n\nHope this helps :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 29, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107429-optional-engagement/?do=findComment&comment=1102177","commentId":1102177,"userName":"c08","timestamp":1401390958,"content":"For me it reason for optional engagement is to protect your game compainion if you know that they won't survie etc.\n\n \n\nOther reason are cards (for Hobbits?) which give you good bonus when attacking enemy with higher engagement cost than player threat level."}]}