{"url":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/","title":"The Massing at Osgiliath","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101615","commentId":1101615,"userName":"Olorin93","timestamp":1401358908,"content":"My friend and I tried this scenario the other day. We had heard that it is a really difficult scenario and had put off playing it for some time. In the beginning it looked rough - but step by step, we pretty much breezed through.\n\nI ran Elrond, Galadriel, Spirit Glorfindel. He ran Imrahil, Leadership Boromir, Lore Faramir. We beat the Witch-King and completed the last stage in two rounds, with all heroes intact. I sacrificed Elrond to quest on the third stage but brought him back with Fortune or Fate the following round. Final threat was around 40 for both.\n\nWe were quite astonished. Does this scenario not deserve its reputation, or was it simply difficult \"at the time\"?\n\nEdited May 29, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101622","commentId":1101622,"userName":"MyNeighbourTrololo","timestamp":1401359228,"content":"It was difficult at the time, obviously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101626","commentId":1101626,"userName":"Nickpes","timestamp":1401359574,"content":"> It was difficult at the time, obviously.\n\nIndeed , with the cards back then it was very difficult. Nowdays I have managed to beat it even with a solo mono Spirit deck.\n\n \n\n \n\nI believe the one still is very rough is Lake Town"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101691","commentId":1101691,"userName":"ana4","timestamp":1401365765,"content":"With a high starting threat like that, every other game you get an untimely shadow effect and the Wolves will eat your hero (direct damage or making the attack undefended right away).\n\nIt is easier solo, by some margin, the more players the harder, 4-players really, really tough.\n\nLower starting threat usually helps a great deal.\n\nDúnhere is a master here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101718","commentId":1101718,"userName":"monkeyrama","timestamp":1401367074,"content":"I do fondly remember the first time I played it, more-or-less in the Core Set days. 'You put HOW MANY enemies in the staging area for EACH PLAYER!!' :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n\n \n\nNow, it's a bit less scary. What I've always liked about the quest is how fair it is. No annoying tricks to be hard, just good old enemies and locations. (it may only be me, but I find attachment hate, especially any 'discard them all' hate, to be just plain old annoying). (Probably because it makes it hard)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101766","commentId":1101766,"userName":"ana4","timestamp":1401370851,"content":"Also, as has been pointed out before, the great thing about this quest is how there are no obvious terrible or easy encounters: many of them are nice at some point and dreadful at another. It is a very well balanced quest. I also remember those days, I think it was in the middle of Shadows of Mirkwood, and it took me some time to beat it: the first who have done it were Rohirrim: Dúnhere, Éowyn, Théodred."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107451-the-massing-at-osgiliath/?do=findComment&comment=1101923","commentId":1101923,"userName":"joezim007","timestamp":1401377903,"content":"Yea, I think it's really only difficult in the beginning, especially with more players."}]}