{"url":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/","title":"Discarding Caught in a Web","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104097","commentId":1104097,"userName":"c08","timestamp":1401548141,"content":"Caught in a Web (CS80)\n\nWhen Revealed: The player with the highest threat level attaches this card to one of his heroes. (Counts as a Condition attachment with the text: \"Attached hero does not ready during the refresh phase unless you pay 2 resources from that hero's pool.\")\n\n \n\nForest Spider (CS96)\n\nShadow: Defending player must choose and discard 1 attachment he controls.\n\n \n\nDriven by Shadow (CS92)\n\nShadow: Choose and discard 1 attachment from the defending character. (If this attack is undefended, discard all attachments you control.)\n\n \n\nThe question is simple. Can I discard Caught in a Web with enemy Shadow effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104142","commentId":1104142,"userName":"CJMatos","timestamp":1401551505,"content":"No. In order to discard an attachment you need to control it.\n\n \n\nAnd you don't gain control of attachments that come from the encounter deck unless it is said by the card itself"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104158","commentId":1104158,"userName":"c08","timestamp":1401553053,"content":"How to resolve Miner of the Iron Hills than (CS61)\n\n \n\nResponse: After Miner of the Iron Hills enters play, choose and discard 1 Condition attachment from play.\n\n \n\nOn most LOTR:LCG forums I've been reading (BGG, Polish Publisher forums) that Miner of the Iron Hills is a way to discard Caught in a Web.\n\n \n\nIf I don't have control I also should not be able to use Miner of the Iron Hills response.\n\n \n\nEdit:\n\n \n\n> Rulebook p.25\n> \n> Players always assume control of attachments that\n> have been played on their characters.\n> \n>  \n\n \n\nSo I assume I have control of Caught in a Web since\n\n \n\n> (Counts as a Condition attachment with the text: \"Attached hero does not ready during the refresh phase unless you pay 2 resources from that hero's pool.\")\n> \n>  \n\nEdited May 31, 2014 by c08"},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104218","commentId":1104218,"userName":"alogos","timestamp":1401559211,"content":"No. In order to discard an attachment you control you need to control it beforehand.\n\nSome shadow effect don't target attachment that you control, but simply attachment.\n\n \n\nNo. Because FAQ describe attachement from the encounter deck as \"not played by any player\" thus you don't assume control of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104231","commentId":1104231,"userName":"c08","timestamp":1401560361,"content":"Thanks for clarification.\n\n \n\nSo there is no way to get rid off Caught in a Web playing with core set only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104248","commentId":1104248,"userName":"Laco","timestamp":1401562837,"content":"You can discard Caught in a Web with shadow effect on Driven by Shadow (CS92) if you defend with hero who has attached this condition attachment.\n\nFor Miner from the Iron Hills response you can discard Caught in a Web."},{"commentUrl":"https://community.fantasyflightgames.com/topic/107615-discarding-caught-in-a-web/?do=findComment&comment=1104250","commentId":1104250,"userName":"Nerdmeister","timestamp":1401562914,"content":"To clarify: miner of the iron hills does not specify that the attachment discarded must be under your control so that is a perfectly valid play."}]}