{"url":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/","title":"Sleepless Malice","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/?do=findComment&comment=1110506","commentId":1110506,"userName":"Mndela","timestamp":1402009078,"content":"Sleepless-Malice.png [http://hallofbeorn.com/Images/Cards/The-Morgul-Vale/Sleepless-Malice.png]\n\n \n\n1. Must trigger the first option or you can chose?\n\n2. 'Each player' --> if one player can't discard... all players must place tokens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/?do=findComment&comment=1110606","commentId":1110606,"userName":"ricedwlit","timestamp":1402015887,"content":"You can choose. Edit: you must do the first since this does not include the word \"either\" (see Jban's response further below with the FAQ reference).  \n\n \n\nNote that you must satisfy your choice, so if you have only two cards in your hand, then you cannot choose the first choice add the one progress token.\n\n \n\nEach player means just that - each player. So in a two player game you could have one person discarding three random cards from their hand and the other putting one progress token.\n\nEdited June 7, 2014 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/?do=findComment&comment=1110649","commentId":1110649,"userName":"GrandSpleen","timestamp":1402020219,"content":"Agreed, that is how I play cards like this also, when you have wording like \"each player must X or do Y.\" \n\n \n\nHere is an example of how they wrote a card in which ALL players have to do X, or Y happens:\n\n \n\nM1338.png [http://hallofbeorn.com/Images/Cards/M1338.png]\n\n \n\nWhen Revealed: Each player may choose and discard 1 card at random from his hand. If all players did not discard 1 card, Fouled Well gains surge. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/?do=findComment&comment=1112437","commentId":1112437,"userName":"Jban","timestamp":1402170911,"content":"I think not! Rules say very clear that when a card instructs must X or Y, that you should do X when X is not possible you need to do Y. It is written in F.A.Q. 1.6 by topic (1.44).\n\n \n\n(1.44) “Must X or Y” vs “must either X or Y”\nIf a card instructs a player to perform one task or perform a second task using the structure “... must X or Y...” then the player must attempt to perform the first task, and performs the second task instead only if the first task cannot be performed.  ...\n \n\nSo you should discard 3 cards and if not, place 1 progress.\n\n \n\nNext to that I think it just counts for every player individually and not for a group. So every player should try to do X and if not do Y. But this is just my interpretation. I don't know this second for sure.\n\nEdited June 7, 2014 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108055-sleepless-malice/?do=findComment&comment=1112590","commentId":1112590,"userName":"ricedwlit","timestamp":1402180852,"content":"Good point - missed the lack of the \"Either\" on the card.  Thanks for update. Clarified my reply as well in case others don't read the thread this far."}]}