{"url":"https://community.fantasyflightgames.com/topic/108205-rear-guard/","title":"Rear Guard","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1112982","commentId":1112982,"userName":"c08","timestamp":1402225606,"content":"Rear Guard (THoEM74)\n\nQuest Action: Discard a Leadership ally to give each hero committed to this quest +1 Willpower until the end of the phase.\n\n \n\nI've encountered around the network opinions that Leadership ally can be discarded from player hand as well as that it can only be an ally which was already in play.\n\n \n\nIf ally could be discarded from player hand this card would be quite useful in some decks.\n\n \n\nQuestion is, can it be discarded from player hand?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1113115","commentId":1113115,"userName":"richsabre","timestamp":1402240985,"content":"im pretty sure it has to be from play, but I would wait for conformation on this\n\nRich"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1113327","commentId":1113327,"userName":"c08","timestamp":1402257061,"content":"I've searched through FAQ and rules and I haven't found anything yet, that would solve this.\n\n \n\nInstead I found card with similar effect.\n\n \n\nRide to Ruin (THoEM78)\n\nAction: Discard a Rohan ally to choose a location. Place 3 progress tokens on that location.\n\n \n\nWhile I was looking through event cards all other effects written on text box pointed exactly what should be discarded or from where it should be discarded.\n\n \n\nIf this type of effect affect player hand, there are more cards that could be used that way.\n\n \n\nIn this case cards mentioned below should be put in player area than other copy in player hand could be discarded when Action was triggerd.\n\n \n\nWestfold Outrider (TVoI6)\n\nAction: Discard Westfold Outrider to choose an enemy not engaged with you. Engage the\nchosen enemy.\n\n \n\nor\n\n \n\nWestfold Horse-Breaker (THfG6)\n\nAction: Discard Westfold Horse-Breaker to choose and ready a hero.\n\n \n\nIn this case Westfold Horse-Breaker who is in play discards Westfold Horse-Breaker that is in player hand and effect is triggered.\n\nEdited June 8, 2014 by c08"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1113353","commentId":1113353,"userName":"Mndela","timestamp":1402258873,"content":"I think if it doesnt say anything specific like 'encounter deck', 'player deck', 'hand', etc..., it means 'discard from play'"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1113693","commentId":1113693,"userName":"GrandSpleen","timestamp":1402282120,"content":"It's in the manual, under \"Paying Costs\" near the back of the book: \"Costs can only be payed with cards or resources that a\n\nplayer controls.\"  Discarding an ally is the \"cost\" of Rear Guard.  You aren't considered to \"control\" a card that is in your hand.  \n\n \n\nThat last bit about the 'control' concept is not well explained in the manual, but it's true... cards like the Thorin hero or Gloin ally only work when you control 5 dwarves, and that means having them on the table, not just in your hand.\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1113849","commentId":1113849,"userName":"c08","timestamp":1402302267,"content":"Thanks.\n\nI was browsing FAQ and rulebook with words like \"discard\" \"target\" etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108205-rear-guard/?do=findComment&comment=1115085","commentId":1115085,"userName":"Nerdmeister","timestamp":1402391645,"content":"Also in regards to the point about westfold outrider and westfold horse-breaker:\n\nEven if you could argue that it could be discarded from hand a cards text is only active as long as it is in-play.\n\nWhich is why Beorn can be brought back to the table with \"Fortune or Fate\" and Landroval."}]}