{"url":"https://community.fantasyflightgames.com/topic/108473-english-core-set-versions/","title":"English Core Set Versions ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108473-english-core-set-versions/?do=findComment&comment=1117433","commentId":1117433,"userName":"tactician93612","timestamp":1402546068,"content":"As an owner/player of two LoTR LCG core sets, I was wondering, where there\n\nare both an FAQ and errata supporting this game.  Now, would it be beneficial\n\nto have a newly updated core set made?  Sure, it's an added expenditure.\n\nAs a player of this awesome game, I would prefer to not have to \"2nd guess\"\n\nthe game and feel I have to continually look up information to ensure I'm playing\n\nthe game correctly.  Plus this would offer a much smoother game play and feel.\n\nWithout losing the overall satisfaction and enjoyment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108473-english-core-set-versions/?do=findComment&comment=1117503","commentId":1117503,"userName":"booored","timestamp":1402555167,"content":"i do not think this will ever happen, and if it dose not for a long time. Cards are always in flux and only a few games have had reprints with errata and they have been around for much much longer. Like aGoT for example. \n\n \n\nGekoth has a thread at BGG where he has made very high quality custom cards for all errata. It is not even expensive. Just print on a good colour printer on nice paper and then cut out and slide the printed face into the card sleeve in front of your existing card. This way there is no physical appearance difference on the back (assuming you use clear) and the card looks as photo awesome as it always did. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/108473-english-core-set-versions/?do=findComment&comment=1117515","commentId":1117515,"userName":"alogos","timestamp":1402556135,"content":"I remember hearing that cards from the last KD reprint got their errata..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108473-english-core-set-versions/?do=findComment&comment=1117521","commentId":1117521,"userName":"booored","timestamp":1402556624,"content":"I can not see why they wouldn't.. I suppose it is just like they feel they could still be in flux or w.e... I dunno. Warhammer Invastion is now no longer getting printed but there is still no ertaa pod pack :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"}]}