{"url":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/","title":"Campaign POD","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1120649","commentId":1120649,"userName":"Robes","timestamp":1402743940,"content":"What are the chances of seeing something like this?  I'd love a POD set that linked together all of the expansions and adventure packs in one cycle.  Make it compatible with nightmare mode too, would be fantastic.  Imagine questing through the Shadows of Mirkwood cycle, gathering treasures, boons and burdens as you go and losing heroes and allies.   I think it could become an engrossing adventure.  Come on FFG, do it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1120666","commentId":1120666,"userName":"MyNeighbourTrololo","timestamp":1402745558,"content":"Zero. Though I speculated on this matter and would love for them to do something like this, I think they will never do such a thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1120672","commentId":1120672,"userName":"Robes","timestamp":1402746092,"content":"I think it would be as popular, if not more so than the nightmare decks? Seems a shame if there is no consideration being given to this kind of an expansion, the game would seem much more epic with adventure pack cycles linked together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1121123","commentId":1121123,"userName":"player1761766","timestamp":1402780800,"content":"I'd be really interested in seeing something like this implemented. It's been speculated on before, as Trololo says, even going back to the Weather cards idea as a form of burden/NM implementation. While we've seen nothing yet, I wouldn't go so far as to say never, because I get the feeling that the design team really love the game they're working on, and are really keen to keep it \"living\" as much as they can. \n\n \n\nHowever, seeing how the idea has developed from its beginnings with objective allies or artifacts, though the treasures of the Hobbit boxes to the complex set of new card types in Black Riders, I can see something akin to this being introduced in further cycles. The greatest argument against them doing this in the cycles is that each pack ought to stand on its own, and FFG shouldn't make people buy all six packs. But then, I'd like to hazard that the majority of people who buy this game do buy every pack in a cycle? Right from Shadows of Mirkwood we had cards that \"belong\" together (the song cards) but were separated out among the packs, and in Against the Shadow we had that whole ongoing narrative thing. So I don't thing FFG is averse to providing a thematic link through their AP cycles. Whether we'll see that to the extent that we're seeing it in the Saga boxes will remain to be seen, but I can absolutely see something approaching this come out at some point. \n\n \n\nSuch are my thoughts, at any rate! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1121294","commentId":1121294,"userName":"Rapier1","timestamp":1402792830,"content":"I don't see why this wouldn't come out eventually. I mean it's a fun and thematic way to boost the enjoyment and tweak difficulty.\n\nI guess the question is whether they think it's worth the design time since to benefit from the mirkwood campaign POD you would need to own 6 expansions already (where as to sell the nightmare pod they only need you to own one).  On the other hand I imagine the design space required to create 1 campaign card and some boons and burdens is fairly low compared to creating 6 nightmare expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1122215","commentId":1122215,"userName":"booored","timestamp":1402876559,"content":"seams like the kind of thing that the community could do. I mean if you want this.. then just make it yourself. People here will help you with rule tweaks and cards design. Might be a fun community project."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1123088","commentId":1123088,"userName":"Raven1015","timestamp":1402942688,"content":"This is on top of my wishlist for \"extras\" right now, and I think it would work fantastic for game nights if they really want to push stores to include LOTR. There's nothing that brings gamers back like \"leveling\" up their characters and continuing a story. \n\n \n\nUntil then, I agree that this is a good area for someone to create some custom campaign stuff. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1123128","commentId":1123128,"userName":"Robes","timestamp":1402943952,"content":"I think also it could be a nice way to contain or \"repair\" the difficulty for older quests, perhaps with each campaign POD FFG could include an easy, normal and hard player card pool list.    \n\n \n\nI agree, the leveling up and narrative of a campaign quest would be a real draw for me too Raven.  I have my fingers crossed for an expansion!\n\nEdited June 16, 2014 by Robes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1123996","commentId":1123996,"userName":"Rapier1","timestamp":1403003779,"content":"Chances are much higher now that we've seen PoD expansions that include boons for campaign use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1124028","commentId":1124028,"userName":"OnkelZorni","timestamp":1403008955,"content":"Though I don't like speculating that much but in this case I really hope we will something like this in the future and for me it's quite certain that this might really happen.\n\n \n\nCross your fingers guys!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1125020","commentId":1125020,"userName":"Snowhive","timestamp":1403075870,"content":"From the german retailer we have the information, that 'The Old Forest' and 'Fog on the Barrow-downs' are part of the Lord of the Ring saga and can played within the campaign modus from the box 'Black Rider'. So they do it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1125030","commentId":1125030,"userName":"PsychoRocka","timestamp":1403081343,"content":"This is true Snowhive and is very exciting may I say, however they're referring more so to the shadows of mirkwood, dwarrowdelf and heirs of numenor cycles that are like sagas thematically but not mechanically. Nothing really chains them together and rewards you for playing them in order/together other than the narrative for each.\n\nEdited June 18, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1126077","commentId":1126077,"userName":"Snowhive","timestamp":1403159987,"content":"> This is true Snowhive and is very exciting may I say, however they're referring more so to the shadows of mirkwood, dwarrowdelf and heirs of numenor cycles that are like sagas thematically but not mechanically. Nothing really chains them together and rewards you for playing them in order/together other than the narrative for each.\n\nOK, you are right. That will be great, than the Cycles will be bound together in an campaign. One, in German, has made a campaignmode for the mirkwood cycle. In the moment it isn't very good playtestet.\n\n \n\nI don't think that it will come from FFG. But it would great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1126201","commentId":1126201,"userName":"Robes","timestamp":1403175357,"content":"It's great to see the POD's fleshing out The Lord of the Rings campaign, however currently we only actually have one complete campaign, that's the Hobbit (am I right?). For such an epic storyline and setting I think that's a shame which is why I'm eager that FFG put together some kind of POD to turn each cycle into a campaign, it's a quick and easy fix that could earn them money. Perhaps some PODs fleshing out The Hobbit might be nice too?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1126682","commentId":1126682,"userName":"player1761766","timestamp":1403201446,"content":"I suppose the thing with the Treasures, plus we have pretty much every major game-able episode from the Hobbit covered (except, maybe, the escape from Thranduil's Halls? But that might be too prescriptive...I don't know. Plus it would just be Bilbo freeing the dwarves, which is what he does in Flies and Spiders anyway), I don't know if they'd produce anything more for The Hobbit. But when does movie #3 hit theatres, is it December again? Maybe they'll surprise us...\n\n \n\nBut to reiterate what I put above, it would be a really good thing to have, I feel. Whether FFG feel the design outlay might outweigh the market for one pack per cycle (though as I said, I imagine the majority of players who play this game have every pack in a cycle). \n\n \n\nSomething that instantly leaped to my mind is a boon title card along the lines of \"Trollslayer\" that you can add to your setup if you successfully complete Conflict at the Carrock, and that reduces a troll enemy's defense to 0 for the first engagement or something, as recognition of your fame as a trollslayer. But then, the Wilderlands encounter set is only used in two subsequent adventures in the Mirkwood cycle, so hmm. \n\n \n\nPerhaps the almost-random distribution of encounter sets in each adventure might work against this sort of overarching theme to a cycle? Just how valuable would having specific titles like that be given that distribution? Hm. I don't know, I'm not a game designer. They could produce cards other than titles, of course (but hopefully not just treasures, because that would feel a bit lazy to me in comparison to what we've seen from Black Riders!). But I hope we see something!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1129501","commentId":1129501,"userName":"Cunir","timestamp":1403476081,"content":"There was a good topic a while back (i cant remember who suggested it now) about unlocking cards as you played through the quests. So you couldn't include any dwarves in your deck until you reached the khazad-dum quests, for example. and the same with all the other races... elves and rohan stuff... they would only unlock once you reached a quest where they live.\n\nIt would work with all the attachments and allies too. I thought that was a really cool idea\n\nThe guy even worked out where all the quests took place on the map, and suggested where they would all unlock\n\n----—\n\nEdit: i found the topic... http://community.fantasyflightgames.com/index.php?/topic/82683-campaign-lotr/ [https://community.fantasyflightgames.com/index.php?/topic/82683-campaign-lotr/]\n\nThe nightmare rules definitely need an overhaul anyway, even if FFG don't do this campaign thing. It is crazily hard, and you don't get the sense that the characters are moving from one quest to another.\n\nI reckon they should make you continue with the cards that have been played (so they stay in play at the beginning of the next quest), and only let you rebuild the part of your deck that is out of play. If they completely do away with the 6 card draw at the start of the next round, so your hand is totally empty at the start, and keep the wounds on -- coupled with the fact that you cant tailor half your deck to match the quest -- then that will go a little way towards evening it out.\n\nEdited June 22, 2014 by Cunir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1130364","commentId":1130364,"userName":"player1761766","timestamp":1403543214,"content":"> The nightmare rules definitely need an overhaul anyway, even if FFG don't do this campaign thing. It is crazily hard, and you don't get the sense that the characters are moving from one quest to another.\n> \n> I reckon they should make you continue with the cards that have been played (so they stay in play at the beginning of the next quest), and only let you rebuild the part of your deck that is out of play. If they completely do away with the 6 card draw at the start of the next round, so your hand is totally empty at the start, and keep the wounds on -- coupled with the fact that you cant tailor half your deck to match the quest -- then that will go a little way towards evening it out.\n\n \n\nI can say that this approach is still my preferred \"nightmare version\", largely because I misunderstood the original rules back in the day so played it that everything that was in play at the end of the last quest remains on the table for the next quest. Though I didn't do anything to my deck or hand, or threat counter. But while it is a really good way to play (for me), it does lead to something of an advantage if you have amassed a large fellowship over the course of the previous quest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1131397","commentId":1131397,"userName":"booored","timestamp":1403606627,"content":"nightmare rules make the game to easy.. like almost impossible to loose, so it is a must to chnage them"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108655-campaign-pod/?do=findComment&comment=1131772","commentId":1131772,"userName":"player1761766","timestamp":1403630463,"content":"> nightmare rules make the game to easy.. like almost impossible to loose, so it is a must to chnage them\n\n \n\nI would just counter that by saying nightmare rules are perceived to make the game too easy. Because if you haven't been able to manage your threat, or all your tricks have gone, there is nothing easy about starting on Return to Mirkwood with your threat at 49. "}]}