{"url":"https://community.fantasyflightgames.com/topic/108762-new-art-sleeves/","title":"New art sleeves?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108762-new-art-sleeves/?do=findComment&comment=1122509","commentId":1122509,"userName":"Olorin93","timestamp":1402909315,"content":"My friends and I would love to see some new art sleeves for this game. So far we've only found Gimli, Daughter of the Nimrodel and the normal One Ring images for player cards. One of my friends is a Gondor player and he likes his Nimrodel sleeves, but we looked for quite a while for Gondor-themed ones. My other friend favours Rohan, but none seem to be available. I use transparent ones myself.\n\n \n\nDo you think we'll see new art sleeves during this coming cycle, or have they abandoned it? Gondor, Rohan, Noldor och Silvan art would be most welcome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108762-new-art-sleeves/?do=findComment&comment=1122540","commentId":1122540,"userName":"richsabre","timestamp":1402912928,"content":"i havent seen any new art sleeves since the game began really ... just the eye i think was later\n\n \n\nthere are others you havnt mentioned though, i have all the player art sleeves - there are 4. gimli, daughter, gandalf and nazgul :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108762-new-art-sleeves/?do=findComment&comment=1122591","commentId":1122591,"userName":"Olorin93","timestamp":1402919999,"content":"Right, forgot about Gandalf! The Nazgûl is actually pretty cool; might get that for encounter decks. That would ruin me, though - if I sleeve one encounter deck, I'll probably want to sleeve the lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108762-new-art-sleeves/?do=findComment&comment=1122596","commentId":1122596,"userName":"richsabre","timestamp":1402920972,"content":"hahaha, yeah i thought that ...tooo many :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nso i have the 4 sleeves, i have gimli for my heroes (which i now have to buy more of becuase we must have gone past 50 now) and the other 3 i use for player decks... the ecounter cards just have to be sleeveless"}]}