{"url":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/","title":"Shadow effects / Treachery cards that inadvertently have a positive effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1126261","commentId":1126261,"userName":"Robes","timestamp":1403179848,"content":"I was just playing The Hunt for Gollum again and I had an interesting experience when Pursued by Shadow came up as a shadow effect. The shadow effect is to return an exhausted ally to your hand. In this instance I had just quested with Gandalf and I had the opportunity to place him back in my hand and then play him again the next turn, very nice thank you!\n\nSo I'm interested to know, are there any other unique circumstances where a treachery or shadow effect has actually aided you in the game rather than hindered you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1126265","commentId":1126265,"userName":"iznax","timestamp":1403180496,"content":"I thing the most common is: shadow says return attacking enemy to the staging area, Dunhere says thanks  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1126305","commentId":1126305,"userName":"richsabre","timestamp":1403183116,"content":"oh yes, this is great when it happens :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] one that comes to mind is when hunters from morder have +6 attack with clue cards, and then one gets discarded ... if i remembering this right, its been a while since i played that quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1126312","commentId":1126312,"userName":"alogos","timestamp":1403183834,"content":"Some of the best :\n\nSteward's Fear : Flase Lead. First turn in 4 player game, the second or third card revealed... 1 lonely enemy. In the end, two turn of setup (like we were playing Legacy of Numenor and Deep Knowledge for 1 threat raise).\n\nAssault on Osgiliath : The Power of Mordor (only in 4 player game, otherwise it's really easy). We claim back some location, but there is to many in the staging, we will lose because their effect (when a character leave play + when you lose control of a location) keep happening like crazy. Power of Mordor revealed, no location comes. We won at the end of the turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1129192","commentId":1129192,"userName":"player1761766","timestamp":1403450725,"content":"Street Fighting in Assauly on Osgiliath - worked tremendously well for me last time, as I discarded virtually every enemy and treachery in trying to find an Osgiliath location to claim. As that quest was the one that put the final progress token on the only other Osgiliath location in play at the time, I won with only two locations. Marvellous! \n\n \n\nI can't really think of any others off the top of my head, but there are a few in the Mirkwood cycle, as I remember, that are so highly situational that they're more often than not free quests for me. (Ah, pre-crazy-Surge days!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1129337","commentId":1129337,"userName":"TwiceBorn","timestamp":1403462209,"content":"In Passage Through Mirkwood (Core box), there is a treachery card (\"Caught in a Web\") that acts as a Condition attachment. If that attachment is in play on the defending player, then the Shadow effect of a forest spider (\"Defending player must choose and discard 1 attachment he controls\") could allow the player to discard that attachment… is this correct?\n\n \n\nAs far as I understand it, Caught in a Web would be under the player's control, since p. 25 of the rulebook states: \"Players always assume control of attachments that have been played on their characters.\" Is my interpretation of \"control\" of Caught in a Web correct?\n\n \n\nOr are attachments that come out of the encounter deck not deemed to be \"played\" by and/or under the \"control\" of the player? The same page also states that \"A player \"controls\" all cards that he owns, unless another player or the encounter deck takes control of the card through a game effect\"? Caught in a Web is clearly an encounter card not owned by the player… but is the encounter deck considered to have taken control of the card through a game effect after it has been attached to the player?\n\n \n\nI find the rules ambiguous on this, and don't think the FAQs address this. I'm still a noob, and welcome your feedback on this. \n\nEdited June 22, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1129378","commentId":1129378,"userName":"CJMatos","timestamp":1403465763,"content":"From FAQ:\n\n \n\n(1.06) Control of Non-objective Encounter Cards\nPlayers do not gain control of encounter cards unless control of the card is explicitly granted by a card effect. When an encounter card (such as Caught in a Web, CORE 86) becomes an attachment and attaches to a character, that character’s controller does not gain control of the attachment.\n \nSo your first interpretation is incorrect"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108979-shadow-effects-treachery-cards-that-inadvertently-have-a-positive-effect/?do=findComment&comment=1129463","commentId":1129463,"userName":"TwiceBorn","timestamp":1403472983,"content":"Thanks, CJMatos. I evidently missed that in the FAQ -- must have scanned too quickly. The ruling makes sense."}]}