{"url":"https://community.fantasyflightgames.com/topic/108999-few-questions-about-rules/","title":"Few questions about rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/108999-few-questions-about-rules/?do=findComment&comment=1126636","commentId":1126636,"userName":"mroni","timestamp":1403199299,"content":"Hi. I've got a few questions about game. I hope you can help me.\n\n \n\n1. When enemy attacks beyond attack phase, should I deal shadow card?\n\n \n\n2. Let's assume that goblin gate is in the staging area. I reveal enemy from encounter deck.\n\n    Then, using Thror's map, I make goblin gate as active location. And now, should I resolve   \n\n    ambush? On goblin gate text says, that the first enemy gains ambush, but I make goblin gate\n\n    as active location after I reveal that enemy. What should I do?\n\n \n\n3. When I play Feint for mountain warg, should I check if there is effect on shadow card?\n\n \n\nThanks for your help and sorry for my English :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png].\n\nEdited June 19, 2014 by mroni"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108999-few-questions-about-rules/?do=findComment&comment=1126892","commentId":1126892,"userName":"joezim007","timestamp":1403213861,"content":"1. From FAQ (found on the LotR support page [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]):\n\n \n\n>  \n> \n> (1.26) Enemy attacks outside of the combat phase\n> If an enemy attacks outside of the combat phase, it is still dealt a shadow card at the beginning of the attack. Then follow the 4 steps under Phase 6 “Combat” in the rules. Any shadow cards dealt to the attacking enemy are discarded after the attack resolves.\n\n \n\nDoesn't make much sense to me since dealing shadow cards is part of the combat phase that happens before the attack, but that's what the official ruling says.\n\n \n\n2. Goblin Gate's ability is not active until after the enemy is revealed. It only applies to enemies that are revealed after it becomes the active location. Also, the Ambush rules say \"When an enemy with the ambush keyword enters play...\". The window for triggering the Ambush effect has already passed.\n\n \n\n3. If an enemy does not attack, it's shadow card is not revealed. Shadow cards are flipped during the steps of an enemy attack and Feint skips all of these steps. So Mountain Ward will NOT return to the staging area since we cannot determine whether or not there was an effect.\n\nEdited June 19, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/108999-few-questions-about-rules/?do=findComment&comment=1126901","commentId":1126901,"userName":"mroni","timestamp":1403214287,"content":"Thank you very much for Your help."}]}