{"url":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/","title":"Hall of Beorn Card Search now includes Artists","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1129572","commentId":1129572,"userName":"danpoage","timestamp":1403481937,"content":"I'm pleased to announce that the Hall of Beorn Card Search now includes the Artist for each card in the game. The artist can be found on the detail page for each card, and clicking on their name will take you to their online gallery or deviantART page. Also, card searches can now be filtered by artist:\n\nhttp://hallofbeorn.com/Cards/Search?Artist=Magali+Villeneuve [http://hallofbeorn.com/Cards/Search?Artist=Magali+Villeneuve]\n\n \n\nEnjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1129708","commentId":1129708,"userName":"joezim007","timestamp":1403492960,"content":"Cool :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1129801","commentId":1129801,"userName":"Narsil0420","timestamp":1403502172,"content":"I saw this today, didn't realize it was new but realized its awesome! They really do deserve more credit and it's interesting to compare different pieces by the same artist. Sometimes they're very different depending on the subject"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1129892","commentId":1129892,"userName":"Mndela","timestamp":1403512733,"content":"Wow, great job"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1129920","commentId":1129920,"userName":"Olorin93","timestamp":1403515911,"content":"Very cool! Good job. My favourite is probably Magali Villeneuve - and now that I search for her player cards I realise that I've probably been using them the most, since I mainly play elves.\n\n \n\nEDIT: I like how she's done both the ally Gildor and the event Gildor's Counsel - the art sort of carries over. (On a side note, I think Gildor's Counsel would be much more playable if you could lower its cost while Gildor is in play.)\n\n \n\nEDIT 2: I just noticed that the \"artist\" dropdown menu does not seem to reset when you click \"clear filters\".\n\nEdited June 23, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1130238","commentId":1130238,"userName":"danpoage","timestamp":1403537069,"content":"Good catch, Olorin93. I forgot to add the artist dropdown to the list of filters that are reset when you click that button. I will have this fixed tonight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1130444","commentId":1130444,"userName":"ana4","timestamp":1403545959,"content":"Good job.\n\n \n\nBeorn, when do you think you shall put the Dunland Trap cards online?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1130508","commentId":1130508,"userName":"danpoage","timestamp":1403548362,"content":"I will add the Dunland Trap cards once I have card images."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1130665","commentId":1130665,"userName":"Catastrophic09","timestamp":1403555777,"content":"This is amazing Beorn!! Thanks so much, this is such an amazing card search engine!! I appreciate all the work you put into it, now I can check out my favorite artists easier and discover just how many cards certain artists did!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1130849","commentId":1130849,"userName":"Catastrophic09","timestamp":1403563873,"content":"Hey I have a question Beorn: Is there an easy way to add a feature so that as you're browsing through cards you don't spoil cards you haven't seen yet? Or to simply exclude certain expansions? For example, say you don't have the Black Riders and you're searching events to add to your Tactics deck and suddenly you see Halfling Determination and now you've accidentally spoiled a card..  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]  Before I was fully caught up and had all the current cards I would have to very carefully use the card search so I didn't spoil cards I didn't have. So if you could have a filter option to exclude Black Riders or whatever expansion(s) someone didn't have then they could browse through the search engine without having unwanted cards spoiled.\n\n \n\nThis could also be helpful if you were checking out enemy stats and didn't want Nightmare enemies included in your search, which currently appear first when searching for this. I would enjoy having the option to exclude Nightmare from searches since it is a unique part of the game and I don't have many.\n\n \n\nJust a thought, although many who use the search engine probably have all the cards, or people maybe don't care about cards being spoiled, and also I wouldn't want too many features making the search engine too complicated, especially since you would have to be able to select multiple expansions to be effective and currently you can only select one option from each category. So it's up to you, just a suggestion, thanks!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1131228","commentId":1131228,"userName":"danpoage","timestamp":1403586973,"content":"I am looking into adding support for multiple filters for a single search.\n\nFor example allies in the Leadership Sphere OR Spirit Sphere. This could theoretically be used to filter for only the sets that you want to see. Since I don't currently support NOT/EXCEPT filters (e.g. everything EXCEPT The Black Riders) it would be very cumbersome. To be honest avoiding spoilers is currently very low on my priority list - spoilers are one of the big reasons people come to a search engine.\n\n \n\nStill, one feature that I could easily add would be to provide a filter by release date. That way, players who purchase the cards in release order could filter out cards that they have not purchased yet. For those that buy cards piecemeal, there really isn't an easy way to support this feature. As with any website, there are only so many features that can be included before it becomes overly cumbersome to use. My goal is to continue to improve the user experience with often-requested features (like multiple filters) while keep the interface clean. Ultimately, it is impossible to create a search engine that gives everyone exactly what they want.\n\n \n\nI am definitely adding the release date filter to my priority list, hopefully this will give you what you are looking for. I try to release updates to the site every couple of days, so be on the lookout for this feature in the near future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1132074","commentId":1132074,"userName":"Catastrophic09","timestamp":1403643430,"content":"All that sounds great! The release date idea sounds really good and being able to look at allies from multiple spheres will also be cool to have. Thanks! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109213-hall-of-beorn-card-search-now-includes-artists/?do=findComment&comment=1136365","commentId":1136365,"userName":"Kerstoid","timestamp":1403943678,"content":"Thank you so much Dan!  This is tremendously helpful as I love to see what other cards a certain artist has done.  Amazing work!"}]}