{"url":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/","title":"Infinite combo deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131474","commentId":1131474,"userName":"DaeMord","timestamp":1403613654,"content":"I post this, not because i want to go \"look at this awesome deck idea\" but actually because i would like to see it get an errata to prevent it in the future\n\n \n\nSo the combo revolves around We Are Not Idle and Lure Of Moria to exhaust dwarfs and then ready them again, an obvious combo im sure many have seen and used before which in and of itself isnt too bad.\n\n \n\nThe issue is a friend of mine has added the world of card draw and discard recycle with will of the west to allow him to do this infinite times combined with campfire tales into the combo allows everyone in a multiplayer game to draw their entire deck\n\n \n\nHere is the complete decklist for people to look over and tell me if their is something missed that does not allow this to work due to an errata i do not know about, and if not then for FFG to errata it in the future.\n\n \n\nHero\n\n \n\nDain Ironfoot\n\nBifur\n\nThorin Oakenshield\n\n \n\nAlly\n\nDori x1\n\nErebor Hammersmith x3\n\nErebor Record Keeper x3\n\nEred Nimrais Prospector x3\n\nLongbeard Map-Maker x1\n\nLongbeard Elder x3\n\nGloin x1\n\nMiner of the Iron Hills x2\n\nErebor Battle Master x2\n\n \n\nAttachment\n\nHardy Leadership x2\n\nKing Under the Mountain x2\n\nLegacy of Durin x2\n\nNarvi's Belt x1\n\nSong of Wisdom x1\n\nSong of Travel x1\n\n \n\nEvent\n\nA Very Good Tale x2\n\nCampfire Tales x3\n\nDaeron's Runes x3\n\nLure of Moria x2\n\nWe Are Not Idle x3\n\nWill of the West x2\n\nHidden Cache x3\n\nLoriens Wealth x3\n\nGrim Resolve x1\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131491","commentId":1131491,"userName":"Nerdmeister","timestamp":1403614445,"content":"You are saying an infinite number of times. And while you do not say so I would like to point out that We are Not Idle only allows a person to draw 1 card, no matter how many dwarfs have been exhausted.\n\n \n\nI would hardly call that setup overpowered though it is draw-heavy with events as Daeron´s Runes, Lorien´s Wealth and quite a few minor card draws.\n\nA card like Peace and Thought (if you have the readying effects in place) is more effective at generating personal card draw than what I´m seeing here.\n\n \n\nIf I overlooked anything maybe you would take it step by step how the combo goes off so powerfully?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131512","commentId":1131512,"userName":"DaeMord","timestamp":1403615296,"content":"not a problem\n\n \n\nThis is the minimum requirement that my friend and i have worked out, although we have no extensively tested if it can be done with less\n\n \n\nSo in hand needed\n\nLure of Moria x1\n\nWe Are Not Idle x1\n\nLorien's Wealth x3\n\nWill of the West x1\n\n \n\nand in Discard\n\nWill of the West x1 (and only this if there is more then more card draw is needed in hand ofc as well as the resources to paly)\n\n \n\nEmpty deck\n\n \n\nI will grant you this is quite a setup but ill get back to this when i have explained\n\n \n\nSo in a nutshell\n\nWe are not idle, generate resources (we have worked out you need 10 dwarfs for this specific hand combo to be safe)\n\nLure of moria ready all dwarfs\n\nWill of the west from hand to shuffle discard\n\n \n\nDeck now has 3 cards in it\n\nLure of Moria\n\nWe are not idle and will of the west\n\n \n\nuse Loriens Wealth you now have them back and can go again\n\nthe 3 loriens wealths are needed to keep the card draw up you will never have more than 5 cards in the discard/deck so you can happly add <insert card you wish to repeat over and over here> to do infinite times on top of resource generation\n\n \n\nI realise this sounds like quite a complicated setup but please bare in mind this is the minimum required as soon as you add all the card draw into the deck this becomes easier and easier and requires less and less in hand and allows more and more to be in the discard being recycled (with the campfire tales in the discard you can have 1 more card above 5 per copy without stalling the combo)\n\n \n\nAlso worth pointing out at its core it is a dwarf deck with lots of natural card draw simply from playing dwarfs so reaching this double empty point often is not as hard as it sounds.\n\n \n\nWe have had this combo go off in active games around turn 7/8 before and then it simply wins the game for us due to allowing everyone to play everything and deck out, and as its all done with events there isnt much restriction on when it can be done, this we find is the real power of it.\n\nEdited June 24, 2014 by DaeMord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131537","commentId":1131537,"userName":"OnkelZorni","timestamp":1403617020,"content":"Hmm while I see this as critical as you I must mention that in turn 7/8 you should have finished most scenarios anyway"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131554","commentId":1131554,"userName":"Teamjimby","timestamp":1403618136,"content":"Yeah, I've heard of people beating scenarios on turn 1 using this combo along with cards that place progress tokens.  I don't believe there have been any errata to fix it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131568","commentId":1131568,"userName":"alogos","timestamp":1403618676,"content":"For reaching it earlier you need needfull to know and maybe legacy of numenor (add galadrim's counsil if you are worried for your threat).\n\nWell, no errata yet because the previous infinity loop was easier, and they broke the most useless card in the loop... whatever, as a cooperative game, they don't intend to fix it anyway. Only the will to actually play a good game prevent most of the people to play this.\n\nOutlands + Doomed cards are quite badass/boring too... you don't need an infinite loop, but 16 outlands at turn 4 at best is enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131779","commentId":1131779,"userName":"muemakan","timestamp":1403630951,"content":"> Yeah, I've heard of people beating scenarios on turn 1 using this combo along with cards that place progress tokens.  I don't believe there have been any errata to fix it.\n\n \n\nWhich quests and what cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131784","commentId":1131784,"userName":"DaeMord","timestamp":1403631102,"content":"You are indeed correct that by turn 7/8 the game is usually over, with that said its over good or bad, and this can turn an almost guaranteed failure into a win on that vital turn when all is lost, namely turn 7/8 and in testing, thats exactly what it did do.\n\n \n\nThere is other combos that are powerful and i do not mind \"power combo's\" but infinite combo in this game specificly means you have won as the encounter deck cant do anything to counter it as unlike a vs game the encounter deck cant hold back stuff to counter you with.\n\n \n\nIn reply to the post that was just made as i was posting this, asked ourselves this exact question and came back with this card\n\nRavens of the Mountain\n\n \n\nEasily slip inable into the combo and would complete any quest that could be done by simply questing \"ie non objective card\" also in a multiplayer deck funelling the infinate combo deck, dont think it would be that hard for it to go off quickly and in an optimum condition, turn 1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131843","commentId":1131843,"userName":"Teamjimby","timestamp":1403633775,"content":"If you have infinite resources, card draw, and deck shuffling, all you need is a few Ravens of the Mountain in your deck to beat any quest in one turn.\n\nEdited June 24, 2014 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131927","commentId":1131927,"userName":"CaffeineAddict","timestamp":1403637593,"content":"there are a bunch of quests with conditions other than placing progress tokens (e.g. Shadow and Flame), or restrictions on how you can place them (e.g. only by defeating enemies in Nightmare Khazadum, resource tokens in Stewards Fear, etc), so to say you can beat any quest in one turn is a bit of an exaggeration."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1131977","commentId":1131977,"userName":"Teamjimby","timestamp":1403639771,"content":"Sure, there are some exceptions.  You can beat most quests in one turn once you get the combo going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1132154","commentId":1132154,"userName":"Nerdmeister","timestamp":1403646192,"content":"> I will grant you this is quite a setup but ill get back to this when i have explained\n\nDoes it need to be errataed?\n\nAs has been mentioned, if you can get it up by round 7/8 it still is quite late.\n\nIt also all depends on how you want to play this game; Personally I try to avoid gimmick combos, which this clearly is, and focus on trying out new stuff and different combos rather than getting stuck in a certain way of doing things.\n\nNot that I don´t reuse some aspects, I just think I would find it boring to let all my strategy depend on a very specific setup for all my games (though my solo beating of Conflict at the Carrock on nightmare did require a specific setup, so I won´t say never :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n\n \n\nAnyways I think I started rambling so to conclude: the combo doesn´t really bother me and I´m not sure which part of it you could errata which wouldn´t equate to just banning We are Not Idle; any thoughts yourself on what an errata should look like?\n\nEdited June 24, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1132591","commentId":1132591,"userName":"DaeMord","timestamp":1403685255,"content":">  \n> \n> > I will grant you this is quite a setup but ill get back to this when i have explained\n> \n> Does it need to be errataed?\n> \n> As has been mentioned, if you can get it up by round 7/8 it still is quite late.\n> \n> It also all depends on how you want to play this game; Personally I try to avoid gimmick combos, which this clearly is, and focus on trying out new stuff and different combos rather than getting stuck in a certain way of doing things.\n> \n> Not that I don´t reuse some aspects, I just think I would find it boring to let all my strategy depend on a very specific setup for all my games (though my solo beating of Conflict at the Carrock on nightmare did require a specific setup, so I won´t say never :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png])\n> \n>  \n> \n> Anyways I think I started rambling so to conclude: the combo doesn´t really bother me and I´m not sure which part of it you could errata which wouldn´t equate to just banning We are Not Idle; any thoughts yourself on what an errata should look like?\n> \n>  \n\nI agree with alot of what you said, and in this have already started thinking about what could be the subject of an errata\n\n \n\n2 cards spring up the first is will of the west, without which this combo simply would stall, and when you look at other infinite combo's in the past, this card has always came up as the subject of breaking the game, i think banning or limiting this card to 1 per game would break far to many decks, as well as indirectly harm any form of card draw or card discard, i think limiting it to 1 per round would stop this combo, and any future combos that would rely on any form of deck recycling and overall i feel would be healthy towards the game.\n\n \n\nAs for the second card which is we are not idle, thinking to other resource generation cards and errata's one springs to mind which ofc was the zigil miner, generating far too many resources and where as some people think its fine others think its overpowered clearly the view of the designers is that it was not fine, which makes me wonder \"how many extra resources in a round is fine\" i wonder if this card isnt overpowered regardless of the combo or not, and so a hard cap on the amount of resources it can generate would not be out of the realms of reasonability. The amount is some subject of debate among my play group but adding \"X up to a maximum of <insert figure here>\" would seem to fix this problem, the debate among my play group would vary between 5 and 10.\n\n \n\nPut these 2 errata's in, i dont think it would harshly affect any decks \"too much\" but would both shut this combo down as well as limiting the ability to abuse both cards in the future for more combo's\n\n \n\nBare in mind any infinite combo left in the game as more cards are released the combo is potentially going to become easier and easier to achieve, and where as i completely agree that ultimately what you want is a fun and challenging game, nothing in this combo is any card that up until this combo i have seen as problematic, and all very reasonably run in just about any standard dwarf deck, making any standard dwarf deck potentially go infinite, even if not designed to do so.\n\n \n\nAlso in relation to going off turn 7/8 where as thats the turn it goes infinite, it should point out it starts power spiking around turn 3-5 by that i mean chain drawing and cycling round the deck 2-3 times, but ultimately stalling due to a problematic draw or a bit of bad luck, this power spike starts locking down the game because its a multiplayer power spike, and perhaps more importantly due to this combo relying on events rather than perminents like all previous infinite combo's, this one can be done during any phase of the game (more or less) as well as providing multiplayer infinite reading effects, so any card with \"exhaust to do blah\" can be done infinite times also and with it doing this \"alot\" turn 3-5 if not infinte, well i think this is a problem that could do with being errata'd, especially when you look at the previous ones which the debate over how viable it was/wasnt came up, and it still got fixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1132607","commentId":1132607,"userName":"Glaurung","timestamp":1403687828,"content":"As I sT before many times: until the game will have unlimited draw this kind of combos will always come out from time to time. And with card pool grow the number of combos Will grow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1132840","commentId":1132840,"userName":"Mattr0polis","timestamp":1403710906,"content":"This is not a new thing, nor is it the only possible way to gain infinite resources (and thus infinite anything else) once you draw your whole deck. My group has done similar things with We Are Not Idle, or like 3x Gaining Strength/Parting Gifts, etc.\n\n \n\nI do not think any of these things need errata because they all rely on drawing out your whole deck first, plus they are not near as overpowered as previous errata'ed combo decks like the Zigil Miner or Master of Lore decks. The reason those two needed errata was because you could get to the infinite loop before your deck even emptied once you found the cards in the combo.\n\n \n\nLike I've said from the beginning though, every time they release more cards with card draw these things become even quicker to pull off. You can already do it PRETTY quickly if you build a certain way, but for now it usually is at a point where the game should be ending soon anyway, and it's not really guaranteed wins because you are gimping your deck a bit to attempt this.\n\n \n\nI can't believe they made Mithrandir's Advice and Deep Knowledge though. Those are CRAZY good cards for these type of decks.\n\nEdited June 25, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1132962","commentId":1132962,"userName":"MyNeighbourTrololo","timestamp":1403716546,"content":"May I ask what was the infinity loop deck using Master of Lore?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133079","commentId":1133079,"userName":"Mattr0polis","timestamp":1403721371,"content":"> May I ask what was the infinity loop deck using Master of Lore?\n\nThey errata'ed Master of Lore so you can't do it anymore, but here's the deck and article explaining it, from December 2012:\n\n \n\n'The Erebor Hammer Deck, The Most Broken Deck Since Ziggy Miner':\n\nhttp://community.fantasyflightgames.com/index.php?/topic/76284-the-erebor-hammer-deck-the-most-broken-deck-since-ziggy-miner/ [https://community.fantasyflightgames.com/index.php?/topic/76284-the-erebor-hammer-deck-the-most-broken-deck-since-ziggy-miner/]\n\nEdited June 25, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133187","commentId":1133187,"userName":"MyNeighbourTrololo","timestamp":1403725994,"content":"And how exactly Master of Lore have been errata'd to prevent this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133281","commentId":1133281,"userName":"CJMatos","timestamp":1403729537,"content":"Master of Lore HoN 16\n\nShould read: “Action: Exhaust Master of Lore to name a card type. Lower the cost for you to play the next [Lore] card of that type by 1 until the end of the phase (to a minimum of 1).”\n\n \n\n \n\n \n\nPS: Bold is mine\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133291","commentId":1133291,"userName":"Mattr0polis","timestamp":1403729792,"content":"> And how exactly Master of Lore have been errata'd to prevent this?\n\nMaster of Lore used to be that you lowered the price of the named card type for the whole phase. They errata'ed it to only work on the next card (singular) you play. So you can't repeat deploy the Erebor Hammersmith for 1 which screws up the whole thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133351","commentId":1133351,"userName":"alogos","timestamp":1403732735,"content":"And other cards were obviously not overpowered so they decide to nerf master of lore wich many hesitate to see it as good enough...\n\nThey should have least bring him to a cost of 2..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133528","commentId":1133528,"userName":"booored","timestamp":1403743941,"content":"This isn't even a combo. It is just a synergy. There are much faster and easier ways to draw your entire deck with out having to rely on this cumbersome collection of cards. Beravor, Bilbo + Gleowine == 4 (5 with draw) cards a turn. Add in Wealth for +3 and that +5 one you can get near 10 cards a turn. You still need will of the west as the core cycle card though. This works perfectly fine as a support deck and breaks the game completely and it works from turn 0. There might not be the \"infinite\" thing going on at turn 7 or w/e.. but you will draw your entire deck by round 4 and start on the ally, event cycle. The big difference with Tomb and a Will of the West you can draw all players decks with ease, not just your own. This infinite combo things takes a while to spin up, raw card draw is active turn 1.\n\nI think FFG would be mad to even bother with this as a errata.\n\nEdited June 26, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133797","commentId":1133797,"userName":"Nerdmeister","timestamp":1403763144,"content":"Will of the West as a \"limit once per deck per round\" isn´t a bad suggestion. Nobody should be needing to reshuffle more than once per round anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1133825","commentId":1133825,"userName":"booored","timestamp":1403765621,"content":"not unless it has been altered in the FAQ and I missed it.\n\n \n\nWill of the West\nAction: Choose a player. Shuffle that player's discard pile back into his deck.\n\n \n\nOh wait. I see what your saying... Yeah that is a good fix. Once per game per player. \n\nEdited June 26, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1134074","commentId":1134074,"userName":"Glaurung","timestamp":1403790838,"content":"I think Will of the west should be remove from the game after you pay it…….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1134257","commentId":1134257,"userName":"DaeMord","timestamp":1403798250,"content":"I dont think unlimited card draw is that overpowered personally as having your entire deck in hand where as incredibly powerful and usually game wining, is still limited by resources.\n\nThe issue with all of these combo's is at the end of the day will of the west, because so long as there are draw cards (and why wouldnt there be) and so long as there is cards to generate resources (same again why wouldnt there be) unless the cost of these is always PERFECTLY balanced so that you would always be short enough resources to continuously recycle once your deck is empty, there will always be \"some way\" of generating infinite resources and then doing \"something\" that breaks the game (empty encounter deck, proc entire scenario, kill everything in the staging area etc etc etc).\n\n \n\nThe issue is clearly will of the west, and where as the specifics on if and how this should be modified, it seems fairly obvious to me that being able to use this card an unlimited number of times without any restriction whatsoever is what is at the very least facilitating any current, past and future truly game breaking situations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109313-infinite-combo-deck/?do=findComment&comment=1135985","commentId":1135985,"userName":"chrsjxn","timestamp":1403905487,"content":"Making Will of the West remove itself from the game is probably the standard way to fix this in card games, and FFG have gotten better about that now. (See Levy AR Lab Access in Netrunner.)\n\n \n\nBut is it worth doing? I think that depends on if the combo is reliable enough to pull off in real games and then end them before an optimized, normal deck would have ended them. Especially now, in the era of quests with the Time keyword that punish you for not progressing fast enough. It seems like this is a novelty more than an actual overpowered archetype, but I'm not seeing any actual evidence either way."}]}