{"url":"https://community.fantasyflightgames.com/topic/109310-will-next-pod-will-be-journey-down-the-anduin-2/","title":"Will next POD will be journey down the anduin #2?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109310-will-next-pod-will-be-journey-down-the-anduin-2/?do=findComment&comment=1131450","commentId":1131450,"userName":"Cunir","timestamp":1403612310,"content":"Hopefully FFG are going to carry on bringing out PODs to fill in the gaps in the saga story, so i've been having a look at what the next saga box (the road darkens) will cover, and what is missing from it, and the only bit i can see that will make a half decent quest is after they've left lothlorien and travel down the Anduin to the falls of rauros.\n\n1st quest takes us across the mountains and up to the doors of moria. The 2nd quest is through moria. And the 3rd quest is where the group splits up. So it sounds like they might be able to fit another quest after the second one where they set out down the river. That means we might get Journey Down The Anduin #2\n\nI wouldnt mind that. Maybe they could rework it a bit, and do that stuff they did in massing at Osgiliath, where they had a load of locations on different banks. I thought that was quite a good mechanic. they could have enemies firing at you from the banks, which you could only attack with ranged"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109310-will-next-pod-will-be-journey-down-the-anduin-2/?do=findComment&comment=1131573","commentId":1131573,"userName":"richsabre","timestamp":1403618981,"content":"i really love that part of the book, its such a hostile feeling when the fellowship leave the safety of lorien into the wilds of andiun\n\n \n\nso yeah, i would love to see this! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109310-will-next-pod-will-be-journey-down-the-anduin-2/?do=findComment&comment=1134715","commentId":1134715,"userName":"Catastrophic09","timestamp":1403823055,"content":"Yes, I really like the idea of filling in the gaps and missed content with POD quests so I also really hope for another Down the Anduin like quest! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  And there is plenty they can do to make it unique, they are really good at that. It would be cool to see some new mechanic that embraces navigating your boat.."}]}