{"url":"https://community.fantasyflightgames.com/topic/109443-silvan-ents/","title":"Silvan &amp; Ents","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109443-silvan-ents/?do=findComment&comment=1133806","commentId":1133806,"userName":"ana4","timestamp":1403763834,"content":"Well, many of us have already pondered upon some Silvan decks, and I think we can easily argue that their mechanic will be an interesting one. Then, the Ents were previewed, only three of them including the mighty Treebeard but we can safely say what the common mechanic for them will be as well.\n\n \n\nAnd it brings me to the topic question. Perhaps not in a single deck, but surely as two decks working together (and I do feel strongly 2-player games are by far the best for this game, certainly more interesting than solo), Silvan and Ents can work wonders together.\n\n \n\nBecause what Silvan, lead by Celeborn and Galadriel (and whichever Lore hero you choose to accompany them), are great at, is early questing, and chump-blocking if needed. They can muster at really low cost and very efficiently. And it may be just the thing the Ent deck needs, because Ents enter play exhausted and thus are not efficient in the opening rounds but will grow stronger with time. Thematically, I think that both mechanics fit the traits perfectly.\n\n \n\nOf course we need to see more Ents to make an Ent deck. And we will always have to rely on non-Ent heroes since we are probably not getting any Ent-heroes (if Treebeard is not one of them), so the options will be various. But my basic presumption stands, I believe Silvan and Ents will work well together, reciprocally supporting each other's weaknesses.\n\nEdited June 26, 2014 by Ana"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109443-silvan-ents/?do=findComment&comment=1133823","commentId":1133823,"userName":"booored","timestamp":1403765306,"content":"I am not really focusing on the spoilers. I order my packs pre-ordered and get the entire cycle sent to me after it is finished. So this is all speculation. I do know the Ents come in tapped so combining them with fast units seams the obvious choice. Maybe yet another deck were Grima is a star to get those cards out super early at a small doom cost.\n\nAs for the elves, my understanding is that they will have all these \"coming into play\" effects. So I would expect them to combo well with Gondor and people like the Prince as well as Eagels, whom have a variety of cards to return elves to your hand to be replayed the next turn and at the same time untap and add attack to heroes.\n\nEdited June 26, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109443-silvan-ents/?do=findComment&comment=1133831","commentId":1133831,"userName":"ana4","timestamp":1403766553,"content":"Yes, I know this is future stuff, which is why I post it here and not the strategy section, though there are decks based on previews only as well (including my suggestion).\n\n \n\nThis was just a trait combining speculation. As for that, I agree that Gondor with Imrahil, Horn, Sacrifice, she is bound to work well with Silvan also."}]}