{"url":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/","title":"GenCon Fellowship Events","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/?do=findComment&comment=1135352","commentId":1135352,"userName":"Dergidan","timestamp":1403879587,"content":"I'm aware that the fellowship events are sold out at this point, I have a couple questions for the community.\n\n \n\nHas anyone tried showing up with some generic tickets in case of an opening? Any luck?\n\n \n\nIs it still designed so that you need a partner to play, and is there by chance anyone who doesn't have a partner yet?\n\nI'm making my Gen Con plans and would really like to play in one of the Rings events, but I wasn't able to decide on going until recently. I played the Laketown event at GenCon 2012 and it was one of the highlights of the weekend!\n\n \n\nI will probably come by whether I can play or not, just to chat with folks about the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/?do=findComment&comment=1135378","commentId":1135378,"userName":"Mattr0polis","timestamp":1403880386,"content":"I'm going to GenCon and also missed out on signing up in time.\n\n \n\nDoes anyone who played in the past years' events (Massing/Laketown/Erech) know if you can still purchase this promo quest at GenCon even if you are not signed up for the event? I'd like to still grab a copy if possible.\n\nEdited June 27, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/?do=findComment&comment=1135408","commentId":1135408,"userName":"Dergidan","timestamp":1403881765,"content":"I'm pretty sure they don't have them available at GenCon, but if you're willing to wait a few months they will eventually release them as POD.\n\nI'll get mine later if I can't play at the con, but I'd like to play if there's an outside chance. I'm looking for things to do other than shop in the dealer hall for four days. Dangerous that is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/?do=findComment&comment=1135412","commentId":1135412,"userName":"Dain Ironfoot","timestamp":1403881853,"content":"> I'm going to GenCon and also missed out on signing up in time.\n> \n>  \n> \n> Does anyone who played in the past years' events (Massing/Laketown/Erech) know if you can still purchase this promo quest at GenCon even if you are not signed up for the event? I'd like to still grab a copy if possible.\n\nthey do not have them for sale - and last year, IIRC, they only had enough packs for the number of tickets they made available."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109534-gencon-fellowship-events/?do=findComment&comment=1135426","commentId":1135426,"userName":"Mattr0polis","timestamp":1403882331,"content":"That sucks if they are not available to buy there. I know they are always available through POD later but was hoping to not have to wait like 6 or so months to get it this time. Seems like it took FOREEEEVER after GenCon last year before Stone of Erech was released in POD."}]}