{"url":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/","title":"Thror&#039;s key versus Surge","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1141309","commentId":1141309,"userName":"asmeus","timestamp":1404332910,"content":"Hello, although I have played this game quit a bit, there are still some rules, that I don't understand completely.\n\n \n\nFor example -\n\nWhen does Surge exactly occur?\n\n \n\nWhen questing with Thalin, and killing Crows, surge is negated.\n\nIt got me wondering, what about Thror's Key.\n\n \n\nResponse: After a location is added to the staging area, attach Thror's Key to that location. While attached to a location, Thror's Key gains: \"Treat attached location's printed text box as blank, except for traits.\"\n\n \n\nIf surge occurs right after the card is added to staging area, then it would overlap with Thror's Key ability, and active player can decide the order. (During staging - active player being first player?)\n\n \n\nThanks for enlightening me, and till next time. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1141375","commentId":1141375,"userName":"danpoage","timestamp":1404335431,"content":"Just after Thalin's passive effect (for enemies), and after any \"When Revealed\" effects, keywords like Surge and Doomed are triggered. This happens before the location is added to the staging area. Because the effect on Thrór's Key is a response, you can only trigger it after the location is added to the staging area. Once Thrór's Key is attached, it blanks the text of the location. However, it is too late for this to cancel any of the keywords on that location (including Surge or Doomed), because the keywords were triggered before the location was ever added to the staging area.\n\n \n\nThink of \"When Revealed\" and keywords as occurring in an out-of-play limbo, just before the card is added to the staging area.\n\nEdited July 2, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1141446","commentId":1141446,"userName":"booored","timestamp":1404340526,"content":"I agree with Beorn here. The \"when revealed\" timing rules are murky at best. They occur before the card in fact comes into play. Thalins ability is even worse, like we all know how it works.. but the rules of \"why\" it works basically do not exist. A perfect example of the shoddy design that this game is great despite of.\n\nEdited July 2, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1161093","commentId":1161093,"userName":"Rapier1","timestamp":1405710758,"content":"> I agree with Beorn here. The \"when revealed\" timing rules are murky at best. They occur before the card in fact comes into play. Thalins ability is even worse, like we all know how it works.. but the rules of \"why\" it works basically do not exist. A perfect example of the shoddy design that this game is great despite of.\n\n \n\nIt isn't really shoddy design. The rules are murky rather than clear but the actual design is fairly reasonable. The order of operations is known:\n\nAs it is revealed\n\nkey words\n\nkey words response\n\nWhen revealed\n\nwhen revealed response\n\nHaving all these things at different speeds is good design for expanding the card pool and encouraging emergent gameplay.\n\nNow if you're arguing that FFG often writes unclear rulebooks I'm afraid I can't defend them on that score, alot of their rules writing does contain corner cases and exceptions that are important and not clearly laid out.\n\nEdited July 18, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1161683","commentId":1161683,"userName":"danpoage","timestamp":1405748339,"content":"Just to clarify, surge is triggered *after* the \"When Revealed\" effects of an encounter card, not before. See the surge keyword on page 24:\n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/LOTR%20Rules.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/LOTR%20Rules.pdf]\n\n \n\nIt is ambiguous from the core set rule book whether or not other encounter keywords like Doomed actually trigger before or after the \"When Revealed\" effects of a card, but Surge specifically triggers after. This does not much matter for Doomed, but I can see the timing of keywords mattering for other encounter keywords like Ambush. I'd have to go back and look to see if there are any enemies with Ambush that also have \"When Revealed\" effects.\n\nEdited July 19, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1161751","commentId":1161751,"userName":"alogos","timestamp":1405757068,"content":"It's triggered before, and it's effect is resolved after.\n\nAlso, they are considered as passive effect.\n\n \n\nFrom an old question to Caleb :\n\n \n\n>  \n> \n>  \n> \n> Q: Surge is distinctly said to take effect after the when revealed effect. But nothing is said about other keywords. I think I once saw a clarification that keywords are passives or rules text, something like that, that enables them to take effect before when revealed effect, but it may be my imagination. How do we resolve the order of keywords? Simply by order of appearance or something like it's a passive text rule or perhaps, like surge, should it trigger after?\n> A: FAQ item 1.37 addresses the order of resolution for effects. Passive abilities (such as keywords) come first. Surge is a special case because the rules for the keyword indicate that the extra card should be revealed after the card with surge. With regard to Star in Sky, the players would first resolve the Prowl 2 and then resolve the When Revealed effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1162418","commentId":1162418,"userName":"danpoage","timestamp":1405816295,"content":">  \n> \n> It's triggered before, and it's effect is resolved after.\n> \n> Also, they are considered as passive effect.\n> \n>  \n> \n> From an old question to Caleb :\n> \n>  \n> \n> >  \n> > \n> >  \n> > \n> > Q: Surge is distinctly said to take effect after the when revealed effect. But nothing is said about other keywords. I think I once saw a clarification that keywords are passives or rules text, something like that, that enables them to take effect before when revealed effect, but it may be my imagination. How do we resolve the order of keywords? Simply by order of appearance or something like it's a passive text rule or perhaps, like surge, should it trigger after?\n> > \n> > A: FAQ item 1.37 addresses the order of resolution for effects. Passive abilities (such as keywords) come first. Surge is a special case because the rules for the keyword indicate that the extra card should be revealed after the card with surge. With regard to Star in Sky, the players would first resolve the Prowl 2 and then resolve the When Revealed effect.\n> \n>  \n\nYes, you are correct. I do now remember the clarification around this. Surge \"triggers\" before \"When Revealed\" but resolves after. What exactly it means for something to \"trigger\" but not resolve is another discussion entirely. This is precisely the kind of confusing timing that is not spelled out clearly in the rule book. All the rule book says is: \"Resolve the surge keyword immediately after resolving any when revealed effects on the card.\" so you basically have to infer the following:\n\n1. keywords trigger before \"when revealed\" (never explicitly stated in the rule book)\n\n2. Surge \"triggers\" along with other keywords\n\n3. Because the surge rules specifically state that it resolves after \"when revealed\", then you have to wait to resolve it's effect, even though the other keywords like doomed have already resolved.\n\n \n\nThis is especially strange because all of the other keywords except surge trigger before \"When Revealed\" and resolve immediately. There is no other way for me to put it, this is sloppy design. It would have been so much easier to just make all effects part of the when revealed, or just have all keywords resolve after the \"when revealed\". What we have now is this bizarre hybrid that very few players actually follow.\n\n \n\nDon't misunderstand, I love this game, along with many other FFG games, but if I was to compile a book of all of the differences between what the rule books says, and how you are actually supposed to play the game, I would have written quite a tome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1162527","commentId":1162527,"userName":"Nerdmeister","timestamp":1405829760,"content":"> This is especially strange because all of the other keywords except surge trigger before \"When Revealed\" and resolve immediately. There is no other way for me to put it, this is sloppy design. It would have been so much easier to just make all effects part of the when revealed, or just have all keywords resolve after the \"when revealed\". What we have now is this bizarre hybrid that very few players actually follow.\n> \n>  \n\n \n\nIt makes good enough sense to have surge de facto trigger after the when revealed effect of a card.\n\nOtherwise you might end up stacking cards in the \"limbo\" area as more are revealed but none have their when revealed effects triggered on account of multiple surges. Putting surge after makes it possible (also rules wise) to handle one card at a time.\n\nEdited July 20, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1162705","commentId":1162705,"userName":"Rapier1","timestamp":1405851313,"content":">  \n> \n> >  \n> > \n> > It's triggered before, and it's effect is resolved after.\n> > \n> > Also, they are considered as passive effect.\n> > \n> >  \n> > \n> > From an old question to Caleb :\n> > \n> >  \n> > \n> > >  \n> > > \n> > >  \n> > > \n> > > Q: Surge is distinctly said to take effect after the when revealed effect. But nothing is said about other keywords. I think I once saw a clarification that keywords are passives or rules text, something like that, that enables them to take effect before when revealed effect, but it may be my imagination. How do we resolve the order of keywords? Simply by order of appearance or something like it's a passive text rule or perhaps, like surge, should it trigger after?\n> > > \n> > > A: FAQ item 1.37 addresses the order of resolution for effects. Passive abilities (such as keywords) come first. Surge is a special case because the rules for the keyword indicate that the extra card should be revealed after the card with surge. With regard to Star in Sky, the players would first resolve the Prowl 2 and then resolve the When Revealed effect.\n> > \n> >  \n> \n> Yes, you are correct. I do now remember the clarification around this. Surge \"triggers\" before \"When Revealed\" but resolves after. What exactly it means for something to \"trigger\" but not resolve is another discussion entirely. This is precisely the kind of confusing timing that is not spelled out clearly in the rule book. All the rule book says is: \"Resolve the surge keyword immediately after resolving any when revealed effects on the card.\" so you basically have to infer the following:\n> \n> 1. keywords trigger before \"when revealed\" (never explicitly stated in the rule book)\n> \n> 2. Surge \"triggers\" along with other keywords\n> \n> 3. Because the surge rules specifically state that it resolves after \"when revealed\", then you have to wait to resolve it's effect, even though the other keywords like doomed have already resolved.\n> \n>  \n> \n> This is especially strange because all of the other keywords except surge trigger before \"When Revealed\" and resolve immediately. There is no other way for me to put it, this is sloppy design. It would have been so much easier to just make all effects part of the when revealed, or just have all keywords resolve after the \"when revealed\". What we have now is this bizarre hybrid that very few players actually follow.\n> \n>  \n> \n> Don't misunderstand, I love this game, along with many other FFG games, but if I was to compile a book of all of the differences between what the rule books says, and how you are actually supposed to play the game, I would have written quite a tome.\n> \n>  \n\n \n\nSurge follows the keyword rules (before when revealed) However since it's effect is to add another card I think they were right to make it resolve after you finish resolving the card it's on. Otherwise as Nerdmeister suggests, you could end up with an ever increasing pile of cards that are are all being resolved before the \"when revealed\" aspect of the first card.\n\nTh way it is is much clearer than the timing issues the alternative could create, a simpler design would have been to do \"when revealed\" then keywords - but I don't think they had surge in mind when they wrote the order.\n\nHaving a different speed for keywords and when revealed is nice design - although we don't have a card pool that's good at dealing with the keyword speed. (And the prevent both speed of Thalin is even rarer)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163019","commentId":1163019,"userName":"Mndela","timestamp":1405877962,"content":"The problem i think is: it is not so clear in the rulebook"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163025","commentId":1163025,"userName":"entMoot","timestamp":1405878250,"content":"Another layer that is difficult to parse consistently is that most surge cards are templated as:\n\n \n\n\"Surge.\n\nWhen Revealed: [Effect]\"\n\n \n\nIn which case you do not resolve the effects in the order printed on the card, which makes for an annoying mechanic. Saying that we trigger the effects in that order, but resolve surge second does get around the problem. However, there are many other cards that gain surge as part of their when revealed effect:\n\n \n\n\"When Revealed: [Effect]. If [condition], then [this card] gains surge.\"\n\n \n\nIn which case the surge is gained as part of the when revealed effect and resolved after the rest of the when revealed effect as we expect from the rulebook/clarifications. Because both these templates exist, I don't think it quite works as intended to say surge is triggering along with other keywords before when revealed effects. If it only triggers before when revealed, then this second template never reveals extra encounter cards. This is clearly not how the designers intend these cards to be played!\n\n \n\nIf the designers wanted to have surge trigger before when revealed effects and were okay with a massive errata to make things consistent, they could change the second template cards to either of:\n\n \n\n1) \"If [condition], then [this card] gains surge.\n\nWhen Revealed: [Effect].\"\n\n \n\n2) \"When Revealed: [Effect]. If [condition], then reveal an additional card from the encounter deck and add it to the staging area.\"\n\n \n\nA non-gameplay downside of this would be that both of these could end up adding another line or two to already choked text boxes. However, I am not saying that we need more FAQ to see the intent of surge and play it as intended. I think Dan is right that the most elegant solution would be to include all keywords as part of the when revealed effect. Changing that now would of course still require yet more errata and change the power level on cards that interact with when revealed effects and keyword abilities, which may not be desirable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163601","commentId":1163601,"userName":"booored","timestamp":1405930998,"content":"surge occurring inside the when reveal effect isn't an issue in any way. When you see surge you draw the next card BEFORE you do when reveals. Then you go and do the when reveal and draw a 2nd card. This order dose matter in some cases.\n\n \n\nThe timing of the keywoprds and the when reveal is not an issue, the issue is how passive \"always on\" effects work. Thalin is not a response, or any other type of thing, it is a permanent effect that is always in play and there is at this time NOTHING in the timing rules to explain this. Thalin dose seam to make it seam that it trumps all other effects\n\n \n\nAlways on\n\nKeyword (resolved in order)\n\nForced Response\n\nResponse\n\nWhen Revealed\n\nAction (at end of staging step only, not between card reveals)\n\n \n\n\n\n----------------------------------------\n\n \n\nBut I have another one for you... .. where do \"FORCED\" fit in... like Goblin Archer.\n\n \n\nmed_goblin-archer-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_goblin-archer-kd.jpg]\n\n \n\nIs this just a way of writing \"forced response\" and taking up less room? Or is this is new effect. It relates directly to this issue of the timing windows being so sloppy.\n\n \n\nThere can be a argument made as this has no response window that it is also a kind of \"always on\"... so lets look at this!\n\n \n\nOrc Hornblow Surges into Chieftain of the pit, into Goblin Archer.\n\n \n\nmed_orc-horn-blower-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_orc-horn-blower-kd.jpg]med_chieftain-of-the-pit-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_chieftain-of-the-pit-kd.jpg]\n\n \n\nSo Horn Blower comes out.... this triggers surge and out comes the chieftain, then when revealed out comes the Archer.\n\n \n\nNow his effect is forced.. NOT a response. The entire staging step we know all happens in a single go, the action phase is at the end... So all these cards are considered to be a single reveal. Remembering that this is NOT A RESPONSE, there is a argument that when this cards effect resolves that forced at the very end, but there has been 3 cards revealed this turn. So he dose 3 damage.\n\n \n\nIf it was response it would be an open and shut case, but it is forced, so the card comes into play, there is no keywords, we now resolve the forced. There has been three cards revealed .. so 3 damage.\n\n \n\nThen ONTOP of that we have true passive always on effects like\n\n \n\nmed_goblin-tunnels-kd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/med_goblin-tunnels-kd.jpg]\n\n \n\nSo again.. where do these 2 effects sit in the order?\n\nEdited July 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163617","commentId":1163617,"userName":"alogos","timestamp":1405932565,"content":"> surge occurring inside the when reveal effect isn't an issue in any way. When you see surge you draw the next card BEFORE you do when reveals. \n\n \n\nAre you saying you draw & reveal/resolve the card (where I put green) or just draw it... and wait to resolve your current card before resolving the one you drew? \n\n \n\nIt seems that everyone was talking about the inconsitence of doing so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163619","commentId":1163619,"userName":"booored","timestamp":1405932848,"content":">  \n> \n> > surge occurring inside the when reveal effect isn't an issue in any way. When you see surge you draw the next card BEFORE you do when reveals. \n> \n>  \n> \n> Are you saying you draw & reveal/resolve the card (where I put green) or just draw it... and wait to resolve your current card before resolving the one you drew? \n> \n>  \n> \n> It seems that everyone was talking about the inconsitence of doing so...\n> \n>  \n\n \n\nI am saying that after surge you instantly draw the next card, if that has any keywords you then resolve them (including a new surge) and so on. Once all the cards in a reveal (which is one card per player) have all their keywords resolved. you then go back and do the when revealed stuff.\n\nEdited July 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163639","commentId":1163639,"userName":"Nerdmeister","timestamp":1405935396,"content":"Except that we have been talking about drawing the surge card after when revealed has been resolved.\n\n \n\nAlso in regards to a surge built into the when revealed; since it is part of that mechanic you would be able to cancel the surge with a Test of Will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163645","commentId":1163645,"userName":"booored","timestamp":1405936274,"content":"my point is that I do not think you can ever draw surge \"after\" when revealed. Keywords resolve first.\n\n \n\nThe only time you can is when surge is part of the when reveled effect and of course subject to all the normal when revealed triggers.\n\nEdited July 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163673","commentId":1163673,"userName":"raven614","timestamp":1405941741,"content":"Surge only works during the encounter step correct? Also does it work like advancing from one stage to another (quest). Or di you surge all the time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163698","commentId":1163698,"userName":"alogos","timestamp":1405943786,"content":"Almost. In the core set, it was.\n\nIt was added in the faq that it should trigger all the time.\n\n \n\n>  \n> \n>  \n> \n> (1.01) Encounter Keywords\n> Surge, Doomed, and Guarded keywords should be\n> resolved any time the card on which they occur is\n> revealed from the encounter deck, including during\n> setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163728","commentId":1163728,"userName":"raven614","timestamp":1405947082,"content":"Nice thank you. I ask that question in another post but just making sure. Also are all keywords like that or is it just the ones mentioned?\n\nBeen playing the 2nd mission from the isenguard expansion to catch an ork. Haven't won it yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163842","commentId":1163842,"userName":"alogos","timestamp":1405953598,"content":"This answer is also in the last answer...\n\nBut it may depend on the keyword definition, archery, for instance, doesn't work the same way. Better look up the definition, and treat them like passive. If you got specific question, ask them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163894","commentId":1163894,"userName":"raven614","timestamp":1405955605,"content":"Yeah your right makes sense those three are the ones that come up in that situation. Thanks for the reply. That senario To Catch an Ork really makes you juggle a lot of things at a time. I'm pretty sure I've got the rules down but to play in this game you have to stay sharp and remember what's going on at any givin moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163937","commentId":1163937,"userName":"Dain Ironfoot","timestamp":1405957728,"content":"> my point is that I do not think you can ever draw surge \"after\" when revealed. Keywords resolve first.\n> \n>  \n> \n> The only time you can is when surge is part of the when reveled effect and of course subject to all the normal when revealed triggers.\n\nthis is not what the core rulebook says, page 24:\n\n \n\n\"When an encounter card with the surge keyword is revealed during the staging step of the quest phase or in setup, reveal 1 additional card from the encounter deck. Resolve the surge keyword immediately after resolving any when revealed effects on the card. \""},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163939","commentId":1163939,"userName":"entMoot","timestamp":1405957833,"content":"> surge occurring inside the when reveal effect isn't an issue in any way. When you see surge you draw the next card BEFORE you do when reveals. Then you go and do the when reveal and draw a 2nd card. This order dose matter in some cases.\n> \n>  \n> \n> The timing of the keywoprds and the when reveal is not an issue, the issue is how passive \"always on\" effects work. Thalin is not a response, or any other type of thing, it is a permanent effect that is always in play and there is at this time NOTHING in the timing rules to explain this. Thalin dose seam to make it seam that it trumps all other effects\n> \n>  \n> \n> Always on\n> \n> Keyword (resolved in order)\n> \n> Forced Response\n> \n> Response\n> \n> When Revealed\n> \n> Action (at end of staging step only, not between card reveals)\n> \n>  \n> \n> \n> \n> ----------------------------------------\n> \n>  \n> \n> But I have another one for you... .. where do \"FORCED\" fit in... like Goblin Archer.\n> \n>  \n> \n> [snip]\n> \n>  \n> \n> Is this just a way of writing \"forced response\" and taking up less room? Or is this is new effect. It relates directly to this issue of the timing windows being so sloppy.\n> \n>  \n> \n> There can be a argument made as this has no response window that it is also a kind of \"always on\"... so lets look at this!\n> \n>  \n> \n> Orc Hornblow Surges into Chieftain of the pit, into Goblin Archer.\n> \n>  \n> \n> [snip][snip]\n> \n>  \n> \n> So Horn Blower comes out.... this triggers surge and out comes the chieftain, then when revealed out comes the Archer.\n> \n>  \n> \n> Now his effect is forced.. NOT a response. The entire staging step we know all happens in a single go, the action phase is at the end... So all these cards are considered to be a single reveal. Remembering that this is NOT A RESPONSE, there is a argument that when this cards effect resolves that forced at the very end, but there has been 3 cards revealed this turn. So he dose 3 damage.\n> \n>  \n> \n> If it was response it would be an open and shut case, but it is forced, so the card comes into play, there is no keywords, we now resolve the forced. There has been three cards revealed .. so 3 damage.\n> \n>  \n> \n> [snip]\n> \n>  \n> \n> So again.. where do these 2 effects sit in the order?\n\nHey booored, This is an interesting scenario. I got a little confused trying to sort through it, but I think the rulebook helps for the most part. From page 23, the categories an effect can fall under are\n\n * Constant Effect\n * Action (players only, optional, needs action window)\n * Response (players only, optional)\n * Forced\n * When Revealed (encounters only, subset of forced)\n * Shadow Effects (encounters only)\n * Travel Effects (encounters only)\n\nNote that there is technically no such thing as a \"forced response\", only forced effects which are similar to responses but take the decision to initiate the effect away from the players.\n\n \n\nResponses:\n\n\"Responses are always optional, and can be triggered by their controller in response to (i.e. immediately after) a specified game occurrence.\"\n\n \n\nForced:\n\n\"They are denoted by a bold Forced: trigger on a card. These effects initiate and resolve immediately, whenever their specified prerequisite occurs.\" \n\n \n\nFlipping back to page 14 of the rulebook, we see that your claim that \"staging happens all at once\" is not quite right. While there is no player action window,\n\n \n\n\"These encounter cards are revealed one at a time, with any “when revealed” effects being resolved before the next card is revealed.\"\n \nAnd based on the rules for the card effects above, we can trigger responses or forced effects only immediately when their condition is met. Hence the Archer being revealed last is optimal and he doesn't get to the party in time to see his 2 buddies in your scenario. My hunch is that Goblin Archer doesn't trigger his own forced effect since by the time he is in play, he doesn't count as being revealed anymore. However I don't know that this is definitely the case based on the rulebook alone.\n \nGetting back to surge and when to take cards from the deck/reveal, the rulebook only says this about the keyword (page 24):\n\n \n\n\"When an encounter card with the surge keyword is revealed during the staging step of the quest phase or in setup, reveal 1 additional card from the encounter deck. Resolve the surge keyword immediately after resolving any when revealed effects on the card.\"\n\n \n\nThe first sentence is the effect and the second is the timing. So we do not stock-pile all the surge card before or after all of the other revealed cards since we resolve surge immediately after when revealed effects on the card with surge. We should see that the encounter card just revealed has surge and then resolve its when revealed. Then we should reveal 1 additional card from the encounter deck. It doesn't say anywhere to set the cards aside for later.\n\n \n\n(EDIT: Dain beat me to the punch. Sorry if this part about surge reads like beating a dead horse.)\n\nEdited July 21, 2014 by entMoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1163940","commentId":1163940,"userName":"Dain Ironfoot","timestamp":1405957983,"content":">  \n> \n> Now his effect is forced.. NOT a response. The entire staging step we know all happens in a single go, the action phase is at the end... So all these cards are considered to be a single reveal. Remembering that this is NOT A RESPONSE, there is a argument that when this cards effect resolves that forced at the very end, but there has been 3 cards revealed this turn. So he dose 3 damage.\n> \n>  \n\nthis is also not true. page 14 of the core rulebook:\n\n \n\nAfter each player has had the opportunity to commit characters to the quest, the encounter deck reveals\n\none card per player. This is known in the game as staging. These encounter cards are revealed one at a time, with any “when revealed” effects being resolved before the next card is revealed. Enemy and location cards revealed in this manner are placed in the staging area, treachery cards are resolved and (unless otherwise indicated by the card text) placed in the discard pile.\n\nIf the encounter deck is ever empty during the quest phase, the encounter discard pile is shuffled and reset back into the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164540","commentId":1164540,"userName":"booored","timestamp":1405982750,"content":"> > my point is that I do not think you can ever draw surge \"after\" when revealed. Keywords resolve first.\n> > \n> >  \n> > \n> > The only time you can is when surge is part of the when reveled effect and of course subject to all the normal when revealed triggers.\n> \n> this is not what the core rulebook says, page 24:\n> \n> \"When an encounter card with the surge keyword is [/size]revealed during the staging step of the quest phase or in [/size]setup, reveal 1 additional card from the encounter deck. Resolve the surge keyword immediately after resolving [/size]any when revealed effects on the card. \"[/size]\n\nYeah but that rule is stupid. Not only dose it make the timing effects completely retarded, hence this thread, it also means that you can not read the card in the order it is printed. Making the entire game more confusing for new player. As well as removing tons of awesome effects and completely gutting how surge works.\n\nThis is the big problem with this game, it is so badly designed. The good news is that you can so easily improve it.\n\nEdited July 21, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164567","commentId":1164567,"userName":"entMoot","timestamp":1405984309,"content":" \n> > \n> \n> Yeah but that rule is stupid. Not only dose it make the timing effects completely retarded, hence this thread, it also means that you can not read the card in the order it is printed. Making the entire game more confusing for new player. As well as removing tons of awesome effects and completely gutting how surge works.\n> \n> This is the big problem with this game, it is so badly designed. The good news is that you can so easily improve it.\n> \n>  \n\n \n\nI agree that not resolving actions in the order they are read is a frustrating part of surge. What awesome effects are we missing out on, though? What do you mean the core rules are gutting how surge works? I'm just not sure how much you are gaining by changing the order of resolution as you advocate doing. Your previous example still would not have had the Archer dealing damage since his forced effect can't trigger off enemies already in play (he was the last reveal)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164577","commentId":1164577,"userName":"booored","timestamp":1405985269,"content":"that is how i read it as well, but there is an argument that the card reveals are all instant.\n\nThere are no action windows. Each player reveals their cards and then resolves them. The Archer effect is not a trigger but just forced. By the time the archer card is in the staging area and that text is active... all the other cards have been revealed and have entered. There is no timing information on the archer, it is not a response. So when you read the order of events all those crads are valid as they have all just entered the staging area in the same period of time as the forced text became active.\n\nWe ruled against this but the argument is sound. There is no ruling to say yay or nay on this on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164616","commentId":1164616,"userName":"Dain Ironfoot","timestamp":1405988136,"content":"> that is how i read it as well, but there is an argument that the card reveals are all instant.\n> \n> There are no action windows. Each player reveals their cards and then resolves them. The Archer effect is not a trigger but just forced. By the time the archer card is in the staging area and that text is active... all the other cards have been revealed and have entered. There is no timing information on the archer, it is not a response. So when you read the order of events all those crads are valid as they have all just entered the staging area in the same period of time as the forced text became active.\n> \n> We ruled against this but the argument is sound. There is no ruling to say yay or nay on this on.\n\nno, there is a ruling on this: the rulebook.\n\n \n\nthe archer does not place damage on on every enemy, in your example.\n\n \n\nit is not unclear. it is your interpretation of the rules that doesn't mesh with what the rulebook actually says.\n\nEdited July 22, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164621","commentId":1164621,"userName":"booored","timestamp":1405988706,"content":"As I said (twice now) I agree with you, but that doesn't make the argument any less valid. There is no ruling on this. So your \"opinion\" is just that and no more correct than anyone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164684","commentId":1164684,"userName":"Khamul The Easterling","timestamp":1405992925,"content":"Dain, I thought you left the forums because of this  :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]\n\n \n\nha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164694","commentId":1164694,"userName":"Dain Ironfoot","timestamp":1405993476,"content":"> As I said (twice now) I agree with you, but that doesn't make the argument any less valid. There is no ruling on this. So your \"opinion\" is just that and no more correct than anyone else.\n\nyes, it does make your original argument less valid. it makes it total invalid.\n\n \n\nspend less time making up your own rules, and focus on the actual rules, as written.\n\n \n\nit seems that in just about every rules thread over the past 6 months, you've been ruled against by the designers, and the actual rulebook itself (or FAQ).\n\n \n\njust because you think there isn't a ruling when it's perfectly crystal clear - doesn't mean there isn't one.\n\nEdited July 22, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164702","commentId":1164702,"userName":"entMoot","timestamp":1405993872,"content":"> that is how i read it as well, but there is an argument that the card reveals are all instant.\n> \n> There are no action windows. Each player reveals their cards and then resolves them. The Archer effect is not a trigger but just forced. By the time the archer card is in the staging area and that text is active... all the other cards have been revealed and have entered. There is no timing information on the archer, it is not a response. So when you read the order of events all those crads are valid as they have all just entered the staging area in the same period of time as the forced text became active.\n> \n> We ruled against this but the argument is sound. There is no ruling to say yay or nay on this on.\n\nAgain, pages 23-24 of the rule book specifically explains this under the heading for Forced. I think it is pretty clear that there is a timing specified:\n\n \n\n\"They are denoted by a bold Forced: trigger on a card. These effects initiate and resolve immediately, whenever their specified prerequisite occurs.\" \n\n \n\nSo when the Archer is in the staging area and after the next enemy is revealed from the encounter deck, immediately deal the 1 damage and then reveal the next card (if necessary for staging/surge).\n\n \n\nRE: House rules. I think they are great and am interested in variants, but when people are discussing the core rules it doesn't help confused players to use your version of surge or staging instead of what's available in the core rules/FAQ.\n\n \n\nEDIT: In my previous post I mentioned that there is nothing called a Forced Response, however the FAQ does appear to use the two interchangeably. This does not change that all printed cards use the Forced: trigger and, hence, the above rules. \n\nEdited July 22, 2014 by entMoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164718","commentId":1164718,"userName":"booored","timestamp":1405994930,"content":">  \n> \n> spend less time making up your own rules, and focus on the actual rules, as written.\n> \n>  \n\n \n\n\\my rules are WAY better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164915","commentId":1164915,"userName":"Dain Ironfoot","timestamp":1406008071,"content":">  \n> \n> >  \n> > \n> > spend less time making up your own rules, and focus on the actual rules, as written.\n> > \n> >  \n> \n>  \n> \n> \\my rules are WAY better.\n> \n>  \n\nsays who? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited July 22, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164923","commentId":1164923,"userName":"booored","timestamp":1406008970,"content":"says me, whom else has an opinion that matters to me?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1164957","commentId":1164957,"userName":"danpoage","timestamp":1406011590,"content":"That's it folks, we've reached the end of the internet. Nothing more to see here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/109947-thrors-key-versus-surge/?do=findComment&comment=1165233","commentId":1165233,"userName":"Mich the One","timestamp":1406033401,"content":"I must say I quite enjoyed the rules discussion.\n\n \n\nI feel entertained AND educated, thank you."}]}