{"url":"https://community.fantasyflightgames.com/topic/109962-beginning-questions-from-core-set-mirkwood-level-1/","title":"Beginning Questions from Core Set Mirkwood Level 1","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109962-beginning-questions-from-core-set-mirkwood-level-1/?do=findComment&comment=1141582","commentId":1141582,"userName":"pericles3","timestamp":1404353034,"content":"Played a few games from the core set and now that I have the order and game play down, a couple of rules questions came up. Hopefully someone can help me out. All questions are from the Core Set.\n\n \n\n1. Can a hero be readied from another card in play if they have the Caught in a Web card attached? Old Forest Road came up and it indicated that a character could be readied after traveling there. I played it as the Hero could not be readied until they had the resources.\n\n \n\n2. If I optionally engage Hummerhorns does it negate the FORCED text: Deal 5 damage if he engages you?\n\n \n\n3. In the 3rd card of the quest Mirkwood level 1: It says to find Ungliants Spawn. What if this card was already beaten or discarded? Do I have to replay the deck again until I find it, do I search the discard pile for it, or is it considered already defeated?\n\n \n\n \n\nThanks in advance.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/109962-beginning-questions-from-core-set-mirkwood-level-1/?do=findComment&comment=1141594","commentId":1141594,"userName":"GrandSpleen","timestamp":1404354019,"content":"1: Yep, a card effect can ready a hero who has Caught in a Web attached.  Caught in a Web just adds a resource cost to readying the hero during the normal refresh phase window.\n\n \n\n2: Optional engagement and forced engagement are both \"engage,\" and for a card like this, the effect will trigger whether forced or optional.  There are some cards in later expansions that distinguish between forced and optional engagement, but it will say so on the card (like, \"if you optionally engage this enemy, do X\").\n\n \n\n3: If the card is in the discard deck, you have to fish it out and beat it (even if you have already done so once).  The effect on the quest card allows you to pull the spider out of the discard pile if you need to.  Since the victory condition says you have to \"defeat\" Ungoliant's Spawn to win, you have to do this while the victory text is active (meaning, while 3B is the active quest card).\n\n \n\nWelcome to the game and to the forums!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109962-beginning-questions-from-core-set-mirkwood-level-1/?do=findComment&comment=1142955","commentId":1142955,"userName":"pericles3","timestamp":1404442857,"content":"GrandSpleen, thank you for the reply. I normally do not play card games, but this being LOTR I had to try it. The game play is quick to get, but difficult to master. I am enjoying the deck building, art and game play.\n\nEdited July 4, 2014 by pericles3"}]}