{"url":"https://community.fantasyflightgames.com/topic/109961-durins-axefos-on-a-dead-herowhere-does-it-go/","title":"Durin&#039;s Axe(FoS) on a dead hero(where does it go?)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/109961-durins-axefos-on-a-dead-herowhere-does-it-go/?do=findComment&comment=1141576","commentId":1141576,"userName":"Tarkan","timestamp":1404352658,"content":"Hey Forum.\n\n \n\nJust had a little issue playing FoS. One of my heroes was carrying Durin's Axe(the objective), when she died a horrible death :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nSince there is no text like on Gandalf's Map(EfDG), Shadow Key(EfDG) etc. saying to put the objective back in the staging area, when detached, I figured that it had to be put in the encounter discard pile(like the Athelas (AJtR).. But... That just doesn't make any sense to me thematically. If a character dies, and is carrying a big Axe, why wouldn't one of the other heroes be able to just pick it up(meaning I would have to put it back in the staging area, until one of my heroes claimed it)?\n\n \n\nSo which is the correct thing to do?\n\n \n\nThis obviously is the same thing with Durin's Helm and Greaves.\n\n \n\nThanks in advance :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109961-durins-axefos-on-a-dead-herowhere-does-it-go/?do=findComment&comment=1141601","commentId":1141601,"userName":"GrandSpleen","timestamp":1404354403,"content":"Objective cards that attach to other cards count as \"attachments\" for game mechanic purposes.  Like other attachments, you'll have to discard Durin's Axe if its attached hero leaves play.  If you aren't meant to discard a card, the objective will have text stating as much (like the objective attachments in Escape from Dol Guldur, as you pointed out).\n\n \n\nYou can always make something work thematically if you are flexible with the \"meaning\" of a specific game action.  Maybe the axe got washed away in the river... or perhaps the haft was snapped in half by the goblin who killed your hero, or the jaws of the nameless creature that finished him or her off.  Your regular non-objective weapon attachments get discarded when your hero dies, anyway, so you should already have some thematic interpretation ready :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/109961-durins-axefos-on-a-dead-herowhere-does-it-go/?do=findComment&comment=1142042","commentId":1142042,"userName":"Tarkan","timestamp":1404393308,"content":"Thank You GrandSpleen :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}