{"url":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/","title":"Dunland Trap - Australia","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1142976","commentId":1142976,"userName":"PsychoRocka","timestamp":1404444358,"content":"I'm getting over waiting for The Dunland trap to be released in Australia... its been out for a week in the US now and still no sign of it in any stores and no stores can tell me when they will have it in....\n\nI really don't see how it takes so much longer to be released here.... it really should be like magic where there is an international release date regardless of where in the world you are...\nI know FFG are nowhere near the size and have nowhere near the fanbase of wizards of the coast but its really starting to make me sour. Everyone else is already playing this quest and im still waiting cause overseas shipping is an extra $35 - $50 cost for any quick delivery and anything cheaper will take at least 2 or 3 weeks to get here at which point it should hopefully be out here anyway...\n\nHas anyone in Australia seen this anywhere at all or know anywhere online I can buy it and not get charged like 40 or 50 bucks extra for delivery just to get it express/sooner than a week and a half away?\n\nEdited July 4, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1143030","commentId":1143030,"userName":"booored","timestamp":1404449233,"content":"I am Australian and order the packs from overseas. BookDepositary is pretty cheap as they factor the shipping into the base , but as it is so cheap they run out of stock fast.\n\nWe pay 20 ish a pack. You can get individual packs sent from LotasVault to Australia for like 1 or 2 dollars. They get zero day stock and have fast postage. If you order in bulk, I get lotr, and, CoC and WI at same time as shipping is combined you end up paying nearly 5 bucks cheaper per pack.\n\nMiniature Market CoolStuff funagain also are good, and the truth is shipping from these international sites is usually cheaper, or only marginally more expensive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1143060","commentId":1143060,"userName":"PsychoRocka","timestamp":1404451840,"content":"Book Depository have it for like $15 dollars.... with free international shipping, it ships the day after purchase and it only takes 5-8 business days to Australia....... that is just insane.... how are they even able to offer it that cheap..? compared to FFG who need $46 dollars from me for postage alone? bizzare.... I just ordered it, hope it all works out as it says it will....\n\n \n\nminituare market wants $42 just for postage and lotus vault want like $46, **** both of them! Cool stuff from memory wanted the same sort of amount..... jeez"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1143114","commentId":1143114,"userName":"booored","timestamp":1404457069,"content":"like i said I get them in bulk so 4 or 5 packs ata a time so the shipping evens out. BP is very cheap but can sometimes take a while to turn up. I've also had them send the wrong pack once or twice. Though they always rsent it free of charge"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1143197","commentId":1143197,"userName":"PsychoRocka","timestamp":1404464310,"content":"Interesting... Well hopefully I get the right one and within that 8 day period... =/\n\nFor just 16 dollars that's fine. Thanks for your help dude."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110060-dunland-trap-australia/?do=findComment&comment=1143604","commentId":1143604,"userName":"asmeus","timestamp":1404498258,"content":"Only little problem with bookdepository is, adventure packs usually get compressed and deformed a little bit, but not so much to make me not order from them. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}