{"url":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/","title":"Ideas to improve the game (none rules)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153396","commentId":1153396,"userName":"richsabre","timestamp":1405246218,"content":"firstly, yeah, i know ive spelled 'none' wrong :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\ni thought with so much talk on errata we could talk about the game itself, and how we would (if we could :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) improve it... by this i mean non-rules based improvements... perhaps different/more components? longer rules book? different type of releases etc\n\n \n\nfor example, i would like it so every deluxe pack, an insert is added that is a paper version of the FAQ. i guess not everyone likes to keep going back to the computer to check the online one, and not everyone has access to a printer\n\n \n\ni would love to see some more art sleeves. i have all 4 of the character art (nazgul, gimli, gandalf, daughter) but id love to see some with locations on the back\n\n \n\nan accessories pack available to buy... this could be something like a pack with\n\n-extra tokens\n\n-extra threat trackers\n\n-a turn counter\n\n-game mat\n\n \n\nit would be amazing... AMAZING! if ffg could put together a book, to buy seperatly, of all the main heroes and characters in the game, with their art, and a breif description of who they are in tolkiens world... an art/guide book to the game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\ndedicated lotr lcg art deck boxes\n\n \n\nan app with the cards on\n\nEdited July 13, 2014 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153399","commentId":1153399,"userName":"Olorin93","timestamp":1405246836,"content":"Agree on every point. In solo play I sometimes count the rounds with the second threat tracker, but a dedicated turn counter would be cool.\n\n \n\nI started a topic on new art sleeves a while back. Location artwork is a nice idea - one can only hope! I found some webpage where you can send your own picture and get custom art sleeves and playmats, but it gets expensive to order from the US. If anyone knows of a European playmat reseller, please share!\n\n \n\nEDIT: Art deck boxes would be great too. In the meantime, my friends and I got some Ultra-Pro boxes.\n\n \n\nhttp://www.imgur.com/EQQ9adc [http://www.imgur.com/EQQ9adc]\n\nMine is the black one on the right, with my name in tengwar.\n\nEdited July 13, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153406","commentId":1153406,"userName":"richsabre","timestamp":1405247723,"content":"nice! custum deck boxes - love it :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nah yeah, ordering to UK would be difficult, especially when with the amount i play theyre quickly going to loose their new shine (sleeves i mean :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]) ... though having said that after the thousands of games ive played only a few of my sleeves are coming away at the edges\n\n \n\ni would also love to see (and i guess im going off topic here) merchandise of the game... i know this wont happen of course, but custom hooded sweatshirts, coffee mugs, etc.. \"one game to rule them all\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153408","commentId":1153408,"userName":"MyNeighbourTrololo","timestamp":1405247737,"content":"Player-card-only expansions. Mixed and sphere-themed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153413","commentId":1153413,"userName":"richsabre","timestamp":1405248159,"content":"i hate to say this (dare i say this? ) .. but.... more regular previews\n\n \n\n...runs away...\n\n \n\nseriously though,  i have seen this forum go up and down, but its not been quite so dead as this, not to sound negative (i do love this game like a child :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) ... but the forum if anything needs a boost\n\nEdited July 13, 2014 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153434","commentId":1153434,"userName":"MyNeighbourTrololo","timestamp":1405251216,"content":"Well, yeah. I'm aching for a new preview. But as people mentioned, it's unlikely we'll see any before gencon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153639","commentId":1153639,"userName":"Distractionbeast","timestamp":1405266813,"content":"I'd like to see some further simplification of mechanics into more keywords - like Time X, Siege, etc. Also, I'd like for the secrecy keyword to simply trigger a following effect, not just a cost reduction. It could incorporate other effects too like card draw or stat changes, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153714","commentId":1153714,"userName":"Gizlivadi","timestamp":1405270121,"content":"Well Rich, you're only talking about more lotr lcg merchandise, which is fine, I would love it. But what I think is more necessary is an improvement to the game itself. First, we need more player cards. Trololo has also mentioned this, and I agree completely. Either player card expansions (which is unlikely, since we already have too many different kinds of products for a general market) or just increase the number of player cards in packs and expansions. Make it 50/50, that's what it should be. It's no frigging wonder Secrecy was/is underdeveloped when you have so few player cards in a cycle. We need to up the number of player cards IMO. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153806","commentId":1153806,"userName":"richsabre","timestamp":1405275074,"content":"> Well Rich, you're only talking about more lotr lcg merchandise, which is fine, I would love it. But what I think is more necessary is an improvement to the game itself.\n\ni know!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] i realised, but could not help myself :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1153926","commentId":1153926,"userName":"player1761766","timestamp":1405281326,"content":"See, I'm definitely on the other end of the scale here - I'd love to have standalone quests without the bother of player cards! Perhaps ones that go back and revisit some of the older encounter sets again? There are some from the core set that I feel a distinct nostalgia for, but there are only nine quests they're used in. But I'd love to see standalone deluxe expansions that are just three quests, with massive encounter decks, but with no subsequent cycle or anything. Basically like the Saga boxes, I suppose. \n\n \n\nI'd also like to see a campaign supplement that has a selection of 'generic treasures' I suppose you could call them. Boons and burdens that can be added to any campaign you like in a mix-and-match kind of way, with generic boons such as bonuses to stats or whatever, and generic burdens that work in a similar way for the encounter deck or something. Not entirely sure how the design would work in this sense of course, but I often think back on how Flying Frog Productions include all manner of additional content in their boardgames that they fully expect their audience to make up rules for. I'm just typing my thoughts as they occur to me, so that could possibly make no sense. But, yeah!\n\n \n\nMaybe. \n\n \n\nAnd yes, all of that is not in the original spirit of the post, I do apologise! \n\n \n\nI would definitely buy a 'One Game to Rule Them All' mug! If we're talking extra tokens, why not make them acrylic? Or something? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1154227","commentId":1154227,"userName":"Bullroarer Took","timestamp":1405301890,"content":"I don't feel there are enough tier 1 archetypes right now. Furthermore I feel like some of the tribes are definitely under represented. For those reasons I wouldn't mind an injection of player cards.\n\nWe're starting to get the Nightmare closer and closer to release so that's good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1154379","commentId":1154379,"userName":"Khamul The Easterling","timestamp":1405310185,"content":"> We're starting to get the Nightmare closer and closer to release so that's good.\n\nI'm dying for \"The Long Dark Nightmare\"........ can't wait.\n\n \n\nAbout Rich's post..... I really agree there should be FAQ included in some of the expansions.  \n\nI want a \"North Stair\" location sleeve.  Here is the art if you forgot.  http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/the-hills-of-emyn-muil/the-north-stair-thoem [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/the-hills-of-emyn-muil/the-north-stair-thoem]\n\nI'm not big on the extra token, threat counter ect thing.....i doubt it will happen.  They just want you to buy another core set.\n\nIt would be amazing if they put together an art book with descriptions of the characters however that is definitely not going to happen. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]  That's only something that the customers can do themselves.  \n\nAnd I think deck boxes are kind of dumb and worthless but that's just me.....\n\n \n\n:ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1154779","commentId":1154779,"userName":"Glaurung","timestamp":1405345492,"content":"I think now when we start to get all this NM many things is more balanced. And yes true we need now more player cards. With encounter cards situation now is more then ok. We need more different decks but deck building is a bit limited now"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1155532","commentId":1155532,"userName":"Catastrophic09","timestamp":1405374001,"content":"Great suggestions, I also think more player cards would obviously be great but with time I think this will all get filled out. Looking at Dwarves you basically had them fully fleshed out in most of the spheres and it only took two sagas and a deluxe box with some support throughout the Dwarrowdelf.  So if we still have 5 more Saga boxes and many Deluxe expansions the slow player card growth will be fine. Although I really do think we need 4 heroes per Saga so all characters can be on a card and many heroes can be in multiple spheres. The Road Darkens better be an exception with it's one hero..\n\n \n\nInserts with the updated FAQ is a great idea and then people could have easy access to everything and be up to date, I would love that!\n\n \n\nAnd more frequent articles would also be nice.  Back in the Dwarrowdelf cycle we got 3 articles per AP that only spoiled a card or two and gave us all something to read and talk about. Now we get one big preview with a ton spoiled and then hear nothing until it's released. I also really like those Second Breakfast articles, so more of those and general articles with the developers telling us cool info about making the game and such.\n\n \n\nBut yeah in general I think they're doing great with the game currently, easy and nightmare mode helps the game cater to more people and with the new POD quests to fill in what was missed on the Saga's there's going to be epic campaign modes! It would be cool to see the campaign mode added to the normal cycles also to give them more replayability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1156453","commentId":1156453,"userName":"Mattr0polis","timestamp":1405434065,"content":"-Boons/Burdens/etc Campaign set either specifically for the earlier quest cycles, or just a generic set that can be used with any cycle. The Campaign mode is SUCH a great idea, but we can't even play it completely for probably a couple years when the LotR Saga boxes are finally complete. This would be an easy way to let us campaign starting now. Could even be just a print on demand product.\n\n \n\n-Dedicated Round Tracker. I also use an extra Threat Dial but I had to write on it to make sure I didn't confuse the two.\n\n \n\n-Acrylic tokens. Surprised this isn't already a thing. They do it for all of the other LCGs, though mainly through the game night kits, but still.\n\n \n\n-Lord of the Rings art book. I think FFG has already done this with Game of Thrones so maybe they'd make one for LotR. It'd probably be 90% Magali Villeneuve art lol but nothing wrong with that.\n\nEdited July 15, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110744-ideas-to-improve-the-game-none-rules/?do=findComment&comment=1158165","commentId":1158165,"userName":"MathGuru83","timestamp":1405530758,"content":"This doesn't necessarily pertain to this game as it does to all of FF's LCG's, but I would like to see a \"official\" platform for online play. Due to the CCG industry, it's extremely hard to find a store that sells the product, or even play it. I would be more then willing to pay for a program to play this online. This would also make adding, subtracting tokens and other mechanics a lot simpler. I know there are some sites and programs that allow this already but it seems to be a lot of \"jumping through hoops\" to setup/install and to play a game."}]}