{"url":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/","title":"The Fall of Gil-Galad","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1157636","commentId":1157636,"userName":"Olorin93","timestamp":1405495638,"content":"I'm considering whether to include this in my deck or not. Attached to a powerful hero it can certainly make a difference.\n\n \n\nBut I don't suppose it combos with Boromir's or Caldara's ability? The wording on the heroes are, I think, \"discard\" while FoGG requires the hero to be \"destroyed\" - not generally \"leave play\". Otherwise it would be a very powerful combo with Boromir - dealing 2 damage to multiple enemies and then lowering your threat by 11.\n\n \n\nI'm not sure it's worth building around, to me, but one strategy could be to attach it to a hero of a high-threat player if you have Landroval or Fortune or Fate available. Elrond would be the most effective, if you don't already have several attachments or resources on him.\n\nEdited July 16, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1157666","commentId":1157666,"userName":"Ohnomycocoa","timestamp":1405498545,"content":"It definitely doesn't work with Caldara or Boromir as they, as you say, discard rather than being destroyed.\n\n \n\nIt's not a card I'm planing to build around as it's too combo-reliant and mega-expensive to pull off (get song on hero, get hero killed, find some way to get them back in your deck, pay for way to get them back - e.g 5 for Fortune or Fate).\n\n \n\nBut it might be worth just tossing in a copy on the off chance you lose a hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1157668","commentId":1157668,"userName":"alogos","timestamp":1405498703,"content":"The \"limit 1 per deck\" is the key. You can't deckbuild around it.\n\nYou can make a fun deck with word of command and 9 istari though, but it takes a lot of cards. Better not deckbuild around it.\n\nAlso, discarding a card does not destroy it.\n\nIt's better in a secrecy deck, when you have lost secrecy, in order to regain it, and with a hero you do not want to put attachment (not elrond for me, unless you didn't put vilya)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1157973","commentId":1157973,"userName":"Noccus","timestamp":1405522156,"content":"You can use rivendell minstel to dig it up.\n\n \n\nThat means using lore + spirit, so how does this sound:\n\n \n\nDon't mind  your threat whatsoever, maybe using Fatty. (or Grima)\n\nLoragorn uses his threat reset when you almost threat out, then you have him killed next round with Fall attached.\n\nAnother -12 threat that kicks you right into secrecy.\n\nThen use Good meal on Fatty with Fortune or Fate to get Aragorn back.\n\n \n\nMight be a bit difficult to set up, but cool enough to try. Rivendell minstrel is the key though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1158401","commentId":1158401,"userName":"Olorin93","timestamp":1405541647,"content":"That's a cool idea Noccus!\n\n \n\nSomeone mentioned how it's just as cost-effective to use 2 Galadhrim's Greetings as first playing FoGG and then Fortune or Fate. My one objection to this is if you sacrifice a high-threat hero (like Loragorn, as you say), you could play Fortune or Fate for free using Vilya.\n\nEdited July 16, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1162293","commentId":1162293,"userName":"Catastrophic09","timestamp":1405806144,"content":"Yeah I do like this card, it's one that I will start putting in most of my Spirit decks just because it's only one copy and could be a game saver at the end if things get rough. It's definitely best to play on another player though who is more likely to threat out so if I'm playing solo it may not even be worth putting in if all my heroes are low threat.\n\n \n\nAnd of course as others said- to actually play around this card it's difficult because there's only one copy buy fun to try.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1217394","commentId":1217394,"userName":"jormungandr","timestamp":1408647429,"content":">  \n> \n>  \n> \n> Someone mentioned how it's just as cost-effective to use 2 Galadhrim's Greetings as first playing FoGG and then Fortune or Fate. My one objection to this is if you sacrifice a high-threat hero (like Loragorn, as you say), you could play Fortune or Fate for free using Vilya.\n\n \n\nEven more cost effective if you sacrifice gandalf or use good meal (although then it's less card effective)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110983-the-fall-of-gil-galad/?do=findComment&comment=1220344","commentId":1220344,"userName":"Catastrophic09","timestamp":1408759052,"content":"I just used this card to good effect yesterday against the Three Trials- put it on Elrohir, Landroval was in play, was able to take an attack which killed him, lowered my threat and then brought Elrohir back into play to defend again against more Guardians.  So yes as a card which only takes up one slot, I think it's definitely worth it and really fun when you get to play it! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}