{"url":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/","title":"Does anybody else miss power cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1157846","commentId":1157846,"userName":"Kcall07","timestamp":1405514791,"content":"I had a look at my deck recently and realised 90% of it came from the first two cycles, or more specifically, from the Dwarrowdelf Cycle. Those expansions had just so many powerful cards which are still the staple of many decks today. All of the heroes were winners, and with player cards like Arwen, Sword that was broken, Imladris stargazer, Warden of Healing to name a few, the cycle was, in my opinion, one of the best.\n\nIn those days, I used to check for stories on the site incessantly, hammering the refresh button. I used to pay for expedited shipping so the adventure packs would arrive sooner. And say what you will about how spirit Glorfindel has affected the game, but I remember vividly the anticipation I felt for that pack. It's not a feeling I've felt with this game since.\n\nNowadays when I open a pack, there are one or two cards that are fun to try out, but more often then not they are placed in my binder and stay there. I realise there have been some great things recently for theme players, Rohan, Gondor etc, but if you don't want to base your deck around a specific trait, exciting cards have been thin on the ground. Take the Against the Shadow cycle for example, barring a few cards like Gondorian shield and Outlands, the cards were lacklustre at best and some of the heroes were borderline unusable.\n\nDon't get me wrong I still love the game. But I miss that excitement of anticipating a new pack. In my opinion, with any game of this type where you level up or gain new powers, the trick is to give the illusion of excessive power, but in reality it fits perfectly into the game. It's a carrot on a stick thing. The other LCG I play is Star Wars. With that game there is always the illusion of cards being overpowered. You see the preview and think that it can't possibly be right, but when you play it the limitations become clear and the card more often then not fits perfectly into the meta. Due to its cooperative nature, this is something I think LOTR has shied away from for some time.\n\nOf course there are lots of justified arguments against power cards. Limiting design choice, breaking the game etc. But could there be some arguments for them? Adding more options to the small number of power cards currently available? The anticipation of new packs and the excitement of increasing your power against the ever more devious encounter deck? I personally feel that LOTR has erred on the side of caution for too long. What do people think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1157943","commentId":1157943,"userName":"richsabre","timestamp":1405520590,"content":"nice post :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] i think it is interesting about the dwarrowdelf cycle... that really did have some amazing cards in. its a difficult choice though... there are players of all levels, and if cards are too powerful the stronger players call powercreep, if they are too weak, weaker players get frustrated with losing so much\n\n \n\ni would place myself rather neatly between the two, i dont mind getting weaker, theme cards... 'fillers' if you like but i admit i havnt felt that stunned feeling since i smashed quests with hama and a block deck paired with glorfindel/strider quest deck\n\n \n\nperhaps my play style has just altered :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158040","commentId":1158040,"userName":"MyNeighbourTrololo","timestamp":1405525722,"content":"Well, Dwarrowdelf had some insane cards, yet it had some worst of all. But that's not the point. I hate to bring it up again, but all things you describe happen because of slow player card pool progression. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158050","commentId":1158050,"userName":"joezim007","timestamp":1405526210,"content":"I'm on the fence about this. A lot of the newer cards have been \"situational\", meaning that they are weak in general, but can be amazing in certain decks/situations. I think Voice of Isengard, introduced several \"power\" cards that are slightly situational, like Eomer, Rohan Warhorse, and a few of the Doomed cards.\n\n \n\nI'm personally happy that these cards have limits on them because I'm annoyed with how some of the power cards just \"can't\" be left out of your decks. Rather than making more powerful cards, many of us wish some of the old power cards were weakened a little bit. I'd rather have \"horizontal\" growth than \"vertical\" growth, meaning I'd rather have a lot of viable options that aren't necessarily more powerful than other cards, but certainly different. If we grow too much \"vertically\" by increasing the power of the cards, then we end up forcing newcomers to NEED to have ALL (or at least a large majority) of the cards in order to be able to beat the newer quests that have to keep up with the power of the player card pool.\n\n \n\nWe're having that problem enough as it is. There are several quests from Heirs of Numenor onward that are very very difficult to handle without access to a large majority of the card base.\n\n \n\nIn spite of all that, I know what you mean. When new packs come out, there is generally a lot of debate about the viability of many of the cards. Examples from JUST Dunland Trap\n\n \n\nFirefoot: hard to find a use for him besides on Eomer (definitely possible though). Many people even doubt that the \"trample\" ability will come into play much. When it comes to single-player, you're less likely to be engaged with more than one enemy, and the extra damage from the \"trample\" will likely be small when you do get to use it.\n\n \n\nThe White Council: Versatile, but many of its choices are lackluster and it forces one player to pay for everyone.\n\n \n\nThe Fall of Gil-Galad: It is undeniable that reducing your threat by as much as a hero's initial threat is strong, but you are limited to 1 copy, so it is inconsistent, and you NEED to kill a hero for it to work. Normally, you try to avoid that, and most people wouldn't do that just for a threat reduction. Fortune or Fate (or Landroval) can bring the hero back but that adds up to a total cost of 6. With 6 resources we can use 2x The Galadhrim's Greeting for the same or better effect for every hero except Elrond. Of course, this could be added threat reduction and if you're going to lose the hero anyway, why not benefit a bit from it. Sooo situational.\n\n \n\nSwift and Silent: Very comparable to Cram. They each have their pros and cons. It's hard to declare one to be better than the other. Great example of horizontal growth, but makes the card seem unimpressive since we already have a similar card.\n\n \n\nMuch of this can be disappointing at first, but I thinks it's healthy for the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158075","commentId":1158075,"userName":"Mattr0polis","timestamp":1405527605,"content":"It's an interesting discussion. It's a conundrum a lot of card games have to face I think. A certain amount of powerful cards are definitely necessary to drive discussion and keep people interested and buying the new cards. Even cards that end up getting errata provide a great deal of interest and discussion. For example, I think the 3 most popular deck list articles I've seen since this game began were:\n\n \n\n-Booored's Zigil Miner deck\n\n-Mattr0polis' Master of Lore/Hammersmith deck\n\n-Glaurung's Dwarf deck\n\n \n\nTwo of those three ended in errata and let's face it none of us would be shocked if Dain was errata'ed at some point as well to bring dwarves back down to earth. But those were fun discussions.\n\n \n\nBut it's a weird tipping point as well, because too powerful of stuff and there would be constant errata. I think that's why FFG has become more cautious, though I agree, maybe slightly a bit too much so.\n\n \n\nWe'll see. There's been a few great cards already revealed in this cycle. Firefoot CAN be pretty beastly in the right build (ask my teammate TheJanitor about his deck), Silvans have the early makings of a powerful deck and Galadriel will be a game changer. I'm sure there'll be others. I do agree that a full deluxe pack of nothing but player cards at some point would be nice, since that would maybe be a big enough boost to instantly break open the current deck archetypes, but that's a different discussion.\n\nEdited July 16, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158086","commentId":1158086,"userName":"Raven1015","timestamp":1405528082,"content":"Definitely an interesting discussion. It's important to note the changes in design team between cycles and how this may affect the whole issue. In Voice of Isengard/Ring-maker, we are seeing the first entirely Caleb/Matt batch of player cards (leaving aside the Saga Expansions), and so while Dunland Trap may give us some indication of the power level we can expect, we will really have to see at the end of the cycle. I would argue that probably Black Riders, because it was designed by Caleb and the two Hobbit boxes give us a better indication of what is to come in terms of player cards than Against the Shadow.\n\n \n\nMattr0polis is right, though, in that I think some of the stuff in the Dwarrowdelf cycle, especially the Ziggy errata, has tended to make the designers more cautious as a whole.\n\nEdited July 16, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158122","commentId":1158122,"userName":"Mich the One","timestamp":1405529195,"content":"Yeah, I think I agree with Kcall's post. We need more strong cards, not because the game is too hard  but for entertainment and variety. It is fun to trigger cool card effects, swipe the enemy, do something clever that improves your position significantly, not just slightly. And for that you need good cards that make for good plays/combos.\n\n \n\nStill, I think the philosophy of LotR LCG is a bit different. It is more about little tweaks here and there than having access to power cards. Playing LotR LCG feels like balancing the cost/effect ratio of your cards so that it is just a bit slightly in your favour. And it amasses during the course of your game, so that you build your advantage over the encounter cards. That is the beauty, but also the curse of this game.\n\n \n\nSometimes you just wish for that ooomph!, that pow-right-in-the-kissers and all the goblins are dead thing. But well, there are games for that (Hearthstone, anyone? Man, try it if you have not, it so simple and tons of fun, but at the same time will make you truly appreciate finesse of LotR). LoTR is more subtle, and that is good cause in the end you play against an artificial system which is not creative at all, so when this balance is lost (Outlands!), it cannot really defend itself properly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158186","commentId":1158186,"userName":"Johnny Awesome","timestamp":1405531902,"content":"My only big beef is with the lack of playtesting on certain cards.\n\n \n\nZigil Miner should never have made it out of the gate for being too powerful. Dain and Glorfindel are definitely on the edge.\n\n \n\nOn the other side of the coin I don't think cards that are useless should have ever been made. I believe in cards that are either very useful or situationally useful at least. There are some cards that are just crap and no one would ever play them, and that's a waste IMO. Theme isn't enough to justify some of these crap cards.\n\n \n\nLastly, I'll just say that it would be nice to make a Leadership deck one day that didn't include Steward of Gondor as a no-brainer card, or a Spirit deck without Unexpected Courage. As it stands I love those cards, but they are auto-include, which makes deck building more boring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158256","commentId":1158256,"userName":"Tracker1","timestamp":1405535262,"content":"I think we're getting a reasonable amount of power cards, but they are not really on the same level as some in the Dwarodelf, the cards now are a bit more subtle and take a bit more effort to maximize their potential. Some cards at first glance seem not so great, but then they start to make a lot more sense a number of AP's and expansions later.\n\nI like that the designers are starting to focus on traits that had no synergy (warrior, scout etc) which will give new life to them. I'm satisfied with the balance of power in player cards now, the problem is that there is not enough to work with. Well that's not entirely true. There are lots of cards to work with I have a whole box full of cards that get little use. So, I hope future cards will make these cards more useful, but the slow drip into the player card pool is frustrating.\n\nHowever it's not all about the awesome player cards, the scenarios themselves are what can make an insignificant card into an excellent card, and I think the designers are now more than ever starting target decks that rely on power cards and creating scenarios that hinder their use.\n\nOverall, I like cards that are useful, they don't have to be super powerful, but it's cool if the card when linked to other cards in subtle ways becomes powerful. Cards that are obvious power cards become crutches in a players deck since they are simple and easy to use. Cards that aren't as good as the power cards get sent to the box, unless the card has a slight twist to it that gives it a certain edge in a particular situation that makes it a more interesting choice over the obvious power card. Those are the types of cards that interesting decks are made out of, and we need more cards like that. When more powerful decks are being made with these types of cards we'll know that the player card pool has reached a healthy balance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158341","commentId":1158341,"userName":"Distractionbeast","timestamp":1405538503,"content":"I see that the power curve is leveling out a bit.  The core set was full of both power cards and useless fillers that will never see the light of day.  It had too much variance for a healthy long-running game.  Dwarrowdelf erred on the side of power cards, but later sets have settled into a more comfortable balance with less variance.  The only remaining problem I see is that it's very hard to ignore the old power cards which remain legal - hence the reliance on errata.  I wish it didn't happen as often, but it's sometimes the only way to maintain the long-term health of the game.  They could always go the MtG route and reboot the game every few years, eliminating entire sets from legal play and reprinting those select few that make the cut.  That would leave many of us out in the cold, needing to spend hundreds of dollars to get back into the new game.  \n\n \n\nI think there's plenty of life left to this run if it continues cautiously and remains creative in its encounter design.  There are always ways to punish players who use certain cards and force new ways of deckbuilding and I see Caleb & Co. doing just that.  That gives me hope.  Worried about Steward of Gondor?  Make an encounter effect which raises the players threat every time a resource is gained.  A similar effect worked in VoI with card draw and turtling.  \n\n \n\nThere are always ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158653","commentId":1158653,"userName":"iznax","timestamp":1405556857,"content":"I think because of the slow player card pool progression the designers didn't have the space for \"experiment\" cards they had to give us cards to build a deck. now that the card pool is fine, they have that space to create \"interesting\" cards to promote different, unique and more clever ways to play. of course since they don't want to lose the casual/not hardcore players, things like outlands continue (and will continue) to happen.\n\n \n\n1. P.S. slow card pool progresion is a fact for lotr take it or leave it. I personally like it because there is no space for \"filler\" cards and we have a very (not perfectly) clean card pool.\n\n \n\n2. P.S. my english are really poor so i hope i made my point clear.\n\n \n\n3. P.S. great topic Kcall07 i salute you ! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158684","commentId":1158684,"userName":"divinityofnumber","timestamp":1405559866,"content":"I think that the game is progressing nicely. I would hate to see more power creep. It ruins games. New cards should be \"interesting\" and \"different\", rather than \"OMGZORZ!!!! THAT HERO HAS 5 ATTACK STRENGTH!!!!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158720","commentId":1158720,"userName":"booored","timestamp":1405562305,"content":"the problem isn't the power of the cards. As 666 said cards should be interesting not \"powerful\". The real power in card games come though card synergies and those synergies are interdependent on the face value strength of the card.\n\nThe problem is that this game expands sooooooooo slowlllllly. I forget it but it has been talked about before and al the numbers crunched but LoTR basicaly expands at nearly a 3rd the speed of other card games. For example the new deluxe expansion for CoC has 60 unique cards, While a LoTR deluxe will have like 10 and a hero.\n\nSo when a good card is good, it stays relevant for a LONG time in this game.\n\nSo in short it is not about power but having a tiny small card pool that makes so many cards so powerful across all decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1158785","commentId":1158785,"userName":"MyNeighbourTrololo","timestamp":1405567515,"content":">  \n> \n> 1. P.S. slow card pool progresion is a fact for lotr take it or leave it. I personally like it because there is no space for \"filler\" cards and we have a very (not perfectly) clean card pool.\n> \n>  \n> \n>  \n\n \n\nYeah, no space for \"filler\" cards, yet we constantly getting them with each pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159026","commentId":1159026,"userName":"alogos","timestamp":1405587307,"content":"Three Cards for the Elven-kings under the sky,\nSeven for the Dwarf-lords in their halls of stone,\nNine for Mortal Men doomed to die,\nOne for the Spike [https://www.google.fr/url?sa=t&rct=j&q=&esrc=s&source=web&cd=7&cad=rja&uact=8&ved=0CDgQFjAG&url=http%3A%2F%2Fwww.wizards.com%2FMAGIC%2FMagazine%2FArticle.aspx%3Fx%3Dmtgcom%2Fdaily%2Fmr11b&ei=PY_HU7SwKYKl0QXEuIGwDQ&usg=AFQjCNEaKGuJVh4mc9Ojv_YM4AbpxpiYTw&sig2=3z0lbn0xDZnraX7QzkUSZQ&bvm=bv.71198958,d.d2k]on his dark throne\n\nIn the Land of Power Combo where the Shadows lie.\n\nOne Card to rules them all.\n\nOne Card to find them.\n\nOne Card to bring them all \n\nand in the darkness bind them\n\nIn the Land of Power Combo where the Shadows lie."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159164","commentId":1159164,"userName":"joezim007","timestamp":1405601041,"content":"I must be a casual gamer because every time I hear people complain about the card pool growing too slowly, I think they're crazy. I have never played a card game that expanded this quickly. Not only that, I'm lucky to get to try out half the cards that I want to try. If this game grew any faster, I might be compelled to quit. Also, even if the card pool grew faster, I don't think that they would have made any cards that would have pushed the most powerful cards off their thrones.\n\nEdited July 19, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159251","commentId":1159251,"userName":"MyNeighbourTrololo","timestamp":1405606278,"content":"> I must be a casual gamer because every time I hear people complain about the card pool growing too slowly, I think they're crazy. I have never played a card game that expanded this quickly. Not only that, I'm lucky to get to try out half the cards that I want to try. If this game grew any faster, I might be compelled to quit. Also, even if the card pool grew faster, I don't think that they would have made cards that they would have made anything to push the most powerful cards off their thrones.\n\nLotR LCG has slowest player card pool growth of all FFG's LCGs. And slowest release pace of APs and expansion boxes too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159284","commentId":1159284,"userName":"Mattr0polis","timestamp":1405607582,"content":"The only reason I am okay with the release speed of player cards is because I also play Star Wars LCG, so I can play that when I run out of deck archetypes to try. But yeah, if this was my only LCG I'd probably go crazy with this pace.\n\nEdited July 17, 2014 by Mattr0polis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159292","commentId":1159292,"userName":"Johnny Awesome","timestamp":1405608074,"content":"The biggest shame isn't the lack of power cards, it's the existence of useless cards. It's almost like they weren't playtested.\n\n \n\nFor instance, the The Fall of Gil-Galad card is absolute rubbish. No good player is putting that in their deck and to add insult to injury they put 3 in the pack and you can only use one in a deck. Ridiculous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159349","commentId":1159349,"userName":"iznax","timestamp":1405611298,"content":"I don't want to go off topic but i'd like say that every \"combo\" in the game don't have to be Glorified/light of Valinor, Legolas/blade of gondolin, Dain/dwarves, Hirluin/Outlands, Elrond/Vilya etc. I think fall of Gil-Galad/Landroval is a nice one, not the easiest way to reduce your threat, but the coolest one for sure (and you get 1 VP to)  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  . That's what i meant with \"now they have that space to create \"interesting\" cards to promote different, unique and more clever ways to play\".\n\n \n\nP.S. I don't want to offend anyone that uses any of the above \"combos\", i use many of them to, a lot :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited July 17, 2014 by iznax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1159481","commentId":1159481,"userName":"chrsjxn","timestamp":1405615957,"content":"> I think that the game is progressing nicely. I would hate to see more power creep. It ruins games. New cards should be \"interesting\" and \"different\", rather than \"OMGZORZ!!!! THAT HERO HAS 5 ATTACK STRENGTH!!!!\"\n\n \n\nHeh. That's exactly what I said when I saw Eomer. And unlike Beorn, he's not 12 threat, and you can play cards on him.\n\n \n\nI think they've been doing well with bringing in good, high power cards recently. Sam and the hobbit synergy are great. Elf-stone continues to be amazing in any deck with lore. Grima and the doomed cards are very cool for solo play. Caldara is brutal.\n\n \n\nPlus Outlands. Not a combo player's dream, but for sheer numerical superiority, they're your best bet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1160975","commentId":1160975,"userName":"Rapier1","timestamp":1405706127,"content":"> Of course there are lots of justified arguments against power cards. Limiting design choice, breaking the game etc. But could there be some arguments for them? Adding more options to the small number of power cards currently available? The anticipation of new packs and the excitement of increasing your power against the ever more devious encounter deck? I personally feel that LOTR has erred on the side of caution for too long. What do people think?\n\n \n\nThere's several good arguments for power cards depending on how you define them; the best argument from a companies point of view is that controlled power creep is the best way to sell your product.\n\nIf you have a high power creep (say the Gondor cards were just better than the dwarf cards) then people might be put off, they'll realize that the massive power creep is purely marketing. If you don't have any though, people may well say, hey I read the spoilers for that card pack, it doesn't come with anything I want at all, so I won't buy it.\n\nAdding new options is an interesting one: it could be argued that a new power card is created any time a brand new (useful) mechanic is added to the game. As an example the first time we had the ability to ignore a shadow card (Burning Brand) it was amazing, people were all talking about it and how big a game changer it was.\n\nSubsequent ignore shadow cards could be made that were better and would create the same buzz, however adding a weaker burning brand will just make people go \"eh, burning brand is better\". \n\nSo if you're looking for truly powerful new auto includes, you're looking for brand new mechanics that cut into the way the game currently works. A new card type, a new way to play an old card type. Something like doom on player cards - which allows them to not have power creep (you could print a new burning brand that was exactly the same with a different resource cost and a doom key word for instance). It would however open up all new play and combos.\n\nThe lure of having your character level up and fight bigger monsters deck grow in power is a major way to sell subsequent expansions. People want to feel they're getting better at the game and a good way for people to do that is to get more powerful options.\n\nOn the other hand I personally think that having power cards is a major problem (as I wrote at length about the value of  errata or ban on Unexpected Courage :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]).\n\nThey're much better off designing the cards so that people go \" hey that's awesome for X\" rather than \"hey that's awesome.\" So I think if the game continues to live it will be more and more themed around traits and types rather than just having cards that are awesome for the base mechanics.\n\nIf I could go back in time to suggest how they should develop this game, I would have suggested that the core set should choose one theme to really support instead of having to make a product that could stand alone so had to have very strong synergies like sneak attack gandalf. \n\nMost card games make these mistakes though, A lot of the most powerful magic cards were in the early sets; the first set of dominion had the most broken cards which then impacted the design of all future cards in a detrimental way (Chapel). I think it may just be impossible not to have an effect like this (first edition board games often have similar problems, as do new computer games).\n\nI think you should expect to get less cards like UC and Steward of Gondor in future, unless a mistake is made."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161006","commentId":1161006,"userName":"MyNeighbourTrololo","timestamp":1405707550,"content":"Look who's back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161046","commentId":1161046,"userName":"Khamul The Easterling","timestamp":1405709078,"content":"> Look who's back.\n\nWe all know Rapier is you.  Remember we figured it out?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161071","commentId":1161071,"userName":"booored","timestamp":1405709995,"content":"> > Look who's back.\n> \n> We all know Rapier is you.  Remember we figured it out?\n\nlink please"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161076","commentId":1161076,"userName":"Rapier1","timestamp":1405710162,"content":"> Look who's back.\n\n \n\nI'm going to interpret this as a positive expression in your minimalist style :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks for noticing I was away for a while and that I came back. These little things are nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161082","commentId":1161082,"userName":"Mndela","timestamp":1405710409,"content":">  \n> \n> > Look who's back.\n> \n> We all know Rapier is you.  Remember we figured it out?\n> \n>  \n\n \n\nAre the same guy, sure. But he is not aware of it. ^^ HIs identity changes for moments...\n\n \n\nJoke :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nEdited July 18, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161096","commentId":1161096,"userName":"Rapier1","timestamp":1405710858,"content":">  \n> \n> >  \n> > \n> > > Look who's back.\n> > \n> > We all know Rapier is you.  Remember we figured it out?\n> > \n> >  \n> \n>  \n> \n> Are the same guy, sure. But he is not aware of it. ^^ HIs identity changes for moments...\n> \n>  \n> \n> Joke :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n> \n>  \n\n \n\nDidn't you used to have an elf for an avatar? I like that bird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161111","commentId":1161111,"userName":"Mndela","timestamp":1405711473,"content":"No, my last avatar was a character blowing a horn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161141","commentId":1161141,"userName":"booored","timestamp":1405712883,"content":"changing avatars is painful... especially if you have been around as long as you have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161155","commentId":1161155,"userName":"Khamul The Easterling","timestamp":1405713661,"content":">  \n> \n> >  \n> > \n> > > Look who's back.\n> > \n> > We all know Rapier is you.  Remember we figured it out?\n> > \n> >  \n> \n> link please\n> \n>  \n\nPericles had it all figured out - http://community.fantasyflightgames.com/index.php?/topic/106243-rapier-and-trololo-are-the-same-person-mind-blown/ [https://community.fantasyflightgames.com/index.php?/topic/106243-rapier-and-trololo-are-the-same-person-mind-blown/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1161377","commentId":1161377,"userName":"booored","timestamp":1405723285,"content":"wow, that thread is kinda touching in a strange way :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1162260","commentId":1162260,"userName":"joezim007","timestamp":1405802237,"content":"TLDR: The Fall of Gil-Galad can be pretty awesome. For most things, power is relative to the power of the encounter deck. Power cards are being replaced by combinations, which is more interesting, healthy for the game, and prevents encounter decks from having to get even more powerful more quickly.\n \n\n> The biggest shame isn't the lack of power cards, it's the existence of useless cards. It's almost like they weren't playtested.\n>  \n> For instance, the The Fall of Gil-Galad card is absolute rubbish. No good player is putting that in their deck and to add insult to injury they put 3 in the pack and you can only use one in a deck. Ridiculous.\n\n \nThe Fall of Gil-Galad isn't a bad card. At all. People over-think this too much. I just played a 2-player game: Tactics/Leadership and Spirit/Lore. I had a few different songs in the S/L deck so I also added Rivendell Minstrel and The Fall of Gil-Galad. During the game, Rivendell Minstrel was quite helpful in retrieving this particular attachment. I had a Song of Earendil attached to a hero, but I wasn't able to use it because both decks had threat climbing pretty high.\n \nThe T/L deck had an Eagles of the Misty Mountains out and had just gotten Landroval out via Elf-Stone (yay! No paying 5 resources just to for his ability!). I also happen to have Eomer and Prince Imrahil who take quite a fancy to characters leaving play.\n \nThe S/L deck had just reset its threat (via Lore Aragorn) back down 28 (from mid 40's) in the previous refresh phase. Then, during combat, I let Aragorn - who was the bearer of The Fall of Gil-Galad - die to an undefended attack. Also, one of my heroes was holding a Horn of Gondor. So I lowered my threat by 12 more: down to 16, gained a resource via Horn of Gondor, boosted Eomer, readied Prince Imrahil, and gained a victory point, then had Landroval leave play, bring Aragorn back, boosting my Eagles of the Misty Mountains, gaining me another resource, and giving me my Aragorn back in a ready state. Also, I am now able to start using Song of Earendil for every threat gain (plus a Galadhrim's Greeting) to bring the T/L deck back below 40, where it safely stayed for the rest of the game.\n \nI definitely don't see this combination happening every game, but if I can get even just the most important parts (The Fall of Gil-Galad and Landroval) set up once every couple games, this card can be pretty powerful. In this instance, I could have done the exact same thing, except without gaining the victory point or lowering my threat by 12 if The Fall of Gil-Galad wasn't included in the mix, which is still a very powerful combination of effects. But I DID have The Fall of Gil-Galad, which lowered my threat by 12 for a single resource.\n \nSoo... in what way is The Fall of Gil-Galad a bad card? If it weren't for its restrictive trigger, I'd call it a power card.\n \n---\n \nAlso, since we're talking about power cards in this thread, I'll mention that I'm really enjoying the way cards are shaping up. If a single card being added to your deck would ALWAYS make your deck better (as long as you have matching spheres), then that isn't a power card; That's a broken card. If the card's costs/restrictions don't measure up to what you gain from it, then it is overpowered.\n \nBefore I go much further I want to mention that it's interesting to note that when it comes to stats - particularly attack and defense - the power of the encounter cards you are playing against is the most important factor in what is considered to be \"powerful\" or \"weak\". With the way the card pool has grown, enemies have gotten stronger, so having 2 defense is practically pointless now whereas it was actually doable to use a guy with 2 defense in the early days for a good chunk of defending. The old \"power cards\" are still very powerful because their power isn't relative to the power of the encounter deck. There are some power cards that are graded relative to the power of the deck, but they actually get stronger when the encounter deck gets strong (specifically cancellation and prevention [A Test of Will, A Burning Brand, Hasty Stroke, Feint, Forest Snare]).\n \nToday, though, we can't just release a hero with 5 base attack and only 8 starting threat (even though it is feasible with the right stat distribution) because then we'd end up with a hero similar to Glorfindel. The low threat combined with at least one great stat makes him too good to leave out of decks, which railroads deckbuilding (though people who can play more often have more flexibility and time to experiment with alternatives, but people who can only play once in a while pretty much are required to take the best cards because they won't have time to \"waste\" on a botched experiment). Eomer and Beorn have 5 attack, so what's the big deal? Well, Beorn can't have attachments, so he's stuck at 5. Eomer needs a trigger in order to get up to 5. Also, they both have starting threat values that are good indicators of their power. Going back to the point of Beorn not being able to have attachments: this is how \"power cards\" are handled now. The pool is large enough that you have several options to turn a \"good\" card into a \"power\" card.\n\n \n\nFor example: going back to the Tactics/Leadership deck from above. I had Eomer in the deck. He is a great card, but even 5 attack (conditional) can't kill every enemy. Well, we have countless ways to build up his attack to ridiculous numbers. In the game I was playing in the example above, Eomer had Rohan Warhorse, Firefoot, Support of the Eagles, Dunedain Cache, Steward of Gondor, and Gondorian Fire on him.\n\n \n\nSo I got his attack to:\n\n3 base\n\n+2 with an ally leaving play\n\n+3 (or more!) from Support of the Eagles\n\n+2 from Firefoot\n\n-----------\n\n10+ attack, where overflow damage (which there usually is) goes onto another enemy, and a readying so that I could do it again. Also, Dundain Cache allowed me to do it against enemies engaged with the other deck. If we each had 1 enemy, I could attack the enemy engaged with the other deck and the excess could damage the enemy engaged with me. I didn't even use Steward of Gondor + Gondorian Fire because I already had overkill.\n\n \n\nMy point is that we don't need standalone power cards anymore. We have the means to build cards that are more powerful than we could ever imagine receiving in packs. Heck, I could have gone further by including Dunedain Marks.\n\n \n\nSo stop worrying about the fact that we don't have any cards that just straight up say \"Remove an encounter card in the staging area from play\" (just an example... thankfully no one has asked for that specifically yet). We don't need those cards. We need to keep getting cards similar to what we've been getting: cards that work well together to create amazingly powerful combinations. It's a lot more fun and satisfying and it rewards good deck building.\n\nEdited July 19, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/110991-does-anybody-else-miss-power-cards/?do=findComment&comment=1162305","commentId":1162305,"userName":"Catastrophic09","timestamp":1405807261,"content":"Well put ^^ \"power cards\" being a card that can fit in almost any deck and is usable in any situation seems nice so Unexpected Courage for example is super easy to use and very versatile making it quite powerful. These kind of cards I would also argue are unhealthy and bad for the game. I really like cards that are somewhat restricted with use or who they can attach to because they are still very useful and powerful in the right setting but you have to build a proper deck around them and their natural limitations are healthy for the game.  \n\n \n\nI still think we will get very powerful cards in the future like Galadriel and Treebeard, these also have their limitations but are obviously super powerful and I'm stoked to get them! And as the cardpool grows (which is really slow and will take much time) I think we will will start forgetting or replacing our staple cards with new cards that are powerful in their own type of decks."}]}