{"url":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/","title":"Why engage first?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160343","commentId":1160343,"userName":"jimjim19681968","timestamp":1405668567,"content":"Sorry, but I don't see any reason to engage first. Can someone enlighten me please.\n\n \n\nTa,\n\n \n\nJim"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160352","commentId":1160352,"userName":"Noccus","timestamp":1405669312,"content":"Do you mean optional engagement?\n\nIf so, there are several good reasons for it.\n\nBut the most obvious one keeping control of the threat in staging area.\n\nWhen a foe has a higher engagement cost then your threat, it will not attack you.\n\nYet you may want, or just can, get rid of it.\n\nSo you can engage it yourself rather then having to wait for it to finally come to you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160355","commentId":1160355,"userName":"jimjim19681968","timestamp":1405669657,"content":"Ok. Thanks for that. Normally I wouldn't want to optionally engage a high ranking foe because they are normally very powerful (eg Hummerhorns with 5 damage to hero upon engagement), however if there is a means to destroy him another way, then I can see the logic.\n\n \n\nMany thanks.\n\n \n\nJJ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160364","commentId":1160364,"userName":"Noccus","timestamp":1405670564,"content":"Well Hummerhorns are indeed quite nasty. Specially with just the core set.\n\nOptional engagement is not for them, but many other buggers, yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160374","commentId":1160374,"userName":"richsabre","timestamp":1405671475,"content":"there are also cards in later packs that give you stat boosts in you are attacking or engaging enemies with an engagement cost higher than your threat, specifically hobbits :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160386","commentId":1160386,"userName":"alogos","timestamp":1405672518,"content":"And often, the high engagement cost high threat enemies are just weak harasser. Like Goblin Sniper wich you would want to engage optionnaly. Also Archery enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160500","commentId":1160500,"userName":"PsychoRocka","timestamp":1405684329,"content":"> Sorry, but I don't see any reason to engage first. Can someone enlighten me please.\n> \n>  \n> \n> Ta,\n> \n>  \n> \n> Jim\n\nI optionally engage almost all rounds. I play two handed so because 1 of my decks is made for combat I generally take on most enemies with that deck and weaker ones with the other to clear threat in staging to quest better. Also Legolas killing stuff givings me further progress tokens.\n\nOptional engagement is a massive part of the game for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1160768","commentId":1160768,"userName":"GrandSpleen","timestamp":1405698816,"content":"Agree with PsychoRocka, in multiplayer you have to optionally engage if you want to control where the enemies end up.  But in any game, it's done so you can manage the threat in the staging area.  I remember in the early days, with a more limited card pool, I too was trying to keep enemies far away from me, for as long as possible.  There are more powerful cards now, like Beregond, who make it a lot less threatening to engage enemies right out of the gate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111144-why-engage-first/?do=findComment&comment=1161481","commentId":1161481,"userName":"Rapier1","timestamp":1405728285,"content":"Later enemies were also added which are designed to be a problem unless you can optionally engage them. Enemies like the goblin sniper (threat 48) which isn't really a problem to fight because it's weak, but does damage every round it's in the staging area - and you can only engage it optionally if it's alone in the staging area too."}]}