{"url":"https://community.fantasyflightgames.com/topic/111516-works-with-any-theme-cards/","title":"Works with any theme cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/111516-works-with-any-theme-cards/?do=findComment&comment=1166755","commentId":1166755,"userName":"richsabre","timestamp":1406119976,"content":"thanks to boored for this idea, i havent yet wrote out an entire list, but i wanted to do a thread on what cards you think are 'can have in any deck' cards in terms of theme and generation barriers\n\n \n\nwhat i mean is, if one is staying close to the lore of middle earth, or to the novel, then you would not have for example frodo and denethor together, as their paths never crossed... or it is unlikely to have galadrims greeting in a spirit deck that was not likely to have come across lothlorien\n\n \n\nbut some cards can be in almost any deck\n\n \n\nim thinking more of decks themselves, not the quest - so i dont mean, strider and frodo cant be played against the hobbit quests, more just in general\n\n \n\nso here are the cards i think can fit in (almost :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) any theme deck\n\n \n\nHero/allies\n\n \n\n-Berevor/Idraen/strider.. rangers so wanders the wilds, would be found protecting the shire (hobbits) will know the elves of rivendell (noldor) i guess could have been helping the white council (silvan/istari), may know radagast (creatures) and dwarves often wandered the roads to and from the blue mountains and erebor so this means... (dwarves).\n\n \n\n- All ranger allies + attatchments (dunedain warning etc)... same reason as above\n\n \n\n- Elladan/Elrohir ... pretty much the same reasons as above, given they often fought alongside the rangers.\n\n \n\n- Gandalf/Radagast (perhaps not Saruman, he was too settled in the later years and had little interest in certain parts of middle earth...though i guess he had a decent interest in the shire at the end :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) ...gandalf - the protector of middle earth...where wasnt he? ...and radagast, though known to have little interest in men, was still an ally of the dunedain and white council\n\n \n\n- Isengard messenger... perhaps a greater stretch on imagination, but given Saruman's position on the White Council i could easily see this ally taking messages to all the free people's of middle earth, he could even be one of the messengers to deal with pipe weed in the southfarthing making him playable with hobbits\n\n \n\n-silvan refugee... im thinking is a stretch, but perhaps is travelling west to the grey havens, and this means even dwarves and hobbits could interact on such a journey\n\n \n\nAttatchments/ Events\n\n \n\nbelow are the cards which i think are raceless and themeless.. in that they will fit into any deck\n\n \n\n-burning brand\n\n-forest snare\n\n-healing herbs\n\n-keeping count\n\n-path of need\n\n-resourceful\n\n-self preservation\n\n-song cards apart from song of kings (not very thematic on a hobbit deck i think)\n\n-spare hood and cloak\n\n-unexpected courage (though really pushing it i think in a deck full of heroes such as glorfindel, strider etc\n\n \n\n-test of will\n\n-hasty stroke\n\n-watchful peace\n\n-campfire tales\n\n-close call\n\n-common cause\n\n-ever onward\n\n-feint\n\n-fortune or fate\n\n-gandalfs search (paired with gandalf)\n\n-infighting\n\n-quick strike\n\n-radagasts cunning\n\n-rain of arrows\n\n-secret paths\n\n-shadow of the past\n\n-sneak attack\n\n-straight shot\n\n-strength of will\n\n-swift strike\n\n-the white council\n\n-timely aid\n\n-unseen strike\n\n-valiant sacrifice\n\n-word of command (assuming istari in deck)\n\n \n\nwhat do you think? any i have missed?\n\nEdited July 23, 2014 by richsabre"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111516-works-with-any-theme-cards/?do=findComment&comment=1168220","commentId":1168220,"userName":"Dain Ironfoot","timestamp":1406210556,"content":"Ian came up with something similar when he created his \"First Age Approved\" list.\n\n \n\nhttp://talesfromthecards.files.wordpress.com/2014/06/first-age-approved-list.pdf [http://talesfromthecards.files.wordpress.com/2014/06/first-age-approved-list.pdf]\n\n \n\nEdited July 24, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111516-works-with-any-theme-cards/?do=findComment&comment=1168269","commentId":1168269,"userName":"shoreless","timestamp":1406212633,"content":"This is another one of those situations where I'd like to rename Steward of Gondor to 'Resourceful'."}]}