{"url":"https://community.fantasyflightgames.com/topic/111671-dunland-trap-and-three-trials-a-bit-long/","title":"Dunland Trap and Three Trials (a bit long)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/111671-dunland-trap-and-three-trials-a-bit-long/?do=findComment&comment=1169338","commentId":1169338,"userName":"chiller087","timestamp":1406278672,"content":"So my friend Casey and I decided to do these quest tonight  I was using a modified version of Beorn's Aggro Boromir deck, and my buddy had a Hobbit deck.  He'd never played the Dunland Trap, so he was going in completely blind.  I already knew his deck wouldn't be able to pull its weight, but I wanted him to see that for himself. \n\n \n\nSure enough, we quested too fast, got killed at the end.  He switched to a more aggressive build using Legolas, Gimli and Glorfindel, and we did much better, and won.\n\n \n\nThen we took those same decks and tried the Three Trials. \n\n \n\nWe'd never done it before, and we were both going in blind.  We breezed through all 3 Stage 2 quests.  It was starting to feel like a real disappointment. \"Man this quest is a lot easier than the Dunland Trap...what a shame...\"\n\n \n\nThen all 3 Guradians came back at the end.  It just so happened that I ended up with all 3 keys, so all the Guardians rushed me.  The location that makes us raise our threat for each Guardian that attacks was also present, and that, combined with the location that boosts the threat of Forest locations in the staging area, meant our dials were spinning up so fast they almost caught fire.\n\n \n\nI hit 50 on the following turn, and all 3 keys went to the staging area, and they were subsequently forced onto my teammate immediately.  Then all 3 Guardians marched right past the staging area and engaged him, and he capped out on the following turn.\n\n \n\n3 progress tokens away from Victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111671-dunland-trap-and-three-trials-a-bit-long/?do=findComment&comment=1169344","commentId":1169344,"userName":"MyNeighbourTrololo","timestamp":1406279240,"content":"Is that was because you rushed? Or that would gonna happen anyways?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111671-dunland-trap-and-three-trials-a-bit-long/?do=findComment&comment=1169715","commentId":1169715,"userName":"chiller087","timestamp":1406300027,"content":"We didn't count on all the irritating locations that become nastier as they work together. Boromir was an easy answer for having to exhaust a hero to travel, but we didn't have an over-abundance of questing power. The Barrows locations require a lot more questing points than usual to clear them, and the locations started piling up. The enemies weren't that bad.\n\nAnd at the end, when all 3 Guardians attack, if you haven't dealt with the Barrows location that raises all players' threat equal to the threat of the Guardian that attacked you (and all 3 are attacking at the end) then your threat is gonna skyrocket, like ours did.\n\nAnd the Encounter deck? One of the smallest I've seen. It's only 2 encounter sets combined, and the base set you use from VoI is only 9 cards iirc. To top it off, you remove 10 cards from it during setup.\n\nEdited July 25, 2014 by chiller087"}]}