{"url":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/","title":"New(ish) to the game, question.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1172737","commentId":1172737,"userName":"MBMTacos","timestamp":1406525477,"content":"Just got the core set a month or so ago and I was wondering if there's a particular (or recommended) order I should get the expansions in, or does it matter at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1172754","commentId":1172754,"userName":"MyNeighbourTrololo","timestamp":1406527153,"content":"Yes, there is. It's called \"buy everything in it's release order\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1172819","commentId":1172819,"userName":"PsychoRocka","timestamp":1406533206,"content":"Pretty much everyone will tell you to buy them in order. This way you move from quest to quest and it is more fun and thematic. As well as this quest difficulty is based a lot on what player cards were released so earlier quests will be less difficult to beat than later ones with a limited card pool.\n\nI actually bought cards in a very random way when I first started and actually bought Heirs of Numenor right after the core set. I did this because I wanted a handful of powerful player cards in Heirs (mainly Beregond) and thought buying HoN first would mean I could put those cards in my decks and do a lot better overall with all quests. What I hadn't realised is how difficult (which really is why I keep playing and why its such a goddamn amazing game) this game is and especially the quests in Heirs of Numenor which are renowned for being very very hard (pretty much impossible with just the core and heirs) and normally I would have had player cards from the core, the whole shadows of mirkwood cycle, khazad dum and the whole dwarrowdelf cycle to use against this quest if I had bought them in order but did not, so in reality only stood a chance against the three core set quests and couldn't play the HoN quests at all. I then bought Shadow and Flame (which I couldn't play at all as I did not have Dwarrowdelf yet) just for Elrond....\n \n\nAfter this point I THEN started from the very start and started collecting in order (minus what I already had) and let me tell you if I had to do it all over again I would get them properly and in order. For a long time I had a very limited amount of quests I could play (and even less I could actually beat!)and was also not playing them in order. Took a little while for me to fix this which was fairly frustrating.\n\nEdited July 28, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1172892","commentId":1172892,"userName":"richsabre","timestamp":1406538642,"content":"yes, as one of the players of this game who has played since release, i can say it is the best order to go in - not a lot to add to what has already been said so ill second it .... theme make more sense, difficulty is levelled properly, card pool strength is in sync with the difficulty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1173552","commentId":1173552,"userName":"chrsjxn","timestamp":1406569600,"content":"I'm going to go against the grain here, and suggest that you actually don't buy things in release order. For the first cycle specifically, it takes pretty much the entire thing before you have any non-core set mechanics flushed out fully. Like the songs that take 4 packs to get.\n\n \n\nMy vote is that you should start with a saga expansion. So I'd get either The Hobbit: Over Hill and Under Hill or I'd get The Black Riders, depending on whether you like dwarves or hobbits more. (Or the story of the Hobbit or the story of LOTR more.)\n\n \n\nThat way you get three new quests in one purchase, and a bunch of player cards that go together well. \n\n \n\nOnce you've got the saga expansions, I'd probably pick things up in order. Unless there are specific player cards you want early, in which case go ahead and get those packs. Outlands are fun, for example, and the Steward's Fear is a great quest, even if you get it out of order. (Though you'd need Heirs of Numenor for that, and those quests are tough.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1173585","commentId":1173585,"userName":"MBMTacos","timestamp":1406571048,"content":"Thanks for the advice. I don't what cards are out there, besides the core set, so I'm going to stick with going in order. xD Thanks again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1173615","commentId":1173615,"userName":"Dain Ironfoot","timestamp":1406572081,"content":"> Thanks for the advice. I don't what cards are out there, besides the core set, so I'm going to stick with going in order. xD Thanks again.\n\nhttp://ffgapp.com/qr/MEC01 [http://ffgapp.com/qr/MEC01]\n\n \n\ngo there to see the cards in each pack (change the number in the webaddress to see later expansions - i can't seem to find the link to the \"home\" page).\n\n \n\nalso, try this buying guide for more info:\n\n \n\nhttp://talesfromthecards.wordpress.com/new-player-guides/ [http://talesfromthecards.wordpress.com/new-player-guides/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1174076","commentId":1174076,"userName":"booored","timestamp":1406586838,"content":"> Just got the core set a month or so ago and I was wondering if there's a particular (or recommended) order I should get the expansions in, or does it matter at all?\n\nThere is no real order to the cycles. They are pretty much interdependent and the LCG format is designed for players to cherry pick the packs they want. The game has gone though a lot of great improvements over the years and there is no need for a new player to sit though the problems of the early days.\n\nI would say the best thing for a new player to do is to get 2xCore and then Khaz-Dum + and a few packs of your choice after playing around in a deck editor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1174741","commentId":1174741,"userName":"DurinIII","timestamp":1406633358,"content":"Welcome to the game! I can't imagine just now getting into this game. There are just so many packs to collect at this point. It can be overwhelming. I would start in order like most here are saying, however, my favorite expansion is Kazad-Dum. I would pick that up then proceed in order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1189370","commentId":1189370,"userName":"Shirys","timestamp":1407526370,"content":"I would say to buy it in release order so you can get used to new concepts gradually. Be warned though, Heirs of Numenor is sick hard, but this is my humble opinion.\n\n \n\nEnjoy, great game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1217390","commentId":1217390,"userName":"la1cajun","timestamp":1408647343,"content":"Wait, I just started in this game not long ago and have only really done the first 2-3 scenarios. Are yall saying that the adventure packs and cycles kinda bring you in a little at a time and follow each other. Cause thats great. For some reason, though I was gonna buy in order anyway, I thought that all the cycles and adventure packs was in their own little world and none of it really carried on from one adventure to the next and that it was just random adventures. This kinda threw me off to be honest. But let me know if Im wrong. Im still a rookie here.\n\nEdited August 21, 2014 by la1cajun"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1217474","commentId":1217474,"userName":"entMoot","timestamp":1408648958,"content":"The first cycle had a loose narrative where you are always trying to catch Gollum and just happen to have other adventures. The Against the Shadow and Ringmaker cycles have much more narrative supplied (roughly a page per quest on the rules insert)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1217731","commentId":1217731,"userName":"Jackelantern","timestamp":1408655091,"content":"I believe this is the correct order but I could very easily have made mistakes.\n\nFor clarification:\nBold/Underline = Core Set / Deluxe Expansions\nBold = Saga Expansions\nUnderline = Print on Demand GenCon / Nightmare\n\nApril 2011 - Core set\nJuily 2011 - The Hunt for Gollum\nAugust 2011 - The Massing at Osgiliath (GenCon 2011)\nAugust 2011 - Conflict at the Carrock\nSeptember - 2011 A Journey To Rhosgobel\nSeptember - 2011 The Hills of Emyn Muil\nNovember - 2011 The Dead Marshes\nNovember - 2011 Return to Mirkwood\n_______________________\n\nJanuary 2012 - Khazad-dum\nMarch 2012 - The Redhorn Gate\nMarch 2012 - Road to Rivendell\nApril 2012 - Watcher in the Water\nMay 2012 - The Long Dark\nJune 2012 - Foundations of Stone\nAugust 2012 - Shadow and Flame\nAugust 2012 – The Battle of Lake-town (GenCon 2012)\nAugust 2012 The Hobbit: Over hill and Under Hill -Saga\n______________________________\n\nNovember 2012 Heirs of Numenor\nJanuary 2013 – Core Set – Nightmare (S1)\nFebruary 2013 - The Hobbit: On the Doorstep - Saga\nMay 2013 - The Steward’s Fear\nMay 2013 - The Druadan Forest\nJuly 2013 - Encounter at Amon Din\nAugust 2013 – Assault on Osgiliath\nAugust 2013 – The Stone of Erech (GenCon 2013)\nAugust 2013 – Shadows of Mirkwood – Nightmare Pt 1 – THfG, CatC, AJtR (S2)\nSeptember 2013 - The Black Riders - Saga\nOctober 2013 - The Blood of Gondor \nNovember 2013 - The Morgul Vale \nDecember 2013 - Shadows of Mirkwood – Nightmare Pt 2 – ThoEM, TDM, RtM (S3)\n__________________________________\n\nFebruary 2014 – The Voice of Isengard\nFebruary 2014 – Over Hill and Under Hill – Nightmare (S1)\nJune 2014 – Khazad-dum – Nightmare\nJune 2014 – Dunland Trap\nJuly 2014 - The Three Trials\nAugust 2014 – The Old Forest (GenCon 2014)\n\n\nAnd I apologize for the highlighting, but I can't figure out how to easily get rid of it and don't want to re-write the entire thing.\n\nEdited August 21, 2014 by Jackelantern"},{"commentUrl":"https://community.fantasyflightgames.com/topic/111876-newish-to-the-game-question/?do=findComment&comment=1219323","commentId":1219323,"userName":"Johnny Awesome","timestamp":1408722766,"content":"My recommendation is to buy the whole 1st cycle and skip the GenCon Print-On-Demand stuff until later. Then buy each cycle one cycle at a time.\n\n \n\nSoon there will be 50 quests + Nightmare for this game. So there are hundreds of hours of enjoyment awaiting you. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited August 22, 2014 by Johnny Awesome"}]}