{"url":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/","title":"Discarding versus Defeating Enemies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/?do=findComment&comment=1175626","commentId":1175626,"userName":"entMoot","timestamp":1406687373,"content":"In Passage Through Mirkwood Stage 3B \"Don't Leave The Path!\", say I attack Ungoliant's Spawn with a character who has Rivendell Blade attached. Now the Spawn's defense is reduced to 0 until end of the phase, so I can use Straight Shot to discard it. If I do this, does it count as defeating Ungoliant's Spawn (so I win at this point)?\n\n \n\nIt seems implied in the rulebook that enemies are only defeated if they receive damage equal to or greater than their hit points, so my own interpretation is that I won't win the scenario by making this play. Does this seem accurate?\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/?do=findComment&comment=1175810","commentId":1175810,"userName":"TwiceBorn","timestamp":1406702116,"content":"Interesting question. I have seen no definition or distinction between the words \"discard\" and \"defeat,\" whether in the rules or in the FAQ.\n\n \n\nThat having been said, I think your Rivendell Blade/Straight Shot combo should enable you to simultaneously discard Ungoliant's Spawn and to meet the victory conditions for \"Don't Leave the Path!\"\n\n \n\nIf you look at the other 3B in Passage Through Mirkwood, \"A Chosen Path,\" it states that \"Players cannot defeat this stage while Ungoliant's Spawn is in play. If players defeat this stage, they have won the game.\"  If you cannot defeat the stage while Ungoliant's Spawn is in play in \"A Chosen Path,\" then by the same logic you should be able to defeat Ungoliant's Spawn and 3B \"Don't Leave the Path!\" if the Spawn leaves play as a result of your Rivendell Blade/Straight Shot combo.\n\n \n\nBut this is just my interpretation...\n\nEdited July 30, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/?do=findComment&comment=1175887","commentId":1175887,"userName":"alogos","timestamp":1406709062,"content":"From Rule book : about guard keyword\n\n>  \n> \n> Enemy: The enemy leaves play, either by being defeated or leaving play\n\n \n\nand about victory\n\n \n\n>  \n> \n> ...when they are defeated,,,\n\n \n\nWe know that cards that leaves play without being defeated (explored or destroyed) don't go to the victory display, so there is a distinction.\n\nWhen a card is defeated it is immediatly discarded, but discarding does not mean defeated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/?do=findComment&comment=1176025","commentId":1176025,"userName":"TwiceBorn","timestamp":1406720054,"content":"Hmmm… looks like alogos and entMoot may be right, and I may have skimmed the rules/FAQ too quickly. The last paragraph under Hit Points and Damage, on p. 20 of the rule book, indicates that: \"Any enemy cards that are not defeated remain engaged with a player until they are defeated or removed by a card effect…\"\n\n \n\nSo yes, I guess that discarding with Straight Shot is a card effect that would discard/remove Ungoliant's Spawn from play without defeating her (reducing her hit points to 0).  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/112033-discarding-versus-defeating-enemies/?do=findComment&comment=1176206","commentId":1176206,"userName":"entMoot","timestamp":1406729682,"content":"Thanks guys. At least the combo can still be back-up in case Ungoliant's Spawn shows up for the other 3A/B, Beorn's Path."}]}