{"url":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/","title":"GONDOR DECK","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1189030","commentId":1189030,"userName":"nicola87","timestamp":1407511461,"content":"hi guys!\n\n \n\ni wish to make a GONDOR deck with the trait leadership (and command.\n\n \n\nSo a purple and red deck...\n\n \n\nI generally play 3 hero with my friends so i need these....I have tried with BEREGOND, BOROMIR (version +1 attack if he has atleast 1 res) and IMRAHIL but perhaps there is a better combination...\n\n \n\nso first question:\n\n \n\n1)which 3 heroes are the best best for a GONDOR red/purple deck?\n\n \n\nsecond question:\n\n \n\n2) which cards fill at best with these 3 heroes?\n\n \n\nthanks for answers\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1189044","commentId":1189044,"userName":"Narsil0420","timestamp":1407512093,"content":"Maybe put this in the deck building section?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1189095","commentId":1189095,"userName":"WWPDSteven","timestamp":1407513806,"content":"Well if you want all 3 heroes to be Gondor, you have little choice.\n\n \n\nBoromir (either sphere)\n\nPrince Imrahil\n\nBeregond\n\n \n\n...As you already said.\n\n \n\nThat's a mighty starting threat of 32 though. If you're willing to use a non-Gondor hero, I'd consider replacing Imrahil with Theodred. Hey- he's a young heir to the throne of Rohan out cutting his chops by aiding their allies to the East before Theodred succombs to the poisoned words of Grima!\n\n \n\nOtherwise... not sure what you might be asking about the heroes!\n\n \n\nAs for cards... The Gondor trait is fairly well developed.\n\n \n\nALLIES\n\nDefender of Ramas is great\n\nErrand Rider is good to keep your resources spread out\n\nFaramir and Denethor (pending the resources to pay for them... Steward!)\n\nGondorion spearmen (a bit redundant with Beregond and the spear now)\n\nGuard and Squire of the Citadel are relatively affordable dudes\n\n \n\nATTACHMENTs\n\nthe Steward\n\nVisionary Leadership\n\nGondorion shield\n\nSpear of the Citadel\n\n \n\nEVENTS\n\nBehind Strong Walls\n\nGondorion Discipline\n\nFor Gondor!\n\n \n\nThere's a few others, but those are the ones I used\n\nEdited August 8, 2014 by WWPDSteven"},{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1189331","commentId":1189331,"userName":"joezim007","timestamp":1407524671,"content":"Tactics Boromir is more powerful than Leadership Boromir, but you lose some of the synergy of giving allies +1 attack. Also, a pure Gondor Tactics/Leadership deck will be high threat, so having an ability that raises your threat more isn't exactly prudent, but if you have other players who are willing to help keep your threat low, go for it.\n\n \n\nOtherwise, you can technically use any Tactics/Leadership hero and give them Steward of Gondor to make them Gondorian. And the Visionary leadership would go on him since he's getting more of the resources. If you're looking to lower your threat Gloin and Theodred are great options because they can give themselves resources, which helps guarantee we have some for Visionary Leadership. Sam Gamgee is another good Leadership hero and is a great quester.\n\n \n\nAs for Tactics options: Legolas and Thalin are both great options because they can help all the players (ranged and/or weakening enemies)\n\n \n\nIf you're planning on using a lot of Gondorian allies, I'd personally stick with Leadership Boromir anyway just to get more attack on your allies.\n\n \n\nAs for other cards. WWPDSteven has a pretty decent list. Sadly, some of the best Gondor characters (in my opinion) are the rangers in Lore, but if you are playing multiplayer, you friends with Lore decks can throw some of those guys in their decks to give them a boost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1189352","commentId":1189352,"userName":"nicola87","timestamp":1407525709,"content":"thanks for replies...\n\n \n\ni am new of this game..and i i find very slow a deck with only 2 resources..how many cards can you play with these? it seems to me that i have litte choice....so i go for the 3.....\n\n \n\nanyway i must tell you that i play in co-op wirh and elf deck with many cards that keep low my threat..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/112767-gondor-deck/?do=findComment&comment=1190004","commentId":1190004,"userName":"Ranger of the Force","timestamp":1407541347,"content":"This is a Gondor Deck that I have used.  It is not a powerhouse solo (did hold its own), but could do well cooperatively.\n\n \n\nDeck Created with CardGameDB.com The Lord of the Rings Deckbuilder\n \n \nTotal Cards: (50)\n \nHero: (3)\n1x Boromir (Heirs of Numenor)\n1x Prince Imrahil (A Journey to Rhosgobel)\n1x Eleanor (Core Set)\n \nAlly: (25)\n3x Envoy of Pelargir (Heirs of Numenor)\n3x Errand-rider (Heirs of Numenor)\n2x Faramir (Core Set)\n3x Guard of the Citadel (Core Set)\n3x Squire of the Citadel (The Blood of Gondor)\n3x Pelargir Ship Captain (The Morgul Vale)\n3x Gandalf (Core Set)\n3x Minas Tirith Lampwright (Encounter at Amon Dîn)\n2x Damrod (Heirs of Numenor)\n \nAttachment: (10)\n2x Blood of Numenor (Heirs of Numenor)\n2x Steward of Gondor (Core Set)\n1x Unexpected Courage (Core Set)\n3x Visionary Leadership (The Morgul Vale)\n2x Steed of the Mark (The Morgul Vale)\n \nEvent: (15)\n2x Gaining Strength (The Steward's Fear)\n2x Hasty Stroke (Core Set)\n2x Sneak Attack (Core Set)\n2x Stand and Fight (Core Set)\n2x Valiant Sacrifice (Core Set)\n3x Wealth of Gondor (Heirs of Numenor)\n2x The Galadhrim's Greeting (Core Set)"}]}