{"url":"https://community.fantasyflightgames.com/topic/113289-discard/","title":"Discard","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/113289-discard/?do=findComment&comment=1198542","commentId":1198542,"userName":"Aladdynsane","timestamp":1407987966,"content":"This is going to be an INCREDIBLY silly question, but I just can't find the answer by Googling or in the rulebook, though I know I've seen this before.\n\n \n\nWhen a card says I should \"discard,\" is that from my hand, from play, or both? I'm playing the 2nd scenario of the Dunland Trap and it tells me to discard X, Y, and Z, but I'm not sure if that's hand, play, or both.\n\n \n\nI know some cards specify, but I assume if it isn't specific I do both?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113289-discard/?do=findComment&comment=1198544","commentId":1198544,"userName":"Aladdynsane","timestamp":1407988092,"content":"Meant to post this in \"rules questions.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/113289-discard/?do=findComment&comment=1198557","commentId":1198557,"userName":"GrandSpleen","timestamp":1407989519,"content":"Discard by itself just means put a card into the discard pile, and doesn't have any specific information about where you should discard from.  Like you say, you can discard from your hand, or from play, and usually the card will specify.  \n\n \n\nThe second quest card on Dunland Trap tells you to discard an ally you control, so it has to be in play. You don't \"control\" a card unless it is in play.  There's a very confusing passage in the rulebook about this, actually seeming to contradict this (it states that you \"control\" all of the cards that you \"own\"), but it's been clearly established that you don't \"control\" a card unless it is in play.  Many Dwarf abilities, for example (like Ori and Thorin), depend on you controlling a certain number of dwarves-- you won't count the cards in your hand for these, only those in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113289-discard/?do=findComment&comment=1198559","commentId":1198559,"userName":"Aladdynsane","timestamp":1407989711,"content":"I appreciate the response! Makes perfect sense now, and not just in the context of this quest."}]}