{"url":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/","title":"Another Open Letter to FFG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198829","commentId":1198829,"userName":"tonylovessunny","timestamp":1408010180,"content":"Dear Lovely People at Fantasy Flight Games:\n\n \n\nThank you ever so much for working so hard to create the Lord of the Rings LCG. It is a very difficult game, but it is also very fun. I really love that it is a cooperative game and that it is not necessarily a collectible card game, so that I can focus on playing with people, knowing that if we bought the same packs, we have the same cards.\n\n \n\nHowever, as many of your loyal customers and fans have already noted, we would strongly like to have a print-on-demand set that is just to increase the player cards in the core set, so that we can have three of each card, without having to spend $35 twice more for two more core sets that will give us too much other cards we don't want, have to borrow from friends, make proxies, or buy singles from websites that are tearing down core sets and selling off the pieces for a higher profit. \n\n \n\nI really love your formula and I am constantly excited for the next pack to come out. I hope that you can respond to this or in another direct way whether or not you can do this. Perhaps there is a reason why you cannot, and if you could let us fans know why, we might complain less, however, if you think it will be less profitable for you, I beg to differ. I would happily spend $20 for the additional cards, 64 total I believe, as would many fans of this game. \n\n \n\nKeep up the good work and thanks for everything so far. I hope that you can continue to make cards and I can continue buying your products.\n\n \n\nSincerely,\n\nTony (tonylovessunny)\n\nEdited August 14, 2014 by tonylovessunny"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198840","commentId":1198840,"userName":"Glaurung","timestamp":1408011440,"content":"That sounds funny for me. All this kind of petition can be only done by some really naive people.....\n\n \n\nLet me explain:  \n\n \n\n1 FFG need sell more core sent that why it was done.....Couse in the end of the day is business and sells is most important think here.  So if you really like a game you will buy 2 or even 3 core set and then you will convince a friends to play as well.\n\n \n\n2  You buy 1 core set and then you will bring your friends and convince him to play this game to get second core set and then you and your friend have all cards to build up a good decks. That was the idea and i believe is a good idea...... \n\n \n\nSo what a point to Make some POD to decrease sells number of core sets?  All this kind of petitions is just screams of souls nothing more...........\n\nYes yes i know I'm bad boy and bla bla bla bla bla....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198850","commentId":1198850,"userName":"klaymen_sk","timestamp":1408012144,"content":"This dead horse has been beaten to hell and beyond, there is nothing left to beat anymore. Even someone from FFG (maybe it was Mr. Petersen himself?) said that this won't happen.\n\nEdited August 14, 2014 by klaymen_sk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198922","commentId":1198922,"userName":"Mndela","timestamp":1408017669,"content":"I think the number of player cards was because at the first, the most powerful cards (Stewards, Unexpected...) were fewer in number, and the most normal were the normal 3 copies. The first reason was so. If not, if there were 3 copies of each card, what would you think about Common Cause in comparison of Stewards?\n\nAfter, with the expansions with 3 copies of each card, the first reason took less sense. But so far, still is overpowered to include 3 copies of Stewards or 3 copies of FateDestiny in a player deck.\n\n \n\nMaybe, if Stewards, Celebrian, Tracker, etc., were released now, their text would include: no more than X copies can be in a deck (like NeedPath or GilGalad or BlackArrow)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198938","commentId":1198938,"userName":"Distractionbeast","timestamp":1408018548,"content":"> So what a point to Make some POD to decrease sells number of core sets?  All this kind of petitions is just screams of souls nothing more...........\n> \n> Yes yes i know I'm bad boy and bla bla bla bla bla.....\n\n \n\nIf they did this, they might actually get my money.  With the financial pressure of life and family, they will never convince me to buy a 2nd full core set.  Sorry.  So for people like me, they're just limiting their sales.\n\n \n\nAs ill-fated as this request may be, I support the intention."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198947","commentId":1198947,"userName":"Rapier1","timestamp":1408019161,"content":"I agree they should sell this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198949","commentId":1198949,"userName":"alogos","timestamp":1408019356,"content":"The fact that every expansion has 3 cards of each, even in other LCG, and the fact that there is cards that are limited to 1 per deck and still in 3 copies are proof that it is not a question of card power or use.\n\nIf steward was so good you only needed 2, there should have a limit: 2 per deck on this card.\n\nThe fact is that a box with 3 copies of each cards would add 72 players cards from the initial 136, that mean rising the price of the starter box, wich would be at bit too much for a game.\n\nThey couldn't make all cards in 3 copies each because there wouldn't be enough different cards to be apealing.\n\nWhat they could do, however, is make a deluxe set for 3-4 players.\n\nThis box could contain 2 other threat counters and the missing cards to have 3 copies of each. They could even add a scenario specifically design for 3-4 players.\n\nI'll also add the rulesheet for \"race against the shadow\".\n\nA lot of people are having a hard time deciding to buy a second core set, and the price and the useless cards are keeping them from buying it, so FFG is losing potential money here.\n\nThis 3-4 deluxe set would be more affordable, and contains just what they need, so they'll buy it for sure, even if they are just playing it solo. And all those who are playing in group of 3-4 would definitly buy it. They can also make solo player who didn't want a second core set want to buy it if they add specific goodies like additional token with number 3-5-10 overprinted on them, new card design like the aragorn from upcoming gencon, etc.\n\nThey will only lose the cost of printing a different box, and losing the gain of people who would buy 2 core set (or even 3) but I think it would balance out pretty well.\n\nThey could make money on this, people would be happy, everybody wins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1198990","commentId":1198990,"userName":"Teamjimby","timestamp":1408021796,"content":"Logistically, the POD cards are slightly different than regular cards because they are made in a different factory.  This is why they only use it for encounter decks where they don't have to mix with other encounter sets.  So, if they did POD to \"finish\" the missing cards from the core set, you might be able to tell them apart from regular cards when mixed in your deck.\n\n \n\nOf course, they could do non-POD and manufacture the packs in China.  But this discussion has been beaten to death many times for every LCG they make, and it's abundantly clear that they are not going to make a pack like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199016","commentId":1199016,"userName":"Johnny Awesome","timestamp":1408022948,"content":"It's $54 at Cool Stuff. Just buy it and stop complaining everyone. It's ridiculous.\n\n \n\nIf you're smart enough to understand how to play this game and you can't afford the $54, go back to school and get a decent job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199029","commentId":1199029,"userName":"7theye","timestamp":1408023612,"content":"You do understand that FFG is a company whose sole goal in life is to make money right?\n\nIf they can sell more core sets and people are buying them, why wouldn't they maximize revenue?\n\nWhy doesn't apple include expandable memory in their products? Same logic\n\nPeople who play LCG/CCG type games know it's expensive. Think about how much a nightmare pack costs.\n\nIf you are heavily invested in this game you will buy another core set or two, which is what FFG wants you to do because they make more money that way.\n\nYou are delusional if you think they have a heart and care about poor gamers lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199262","commentId":1199262,"userName":"Mich the One","timestamp":1408029419,"content":"It seems this topic comes up every now and again, and on each forum for each of the LCGs. As kleymen mentioned, it has been confirmed by FFG that such \"core upgrade packs\" will never happen. Let us not be grumpy about Tony's post though, at least we have something to talk about. It seems rather quiet in these forums anyways.\n\n \n\nWhile I am not an enthusiast of throwing away money, I must say the system worked in my case and I eventually did buy the additional core sets. The question is - would we buy four core sets if there was a limit of 4 cards per deck? How about five?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199333","commentId":1199333,"userName":"MyNeighbourTrololo","timestamp":1408030906,"content":"Well, at least they re-released Sekrets of Arkham for Call of Cthulhu LCG, featuring 3 copies of each card instead of 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199489","commentId":1199489,"userName":"blinky","timestamp":1408034240,"content":"> Logistically, the POD cards are slightly different than regular cards because they are made in a different factory.  This is why they only use it for encounter decks where they don't have to mix with other encounter sets.  So, if they did POD to \"finish\" the missing cards from the core set, you might be able to tell them apart from regular cards when mixed in your deck.\n\n \n\nNightmare stuff is PoD and is mixed with normal encounter cards. They just recommend you use opaque sleeves so you can't tell the difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199590","commentId":1199590,"userName":"13thcaesar","timestamp":1408036979,"content":"In Poland, the cycle of Ring-maker will probably released in PoD (the fact that the quality will be worse, but it's better than nothing. Besides, I put all the cards in FFG Standard Card Game Sleeves). \n\n \n\nHowever, I agree that FFG will not do it with cards from the Core Set.\n\nEdited August 14, 2014 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1199627","commentId":1199627,"userName":"Chris51261","timestamp":1408038226,"content":"While I agree they aren't going to do this with the core set cards that do not have 3 copies, why won't they do it with cards that have errata? Make it PoD and no sales suffer (the packs the cards are from would still sell for the quest and other player cards) and now they're selling cards with a few rewritten words for $15."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200115","commentId":1200115,"userName":"Bullroarer Took","timestamp":1408048486,"content":"Sleeves and proxies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200174","commentId":1200174,"userName":"Distractionbeast","timestamp":1408049507,"content":"> It's $54 at Cool Stuff. Just buy it and stop complaining everyone. It's ridiculous.\n> \n>  \n> \n> If you're smart enough to understand how to play this game and you can't afford the $54, go back to school and get a decent job.\n\n \n\nOr don't have special needs kids, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200229","commentId":1200229,"userName":"Noccus","timestamp":1408050809,"content":"> > It's $54 at Cool Stuff. Just buy it and stop complaining everyone. It's ridiculous.\n> > \n> >  \n> > \n> > If you're smart enough to understand how to play this game and you can't afford the $54, go back to school and get a decent job.\n> \n>  \n> \n> Or don't have special needs kids, right?\n\nI hear you bro. If Johnny Awsome here was Awsome he'd offer to buy and send you a extra core set with his Awsome job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200255","commentId":1200255,"userName":"MyNeighbourTrololo","timestamp":1408051385,"content":"He's an obvious actual troll, that's all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200834","commentId":1200834,"userName":"Rapier1","timestamp":1408080624,"content":"I have argued in favour of the 3-4 player core set expansion. That's the route I would think FFG is most likely to consider. I don't think it will happen though.\n\nI also feel like cards that didn't come in 3's are less likely to get errata because people who have bought multiple cores just for the powerful cards that don't come in 3's would cry a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1200970","commentId":1200970,"userName":"tonylovessunny","timestamp":1408090508,"content":"Wow, some of you guys really went insane with my posting. I didn't expect so many negative and insulting comments. Not everyone has the money to spend on three core sets, nor does everyone want all the extra cards for so few.\n\n \n\nSelling extra core sets is probably not as beneficial as you'd think. If it impacts the minds of those who don't have the money to buy three sets to get the cards they would like, they might not be interested in buying further sets. Customer satisfaction goes a long way in long-term profits. It is actually pretty simple. Anyone who has taken a few undergraduate marketing or economics classes would know this. \n\n \n\nIf I am spending a lot of extra money on core sets, and I have a budget, I am less likely to purchase the packs and deluxe expansions. That means that FFG is focusing more on the original product, and that will skew some of their data. If customers are buying a lot of the core sets, but not bothering with the whole purpose of the LCG, it disrupts their models. It also means that certain sets will be under printed as the demand will not be for when they are released, but sometime after when those people can afford it.\n\n \n\nThe purpose for FFG not doing this has to either be that they don't think it will be profitable or that they worry about the print-on-demand card quality. In which case, they should just print it with the other shop, as the set will be more than just 60 cards, enough to justify the cost and quality improvement.\n\n \n\nWhen I message other players in other forums, most tend to proxy the cards, with either other cards and a slip of paper in a sleeve or by scanning and copying the card. In either case, FFG is losing money, and it is making the game less attractive for those who are interested, like myself.\n\n \n\nFFG: Unless there is a clear model on why this cannot be done, it probably is in your best interest to print the cards to even out the playing field and to clear up the proxy issues. People will pay for them. Thank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1201025","commentId":1201025,"userName":"Glaurung","timestamp":1408094554,"content":"I don't really wonna insult you or put you down just it was already so many this kind of request and this is really pointless....... So just tired about it and go straight to the points.\n\n \n\nAnd if you really like the game you will not stop to play because of that...... \n\n \n\nCheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1201106","commentId":1201106,"userName":"Rapier1","timestamp":1408101145,"content":"> I don't really wonna insult you or put you down just it was already so many this kind of request and this is really pointless....... So just tired about it and go straight to the points.\n> \n>  \n> \n> And if you really like the game you will not stop to play because of that...... \n> \n>  \n> \n> Cheers!\n\n \n\nI don't think it is pointless. It's something we've gone over several times in the past but FFG may be waiting for \"sufficient interest\".\n\nI don't think there's much to say on the matter though - we can periodically ask, and then just wait and see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1201273","commentId":1201273,"userName":"MyNeighbourTrololo","timestamp":1408106917,"content":"We can periodically ask, and then just get ignored/rejected :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1201453","commentId":1201453,"userName":"Distractionbeast","timestamp":1408111713,"content":">  \n> \n> >  \n> > \n> > > It's $54 at Cool Stuff. Just buy it and stop complaining everyone. It's ridiculous.\n> > > \n> > >  \n> > > \n> > > If you're smart enough to understand how to play this game and you can't afford the $54, go back to school and get a decent job.\n> > \n> >  \n> > \n> > Or don't have special needs kids, right?\n> \n> I hear you bro. If Johnny Awsome here was Awsome he'd offer to buy and send you a extra core set with his Awsome job.\n> \n>  \n\n \n\nNo, I'm not bitter.  But I know it's hard to imagine the circumstances of people you know only through a few typed words on a webpage.  We all need to remember this from time to time - me included.  It's all good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1201457","commentId":1201457,"userName":"Glaurung","timestamp":1408111790,"content":"> > I don't really wonna insult you or put you down just it was already so many this kind of request and this is really pointless....... So just tired about it and go straight to the points.\n> > \n> >  \n> > \n> > And if you really like the game you will not stop to play because of that...... \n> > \n> >  \n> > \n> > Cheers!\n> \n>  \n> \n> I don't think it is pointless. It's something we've gone over several times in the past but FFG may be waiting for \"sufficient interest\".\n> \n> I don't think there's much to say on the matter though - we can periodically ask, and then just wait and see.\n\nYes sure if will be many request and sells go down maybe but… I dont think it will happen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1205996","commentId":1205996,"userName":"klaymen_sk","timestamp":1408222035,"content":"I think I'll buy the third core set, just to spite the OP. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1206299","commentId":1206299,"userName":"FetaCheese","timestamp":1408230111,"content":"Don't worry OP, FFG looks after all its customers:\n\n \n\n1. Grab \"The End Comes\"\n\n2. Call it \"Unexpected Courage\"\n\n \n\nProblem solved. \n\n \n\nAnd if you miss the utility of \"The End Comes\", then after you complete your expansion collection you can grab a used set for like 20$.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1206308","commentId":1206308,"userName":"Mndela","timestamp":1408230477,"content":"Oh yeah! It is the best idea.\n\nEven when another player plays a repeated name of a card. For example, Dwalin hero and Gloin ally. I say, 'ok then, so my ally Gloin will be - i dunno, for example ... - ...Longbeard Dwarf.\n\nOr when i play Redhorn Gate with Arwen inside a deck. 'Ops, i forgot! So my ally Arwen will be Bofur spirit', for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1206954","commentId":1206954,"userName":"MyNeighbourTrololo","timestamp":1408263095,"content":"Use sleeves and insert paper prints of the cards you need onto the existing unused ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1207064","commentId":1207064,"userName":"FetaCheese","timestamp":1408271369,"content":"> Use sleeves and insert paper prints of the cards you need onto the existing unused ones.\n\n \n\nRight. There are no duds, only proxies. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1210615","commentId":1210615,"userName":"Dain Ironfoot","timestamp":1408401908,"content":"I can understand this sentiment, surely, even if i did buy 3 core sets.\n\n \n\nbut, buying 3 core sets is still cheaper than purchasing just 1 booster box of Magic (or any other CCG out there) and you'll end up with more useless cards (all those junk commons and rares) than you do with 3 core sets.\n\n \n\nat the end of the day, it's up to you. you can find core sets online for ~$25 - which, i don't think, is too much to ask - especially given the money sink of every other CCG out there (that doesn't follow the LCG model, of course)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1210662","commentId":1210662,"userName":"Cunir","timestamp":1408403064,"content":"I think I'd rather they release the errated cards as a POD first, because its not possible to buy those ones at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1210724","commentId":1210724,"userName":"FetaCheese","timestamp":1408404712,"content":"Bying a second starter set for like 20 euros is indeed a good deal, once you have bought a few packs.\n\nEdited August 18, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1238289","commentId":1238289,"userName":"tonylovessunny","timestamp":1409363047,"content":"I still think many of you are missing the point. The point isn't \"I am whinning because FFG screwed up the core set\" but that I am explaining to FFG that, unless there is some kind of trade secret that they'd rather not tell their clients, that there is enough interest from the fans to actually purchase something like this. \n\n \n\nFrom a marketing perspective, it is an easy sell. From the perspective of actual sales, it seems that it would be a better seller than the nightmare decks. From the point of design, it is practically designed already. They would have to just touch up some text at the bottom of the cards. It has to be a financial issue or a budget issue with FFG. \n\n \n\nContinually telling people not to mention this does nobody any good. It is only a win for players and for the company, so it is up to the company to decide if they want to continually shaft new players by limiting the cards they can purchase and the methods for doing so. \n\n \n\nLOTR LCG is not a collectable card game, so I don't understand why anyone would bother saying that three core sets is cheaper than a MTG booster box. They are not equivalent. Nobody wants the extra cards that you get from your core sets. Cards are not worth more than the set you bought them in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1238433","commentId":1238433,"userName":"ruferto","timestamp":1409371761,"content":"I agree with you, tonylovessunny. I think about this sometimes, \"The Lord of the Rings The Card Game, Upgrade pack\". \n\nThis awesome game has so much players and fans than it looks. And something like this would be a hit. \n\n \n\nI would like to see, included in that Upgrade pack, a new rulebook including the FAQ and all the expansion rules, and cards fixed, errata free and with the easy mode icon.\n\n \n\nI feel this game needs to improve the community support, with more stuff (boxes, playmats, dividers, ...) and tools. I see the awesome tool that  FFG has launched for X-Wing and if we had something like that for LOTR...  a great Card designer, including quests... I would love to reuse my encounter decks.\n\nEdited August 30, 2014 by ruferto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113304-another-open-letter-to-ffg/?do=findComment&comment=1238659","commentId":1238659,"userName":"FetaCheese","timestamp":1409386897,"content":"Look, FFG are not stupid, if it would have been profitable for them to offer us an upgrade pack, they'd already have done so. Selling multiple copies to players however ensures that their stock of starter boxes sells at a decent rate for them and it is never returned back. That's good enough a reason not to alter their marketing plan. So it's not happening. Make some proxies instead."}]}