{"url":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/","title":"Why so few hero&#039;s that can fill Glorfindels shoes.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206215","commentId":1206215,"userName":"Knucklesamwich","timestamp":1408227886,"content":"I love secrecy. From the moment I first played a secrecy deck I felt like this is what the fellowship of the ring was all about. Deciding who to attack and when, keeping your threat low is very thematic to me when I play. Why do you think it is then that we do not get any more heroes that can rival spirit Glorfindel. I thought the hobbits would fill that role but they are a bit too expensive to get a good 3 hero deck so I always have to fall back on Glorfindel+Light of the Valinor. I really hope FFG will give us some way to overcome this because there is not much choice unless you drop too two heroes and that comes with some severe limitations. Maybe I can do a good Gandalf + Hobbit deck now but it still seems it will be hard to pull off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206268","commentId":1206268,"userName":"FetaCheese","timestamp":1408229026,"content":"Because Glorfindel is overpowered,  simply put. I'm personally glad FFG has not yet printed such powerful heroes. Glorfindel has negatively and extensively affected the game, as seen in 3 quest points minimum locations and locations that are immune to player card effects (thanks Asfaloth!). He is the one serious mistep in FFG otherwise very solid design (imho more than outlands and Dain).\n\n \n\nI think secrecy was originally intended to focus on 2 hero decks but this chancged with Glorfindel and the Hobbits. Surely, adding a Glorfidel alternative would hurt the game and I'd rather they refrained from that. I'm fine with Hobbits personally.\n\n \n\nWhat's really missing are tactics secrecy cards!\n\nEdited August 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206298","commentId":1206298,"userName":"Mndela","timestamp":1408229998,"content":"A good way to fix this problem is a simply Glorfindel ally ^^. If you play it, sure other players can't play Glorfindel hero. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206321","commentId":1206321,"userName":"Tracker1","timestamp":1408230984,"content":"I think your absolutely right, i use him a lot in my solo decks, because he brings so much to the table. 5 threat, 3 will, 3 attack, 1 def, 5 HP. LoV for questing and then Attacking. Spirit sphere has a ton of important cancelation and threat reducing cards, including a 0 cost 3 threat reduction that pairs with him. He's also got asfalof, to place 2 progress, and can use Rivindell blades. That's just a few things that make him so awesome. He can fit into just about any deck type and make it better.\n\nI use him a lot, and I will continue to do so, because he is often the best solution for many decks. I sure as heck would love more options that could rival him, but the main problem I think the designers face when introducing heroes with very good stats and low threat is that they can be paired together. Imagine if you could have 3 comparable heroes and start at 15 threat.\n\nMy thought is the designers need to get creative in finding ways to create a few more low threat heroes like this, but come up with ways to restrict paring them all together. Mirlonde is a perfect example.\n\nWhen Idraen first came out I balked at her high threat. I suggested that her card would have been even more playable if she had an additional ability along the lines of: if you control any heroes with 9 or less threat she is 11 threat, otherwise her threat is 5 or something like this. It could make sense thematically too. With high threat heroes she can make them more elusive, and with low threat heroes she needs to be more threatening to protect them.\n\nSo , in this case you could pair her with Aragorn and Beravor and start at 27 threat, but if you paired her with two 6 threat hobbits threat would be 23, and put the kabosh on paring her with Glorfindel. This would give her a lot more deck building options, since for now I can't build a deck with her without spirit Glorfindel in it, and I tried the dunedain build, but 33 threat is a bit much.\n\nAnother way to do this is to scale threat by trait, and like we saw with Mirlonde sphere. By trait would be cool, like if you control all ranger heroes, said hero's threat is 6 or whatever. Or, said heroes threat is 12 if you control a noldor hero, and 4 if you don't. Maybe mimicking some hero that has bad relationship with Noldor.\n\nAnyway, the game is in need of some heroes that shake up the regular stat distribution that we see, since many are leaning toward the high end of the threat value, which is making it difficult not to include Glorfindel when building with these new heroes at least for solo. I mean Gandalf threat 14, for me that pretty much screams here's Glorfindel to the rescue.\n\nOn another note, new Haldir hero with 9 threat is very satisfying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206331","commentId":1206331,"userName":"FetaCheese","timestamp":1408231434,"content":"I'd rather they stick with standard stat distribution. The risk in introducing such heroes is too great for the health of the game. It would be ideal if the community would self-regulate itself by actively avoiding using Spirit Glorfindel, Outlands etc, but that will never happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206361","commentId":1206361,"userName":"Gizlivadi","timestamp":1408232562,"content":"> A good way to fix this problem is a simply Glorfindel ally ^^. If you play it, sure other players can't play Glorfindel hero. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nFor a moment I thought you were being serious. I will just assume this is a joke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206364","commentId":1206364,"userName":"Tracker1","timestamp":1408232669,"content":"Everything i say relates to solo play, and sure there are a lot of great decks that can be made without using him, but there are also many more great decks that can be made because of him. Without him I think the deck building potential would be even more limited, because it would be very difficult to make decent decks using 3 high threat heroes. At least 1 hero needs to be 8 threat or lower, especially if your running high threat heroes. So, without him some combination of heroes would not be possible.\n\nYou want to play Elrond and Celeborn together, your starting at 24 threat. At this point even a 6 threat hobbit puts you at 30 threat. Through Galadriel in the mix and now your at 33 threat. Glorfindel gets you at 29, which is still not great, so in some way the game forces players into these hero combinations. It's unfortunate that it does, because it is counter productive to the player who would like to create a deck using Elrond, Celeborn, and Galadriel, because they will then likely get stomped by a hill troll first turn of Anduin.\n\nAlthough, recent scenarios are allowing for players to start with a higher threat and still be successful, but i still like to keep my decks starting below 30 and only rarely above.\n\nAnyway, i see no problem in introducing heroes that allow for a greater range of deck building like Glorfindel allowed, as long is it is done in a way that prevents combining these superheroes together like i mentioned before in the previous post."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206377","commentId":1206377,"userName":"soullos","timestamp":1408233136,"content":"> I'd rather they stick with standard stat distribution. The risk in introducing such heroes is too great for the health of the game. It would be ideal if the community would self-regulate itself by actively avoiding using Spirit Glorfindel, Outlands etc, but that will never happen.\n\n \n\nI agree. It's too much of a risk. The last thing I want to see is more overpowered spirit Glorfy-like heroes clogging up decklists. >_< Your previous comment about the negative impact spirit Glorfy has on the quest design is troubling. I hope that is not the case. If anything, the designers should design quests ignoring the overpowered heroes. If players complain they're too easy, the next question should be asked \"Are you using Spirit Glorfindel? If so, swap him out.\" End of story haha\n\n \n\nI wish there was some community effort to self regulate, but sadly that won't happen. It's really annoying when I'm looking up a deck list and the first thing I do is see if spirit glorfy is one of the heroes and if he is, I look elsewhere. Simple as that. But that sadly happens more often than not and that's a clear sign of how over powered he is. I refuse to use him. >_<"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206470","commentId":1206470,"userName":"FetaCheese","timestamp":1408236045,"content":"The problem with Glorfindel is he dominates decks. If he didn't exist, we would have had greater card variety with more evenly distributed power. If a different sphere replacement existed, how much diversity would we lose?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206472","commentId":1206472,"userName":"Tracker1","timestamp":1408236098,"content":"He is more overpowered for solo then multiplayer. When I was playing 2-4 player games he seemed to blend in like most heroes, and did not see that he had a dramatic effect on the game. I think it's hard to say he is more OP then Dain, it just depends on the number of players. However, dane solo or multiplayer is crazy overpowered for most scenarios.\n\nThe great thing about this game is people can restrict any cards they want. Personally i don't care any more, since sometimes i'll create decks that restrict cards and other decks that use every power card available. I like that flexibility, since i'm able to increase or decrease difficulty of a scenario based on the deck. Banning cards for this non-competitive solo player seems silly since i'd be missing out on a range of deck building possibilities, and by no means do I find the game so easy that I need to do so especially with Nightmare mode available. I'm fully supportive of weeding out infinite loop type combos that destroy the challenge of the game, but I don't feel like every time I play Glorfindel I'm guaranteed to win.\n\nInterstingly when there was a hero poll some time ago about peoples favorite/best hero card . I think it came down to Legolas, Sam, Glorfindel, and Elrond in the final four. So, i really wonder how many people are on the ban Glorfindel band-wagon. Would love to see an actual poll on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206484","commentId":1206484,"userName":"FetaCheese","timestamp":1408236797,"content":"One can't trust polls since people vote based on different criteria, some prefering theme, other uniqueness and other simply crave a high power level. Sorry, I don't mean to sound polemic, but I'd rather FFG avoided a return to the power creep of the Dwarrowdelf cycle (which is imo the only way to provide alternatives to Glor/Asfaloth etc). In that regard I prefer modern card design. I understand why others might disagree though.\n\nEdited August 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206491","commentId":1206491,"userName":"Tracker1","timestamp":1408237013,"content":"> The problem with Glorfindel is he dominates decks.\n\nI find this not to be the case. In many decks he is there to just support and make a deck strategy that does not revolve around him possible that otherwise would be hard to manage with any other combination of heroes, because of the high starting threat if he was not in the mix. So, often depending on the deck he will only bring 6 core cards with him LoV and Elrond's Counsel. Personally I don't use Asfalof as much as I once did and don't really miss it all that much when it's not in the deck. Now that card is OP, or was on the earlier scenarios.\n\nThe rest of the cards in the deck are selected around the decks strategy and the other 2 heroes in the deck. Sometimes, i'll have a deck where at some point it really does not matter if Glorfindel is questing or attacking anymore. It really just came down to his low starting threat, although his presence in the early game equipped with LoV is what makes him so advantageous, but it some decks that advantage may not even be necessary. It's really all situational, on what the deck is trying to accomplish.\n\nBasically, what i'm saying is he provides more deck building possibilities then without him, and personally I would not mind a few more heroes that allow for this. Really Gandalf hero is nice and all, but how many other heroes can you really build a deck with him. 14 threat really limits the possibilities.\n\nEdited August 17, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206493","commentId":1206493,"userName":"Tracker1","timestamp":1408237160,"content":"Don't get me wrong, I very much enjoy the new player cards, too. I just like things to get shaken up every once in awhile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206498","commentId":1206498,"userName":"born to lose","timestamp":1408237457,"content":"Treat LoV as \"limit one per deck\"\n\n \n\nBalances him quite nicely in my solo games and does not feel OP at all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206511","commentId":1206511,"userName":"FetaCheese","timestamp":1408237929,"content":"Yeah I think the real problem here is LoV. Cheap inherent readying and no threat increase.\n\n \n\nWhat if LoV didnt exist and instead Glor quested without exhausting but still had to raise threat by 1 every round, no exceptions (or only raised threat when questing)? It would be like playing on borrowed time. Just a thought.\n\nEdited August 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206529","commentId":1206529,"userName":"FetaCheese","timestamp":1408238755,"content":"> A good way to fix this problem is a simply Glorfindel ally ^^. If you play it, sure other players can't play Glorfindel hero. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nThat's nothing. Just imagine showing up with a Gandalf hero in a 4 player game! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited August 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206709","commentId":1206709,"userName":"Glaurung","timestamp":1408247918,"content":"I love Glorifindel as hero! He is one of my favorite character in the book. And I love to use lore Version of him in the time of first cycle. Spirit one is really good and give you opportunity to build up different solo decks. But to be honest in sick and tired about him. He is do obvious choice so you can see him everywhere. That is, not right! If I organize some tournament I ban him 100%"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206884","commentId":1206884,"userName":"MyNeighbourTrololo","timestamp":1408257614,"content":"> A good way to fix this problem is a simply Glorfindel ally ^^. If you play it, sure other players can't play Glorfindel hero. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nAnd how is that supposed to work? If you have a Glorfindel ally in your deck and some other player has Glorfinder hero - you won't be able to play the ally at all, until Glorfindel hero dies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1206888","commentId":1206888,"userName":"klaymen_sk","timestamp":1408257723,"content":">  \n> \n> > A good way to fix this problem is a simply Glorfindel ally ^^. If you play it, sure other players can't play Glorfindel hero. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n> \n> That's nothing. Just imagine showing up with a Gandalf hero in a 4 player game! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n\n \n\nI think I'll start trolling my gaming group with playing Gandalf and Faramir (our Dáin abuser uses Faramir to quest even easier)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207003","commentId":1207003,"userName":"Mndela","timestamp":1408267235,"content":"Lol, good idea (trolling with Gandalf and Faramir).\n\nMy comment (Glorfindel ally..) is half joke / half true. It is a joke (as a funny way to look at the game). But it could be true, of course.\n\nThe problem is that friends could get angry. :angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png]  Lol, of course. So you must agree which decks to play. Trololo, i am not speaking about waiting other characters die, i'm speaking about trolling some friend's decks.\n\n \n\nFor me, Glorfindel is boring. Well, if the scenario is so so hard then ok. I (and some friends) have a way of logging quests. Victories without Glorfindel or Outlanders, etc., and victories with Glor....etc. We speak about: 'yeah! we have won Druadan Forest in 4players without Glorfindel!' or 'yeah! we have won Laketown with Outlanders' (and more situations like Boromir in Assault Osgilitah or Fligth to Moria). Let's say: there are 2 levels about winning the games.\n\n \n\nI think it would be sad if Glorfindel becomes limited. He is funny as now. I think new players like a lot Glorfindel, but when you are becoming advanced player you prefer other ways to build new decks. And i like this situation.\n\nEdited August 17, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207112","commentId":1207112,"userName":"Kcall07","timestamp":1408273210,"content":"I agree that glorfindel's importance is reduced in multiplayer. I only play two player and find Beregond to be far more indepensible. First turn gondorian shield and unexpected courage will solve most of your problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207129","commentId":1207129,"userName":"MyNeighbourTrololo","timestamp":1408274366,"content":"Well, I find it strange you guys bring random decks to the table to play. Yeah, it's probably fun, but with difficulty scaling, I found out in the past that random solo decks put together in multiplayer just do not work. \n\n \n\nWhen we play, we carefully build our decks around each other to make combinaiton go around the table and help each other constantly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207180","commentId":1207180,"userName":"Rapier1","timestamp":1408277219,"content":">  \n> \n> > The problem with Glorfindel is he dominates decks.\n> \n> I find this not to be the case. In many decks he is there to just support and make a deck strategy that does not revolve around him possible that otherwise would be hard to manage with any other combination of heroes, because of the high starting threat if he was not in the mix. So, often depending on the deck he will only bring 6 core cards with him LoV and Elrond's Counsel. Personally I don't use Asfalof as much as I once did and don't really miss it all that much when it's not in the deck. Now that card is OP, or was on the earlier scenarios.\n> \n> The rest of the cards in the deck are selected around the decks strategy and the other 2 heroes in the deck. Sometimes, i'll have a deck where at some point it really does not matter if Glorfindel is questing or attacking anymore. It really just came down to his low starting threat, although his presence in the early game equipped with LoV is what makes him so advantageous, but it some decks that advantage may not even be necessary. It's really all situational, on what the deck is trying to accomplish.\n> \n> Basically, what i'm saying is he provides more deck building possibilities then without him, and personally I would not mind a few more heroes that allow for this. Really Gandalf hero is nice and all, but how many other heroes can you really build a deck with him. 14 threat really limits the possibilities.\n> \n>  \n\n \n\nHe provides more deck building possibilities because you can get a huge advantage out of taking him. His threat is far too low. Without light of valinor on him you still need to play the game for 7 rounds for him to even match the threat cost he should have for his stats.\n\nEven if he was gain 1 threat a round (regardless of what you do) he would still be arguably over-powered. \n\nI do understand what you're saying about him opening up deck building (because you can have three powerful heroes and keep your threat low) but he does it in a way which breaks the game. I think that future quests (Heirs of Numenor on-wards) have been harder to compensate for cards like Glorfindel and Dain. (I agree that Dain is much more overpowered).\n\nI also like the idea of having extra cards like a \"company\" card say. (A company of Rangers = if you have all ranger heroes reduce the threat of each hero by 1). Which could be a way of making themed decks more competitive.\n\nOf course the Noldor one is going to be ridiculous if you make it because of Spirit Glorfindel and that's the issue I have with him. He and Dain really are massive outlier on the hero power curve.\n\nThe fact that you want more good heroes with low costs (even if they can't work together) would compound the problem I feel - yes you would make it so not everyone runs spirit Glorfindel, but only because they want to pick other super tier heroes. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207216","commentId":1207216,"userName":"Tracker1","timestamp":1408280044,"content":"> \n\nThe fact that you want more good heroes with low costs (even if they can't work together) would compound the problem I feel - yes you would make it so not everyone runs spirit Glorfindel, but only because they want to pick other super tier heroes.\n\n\n\nReally my main issue is that you can't combine 3 good heroes without threat toping 30. A deck with 2 nobodies in the lotr universe Idraen and Beravor along with Aragorn, and I have a starting threat 33!\n\nAlso, if I want to make a deck that includes some of the most iconic heroes in the game Gandalf, Elrond, and Aragorn. I'll be at threat 37! So even though I'm using some of the most powerful heroes in middle- earth i'd be at such a disadvantage losing the game is inevitable. They probably can't even beat a hill troll.\n\nAlso many theme deck based on trait struggle because of the hight threat heroes, can't be combined well. Rohan, Gondor, Dunedain etc. Trying to mix and match heroes that have a chance to survive, always brings the deck around 30 or more. Theodin, eomer, eowyn at threat 31. It's no wonder there are no really good rohan themed decks. Most decks use Merry at 6 threat, or resort to using Glorfindel, or just play medicore high threat decks with frustrating results.\n\nEven a 1 pt threat reduction from the norm makes a big difference. Bifur often goes under the radar. His stats add up to 8, but he is 7 threat. When looking at lore heroes he floats to the top when building decks, because of that 7 threat combined with an ability that bends the rules of deck building significantly. So, in many ways in the right type of deck he is also super powerful. With an ability like that you think they would have put him at 9 threat, 1 more than his stat value like Bilbo and Grima, but they went the other direction and made a great versatile \"glue\" hero for many deck. At 9 threat he would mostly be a dust collector.\n\nSo, really all i'm calling for are more heroes like Bifur. Since heroes like that are enough to give the players a slight advantage in threat, while providing deck building options with many of the high threat heroes that are difficult to play together.\n\nEdited August 17, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207232","commentId":1207232,"userName":"Tracker1","timestamp":1408280717,"content":"> I agree that glorfindel's importance is reduced in multiplayer. I only play two player and find Beregond to be far more indepensible. First turn gondorian shield and unexpected courage will solve most of your problems.\n\nYes, Beregond/ gondorian shield is extremely powerful if not broken. Thing is he does not fit in every solo deck, and other then defending he does not do much else, but he basically neutralizes a very challenging part of the game. However, i never hear of players banning him, talk is usually how he can defend for each player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207288","commentId":1207288,"userName":"Mndela","timestamp":1408283783,"content":"The most killed hero i have seen a lot of times dying is Beregond. For me he is not broken.\n\nEdited August 17, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207314","commentId":1207314,"userName":"Glaurung","timestamp":1408285130,"content":"Beregond is not a broken since he manage only defence.... But Glor he quest, fight, have 5 hit point and also deal with location with Asfaloth. And his starting threat is 5! what you want more?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207339","commentId":1207339,"userName":"MyNeighbourTrololo","timestamp":1408286217,"content":"> Beregond is not a broken since he manage only defence.... But Glor he quest, fight, have 5 hit point and also deal with location with Asfaloth. And his starting threat is 5! what you want more?!\n\nFruit of game elements being tied to a named character.\n\n \n\nSure, Light of Valinor is for Noldor or Silvan, but who are we kidding? It was created to negate spirit Glorfindel's born weakness, thanks god they didn't restricted it to him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207406","commentId":1207406,"userName":"Tracker1","timestamp":1408288767,"content":"To me i play this game for fun, i don't care about tournament play and banning cards. Combining heroes and building decks are a big part of what interests me and whether i win or lose scenario is not really big deal.\n\nA blessing and a curse with this game is that you can't select any 3 heroes and build a deck around them. It's a blessing because it leads to some creative and strategic deck building choices. It's a curse because it really limits which heroes can be played together. Glorfindel became a crutch in many of my deck because i allowed me to take 2 other hight threat heroes and play them together. Sure he has good stats, but i would probably even if he was a 1/1/1/3 hero for 5 threat it would lend a similar versatility to deck building that glorfindel provides. That seems to be the case with the amount of decks with merry and pippin at least.\n\nAny hero with 7 or lower threat is going to be considered when playing with 2 other high threat heroes. Glorfindel floats to the top so often because we have so few options keep a reasonably low starting threat when using high threat heroes, of course his stats make him the obvious choice to fill this much needed role.\n\nOkay, i sound like a broken record at this point. Whatever, we'll see what the developers have down the line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1207407","commentId":1207407,"userName":"Rapier1","timestamp":1408288767,"content":"> So, really all i'm calling for are more heroes like Bifur. Since heroes like that are enough to give the players a slight advantage in threat, while providing deck building options with many of the high threat heroes that are difficult to play together.\n\n \n\nBifur is a good example of a hero that isn't broken but has a slight threat advantage (along with Mirlondre imo, who has a slightly better threat advantage but no other benefits).\n\n \n\nI think maybe all heroes could do with a threat reduction of 1 sometimes, because as you say, in current games, starting with 30+ threat is too harsh.\n\nOn the other hand I believe the game is like this to make up for Glorfindel having such good stats at a low threat (because otherwise he would trivialize current quests). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1209385","commentId":1209385,"userName":"Mich the One","timestamp":1408374522,"content":"> A blessing and a curse with this game is that you can't select any 3 heroes and build a deck around them. It's a blessing because it leads to some creative and strategic deck building choices. It's a curse because it really limits which heroes can be played together. \n\n \n\nTrue, true. It somewhat challenges the idea of the game being a Tolkien sandbox. Which is what I would LOVE this game to be.\n\n \n\nWhat I find funny is that the community seems to limit themselves when it comes to Outlands. As in it is agreed they are overpowered and boring, and \"friends do not let friends play Outlands\". Of course this is a generalisation and people may think otherwise, but you do get those vibes from the community. At the same time, Glorfy is not frowned upon as much. Why is that? I personally do not know, because I have absolutely no problem with cards being very strong (cue all \"it is a co-op\" arguments). Perhaps the theme factor comes into play? I see Outlands as a bunch of more-less anonymous Gondory-related folk, while Glorfindel is one of the mightiest and coolest heroes of Middle-earth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1209680","commentId":1209680,"userName":"iznax","timestamp":1408381100,"content":"If you think 5 threat Glorfi is so broken and op w8 until you see Elrond with Light of Valinor, a burning brand, Vilya, Rivendel Bow, Rivendel Blade, Elven Mail, Unexpected Courage (3 to be sure) some Dunedain quests,warnings and marks and a litle favor of the lady, riding  Asfaloth, making some of his councils and bringing a few warden of healing with him :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited August 18, 2014 by iznax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1209732","commentId":1209732,"userName":"chrsjxn","timestamp":1408382015,"content":"Glorfindel is great as a band-aid hero for decks that have a high threat that you want to have a lower threat. And he enables Elrond's Council from turn 1.\n\n \n\nOnce upon a time, I would have said that Asfaloth is what made him broken. Because there were a lot of low progress locations that he could snipe in between staging and quest resolution. But the designers have been working pretty hard against location destruction in recent quests.\n\n \n\nAnd I've actually been using less and less of him in decks, because the quests more and more are not set up to really punish high threat starts. 30 threat doesn't automatically mean you're hosed now.\n\n \n\nI predict we'll see less of him as time goes on. And if you play multiplayer it's already not that big of a deal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1209980","commentId":1209980,"userName":"FetaCheese","timestamp":1408387218,"content":"To be honest, if Outlands were called Gondor instead, much fewer people would complain, that's for sure.\n\nAin't nobody got time for Ethyr bro. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited August 18, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210596","commentId":1210596,"userName":"Dain Ironfoot","timestamp":1408401448,"content":"> And I've actually been using less and less of him in decks, because the quests more and more are not set up to really punish high threat starts. 30 threat doesn't automatically mean you're hosed now.\n\n^this!\n\n \n\ni've found the core set really \"brainwashed\" us (hello, hill troll!) into thinking any hero lineup with 30+ threat is too high.\n\n \n\nin modern quests/with the modern card pool, i no longer really feel that's the case. with higher threat comes better stats, so your heroes should be able to deal with it. and if you don't have ally drops the first (and second) turn in your opening hand, i'd argue your deckbuilding skills need work.\n\n \n\ni have no problem starting with over 30 threat anymore (and would probably never have dreamed of it a few years ago)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210612","commentId":1210612,"userName":"Rapier1","timestamp":1408401889,"content":">  \n> \n> > And I've actually been using less and less of him in decks, because the quests more and more are not set up to really punish high threat starts. 30 threat doesn't automatically mean you're hosed now.\n> \n> ^this!\n> \n>  \n> \n> i've found the core set really \"brainwashed\" us (hello, hill troll!) into thinking any hero lineup with 30+ threat is too high.\n> \n>  \n> \n> in modern quests/with the modern card pool, i no longer really feel that's the case. with higher threat comes better stats, so your heroes should be able to deal with it. and if you don't have ally drops the first (and second) turn in your opening hand, i'd argue your deckbuilding skills need work.\n> \n>  \n> \n> i have no problem starting with over 30 threat anymore (and would probably never have dreamed of it a few years ago).\n> \n>  \n\n \n\nExcept of course, with higher threat comes better stats ... or you can take Glorfindel. The issue for him, isn't that high threat is unplayable, it's that you can get a threat cost 12 hero with 7 less threat. \n\nHe'd be pretty good at threat 9. (Mirlonde basically has no special ability but starts with threat -3), having him be 5 with a penalty that you can trivially circumvent (use his amazing attack instead of his amazing willpower), is just stupidly good.\n\nI do think there's scope for having low threat heroes, but I think the issue is that lower threat is generally better - the hobbits are great because of their low starting threats (Except Bilbo)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210625","commentId":1210625,"userName":"Dain Ironfoot","timestamp":1408402141,"content":">  \n> \n> >  \n> > \n> > > And I've actually been using less and less of him in decks, because the quests more and more are not set up to really punish high threat starts. 30 threat doesn't automatically mean you're hosed now.\n> > \n> > ^this!\n> > \n> >  \n> > \n> > i've found the core set really \"brainwashed\" us (hello, hill troll!) into thinking any hero lineup with 30+ threat is too high.\n> > \n> >  \n> > \n> > in modern quests/with the modern card pool, i no longer really feel that's the case. with higher threat comes better stats, so your heroes should be able to deal with it. and if you don't have ally drops the first (and second) turn in your opening hand, i'd argue your deckbuilding skills need work.\n> > \n> >  \n> > \n> > i have no problem starting with over 30 threat anymore (and would probably never have dreamed of it a few years ago).\n> > \n> >  \n> \n>  \n> \n> Except of course, with higher threat comes better stats ... or you can take Glorfindel. The issue for him, isn't that high threat is unplayable, it's that you can get a threat cost 12 hero with 7 less threat. \n> \n> He'd be pretty good at threat 9. (Mirlonde basically has no special ability but starts with threat -3), having him be 5 with a penalty that you can trivially circumvent (use his amazing attack instead of his amazing willpower), is just stupidly good.\n> \n> I do think there's scope for having low threat heroes, but I think the issue is that lower threat is generally better - the hobbits are great because of their low starting threats (Except Bilbo).\n> \n>  \n\ni wasn't trying to make a point about glorfindel - but rather, starting over 30 isn't the detriment it used to be. but points well taken! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210713","commentId":1210713,"userName":"Tracker1","timestamp":1408404305,"content":"> and if you don't have ally drops the first (and second) turn in your opening hand, i'd argue your deckbuilding skills need work.\n> \n>  .\n\nWell your talking to a guy who builds decks to beat Into Ithillien and a number of other quests with no allies in the deck at all. So, dropping allies to chump block to survive the early game is only one way to play the game, and when it comes to building decks i find it one of the easiest strategy to employ in deck building that takes minimal skill.\n\nI do agree that the modern quests allow for more flexibility in starting with high threat. Engagement cost of enemies seems to be higher especially in the current cycle. The Morgul Vale was the last quest that we had that starting under 30 was a big issue.\n\nMuch of this comes down to player styles, personal preferences, and the number of players played with. Personally, I like low threat decks, enjoy shooting for secrecy decks. I like attachment heavy decks, which often take a bit of set up time etc. I'm a solo player so it's easier to control the pace of the game to build decks with the parameters that I like. Also in solo game, i don't have any other players decks to help me out where my deck is lacking, so starting with higher threat decks in multiplayer is often easier, since the team of players can work together with ranged and sentinel heroes to work it out. In solo some of these higher threat decks just get swamped early on and it's tough for them to recover without any help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210733","commentId":1210733,"userName":"Dain Ironfoot","timestamp":1408404938,"content":">  \n> \n> > and if you don't have ally drops the first (and second) turn in your opening hand, i'd argue your deckbuilding skills need work.\n> > \n> >  .\n> \n> Well your talking to a guy who builds decks to beat Into Ithillien and a number of other quests with no allies in the deck at all. So, dropping allies to chump block to survive the early game is only one way to play the game, and when it comes to building decks i find it one of the easiest strategy to employ in deck building that takes minimal skill.\n> \n> \n> \n>  \n\nright, i really just meant if you are using allies in your deck (obviously). allies can take the heat off a high starting threat, if you have a bad staging/first round. i was trying to talk about the cost curve (a la the mana curve in Magic) and got lazy and didn't want to type all that out (i.e., how it's crucial to have 1 cost cards in your deck, as well as 2).\n\n \n\nif it's an attachment deck, i'd hope you are dropping some of those in the first turn, as well. (but, i do find more attachment hate lately that really wrecks this particular strategy - or, at least, makes it riskier).\n\n \n\nbut, certainly you are right - your buddies can (potentially) take the heat off your deck in multiplayer that doesn't happen in solo.\n\n \n\non a more personal note, i've learned we have polar opposite deckbuilding styles/approaches to the game, tracker1, and there's nothing wrong with that. i.e., i don't understand all this love/want/need for secrecy, i find solo boring (no offense!), and an ally-less deck also seems boring/not fun/one-trick-pony.\n\n \n\nbut i'll reiterate here what i've said elsewhere - that's the beauty of this game. there are so many different ways to play it, beyond simply the one vs. multiplayer.\n\nEdited August 18, 2014 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210816","commentId":1210816,"userName":"Tracker1","timestamp":1408407024,"content":"> .\n> \n>  \n> \n> on a more personal note, i've learned we have polar opposite deckbuilding styles/approaches to the game, tracker1, and there's nothing wrong with that. i.e., i don't understand all this love/want/need for secrecy, i find solo boring (no offense!), and an ally-less deck also seems boring/not fun/one-trick-pony.\n> \n>  \n> \n> but i'll reiterate here what i've said elsewhere - that's the beauty of this game. there are so many different ways to play it, beyond simply the one vs. multiplayer.\n\nNo sweat, i appreciate the diversity of opinions and playstyles, and none is more valid than the other. it's enlightening for me to see beyond the box that i live in. Your statement just rubbed me the wrong way because it sounded like a \"this is this is the way to play\", which i know is not true, but i now understand what your getting at. Until next time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1210875","commentId":1210875,"userName":"Dain Ironfoot","timestamp":1408408806,"content":">  \n> \n> > .\n> > \n> >  \n> > \n> > on a more personal note, i've learned we have polar opposite deckbuilding styles/approaches to the game, tracker1, and there's nothing wrong with that. i.e., i don't understand all this love/want/need for secrecy, i find solo boring (no offense!), and an ally-less deck also seems boring/not fun/one-trick-pony.\n> > \n> >  \n> > \n> > but i'll reiterate here what i've said elsewhere - that's the beauty of this game. there are so many different ways to play it, beyond simply the one vs. multiplayer.\n> \n> No sweat, i appreciate the diversity of opinions and playstyles, and none is more valid than the other. it's enlightening for me to see beyond the box that i live in. Your statement just rubbed me the wrong way because it sounded like a \"this is this is the way to play\", which i know is not true, but i now understand what your getting at. Until next time!\n> \n>  \n\nyeah, definitely not what i was trying to do (be a jerk know-it-all) - but i was typing at work (sssssh!) and was trying to be quick, which is always a bad thing. haha. sorry if it offended! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1213561","commentId":1213561,"userName":"Boris_the_Dwarf","timestamp":1408503615,"content":"Really the way to fix him is pretty simple with a couple of lines of errata:\n\n \n\nReplace the card text with the following - Forced: After Glorfindel exhausts, raise your threat by 1.\nForced: At the end of the round, if Glorfindel is ready, spend 1 resource from Glorfindel or exhuast him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1213765","commentId":1213765,"userName":"MyNeighbourTrololo","timestamp":1408514657,"content":"> Really the way to fix him is pretty simple with a couple of lines of errata:\n> \n>  \n> \n> Replace the card text with the following - Forced: After Glorfindel exhausts, raise your threat by 1.\n> \n> Forced: At the end of the round, if Glorfindel is ready, spend 1 resource from Glorfindel or exhuast him.\n\nWould make him one of those worst heroes, if not the worst."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1214239","commentId":1214239,"userName":"Distractionbeast","timestamp":1408542520,"content":"I'd just replace his text with the following:\n\n \n\nForced:  After Glorfindel commits to the quest, raise your threat by 1.\n\n \n\nIt's not like he wouldn't still be awesome.  It doesn't diminish the usefulness of Light of Valinor and in Spirit sphere, such a threat increase is easy enough to counter.  He'd still be a shoe-in for secrecy (which I think is fine), but he'd have to be more carefully played and his drawback can't be so easily negated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1214337","commentId":1214337,"userName":"Rapier1","timestamp":1408545897,"content":"> I'd just replace his text with the following:\n> \n>  \n> \n> Forced:  After Glorfindel commits to the quest, raise your threat by 1.\n> \n>  \n> \n> It's not like he wouldn't still be awesome.  It doesn't diminish the usefulness of Light of Valinor and in Spirit sphere, such a threat increase is easy enough to counter.  He'd still be a shoe-in for secrecy (which I think is fine), but he'd have to be more carefully played and his drawback can't be so easily negated.\n\n \n\nUnless you plan to only quest with him 2 or 3 times and otherwise plan to use his 3 attack stat instead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1214466","commentId":1214466,"userName":"Distractionbeast","timestamp":1408549464,"content":">  \n> \n> > I'd just replace his text with the following:\n> > \n> >  \n> > \n> > Forced:  After Glorfindel commits to the quest, raise your threat by 1.\n> > \n> >  \n> > \n> > It's not like he wouldn't still be awesome.  It doesn't diminish the usefulness of Light of Valinor and in Spirit sphere, such a threat increase is easy enough to counter.  He'd still be a shoe-in for secrecy (which I think is fine), but he'd have to be more carefully played and his drawback can't be so easily negated.\n> \n>  \n> \n> Unless you plan to only quest with him 2 or 3 times and otherwise plan to use his 3 attack stat instead.\n> \n>  \n\n \n\nExactly.  He'd still be super-powerful, especially for his threat cost, but the fact that Light of Valinor just instantly negates his only drawback is just too much.  I could suggest \"better\" balances, but this is the lowest impact one I can come up with that keeps his essence intact."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1214734","commentId":1214734,"userName":"joezim007","timestamp":1408557401,"content":"Maybe this?\n\n \n\nForced: At the end of the combat phase, if Glorfindel is exhausted, raise your threat by 1.\n\n \n\nLight of Valinor then still allows him to quest freely, but if he is used for his attack, you'll need another readying effect on him to prevent the threat gain. I like the idea of raising your threat any time he commits to the quest too; just throwing more ideas out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/113666-why-so-few-heros-that-can-fill-glorfindels-shoes/?do=findComment&comment=1214825","commentId":1214825,"userName":"Bullroarer Took","timestamp":1408560436,"content":"I don't think he needs fixing. (At least not as much as Bilbo.). I've had games with him where LoV never came out and it was pretty miserable. If anything needs to be changed it's LoV. I think limiting it to one or two per deck is the best way."}]}