{"url":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/","title":"Shadows of Mirkwood","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217278","commentId":1217278,"userName":"player1761766","timestamp":1408645349,"content":"Hey folks,\n\nAn interesting thought occurred to me, after replying to a topic [http://www.boardgamegeek.com/thread/1222598/first-love-still-there] over on BGG about this game. \n\n \n\nI've been a massive fan of this game pretty much since it came out, and while I am still utterly enthralled by every new release (shiny!), I still have this overwhelming nostalgia for the very first cycle. I don't mean in terms of the player cards - because I store all of the player cards together by type-within-sphere, I tend not to think of cycles for their player cards, but only for their encounters. One of my absolute favourite things to do with this game is have a play-through with Hunt for Gollum / Hills of Emyn Muil / Dead Marshes, and just relive those heady early days of the game. \n\n \n\nI suppose this could stem from there being not that much out for it back then, so I appreciated these quests more, but I'm curious if anyone else enjoys the earlier stuff more, or if it's all just a distant memory while you're playing with the new stuff? Does anybody even play the Mirkwood quests that often anymore? 2011 wasn't all that long ago, but sometimes it feels like the Glory Days of this game to me, when the game was such an enjoyable experience.\n\n \n\nAs I said, though, I'm not talking about the older quests to the exclusion of the new ones. Against the Shadow had some wonderful quests, and while I haven't had a chance to play any Ring Maker quests yet, they look like a whole load of fun and I can't wait to give them a proper chance. \n\n \n\nMaybe I'm just waxing lyrical, but I'd love to hear other peoples' thoughts! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217307","commentId":1217307,"userName":"jormungandr","timestamp":1408645970,"content":"Yup, I do! I still play JatA/CaC (sometimes NM) with practically every new deck I make. I guess my favourite old quest is MaO (if this counts.) I love the fact that a lot of the cards from the core set are still not only playable, but at the core of the game. Maybe it's because they are OPed, because the designing team were still trying stuff out, but its rewarding to still viably play combo's like sneak attack gandalf, or resurrect a Beorn ally pitched to Eowyn. I enjoy the old factions like eagles and rohan as well. It's cool to see they're getting some real love again and are not immediately OPed like *shiver* outlands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217430","commentId":1217430,"userName":"Nickpes","timestamp":1408648273,"content":"I do this also. From time to time i try all the first cycle quests with decks i like. I do not do it with other cycles. I especially like Rhosgobel and return to mirkwood :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217435","commentId":1217435,"userName":"Bullroarer Took","timestamp":1408648328,"content":"My Nightmares take me back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217448","commentId":1217448,"userName":"gandalfDK","timestamp":1408648548,"content":"I just picked up this game recently, so the only cycle I posses is SoM, and, I don't want to offend you, but the quests you name: Hunt of Gollum, Hills of Emyn and Marshes are the three least interesting quests of the cycle imo. Hills has a huge change for locationlock, and the Hunt also. The Marshes has a weird mechanic on which you shuffle Gollum back into the deck and then beat the last quest, thus having to make an escape test against 0 escape..\n\nFrom my point of view the new quests are much more refined and epic. CaC is a really cool quest, and I think that it'll remain one of my favorites for a long time. But fighting in Moria or against Haradrim sounds a lot of more fun and cooler then stalking that stinking creature. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nJtR is also a cool quest and man, I love the eagles!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217608","commentId":1217608,"userName":"FetaCheese","timestamp":1408652176,"content":"Shadows of Mirkwood was a fine cycle, with the Hills of Emyn Muil being the only fluke imo. Against the shadow, although harder, has been a weaker experience for me so far...with the exception of the Steward's Fear. Favourites from the 1st cycle is Hunt for Gollum, Journey to Rhosgobel and Return to Mirkwood. Contrary to many other players, I dislike CaC because it's essentially just a puzzle. It has no replay value to me. This and HoEM are really mediocre, but the rest are fine. I am planning on buying the nightmare deck for HoG soon-ish, since I enjoyed it the most. I also find JtRhosgobel great thematically and don't mind deck building around it, as its the only quest left still offering a challenge, thanks to its healing mechanics (which I like).\n\nBtw the Ringmaker cycle has been excellent so far.\n\nEdited August 21, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1217702","commentId":1217702,"userName":"chrsjxn","timestamp":1408654152,"content":"JATA is my most played quest, by far. Such a good test for solo decks because you need to quest and fight both big enemies and multiple small ones.\n\n \n\nI still play the others sometimes, though they can be awkward and unforgiving. Like when you don't see anything but clues and Hunters From Mordor in The Hunt For Gollum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1218451","commentId":1218451,"userName":"Glaurung","timestamp":1408686134,"content":"JATA is a really good quest. IN Nmode is just incredible !!! Probably yes, best quest of all LOTR LCG time"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1218577","commentId":1218577,"userName":"Mndela","timestamp":1408695733,"content":"JATA is the most played quest to me. Always i want to test a deck, i start with playing in JATA"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1219320","commentId":1219320,"userName":"ossderossmane","timestamp":1408722741,"content":"To be honest, I don't like the cycle too much. Hunt for Gollum, Hills, and Dead Marshes are too easy, Rhosgobel and Return to Mirkwood you really have to build for, Carrock is fine but kind of replaced by We must away. Playing the whole cycle with a single deck sounds fun though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1219479","commentId":1219479,"userName":"Mndela","timestamp":1408727576,"content":"> To be honest, I don't like the cycle too much. Hunt for Gollum, Hills, and Dead Marshes are too easy, Rhosgobel and Return to Mirkwood you really have to build for, Carrock is fine but kind of replaced by We must away. Playing the whole cycle with a single deck sounds fun though.\n\n \n\nThis cycle has all special quests, so you need special decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1219771","commentId":1219771,"userName":"ossderossmane","timestamp":1408734469,"content":">  \n> \n> > To be honest, I don't like the cycle too much. Hunt for Gollum, Hills, and Dead Marshes are too easy, Rhosgobel and Return to Mirkwood you really have to build for, Carrock is fine but kind of replaced by We must away. Playing the whole cycle with a single deck sounds fun though.\n> \n>  \n> \n> This cycle has all special quests, so you need special decks.\n> \n>  \n\n \n\nYeah, for me this is the obstacle to replaying. I like using new decks for old quests, but if I have to build just for the quest, I don't care enough if it's a quest that I've already beaten."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1219907","commentId":1219907,"userName":"Johnny Awesome","timestamp":1408739064,"content":"I own almost everything, but I'm way behind in this game, so I'm still just finishing the Dwarowdelf cycle and haven't played any Saga, Nightmare or PoD scenarios.\n\n \n\nI still enjoy the Mirkwood quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1220637","commentId":1220637,"userName":"Eldainorn","timestamp":1408783805,"content":"I have a feeling that I like SoM cycle more than Dwarrowdelf. I don't feel as much excitement when I am in caves, I guess. Mirkwood seems much better place to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1224567","commentId":1224567,"userName":"player1761766","timestamp":1408996645,"content":"Thank you for all the replies! It's interesting to see the reasons why people do or don't play this cycle. The idea that it's too easy is undeniable, I suppose, given the expansion of player cards that has occurred since its release. I suppose it's definitely more of a nostalgia thing for me, rather than wanting any sort of new challenge, though I would also say that the Nightmare Decks for some of these quests really are the best I've seen yet. \n\n \n\nAnyway, I definitely agree that the more recent quests we've been seeing are much more refined. Against the Shadow has been a wonderful experience for me - not sure why you thought it was weaker, FetaCheese? The ongoing storyline was such a wonderful experience, I'm expecting to see more of this in subsequent cycles, perhaps bringing more of a Saga feel (maybe even by bringing in boons and burdens?), but definitely appreciate the heightened story emphasis. \n\n \n\nSo yeah, thanks for the replies everyone - I like to know peoples' experiences and thoughts on the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114288-shadows-of-mirkwood/?do=findComment&comment=1224631","commentId":1224631,"userName":"FetaCheese","timestamp":1408998325,"content":"Shadows of Mirkwood is just plain, old-fashioned, innocent fun. Sure Emin Muil is meh and the Dead Marshes are somewhat lacking but the rest of the quests are great. HfG and JtR is swingy and thematic, CatC is a fun puzzle and the RtM quest was quite the challenge for a long time for a single player. To an extend it still is. I have fond memories of the cycle, even though I am a late comer to the game. I look forward to trying the nightmare versions of all these quests (except for CatC :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]).\n\nAgainst the Shadow however has left me with lukewarm memories so far. TSF is the only quest that feels like an upgrade after the very enjoyable Dwarrowdelf cycle. Everything else is lackluster in the sense I'd rather play FoS or Khazad Dum or, yes, HfG or JtR. To be honest, there is something about the whole cycle that feels \"off\" to me. PiP and Into Ithilien were nigh unbeatable until I played a Dunhere fury deck inspired from Tracker1 tnat crushed them both, exposing their mechanical errors. Leaving behind the scroll is a legit strategy in PiP... but how does that make sense? I got a Mumak in the 1st round of Ithilien and were forced to engage both enemies, insta-gimping me... how is that acceptable design in the game's 3rd cycle? I can forgive a second troll in JatA but not here. Edit: Not to mention the Watcher in the Woods (?) Treachery that once eliminated all 3 players in a single turn. It's just not fun having the game working against you instead of challenging you.\n\nAmon Din, Osgiliath and Blood of Gondor are all lackluster imo. The whole battle and siege mechanics were clumsily handled imo, though I like how they were integrated in Battle of the Five Armies (I like Siege of Cair Andros, but siege/battle are a bandaid for tactics). I know some players just like difficult quests, but that's not enough to turn a scenario into an enjoyable one. The Ring maker cycle by comparison is awesome: solid mechanics and high difficulty, with sensible use of gimmicks.\n\nI love the game but AtS was the weakest cycle to me.\n\nEdited August 25, 2014 by FetaCheese"}]}