{"url":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/","title":"What if term &quot;printed resourcre icon&quot; was nonexistent?..","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1218892","commentId":1218892,"userName":"MyNeighbourTrololo","timestamp":1408713022,"content":"My recent Gandalf thread got me thinking a bit. And I'm just curious now. Can anybody think of any extremely powerful or even overpowered combo that is not possible now, but would be possible if all those cards of LotR that require printed resource icons were requiring just a resource icon, without being necessarily printed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1218991","commentId":1218991,"userName":"alogos","timestamp":1408715435,"content":"For now, there is only 12 cards that can be used with Gandalf while gaining something with is «printed» mechanic, including Lord of Morthond.\n\nThat's not very much, and most are useless if you draw them.\n\nSo... not for now, but I expect there will be more cards in the future, and he will still gain power.\n\nA mechanic that can appear in the future, is to scale power of a card with how many different spheres you play. If this happen, he could become quite overpowered !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219021","commentId":1219021,"userName":"Tracker1","timestamp":1408715990,"content":"The use of Printed really got a big boost last cycle with all the Mono Sphere attachments and events, even Caldera and Theoden heroes used it. It is also used with ranged and cost.\n\nOverall, when it's connected to sphere it usually makes the card far less playable, especially when all the heroes need to have the printed sphere. For the most part i make Duel and tri sphere decks and all the events that call for 3 heroes to have the printed sphere, i usually never use.\n\nIt would give players many more options to not make printed a requirement, then songs would have another use in deck building.\n\nI guess designers wanted to make the advantages of mono sphere to be quite good, although All the cards that required 3 heroes to have printed resource icon were mediocre. The tactics one and leadership ones were the best, but i rarely use them because of the restriction.\n\nAnd no i do not see any overpowered combo at this point.\n\nEdited August 22, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219036","commentId":1219036,"userName":"MyNeighbourTrololo","timestamp":1408716265,"content":"I'm asking because now, when I gave it some deep thought, I think how awesome it would be if all those cards required just an icon, not printed. I think it's a big loss."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219057","commentId":1219057,"userName":"joezim007","timestamp":1408716701,"content":"I don't know about overpowered, but the following cards get much nicer and more useful:\n\n \n\nMithrandir's Advice\n\nStrength of Arms\n\nAdvance Warning\n\n \n\nI'm not sure how Mirlonde would work because I don't think changing the initial threat cost of a hero would actually change your threat level after the game has already started."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219062","commentId":1219062,"userName":"alogos","timestamp":1408716812,"content":"Oh yeah, if those card didn't require printed, I would totally use...\n\nwait... I already use Mithrandir advice, and it is quite powerfull enough as it is.\n\nMono 2-cost event are mediocre, the Leadership one is just overpowered in dwarf/outland deck, the Energy one is crap, the Tactic one is not reliable enough and the Lore is specific for certain build. If they didn't required printed icon, Leadership one would be tooooo overpowered, Energy would still be crap, Tactics would still be unreliable, and Lore would still require specific deckbuilding. So... not a big loss relativly speaking I presume."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219119","commentId":1219119,"userName":"Tracker1","timestamp":1408717947,"content":"Mithrandir's advice is really the only one I use,  usually if it's 2 lore heroes I'll consider it.  1 lore hero i never use it.  If i could get more cards out of it by including songs in the deck if it did not require printed, I'm not sure it would be worth including songs just for that.  \n\n \n\nBasically,  it would still take a bit more set up to get the extra draw with songs, but I don't think it would make the card incredibly unbalanced, since that draw increase would probably be later in the game, and by that point a deck is usually pretty stable in the game.\n\n \n\nIt's interesting that Thicket of Spears is essentially a Mono sphere card, since the card states you need to use resources from 3 different heroes pools.  I rarely use the card because of this, and never considered using song of battle to be able to play it,  but maybe that's because feint is the obvious choice and i usually don't sue SoB to splash tactics in a deck. the wording on this card also means it can not be used with less than 3 heroes. I think it is the only card stated this way, but this type of language could have been another way to phrase the monosphere cards, other than now they would be restricted to 3 hero decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219134","commentId":1219134,"userName":"MyNeighbourTrololo","timestamp":1408718240,"content":"Now I wonder how are you going to spend resources from 3 different hero resource pools for the thicket of spears if you'll reduce it's cost to 2 by Grima :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219189","commentId":1219189,"userName":"alogos","timestamp":1408719407,"content":"We have asked caleb, someone wanted to play it with merry + good meal :\n\nYou can't, because the requirement for playing the card is to spend ressource from 3 different heroe's pool. Not less. So if you reduce the cost, you can't play it!\n\nYou can fool yourself with leaf brooch on merry ^^ (and secrecy and two other tactics heroes)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219649","commentId":1219649,"userName":"joezim007","timestamp":1408731635,"content":"> We have asked caleb, someone wanted to play it with merry + good meal :You can't, because the requirement for playing the card is to spend ressource from 3 different heroe's pool. Not less. So if you reduce the cost, you can't play it!You can fool yourself with leaf brooch on merry ^^ (and secrecy and two other tactics heroes).\n\nGood luck getting secrecy with 3 Tactics heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219688","commentId":1219688,"userName":"MyNeighbourTrololo","timestamp":1408732472,"content":"Good luck getting secrecy with almost any combination of 3 heroes  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219722","commentId":1219722,"userName":"joezim007","timestamp":1408733272,"content":"> Good luck getting secrecy with almost any combination of 3 heroes  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\n \n\nTrue enough, but at least Spirit and Lore have the possibility to have monosphere 3-hero secrecy decks, though Lore doesn't have much chance of keeping it that way.\n\nEdited August 22, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1219763","commentId":1219763,"userName":"alogos","timestamp":1408734300,"content":"Pippin + Glorfindel + 2 song of tactics....\n\n \n\nNot written Printed on this one guys..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221231","commentId":1221231,"userName":"Rapier1","timestamp":1408819625,"content":"Without the \"printed resource icon\" rule - then it wouldn't be possible for them to create in-sphere effects any more because of the songs.\n\nThe songs basically allowed players to ignore a heroes sphere entirely (You can run Spirit Glorfindel in a deck with no spirit and songs for instance). The \"printed\" requirement is necessary to allow them to give the versatility of songs and still make it possible to create effects that are only available within a sphere. \n\nThis might be a useful way to off-set a weaker sphere or prevent a mechanic that you want in only one sphere to ever be available outside of it. Another use of the rule that I feel is sufficient to justify it's existence is allow you to create card effects that would be broken with each other (or with particular heroes) and then make it possible to lock them out of combination.\n\nI think Knights of Minis Tirith is the strongest card to have this rule - and I think it would be too good if it was only tactics icons."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221252","commentId":1221252,"userName":"MyNeighbourTrololo","timestamp":1408820556,"content":"You overrate the printed requirements. Getting rid of printed requirements would just open more interesting opportunities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221443","commentId":1221443,"userName":"Rapier1","timestamp":1408830865,"content":"> You overrate the printed requirements. Getting rid of printed requirements would just open more interesting opportunities.\n\n \n\nReducing restrictions always opens up more opportunities. \n\nHowever this is a deck building game and restrictions also have value (If all the cards were one sphere and cost, you would easily and trivially be able to choose the best deck regardless).\n\nThe only opportunities that would change, would be that you could take any of the cards that currently need a \"printed icon\" and play them to full effect in a deck with songs of that sphere instead.\n\nPersonally I don't think that makes the game more interesting, I think it reduces viable decks. By having some cards that are good in mono-sphere and some that aren't you increase deck building options.\n\nEdited August 23, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221461","commentId":1221461,"userName":"MyNeighbourTrololo","timestamp":1408831594,"content":"Nope, you're entirely wrong. \n\n \n\nThe point of those cards is to enforce monosphere decks in most blunt way it could have been done. But, even if they didn't require the printed icons - initial monosphere decks that use those cards would have a huge heads up advantage over mixed ones that try to use them. Setting up songs takes time and resources and deck space. \n\n \n\nMore options can't reduce viable decks. Restricting something just for the sake of it does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221547","commentId":1221547,"userName":"Rapier1","timestamp":1408836245,"content":"More options can reduce viable decks, if all the best cards were in the same sphere, then the only viable decks would be in that sphere, that would reduce the viable decks by roughly 3/4 and make 3/4 of all the cards not playable.\n\nBefore those cards, few people played mono-sphere decks because those decks were just worse. Songs meant you could have all the advantages of being mono-sphere (that is, 3 resources of the same sphere a turn) as well as choosing for instance, any hero you like to go with two in the sphere you want. Also being able to get the best of two spheres is highly desirable, so you need more powerful cards that are restricted to a single sphere to offset this - if you didn't have the printed icon mechanic then those more powerful cards would still be available to any deck with songs, or any deck that was willing to take a little longer to get a card out.\n\n\nI think the printed icons wording is fairly inelegant and I don't like it exactly, but I can absolutely see the value  of it. I especially like the scaling fetch event attachments. They improve more, the more in sphere you are, and by re-fetching an event in sphere they emphasis doubling up on the things your mono-sphere deck are best at (as opposed to dual-sphere decks that should be more flexible but weaker). It's excellent design and not at all blunt.\n\nIf you think more options is always better why don't you play this game where all heroes are neutral and all cards are neutral, and all traits are renamed to trait, then you can take any heroes with any cards and all the synergy that exists would be huge (you'd probably find you took the same heroes and cards in almost every game though, maybe with a small sideboard of quest specific card substitutions) \n\nI happen to think that having restrictions is essential for a deck-building game, and I struggle to see how you would think otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221954","commentId":1221954,"userName":"MyNeighbourTrololo","timestamp":1408866377,"content":"Nothing currently existing with requirement of printed icons would become imbalanced and reduce the deckbuilding if it were stripped of printed requirement. Nothing. It would increase the potential for multispheres while keeping the same amount of possibilities for monosphere.\n\n \n\nYeah, yeah, you're speaking of a perfect world where this setup time would not do any harm and needed cards flow into the one's hand exactly when he needs them.\n\n \n\nDecent design is Shipwright. He gets +1 WIllpower per printed Spirit hero. He would be more interesting with just Spirit hero, meaning you could affect him dynamically if you're not starting with 3 Spirit heroes, but still he is not that blunt. \"You can only play this card if you got all printed heroes\" is blunt, no matter what you say.\n\n \n\nIf you think that less options are better, why don't you play Hearthstone or some other casual sheet? I bet you'll enjoy the hell out of it. You struggle because you have a closed, barred mind. You compare having a little less restriction for the purpose of potential harmless but enjoyable boost of variety to having all cards being neutral and stuff. Don't bother writing another of your long-ass posts, I'm no longer interested in your opinion on this matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1221989","commentId":1221989,"userName":"Glaurung","timestamp":1408871117,"content":"Printed keyword come after one year if the game when designers understand people start to usr songs and can get any combos wkth any heroes. So then they create printed to limit it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1222283","commentId":1222283,"userName":"MyNeighbourTrololo","timestamp":1408888936,"content":"That's kinda the point of the card game and of songs being created in the first place - to get combos going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1222655","commentId":1222655,"userName":"Glaurung","timestamp":1408904515,"content":"Roto be honest I dont like idea of songs since they destroy idea and neening of spheres. Looks like designers understood that too and come out with printed icon solution which is very fine for me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1222887","commentId":1222887,"userName":"MyNeighbourTrololo","timestamp":1408914034,"content":"They do not destroy the idea - they advance it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1223432","commentId":1223432,"userName":"Glaurung","timestamp":1408942340,"content":"anyway just wonna the admit now the way of game is going well. Before i was really sceptic but now i see Caleb really make a good job. And most of his idea i agree. With songs to. I think songs was mistake at all!  Spheres should be unique in my opinion only exclude like Elrond or Gandlaf or Herluin is ok. But my experience is limited by 1 or 2 players so maybe in 3 4 payers game songs is much more needed.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1224082","commentId":1224082,"userName":"Bullroarer Took","timestamp":1408980226,"content":"I disagree that Songs were a mistake.  Underpriced?  Maybe.  But Songs enable deck building at the cost of diluting your deck.  It's a fair trade I think.  I don't want to play mono-color all the time, and if I want to take a risk and play 4 color that should be my choice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1224170","commentId":1224170,"userName":"MyNeighbourTrololo","timestamp":1408982439,"content":"Funny enough, I never use songs. Multisphere decks I use have some natural \"glue\" right off the bat. But I would consider using them if those effects was not restricted to printed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1224198","commentId":1224198,"userName":"Distractionbeast","timestamp":1408983388,"content":"I almost never use songs, but I love their inclusion in the card pool.  It's the kind of deckbuilding tool that gives options to the player to open new possibilities, especially for newer players or unique combos.  Also, it's a nice way of avoiding Master's Malice.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114378-what-if-term-printed-resourcre-icon-was-nonexistent/?do=findComment&comment=1224251","commentId":1224251,"userName":"alogos","timestamp":1408985298,"content":"Blue Mountain Trader killed the song...\n\nNot entirely, but hard enough."}]}