{"url":"https://community.fantasyflightgames.com/topic/114412-must-either-back/","title":"Must .... either.... back","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/114412-must-either-back/?do=findComment&comment=1219601","commentId":1219601,"userName":"Mndela","timestamp":1408730648,"content":"I have noticed the shadow effect in this card:\n\n \n\nmorgul-sorcerer-tmv.jpg [http://www.cardgamedb.com/forums/uploads/lotr/morgul-sorcerer-tmv.jpg]\n\n \n\nShadow: Defending player must place 1 progress token on To the Tower or treat this attack as undefended.\n\n \n\nAnd i remember the discussion about the 'must' texts. I have tried to search the post but i havent found (impossible with hundreds of threads!). So i open a little deja-vu of it. The question, if i dont bad remember was: if the text has 'must' you must resolve the first part; if you can't, then resolve the second part. If the text has 'must either' you could chose.\n\nOk, so the shadow text here is wrong then: if you cant resolve the first part, you also can't resolve the second part. If you cant resolve the first part... you are dead (remember the objective card in staging all the scenario... when it had 10 progress tokens players lose the game).\n\n \n\nHow about? ideas...\n\nEdited August 22, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114412-must-either-back/?do=findComment&comment=1219758","commentId":1219758,"userName":"alogos","timestamp":1408734145,"content":"Extract from FAQ 1.6\n\n>  \n> \n>  \n> \n> (1.44) “Must X or Y” vs “must either X or Y”\n> If a card instructs a player to perform one task or\n> perform a second task using the structure “... must X or\n> Y...” then the player must attempt to perform the first\n> task, and performs the second task instead only if the\n> first task cannot be performed.\n> If a card instead uses the structure “... must either X or\n> Y...” then the player may choose which task to perform,\n> although one of them must be performed in full, if able.\n\n \n\nI may have been playing this effect wrong, thnaks for pointing it out !\n\n \n\nWait... oh, I see... must been a mistake or either a misprint :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nThey've done it before, so... yeah, grammar is difficult.\n\nEdited August 22, 2014 by alogos"}]}