{"url":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/","title":"Better boxes and inserts","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227359","commentId":1227359,"userName":"ruferto","timestamp":1409113018,"content":"I do not understand why FFG does not bring us better boxes with useful insert like other card games. I would like to store a cycle inside its deluxe expansion, preferably sleeved.\n\n \n\nSome days ago I was watching a video review of Pathfinder and I felt jealous when I saw that amazing box and that great insert. \n\n \n\nI love this game. It's my favorite game, by far. But it's becoming a trouble how I storage it.\n\n \n\nNowadays I have all my cards inside of 3 core boxes, and 1 copy of each of the player cards inside an Upper deck. I use customeeple inserts for the boxes, but this solution it's not the best one. \n\n \n\nPlease FFG guys, I want to spend my money in nice official boxes with useful insert."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227413","commentId":1227413,"userName":"TwiceBorn","timestamp":1409117825,"content":"I support this request."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227483","commentId":1227483,"userName":"gandalfDK","timestamp":1409124326,"content":"Yeah, me too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227490","commentId":1227490,"userName":"Isfret","timestamp":1409124809,"content":"I would also love to see some better storage options. Great idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227728","commentId":1227728,"userName":"Eldainorn","timestamp":1409141175,"content":"Everyone would love this, but it's never gonna happen. x)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227756","commentId":1227756,"userName":"deeth82","timestamp":1409142126,"content":"Yeah, right now all of my cards are sleeved inside of Ultra Pro deck boxes and crammed into a 20\" toolbox.  It's definitely a nice, durable storage method, but as far as theme goes, it looks atrocious.  I feel like I might as well let my god-daughter draw all over it in white-out.  It would really be cool if they released a thematic box made of tougher storage material.  That being said, I've been blown away by the level of creativity and commitment of some of the members here...there are some absolutely gorgeous storage solutions posted here and on the Geek!  Those folks should make a second job out of creating thematic game boxes (if they have the time)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1227797","commentId":1227797,"userName":"raven614","timestamp":1409143762,"content":"I throw all my boxes away. They are good for nothing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1229838","commentId":1229838,"userName":"joezim007","timestamp":1409191639,"content":"As much as I enjoy the idea of having official storage solutions, I can see some good reasons why they'd be reluctant to create better storage solutions:\n\n \n\n1) It's not very common. Name 5 TCGs that come with awesome storage solutions immediately. Selling card sleeves and deck boxes is very common among card game producers, so obviously they'd do those, but storage boxes are very very far from universal.\n\n2) It adds an expense to the boxes. I think this card game costs plenty enough as it is and if they raised the cost even 1 more dollar, it could drop sales.\n\n3) Do what you're good at. Why do card storage solutions if you're not good at it?\n\n4) Third parties ARE good at it and they do some amazing work. Many people would be drawn to these custom third party solutions which would waste the storage solutions built into the FFG boxes. Also, this can help stimulate a 3rd party economy that also ends up advertising for your game.\n\n5) Many people use binders. I mean MANY. Some people might prefer a different box. Some people might damage their box and therefore need a new box but not be willing to buy another copy of the set. Most, people just have differing opinions about how they want to store their cards, therefore that's a lot more wasted cardboard.\n\n \n\nIf FFG had the resources, it might be cool if they designed and sold storage solutions that you could buy separately, but due to the reasons above, I don't think it's a great move for FFG to build storage into their core/deluxe/saga boxes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1230410","commentId":1230410,"userName":"ruferto","timestamp":1409198349,"content":"joezim007, I agree with you in part. \n\n \n\nHowever:\n\n1 & 2) Magic, Dominion, Pathfinder, Marvel Legendary and Sentinels of the Multiverse. Magic has two specific products named Fat Packs and Gift boxes which provide a good storage solution. It's not necessary an expensive insert, just a taller box and/or a cheap insert (Sentinels of the Multiverse box is a perfect example)\n\n3, 4) FFG is launching tons of cards every year, so I think they should provide a solution to storage these cards. If they want to be focused designing games, not problem, they could to license their games to a third-party\n\n \n\nThey don't need a big change to provide a solution, taller boxes and a better cardboard insert. \n\nEdited August 28, 2014 by ruferto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1232541","commentId":1232541,"userName":"deeth82","timestamp":1409227643,"content":"> If FFG had the resources, it might be cool if they designed and sold storage solutions that you could buy separately, but due to the reasons above, I don't think it's a great move for FFG to build storage into their core/deluxe/saga boxes.\n\nGood points above.  I'm thinking you're right, as far as the base card sets go.  However, they could probably release a separate collector's box for each card series through their Fantasy Flight Collector line at a higher markup to offset production cost, and that might work!\n\nLike raven614, I toss all of my old boxes, save for the base set, and although I did see a cool DIY Dice Tray idea on the Geek which could make use of some of those deluxe expansion boxes, it's tough to justify keeping them around with limited space.  I can definitely appreciate that folks with room to spare would keep them and do some DIY organizational fixes on them...what better thematic way to keep all of the major expansions separate!\n\nEdited August 28, 2014 by deeth82"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1234321","commentId":1234321,"userName":"Caerdowyn","timestamp":1409237338,"content":"I put all my player cards in ye olde map of cards and keep the adventures in the core box (I have a spare for future use).\n\nPlayer decks go in their respective olde box of sleeves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1235443","commentId":1235443,"userName":"Raven1015","timestamp":1409246361,"content":"Just as a comparison, I picked up Doomtown: Reloaded at Gen Con, which essentially serves as a \"Core Set\" for an expandable card game line. It comes with 286 cards (compared to 226 for LOTR core), a bunch of cardboard tokens and 2 player boards. And for the same price as the LOTR Core, it includes a simple but awesome plastic insert that can hold a ton more cards. I'm not sure why FFG couldn't do the same. To be clear, it wouldn't satisfy those who want aesthetically pleasing storage solutions, but providing something functional is better than a bunch of wasted space in the box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114916-better-boxes-and-inserts/?do=findComment&comment=1235481","commentId":1235481,"userName":"raven614","timestamp":1409247144,"content":"> Right on bro Raven. Thunderstone another example of a plastic insert to hold the cards. What do you think is doom town?\n\nRight on bro Raven. Thunderstone another example of a game that has a plastic insert to hold the cards. What do you think of doom town? Edited August 28, 2014 by raven614"}]}