{"url":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/","title":"Hummerhorns &amp; Dol Guldur Orcs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/?do=findComment&comment=1227894","commentId":1227894,"userName":"jimjim19681968","timestamp":1409147603,"content":"As I play through the game, questions are constantly arising. Many thanks to the folks here who answer my queries and set me straight. It is an amazing game.\n\n \n\nOk, Hummerhorns. Forced: After Hummerhorns engages you, deal 5 damage to a single hero you control.\n\n \n\nDo shields come into play in this instance, thus reducing the damage received, or is it a straight 5 damage?\n\n \n\nIt will kill most any hero. Can this be true? Is there a way to avoid losing a hero this way?\n\n \n\nAfter I lose a hero I generally fold the game. I don't know if I should continue, as I seem certain to lose with just 2 heroes remaining.\n\n \n\nA similar question with Dol Guldur Orcs \"When revealed: The first player chooses 1 character currently committed to a quest. Deal 2 damage to that character\" Do the shield apply, thus reducing the damage?\n\n \n\nMany thanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/?do=findComment&comment=1227930","commentId":1227930,"userName":"alogos","timestamp":1409148728,"content":"Defense is only taken into consideration when resolving attack damage.\n\nAnytime else, it does nothing.\n\n \n\nYou can ignore them, their engagement cost is high. But you can also kill them with different player cards. Dunhere, Gandalf... etc..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/?do=findComment&comment=1227931","commentId":1227931,"userName":"CJMatos","timestamp":1409148785,"content":"In both cases, it is a direct damage.\n\n \n\n \n\nThe shield (defense stat) only applies on the normal combat.\n\n \n\n \n\nThere are some ways to avoid losing a hero for Hummerhorns. The most common is using Gandalf action to deal damage (direct damage also), either by playing him or through Sneak Attack"},{"commentUrl":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/?do=findComment&comment=1227941","commentId":1227941,"userName":"jimjim19681968","timestamp":1409149086,"content":"Many thanks for resolving this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/114962-hummerhorns-dol-guldur-orcs/?do=findComment&comment=1228650","commentId":1228650,"userName":"TwiceBorn","timestamp":1409170676,"content":"If you have a Tactics hero in your deck, you could also play Citadel Plate  on a hero ((if it comes in your hand and you can afford it) in a round prior to the Hummerhorns being revealed by the deck. If you put it on the right hero and are unable to make use of the suggestions provided by the previous posters, then the hero with Citadel Plate might be able to soak up all the damage and still live. Citadel Plate gives a hero +4 hit points."}]}