{"url":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/","title":"Moving resources freely","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236580","commentId":1236580,"userName":"Olorin93","timestamp":1409296161,"content":"Blue Mountain Trader is insane. I started including 2 copies in my deck the game session before last, and once my 3 multiplayer friends understood the mechanic, he went all over the table until everyone had gathered resources on the heroes they wanted. Now we're a bit tired of passing him around, so we just say that if he is in play and another player has at least one resource (which most should in the resource phase) you can move resources between your heroes at will.\n\nI think he changes the way you spend resources, because as long as he's there, a leadership resource can always become a tactics resource and vice versa. Thoughts?\n\nEdit: I thought Harbor Master was going to have his big break, but apparently there's a difference between moving and adding resources\n\nEdited August 29, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236594","commentId":1236594,"userName":"MyNeighbourTrololo","timestamp":1409296710,"content":"What kind of thoughts do you want? This was discussed all over many times before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236664","commentId":1236664,"userName":"FetaCheese","timestamp":1409301778,"content":"The only question is why the card is not more popular than it I currently is. People just haven't caught on yet, but he is broken in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236670","commentId":1236670,"userName":"alogos","timestamp":1409302371,"content":"It helps me promote my thread every time a thread like this pop up ^^\n\nhttp://boardgamegeek.com/thread/1197856/blue-mountain-trader-what-can-he-do-you [http://boardgamegeek.com/thread/1197856/blue-mountain-trader-what-can-he-do-you]\n\n \n\nEdit : people don't find him powerful because a lot of players play solo\n\nEdited August 29, 2014 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236685","commentId":1236685,"userName":"FetaCheese","timestamp":1409304681,"content":"Playing a soldier of fortune Trader must be the funniest thing ever. Nice idea.\n\nAnd yeah since he is a multiplayer card essentially, it makes sense. Still OP imo but not completely broken maybe?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236693","commentId":1236693,"userName":"alogos","timestamp":1409305855,"content":"That with doomed cards, and strangely, desesperate alliance, yes, broken... the whole package. You can limit yourself if you want. But I have played with 4 doomed dwarf deck long enough to know that you can quest for ~40 turn 1 to ~90 turn 3 easily (while being able to tank/oneshot all mobs...) I didn't come back on the outlands / boromir / loragorn reset, but it is less fun to play.\n\n \n\nWhen you tell everybody that you have unexpected courage and no one wants it, you'll realize that, maybe, something went wrong somewhere..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236805","commentId":1236805,"userName":"FetaCheese","timestamp":1409314268,"content":"Interesting. Do you have a deck list handy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236852","commentId":1236852,"userName":"alogos","timestamp":1409316509,"content":"Well, I'm making a new one. Just pile up 3 we are not iddle, lure of moria, deep knowledge, daeron runes, galadrim's greeting, campfire tale, desesperate alliance 2 heir of numenor, that's 23 cards already for each deck, add a lot of 1-2 cost dwarf (do not use filli killi, they are bad in this case).\n\nFirst player need 3 blue mountain trader, durin's legacy and Nori. (you don't need tactics, but thalin and gimli will give you more ressource with we are not idle). Start the game with a lot of card draw, first player need to draw 1 blue mountain and durin's legacy. Put it on Nori and with 1 or 2 heir, you can play a lot of dwarf. Other player can send you 3 with we are not iddle if they also have 3 dwarf hero. You need to draw 1 desesperate alliance by playing allies, using we are not iddle/lure of moria the more efficiently possible for all player. Then, use desesperate alliance on Nori/Legacy to second player.\n\nRepeat.\n\nEnd the first planning phase with at least 7 dwarf allies in play per player. If you missed, you are either really unlucky or you did something bad. Do not fear to go to the 46-49 threat area to draw the durin's legacy, when you pass around nori/legacy, you lower your threat a lot, and all people have galadrim's greeting, and even if you are at 40, you'll end the scenario in less than 3 turn..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1236983","commentId":1236983,"userName":"Glaurung","timestamp":1409321728,"content":"Ha ha sounds cool. Unlimited draw as usuall kill the game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120588-moving-resources-freely/?do=findComment&comment=1237076","commentId":1237076,"userName":"Raven1015","timestamp":1409325543,"content":"For the curious, I ran a poll over on Tales when the Trader came out as to whether it should receive errata or not. Here were the results:\n\n \n\n62% said yes, it should receive errata (63 votes)\n\n21% said \"i don't care\" (21 votes)\n\n18% said no, it should not receive errata (18 votes)\n\nEdited August 29, 2014 by Raven1015"}]}