{"url":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/","title":"Campaign Mode for Old Forest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/?do=findComment&comment=1240061","commentId":1240061,"userName":"PsychoRocka","timestamp":1409472381,"content":"Has anyone actually tried Old Forest in campaign mode yet?\n\nI imagine it would be a little different with Frodo also present and able to lend his willpower or attack each round as well as the rings ability to cancel an encounter card, shuffle it back into the encounter deck and draw a new one!\n\n \n\nAlso you would at this point have either Gandalfs Delay or The Ring Draws them included as well as Mr. Underhill (may help alot against Old Man Willow as an additional feint effect) or Gildor Inglorion.\n\n \n\nI should be getting my copy in the mail in the next week or so and was just curious if anyones tried this yet and what it was like, much easier? more or less the same? much more fun??\n\n \n\nAlso as a sidenote it looks as though the boon card you can earn in The Barrow Downs is Tom Bombadil related and cancels a when revealed effect. This means you can have an extra test of will type effect every game for the rest of the campaign so long as you earn this boon... I wonder what it's exact wording is and precisely how it functions (seems like it will have a player back and be shuffled into your deck)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/?do=findComment&comment=1241238","commentId":1241238,"userName":"Jackelantern","timestamp":1409540876,"content":"Just curious, how did you go about getting a copy sent to you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/?do=findComment&comment=1241550","commentId":1241550,"userName":"Estel Edain","timestamp":1409557079,"content":"I think the wording for the \"Ho! Tom Bombadil!\" boon (our first event boon) is likely:\n\n \n\nSetup: The first player adds this card to his hand.\n\n \n\nResponse: Add this card to the victory display\n\nand remove it from the campaign pool to cancel\n\nthe \"when revealed\" effect of a treachery that was\n\njust revealed from the encounter deck.\n\nVictory 1\n\n \n\nIt might be card instead of treachery. We've seen remove from the campaign pool before, with Phial of Galadriel (look at The Grey Company podcast on facebook for Gencon spoilers if you haven't seen it yet). I think this is a great and thematic idea. One of the dangers with boons, especially those with the Setup keyword, is that the players will be incredibly powerful by the end of the campaign. (The opposite is also true: if there are many burdens with surge that the players can't avoid adding the campaign pool, the encounter deck might overpower the players before they get going.) Ho! Tom Bombadil! is powerful because it's free and you don't have to wait to draw it, but you only get to use it once in the entire campaign. (As a thematic player, I want to use it during Fog on the Barrow Downs, and I want to use Phial of Galadriel against Shelob.) Old Bogey-stories, the boon from The Old Forest, will have a more significant impact on the campaign because it's a Setup card that can be used every game to provide a nice benefit. (If you didn't take Gandalf's Delay as a burden, you can mulligan after playing the best card in your hand.)\n\n \n\nI think the designers are aware of these dangers, and trying to avoid them. That's why Mithril Shirt and Glamdring each cost resources, whereas they were free when they were treasures in The Hobbit expansions. Especially if we're required to have a 50-card minimum deck without counting boons, the designers can give us many boons in one box (the key items received in Rivendell and Lorien), without making the players too powerful. Also for burdens, we've seen in Flight to the Ford that it's possible to minimize adding burdens to the campaign pool, but at a cost. Based on the spoiled Council of Elrond quest card, the decision to shuffle Lust of the Ring into the encounter deck may also add it to the campaign pool. This provides fun, tough choices for players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/?do=findComment&comment=1241621","commentId":1241621,"userName":"PsychoRocka","timestamp":1409561262,"content":"> Just curious, how did you go about getting a copy sent to you?\n\nBought off someone on ebay.\n\n \n\nYou look to be correct Estel Edain! Very good analysis of boons and burdens as well. As unthematic as it may be I will probably hang onto the ability to call Tom Bombadil for help until later in the campaign when I really need it and as good as Phial of Galadriel may be against Shelob it may be ten times more useful in say a quest based on say the Battle for Helms Deep or the Battle of Pellenor Fields where you are engaged with many more foes.\n\nDefinitely alot to look forward to boon and burden wise, cannot wait to add to my campaign pool with these various goodies!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120776-campaign-mode-for-old-forest/?do=findComment&comment=1254432","commentId":1254432,"userName":"PsychoRocka","timestamp":1410219333,"content":"Played this in Campaign mode last night. Took three attempts to win it!! Used old bogey stories with my spirit/lore deck to get a hand with both Northern Tracker and Asfaloth in it. Didn't actually use the ring once (very very rarely remember I can use the ring during campaign mode and even when aware of it very rarely use it) but was adding Frodo to questing almost every turn. Also never used Mr Underhill as I could always defend the lesser enemies and Old Man Willow is immune to player card effects so you cannot use Mr Underhill OR Feint against him....\n\nThreated out the two times I lost (from treacheries right before getting to stage 3 the first attempt and then while battling Old Man Willow due to his threat raise effect when he attacks the second attempt) and was on 43 and 46 threat for my two decks on the third attempt when I won so it was bloody close. Old Man Willow is actually one nasty boss as hes immune to player cards so cannot be feinted, rivendell blade has no effect etc. Plus he attacks EACH player not just the first and raises the defending players threat by 1-3 every time he attacks (can potentially be 4 in a four player game). You can easily be defeated by the threat gain alone if you take too many attacks from him and can't clear stage 3 fast enough.\n\nI put 15 damage tokens on him the time I won earning Old Bogey Stories and adding it to my campaign pool."}]}