{"url":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/","title":"An idea for a future player card theme (Caleb read this!)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240012","commentId":1240012,"userName":"Gizlivadi","timestamp":1409468617,"content":"So just to be clear, I have already posted something like this in the Ring-bearer's Trials thread, about how I would like to see more Istari cards as well as more magical artifacts such as magic rings, Palantiri, and spells. However, this idea has evolved in my mind to some pretty specific ideas, and knowing for sure that Caleb and Matt read the forums, I thought they deserved their own thread.\n\n \n\nSo basically, I was thinking that it would be awesome to see more of this wizard stuff in a future cycle. Namely, more Istari allies (Alatar and Pallando, copyright premitting), more Palantiri, and magic rings. Now, regarding the Palantiri, I'm basing my ideas on this [http://tolkiengateway.net/wiki/Palant%C3%ADri] article, from which I could gather that at the time our game takes place, only three palantiri are remaining in control of the Free-Peoples: the Palantir of Orthanc, the Palantir of Minas Tirith, and the Palantir of Elostirion. I've already said in the past that I hate the generic Palantir card we got in the ATS cycle, and that it would be awesome if we got these artifacts by their specific name and each having a unique ability. The Palantir of Elostirion (which by the way is located pretty close to Arnor and the general region we'll visit in the next cycle) was used to catch glimpses of Valinor since it could only look that way. Inspired by the Light of Valinor attachment and how it grants the ability to not exhaust to commit a character to the quest, maybe this Palantir could do something similar? For a cost, you could give the ability to someone to not exhaust to quest. But that's just one example. The other two Palantiri, of course, or at least the Orthanc one, should work with the Doomed mechanic to be really thematic.\n\n \n\nAs for rings, I would be happy if we just got a single neutral lesser ring [http://tolkiengateway.net/wiki/Lesser_rings] attachment that gives a minor benefit like resource acceleration or a stat boost. Something not too powerful but useful enough that would also cover all the lesser rings the elven-smith made, as well as other magic rings there could be lying around in Middle Earth, that are not the Rings of Power themselves. \n\n \n\nAs for spells, we already have a few of those, but I was thinking of something rather extreme. I know we're getting a Gandalf hero soon, but I was thinking of the possibility to turn ANY wizard into a hero, I'm thinking of a neutral spell event called something like \"Wizard Revealed\", which would target both an Istari ally in play under your control and a hero you control. You discard the hero, and the chosen Istari becomes now a hero, gaining the sphere icon of the sacrificed hero and collects resources each round. This hero cannot leave play except by combat of encounter effects. The reason it wouldn't just lose his ability is to make Radagast more playable to compensate for his stats, and since the other wizards only have enters play effects, they would do basically nothing except have excellent stats. \n\n \n\nThis is just an idea though, and I do realize this event would be very hard to implement to the player card pool. The reason I made this thread is just to be sure Caleb is aware that these artifacts and wizards exist (I do think he is), and that they would be awesome to have in the game specifically. Not to mention it would expand the neutral player card pool and the lore of Middle Earth to great extent. I think it's shame we'll not see this kind of wizardly stuff in the Isengard/Ost-in-edhil cycle, but maybe we could see them in the next one, or if they ever make a cycle focused on the Blue Wizards.\n\n \n\nAnyway, what do you think of this? This is a personal favorite theme of mine, but of course if we were to see it others should have to be interested in it as well. Would you like to see this kind of stuff in the game? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240070","commentId":1240070,"userName":"MyNeighbourTrololo","timestamp":1409472900,"content":"I'm afraid, they already got everything planned far, far ahead. And they would not listen to a single customer anyway. They don't listen to multiple ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240093","commentId":1240093,"userName":"Jekzer","timestamp":1409475157,"content":"But they can read that, nonetheless. And if the answer is no, at least is a cool idea :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] . Maybe they have plans for part of that on the pipeline for a future cycle.\n\n \n\nThe idea of spells is something that intrigues me, VoI introduced some spells, TRD will introduce at least one more. A spell deck, prominently used by Istari is a cool idea, like a heavy event deck (there are attachment heavy decks for Aragorn, etc)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240605","commentId":1240605,"userName":"Gizlivadi","timestamp":1409505040,"content":"Even though they already have everything planned, the future cycles are still in the concept phase, and we know they have changed stuff even just before release. And while they don't necessarily do whatever the customers ask, they do read the forums for ideas and suggestions. \n\n \n\nA specific spell or wizard deck might be hard to implement. My ideas are more of a general lineup of wizard-related cards that could go in any deck (that was the intent of the Palantir card I think). I just think it's a **** shame that in the Ring-friggin-maker cycle we haven't got anything related to spells or magic rings besides Nenya (which is more to complement the silvan deck anyway). Add to my previous list a wizard's ring attachment, and I'd be happy. I still have hope that we'll see that in the last AP, for we can safely assume that Saruman wants to make a ring of his own using the secrets of the forge. It would be a shame if we didn't get said ring as an attachment in the Antlered Crown. Same thing for the lesser ring.\n\n \n\nAs for palantiri, I hope they realized the huge disaster that the previous palantir card was, and hopefully they'll make the three palantiri in due time and make them playable.To be honest I was appalled when I saw that AoO article, they did such a big disservice to such powerful artifacts by making it a passing generic card, and a terrible one at that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240650","commentId":1240650,"userName":"MyNeighbourTrololo","timestamp":1409507702,"content":"Palantir card was a disaster? Dude, you've just made your gaming insight value very questionable. Extremely.\n\nEdited August 31, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240660","commentId":1240660,"userName":"Gizlivadi","timestamp":1409508195,"content":"Then so be it. I stand by my opinion that the card is pretty bad. Not only mechanic-wise, but theme-wise as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240690","commentId":1240690,"userName":"MyNeighbourTrololo","timestamp":1409509563,"content":"Then I feel really sorry for you. Really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240709","commentId":1240709,"userName":"danpoage","timestamp":1409510867,"content":"Care to post a deck that uses The Palantir to good effect? I have yet to see one, and my curiosity is piqued."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240711","commentId":1240711,"userName":"MyNeighbourTrololo","timestamp":1409511113,"content":"http://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/ [https://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/]\n\n \n\nKnowing what to expect from encounter deck is a very strong tool, which provides a perfect planning of questing phase and as a result - smooth gameplay experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240712","commentId":1240712,"userName":"Gizlivadi","timestamp":1409511127,"content":"If you presented me some arguments to convince me that the Palantir is a good card, or at least not bad, I might be able to reconsider. I still think that the card is dissapointing theme wise in that it's generic. There were originally 7 seeing stones, each of them with specific roles and characteristics. At the time of our game there were only three remaining, which makes each of them even more specific. The Elostirion-stone, for instance, could only look in the direction of Aman, to the Master Stone, so it doesn't make sense in that case that \"using the Palantír is a path that renders them perilously vulnerable to the Dark Lord’s attention and influence.\" Sauron could not influence that stone, so it shouldn't have such an ability. The Orthanc and the Anor stone work this way, but if in the very next cyle we were going to see the Doomed mechaninc to represent such risks, why waste the opportunity with this card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240765","commentId":1240765,"userName":"Gizlivadi","timestamp":1409513341,"content":"> http://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/ [https://community.fantasyflightgames.com/index.php?/topic/113888-ultimate-support-deck/]\n> \n>  \n> \n> Knowing what to expect from encounter deck is a very strong tool, which provides a perfect planning of questing phase and as a result - smooth gameplay experience.\n\n \n\nOk, so a scrying support deck. Fair enough. I personally don't care unless you could implement this in solo play, but your point is well taken. However, it still doesn't really change my opinion, and my previous point still stands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240770","commentId":1240770,"userName":"danpoage","timestamp":1409513578,"content":"Interesting, I really like the ideas going on in this deck. I must admit that I do not use Desperate Alliance with Loragorn as I think that this combo should not be legal. I understand why they ruled the per game limits the way that they did, but Lore Aragorn's reset is just too powerful when each player can trigger it. I'm sure I'll get arguments on this, but allowing each player to reset to their starting threat, without even including Aragorn as their starting hero, breaks the game. Still, it is a very cool deck, and I do appreciate the details that take advantage of the power of Palantir (e.g. Minas Tirith Lampwright). In general, I think that cards like the Lampwright are massively underrated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240806","commentId":1240806,"userName":"MyNeighbourTrololo","timestamp":1409515426,"content":"Some cards are just not fit for solo. Get over it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240962","commentId":1240962,"userName":"Glaurung","timestamp":1409522782,"content":"Palantir is crap! Even if you can make some deck around it is still very bad card. Actually Palantir is really powerful artefact in the book but FFG make that card very bad! I know there is a way to use it but still most of the players don't like it and I'm among them! \n\n \n\nAnyway i would like to see some Wizard cards in the future and I'm pretty sure FFG can start with fixing Radagast.....Radagast is also very stupid card,  almost  totally unplayable at the moment. Why we cannot get some new version of him or add some cards for him (attachments or events) to bring him to some new level? I will be happy for sure!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240985","commentId":1240985,"userName":"Gizlivadi","timestamp":1409524118,"content":"Good point, Glaurung. A new version of Radagast would certainly be good. Not that he's bad per se, I actually like him in an eagle deck, but his stats are really underwhelming. Also, more attachments and events related to each wizard would be good as well, and we have some already (Radagast's Cunning, Wizard's Voice, Flame of Anor). I think that the fact that half of the wizard allies last for only one turn doesn't really allow for attachments that can be played on the wizards, but that's fine IMO. What I'd like to see is attachments that maybe require a wizard to be in play to play them, but that you attach to heroes or allies, such as the lesser rings and the Palantiri. Now if they wanted to fix Radagast a good way to start would be attachments and events that deal directly with him since he is pretty much the only wizard ally that you can safely keep in play, but I think that it could be a little unbalanced aganist the other Istari (only getting Radagast attachments and such). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1240991","commentId":1240991,"userName":"Kerstoid","timestamp":1409524369,"content":"> Palantir is crap! Even if you can make some deck around it is still very bad card. Actually Palantir is really powerful artefact in the book but FFG make that card very bad! I know there is a way to use it but still most of the players don't like it and I'm among them! \n\n \n\nIf the Palantir is crap, then it is a thematic home run, because the palantir IS crap!  In the books, every time someone looks into a palantir, they draw the wrong conclusions about what they see and do something stupid.  Saruman saw Barad-dûr and fell into darkness, Denethor did the same, and even Sauron blew it thinking he'd seen the Halflings with the Ring in the mystical orb.  The palantir offers the promise of certain knowledge, but the heroes in Tolkien's work (Gandalf, Aragorn, Frodo, et al) are those who make choices and act without certain knowledge.  The palantir is a temptation that the weak clamor for.  In this respect, I believe the Palantir card is perfect.  It looked so good at first blush.  Then I used it.  Then I died.  Just like those who were seduced by it in the novel.  That was really fun for me.  Now the Palantir sits tucked away in my binder never to be touched, just like the palantíri of Orthanc and Minas Tirith should have in Middle-earth.\n\n \n\n> So just to be clear, I have already posted something like this in the Ring-bearer's Trials thread, about how I would like to see more Istari cards as well as more magical artifacts such as magic rings, Palantiri, and spells...\n> \n>  \n> \n> I think it's shame we'll not see this kind of wizardly stuff in the Isengard/Ost-in-edhil cycle, but maybe we could see them in the next one, or if they ever make a cycle focused on the Blue Wizards.\n> \n>  \n> \n> Anyway, what do you think of this? This is a personal favorite theme of mine, but of course if we were to see it others should have to be interested in it as well. Would you like to see this kind of stuff in the game? \n\n \n\nAs for future cards depicting other mystical artifacts, I like the idea, but think they should follow the same pattern.  Direct magic and power is always a temptation in Tolkien's world.  We want it to defeat the shadow, and yet, if we get it and use it, the results are usually deadly.  The Blue Wizards have a shifting legacy in the lore (depending on which fragment of Tolkien's notes about them you read) and so I think they are ripe for a open-ended treatment in the game.  I do wonder, however, exactly what Tolkien works FFG's licensing rights include, however, because unless they've got Unfinished Tales, there is nothing they can do for the Blues except acknowledge they exist and then forget about it (as Jackson did in the first Hobbit film)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1241008","commentId":1241008,"userName":"Gizlivadi","timestamp":1409524983,"content":"Just because some of the characters in the books misused the palantiri doesn't mean they cannot be used to good effect. Why would they even make them in them first place if they were meant to be crap? This applies to both the palantiri as objects and as cards. Following your logic that the Palantir is supposed to be bad, the article that previewed it should have said \"Never use it! It's just a waste of cardboard!\" I get that the palantiri in the books were artifacts that brought great risks and temptation towards evil, but I thnk it's very naive and a little dumb to think that because of that they should be bad cards. Some characters like those with Numenorean blood, should be able to use them wisely and effectively, and that should be represented in the game. We even know that Saruman used it wisely at first, and then he fell into evil. They shouldn't be just plain \"bad\" cards IMO. That would be very bad design, and I'm sure it wasn't the original intention of the card. To quote the article in which it was previewed:\n\n \n\n\"To those who could master them, they would allow far-sight and communication across great distances.\"\n\n \n\n\"Palantír can provide players with tremendous power to confront the Shadow in Assault on Osgiliath, but using the Palantír is a path that renders them perilously vulnerable to the Dark Lord’s attention and influence.\"\n\n \n\nWe certainly got the risk and vulnerability part, but we got none of the rest. Do you think that from the beggining the Palantir was supposed to be a terrible card with all risk and no power? No, of course, not, or they would not have written about it's power. I think it is just a failed card that turned out to be worse than expected. Like most of the player cards in the Against the Shadow cycle besides Outlands and the Gondorian shield.\n\n \n\nNow to speculate for a bit, we haven't seen an attachment with Doomed yet. The perfect candidate would be the Orthanc-stone, and this being the Doomed cycle, I hope we get to see it in one of the remaining Ring-maker AP's.\n\nEdited August 31, 2014 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1241043","commentId":1241043,"userName":"Glaurung","timestamp":1409526005,"content":">  \n> \n> > Palantir is crap! Even if you can make some deck around it is still very bad card. Actually Palantir is really powerful artefact in the book but FFG make that card very bad! I know there is a way to use it but still most of the players don't like it and I'm among them! \n> \n>  \n> \n> If the Palantir is crap, then it is a thematic home run, because the palantir IS crap!  In the books, every time someone looks into a palantir, they draw the wrong conclusions about what they see and do something stupid.  Saruman saw Barad-dûr and fell into darkness, Denethor did the same, and even Sauron blew it thinking he'd seen the Halflings with the Ring in the mystical orb.  The palantir offers the promise of certain knowledge, but the heroes in Tolkien's work (Gandalf, Aragorn, Frodo, et al) are those who make choices and act without certain knowledge.  The palantir is a temptation that the weak clamor for.  In this respect, I believe the Palantir card is perfect.  It looked so good at first blush.  Then I used it.  Then I died.  Just like those who were seduced by it in the novel.  That was really fun for me.  Now the Palantir sits tucked away in my binder never to be touched, just like the palantíri of Orthanc and Minas Tirith should have in Middle-earth.\n> \n>  \n> \n> > So just to be clear, I have already posted something like this in the Ring-bearer's Trials thread, about how I would like to see more Istari cards as well as more magical artifacts such as magic rings, Palantiri, and spells...\n> > \n> >  \n> > \n> > I think it's shame we'll not see this kind of wizardly stuff in the Isengard/Ost-in-edhil cycle, but maybe we could see them in the next one, or if they ever make a cycle focused on the Blue Wizards.\n> > \n> >  \n> > \n> > Anyway, what do you think of this? This is a personal favorite theme of mine, but of course if we were to see it others should have to be interested in it as well. Would you like to see this kind of stuff in the game? \n> \n>  \n> \n> As for future cards depicting other mystical artifacts, I like the idea, but think they should follow the same pattern.  Direct magic and power is always a temptation in Tolkien's world.  We want it to defeat the shadow, and yet, if we get it and use it, the results are usually deadly.  The Blue Wizards have a shifting legacy in the lore (depending on which fragment of Tolkien's notes about them you read) and so I think they are ripe for a open-ended treatment in the game.  I do wonder, however, exactly what Tolkien works FFG's licensing rights include, however, because unless they've got Unfinished Tales, there is nothing they can do for the Blues except acknowledge they exist and then forget about it (as Jackson did in the first Hobbit film).\n> \n>  \n\n \n\nhmmmm... yes i agree, thematically you are right about Palantir.......  but still i don't like the way how FFG make that card\n\n \n\nBut your argument is **** Good! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1241159","commentId":1241159,"userName":"FetaCheese","timestamp":1409535199,"content":"How much lore is there for the lands the Blue Wizards visited? Could we have an expansion set beyond the sea of Rhun?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1241467","commentId":1241467,"userName":"Estel Edain","timestamp":1409553649,"content":">  \n> \n> > Palantir is crap! Even if you can make some deck around it is still very bad card. Actually Palantir is really powerful artefact in the book but FFG make that card very bad! I know there is a way to use it but still most of the players don't like it and I'm among them! \n> \n>  \n> \n> If the Palantir is crap, then it is a thematic home run, because the palantir IS crap!  In the books, every time someone looks into a palantir, they draw the wrong conclusions about what they see and do something stupid.  Saruman saw Barad-dûr and fell into darkness, Denethor did the same, and even Sauron blew it thinking he'd seen the Halflings with the Ring in the mystical orb.  The palantir offers the promise of certain knowledge, but the heroes in Tolkien's work (Gandalf, Aragorn, Frodo, et al) are those who make choices and act without certain knowledge.  The palantir is a temptation that the weak clamor for.  In this respect, I believe the Palantir card is perfect.  It looked so good at first blush.  Then I used it.  Then I died.  Just like those who were seduced by it in the novel.  That was really fun for me.  Now the Palantir sits tucked away in my binder never to be touched, just like the palantíri of Orthanc and Minas Tirith should have in Middle-earth.\n> \n>  \n> \n> > So just to be clear, I have already posted something like this in the Ring-bearer's Trials thread, about how I would like to see more Istari cards as well as more magical artifacts such as magic rings, Palantiri, and spells...\n> > \n> >  \n> > \n> > I think it's shame we'll not see this kind of wizardly stuff in the Isengard/Ost-in-edhil cycle, but maybe we could see them in the next one, or if they ever make a cycle focused on the Blue Wizards.\n> > \n> >  \n> > \n> > Anyway, what do you think of this? This is a personal favorite theme of mine, but of course if we were to see it others should have to be interested in it as well. Would you like to see this kind of stuff in the game? \n> \n>  \n> \n> As for future cards depicting other mystical artifacts, I like the idea, but think they should follow the same pattern.  Direct magic and power is always a temptation in Tolkien's world.  We want it to defeat the shadow, and yet, if we get it and use it, the results are usually deadly.  The Blue Wizards have a shifting legacy in the lore (depending on which fragment of Tolkien's notes about them you read) and so I think they are ripe for a open-ended treatment in the game.  I do wonder, however, exactly what Tolkien works FFG's licensing rights include, however, because unless they've got Unfinished Tales, there is nothing they can do for the Blues except acknowledge they exist and then forget about it (as Jackson did in the first Hobbit film).\n> \n>  \n\n \n\nA slight correction for Palantir, thematically: Aragorn looks into the Palantir of Orthanc after Elrond sends word to him about the Paths of the Dead and Halbarad brings him Arwen's banner, the standard of Elendil. He is debating whether to take the Paths of the Dead, and he reveals himself to Sauron as Isildur's heir with Narsil reforged. This might have led Sauron to attack Minas Tirith earlier, but with a smaller force than otherwise (\"The hasty stroke oft goes astray.\")\n\n \n\nGimli is astonished that Aragorn uses the Palantir, but he answers, \"I am the lawful master of the Stone, and I had both the right and the strength to use it, or so I judged. The right cannot be doubted. The strength was enough - barely.\" Aragorn was able to master the Stone, and used it to see the threat of the Corsairs of Umbar. This led him to take the Paths of the Dead and defeat the Corsairs.\n\n \n\nYou're right, Kerstoid, that magic is a temptation in Tolkien's world. The heroes may use it, but sparingly, and it seems to always involve effort on their part. Palantir (the card) requires care to use well, and being repeatedly able to see the top 3 cards of the encounter deck is a unique benefit in the current card pool. I like its design, as something that you probably can't afford to use every turn, but can be used when most critical."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1241575","commentId":1241575,"userName":"richsabre","timestamp":1409558594,"content":"i would like to voice my support for this... 1 thing exists alongside magic in Tolkien's world, as some have already said... subtlety ...and this is something the game shares... in art and design i guess (i mean when you compare it to say warhammer)\n\n \n\nas for how much lore on the blue wizards, well i need to check my unfinished tales, but i know Tolkien changed his mind a few times on whether they were a positive or negative influence on the east, though i believe he settled upon they made a big difference in those areas that affected the war of the ring"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242019","commentId":1242019,"userName":"Mich the One","timestamp":1409585711,"content":"The bottom line is that we are talking about a card game and regardless how you look at it unplayable cards are never good. Is Palantir unplayable? It certainly is underwhelming.\n\n \n\nUsing a Palantir should bring you a huge benefit (reflecting the knwoledge you gain - card draw, encounter reveals, etc.), but at a huge price (hero damage, enormous threat raise). It would be a thematic fit if the card had a very beneficial effect, so that you were very tempted even though the consequences would be a potential disaster.\n\n \n\nAs for the Blue Wizards... so many of us would love to see them come to \"life\" in the LCG. I guess it is because we know so little of them and this would somehow satisfy the craving for the lore. The potential for a grand story is huge with Istaris.\n\n \n\nI cannot remember now, but don't the Blue Wizards originate from Silmarilion? If so, wouldn't there be licensing issues for FFG?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242109","commentId":1242109,"userName":"Raven1015","timestamp":1409590403,"content":">  \n> \n>  \n> \n> I cannot remember now, but don't the Blue Wizards originate from Silmarilion? If so, wouldn't there be licensing issues for FFG?\n\n \n\nThey are only named in Unfinished Tales so they aren't part of the license FFG has. The old Middle Earth CCG got the rights to the names through special permission from the Tolkien Estate, which FFG doesn't have, so far at least. They would have to ask for special permission in the same way. The problem is that since the LOTR movies were released, the Estate is much more hard line about letting any rights away, so I doubt FFG would have any luck. It's unfortunate, as I would love to see the Blue Wizards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242121","commentId":1242121,"userName":"gandalfDK","timestamp":1409590947,"content":"Hoho, just a smartassnote: their origins and who they are and to which Vala they belong is explained in the Silmarillion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242128","commentId":1242128,"userName":"Raven1015","timestamp":1409591172,"content":"> Hoho, just a smartassnote: their origins and who they are and to which Vala they belong is explained in the Silmarillion.\n\n \n\nTrue, but the actual names Allatar and Pallando, which they would need for a card, are only in Unfinished Tales.\n\n \n\nIf they wanted to fudge around that and try to refer to them using Silmarillion info, that's still out of bounds. FFG only has rights to stuff in LOTR and Hobbit.\n\nEdited September 1, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242136","commentId":1242136,"userName":"MyNeighbourTrololo","timestamp":1409591518,"content":"Well, they always can invent their own wizards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242145","commentId":1242145,"userName":"Raven1015","timestamp":1409591791,"content":"Yeah, I would be ok with that. I'm not sure how others would feel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/120772-an-idea-for-a-future-player-card-theme-caleb-read-this/?do=findComment&comment=1242151","commentId":1242151,"userName":"Gizlivadi","timestamp":1409591989,"content":"@MichtheOne, you expressed my thoughts better than I could. While it's true that the palantir was tempting and most of the time it brought ruin, it wasn't tempting for nothing. It was tempting because it COULD bring great power at a great risk. The reason these characters were tempted to use it was because it brought big benefits at a price. And the current Palantir card is just unplayable for the most part. The price its ability has is just too high and the risk too certain compared to the potential benefit it could bring. Not that seeing the first 3 cards of the encounter deck and possibly draw a card or two is bad per se, but the cost for that is too high IMO. Looking at it, if it let you draw 2 cards for each type guessed right, it would be pretty good. But raising my threat in most cases by 4 and exhausting a hero to see the top 3 cards and maybe draw a card? No thanks.\n\nEdited September 1, 2014 by Gizlivadi"}]}