{"url":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/","title":"Peril in Pelargir question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1244901","commentId":1244901,"userName":"JasonRed3","timestamp":1409714054,"content":"I have a question about the timing of the Harbor Thug's Forced ability.\n\n \n\nIf the second player has Alcaron's Scroll attached to a hero, and there is a Harbor Thug attacking the first player (Shadow card dealt, actions happening) and an action is played which has Doomed on it... what happens?\n\n \n\nDoes the Harbor Thug:\n\n \n\na. engage the second player, discarding the dealt Shadow Card.\n\nb. engage the second player, discarding the dealt Shadow Card, then receives a new one and proceeds to attack when enemies attack the second player.\n\nc. engage the second player, keeping the dealt Shadow Card and attacks when the second player's enemies attack.\n\nd. heal Beorn.\n\n \n\nAs tempting as d. is... what's the real answer, or is there another possibility?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1244903","commentId":1244903,"userName":"JasonRed3","timestamp":1409714124,"content":"Follow up - if the second player's threat goes up AFTER the Harbor Thug has completed his attack against the First Player... does that change anything?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1244925","commentId":1244925,"userName":"PsychoRocka","timestamp":1409715072,"content":"Pretty sure C but would need to have a proper look at engagement/shadow rules to confirm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1244999","commentId":1244999,"userName":"GrandSpleen","timestamp":1409718073,"content":"There's a bit in the FAQ that will help:\n\n \n\n(1.32) Mid-Attack Control or Engagement Change\n\nIf a card involved in combat changes control, is\n\nreturned to the staging area, or engages another player\n\nduring the resolution of an attack, that attack still\n\nresolves with the card still participating from its new\n\nstate.\n\n \n\nSo looks like your C is the correct answer.  The Harbor Thug will continue its attack against the same character even though it engaged the other player, and I guess he'll attack the second player when his turn comes.\n\n \n\nIf the second player's threat goes up after the attack has finished resolving, I don't think anything would change... If the threat goes up after the second player has finished resolving his own enemy attacks, then he would not need to be attacked by Harbor Thug.\n\nEdited September 3, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1245018","commentId":1245018,"userName":"JasonRed3","timestamp":1409718949,"content":"Thanks guys...\n\n \n\nSo if the change happens after they are dealt shadow cards, but before the first player's enemy attacks happen... then he would just join the second player's enemies, essentially C again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121037-peril-in-pelargir-question/?do=findComment&comment=1245049","commentId":1245049,"userName":"GrandSpleen","timestamp":1409720369,"content":"yup"}]}