{"url":"https://community.fantasyflightgames.com/topic/121385-errata-card-reprints/","title":"Errata Card Reprints","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121385-errata-card-reprints/?do=findComment&comment=1251883","commentId":1251883,"userName":"Sauron","timestamp":1410061208,"content":"Have any of the sets been reprinted with the changes to the text on those cards listed in the Errata section of the FAQ?\n\n(Likewise, have any of the older scenarios been reprinted with a \"gold difficulty indicator\" on those encounter cards listed in the \"Easy Mode Rules.\")"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121385-errata-card-reprints/?do=findComment&comment=1252006","commentId":1252006,"userName":"Glaurung","timestamp":1410071107,"content":"Hey man your nick is something. You dare to take HIS name!!! I see it first time actually. Will see how you will act!\n\nAs I know for now there is not much reprinted errated cards. For easy mode info should to be some sheet about every old quest on ffg support page"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121385-errata-card-reprints/?do=findComment&comment=1252034","commentId":1252034,"userName":"TwiceBorn","timestamp":1410074400,"content":"The 2 Core sets I have all have the errata text printed on them, as well as the \"gold difficulty indicator.\" I bought my first set in Feb 2014, my second one this past summer. I also have KD, but haven't taken it out of the shrink-wrap yet… will let you know when I finally do (which could be a while). \n\nEdited September 7, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121385-errata-card-reprints/?do=findComment&comment=1252258","commentId":1252258,"userName":"gandalfDK","timestamp":1410096910,"content":"Yes, as far as the KD expansion, all the cards that have to have a \"gold difficulty indicator\" have got one. I bought my KD expansion last week (just finished The Seventh Level). Also the SoM cycle has the icons and the errata."}]}