{"url":"https://community.fantasyflightgames.com/topic/121557-recursion/","title":"Recursion","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1254759","commentId":1254759,"userName":"GrandSpleen","timestamp":1410237284,"content":"Occasionally I find myself thinking of a certain card type, like \"encounter deck manipulation\" and want to build a deck with cards that have that function.  Then it's pretty much left to me to remember which cards can accomplish that effect-- existing card databases have lots of options, but 'card archetype,' or 'function,' or whatever you want to call it, isn't one that I've seen (many cards would need multiple tags if you tried to make them searchable for this, anyway).\n\n \n\nHaving said that, I was thinking about cards that let you get multiple uses out of other cards, which people often call card 'recursion,' and I'm just trying to come up with a list here.  Started doing this for my own information, but figured I might as well post it for anyone interested.\n\n \n\nSo here I go, please add some if I miss any.  I’m loosely using “pull out of the discard pile” as a definition for “recurring,” even though you may not have actually *used* the card that is being recurred.  I’m listing the recursion function here but not the cost of the card, for the sake of space (this is long enough already!).  I tried not to list cards twice, even though some fit into multiple categories:\n\n \n\nEVENT Recursion:\n\nBook of Eldacar, Tactics Attachment (play Tactics Event from discard pile)\n\nHama, Tactics Hero (return a Tactics Event from your discard pile to your hand)\n\nMap of Earnil, Spirit Attachment (play Spirit Event from discard pile)\n\nScroll of Isildur, Lore Attachment (play Lore Event from discard pile)\n\nTome of Atanatar, Leadership Attachment (play Leadership Event from discard pile)\n\n \n\nATTACHMENT Recursion:\n\nAnborn, Lore Ally (return one Trap Attachment from discard pile to your hand)\n\nErebor Hammersmith, Lore Ally (return any one player’s top Attachment from discard pile to hand)\n\nSecond Breakfast, Leadership Event (each player returns their top Attachment from discard pile to hand)\n\n \n\nALLY Recursion:\n\nCaldara, Spirit Hero (put Allies from discard pile into play)\n\nGwaihir, Tactics Ally (put Eagle Ally into play from discard pile)\n\nMen of the West, Leadership Allies (return X Outland Allies from your discard pile to your hand)\n\nStand and Fight, Spirit Event (put any player’s non-Neutral Ally into play from discard pile, your control)\n\nTo Me! O My Kinsfolk!, Leadership Event (put a Dwarf ally from your discard pile into play)\n\nTo the Eyrie, Tactics Event (return a just-destroyed Ally to your hand)\n\n \n\nHERO Recursion:\nFortune or Fate, Spirit Event (put any discarded hero into play)\n\nLandroval, Tactics Ally (put a destroyed hero immediately back into play)\n\n \n\nGENERAL Recursion (recurs multiple card types):\n\nDwarven Tomb, Spirit Event (take any Spirit card from your discard pile into your hand)\n\nEred Nimrais Prospector, Lore Ally (shuffle one card from your discard pile into your hand)\n\nThe White Council, Neutral Event (one player shuffles any card from their discard pile into their deck)\n\nWill of the West, Spirit Event (shuffle entire discard pile into your deck)\n\n \n\nSELF-Recurring cards (function of card is not “recursion,” but card can recur itself):\n\nCourage Awakened, Spirit Event (willpower boost)\n\nMiruvor, Spirit Attachment (willpower boost, 1 resource, or ready attached hero)\n\nNoiseless Movement, Lore Event (prevent enemy engagement check)\n\nRumour of the Earth, Lore Event (one card encounter scry)\n\nSwift and Silent, Leadership Event (ready a hero)\n\n \n\nENCOUNTER Recursion:\n\nA Watchful Peace, Spirit Event (put just-explored Location on top of Encounter deck)\n\nThe End Comes, Neutral Event (shuffle entire discard pile into Encounter deck)\n\nShadow of the Past, Neutral Event (put top card of discard pile on top of Encounter deck)\n\n \n\nHONORABLE Mention (card causes you to discard, then play the same card):\n\nA Very Good Tale, Leadership Event (put up to 2 just-discarded Allies into play)\n\nTaking Initiative, Leadership Event (put one just-discarded Ally into play and deal damage, maybe)\n\nWell-Equipped, Neutral Event (put one just-discarded Attachment into play on an eligible Dwarf)\n\n \n\nABILITY Recursion (move from play into hand [not discard pile], allowing multiple use of card ability):\n\nBorn Aloft, Tactics Attachment (return attached Ally to hand)\n\nChildren of the Sea, Spirit Event (willpower boost, then shuffle target Silvan/Noldor Ally into your deck)\n\nFeigned Voices, Leadership Event (prevent enemy attack, return in-play Silvan Ally to your hand)\n\nMeneldor's Flight, Tactics Event (return an in-play Eagle Ally to your hand)\n\nPursuing the Enemy, Tactics Event (deal damage to enemies, return in-play Silvan Ally to your hand)\n\nSneak Attack, Leadership Event (put Ally into play and return to hand at end of phase)\n\nThe Tree People, Lore Event (return in-play Silvan Ally to your hand, put a searched Silvan Ally into play)\n\nEdited September 9, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1254768","commentId":1254768,"userName":"chrsjxn","timestamp":1410237760,"content":"The cool thing about the mono-sphere books (ie, most of the first group) is that they allow you to potentially use the event twice more. The first time when you use the book, and the second once it comes up in your deck again.\n\n \n\nAdd in cards that shuffle, like The White Council (or Timely Aid, or others), and you can play a card a lot more times than you might think. I may or may not have used Sneak Attack a dozen times with Gandalf in a single game this way last week..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1254829","commentId":1254829,"userName":"gandalfDK","timestamp":1410242452,"content":"It's Will of the West instead of Test. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nNice list, would come in handy sometime."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1255142","commentId":1255142,"userName":"GrandSpleen","timestamp":1410270587,"content":"Whoops, corrected the typo and also added Meneldor's Flight to the 'honorable mention' section."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1255261","commentId":1255261,"userName":"jormungandr","timestamp":1410276402,"content":"Great post! Very useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1255556","commentId":1255556,"userName":"CJMatos","timestamp":1410289460,"content":"Gwahir puts an eagle ally, not any ally"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1255642","commentId":1255642,"userName":"Jban","timestamp":1410293100,"content":"Great Post!!\n\n \n\nA Watchful Peace misses I think, but still very nice to see. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1255726","commentId":1255726,"userName":"GrandSpleen","timestamp":1410296649,"content":"Updated! Thanks for the feedback.  Hard to catch all the details on your own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121557-recursion/?do=findComment&comment=1256246","commentId":1256246,"userName":"danpoage","timestamp":1410331060,"content":"Yes, this list is very useful. Incidentally, I plan on adding categories to Hall of Beorn Card Search, I have just been super busy with work lately. If the community doesn't mind compiling lists like these, it will certainly make my life easier when it comes time to categorize the cards. The plan is to allow a card to exist in multiple categories so that Háma would be have the \"Recursion\" and \"Offensive\" categories (since his ability relies on him attacking) whereas Elrohir would have \"Readying\" and \"Defensive\" and Faramir (Core) would have \"Questing\" and \"Global\". The aim is to help with just the kind of deck-building challenges that GrandSpleen is describing, so I would very much like to hear from others what Categories they would like to see (not too many, otherwise they become less useful - they should probably be capped around 30 or so)."}]}