{"url":"https://community.fantasyflightgames.com/topic/121559-the-white-council/","title":"The White Council","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254780","commentId":1254780,"userName":"GrandSpleen","timestamp":1410238414,"content":"The-White-Council.jpg [http://hallofbeorn.com/Images/Cards/The-Dunland-Trap/The-White-Council.jpg]\n\n \n\nI am sure there has been discussion of this card, but I have not read any of it.  I just wanted to get people's opinion of this guy.  My thoughts:\n\n \n\nI think it's a fabulous card.  In a solo game, it's a 1-cost card that fills a number of roles in your deck, contributing to a deck that has both consistency (lots of readying effects, or card recursion) or versatility.  And if you just want cards that make your deck \"smaller,\" this is just about the best one there is (draw 1 card for 1 resource, it could just be filler in your deck, or play a different role if the need arises).\n\n \n\nIn 2-player the cost is very fair, and it can become card draw (unlike in solo, where it could make your deck \"smaller\" but not lead to extra cards in your hand) or resource acceleration for another player.  \n\n \n\nIn 3- and 4-player games, this card might not be worth its cost.\n\n \n\nIf I could, I would change one thing about this card.  I would make it 0-cost, and replace the line defining \"X\" with this: \"To play this card, each player must pay 1 resource from a hero he controls.\"  Maybe some problems for people who are faithful to the table-talk rules, but I think it makes the card a lot cooler and more playable in larger multiplayer games.  The resource generation effect would need to be changed to 2 resources, as well.  \n\n \n\nOr possibly \"To play this card, the players, as a group, must pay a total of X resources from heroes they control.  X is the number of players in the game.\" (and leave the resource effect at 1 resource token added)\n\n \n\nYour thoughts on this card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254852","commentId":1254852,"userName":"Glaurung","timestamp":1410244006,"content":"Sounds like if one payer choose ready hero another player cannot make same option?  I don't really get wording on that card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254854","commentId":1254854,"userName":"Dwarf king Bronze beard","timestamp":1410244178,"content":"Well i think it´s pretty unique card, but i dont think so that i could use it in my deck, because in single player this card is only like readying hero and thats it. I also play 2-player games where this card would be little bit better, but it still wouldn´t fit in any of my decks. But i still kind of like this card because it´s so different than any other card what i own.\n\nI think that this card should read \"X is the number of players in the game minus 1.\" Then i would consider to use this card in my deck (also GrandSpeelen´s idea is good)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254857","commentId":1254857,"userName":"Dwarf king Bronze beard","timestamp":1410244254,"content":"> Sounds like if one payer choose ready hero another player cannot make same option?  I don't really get wording on that card...\n\nCorrect ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254858","commentId":1254858,"userName":"PsychoRocka","timestamp":1410244272,"content":"I was pretty excited when this card came out and used it for a while before eventually taking it out.\n\nIts really versatile and has many uses. Most often I would use it to play first turn steward of gondor by putting a resource on Elrohir (only one leadership hero for that deck; tactics/leadership) and my lore/spirit deck would draw a card to make up for using White Council. Or would often use it simply to ready a hero in times of great need (eg really needing an extra defender/really needing an extra attacker to do the last few points of damage to an enemy). Sometimes it was even good simply as a card draw engine allowing one deck (usually the tactics/leadership) to draw a card while the other simply gains a resource. Once I actually did a massive massive gamble and hoped and prayed for a Gandalf, used White Council, actually goddamn drew Gandalf and consequently won because of this. Its also pretty good just as a resource fixer allowing you to play it for two lore resources with Elrond and Haldir to put an extra resource on Glorfindel so you can play both light and a test of will/arwen/whatever it is you need.\n\n \n\nI found myself quickly getting over the card however.... Often it would be useless or next to useless and at the end of the day there are so many cards that can do every aspect of White Council better and cheaper. So long as you are able to identify weaknesses in your deck and fix these weaknesses you will not need cards like this one. Lembas for one lore resource (and a more or less full heal) or even cram for 0 leadership are both far better than white council for readying. Daerons Runes at 0 cost to draw 2 (even if you do have to discard one) is far better than 2 resources to draw 1. I know that obviously White Council provides two effects not one; one for each player, however almost every time I ever used it one effect was actually needed/very beneficial for my situation and the other was always just an extra effect that while positive was not really needed. So I was always paying 2 resources for one desperately needed effect, almost always readying.\n\n \n\nIts a pretty good support/utility card but outside of a support deck I don't think its actually as good as it seems. Better cards, depending on how the deck works and its strengths/weaknesses, can pretty much always be used over White Council for whichever of its effects you use it for the most.\n\nEdited September 9, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1254917","commentId":1254917,"userName":"MyNeighbourTrololo","timestamp":1410249623,"content":"The cost is what kills it for me. I often play in group of 3-4, and this card is just not worth the resources it takes. I wish they made it so \"players can spend resources collectively to pay for this card\", this would have been a whole different story.\n\nEdited September 9, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255058","commentId":1255058,"userName":"Glaurung","timestamp":1410264426,"content":"yes i agree here. This card is among some cards which sounds good in theory but practically is useless most of the time...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255077","commentId":1255077,"userName":"awp832","timestamp":1410265434,"content":"I think it really depends a lot on how many players you play with.  Chances are that not every option is going to be useful to every player in a 4 player game,  or even a 3 player game.  But in a game with less players, chances are better that at least some of the options are very useful in the current game state.   I played with this card quite a bit in 2 player and found it to be very useful,  typically for readying a hero,  often my ally's hero in a critical situation.   I figure,  is it worth it to pay 2,  ready my ally's hero, and get a resource back,  effectively paying 1 resource for a ready hero?   Yes,  I think it is.\n\nbut no, I would not pay 4 for this card pretty much ever. largely because the final option is pretty lame.\n\nEdited September 9, 2014 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255161","commentId":1255161,"userName":"joezim007","timestamp":1410271620,"content":"This card contradicts itself in my opinion. It was designed in a way that it should be used in multiplayer to cause a discussion about who gets to do what. The sad thing is that this card isn't really playable beyond 2-player due to its cost. If the designers wanted this used in multiplayer, then it should have either distributed the cost, or gave it a static cost of 1 or 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255191","commentId":1255191,"userName":"GrandSpleen","timestamp":1410273205,"content":"You could even make it play well with table talk rules by revising what I wrote above: make it a 0-cost event, then add the text \"Forced: After resolving The White Council, the players as a group must discard a total of X resources from heroes they control, or cancel the effects of this card.  X is the number of players in the game.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255201","commentId":1255201,"userName":"Noccus","timestamp":1410273656,"content":"> The cost is what kills it for me. I often play in group of 3-4, and this card is just not worth the resources it takes. I wish they made it so \"players can spend resources collectively to pay for this card\", this would have been a whole different story.\n\n \n\nExactly this.\n\n \n\nThe first time I saw the card spoiled I was excited about it; but I did not really pay attention the fine print on the card.\n\nAs it stands, it's a single player card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255336","commentId":1255336,"userName":"joezim007","timestamp":1410279282,"content":"> You could even make it play well with table talk rules by revising what I wrote above: make it a 0-cost event, then add the text \"Forced: After resolving The White Council, the players as a group must discard a total of X resources from heroes they control, or cancel the effects of this card.  X is the number of players in the game.\"\n\n \n\nMight be simpler to make it cost 0 and write it like this:\n\n \n\nAction: Each player must pay 1 resource from a hero he controls, then, starting with the first player, each player chooses 1 different option: ready a hero he controls, add 1 resource to the resource pool of a hero he controls, draw 1 card, or shuffle 1 card from his discard pile into his deck.\n\nEdited September 9, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255376","commentId":1255376,"userName":"Glowwyrm","timestamp":1410280653,"content":"The benefit of White Council (for a  single player) as opposed to Daeron's Runes and Lembas (or Cram) is that it takes up less card space in your deck build.  Three cards accomplish what it would take six to do otherwise.  And the extra benefit is that its neutral.  Having extra readying in Lore or Tactics is handy, and card draw (even a little deck thinning) is nice outside of Lore.  And, for multi-sphere decks, it is some handy resource transfer.  It's an auto include in every single player deck I play now. \n\nI like the idea of changing how to pay for it though.  Needs to be different to be playable in multi-player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255411","commentId":1255411,"userName":"MyNeighbourTrololo","timestamp":1410281525,"content":">  \n> \n> > You could even make it play well with table talk rules by revising what I wrote above: make it a 0-cost event, then add the text \"Forced: After resolving The White Council, the players as a group must discard a total of X resources from heroes they control, or cancel the effects of this card.  X is the number of players in the game.\"\n> \n>  \n> \n> Might be simpler to make it cost 0 and write it like this:\n> \n>  \n> \n> Action: Each player must pay 1 resource from a hero he controls, then, starting with the first player, each player chooses 1 different option: ready a hero he controls, add 1 resource to the resource pool of a hero he controls, draw 1 card, or shuffle 1 card from his discard pile into his deck.\n> \n>  \n\nKinda almost kill the part with adding 1 resource to some of the heroes. It would be better if price could be just shared, and each player decides how much of it they're gonna pay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255468","commentId":1255468,"userName":"joezim007","timestamp":1410284968,"content":"> > Action: Each player must pay 1 resource from a hero he controls, then, starting with the first player, each player chooses 1 different option: ready a hero he controls, add 1 resource to the resource pool of a hero he controls, draw 1 card, or shuffle 1 card from his discard pile into his deck.\n> \n> Kinda almost kill the part with adding 1 resource to some of the heroes. It would be better if price could be just shared, and each player decides how much of it they're gonna pay.\n\n\n\nIf you're looking at the card in a solo sense as it is, the 1 resource thing can only be used as a means of shifting resources. Why not make it that way in multiplayer? I wouldn't oppose changing it to give 2 resources instead, and it wouldn't be terrible to make the players decide how resources should be spent, but I'd prefer to keep it simple and make each player pay 1, or give the card a static cost and just have the card be more useful for multiplayer than solo, like they have with other cards like Campfire Tales.\n\n \n\nSince the number of options available to each play effectively shrinks by adding more players, I'm all for a static cost. Maybe just make X equal to half the number of players rounded down (or up). We really need to make this card more worthwhile for 3 and 4 player games.\n\nEdited September 9, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255485","commentId":1255485,"userName":"MyNeighbourTrololo","timestamp":1410285958,"content":"Because in solo, you may trigger 3 different other options? And if it's a 4 player game, one player will need to swallow a bullet and gain 1 resource for spending 1 resource, which is not always beneficial."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255520","commentId":1255520,"userName":"joezim007","timestamp":1410287940,"content":"> Because in solo, you may trigger 3 different other options? And if it's a 4 player game, one player will need to swallow a bullet and gain 1 resource for spending 1 resource, which is not always beneficial.\n\n \n\nTrue. That's sorta my reasoning for the static or X/2 cost. Otherwise, if I was going to change the card to make each player pay 1, I'd remove the option to gain a resource and add something else... or make it gain 2 resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1255953","commentId":1255953,"userName":"PsychoRocka","timestamp":1410307934,"content":"> The benefit of White Council (for a  single player) as opposed to Daeron's Runes and Lembas (or Cram) is that it takes up less card space in your deck build.  Three cards accomplish what it would take six to do otherwise.  And the extra benefit is that its neutral.  Having extra readying in Lore or Tactics is handy, and card draw (even a little deck thinning) is nice outside of Lore.  And, for multi-sphere decks, it is some handy resource transfer.  It's an auto include in every single player deck I play now. \n> \n> I like the idea of changing how to pay for it though.  Needs to be different to be playable in multi-player.\n\n3 cards would not be taking the place of 6 though as you can only trigger one of White Councils effects for yourself thereby only getting either the card draw or readying effect but not both... even if you can use either of them depending which you need most theres always going to be one effect you use more depending on your deck and you could be doing so for less resources. You also have less chance to get that ability you need if there is only x3 white council instead of x3 card draw cards and x3 readying cards. Using a White Councils to trigger either effect then means you've lost a card able to do the other effect which you may then need later. If you really need the effect that badly its worth simply running a card that does it better and does just that effect. If the ability isnt that integral to your deck then you don't even really need White Council for it either and could probably put a more useful card in anyway.\n\n \n\nAlso, sorry but single player is when this card is the most useless...\n\nEither draw a card for 1 resource (way way better options than this for card draw)\n\nPay 1 resource to put a resource on someone else (shifting a single resource even if it does allow you to play something faster/much more easily is not worth 3 card slots in a deck)\n\nready a hero for one resource (cram, lembas and other cards are better at this)\n\nor that terrrible last ability.\n\n \n\nEven if it does do 3 different things and provide some flexibility it does all three for more resources and less proficiently then other cards. Two player is definitely where this card works best and even then I really don't think its worth it. If you had said its an auto include in any two player/two handed decks you make I wouldn't have thought much of it as just because I dont use it anymore/dont think its very good doesnt mean it isnt or shouldnt be used by others but in solo it honestly is a pretty terrible card other than providing a choice between some very simple effects that can normally be done better and cheaper by cards that do only that effect. Pretty much its just a few utility cards rolled into one but you pay extra for whichever effect you choose just to have a choice in the first place. \n\nEdited September 10, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1256128","commentId":1256128,"userName":"joezim007","timestamp":1410319862,"content":"> ready a hero for one resource (cram, lembas and other cards are better at this)\n\n\n\nI hate when people say this. Yes, free readying or 1-cost readying with healing is better than 1-cost readying. But we're also talking about an event action versus attachments that have to be played ahead of time. White Council's \"speed\" easily makes up for the measely 1 resource you have to pay or the lack of healing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1256222","commentId":1256222,"userName":"PsychoRocka","timestamp":1410328522,"content":"Yeah fair enough thats a pretty good point. It is at instant speed which is far more useful for readying.\n\nThere is also swift and silent however which is free (so long as you have a leadership hero) and readys a hero at instant speed and even goes back to your hand if you're in secrecy and its the first time you played it that turn.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1256683","commentId":1256683,"userName":"joezim007","timestamp":1410361593,"content":"> Yeah fair enough thats a pretty good point. It is at instant speed which is far more useful for readying.\n> \n> There is also swift and silent however which is free (so long as you have a leadership hero) and readys a hero at instant speed and even goes back to your hand if you're in secrecy and its the first time you played it that turn.\n> \n>  \n\n \n\nSwift and Silent costs 1, just like White Council in single player. If you're in secrecy and have Leaf Brooch out though, you can get it for free and have it come back to your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1256696","commentId":1256696,"userName":"Bullroarer Took","timestamp":1410362288,"content":"I tried the card with my Spirit Secrecy deck and ended up giving it an \"underperform\".  Might try it again, might not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1256804","commentId":1256804,"userName":"alogos","timestamp":1410366610,"content":"It's better than Ever Vigilant (but the card is not good), somewhat worse than wealth of gondor (higher cost but no restriction), (and the card is not that good either) somewhat worse than dawrven tomb (not restricted but suffle in the deck), somewhat worse than campfire tale (higher cost) (note that it is same in solo).\n\nBut it's just one card, with the effect of those 4, so in 4-player game, you can add a \"draw 3 cards\" effect. That's a Oppulence of Lorien, free of charge.\n\nThe cost being X mean that they want the card to be played in a cooperative way, because someone as to be the support, or other need to balance out the load on the one playing it. Wait... this is a cooperative game. That's exactly what we want.\n\nAll in all, quite good.\n\n \n\nIt has very little synergy with Bifur and Theodred.\n\nI played this card in a deck with great variance (statistically speaking (that mean a lot of 4-5 cost and lot of 0-1 cost cards and not much in the middle)) in cost that can have extra resource if I don't draw my high-cost cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1258397","commentId":1258397,"userName":"Rapier1","timestamp":1410459519,"content":"> It's better than Ever Vigilant (but the card is not good), somewhat worse than wealth of gondor (higher cost but no restriction), (and the card is not that good either) somewhat worse than dawrven tomb (not restricted but suffle in the deck), somewhat worse than campfire tale (higher cost) (note that it is same in solo).\n> \n> But it's just one card, with the effect of those 4, so in 4-player game, you can add a \"draw 3 cards\" effect. That's a Oppulence of Lorien, free of charge.\n> \n>  \n\nYou've missed the word \"different\" It can't be + cards because each different player has to make a different choice. Which is why the card becomes increasingly poor with additional players (the cost goes up, but the likelihood of the effect being useful goes down). \n\nFor the most part, drawing a card and readying a character are useful all the time. Gaining a resource may also be useful, shuffling a card may also be useful. However all of these are unlikely to be useful enough to warrant 1 resource at the time the card is played.\n\nIf it could always do + cards for the 4 players it would be worth 4 (it's still expensive card draw, but you do have to pay extra for flexibility, and this card has that in spades).\n\nPersonally I wouldn't change the card though, I think it is good enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1258485","commentId":1258485,"userName":"GrandSpleen","timestamp":1410462985,"content":"It would be cool to use the 4th ability (shuffle a card into your deck) with the new Gandalf hero combined with Word of Command to get repeated and reliable use of a powerful event.  But I can't think of what would combo well, lots of powerful events are expensive so you can't play them repeatedly anyway.\n\n \n\nI like the 4th effect, though, because it is one of only two cards (that I can recall) that allow you to take a specific card out of your discard pile, without sphere or attachment restrictions.  Ered Nimrais Prospector is the other and arguably the more useful, but White Council is neutral and can fit into more deck types.  If you're banking on repeated use of a single card though, you might be including White Council AND the Prospector in your deck for better consistency."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1258492","commentId":1258492,"userName":"Glowwyrm","timestamp":1410463263,"content":">  \n> \n> Even if it does do 3 different things and provide some flexibility it does all three for more resources and less proficiently then other cards. Two player is definitely where this card works best and even then I really don't think its worth it. If you had said its an auto include in any two player/two handed decks you make I wouldn't have thought much of it as just because I dont use it anymore/dont think its very good doesnt mean it isnt or shouldnt be used by others but in solo it honestly is a pretty terrible card other than providing a choice between some very simple effects that can normally be done better and cheaper by cards that do only that effect. Pretty much its just a few utility cards rolled into one but you pay extra for whichever effect you choose just to have a choice in the first place. \n> \n>  \n\nI understand your point about including the cards that provide these effects more efficiently.  My argument is that for single player, you're either paying an equivalent cost or only one more resource than most of these other effects.  Meanwhile, you're saving your deck space for other cards that will have a more direct influence on the outcome of the game.  The other benefits of the White Council are that:\n\nIt moves at the speed of an event, which is really handy for readying and resource transfer.\n\nIt is less susceptible to hate from the encounter deck.\n\nThe resource to pay for it can come from any hero.\n\nYou can gain these effects without having to run any specific sphere or trait.\n\nYou gain resource transfer without having to spend a resource. \n\nI find versatility to be important for solo play.  When you have to cover all of the bases by yourself, it's nice to have a card that gives you all these options without taking up a ton of your deck space.  I always keep my decks at 50 cards, so the space saved can be really helpful.\n\nI can understand people not being high on the card, but I'm never sad to draw it.  At the worst, I don't need it and I get a free resource transfer or I replace it for one cost.  At the best, I get a crucial resource transfer early in the game that allows me to play a key attachment or ally a turn earlier than I could have (happens a lot), or I get a clutch readying of a hero in a tight spot.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1258794","commentId":1258794,"userName":"alogos","timestamp":1410476593,"content":"> You've missed the word \"different\" It can't be + cards because each different player has to make a different choice. Which is why the card becomes increasingly poor with additional players (the cost goes up, but the likelihood of the effect being useful goes down). \n> \n>  \n\n \n\nYeah... well, like the usefull of drawing a dawrven tomb in the open hand (or without anything in your discard) but it's a point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1259102","commentId":1259102,"userName":"PsychoRocka","timestamp":1410497762,"content":"You make some good points glowwyrm, sorry for being so blunt in my last post. I guess it can be pretty useful for certain decks or play styles but just isn't for me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1259484","commentId":1259484,"userName":"joezim007","timestamp":1410528680,"content":"We need a new update from FFG. We've spent too much time discussing the usefulness of a single card here. I'd rather talk about cards we haven't see before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1259638","commentId":1259638,"userName":"Noccus","timestamp":1410535006,"content":"True, but that will be coming late next week.\n\nSo i'd rather read any new discussion on cards we can play then nothing at all.\n\nEdited September 12, 2014 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121559-the-white-council/?do=findComment&comment=1259754","commentId":1259754,"userName":"Glowwyrm","timestamp":1410538926,"content":"> You make some good points glowwyrm, sorry for being so blunt in my last post. I guess it can be pretty useful for certain decks or play styles but just isn't for me\n\nIt's okay, it's the internet and tone is hard to convey.  I'm not opposed to having an exchange of ideas online, and I'm not easily offended.  I also understand that people don't have to agree with me, I just wanted to make my case more thoroughly.   And I agree, Road Darkens can't come soon enough!"}]}