{"url":"https://community.fantasyflightgames.com/topic/121992-explanation-behind-my-hatred-of-the-specific-encounter-aimed-player-cards/","title":"Explanation behind my hatred of the specific-encounter-aimed player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121992-explanation-behind-my-hatred-of-the-specific-encounter-aimed-player-cards/?do=findComment&comment=1261890","commentId":1261890,"userName":"MyNeighbourTrololo","timestamp":1410701513,"content":"I used to stuck into the arguments around cards like Ever My Heart Rises, which are aimed to be used only in the specific set of quest featuring the type of encounter card our player card interacts with. \n\n \n\nI want to elaborate a little about this. On itself, this concept is not that bad - for example, if you're tired of losing the quest or you just want to kick it's ass, then arm yourself with cards that counter the quest's features and get rolling, nothing so wrong about it.\n\n \n\nBUT, where my hatred stems from is that LotR LCG player card pool is extremely slow growing, and has many limitations on it's player side, so from my point of view, creating a specific encounter card related player cards is a huge waste of a very limited card space we have, and I'm very glad they have abandoned the concept after Dwarrovdelf cycle.\n\n \n\nIt would be decent to have something like this if we had like 3 times larger card pool, but under this conditions - the cost is too high."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121992-explanation-behind-my-hatred-of-the-specific-encounter-aimed-player-cards/?do=findComment&comment=1261942","commentId":1261942,"userName":"Bullroarer Took","timestamp":1410705064,"content":"\"Players cannot reduce threat.\" Seems like Loragorn hate to me and I agree that I don't like cards aimed at specific cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121992-explanation-behind-my-hatred-of-the-specific-encounter-aimed-player-cards/?do=findComment&comment=1262265","commentId":1262265,"userName":"MyNeighbourTrololo","timestamp":1410726969,"content":"Loragorn and another buttload of threat-reducing effects. I was talking about player cards exclusively."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121992-explanation-behind-my-hatred-of-the-specific-encounter-aimed-player-cards/?do=findComment&comment=1262894","commentId":1262894,"userName":"jormungandr","timestamp":1410765359,"content":"I agree with your point. I like the hate cards that Bullroarer Took mentions, though, because they force me as a deckbuilder to explore new cards."}]}