{"url":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/","title":"My little concern about Doomed and Isengard in this cycle.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261725","commentId":1261725,"userName":"MyNeighbourTrololo","timestamp":1410681387,"content":"So. by now we have already half of the cycle on our virtual, and sometimes real, hands.\n\nAnd, regarding this new player Doomed mechanic and Isengard trait, that were introduced in the Voice of Isengard, I have some concerns.\n\n \n\nFirst of all, I wanna say that I enjoy this Doomed stuff a lot. All my solo decks featuring Lore always include Grima now (not in multiplayer, though, unfortunately - Doomed fades and decays in multiplayer). I use a lot of Doomed cards. \n\n \n\nNow, directly to my concern. Of all post-VoI player cards already released, there is only one pure Doomed card - Close Call. By pure I mean it has printed unconditional doom on it. Why is this matters? Two things: you can google it with seeing stone from your deck AND it can be triggered outside of planning phase, which can be useful sometimes. So, first part of my concern lies within Doomed mechanic itself - will pure doom fade into optional doom to the end of the cycle?\n\n \n\nWhich leads to the second part of my concern - Isengard trait. The situation with it is even more dire than with pure doom. There wasn't any Isengard folk released post-VoI, and if my memory serves me well, there wasn't even any spoiled ones by now. Which makes me a sad, sad person, because unlike others undeveloped faction traits, like Beornings or Dale, Isengard has actual unique flavor to it - reacting to doom and interacting with it. I hope for at the very least for 1 spirit and 1 tactics Isengard ally by the end of the cycle, but given the information we have - those hopes will likely remain just hopes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261769","commentId":1261769,"userName":"Rapier1","timestamp":1410688293,"content":"I think Doom has a lot of potential, so I don't think it's at risk of being consigned to not getting future support in later cycles the way some of the other mechanics have been sort of incomplete for a long time.\n\n \n\nI don't think Isenguard is very fleshed out at this point. They do have the doom interaction but that's really the only thing they have going for them. I expect we'll get some more Isenguard cards that do interact with doom, but they do need to be expanded into another mechanic to be closer to Dwarfs or Gondor or Rohan.\n\nI suspect they'll be okay as a deck type by the end of the cycle but will lack flexibility in deck design (more like Outlands than a full trait, but not as small as Dale and Beornings). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261779","commentId":1261779,"userName":"MyNeighbourTrololo","timestamp":1410690147,"content":"Never said that they should be a whole scale faction, like Dwarves. But they would make a nice side-kick basis for a deck featuring some doom in it, regardless of the main trait.\n\n \n\nAlso, I wouldn't go that far to calling Outlands \"not a full trait\", as any reliable(Hirluin) Outlands deck has around 20~ Outlands-related auto-include cards, with some optional Outlands stuff to the player's taste. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261819","commentId":1261819,"userName":"Rapier1","timestamp":1410694695,"content":"Outlands has only one play style, that's why I say they're not a full trait. They're much closer to the eagles (which has only slightly less cards if you wanted to play an eagles deck). \n\nCurrently I think that the Isenguard cards are heading to a similar point, given that Doom cards are \"on theme\" for them, so I would count all the Doom cards as Isenguard cards for things related to the trait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261825","commentId":1261825,"userName":"FetaCheese","timestamp":1410695454,"content":"I think the designers are slow to release new doomed cards because they first want to assess their power level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261836","commentId":1261836,"userName":"MyNeighbourTrololo","timestamp":1410696215,"content":"To me, \"fullness\" of the trait is ability of player to build a deck around the trait, to devote majority of deck to this trait (and hopefully be successful afterwards). And this is exactly what Outlands is about. You have your Outlands core. All you need is to bring this core onto the table as fast as humanly possible. Outlands is a fully developed trait, not a flexible or many-sided, like others, but it's a full trait. Regardless, this thread is not about Outlands.\n\n \n\nNone of the optional doom cards has anything to do with Isengard however.\n\n \n\nOn a side note, why are you insisting on calling Isengard \"Isenguard\"?\n\n \n\n \n\nFetaCheese, I'm afraid everything already has been assessed long before the release of VoI. They don't do APs and Deluxe boxes on the flight, it's all carefully planned.\n\nEdited September 14, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261862","commentId":1261862,"userName":"Rapier1","timestamp":1410699205,"content":">  \n> \n>  \n> \n> None of the optional doom cards has anything to do with Isengard however.\n> \n>  \n> \n> On a side note, why are you insisting on calling Isengard \"Isenguard\"?\n> \n>  \n\nI don't agree, I think that the doomed cards are inherently part of the card set you would look at with Isengard. I'm sure as more cards are released for this trait, you will continue to have people considering the doomed cards as part of any deck the trait is built around.\n\nAs for mistyping it, that's what I get for not proof reading properly :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261881","commentId":1261881,"userName":"MyNeighbourTrololo","timestamp":1410700693,"content":"Right now we have 2 Isengard allies that work with Doomed stuff, and only 1 of them would benefit from optional doom allies - Isengard messenger. The second one just readies on doom and would be rarely exhausted during the operations phase.\n\n \n\nAll optional doom allies have no particular affiliation to anything. Dunedain guy just softly looks over available locations for doom, and Gondorian guy just puts someone into play for doom. We also have one lore guy spoiled, which, as far as I remember the speculation, neutralizes threat of a location in staging area for doom. All of them would work good with anything, nothing dedicational. Worth a note, though, that most useful, in my opinion, is a Gondorian guy, because if you run a multisphere-main-leadershit-deck, he will be especially good. All those people bump Messenger's will, but that's about it. I hope this will get expanded until the end of the cycle.\n\n \n\nRight now we have one Leadershit and one Lore doom-reactive ally, one Spirit, one Lore and One leadershit optional doom ally. My least hope is that they keep it consistent and fill the missing sphere-slots with missing allies (some neutral stuff would be neat too), but knowing how much is going on in this cycle (silvan, secrecy, occasional noldor, even eagles and ents) - it's all very doubtful. Just physically impossible to fit so much stuff in those tight little adventure packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261938","commentId":1261938,"userName":"Gizlivadi","timestamp":1410704625,"content":"I agree with both of your points. This being the Isengard, Ring-make cycle, I was anxiously expecting to see cards that related to the themes of wizards, the lure of artifice, spells, etc. Which to me are obviously related to the Doomed mechanic since those themes have the potential of being extremely powerful and dangerous at the same time. And so far, we've got none of that in the cycle. I hate it to compare to the Against the Shadow cycle (which by the way, the more I look back at it, the more terrible I think it really is), but it's the same phenomenon they did in that as well. They built up our expectations with HoN of having huge gondorian armies at our command and instead we got Outlands, and for Gondor, squires and ship-wrights. I'm not trying to say that Silvan is the new Outlands since that's far from being the case, but it's the same thing that happened. They just forgot about a whole theme that had a lot of potential with the very mechanics they were introducing (in this case, Doomed and the Isengard trait)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1261944","commentId":1261944,"userName":"MyNeighbourTrololo","timestamp":1410705211,"content":"Also, going a little deeper with those three optional doom allies, there is one really solid point why Helard of Anor is \"better\" than two other dudes. Herald targets player-related stuff, while two others are ecnounter-specific, hence more rare to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1262552","commentId":1262552,"userName":"Narsil0420","timestamp":1410741502,"content":"I like that the newest doom cards are optional. It's nice to be able to splash something in and only use doom if it's beneficial to you. They're likely to get used much more than Saruman or the other Isengard allies.\n\nI think there is plenty of faction love in the game and cards that only work with a faction or thematically (Light of Valinor, Dwarrowdelf Axe, Rivendell Blade, Celeborn, etc.). And it's important to have some cards that can work in a lot of different decks. Doom should not be something that you have to do all or nothing with.\n\n \n\nIf you're a huge fan of Isengard then I can have sympathy for that though. Although I would start being somewhat suspicious of you... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/121978-my-little-concern-about-doomed-and-isengard-in-this-cycle/?do=findComment&comment=1262840","commentId":1262840,"userName":"MyNeighbourTrololo","timestamp":1410758895,"content":"2 from 3 optional doom allies have subpar stats compared to their non-optional doomed counterparts. \n\nAnd pure doom cards are kinda optional - no one forces you to put them in your deck :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nIts funny, but you just described the Isengard and Doom stuff. They can be played virtually almost in any type of deck.\n\n \n\nWell, I've been cheering for Grima hero before he got released, I was hoping that Saruman would be a hero. I'm still hoping that Smeagol will become hero at some point. Wose allies, and stuff. There is plenty of reasons to get suspicious of me by now."}]}