{"url":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/","title":"Best &amp; Worst Quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266155","commentId":1266155,"userName":"jjenks476","timestamp":1410916959,"content":"After playing this game for the last year incessantly I have definitely encountered quests that I return to again and again, and others that fell by the wayside. I was wondering what the larger community thought as well too see what, if any consensus there is? Nightmare mode is a different story because they have really reinvigorated some crappy quests.\n\nMind you I have not played the Battle of Lake Town or Stones of Erech.\n\n \n\nBest Quests:\n\n \n\nJourney Down the Anduin, for sheer excitement when you finally beat it. Also it is a solid quest that I play when I am just looking to test some decks.\n\n \n\nConflict At the Carrodck, is pure gold. Fighting 4 trolls at once is just too much fun. All around tough quest.\n\n \n\nSiege of Cair Andros, this quest can be really difficult for some, but I love the decision making involved in the quest. Trying to save all 3 locations or only going for a specific 1 can really change the quest a lot. And I love the siege mechanic.\n\n \n\nA Knife in the Dark, all time favorite\n\n \n\nThe Three Trials, This one only recently came out but it is already one of my favorites. All around fun, and the endless combos are great for variability.\n\n \n\nWorst Quests (Excluding Nightmare):\n\n \n\nHills of Emyn Muil, all around dull\n\n \n\nThe Dead Marshes\n\n \n\nInto the Pit, especially in single player this quest is just location after location with some tiny enemies popping up every so often.\n\n \n\nThe Long Dark\n\n \n\nPeril in Peralinger not a bad quest, just for me endlessley frustrating, so I tend to avoid it.\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266168","commentId":1266168,"userName":"divinityofnumber","timestamp":1410917750,"content":"I really enjoy Watcher in the Water solo. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266206","commentId":1266206,"userName":"GrandSpleen","timestamp":1410920004,"content":"All this is for 2-player:\n\n \n\nI was going to write that Into the Pit is one that I return to quite a lot, and then I saw it on your 'worst quests' list!  I like it for its length (it's a really slog through Moria) and relative balance-- there are lots of locations, but no lack of enemies either (at least in multiplayer).  I don't know if it's one of my favorite quests really, but it's one of my most played.\n\n \n\nWell, I know I have odd tastes, because Dungeons Deep and Caverns Dim is probably my favorite quest.  Love the drama when going riddles.  But this one often makes it onto people's 'worst' lists.\n\n \n\nThe Steward's Fear is also definitely in my top 5 for its replayability, cool theme, and cool mechanics.\n\n \n\nI also enjoy Watcher in the Water.  Pretty straightforward, short quest with a nice theme.\n\n \n\nFor my worst quests, I never really got over the pain of Into Ithilien and haven't played it since we first beat it. Other than that I can't think of any quests that I legitimately disliked.  But there are many quests that I rarely play simply because I think I need to build a specific deck to have a good chance at winning, and I don't do that so often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266279","commentId":1266279,"userName":"PsychoRocka","timestamp":1410924114,"content":"We Must away Ere Break of Day, Dungeons Deep and Caverns Dim, Flies and Spiders and The Lonely Mountain are all terrible quests. They have stupid mechanics (poison should not take cards from your deck... riddles should not work the way they do, Smaug should not make 15 attacks in a row), require very specific deckbuilding and are simply too punishing/not fun enough. I think the hobbit boxes are actually pretty **** terrible and only the player cards are any good and even then are FAR too dwarf intensive.  Favorites? So many! Three Trials, Journey Down the Anduin (mainly play nightmare now though), Nightmare Seventh Level, Trouble in Tharbad, Return to Mirkwood, Battle of Five Armies, Massing at Osgiliath, Encounter at Amon Din and others I can't think of right now!\n\nEdited September 17, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266281","commentId":1266281,"userName":"GrandSpleen","timestamp":1410924303,"content":"PsychoRocka and I have agreed to disagree about this already in another thread.  But since he speaks so strongly, it's my duty to go on record and say that there are those of us (like myself) who really really like The Hobbit saga expansions.  Both of 'em."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266295","commentId":1266295,"userName":"Gizlivadi","timestamp":1410925260,"content":"I personally can't stand many of the Saga quests due to being extremely difficult, I hope they tone down the difficulty for the future Lotr quests, but it seems it won't clearly, being the challenges much greater theme wise... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266301","commentId":1266301,"userName":"GrandSpleen","timestamp":1410925949,"content":"I once got attacked by a Nazgul 5 or 6 times in a row due to a bunch of 'extra attack' shadow effects while playing Flight to the Ford.  How's that for difficult, ouch!  Luckily, this was round 2 and I could give up without too much frustration."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266340","commentId":1266340,"userName":"PsychoRocka","timestamp":1410927757,"content":"I love the theme and art just not those four quests. Battles of five armies AND over the misty mountains grim are fantastic. Just wanted to add this =)\n\nAlso with the pretty powerful boons it seems we will get throughout it should slightly remedy difficulty in the lotr saga quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266449","commentId":1266449,"userName":"FetaCheese","timestamp":1410936882,"content":"I like most quests in the game as long as they are thematic and appropriately challenging. Low or high difficulty is meaningless if the gameplay is poor, but thankfully the vast majority of quests in the game are very fun indeed. The best quests are the ones I find myself replaying the most often.\n\nI also like dungeon crawls so:\n\nBest quests include all Khaza Dum quests, Foundations of Stone and shadow and flame. I see the appeal of the WitW but mehhh. The Steward's Fear is great and so is Siege of Cair Andros. All VoI and Ringmaker quests are good except for Fangorn Forest. So far The Three trials is great. Knife in the Dark is also really good. Note that as the most recent quests make timing and decision making a more integral part of the game, the fun factor multiplies (e.g. when should I travel to the Ford of Brunen or the Hills of Dunland? Should I exhaust the One Ring but draw the nazgul? Etc). No best quests from the 1st cycle make the cut here. CatC is horribly overrated, it's practically just a puzzle.\n\nWorst quests are those I deem boring or counterintuitive. Wanting to lose the scroll ASAP makes Pelargir a bad quest for example, because it goes against logic; losing control of Alcarons Scroll should not be encouraged but instead be a loss condition. Into Ithilien is the bad kind of difficult: its hard cause it's broken. HoEM is a snorefest but its the only dud from the first cycle for me, I enjoy all the rest. Road to Rivendell was also pretty boring and a bit too easy (Trouble in tharband is of equal difficulty but like ten times more engaging). In total thats only 4 quests I have played so far, which is a low number I think.\n\nI so do not care for the Hobbit quests. Decidedly average. The Dark Riders on the other hand are very enjoyable.\n\nEdited September 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266453","commentId":1266453,"userName":"FetaCheese","timestamp":1410937292,"content":"> I personally can't stand many of the Saga quests due to being extremely difficult, I hope they tone down the difficulty for the future Lotr quests, but it seems it won't clearly, being the challenges much greater theme wise...\n\nThey can be fairly challenging. Playing a hobbit deck, utilising frodos intuition, knowing when to travel and when to exhaust the Ring, all make the quests much easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266464","commentId":1266464,"userName":"Eldainorn","timestamp":1410939183,"content":"For me, Black Riders is the best expansion so far in terms of quests. I like all of them.\n\n \n\nNow, the VoI and Ringmaker cycle so far... I actually don't like those quests as much as I thought I would. I haven't played *** yet and I think I will like this one more than the others. Why is that? First thing - Dunlendings. I don't like them as enemies, I just don't feel like I am fighting against the shadow. I much prefer orcs and other foul creatures. To catch and orc quest just seems to rushed for me. When you have encounter Mugash it is best to slay him in one turn so you still have 2 turns left to quest heavily and beat the quest in the end. If you don't - sorry, do it again. It is thematic but it just feels too rushed to me. In general, Time mechanic isn't one of my favourites. Not that I am turtle player, quite the opposite. \n\n \n\nThis might seem silly to some but, HoN is my second favourite expansion. Not to mention that I like setting very much, I love Gondor. And Into Ithilien is fun! At least for me, I love going into Ithilien with my all tactics Eagle deck. Fun fun, very fun to me. Siege of Cair Andros is awesome quest, great design. I still have to win it though.\n\n \n\nI also tend to like SoM cycle, Dwarrodelf not so much, again, setting is very important to me.\n\n \n\nAnd talking about setting - I just can't wait to get my hands on The Lost Realm. *.*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266471","commentId":1266471,"userName":"Jban","timestamp":1410939865,"content":"Looks like my taste completely differs from most comments.\n\nVery enjoyable:\n\nInto the pit, foundations of stone, journey along the anduin, the dark rider quests, battle of five armies, morgul vale.\n\nI really like them because there is 1 straight objective to go for, you do not depend on objectives or any. So it's not that likely to get caught into a tremendous long game because some card won't appear.\n\nEnjoyable:\n\nInto ithilien, peril in pelargir, catch an orc, shadows and flames, redhorn gate, road to rivendell.\n\nI really like these but they have 1 big downside which makes that I don't play them that often. But I really enjoy them once in a while.\n\nPeril in pelargir and shadows and flames, 2 quests that always turn into a similar game as the previous one. I got mechanics which makes them very easy to win so therefore not that challenging/interesting.\n\nInto ithilien, road to rivendell: 2 quests which could result in massive changes due to some encounter cards. Sleeping Sentry for instance is horrible and fairly always destroys the game if not cancelled. As encounter card or shadow it is terrible anyhow. In multiplayer games this card always shows up.\n\nCatch an orc, not that fun if you need to dig to bottom of 21 cards to find him. Otherwise very enjoyable.\n\nNot that fun quests:\n\nHills of Emyn Muill, endlessly waiting on those 20 vp or losing all locations.\n\nThe long dark, don't like the keyword.\n\nTrouble in tharbad, too easy for such a new quest.\n\nThe dead marches, dont like the keyword.\n\nThink that's about it.\n\nAll quests I didn't mention I really think are fine. Fun to play, not great nor bad either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266608","commentId":1266608,"userName":"jjenks476","timestamp":1410954423,"content":"Yeah the Hobbit quests are pretty lackluster, We Must Away pales in comparison to CatC.\n\nThe new nightmare quests are awesome, especially the Redhorn Gate. I also love the CatC and Dead Marshes nightmare a lot.\n\n \n\nHow do other players feel about the nightmare quests? For me, at this point I have beat every quest mostly solo except for Dol Guldur and I struggle with the Dunland Trap, PiP, and the Fords of Isen. But other than those most quests are beatable. So nightmare really makes the game much better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266631","commentId":1266631,"userName":"FetaCheese","timestamp":1410955489,"content":"After thinking about it some more, I'd like to add the Dunland Trap in my top ten quests.\n\nIt might well be the most-well designed quest in the game. Why?\n\n1.Time mechanic is very important but not necessarily a loss condition. You might want to discard your hand and draw new cards.\n\n2. Another innovation, time is used as a survival counter, and cards that reduce time counters are suddenly beneficial...if you mount a proper defence.\n\n3. Locations are integral to the gameplay. Not only are they not filler, like they so often are, but instead require careful management, just like enemies. Knowning where and when to travel is crucial.\n\n4. High interactivity between locations, enemies and players (locations are not threat fodder here).\n\n5. Notice how few locations have immunity to card effects? The designers have opted to introduce different mechanics to deal with Asfaloth rather than going for the easy choice. I cannot praise them enough for this.\n\n6. Pressure is constant, unlike most quests where once you get past the beginning of the quest the challenge is mostly over. InsteD in TDT, early game you begin engaged with a Dunlending, then midgame you lose attachments and allies and engage more enemies, then lategame you have a boss enemy messing things up.\n\n7. Careful deckbuilding lowers the difficulty but doesn't break the quest. Forgoing items makes things slightly easier here, unlike say, running a Dunhere deck during Into Ithilien ( which crushes the quest). Very few loopholes in general.\n\n8. Unlike the Fords of Isen, card drawing here is not always punished. Windows of opportunity arise during the game when drawing cards has no ill effects and doesn't come back to bite you. Planning accordingly is rewarded.\n\n9. Dunlendings are tough but never feel unfair (hurrr durrr Orc Vanguard and Mamukil). They also represent their theme of celtic influenced berserkers quite nicely. I think I enjoy them as enemies more than most people do though.\n\nFor all the above reasons, I think The Dunland trap is one of the best quests in the game. A lot of time and effort was clearly spent on it and it shows. It also hits the difficulty spot for me quite nicely, even though I've spent so much time bashing my head against Chief Tusk I now resemble a dwarf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1266874","commentId":1266874,"userName":"Noccus","timestamp":1410967504,"content":"Best quests, in no particular order, from my multiplayer point of view:\n\n-Foundations of stone.\n\n-Three trials.\n\n-Watcher in the water.\n\n-7th level.\n\n-Conflict at the carrock.\n\n-Massing at Osgiliath.\n\n'Worst' is a bit of a harsh word here, as I usually don't even dislike any quest.\n\nI'd say less entertaining mechanic-wise:\n\n-1st quest hobbit box 2\n\n-2nd quest hobbit box 2\n\n-3rd quest hobbit box 1\n\nSee a pattern here?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1267139","commentId":1267139,"userName":"Mndela","timestamp":1410977774,"content":"I really enjoy:\n\nMorgul Vale\n\nCatch an Orc\n\nJourney down the Anduin\n\nHunt for Gollum\n\nMassing Osgiliath\n\nStewards Fear\n\nSeventh Level\n\n \n\nI dont like:\n\nSpiders and Flies\n\nLonely Mountain\n\nShadow and Flame\n\nLaketown\n\nRosghobel Nightmare\n\nInto Fangorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1267648","commentId":1267648,"userName":"Djenni","timestamp":1410999080,"content":"Best quests:\n\n * All the Black Riders quests (so thematic, fun and wonderfully laid out)\n * Foundations of Stone (so different each time i play it, fun quest)\n * Red Horn Gate (My all time favorite Adventure Pack quest, i love the setting and theme)\n * Return to Mirkwood (Love this one, very challenging but still a lot of fun)\n\n \n\nWorst quests:\n\n * Shadow & Flame (absolutely unbeatable without creating some super specialized Balrog killer deck)\n * Siege of Cair Andros (way too difficult, at least in 1-2 Player setting, cool quest but we never play it)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1268036","commentId":1268036,"userName":"Chaos101","timestamp":1411040395,"content":"I think mine would have to be:\n\n \n\nFavourite Quests (in no particular order).\n\n \n\n * Foundations of Stone\n * Journey along the Anduin\n * Battle of the Five Armies\n * The Morgul Vale\n\n \n\nWorst Quests (again in no particular order).\n\n \n\n * Druadan Forest\n * A Journey to Rhosgobel (my absolute least favourite quest)\n * We must away, ere break of day\n * Dungeons Deep and Caverns Dim\n * Into Ithilien"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1268109","commentId":1268109,"userName":"rekath16","timestamp":1411045055,"content":"Favourite:\n\n * The Hills of Emyn Muil: a calm one without pressure\n * The Redhorn Gate: thematic, atmospheric, cold and cool\n * Foundations of Stone: in MP environment the best one\n * The Siege of Cair Andros: very challenging in a non-annoying way\n * Encounter at Amon Din: interesting mechanic, in MP too easy\n * all Black Rider quests: much fun with hobbit decks\n\nDisappointment:\n\n * The Watcher in the Water: annoying tentacles, my least played quest\n * Road to Rivendell: deck construction depends on sleeping sentry\n * Into Ithilien: ridiculous difficulty\n * Flies and Spiders: surprisingly boring"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1268223","commentId":1268223,"userName":"Olorin93","timestamp":1411052687,"content":"Out of the ones I have played \n\n \n\nFavourites:\n\n \n\nThe Seventh Level\n\nThe Road to Rivendell\n\nThe Watcher in the Water\n\nA Shadow of the Past (has a very nice flavour, though Hide tests are annoying)\n\n \n\nLeast favourites:\n\n \n\nConflict at the Carrock\n\nThe Hills of Emyn Muil (then again, very thematic)\n\nReturn to Mirkwood\n\nThe Redhorn Gate (though it has great art)\n\nInto Ithilien\n\nTo Catch an Orc - I hate this scenario\n\n \n\nAll-in-all I guess I favour the Khazad-Dûm and Dwarrowdelf quests. The first cycle wasn't great to me. I like Heirs of Númenor but it can be very difficult if you don't buy everything and have super powerful decks. I haven't begun the Ringmaker cycle yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1268235","commentId":1268235,"userName":"supermaxv","timestamp":1411053136,"content":"As of the moment:\n\n \n\nFavorites:\n\n * Siege of Cair Andros\n * Watcher in the Water\n * Morgul Vale\n * Steward's Fear\n * Journey Down the Anduin\n * Encounter at Amon Din\n\n \n\nLeast Favorites:\n\n * The Dead Marshes\n * Dungeons Deep and Caverns Dim\n * The Lonely Mountain\n * Assault on Osgiliath\n * Peril in Pelargir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1269971","commentId":1269971,"userName":"Glowwyrm","timestamp":1411151050,"content":"Best (in no particular order):\n\nFoundations of Stone\nKnife in the Dark\nRoad to Rivendell\nTrouble in Tharbad\nNightmare Anduin\nNightmare Dol Goldur\n\nBlood of Gondor\n\n \n\nWorst:  The only scenarios I really don't like are the ones where you're waiting around forever for something to come off the encounter deck.\nHills of Emyn Muil (getting stuck while waiting for victory point locations)\nRedhorn Gate (getting stuck while waiting for victory point locations)\nWe Must Away Ere Break of Day (because I won't finish it without the treasures and that can be so luck dependent)\n\n \n\nEdited September 19, 2014 by Glowwyrm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1270630","commentId":1270630,"userName":"player1922162","timestamp":1411194161,"content":"Top 3\n\nInto Ithilien\n\nA Shadow of the Past\n\nMorgul Vale\n\nBottom 3\n\nThe Long Dark\n\nPeril in Pelargir\n\nDungeons Deep & Caverns Dim"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1272956","commentId":1272956,"userName":"Teamjimby","timestamp":1411402434,"content":"My favorites include:\n\nJourney Down the Anduin - a classic and the hill troll is always tough.\n\nThe Seventh Level - swarms of orcs\n\nWatcher in the Water - Big Bad Boss fight\n\nFoundations of Stone - random split quest areas are always exciting\n\nStewards Fear - good replayability and I like how Underworld works\n\nDruadan Forest - Can be on the easier side, but a very different feel with prowl and archery\n\nMorgul Vale - 3 unique boss fights\n\nEverything from Black Riders - So good\n\nPretty much everything from Isengard/Ringmaker - They are really hitting their stride with interesting mechanics and great stories.\n\n \n\nDislikes include:\n\nShadows of Mirkwood cycle - seems like every scenario except CatC has one major flaw in it: Hunters from Mordor can be OP; Rhosgobel requires specific deckbuilding; Hills are boring; Gollum can disappear in Dead Marshes; Return to Mirkwood threat gain is ridiculous when played solo.\n\nAnything that relies on Battle and Siege - Interesting idea, but it requires specific deckbuilding and makes many cards worthless\n\nAnything that involved flipping over multiple cards until you happen to get lucky - I'm looking at you Riddles and Long Dark\n\nAnything that has the Southrons encounter set - Every card is really hard (Southron Support esp.) and the shadow effects are brutal\n\nAnything that has the Mordor Elite encounter set - Every card is really hard (Master's Malice and Orc Vanguard esp.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1273556","commentId":1273556,"userName":"leptokurt","timestamp":1411422917,"content":"What I like:\n\n \n\nTo me Dunland Trap and Three Trials brought the game on a new level. They're both addictive. Their design is flawless. They're masterpieces. And I love these Scots Dunlendings!\n\n \n\nLots of people already mentioned Jorney down the Anduin which is still a motivating ad timeless quest.\n\n \n\nLoved all quests of the Heirs of the Numenor and Black Rider Expansions.\n\n \n\nInto the Pit, The Watcher in the Water and Redhorn Gate are my favourite quests of the Dwarrowdelf cycle.\n\n \n\n \n\nWell, what I don't like are quests like:\n\n \n\nJourney to Rhosgobel, the mechanics just don't work here.\n\n \n\nSteward of Gondor, because the solo mode is just too hard; it's great though with some house rules.\n\n \n\nevery quest that has a riddle mechanic in it (and that doesn't have a big kraken as a boss monster, 'cause krakens are cool)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1273778","commentId":1273778,"userName":"Khamul The Easterling","timestamp":1411438936,"content":"> Dislikes include:\n> \n> Return to Mirkwood threat gain is ridiculous when played solo.\n\nWhat do you want?  Threat decrease and free resources?  That's the whole point of that quest.  Your threat is rising fast so you need to quick get gollum to the Elf cave.  Take out the rapid threat increase and Return to Mirkwood would be ruined.  It would lose theme, be really easy, boring, and nothing to it.  I think the threat increase is what makes it really fun, tense and unique.  \n\n \n\nAm I the only one who thinks RtM isn't that bad? :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png] You just have to build a pretty good threat lowering deck with willpower....well, everyone has their own opinion.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 23, 2014 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1273791","commentId":1273791,"userName":"GrandSpleen","timestamp":1411439583,"content":"The real problem there is that RtM is one of those quests that play radically differently depending on how many players you've got.\n\n \n\nThat generally shouldn't happen, in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1273803","commentId":1273803,"userName":"Teamjimby","timestamp":1411440137,"content":">  \n> \n> > Dislikes include:\n> > \n> > Return to Mirkwood threat gain is ridiculous when played solo.\n> \n> What do you want?  Threat decrease and free resources?  That's the whole point of that quest.  Your threat is rising fast so you need to quick get gollum to the Elf cave.  Take out the rapid threat increase and Return to Mirkwood would be ruined.  It would lose theme, be really easy, boring, and nothing to it.  I think the threat increase is what makes it really fun, tense and unique.  \n> \n>  \n> \n> Am I the only one who thinks RtM isn't that bad? :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png] You just have to build a pretty good threat lowering deck with willpower....well, everyone has their own opinion.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\nIt's a good quest for multiplayer where you can pass Gollum around to share the load.  I just don't think it's a very good solo quest because a lot of the mechanics are lost on the solo game and you have to deckbuild for it. \n\n \n\nLike GrandSpleen said, I think there are plenty of good quests that work for both solo and multiplayer, so by comparison RtM has a \"fatal flaw.\" I'd put it in the same tier as Escape from Dol Goldur and We Must Away Ere Break of Day.  Good quest, but not balanced for all player counts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275398","commentId":1275398,"userName":"rekath16","timestamp":1411547176,"content":"> .\n> \n>  \n> \n> Steward of Gondor, because the solo mode is just too hard; it's great though with some house rules.\n> \n>  \n> \n>  \n\nSteward of Gondor? Do you mean Blood of Gondor or the Stewards Fear?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275407","commentId":1275407,"userName":"rekath16","timestamp":1411548107,"content":"Just for fun I made a summary of how many votes every quest got. I considered only quests which have been chosen by name (not: i like all AtS-cycle). Exception Black Rider quests cause so many people listed them in general and in my opinion they are not too diferent.\n\n \n\nBest\n\n \n\nPassage through Mirkwood o\nJourney Down the Anduin IIIIIII\n\nEscape from Dol Guldur o\nHunt for Gollum I\nConflict at the Carrock II\n\nJourney to Rhosgobel o\nThe Hills of Emyn Muil I\n\nThe Deadmarshes o\nReturn to Mirkwood I\nInto the Pit III\n7th Level IIII\n\nEscape from Moria o\nRedhorn Gate IIII\nRoad to Rivendell III\nWatcher in the Water IIIIIII\n\nThe Lost Dark o\n\nFoundations of Stone IIIIII\nShadow and Flames I\n\nWe must away ere break of day o\n\nOver the misty Mountains o\nDungeons Deep and Caverns Dim I\n\nFlies and Spiders o\n\nThe Lonely Mountain o\n\nBattle of Five Armies II\nPeril in Pelargir I\nInto Ithilien III\nSiege of Cair Andros IIIII\nThe Stewards Fear IIIII\nDruadan Forest I\nEncounter at Amon Din II\n\nAssault on Osgiliath o\n\nBlood of Gondor I\nThe MOrgul Vale IIIIII\n\nThe fords of Isen o\nTo catch an orc II\n\nInto Fangorn o\n\nThe Dunland Trap II\nThe Three Trials IIII\nTrouble in Tharbad I\nMassing at Osgiliath II\n\nBattle at Laketown o\n\nBlack Riders IIIIIIII\n\n\n\n\n\nWorst\n\nConflict at the Carrock I\nJourney to Rhosgobel II\nHills of Emyn Muil IIII\nThe Dead Marshes III\nReturn to Mirkwood I\nInto the Pit I\nThe Redhorngate II\nRoad to Rivendell II\nThe Watcher in the water I\nThe Long Dark III\nShadow and Flame II\nWe must away ere break of Day III\nDungeons Deep and Caverns Dim IIIII\nFlies and Spiders IIII\nThe Lonely Mountain IIII\nPeril in Pelargir IIII\nInto Ithilien IIII\nSiege of Cair Andros I\n\nDruadan Forest I\nAssault on OSgiliath I\nTo catch an orc II\nInto Fangorn II\nTrouble in Tharbad\nBattle at Laketown I\n\n \n\nPassage through Mirkwood, Escape from Dol Guldur and Escape from Moria are the only ones that have not been named by anyone, neither as a good nor as a bad quest (although one person liked the whole Khazad Dum Box).\n\nEdited September 24, 2014 by rekath16"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275756","commentId":1275756,"userName":"jjenks476","timestamp":1411574676,"content":"Wow thanks for that rekath 16. It seems clear to me that the Hobbit Saga's are not overly popular, and for good reason."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275888","commentId":1275888,"userName":"Pharmboys2013","timestamp":1411580676,"content":"Except for the battle of 5 armies which IMO is one of the best"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275911","commentId":1275911,"userName":"GondorianFire","timestamp":1411581999,"content":"I don't understand why so many liked watcher in the water. I thought it was just OK. I also didn't like Against The Shadow cycle save a few quests because many of the encounter cards were so frustratingly hard. Siege of Cair Andros for example I must have played over 30 times with no wins until I gave up on it. I know a mono sphere deck is almost required but that's just not my style."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275948","commentId":1275948,"userName":"Gizlivadi","timestamp":1411583600,"content":"I also don't understand the love for Watcher. It's not that it's too hard, but there are some effects that are just insane. I mean, that tentancle that forces you to let its attack go undefended, that can kill a hero in turn 1. That's not fun at all. Same thing for the one that renders a hero useless (though with Power of Orthanc it becomes more manageable). I don't know, it was a fun boss fight but some effects were a bit too much, like in RtR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1275961","commentId":1275961,"userName":"Teamjimby","timestamp":1411584175,"content":"> I also don't understand the love for Watcher. It's not that it's too hard, but there are some effects that are just insane. I mean, that tentancle that forces you to let its attack go undefended, that can kill a hero in turn 1. That's not fun at all. Same thing for the one that renders a hero useless (though with Power of Orthanc it becomes more manageable). I don't know, it was a fun boss fight but some effects were a bit too much, like in RtR.\n\nI think that is partly why I enjoy the quest.  It makes you approach combat differently.  You really don't want those tentacles to attack (because it might be undefended), so you need to use feints or direct damage to take them out or have someone with a lot of HP.  Likewise, you need to be careful with the tentacles that might make you hit one of your characters.  It just feels very different and unique when compared to fighting orcs or brigands.\n\nEdited September 24, 2014 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276008","commentId":1276008,"userName":"DC06675","timestamp":1411586467,"content":"I would throw a favorite vote in for Journey to Rhosgobel. I enjoy playing with ranged and eagles characters and the quest is very unique. It also has a time-ish mechanic (with Wilyador's health) and I believe is one of the first, if not the first, to have such a mechanic. \n\n \n\nAs for least favorite I would have to say the Hills of Emyn Muil. I love that the nightmare version makes this quest a little more enjoyable (i.e. less boring) but ultimately I hate how you can't win until all locations are explored. Pretty much any quest that focuses heavily on locations is a bummer in my opinion. To Catch an Orc came close to being a quest I hated, and with three players it is insane and i am not even sure it is possible to win with 4, but it offers a good challenge at two or one so it avoids the least favorite quests, but those types of encounter decks can be really frustrating depending on the number of players in the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276056","commentId":1276056,"userName":"gandalfDK","timestamp":1411588479,"content":"Favorite:\n\nThe Seventh Level\n\nJourney Along the Anduin\n\nConflict at the Carrock\n\nInto Ithilien\n\nJourny to Rhosgobel\n\nDunland Trap\n\nHaters:\n\nEscape from Dol Guldur (after I beat this one, never played again)\n\nHills of the Emyn Muil (travelling is just the most boring part of the game, so this is the most boring quest of the game)\n\nThe Dead Marshes (don't really like the escape test thing and Gollum can get lost in deck, then pop up on the right time and let you do an escape test against 0 cards... That's usually a bit og an anti-climax ending for me..)\n\nThe Hunt for Gollum ( I think this quest is usually or too easy or too hard, don't like that)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276144","commentId":1276144,"userName":"rekath16","timestamp":1411592182,"content":"> Favorite:\n> \n> Dunland Trap\n> \n>  \n\n \n\nMy dear friend, right now my playergroup tried 5x The Dunland Trap with 3 players. It was a depressing series of 5 losses and we are far away from unexperienced players. Maybe you might explain to me why you like so much The Dunland Trap?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276197","commentId":1276197,"userName":"joezim007","timestamp":1411594760,"content":"Dunland Trap is certainly a challenge. It requires a LOT of combat prowess and has some strong card draw hate. If you design around that, you should be able to beat it. 3 player definitely increases the difficulty. Seems to be simpler with 1 or 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276257","commentId":1276257,"userName":"Khamul The Easterling","timestamp":1411598480,"content":"Favorite:\n\n \n\nStewards Fear\n\nReturn to Mirkwood\n\nThe Hunt for Gollum (I prefer nightmare but normal is fine too)\n\nSeventh Level \n\nMassing at Osgiliath \n\nLong Dark (only when multiplayer but still a favorite)\n\n \n\nDon't like:\n\nWatcher in Water (annoying)\n\nConflict at Carrok (so old.....boring)\n\nCatch an Orc (I always got through the encounter deck like 2 times before I explore enough locations to find mugash)\n\nSiege of Cair Andros (so insanely easy) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276307","commentId":1276307,"userName":"FetaCheese","timestamp":1411601170,"content":"I'm not the person you are quoting but please see my 2nd post in the first page of this thread. Tl;dr version is that TDT is indeed hard but also exceptionally designed along with The 3 Trials. \n\n \n\nIn multiplayer the biggest weakness in groups is location management. Good old Asfaloth won't cut it. Try Thror's Key/Map, Strength of Will+Warden of Arnor+idraen+Asfaloth combo, Gildors Counsel etc.\n\n \n\n>  \n> \n> > Favorite:\n> > \n> > Dunland Trap\n> > \n> >  \n> \n>  \n> \n> My dear friend, right now my playergroup tried 5x The Dunland Trap with 3 players. It was a depressing series of 5 losses and we are far away from unexperienced players. Maybe you might explain to me why you like so much The Dunland Trap?!\n> \n>  \n\nEdited September 24, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276571","commentId":1276571,"userName":"gandalfDK","timestamp":1411626454,"content":"> > Favorite:\n> > \n> > Dunland Trap\n> \n>  \n> \n> My dear friend, right now my playergroup tried 5x The Dunland Trap with 3 players. It was a depressing series of 5 losses and we are far away from unexperienced players. Maybe you might explain to me why you like so much The Dunland Trap?!\n\nI only play solo or 2 player recently, so it's not that hard. I also find the scenario thematic and I just love slaying Dunlendings! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276710","commentId":1276710,"userName":"Mndela","timestamp":1411643200,"content":"There is a big diference between playing Dunland Trap in 2 players than in 3 players. And i dont want imagine what would happens in 4 players :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276713","commentId":1276713,"userName":"Chaos101","timestamp":1411644015,"content":"> There is a big diference between playing Dunland Trap in 2 players than in 3 players. And i dont want imagine what would happens in 4 players :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n\nAye! Tries it 3 player last night and got absolutely spanked each time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276714","commentId":1276714,"userName":"MyNeighbourTrololo","timestamp":1411644115,"content":"Did you specifically built your decks for this quest? Or you used your regular ones? Because Dunland Trap requires some deck tuning at the very least. The whole purpose of it is to break the metagame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1276823","commentId":1276823,"userName":"Chaos101","timestamp":1411653418,"content":"We just used our generic decks. Nothing specific. It was the first time playing it, and as a result we don't look at the encounter cards beforehand - we just play it blind.\n\nNext time we will tweak our decks to try and beat it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1284389","commentId":1284389,"userName":"leptokurt","timestamp":1412199849,"content":">  \n> \n> > .\n> > \n> >  \n> > \n> > Steward of Gondor, because the solo mode is just too hard; it's great though with some house rules.\n> > \n> >  \n> > \n> >  \n> \n> Steward of Gondor? Do you mean Blood of Gondor or the Stewards Fear?\n> \n>  \n\nSteward's Fear, of course. :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]\n\nEdited October 1, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1284391","commentId":1284391,"userName":"leptokurt","timestamp":1412199998,"content":"> I don't understand why so many liked watcher in the water. I thought it was just OK. I also didn't like Against The Shadow cycle save a few quests because many of the encounter cards were so frustratingly hard. Siege of Cair Andros for example I must have played over 30 times with no wins until I gave up on it. I know a mono sphere deck is almost required but that's just not my style.\n\nI think TWitW is cool because it has a strong theme, some cards with awesome artwork and a quest mechanic that allows different approaches to win the scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1289561","commentId":1289561,"userName":"Eldainorn","timestamp":1412604892,"content":"I finally got to play Trouble in Tharbad. Man this quest is awesome! It feels so thematic, especially locations have a very thematic feel. It also isn't too hard so even if I lose it doesn't get frustrating. Instantly in my top quests!\n\n \n\nAnd Haldir is just amazing in this quest. :3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1289621","commentId":1289621,"userName":"13thcaesar","timestamp":1412607526,"content":"Best Quest:\n\n \n\nTo Catch An Orc\n\nA Knife In The Dark\n\nThe Stone Of Erech\n\nReturn To Mirkwood\n\nThe Morgul Vale\n\nA Journey To Rhosgobel\n\n \n\nI don't like:\n\n \n\nDruadan Forest\n\nInto Ithilien"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1290706","commentId":1290706,"userName":"Jban","timestamp":1412661847,"content":"> I finally got to play Trouble in Tharbad. Man this quest is awesome! It feels so thematic, especially locations have a very thematic feel. It also isn't too hard so even if I lose it doesn't get frustrating. Instantly in my top quests!\n> \n>  \n> \n> And Haldir is just amazing in this quest. :3\n\nMy only concern with this quest it doesn't challenge you at all, if you play any hard questing deck. You will win the quest, you don't need any combat at all, which makes it somewhat boring. Played it in 1,2,3 player mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1290717","commentId":1290717,"userName":"DC06675","timestamp":1412662879,"content":">  \n> \n> > I finally got to play Trouble in Tharbad. Man this quest is awesome! It feels so thematic, especially locations have a very thematic feel. It also isn't too hard so even if I lose it doesn't get frustrating. Instantly in my top quests!\n> > \n> >  \n> > \n> > And Haldir is just amazing in this quest. :3\n> \n> My only concern with this quest it doesn't challenge you at all, if you play any hard questing deck. You will win the quest, you don't need any combat at all, which makes it somewhat boring. Played it in 1,2,3 player mode.\n> \n>  \n> \n>  \n\nIt can always be a little concerning when quests are too easy, but it would be very hard for FFG to keep making quests that really challenge you every time in different ways. If nothing else, it is always good to have quests that allow for less power-packed decks and more 'fun-oriented' decks to play.\n\nEdited October 7, 2014 by DC06675"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1290869","commentId":1290869,"userName":"Eldainorn","timestamp":1412681742,"content":">  \n> \n> > I finally got to play Trouble in Tharbad. Man this quest is awesome! It feels so thematic, especially locations have a very thematic feel. It also isn't too hard so even if I lose it doesn't get frustrating. Instantly in my top quests!\n> > \n> >  \n> > \n> > And Haldir is just amazing in this quest. :3\n> \n> My only concern with this quest it doesn't challenge you at all, if you play any hard questing deck. You will win the quest, you don't need any combat at all, which makes it somewhat boring. Played it in 1,2,3 player mode.\n> \n>  \n\nI like it because it feels unique. And I got your point, with quesiting deck you really can win easily, so I tend to build deck that doesn't have a ton of willpower. So I still lose because of that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1313273","commentId":1313273,"userName":"Nizi","timestamp":1414432647,"content":"The quests I don't like are the quests where you just take a stroll and don't need to do anything. \n\n \n\nThe most fun one so far has been the Khazad-Dum quests where you have to dig yourself out. The quests can drag on - we're going up the stairs, aaaand down again... and uuuup, and down - but it's something different at least.\n\n \n\nThe troll-fight is also quite fun, and to be honest: most quests are. As long as it's distinct.\n\n \n\nBut like someone indicated before, some quests just get broken by certain cards. You can't always have counters. \"Sleeping Sentry\", if not prepared for, can just **** you. I once had one to start the game with (exhausting everyone before it even started), and a second one as a shadow effect. Kinda unbalanced as it happened on a Goblin Spearman, immediately killing the defended pre-attack, and the attack bonus almost killing another of my heroes. Luckily that happened near the end and I was able to complete the objective, but in specific situations that can just wreck you so much to the point you're not playing the quest without the counters and the hero with the counter-effect. And enforcing specific cards shouldn't be the point of the game. That said, they don't need to nerf it or something, but let's just keep it more balanced in the future (for instance: only discard exhausted allies)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1313387","commentId":1313387,"userName":"Dwarf king Bronze beard","timestamp":1414438513,"content":"> Best Quest:\n> \n>  \n> \n> To Catch An Orc\n> \n> A Knife In The Dark\n> \n> The Stone Of Erech\n> \n> Return To Mirkwood\n> \n> The Morgul Vale\n> \n> A Journey To Rhosgobel\n> \n>  \n> \n> I don't like:\n> \n>  \n> \n> Druadan Forest\n> \n> Into Ithilien\n\nWe have very different tastes caesar since i hate to Catch an Orc and Journey to Rhosgobel. Return to Mirkwood isn´t in my top ten either and Into Ithilien is one of my favourite quests. But everyone has it´s opinion of things.\n\n \n\nTop 5 best quest  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n1.Journey Along Anduin: Lots of victory points (which i like), pretty long quest, all-around quest, challenging but not too hard, good for testing decks.\n\n \n\n2.Foundations of Stone: Many options where you will be washed after stage 3b, nameless enemies are very unpredictable, different and killing them rewards you with victory points and contains extra objectives that you don´t neccesery need to complete this quest\n\n \n\n3.The Siege of Cair Andros: Best battle quest i have, full of enemies to play with, shadow cards are crazy and very unpredictable and battleground mechanic is great.\n\n \n\n4.Into Ithilien: Optional ranger objectives, i like story and theme of this quest and again it´s challenging but not too hard.\n\n \n\n5.Steward´s fear: Underworld mechanic is good, 3 different plots and villain enemies makes quest always different and you have to prepare to everything and theme is also great.\n\n \n\nTop 5 worst quests  :angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png]\n\n \n\n1.Escape from Dol Guldur: No space for writing so i just say that i HATE this quest. Especially when playing solo...\n\n \n\n2.The Hills Of Emyn Muil: Booooriiing and too easy.\n\n \n\n3.To Catch an Orc: Search mechanic annoying if you´r trying to get high scoreand  2 player games are too hard for us (don´t ask me why too long story).\n\n \n\n4.Into Fangorn: Quest and hope that Huorns won´t kill you = WIN.\n\n \n\n5.We Must Away, Ere Break of Day: I don´t like quest´s which you have to be carefull for making too much progress, Wind-Whipped Rain (i hate that card even more than Sleeping Sentry) and searching of Troll Key, Troll Purse and Troll Camp before advancing to the next stage is very annoying.\n\nEdited October 27, 2014 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=1315564","commentId":1315564,"userName":"Nizi","timestamp":1414592778,"content":">  \n> \n>  * The Redhorn Gate: thematic, atmospheric, cold and cool\n> \n>  \n\n \n\nI didn't like that quest. Unless I'm missing something, you need to somehow find one of the two mountains hidden in the deck. If 'unlucky', this could last ages. Maybe you can include stuff like the Black Arrow in your deck and hope you run into the 'stairs', but apart from that, you're just playing the waiting game.\n\n \n\nBut I do agree it's thematic and atmospheric. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited October 29, 2014 by Marginal0"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2393079","commentId":2393079,"userName":"Crusaderlord","timestamp":1472646911,"content":"So far of the ones i have played, solo one deck only (includes Core & Mirkwood, Khazad & Dwarrowdelf, Isengaard & Ringmaker, Hobbits sagas, Black Riders) \n\n \n\nFavourite quests :\n\n \n\nSeventh Level\n\nRedhorn Gate\n\nPassage to Mirkwood (with a bit of nightmare added in)\n\nJourney along the Anduin\n\nWatcher in the Water\n\nJourney to Rhosgobel\n\nRuins of Belegost (with tweaked rules)\n\n \n\nWorst Quests :\n\n \n\nWe Must Away\n\nTo Catch An Orc\n\nDungeons Deep & Caverns Dim\n\nThe Lonely Mountain\n\nCelebrimors Secret\n\nEscape from Dol Guldur\n\n \n\nIn terms of deluxe 3 quest boxes overall i give a big round of applause for Khazad Dum & Black Riders and a sigh of general frustration for Hobbits Over Hill and Voice of Isengaard (largely hating the time mechanic).\n\nEdited September 5, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2393439","commentId":2393439,"userName":"Mndela","timestamp":1472661945,"content":"I dont like: Dunland Trap, Nin-in-Eliph, Fog-Barrows, Rhosgobel, 3 Trials."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2393649","commentId":2393649,"userName":"DukeWellington","timestamp":1472671187,"content":"Rather than just making a list, which I have done before and will do again, I want to answer yhe question with quest mechanics and themes that work and don't.\n\nBest:\n\nQuests that are simple, straightforward, and fast. They require the least time because deckbuilding needs are not exotic and playthrough almost never drags on into dreariness. These quests incluse: Seventh Level, Road to Rivendell, Amon Din\n\nQuests that are particularly thematic or unique without being overly punishing or tedious. These quests include: Trouble at Tharbad, Escape from Mt. Gram, Stone of Erech\n\nQuests that have particularly epic challenge and feel, especially with a replayability that makes you want to go back and relive the grand moments again and again\n\nThese quests include: The battle of 5 armies, Helm's Deep\n\nWorst:\n\nQuests with mechanics that can cause frustrating delays that end up making the quest slog on and on, especially with a deck not teched to avoid the slog\n\nThese quests include: To catch an Orc, Nin Il Elth\n\nQuests that turn out to be painfully easy because you can just ignore all threats and speed quest through, often beating it in 3 turns. The designers needbto test for max questing.\n\nThese quests include: Dead Marshes, Into Fangorn\n\nQuests with lots of clerical work (can you say time counters, uuugh) or otherwise tedious/boring activities such as shuffling a lot.\n\nThese quests include: Antlered Crown, Riddles in the Dark\n\nThe lists are not exhaustive and sometimes yhere are other issues like \"surprise you lost!\" randomness that is so lame. Most quests are a mixed bag of both good and bad, and many are uneven, sometimes great and other times miserable. Overall, the game is great and by cycle Mirkwood is uneven, Dwarrowdelf good, HoN great, Ringmaker aweful, Angmar good, Stormcaller great. Almost all the standalone quests are great and saga stuff is uneven."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2394471","commentId":2394471,"userName":"monkeyrama","timestamp":1472730161,"content":"> Rather than just making a list, which I have done before and will do again, I want to answer yhe question with quest mechanics and themes that work and don't.\n> \n> Best:\n> \n> Quests that are simple, straightforward, and fast. They require the least time because deckbuilding needs are not exotic and playthrough almost never drags on into dreariness. These quests incluse: Seventh Level, Road to Rivendell, Amon Din\n> \n> Quests that are particularly thematic or unique without being overly punishing or tedious. These quests include: Trouble at Tharbad, Escape from Mt. Gram, Stone of Erech\n> \n> Quests that have particularly epic challenge and feel, especially with a replayability that makes you want to go back and relive the grand moments again and again\n> \n> These quests include: The battle of 5 armies, Helm's Deep\n> \n> Worst:\n> \n> Quests with mechanics that can cause frustrating delays that end up making the quest slog on and on, especially with a deck not teched to avoid the slog\n> \n> These quests include: To catch an Orc, Nin Il Elth\n> \n> Quests that turn out to be painfully easy because you can just ignore all threats and speed quest through, often beating it in 3 turns. The designers needbto test for max questing.\n> \n> These quests include: Dead Marshes, Into Fangorn\n> \n> Quests with lots of clerical work (can you say time counters, uuugh) or otherwise tedious/boring activities such as shuffling a lot.\n> \n> These quests include: Antlered Crown, Riddles in the Dark\n> \n> The lists are not exhaustive and sometimes yhere are other issues like \"surprise you lost!\" randomness that is so lame. Most quests are a mixed bag of both good and bad, and many are uneven, sometimes great and other times miserable. Overall, the game is great and by cycle Mirkwood is uneven, Dwarrowdelf good, HoN great, Ringmaker aweful, Angmar good, Stormcaller great. Almost all the standalone quests are great and saga stuff is uneven.\n\n \n\nI agree with a lot of this. Frustrating delays on quests can be seriously annoying. A good example (for me) of a quest that avoids this but adds a delay (in a sense) is the saga quest with Shelob. You have to deal with Shelob for ages, and you can't just smack Shelob with a mega-hit the first time you meet, but at the same time Shelob does not hit so hard that the delay is annoying or cheesy (just a challenge) and the overall effect is excellent. Nin In Eilph, on the other hand, annoyed me no end. I am also generally less keen on quests that mess around too much with your deck (I'm looking at all the sorcery in Angmar). A little would be fine, but discarding cards constantly from the deck got so...boring, actually."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2399404","commentId":2399404,"userName":"Network57","timestamp":1473018262,"content":"> Quests with lots of clerical work (can you say time counters, uuugh) or otherwise tedious/boring activities such as shuffling a lot.\n> \n> These quests include: Antlered Crown, Riddles in the Dark.\n\nTo Catch an Orc takes a ton of set-up, as does Misty Mountains Grim and Ruins of Belegost (although that one is cool enough to be worth it). The other 2, I've almost never beaten just because I don't feel like resetting after I lose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2400601","commentId":2400601,"userName":"Calvadur","timestamp":1473105919,"content":"I usually enjoy all quests except something annoys me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]. That includes:\n\n-TIME PRESSURE. It's the worst thing for me. It was ok when you just had some locations, which shouldn't take to much damage. Got worse when they introduced time counters and finnally came to the flight of the stormcaller. I like to play \"late-game\", aka stabalising and then smashing he encounter deck (ofc not always the case :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]). Time mechanics don't allow for that. Ofc you should be taken out of your comfort zone every once in a while, but I prefer quests that just get worse, just because you give it time to develop as well. Anyway this results in some \"unloved\" quests: Journey to Rosgobel, VoI + Ringmaker, Flight of the stormcaller.\n\n \n\n-DELAYING. It is so annoying when you have victory in reach just to be set back again and again, because of what ever effect. 15 minutes later you win anyway, but had to flip some Cards to be 100% sure. Examples: The old forest, Nin-Il-Elth , to catch an orc, the fate of numenor (trying to find morgoth temple)\n\n \n\n-SEARCHING/EXTREME RANDOMNESS. this means looking for specific Cards from the Encounter deck. It is so demotivating to see Cards like athelas or clues as shadowcards or getting discarded. Recently played Murder at the prancing Pony and I checked the Investigation deck like 15 times and found only 2 hideouts. I just don't like it if you can't advance (safely), because something doesn't Show up. Examples: Murder a tthe prancing Pony, Rosgobel, Hunt for Gollum, Riddles in the dark (still don't know how These \"riddles\" can be fun, either you build your deck to fit and it's no Problem or you don't and guess like Gollum :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png])  \n\n \n\nI don't really care about set-up time and also find quests at the Ends of the difficulty Rating (top and bot) entertaining (Mount gram, amon din, Carn Dum etc.)\n\n \n\nMy favorite quests are thematic (hello saga :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]), epic (Carn Dum, Lake-Town) or simply unique (Mount gram, morgul Vale)\n \n\nEdited September 5, 2016 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2401417","commentId":2401417,"userName":"DC06675","timestamp":1473164270,"content":"> I usually enjoy all quests except something annoys me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]. That includes:\n> \n> -TIME PRESSURE. It's the worst thing for me. It was ok when you just had some locations, which shouldn't take to much damage. Got worse when they introduced time counters and finnally came to the flight of the stormcaller. I like to play \"late-game\", aka stabalising and then smashing he encounter deck (ofc not always the case :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]). Time mechanics don't allow for that. Ofc you should be taken out of your comfort zone every once in a while, but I prefer quests that just get worse, just because you give it time to develop as well. Anyway this results in some \"unloved\" quests: Journey to Rosgobel, VoI + Ringmaker, Flight of the stormcaller.\n> \n>  \n> \n> -DELAYING. It is so annoying when you have victory in reach just to be set back again and again, because of what ever effect. 15 minutes later you win anyway, but had to flip some Cards to be 100% sure. Examples: The old forest, Nin-Il-Elth , to catch an orc, the fate of numenor (trying to find morgoth temple)\n> \n>  \n> \n> -SEARCHING/EXTREME RANDOMNESS. this means looking for specific Cards from the Encounter deck. It is so demotivating to see Cards like athelas or clues as shadowcards or getting discarded. Recently played Murder at the prancing Pony and I checked the Investigation deck like 15 times and found only 2 hideouts. I just don't like it if you can't advance (safely), because something doesn't Show up. Examples: Murder a tthe prancing Pony, Rosgobel, Hunt for Gollum, Riddles in the dark (still don't know how These \"riddles\" can be fun, either you build your deck to fit and it's no Problem or you don't and guess like Gollum :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png])  \n> \n>  \n> \n> I don't really care about set-up time and also find quests at the Ends of the difficulty Rating (top and bot) entertaining (Mount gram, amon din, Carn Dum etc.)\n> \n>  \n> \n> My favorite quests are thematic (hello saga :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]), epic (Carn Dum, Lake-Town) or simply unique (Mount gram, morgul Vale)\n> \n>  \n\nI would add Flight from Moria into the Delaying category.  I played it last night in nightmare mode and I had a solid game going with a dwarf deck but I had to go round after round until a quest mode that allowed me to win (without abandoned tools which which would not show up) appeared.  I believe there are only two quest cards that allow you to actually finish the game and with nightmare mode requiring you to shuffle bypassed quest cards rather than place it on the bottom it becomes a very luck-based game.  I did end up winning and I wouldn't even argue that it is overly difficult, but it is frustrating that despite everything in the game going right you cannot end the game because of win conditions you have very little control over. I wouldn't rate it as one of the worst (non-NM Hills of Emyn Muil gets that IMO), but given the randomness it is not going to be one I play very often, if at all.\n\n \n\nMy favorites in no particular order:\n\n \n\nJourney to Rhosgobel (I remember really liking the theme to this one, and I love eagles, it just stood out as different in a good way which I always appreciated)\n\nSeventh Level (NM) - Really like this quest, especially with more than one player as the encounter deck can really combo with itself in a way that is not too frustrating.  \n\nFlight of the Stormcaller - long setup, played it wrong a number of times early, but it is still a very thematic and fun quest.  \n\nFords of Isen - Probably the quest I have played the most.  It was really different at the time and although i might not have liked the time mechanic overall, it did lead to different deck builds.\n\nEncounter at Amon Din - easy but fun\n\nSiege of Cair Andros - did not appreciate this quest (or any of HoN quests at the time) - however, as time goes by I think this quest is very thematic and has a good level of difficulty.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122245-best-worst-quests/?do=findComment&comment=2637348","commentId":2637348,"userName":"Watcher in the Water","timestamp":1486943089,"content":"Favorites:\n\nI have to say that one of my favorites is flight from moria. Having to search through the quest deck for the right cards, while trying not to get too many victory points (dreadful gap is one of the most annoying cards in the deck) provides a great play experience. \n\nJourney down the Anduin is of course a great quest. It has become basically a testing ground for decks. If it can beat JdtA then it might be playable. \n\nI really like Return to Mirkwood. Having to rush through the quest praying you don't run into an attercop or hill troll makes a great play experience. \n\nI actually really like the first hobbit quest We Must Away Ere Break of Day. Although it is very easy to win normally, the challenge comes when you try to get the treasures. Even with my amazing dwarf decks I had to retry it multiple times to be able to get them. \n\n \n\nLeast Favorites:\n\nAs for bad quests, I found Into the Pit kind of tedious. It can be fun, but most of the time, it's just boring. \n\nHills of Emen Muil is also boring, I'm sure quite a few people agree with me. \n\nThe seventh level is a quest I have grown to hate. In multiplayer it is quite fun provided you have good combat decks, however in solo, it is really annoying and random. You can go from 1 enemy to 5 in two turns, and unless you are using tactics boromir, you are basically screwed. Also it is a 30 card encounter deck with two cave trolls and a chieftan of the pit.\n\nAlthough I haven't had any difficulty with the Long Dark (due to really good luck), I can see how it could be really annoying because of the insanely low number of pass cards.\n\nShadow and Flame is a weird quest. With the wrong deck it is impossible, but if you have galadriel, or hama feint, or even nori, it becomes really easy. I can't say I liked it, but it wasn't the most disagreeable quests. \n\nThe lonely mountain is also a bad quest just because of the chance that smaug wipes out all of your heroes in one turn before you have the chance to even try to win. "}]}