{"url":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/","title":"A couple of questions from a new player","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/?do=findComment&comment=1265578","commentId":1265578,"userName":"Friar M","timestamp":1410892071,"content":"I have a couple of questions after starting to play this rather good game. \n\n \n\n- with the Necromancer's Pass location do I need to have two cards in my hand to discard to travel? If I have one or none I can't travel correct?\n\n \n\n- with Thalin questing and Eastern Crows revealed from the encounter deck I assume that 'Surge' triggers before Thalin's rule?\n\n \n\n- In the Journey down the Anduin quest a few times I have managed to put a Forest Snare on the Troll which preventS moving on from stage 1 and when I have built up enough quest tokens to clear both stage 1 and stage 2 at the same time I kill the troll thus bypassing stage 2 completely. Is this correct? It seems a rather easy way to win the quest.\n\n \n\nThanks \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/?do=findComment&comment=1265638","commentId":1265638,"userName":"TwiceBorn","timestamp":1410895449,"content":"Hi Friar M,\n\n \n\nWelcome to the boards and this great game!\n\n \n\nWith regards to your questions, the second one (regarding Thalin) is answered in this FAQ document: http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ-Printer-Friendly.pdf [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ-Printer-Friendly.pdf]\n\n \n\nAnswer to your first question (Core Rulebook p. 23):\n\n \n\nTravel Effects\n\n \n\nSome location cards have travel effects, which are\ndenoted by a bold “Travel:” trigger on a card. Travel\neffects are costs or restrictions that some or all players\nmust pay or meet in order to travel to that location. If\nthe players cannot fulfill the requirement of a location’s\ntravel effect, the players cannot travel to that location.\n\n \n\n \n\nAlso see FAQ pp. 4-5:\n\n \n\n(1.10) Limitations on Actions\nActions are only limited by whether or not a player can\npay the cost of the action, or by built in limitations on\nthe card itself, such as “limit once per round.”\n\n \n\nExample: Protector of Lorien (CORE 70) reads,\n“Action: Discard a card from your hand to....” This\naction may be triggered three times per phase, as long\nas the card’s controller has cards in hand to discard.\n\n \n\nSo you are correct -- if the first player has one or no cards to discard, you can't travel to Necromancer's Pass. \n\n \n\n \n\nAnswer to your second question (FAQ p. 2):\n\n \n\nThalin\n\n \n\nWhen an enemy card is revealed from the encounter\ndeck, Thalin’s ability resolves before any keyword or\n“When Revealed” card effects on the encounter card.\n\n \n\nSo the Eastern Crows would not Surge before Thalin's effect triggers. :-)\n\n \n\n \n\nAnswer to your third question (p. 22 Core Rulebook):\n\n \n\nQuest Advancement\n\n \n\nPlayers immediately advance to the next stage of a\nquest as soon as they place a number of progress tokens\nequal to or greater than the number of quest points\nthe current quest card has. Additional progress tokens\nearned against the quest do not carry over to the next\nstage. All progress tokens on the quest are returned to\nthe token bank when players advance to the next stage.\nPlayers follow any instructions on the newly revealed\nquest card as it is revealed.\n\n \n\nAlso, FAQ p.10 states:\n\n \n\nQ: If players have placed progress tokens on a quest\nequal to its quest points, but a game effect prevents\nthem from advancing, can they continue to place\nprogress tokens on the quest?\nA: Yes. There is no upper limit to how many progress\ntokens may be placed on a quest.\n \nSo your interpretation regarding your third question is incorrect -- you can't bypass stage 2 completely.\n \nI'm still fairly new to the game, and it's easy to get tripped up in little details (or to miss things in the rules and FAQ)… so feel free to post further questions.\n\n \n\nOther useful sources that may contain answers to future questions you may have:\n\n \n\nhttp://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/ [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/]\n\nhttp://community.fantasyflightgames.com/index.php?/topic/92338-unofficial-faq-compilation-of-answer-from-around-the-web/ [https://community.fantasyflightgames.com/index.php?/topic/92338-unofficial-faq-compilation-of-answer-from-around-the-web/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/?do=findComment&comment=1265795","commentId":1265795,"userName":"GrandSpleen","timestamp":1410902086,"content":"About the quest advancement, any excess progress tokens on the quest are discarded when you flip to the next quest card.  That may be where you were getting hung up in 'bypassing' the 2nd stage of Journey Down the Anduin (you can't bypass it)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/?do=findComment&comment=1269958","commentId":1269958,"userName":"Friar M","timestamp":1411150599,"content":"Thanks for the answers guys!\n\n \n\nLooks like I need to read the rulebook a little more carefully. I just read the questing resolution section and assumed that quest tokens carried onto the next quest card like they carry over from the active location.\n\n \n\nLooks like I'll have to take a look at the FAQ too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122211-a-couple-of-questions-from-a-new-player/?do=findComment&comment=1269982","commentId":1269982,"userName":"TwiceBorn","timestamp":1411151233,"content":"You're welcome.\n\n \n\nAnd for what it's worth, I think it would have been logical and more learner-friendly if the Quest Advancement section of the rulebook directly followed the Quest Resolution section.\n\n \n\nBut oh well..."}]}