{"url":"https://community.fantasyflightgames.com/topic/122603-reply-from-calebffg-re-question-about-surge-keyword-and-guarded-objectives-during-set-up-escape-from-dol-guldur/","title":"Reply from Caleb/FFG re Question about Surge keyword and Guarded Objectives During Set-up (Escape from Dol Guldur)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/122603-reply-from-calebffg-re-question-about-surge-keyword-and-guarded-objectives-during-set-up-escape-from-dol-guldur/?do=findComment&comment=1272054","commentId":1272054,"userName":"TwiceBorn","timestamp":1411348734,"content":"I recently asked Caleb/FFG the following question (I suspect that many experienced players may already have been aware of the answer, but since I could not find an official answer in the rules or FAQ, I thought it worth asking FFG if only to determine if there was a definitive/official ruling on it… and that the answer would be worth sharing for the benefit of other newbies).\n\n \n\nHere is the question (with particular reference to Escape from Dol Guldur, but also with implications for other scenarios):\n\n \n\n\n\nWhen drawing cards from the encounter deck to attach to the objective cards during set-up (1A) in Escape from Dol Guldur (Core set), if a card with the Surge keyword (e.g., Endless Caverns) is attached to the first or second objective card during set-up, does the card that is drawn to fulfill the requirements of the Surge keyword then become attached to the next objective card? Or is it added to the staging area without being attached to one of the objective cards, and other cards are then revealed from the encounter deck to attach to the remaining objective cards?\n\n\n\n Here is Caleb's reply:\n\n \n\nOnly the first card revealed for the Guarded keyword is attached to that card. If the revealed card has the Surge keyword, then the next card revealed will be placed in the staging area (or resolved & placed in the discard pile if it’s a treachery).\n\n \n\nI interpret that to mean that even if there are other Guarded objectives during set-up that yet have to have encounter cards attached to them, the card drawn from the encounter deck to fulfill the Surge keyword on a card attached to the first objective will be placed in the staging area and not on one of the other objectives. I hope this was helpful. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/122603-reply-from-calebffg-re-question-about-surge-keyword-and-guarded-objectives-during-set-up-escape-from-dol-guldur/?do=findComment&comment=1272167","commentId":1272167,"userName":"GrandSpleen","timestamp":1411359109,"content":"Yeah, sounds about right -- resolving keywords discretely, one at a time... First, reveal a card for Guarded, if that is Surge then resolve that before resolving the next Guarded keyword on the next objective card.  Because Guarded means \"reveal a card and resolve/attach it to this one\" rather than \"attach the first eligible card that enters the staging area.\"  \n\n \n\nThanks for that, TwiceBornh.  "}]}