{"url":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/","title":"Two noobish questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275629","commentId":1275629,"userName":"Julia","timestamp":1411568469,"content":"Hey folks,\n\n \n\nplayed quite a lot of this game in the last months - been through all the quests from the core set and the first cycle - and after sufference and despair I know have two decks working quite good. Still, there are a couple of points in the rules I hope you could help me clarify:\n\n \n\n- shadow cards and attack cancellers. Let's say I have a Hill Troll coming. Phase 6: I deal every engaged enemy a Shadow Card (as long as I have cards in the quest deck). Then there's a short Action step I use to play Feint on the Hill Troll. Feint cancels the Troll's attack for that round, so should I still check for Shadow Effects on the Shadow Card or is the card discarded without looking at it? Same doubt for a previously engaged enemy that now has a Forest Snare trapping him.\n\n \n\n- questing: as soon as a quest stage is passed, the following one is immediately revealed and, if there are some instruction to follow \"when revealed\", they are immediately followed. Does this imply that heroes are still committed to the quest? So that, if a quest stage instructs to reveal cards from the deck and add them to the staging area and I have Thalin committed to the quest, new enemies are wounded?\n\n \n\nThanks for help\n\n \n\nJULIA"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275661","commentId":1275661,"userName":"Chris51261","timestamp":1411570194,"content":"Hello! So to answer your questions:\n\n1. You deal each enemy a shadow card, regardless of whether or not they can attack. Once each enemy that can attack has, any remaining shadow cards (such as those on an enemy that got Feinted or has Forest Snare on it) are discarded without resolving their effects, since those only occur when the enemy attacks.\n\n2. Heroes are still considered committed to the quest. At the end of the questing phase, there is a step where you basically add up your willpower vs. the enemy threat. So if a hero was destroyed or your willpower was affected by the cards revealed, it shows there. Thalin's ability would wound any revealed enemies.\n\nHope that helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275685","commentId":1275685,"userName":"Julia","timestamp":1411570956,"content":"HI Chris!\n\n \n\nit certainly does help :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] So:\n\n \n\n1. Great news. So, no shadow effects resolved, but cards still dealt, uh? Good to trim down the deck, especially when there are only a few cards in.\n\n \n\n2. As per this point, maybe I didn't post properly my query. Apologies if it was misleading. Let's say I have X characters to Journey down the Anduin stage 2. They successfully quest, and they complete Stage 2. At this point, Stage 3 is revealed and I'm instructed to add 2 cards / player to the stagin area. When this happens, are heroes still questing (hence, enemies got wounded by Thalin, a hero got wounded by Dol Guldur Orcs, and so on), or the quest phase ends, exausted characters returned to the playing areas of the respective players and then Stage 3 is triggered?\n\n \n\nThanks again for time and patience :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275769","commentId":1275769,"userName":"Chris51261","timestamp":1411575272,"content":"No worries. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] To answer the second part again, characters can only be exhausted once per round to use an action that requires it, quest, attack, defend, etc. So the heroes and allies you use to clear Stage 2 through questing will remain exhausted until the Refresh stage (or with a card like Unexecpted Courage allowing them to re-ready), regardless of the fact that you advanced to Stage 3. So in short: you exhausted characters to quest on Stage 2, had enough willpower to advance to Stage 3. Any characters you exhausted to commit to the quest remain exhausted. Let me know if you need more clarification, hopefully I answered what you were asking this time. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275780","commentId":1275780,"userName":"Teamjimby","timestamp":1411575902,"content":"She's asking about when characters become no longer committed to the quest for effects like Thalin.  The rulebook (p 14) says \"Characters committed to a quest are considered committed to that quest through the end of the quest phase, unless removed from the quest by a card effect.\"  So, Thalin would still be committed to the quest while you reveal encounter cards for the next quest card.\n\nEdited September 24, 2014 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275835","commentId":1275835,"userName":"Chris51261","timestamp":1411578033,"content":"Ohh, I gotcha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/122817-two-noobish-questions/?do=findComment&comment=1275871","commentId":1275871,"userName":"Julia","timestamp":1411580014,"content":"Yes, that was the point! Thanks to the both of you for help. So, Thalin stays and all the rest (for good and for worse that it might be)\n\n \n\nIndeed, the rule quoted by Teamjimby (\"Characters committed to a quest are considered committed to that quest through the end of the quest phase, unless removed from the quest by a card effect\") was the one that made me think what triggered exactly the end of the quest phase, whether the \"successfully / unsuccessfully questing\" or all the effects triggered upon resolving the willpower vs threat conundrum.\n\n \n\nThanks for the help, it's clear now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}