{"url":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/","title":"Feedback on Road Darkens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1288726","commentId":1288726,"userName":"jjenks476","timestamp":1412533351,"content":"Just saw all the cards on HallofBeorn and am dying to see how the quests are, Journey in the Dark looks brutal. Anybody who has played these quests tell me your initial opinions just to tide me over till I get the expansion haha thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289172","commentId":1289172,"userName":"Glaurung","timestamp":1412561410,"content":"Yes me too really wonna, hear about it…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289184","commentId":1289184,"userName":"danpoage","timestamp":1412563686,"content":"I just played through it solo today with a Secrecy deck. Breaking of the Fellowship can be very challenging, but is lot of fun. Journey in the Dark is probably my favorite - if you don't sacrifice a hero, you can't kill the Balrog and you take 4 burdens. The Ring Goes South is not as difficult, as long as you bring high willpower/location control. Combat is also essential in each of the quests, particular the third where Toughness eliminates most forms of direct damage or trickery. All told, very enjoyable, and I would imagine that they will be even more difficult in multi-player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289204","commentId":1289204,"userName":"chuckles","timestamp":1412565512,"content":"Secrecy deck... so I'm guessing you didn't sacrifice Gandalf then? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nWould a card like \"Straight Shot\" +Blades/Bard be worthwhile versus the Uruk-hai?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289212","commentId":1289212,"userName":"danpoage","timestamp":1412566275,"content":"I took 4 burdens :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] no Balrog Killing for me. To deal with toughness, I just held back an extra attacker. They all have defense in addition to toughness so Straight Shot would take too much work, in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289214","commentId":1289214,"userName":"jrrogers83","timestamp":1412566447,"content":"I've played the Ring Goes South and Journey in the Dark, both with my Hobbit deck from Black Riders. RGS is not a cakewalk, but I didn't find it too incredibly difficult. I don't read the quest cards ahead of time and was really surprised when Frodo got place face down under the Watcher  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] .\n\n \n\nThe Balrog ended up eating my hobbits for breakfast. It's very hard to get 25 damage on him, esp. b/c you have to get around 9 defense to do it. And sacrificing a hero just destroys a three-sphere deck, obviously. I'm going to have to rethink how I'm building for that one and allow more beefy Fellowship heroes to come to the fore.\n\n \n\nHaven't really used many of the Boons yet, obviously, but Sting continues to be a great card, esp. on Samwise. If you took Tireless Ranger on him in BR, it's easy to get him up to 5-6 defense (with Hobbit cloak). He's become a wall. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289358","commentId":1289358,"userName":"MyNeighbourTrololo","timestamp":1412583152,"content":"> if you don't sacrifice a hero, you can't kill the Balrog and you take 4 burdens.\n\nYou can always finish the quest before Barlog arrives, you know..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289361","commentId":1289361,"userName":"Glaurung","timestamp":1412583433,"content":"Just finish look at the cards on HOB site. Look amazing! They really follow the book! I need to wait another week or 2 to get it....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289821","commentId":1289821,"userName":"7theye","timestamp":1412615855,"content":"how does it compare to the black riders quests? \n\n \n\nAre they harder?\n\nWhich do you prefer more?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1289845","commentId":1289845,"userName":"danpoage","timestamp":1412616762,"content":"Yes, it is possible to complete Journey in the Dark before the Balrog comes, it is just very difficult. It takes a super-fast deck, and a bit of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290517","commentId":1290517,"userName":"jrrogers83","timestamp":1412646606,"content":"> how does it compare to the black riders quests? \n> \n>  \n> \n> Are they harder?\n> \n> Which do you prefer more?\n\nAgain, having only played 1 and 2, I think that The Ring Goes South is easier (solo) than most of the Black Riders quests, but A Journey in the Dark still has me scratching my head a bit. Definitely difficult, and \"Doom Doom\" counters really do give you a sense of increasing dread.\n\n \n\nOne of my fav. things about this quest is the Drums in the Deep quest stage, wherein you must kill a certain # of enemies before progressing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290542","commentId":1290542,"userName":"PsychoRocka","timestamp":1412648682,"content":"> Yes, it is possible to complete Journey in the Dark before the Balrog comes, it is just very difficult. It takes a super-fast deck, and a bit of luck.\n\nI will be attempting to do this MANY times until successful. No dead hero/threat gain for the campaign and only 2 burdens rather than 4? Count me in regardless of how hard it is to achieve!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290608","commentId":1290608,"userName":"Glaurung","timestamp":1412652544,"content":"One think us confused me about new Gandalf hero:\n\nWhen you start to play even before setup you draw your starting hand and decide for muligan or not, you already keep your top player deck card revealed? Or you cannot do that at this moment?\n\nThat can be very helpful when you decide for muligan. .."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290609","commentId":1290609,"userName":"Glaurung","timestamp":1412652549,"content":"One think us confused me about new Gandalf hero:\n\nWhen you start to play even before setup you draw your starting hand and decide for muligan or not, you already keep your top player deck card revealed? Or you cannot do that at this moment?\n\nThat can be very helpful when you decide for muligan. .."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290622","commentId":1290622,"userName":"Bullroarer Took","timestamp":1412653383,"content":"I would say that the top card is face up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1290806","commentId":1290806,"userName":"rekath16","timestamp":1412674550,"content":"Our 3-player-group played yesterday first one. I liked it a lot.\n\n \n\nThe day before i played 2 player Quest 2 and we lost. That one is really hard. But i cant wait to build a deck to beat it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291119","commentId":1291119,"userName":"joezim007","timestamp":1412695145,"content":"> One think us confused me about new Gandalf hero:\n> \n> When you start to play even before setup you draw your starting hand and decide for muligan or not, you already keep your top player deck card revealed? Or you cannot do that at this moment?\n> \n> That can be very helpful when you decide for muligan. ..\n\n \n\nGandalf is already in play, so his ability is active, therefore the top card should be visible at that point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291154","commentId":1291154,"userName":"Tracker1","timestamp":1412696568,"content":"I've played first 2 scenarios a bit now, and only played last scenario once. I'm using Aragorn lore, Sam and Boromir tactics. i have very few allies in the deck Master of forge, bill the pony, Galadriel, Elrond and Gandalf (hobbit version).\n\nTRGS is not hard at all. The one with Balrog is a little difficult, but still quite doable. Boromir with dunedain Warnings, And Gondorian shield, and Blood of Numenor with access through Celebrian's stone will be able to defend Balrog when it shows up. One time I defeat Balrog and sacrificed Boromir to do so. The other time I could not get enough damage on it.\n\nI played Breaking once, and it's one of those enemies pile up in the staging area scenarios, but I also realized i was also playing something wrong , so quite a little ways into it.\n\nOverall, scenarios seem to fit the story line well, but i am not as thrilled as TBR. Maybe thats because the hobbit synergy was new and a lot of fun to play, but the scenarios were also lot's of fun to play. My hero selection, and supporting allies don't feel like they synergize well with the story being told. I really hoped to make a deck similar to the Hobbit deck. I put Galadriel and Elrond in the deck, but why are they showing up in the mines of moria? My feeling is that the allies for this saga should have been 3 other members of the fellowship. Maybe this will come at a later dat, but I'm considering shelving the campaign rules until i get the complete story, and for now just play the scenarios as they are.\n\nThe suggested decks in the back are really unthematic. I recognize that the developers are constrained to only 3 products, but it's just silly to have Guards of the citadel and Beorn showing up in these scenarios. My hope, when the saga boxes are all said and done, is that i'll be able to create the types of deck(s) that match the story more closely.\n\nBack to the scenarios. When comparing these to their predecessors with a similar theme; Journey Along the Anduin, The Watcher in the Water, and Shadow and flame. I'll have to say the older scenarios will continue to get more play than these. They seemed more challenging at the time and i liked the mechanics more.\n\nBut maybe I have more expectations since the scenarios are trying to portray a story I am familiar with, which is going to be very difficult to do, and I will say they the scenarios are capturing those moments of the books. Right now I think I actually prefer the FFG made up scenarios and story line the. The Saga's including the Hobbit, which also gets almost no play.\n\nSorry, if this seems overly critical, but maybe i am just overcome with grief after having lost Boromir for the next scenario. The scenario, in which he is supposed to be lost.\n\nEdited October 7, 2014 by Tracker1"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291212","commentId":1291212,"userName":"Bullroarer Took","timestamp":1412698870,"content":"You have spoken my fears.  This morning I finally got the chance to set up a game.  I'll be playing this evening I think.  My playing area has been dominated by The Battle of Five Armies, but I moved that out of the way for the time being.  I simply grabbed my Glory, Aragorn & Boromir deck for the first sally.  I know Glorfindel is not thematic, but I've always felt he should have gone.  I think I might replace him with Gandalf later.  Starting threat will be ridiculous, but what the heck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291364","commentId":1291364,"userName":"Gizlivadi","timestamp":1412704740,"content":"To people saying the suggested decks are unthematic, my question is, why should they BE thematic at all? I mean, they are just decks, and that's enough. I don't think the intent was to make them thematic, as I don't think they need to be. Plus, while I certainly think the cards that come in the box itself should be as thematic and in-depth as possible (that's why I'm dissapointed with the number of player cards, not that they're unthematic, but they are so few there's little room for theme exploration), I don't think the decks themselves shouldn't necessarily follow the story in the book. And it really depends on what you consider thematic. I'm of the opinion that Fatty or Glorfindel in the fellowship is fairly plausible, or any hero pretty much, I think it's cool and thematic to see different heroes unite to destroy the ring. That's the point of the books."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291486","commentId":1291486,"userName":"Glowwyrm","timestamp":1412709517,"content":"I played through two-fisted, which is my preferred style of play, with a Hobbit deck and a low-threat elf deck (Glorfindel, Legolas and Haldir).  I beat RGS and JiD  on my first tries, have yet to defeat BoF.\n\nRing Goes South: fairly easy with interesting mechanics.  Feels kind of standard, has lots of surge to keep things interesting, and the ending is fun.  It is much easier in campaign mode because you get to start with a boon in hand.\n\nJourney in the Dark: really fun and tense.  I was fairly lucky to finish as fast as I did, and I only had to defend against the Balrog twice (but Sam was buffed up to 7def, so he was ok).  I was totally in control, cruising along and then everything almost fell apart at the end.  I love the timer as it adds a lot of suspense to everything. And I took the 4 burdens, because I did not want to stick around to fight the Balrog.\n\nBreaking of the Fellowship: I've had my butt kicked three times.  A lot of the scenario's mechanics work against the Hobbits (not really damage sponges), and unless I'm playing 2b wrong (I'm sure I'm not), there's a moment of reckoning that I'm struggling to get ready for (I could cruise through that with the phial, but I'm loathe to spend a one-time boon so early).  I can only imagine how many enemies will pile up in a 4 player game, because in 2 handed it is significant.\n\nOverall, I've enjoyed the quests MUCH more than Black Riders.  These capture the moments from the book very well, and they cover areas explored in previous scenarios in a way that feels fresh.  The burdens really start to add up and make things more interesting. I'm surprised at how divisive this box has been, but I've personally enjoyed it.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291603","commentId":1291603,"userName":"Bullroarer Took","timestamp":1412713817,"content":"I just played The Ring Goes South and possibly won it...\n\n \n\nHow is a solo player supposed to play 1A?\n\n \n\nhttp://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-road-darkens/the-council-of-elrond.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-road-darkens/the-council-of-elrond.png]\n\n \n\nFairly generic quest, but that part of the book was fairly generic as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291607","commentId":1291607,"userName":"Bullroarer Took","timestamp":1412713980,"content":"It looks to me like the solo player ends up putting the top four cards of his (or her) deck face up for the council decision."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291628","commentId":1291628,"userName":"joezim007","timestamp":1412714727,"content":"> I just played The Ring Goes South and possibly won it...\n> \n>  \n> \n> How is a solo player supposed to play 1A?\n> \n>  \n> \n> http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-road-darkens/the-council-of-elrond.png [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/the-road-darkens/the-council-of-elrond.png]\n> \n>  \n> \n> Fairly generic quest, but that part of the book was fairly generic as well.\n\nJust reveal the top 4 cards and do what they say with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291636","commentId":1291636,"userName":"Tracker1","timestamp":1412714828,"content":"> To people saying the suggested decks are unthematic, my question is, why should they BE thematic at all? I mean, they are just decks, and that's enough. I don't think the intent was to make them thematic, as I don't think they need to be. Plus, while I certainly think the cards that come in the box itself should be as thematic and in-depth as possible (that's why I'm dissapointed with the number of player cards, not that they're unthematic, but they are so few there's little room for theme exploration), I don't think the decks themselves shouldn't necessarily follow the story in the book. And it really depends on what you consider thematic. I'm of the opinion that Fatty or Glorfindel in the fellowship is fairly plausible, or any hero pretty much, I think it's cool and thematic to see different heroes unite to destroy the ring. That's the point of the books.\n\nThe suggested decks are unthematic because there are not enough player cards in the sets they used to create such a deck, so they have to use a number of player cards that don't fit the story. Even with all the material released I'm not able to make such a deck that contains all the members of the fellowship. I could probably make 2 mediocre decks that has all members though.\n\nPersonally, I would love have the opportunity to creat a deck that contained all the members of the fellowship. I see no reason why this should not be a goal of the developers. I'm not suggesting that they make all the these hypothetical player cards function in a way that creates a perfect deck. All i ask is that I have the possibility to do it, since this is how I would like to play through the saga set. My hope is that we will see more ally version of fellowship heroes in the future, but i am the worst at guessing what the developers think. It's almost always the exact opposite.\n\nThe biggest problem is the slow growth of our player card pool. Playing these scenarios a year or 2 from now will probably be a completely different story."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291639","commentId":1291639,"userName":"MyNeighbourTrololo","timestamp":1412714886,"content":"Yep, the players in turn order place cards in front of themselves until there is total of 4 card placed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291712","commentId":1291712,"userName":"Spurries","timestamp":1412718540,"content":"Just played RGS and lost on first try after a treachery combo with a location caused me to lose 4 allies. Was using a silvan deck and got pretty unlucky with AVGT and The Mistrel that searches for events. AVGT basically always discarded events and the Minstrell only found allies haha. Anyway seems fun, hope to play more.\n\nAnyone care to post some decent solo decks that can use the new player cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291737","commentId":1291737,"userName":"tricil","timestamp":1412719160,"content":"Just wondering, if I sacrifice hero Gandalf to make the Balrog lose all of his keywords, can I then sneak attack with ally Gandalf to place damage on the Balrog and kill him that way? Would be a really cool and thematic option. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291873","commentId":1291873,"userName":"jjenks476","timestamp":1412726047,"content":"Just finished second play through of Journey in the Dark, sacrificed Gandalf to deal 14 damage to Balrog then combined all my Hobbits and a Knight of Minis Tirith to finish off the Balrog. I had a blast, really enjoyed this quest over Shadow & Flame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291915","commentId":1291915,"userName":"Djenni","timestamp":1412727803,"content":"We always play as thematic as we can through the saga quests, we've been using these two decks for the Road Darkens quests, i'll have more info soon on how well they play the three quests. As you can see we try to keep it super thematic but it's hard.\n\n \n\nHOBBIT DECK\n\n \n\nHeroes:\n\nSam\n\nMerry\n\nPippin (Lo)\n\n+Frodo (tRd)\n\n \n\nAllies (17)\n\nBill the Pony 3x\n\nGaladríel 2x\n\nRivendell Scout 2x\n\nGandalf 2x (CORE)\n\nBarliman Butterbur 3x\n\nDaughter of the Nimrodel 2x\n\nFarmer Maggot 3x\n\n \n\n \n\nAttachments (19)\n\nFast Hitch 3x\n\nRing Mail 3x\n\nDagger of Westernesse 2x\n\nHobbit Cloak 3x\n\nCelebrian's Stone 2x\n\nNarvi's Belt 2x\n\nFellowship of the Ring 2x\n\nBoots from Erebor 2x\n\n \n\n \n\nEvents (18)\n\nHalfling Determination 2x\n\nFeint 2x\n\nHail of Stones 3x\n\nUnseen Strike 2x\n\nTake no Notice 2x\n\nDaeron's Runes 2x\n\nFrodo's Intuition 3x\n\nHobbit Sense 2x\n\n \n\n \n\nFELLOWSHIP DECK\n\n \n\nHeroes:\n\nAragorn (Lo)\n\nLegolas\n\nGimli\n\n+Frodo (tRd)\n\n \n\nAllies (16)\n\nBoromir 3x\n\nGandalf 3x (HOBBIT)\n\nTrollshaw Scout 2x\n\nWatcher of the Bruinen 2x\n\nRúmil 2x\n\nElrond 2x\n\nSilvan Refugee 2x\n\n \n\n \n\nAttachments (22)\n\nDwarrodelf Axe 2x\n\nRivendell Blade 2x\n\nCitadel Plate 2x\n\nBlack Arrow 1x\n\nLembas 3x\n\nA Burning Brand 2x\n\nProtector of Lorien 2x\n\nWingfoot 2x\n\nUnexpected Courage 2x\n\nFellowship of the Ring 1x\n\nSong of Travel 3x\n\n \n\nEvents (16)\n\nFeint 2x\n\nClose Call 2x\n\nGildors Counsel 2x\n\nSecret Paths 3x\n\nWord of Command 2x\n\nA test of Will 2x\n\nDesperate Alliance 2x\n\nFortune or Fate 1x"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1291989","commentId":1291989,"userName":"DC06675","timestamp":1412732117,"content":">  \n> \n> > To people saying the suggested decks are unthematic, my question is, why should they BE thematic at all? I mean, they are just decks, and that's enough. I don't think the intent was to make them thematic, as I don't think they need to be. Plus, while I certainly think the cards that come in the box itself should be as thematic and in-depth as possible (that's why I'm dissapointed with the number of player cards, not that they're unthematic, but they are so few there's little room for theme exploration), I don't think the decks themselves shouldn't necessarily follow the story in the book. And it really depends on what you consider thematic. I'm of the opinion that Fatty or Glorfindel in the fellowship is fairly plausible, or any hero pretty much, I think it's cool and thematic to see different heroes unite to destroy the ring. That's the point of the books.\n> \n> The suggested decks are unthematic because there are not enough player cards in the sets they used to create such a deck, so they have to use a number of player cards that don't fit the story. Even with all the material released I'm not able to make such a deck that contains all the members of the fellowship. I could probably make 2 mediocre decks that has all members though.\n> \n> Personally, I would love have the opportunity to creat a deck that contained all the members of the fellowship. I see no reason why this should not be a goal of the developers. I'm not suggesting that they make all the these hypothetical player cards function in a way that creates a perfect deck. All i ask is that I have the possibility to do it, since this is how I would like to play through the saga set. My hope is that we will see more ally version of fellowship heroes in the future, but i am the worst at guessing what the developers think. It's almost always the exact opposite.\n> \n> The biggest problem is the slow growth of our player card pool. Playing these scenarios a year or 2 from now will probably be a completely different story.\n> \n>  \n\nThe two decks you could make wouldn't be that bad, though. The hobbit trio and then the three hunters w/ boromir ally (not the best at questing I suppose). The worst part about it is that you can't make use of the new Gandalf hero if you went that route, which is a bummer. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292137","commentId":1292137,"userName":"Bullroarer Took","timestamp":1412741646,"content":"I think I'll try Djenni's strategy with hobbits in one hand and hunters in the other after I try to beat it with my solo deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292678","commentId":1292678,"userName":"Ryodu","timestamp":1412782993,"content":"I only played RGS twice with a friend. He only played the game once before and I haven't had a chance to play it much myself. Though I constantly find myself making decks, my lack of actual playtime keeps me from making good decks that work together and so forth.\n\n \n\nThat being said! We still had a fun time playing it and even though we got our asses handed to us we were able to at least get to the Watcher on our second try. We had a good time, I rebuilt and sleeved up some new decks, and we will see what happens.\n\n \n\nHaven't done the latter 2 quests but I'm really excited to do Moria. Thought he player cards look cool for TBOTF I'm not sure how I feel about it yet until I play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292819","commentId":1292819,"userName":"Caerdowyn","timestamp":1412790338,"content":"For this Saga expansion I decided to create three decks to represent the Nine Walkers (not the usual suspects though).\n\n \n\nFinished TRGS yesterday after a couple defeats (thanks to a certain treachery card).\n\n \n\nI like this quest, it isn't too hard but it does keep you on your toes.\n\nIf the designers were aiming for \"lots of decision making\", I think they succeeded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292829","commentId":1292829,"userName":"MyNeighbourTrololo","timestamp":1412790982,"content":"The decisions we make..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292954","commentId":1292954,"userName":"Ryodu","timestamp":1412795828,"content":"> For this Saga expansion I decided to create three decks to represent the Nine Walkers (not the usual suspects though).\n> \n>  \n> \n> Finished TRGS yesterday after a couple defeats (thanks to a certain treachery card).\n> \n>  \n> \n> I like this quest, it isn't too hard but it does keep you on your toes.\n> \n> If the designers were aiming for \"lots of decision making\", I think they succeeded.\n\nHey Caerdowyn, would that card happen to be \"bitter cold\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1292967","commentId":1292967,"userName":"kyrie","timestamp":1412796288,"content":"Bitter Cold is a nasty one for ally heavy decks. Once, you can deal with. Twice is pushing it. But it came up 3 times in our playthrough and was the \"bitter end\" for us all. For that quest it would be good to throw in \"Free to Choose\" to counteract the threat gain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1293132","commentId":1293132,"userName":"Ryodu","timestamp":1412802253,"content":"> Bitter Cold is a nasty one for ally heavy decks. Once, you can deal with. Twice is pushing it. But it came up 3 times in our playthrough and was the \"bitter end\" for us all. For that quest it would be good to throw in \"Free to Choose\" to counteract the threat gain.\n\nYea I was rebuilding the decks to combat that quest and saw that card and thought it would be perfect! I don't have the card text in front of me but if the threat gained would cause you to threat out would you still lose, \"Free to Choose\" or not?\n\n \n\nUPDATE: What stinks in a multiplayer game is that the card only helps yourself....\n\nEdited October 8, 2014 by Ryodu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1293164","commentId":1293164,"userName":"Caerdowyn","timestamp":1412803405,"content":"In my games it was Snowdrifts that popped out at the most inopportune times and attached itself to Doors of Durin.\n\n \n\nBitter cold is probably nastier, especially late game, but it didn't bother me as much as Snowdrifts.\n\n \n\nI just lost my first game of Journey in the Dark. This quest is definitely a lot harder.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1293449","commentId":1293449,"userName":"Tracker1","timestamp":1412815826,"content":"After playing these scenarios over the past few days i'd have to say they are really good, and fit the story nicely. The first scenario as stated is not to difficult, but I like the transitions between quest cards, which can change some well laid plans.\n\nJourney in the dark, may be my favorite of the bunch. It can definitely be problematic at times. I love the challenge of having to race out of the mines before the Balrog shows up, or I can choose to face him and try to destroy him, i also have the choice of sacrificing a hero to help get the job done. There are some great decisions to be made there, and all feel like the right thing to do to survive the encounter. I nearly made it out once before he showed up, I was one turn away. It's a real challenge, and also a real challenge to defeat him. Really nice work on this scenario.\n\nThe Breaking can also be pretty trickery. At first I thought it was more challenging than Journey into the Dark, and sometimes it can be, but overall it's a little more predictable, but still very good. I can imagine it would be even cooler in multiplayer.\n\nSo far I've now moved to playing an allly free deck on these and turning Aragorn Lore into an super defender and attacker. Gandalf, Sam and Frodo from TBR are the other heroes in the deck. Sam turns into a questing powerhouse and Gandalf does whatever is needed most at the time. With lots of action advantage, all 4 heroes will quest most of the time, and with all the Wp boosting attachments and events they can quest for almost 30 wp when needed!\n\nSo, overall i'm quite happy with how my solo games have turned out with these scenarios, although I'd still like to add other members of the fellowship as allies at some point. Whoops just forgot I could have added Boromir ally. I'll have to add a copy. Should not be a problem to get him in with Gandalf around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1294995","commentId":1294995,"userName":"Gizlivadi","timestamp":1412912398,"content":"I mentioned this in another thread but nobody replied, so I repeat: can somebody explain to me why the Doors of Durin look so different from how they were represented originally. The ithildin inscription is very strange."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1295411","commentId":1295411,"userName":"Ryodu","timestamp":1412951531,"content":"> I mentioned this in another thread but nobody replied, so I repeat: can somebody explain to me why the Doors of Durin look so different from how they were represented originally. The ithildin inscription is very strange.\n\n \n\nMaybe it was to keep it from being too identical to the Doors of Durin that was used in the Watcher in the Water quest way back when? Though I do admit they are strange looking, I do enjoy an alternative look every now and then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1295613","commentId":1295613,"userName":"Gizlivadi","timestamp":1412959528,"content":"But that doesn't make any sense. Why NOT make them similar? The Doors of Durin were designed by Tolkien himself. His design is as much part of the description of Middle earth as the fact that Galadriel's hair is golden or that the Gondorian banner is a white tree on black. I wouldn't mind the change if there was a reason for it, but as it is it seems disrespectful to the sorce material. It's as if they decided to change the tengwar inscription on the One Ring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1295620","commentId":1295620,"userName":"Ryodu","timestamp":1412959809,"content":"> But that doesn't make any sense. Why NOT make them similar? The Doors of Durin were designed by Tolkien himself. His design is as much part of the description of Middle earth as the fact that Galadriel's hair is golden or that the Gondorian banner is a white tree on black. I wouldn't mind the change if there was a reason for it, but as it is it seems disrespectful to the sorce material. It's as if they decided to change the tengwar inscription on the One Ring.\n\nThe only thing I can think of, and I'll be the first to admit this is a stretch, is that given how much farther away the doors of durin is in the new version, maybe they decided to go with a design that was easier to see.\n\n \n\nI don't know, it seems like a bad reason too. We should ask! lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1298491","commentId":1298491,"userName":"GrandSpleen","timestamp":1413237164,"content":"> Just wondering, if I sacrifice hero Gandalf to make the Balrog lose all of his keywords, can I then sneak attack with ally Gandalf to place damage on the Balrog and kill him that way? Would be a really cool and thematic option. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nYes you can! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  The hero is not added to the \"Fallen Heroes\" list until the scenario is won, so once hero Gandalf is out of play there is nothing stopping you from putting the ally version in.\n\n \n\n \n\n> I love the challenge of having to race out of the mines before the Balrog shows up, or I can choose to face him and try to destroy him, i also have the choice of sacrificing a hero to help get the job done.\n> \n>  \n\n \n\nYou HAVE to sacrifice a hero if you want to get the job done -- otherwise the Balrog has the 'indestructible' keyword.\n\n \n\nWe have finished The Ring Goes South and Journey in the Dark so far, 2-player.  We used thematic decks as far as including all members of the Fellowship: Aragorn-Pippin-Sam and Legolas-Gimli-Merry, with Boromir and Gandalf in the decks as allies.  That's where theme ended though, and we included plenty of Eagles and things that you don't typically see inside the walls of Moria..\n\n \n\nIt sounds like everyone is in pretty good agreement about the difficulty level of The Rings Goes South and Journey in the Dark.  The first scenario is not a cakewalk but it's very doable (took us 4 tries to win with these decks), while Journey in the Dark is a lot more challenging (took us 8 tries).  My mono-tactics deck tweaking ended up with a crazy deck for Journey in the Dark, having 35 allies, 12 events and only 4 attachments.  Very different from my usual tactics setup, which tends to be attachment-heavy.  As for the other deck, I'm happy that you can switch versions of a hero without penalty.  We used Lore Aragorn/Pippin in The Ring Goes Dark, switched to Leadership Aragorn for Journey, switched to Spirit Pippin after a few tries in order to get faster access to the spirit sphere, then finally switched back to Lore Pippin for access to more card draw and healing effects.\n\n \n\nLooking forward to trying Breaking of the Fellowship next, although we don't get much playtime on weekdays and my next weekend is pretty much booked.  It might be 2 weeks before we get a chance to try it!  Unless I can convince the wife to sacrifice a week night for the love of Hobbits... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited October 13, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1298768","commentId":1298768,"userName":"Pharmboys2013","timestamp":1413254679,"content":"Made a Gandalf deck and ran through the 3 quests.  Ring goes south was fairly straight forward but definitely not easy.  I power quested thru journey in the dark and with a few lucky encounter draws never even had the Balrog come out.  Breaking of the fellowship wasnt bad either but i was playing solo and i think it could get pretty crazy the players that are added.\n\n \n\nTook the gandalf deck, paired it with a hobbit deck and did campaign mode thru the quests and had a much tougher time.  Journey in the dark gave me significantly more trouble, theres a lot of threat increase with those encounter cards and I ended up having to sacrifice Gandalf to slay the Balrog and then just wasting time for 3 turns until i was able to draw into my Fortune or Fate to get him back and finish the quest.  The two burden objectives that start in play during campaign mode of that quest are super annoying as well and despite carrying two miner of the iron hills in the hobbit deck, did not run into either.  Seems to be a decent amount of condition attachments in this box which may inspire me to run power of orthanic in future playthroughs.  Still need to do breaking of the fellowship in campaign but i anticipate like the quests before it, I will have a much more difficult time with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1299944","commentId":1299944,"userName":"Pharmboys2013","timestamp":1413342777,"content":"Tried to finish up my campaign with the gandalf deck and hobbit deck tonight by completing breaking of the fellowship, but I failed in two long attempts.  Definitely much more difficult multiplayer compared to solo and with all the archery damage in it, the hobbit deck has not been super helpful since with the hobbit's low hit points all the archery is relegated to the gandalf deck.  Not upset with the struggle though, will make for a more memorable campaign to deal with some adversity and what a thematically ironic scenario to encounter it is as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1306452","commentId":1306452,"userName":"monkeyrama","timestamp":1413884985,"content":"Finally played the first two quests (took a while for the box to arrive, then work prevented earlier play) with a Glorfindel, Merry, Haldir solo run. Low threat staging area sniping is very good in this box until Mr Balrog shows up. Haven't played quest three, but the first one was a cake-walk for the deck (maybe not representative, but I didn't engage even one enemy I think). Perhaps a higher threat deck that actually has to engage enemies could have more trouble, but Haldir was a beast, easily taking out 2 enemies a turn when needed. Wasn't playing the campaign mode, so I ran away from the Balrog. I liked the difficulty of them both, and can see that 2-handed/2-player would be much harder. That first quest card in The Ring Goes South is amazing for a solo player!\n\nNow I need to find time to run a campaign through (using Gandalf), and to play the final quest. That quest looks very clever in terms of the mechanics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1307444","commentId":1307444,"userName":"Djenni","timestamp":1413938125,"content":"Anyone else having trouble slaying the Balrog?\n\n \n\nI'm playing highly thematic decks and that's the only way i want to play the Saga quests. Needless to say i will not fill my deck with endless amounts of allies to beat the Balrog. I want to play the quest like other quests i don't want to alter my deck to finish the Balrog off. I just can't get around his monstrous defense, it would be no problem at all if he weren't Immune to player card effects, there's just no way that i can get enough attacking power to kill him. He doesn't lose his immunity to card effects when i sacrifice a Hero on the bridge does he? \n\nI'm using Sam, Merry & Pippin for one deck and Aragorn, Legolas & Glorfindel for the other one. Any advice/tips/success-stories would be much appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1307605","commentId":1307605,"userName":"GrandSpleen","timestamp":1413949629,"content":"I managed it with thematic hero choices, but not thematic ally choices.  Aragorn-Sam-Pippin and Legolas-Gimli-Merry.  The monotactics deck had 35 ally cards in it, and I just overwhelmed him.  You've got Glorfindel in your company, so you're not totally slaved to theme -- could you perhaps see some long-hidden Veteran Axehands emerging to help the company battle the Balrog?\n\n \n\nHe doesn't lose his immunity when you sacrifice a hero since it isn't granted via a keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1307779","commentId":1307779,"userName":"monkeyrama","timestamp":1413973660,"content":"The total immunity to player cards is a bit of a bore now. It would be nice to have no attachments and make his attacks impossible to stop, but by making him immune to players cards otherwise, as a design feature, it negates clever tricks that reduce his armour, but doesn't do anything about weapons etc that bump up attack. So it's a bit of a blunt instrument to achieve what they wanted (which was clearly avoid Hama-lock and/or discarding shadows). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1308112","commentId":1308112,"userName":"Djenni","timestamp":1413997110,"content":"> The total immunity to player cards is a bit of a bore now. It would be nice to have no attachments and make his attacks impossible to stop, but by making him immune to players cards otherwise, as a design feature, it negates clever tricks that reduce his armour, but doesn't do anything about weapons etc that bump up attack. So it's a bit of a blunt instrument to achieve what they wanted (which was clearly avoid Hama-lock and/or discarding shadows). \n\nThat's very true, it's weird that something like Black Arrow can do massive amounts of damage to the Balrog but things like Rivendell Blade & Sting have no effect on him.\n\n \n\nAlso what makes it even more crazy is that only the first player can attack him each round.\n\nEdited October 22, 2014 by Djenni"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1308278","commentId":1308278,"userName":"tricil","timestamp":1414003741,"content":"> Anyone else having trouble slaying the Balrog?\n> \n>  \n> \n> I'm playing highly thematic decks and that's the only way i want to play the Saga quests. Needless to say i will not fill my deck with endless amounts of allies to beat the Balrog. I want to play the quest like other quests i don't want to alter my deck to finish the Balrog off. I just can't get around his monstrous defense, it would be no problem at all if he weren't Immune to player card effects, there's just no way that i can get enough attacking power to kill him. He doesn't lose his immunity to card effects when i sacrifice a Hero on the bridge does he? \n> \n> I'm using Sam, Merry & Pippin for one deck and Aragorn, Legolas & Glorfindel for the other one. Any advice/tips/success-stories would be much appreciated.\n\n \n\nThis sounds very familiar! I started out with Glorfindel, Aragorn & Gandalf and also was not able to put enough damage on the Balrog. Direct damage effects would have been nice but Caleb ruled that the Balrog does not lose its immunity to player card effects after sacrificing a hero.\n\n \n\nAfter two weeks of trying out different things now and then, I finally had my breakthrough yesterday with Gimli as the main attacker. If you collect 3 copies of Khazad, Khazad! and get a Citadel Plate plus enough damage on him, he is a true killing machine. The successful victory over a Balrog actually made me wonder why some people on this forum think he was outdated and useless. I posted my complete deck here: http://boardgamegeek.com/thread/1256656/mostly-thematic-approach-defeat-balrog [http://boardgamegeek.com/thread/1256656/mostly-thematic-approach-defeat-balrog] (there are some allies in it that make it somewhat unthematic but they are not meant to participate in combat, so maybe you will be fine with that as well :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1308299","commentId":1308299,"userName":"Raven1015","timestamp":1414004678,"content":">  \n> \n> > Anyone else having trouble slaying the Balrog?\n> > \n> >  \n> > \n> > I'm playing highly thematic decks and that's the only way i want to play the Saga quests. Needless to say i will not fill my deck with endless amounts of allies to beat the Balrog. I want to play the quest like other quests i don't want to alter my deck to finish the Balrog off. I just can't get around his monstrous defense, it would be no problem at all if he weren't Immune to player card effects, there's just no way that i can get enough attacking power to kill him. He doesn't lose his immunity to card effects when i sacrifice a Hero on the bridge does he? \n> > \n> > I'm using Sam, Merry & Pippin for one deck and Aragorn, Legolas & Glorfindel for the other one. Any advice/tips/success-stories would be much appreciated.\n> \n>  \n> \n> This sounds very familiar! I started out with Glorfindel, Aragorn & Gandalf and also was not able to put enough damage on the Balrog. Direct damage effects would have been nice but Caleb ruled that the Balrog does not lose its immunity to player card effects after sacrificing a hero.\n> \n>  \n> \n> After two weeks of trying out different things now and then, I finally had my breakthrough yesterday with Gimli as the main attacker. If you collect 3 copies of Khazad, Khazad! and get a Citadel Plate plus enough damage on him, he is a true killing machine. The successful victory over a Balrog actually made me wonder why some people on this forum think he was outdated and useless. I posted my complete deck here: http://boardgamegeek.com/thread/1256656/mostly-thematic-approach-defeat-balrog [http://boardgamegeek.com/thread/1256656/mostly-thematic-approach-defeat-balrog] (there are some allies in it that make it somewhat unthematic but they are not meant to participate in combat, so maybe you will be fine with that as well :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]).\n> \n>  \n\n \n\nGimil is still a great choice if you really just need to hulk someone up to take on a big baddie. He's also great against Smaug, for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1308922","commentId":1308922,"userName":"MyNeighbourTrololo","timestamp":1414052504,"content":"My Road has finally Darkened :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1310382","commentId":1310382,"userName":"Narsil0420","timestamp":1414159579,"content":"I did a Gandalf-Beregond-Legolas Eagles deck and was able to get enough hit points to kill the Balrog but lost because of threat!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1310512","commentId":1310512,"userName":"Teamjimby","timestamp":1414164747,"content":"If you're looking for a thematic way to do heavy damage to the Balrog, I gave it my first try with my two handed decks consisting of Sam/Merry/Pippin (Sp) with Gandalf and Boromir allies and Legolas/Gimli/Aragorn (Lo).  I dropped a keeping count on Legolas in the beginning and he was able to build up 7 counters by the time the Balrog showed up.  By that point Gimli had taken 4 damage, picked up a Dwarven Axe, and got a second copy of keeping count, so he was swinging for 15 attack!  Unfortunately I was still on quest stage 3, so I didn't have an opportunity to push the Balrog into the pit and he eventually overwhelmed my defenses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1312042","commentId":1312042,"userName":"leptokurt","timestamp":1414317426,"content":">  \n> \n> > Just wondering, if I sacrifice hero Gandalf to make the Balrog lose all of his keywords, can I then sneak attack with ally Gandalf to place damage on the Balrog and kill him that way? Would be a really cool and thematic option. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n> \n> Yes you can! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  The hero is not added to the \"Fallen Heroes\" list until the scenario is won, so once hero Gandalf is out of play there is nothing stopping you from putting the ally version in.\n> \n>  \n\n \n\nI thought the Balrog only looses his indestructible keyword after you explore the bridge, but that he is still immune against player card effects...?!?\n\n \n\nETA: Just read the thread a bit further and realized that Caleb already confirmed that it's not possible.\n\nEdited October 26, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1312048","commentId":1312048,"userName":"leptokurt","timestamp":1414318223,"content":"After dozen or so attempts I finally defeated (solo) the Balrog with a Celeborn/Loragorn/Gandalf deck, containing almost every leadership and lore silvan ally. The main problem is to get enough ATT to kill the Balrog, and the quickly rising threat (with no threat reducing card inmy hand) prevents me from using Frodos ability too often. One of my favourite combos currently is O Lórien/Galadhrim Minstrel/ Tree People. It helps you to get out tons of allies and to let you use the Minstrels effect multiple times. You can also play Feigned Voices to take Naith Scout back to your hand to use her awesome combo eith Celeborn over and over.\n\n \n\nHowever, most of the time the Balrog finds me too early, and then the loss of allies plus the burden cards quckly kill my fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1313008","commentId":1313008,"userName":"Mich the One","timestamp":1414421568,"content":"The Road Darkens came to my mailbox last week and here are my initial thoughts after my only play so far.\n\n \n\nI made a Gandalf-Elrong-Spiritfindel deck and decided to take it on a spin through \"The Ring Goes South\" scenario. Thematically speaking, it was a bit of \"alternative history\", but still I was rather content with the deck. If there is anyone who should have been included in the Fellowship it was definitely Glorfindel, so I made up for that mistake. And active support of Elrond is also perfectly within theme. A bit of a Tolkien sandbox is what I look for in this game anyway, so as long as the consistency of the universum was preserved, I was happy. \n\n \n\nMechanically the main attraction and focus of my deck was to have fun with sneaking many allies into play through Vilya and Gandalf's abilities, and to see those new Gandalf toys in action. And Glorfindel (of the Spirit persuasion) was invited to the party for his low threat, as usual.\n\n \n\nTRGS scenario is a classic one. You need to quest quite a bit plus there is some fighting with challenging, but not too nasty enemies. You get a feeling of a perilous journey, which is your typical LotR LCG experience, but it manages to feel fresh without relying on weird gimmicks or fiddly bookkeeping chores. And the scenario's finale is a nice small twist involving the Watcher residing in the lake at the Durin's Door. All in all nicely done, logical, and works both thematically and mechanically. I would say it is a well balanced adventure. I see myself coming back to it.\n\n \n\nI beat \"The Ring Goes South\" on my first try, but I believe I was very lucky with drawing encounter cards. I was also fortunate enough to beat down my threat a lot during initial rounds, and then keep drawing mostly enemies. I could then pick the bad guys one by one. But what was more important, I managed to avoid amassing negative effects on the locations. So perhaps the most cruel effects just either did not come off during my game or were not that harmful in the long run.\n\n \n\nEven though my particular play was rather easy, the scenario can potentially be much nastier. It seems that it is a lot more difficult in multiplayer. The encounter card effects seem to be designed to stack up, so my bet it is that going two-handed makes for a different experience. Still, it does seem beatable, but I cannot really say more as a solo player.\n\n \n\nI had lots of fun. Cannot wait to replay and go through the other two quests from the box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1315199","commentId":1315199,"userName":"Nickpes","timestamp":1414560050,"content":"Had my first attempts yesterday, played only the ring goes south.\n\n \n\nFirst attempt was with Gandalf, Pippin (Lo) and Fatty with a pretty much thematic deck. Unfortunatelly failed cause , as I did not look the encounter cards before playing, I cruised untill stage 4 where I could not damage the Watcher enough even to free Frodo, thus lost out of threat eventually. \n\n \n\nThen I changed my deck a bit with a Gandalf, Pippin (Lo) and Merry deck. Again it was very thematic (with Pippes for everyone and allys from the book again). There with the help of Boromir ally, I managed to beat it with not so much of difficulty.\n\n \n\n Loved the Gandalf hero and his attachments ... needs planning and thinking of next possible moves, but it was really fun, and as always I appreciate the actions-responses that the hobbits provide"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1315336","commentId":1315336,"userName":"MyNeighbourTrololo","timestamp":1414577304,"content":"sf4oXy705dY.jpg [https://pp.vk.me/c619817/v619817574/214a7/sf4oXy705dY.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1316494","commentId":1316494,"userName":"Nickpes","timestamp":1414654598,"content":"Played the Journey through the Dark\n\n \n\nAgain won on my second attempt with the same deck as on first quest, with Balrog being on stage (did not sucrifice a hero) \n\n \n\nMuch more difficult than the first one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1321843","commentId":1321843,"userName":"Glaurung","timestamp":1415104534,"content":"Maybr in wrong but looks like the second saga box quest looks more easy then Black riders? Maybe couse FFG will release Nightmare pack in the future?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1321954","commentId":1321954,"userName":"tommifon","timestamp":1415110278,"content":"> Maybr in wrong but looks like the second saga box quest looks more easy then Black riders? Maybe couse FFG will release Nightmare pack in the future?\n\n \n\nIt's funny because from my experience Black Riders is much easier than Road. \nIn Black Riders, deck-building was simple because all quests from campaign got similar weak points to prepare for. \nIn Road Darkens, variety of quests is much bigger and burdens are more troublesome.\nMaybe it just depends on your playing style?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322394","commentId":1322394,"userName":"jjenks476","timestamp":1415128772,"content":"Road Darkens is actually much harder, especially the Breaking of the Fellowship. Black Riders was awesome but only A Knife in the Dark was ever troublesome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322526","commentId":1322526,"userName":"GrandSpleen","timestamp":1415133885,"content":"I had a much harder time with the Road Darkens quests compared to the Black Riders.\n\n \n\nI think Glaurung just wears rose-tinted glasses :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  All the new stuff is \"boring and easy\" whereas his favorite old ones are pleasantly difficult..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322658","commentId":1322658,"userName":"Bullroarer Took","timestamp":1415138518,"content":"I have an enormously long post I could make here but I'll try to keep it short.  Black Riders was a brilliant box, especially if you were trying to play the hobbits solo.  Playing solo in The Road Darkens isn't very satisfying because there aren't ally versions of all of the Fellowship members.  Playing solo with Tracker's decks for example (Gandalf, Sam & Strider) didn't have the same feel as The Black Riders did at all.\n\n \n\nSo I finally went two handed in order to add more of the Fellowship and... Holy ****!  It's SO much harder two handed.  In the Ring Goes South for example it's very easy to keep the board clear so that the forced effects on the locations never really trigger.  Playing two handed it's almost impossible.  Your hand and board state are under constant \"attack\" by the locations.  It's not because of surge cards at all.  (Which is what I thought it was until I played it two handed.)\n\n \n\nAnyway, it's a much better experience this way and gets me much closer to that Black Riders feel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322855","commentId":1322855,"userName":"PsychoRocka","timestamp":1415149730,"content":"Yeah I played them all two handed and found them a fair bit more difficult than Black Riders. Only A Shadow of the Past ever really gave me much grief, A Knife in the Dark was hard but not that hard for my decks and play style and A Flight to the Ford was always the easiest of the three to me. I don't feel like any of them are too easy though, I feel like they found the perfect difficult with Black Riders.\n\nAlthough somewhat harder I feel like The Road Darkens was the perfect difficulty as well. I found it especially hard to defeat The Balrog and resurrect the sacrificed hero which took a handful of attempts but was super worth it.\n\nI can definitely imagine all three Road Darkens scenarios are much easier solo. Locations would barely get any damage in the ring goes south, you can escape Journey in the Dark before the Balrog even appears (which doesn't seem doable with 2 or more players unless you run uber/dodgy decks) and for Breaking of the Fellowship if there is only one player you don't get to experience one (or more) player helping from stage 3 and one player trying to beat stage 4. Mechanically they don't seem to work very well solo either, especially Breaking of the Fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322858","commentId":1322858,"userName":"PsychoRocka","timestamp":1415149868,"content":"Well to me personally this definitely helps prove my theory that two handed in general is harder than solo. I know many will disagree and this is after all just one saga box but solo is definitely far easier than two handed play for The Road Darkens no doubt about it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322950","commentId":1322950,"userName":"Djenni","timestamp":1415157237,"content":"> Well to me personally this definitely helps prove my theory that two handed in general is harder than solo. I know many will disagree and this is after all just one saga box but solo is definitely far easier than two handed play for The Road Darkens no doubt about it. \n\nYou speak the truth my friend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1322958","commentId":1322958,"userName":"GrandSpleen","timestamp":1415157960,"content":"I think a lot of folks will agree that 2 players is the 'sweet spot' for this game.  Some quests get a lot easier the more players you add (Conflict at the Carrock, A Journey to Rhosgobel), while some get profoundly more challenging (Into Ithilien comes to mind), and some seem to ... break with more players (Steward's Fear you're going to deplete the Underworld deck very quickly with 4 players).\n\n \n\nI think the Saga expansion difficulty is very nice... what should be hard, is hard, and what should be less challenging, is so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1323021","commentId":1323021,"userName":"Glaurung","timestamp":1415163926,"content":"I just get myRoad Darkens ad still didn try yet. But im happy to hear im wrong about diffuculty level. Cool!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1323210","commentId":1323210,"userName":"monkeyrama","timestamp":1415185752,"content":"Still to try Road Darkens two handed, but solo it's pretty easy, as noted above especially because you can avoid nasty effects triggering at all in the first scenario. Could also be that none of the quests, I think, punish you for low threat, so a potent low threat hero team can eat alive these scenarios in solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1323299","commentId":1323299,"userName":"Nerdmeister","timestamp":1415194941,"content":"> Just wondering, if I sacrifice hero Gandalf to make the Balrog lose all of his keywords, can I then sneak attack with ally Gandalf to place damage on the Balrog and kill him that way? Would be a really cool and thematic option. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nNo.\n\n\"Immune to player cards\" is not defined as a keyword.\n\nThink the only defined keyword on Balrog is \"indestructable\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1323403","commentId":1323403,"userName":"GrandSpleen","timestamp":1415201389,"content":"But! You could sneak attack Gandalf and then use his attack power to contribute to taking the Balrog down :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1328903","commentId":1328903,"userName":"Courchevel","timestamp":1415616993,"content":"Great play this past week end with The Road Darkens Campaign ...\n\nIn fact, as our third player changed his deck, we restarted from the black riders the whole campaign :\n\nFirst player was playing :\n\nBeregond/Beorn/Glorfindel (blue)\n\nSecond player changed his deck (outland deck before) to :\n\nIdraen/Eleanor/Legolas\n\nAnd I was still playing my full ladies deck :\n\nCaldara/Eowyn/Galadriel\n\nSo yes, only two spheres in 3 decks, and yes, 7 ladies, a warrior and a Bear (considering that those elvish are so girly ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ).\n\nThe 3 black riders quests were pretty easy with those decks. Then watcher and Balrog were tough ennemis. However, we went through, with Balrog down (with a flame of anor on a \"hobbit\" Gandalf and a last attack of Legolas and a Black arrow).\n\nWe did not find the time to start the Breaking of the Fellowship due to time constraint. We should finish it soon.\n\nMVP of these quests was almighty Caldara (with Fortune and Fate) ... All bad conditions encountered always going to her. She never received any good attachment from her companions, however she manages to always come back on board. Of course, it was her that sacrifices herself to the Balrog. No burden penalty at the end, as Caldara was back on stage ... One aspect of the quest not really funny was the 2 remaining rounds after Bally was crushed that were .... Euh .... Boring.\n\nFor the deck building aspect, I really enjoyed adding \"hobbit Gandalf\" to my Caldara deck ... It brings more variety and different possibility to cope with difficult situation. Of course, my partners were not playing Standard Gandalf.\n\nThe deck :\n\nCaldara/Eowyn/Galadriel\n\nAllies : 23\n\n3 Gandalf\n\n3 Zigil miner\n\n3 Imladris Stargazer\n\n3 Ethir Swordman\n\n3 Emery\n\n3 Northern Tracker\n\n1 Elfelm\n\n1 Treebeard\n\n1 Arwen\n\n1 Bilbo\n\n1 Dwalin\n\nAttachments : 9\n\n3 Map of Earnil\n\n2 Gandalf staff (used 2 times for ressources and all other times for drawing)\n\n1 wizard pipe (combine really well with hidden cache, flame of anor and zigil miner)\n\n1 hobbit pipe\n\n2 unexpected Courage\n\nEvents : 18\n\n3 Elrond Counsel\n\n3 Hidden Cache\n\n1 Free to choose\n\n1 Hasty Stroke\n\n1 Flame of Anor\n\n2 Dwarven Tomb\n\n3 Test of will\n\n2 Galadrim greetings\n\n2 Fortune or Fate\n\nWith Sting and Noble hero as boon.\n\nAt the end of the moria, I was ensuring +3 draws almost each round with Galadriel, Gandalf Staff and hobbit pipe.\n\nMike\n\nPS : we are not sure to have played correctly something. We have mr. Underhill in the Campaign log so we set up it in each quest ... This seems really not fluff ... Strange to see Frodo escaping an attack from an Orc Chieftain due to his secret identity. However, we did not see why we shouldn't add it during set up, and furthermore, we thought that, if we choosed Gildor, we would have add him in the encounter deck as well. So were we wrong ?\n\nEdited November 10, 2014 by Courchevel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1342050","commentId":1342050,"userName":"Courchevel","timestamp":1416581251,"content":"So we finally played the breaking of the fellowship and managed to get through ... But at what costs !\n\nBasically, we did not read anything on the quest before playing it, thus we choosed 3A stage only based on their titles (not reading 3B), and that costs us a lot in term of strategy.\n\nI had the chance to discard frodo's choice (as a shadow card though), and we had to have my partners sacrifice themselves in order to let me escape (as Boromir in the book). But knowing the effect of the different stages 3, the choices would have been different I guess.\n\nOn the good side, I had all my heros at the end of it. But we had to use golden hairs and the lembas from Galadriel gifts.\n\nI did not enjoy much the quest as the encounter deck is full of \"surge\" cards. Playing 3 players game, we had regularly 6-9 cards revealed during quest, not mentionning stage 4 where de facto you have 6 encounters cards to be revealed going up to 12 cards revealed due to different surge effects.\n\nConclusion : tough quest, but not really fun to me ... Need to be replayed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1342053","commentId":1342053,"userName":"MyNeighbourTrololo","timestamp":1416581380,"content":"Well, you just created an artificial difficulty for yourself by playing it blind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1342114","commentId":1342114,"userName":"leptokurt","timestamp":1416583965,"content":"> MVP of these quests was almighty Caldara (with Fortune and Fate) ... All bad conditions encountered always going to her. She never received any good attachment from her companions, however she manages to always come back on board. Of course, it was her that sacrifices herself to the Balrog. No burden penalty at the end, as Caldara was back on stage\n\nNo, Caldera is dead. She is no more, she has ceased to be, she is bereft of life, she rests in peace.\n\n \n\nThe Balrog killed her, which is something different as triggering her action."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124171-feedback-on-road-darkens/?do=findComment&comment=1345164","commentId":1345164,"userName":"TheRealGreenman","timestamp":1416856608,"content":"Played with Pippin(lore)+Sam+Merry and Glorfindel(spirit)+Aragorn(lore)+Gandalf. First one a ally heavy deck with Sam as defender and Merry as attacker. Second one a ranger and traps deck. Did very well on first two quests but got killed on third one.\n\nLot of fun quests and good challenge. Third one definitely the hardest.\n\nEdited November 24, 2014 by TheRealGreenman"}]}