{"url":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/","title":"Limits once per X","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1289988","commentId":1289988,"userName":"DaeMord","timestamp":1412621524,"content":"okay so im aware that limit once per game is limited per player, and im fine with this\n\n \n\ni was reading the unoficial faq which linked to a link on a french forum that had a responce apparently from caleb saying that once per round abilities could be triggered again if the card in question left play and we replayed the same round.\n\nThe example given was if Erestor was in play and you used his ability, he then left play and you for instance sneek attack him back into play you could use his ability again.\n\nonce again, still fine.\n\n \n\nSo here is my question, what about once per phase, and i ask this question because put simply i have no idea which of the above rulesets apply to \"once per phase\" the only thing i can find is that once per phase and once per round function \"as written\" so maybe i should lump them in together but then this makes me question \"what about the events, can i simply use them over and over ignoring this\" that seems a bit silly as what would be the point.\n\n \n\nSo yeh bit confused and wondering if anybody can clarify for me what ruling \"once per phase\" uses and how this applies to events, thnx.\n\nEdited October 6, 2014 by DaeMord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1290011","commentId":1290011,"userName":"wlk","timestamp":1412622047,"content":"Not really answering your question, but I don't like playing these so called exceptions.\n\nTo me, once per game should be per game regardless of how many players, and per round should be per round even if you play the card back.\n\nThis is way more simple to figure, and by passing these limitations using some \"oh wait, I played it again, so the effect is new\" excuse looks like \"cheating\" to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1290169","commentId":1290169,"userName":"DaeMord","timestamp":1412627149,"content":"i do not disagree with you, but i do like to make sure i follow rules as erm confusing as they may be some times.\n\n \n\ntbh the only one i have used is lore aragorn myself, but the question did come up in conversation and non of us had an answer, did some digging and only got more confused, so i figured i would ask."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1291513","commentId":1291513,"userName":"Teamjimby","timestamp":1412710231,"content":"The way I understand it, the limits on characters and events apply per person and the per turn or per phase abilities refresh if the cards leaves play and enters again.  I don't think Aragorn's per game ability would refresh if he was returned with Fortune or Fate.\n\n \n\nThis doesn't make sense for events, because the limit wouldn't mean anything.  The only ones I find after a quick search are Heavy Stroke (limit once per phase), Desperate Alliance (limit once per phase) and Tree People (you can only play 1 copy each phase).  Tree People came out after the Aragorn ruling, so I suspect they changed the language to clarify."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1295027","commentId":1295027,"userName":"Jban","timestamp":1412915902,"content":"Landroval and Aragorn are clear once per player once per game actions in my games. Every player could use the Landroval option 1x and every player could use the Loragorn option 1x.\n\nFor once per phase/round, I also try to follow a similar logic. Events are clear to me(just 1 copy per phase/round) but for instance if you succeed to put Erestor into play multiple times in a round, I only use it's abilty once, because Erestor could only be used 1x per round.\n\nIf multiple players succeed to play him in the same round, they can all trigger it 1x. I don't know an official ruling for this, but this seemed the most natural way to play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1297791","commentId":1297791,"userName":"DaeMord","timestamp":1413194167,"content":"i agree that is the most natural unfortunately there is an official rulling on the once per round, and thats simply if you have erestor and use his ability and he then dies and you reserect him or play another one in some way you can use his ability a second time.\n\n \n\nI may not agree with it but that is the official ruling, the issue with this is once per phase, as there is events that have this on them, and if you use the logic of either once per round then it means absolutely nothing, yet we have had it officially said that once per round and once per phase use basicly the same thing, this is why i am confused."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1298913","commentId":1298913,"userName":"Jban","timestamp":1413270693,"content":"So according to that ruling, I just made my life a little bit harder. \n\nWould probably be 2 times at most that this situation occured where I didn't trigger Erestor 2x ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1313987","commentId":1313987,"userName":"Dwarf king Bronze beard","timestamp":1414483378,"content":"WOOT! Can we use Loragorn´s ability twice per game if i give him to my friend with desperate alliance and then i normally use hes ability to me? That would be reeaaallly cool :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124252-limits-once-per-x/?do=findComment&comment=1314005","commentId":1314005,"userName":"FetaCheese","timestamp":1414488387,"content":"> WOOT! Can we use Loragorn´s ability twice per game if i give him to my friend with desperate alliance and then i normally use hes ability to me? That would be reeaaallly cool :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nYes you can do that. Because Aragorn is king."}]}