{"url":"https://community.fantasyflightgames.com/topic/124226-action-windows-with-green-background/","title":"Action windows with green background","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124226-action-windows-with-green-background/?do=findComment&comment=1289476","commentId":1289476,"userName":"Julia","timestamp":1412598092,"content":"Another noobish question (sorry... I think I have one hundred more...). The turn sequence scheme, as reported on pag 30 of the core rules, says that\n\n \n\n\"green: any player can take any actions generally, or between the game steps stated in the rules\"\n\n \n\nThis rule is not 100% clear to me. Allow me to go with an example:\n\n \n\nQuest phase, step one: players commit characters to quest\n\n \n\nit has a green background, so I read this as:\n\n \n\n\"any time, while committing characters to a quest, I'm allowed to play event cards. So, for instance, I can use Sneak attack to play Gandalf and have him questing; at the end of the quest phase, he returns to my hand\"\n\n \n\nIs this reading correct?\n\n \n\nThe thing that confuses me is looking at the structure of the Planning Phase: if my reading is correct, then what's the need of the two green \"player action\" boxes? I understand the need to use boxes to show that playing players actions is legit between bullet point 2 and 4 of the Quest phase, but why between bullet point 1 and 3 of the Planning Phase? Being both bullet point 1 and 3 of the planning phase green, it should be automatic that you can play actions whenever you want. Or?\n\n \n\nThanks for help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124226-action-windows-with-green-background/?do=findComment&comment=1289505","commentId":1289505,"userName":"alogos","timestamp":1412600273,"content":"Box are preaty.\n\nYou're playing it right, don't bother. (yes, you can sneak attack gandalf and commit him to quest)\n\nAlso, it may be because player 1 is the only one to play ally and attachement, and then it is player 2 turn, etc... so player 1 cannot play attachement on player 2 ally that enter play the same turn. But this does not prevent player 2 to play event action during player 1's turn.\n\n \n\nAlso, note that player, one by one, declare all there commiting characters. You can't play action when player X is choosing a character and then another, only before and after he decided all his characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124226-action-windows-with-green-background/?do=findComment&comment=1289518","commentId":1289518,"userName":"Julia","timestamp":1412601220,"content":"Indeed. Importance of first player token and sequence of declarations were clear to me, but thanks for the reminder (one more confirmation never hurts)\n\n \n\nGood to know I was playing it correctly, thanks a million for the answer :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}