{"url":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/","title":"Doomed cards in separate staging areas","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1290059","commentId":1290059,"userName":"GrandSpleen","timestamp":1412623730,"content":"When the players are divided into separate staging areas, will Doomed player cards raise the threat of all players, or only those players who are sharing a staging area where the Doomed card was played?\n\n \n\nI assume it's the latter, but wanted to run it by you all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1290223","commentId":1290223,"userName":"chuckles","timestamp":1412629669,"content":"I would assume so...\n\n \n\nfrom foundations of stone:\n\nCreating a Staging Area\nWhen instructed to “Create your own staging area,” each \nplayer sets aside an area in front of himself to serve as \nhis own private staging area. Only players that share a \ncommon staging area can interact with each other in any \nway\n \nI'm not sure if every time that you create or are in separate staging area whether it is the same rules that apply? ...if so then - Yes! ...unless of course doomed is treated as an exception like uniqueness!\nEdited October 6, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1290531","commentId":1290531,"userName":"PsychoRocka","timestamp":1412647718,"content":"I don't believe it is the same rules as in an article a while back for The Road Darkens I very specifically remember them comparing it to Foundations of Stone but saying that players can still help each other via the use of Ranged and Sentinel keywords and playing cards on each other etc but just being in seperate staging areas. This makes sense as they are all fighting in the one area, just seperated by the chaos of a surprise attack and trying to find and protect Frodo at the same time whereas in Foundation of Stone you are literally in different areas of the cave completely isolated. Will have to make sure this is the case (probably in the rules insert for the road darkens) but pretty sure it is! Doomed for this particular quest therefore may very well raise both players threat instead of just whoever reveals it! Can anyone with Road Darkens confirm and let us know what the rules are for the seperate staging areas in Breaking of the Fellowship?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1290545","commentId":1290545,"userName":"GrandSpleen","timestamp":1412648891,"content":"I was actually thinking about Fog on the Barrow Downs -- I know almost nothing about that quest, but I looked at a spoiler on one of the quest cards and (minor spoiler alert) it sounded like the players would get split up at one point.  I'm going to the Fellowship event this weekend so I'm building a deck for that.\n\n \n\nBut for Breaking of the Fellowship, PsychoRocka is right.  From the rules insert: \"Unlike previous scenarios with separate staging areas, players may continue to interact with each other through the normal rules of the game.\"  So Doomed would hit everyone in this case.  I'm reasonably sure that it would not hit everyone in Flies and Spiders and in Foundations of Stone.\n\n \n\nBut now I want to know more about Fog on the Barrow Downs!  To Doomed or not to Doomed...\n\n \n\n(edited to correct quest name)\n\nEdited October 7, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1290611","commentId":1290611,"userName":"chuckles","timestamp":1412652660,"content":"Ah... then I guess it comes down to the specific quest rules... which doesn't help you leading into your event :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nand I agree that doomed would effect other players in the Breaking of the Fellowship (based that rules insert) and wouldn't effect other players in Flies and Spiders & Foundations of Stone based on the specific rules for those staging area's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1832364","commentId":1832364,"userName":"cmabr002","timestamp":1443917308,"content":"I just had this same exact question for Fog on the Barrow Downs.  We played it that the doomed does affect both players, but the text in the rule doesn't really convince me one way or the other.\n\n \n\n> Creating a Staging Area When a player is instructed to create his own staging area, he sets aside an area in front of himself to serve as his own separate staging area. Players continue to resolve each phase of the game in turn order, starting with the first player, but the resolution of each phase occurs as if only the player or players that share any given staging area are present in the game. Players cannot affect players or cards that do not share a common staging area. The players as a group still cannot have more than 1 copy of a unique card in play. During the encounter phase, players only reveal 1 card per player that shares their staging area. Encounter card effects are limited to players and cards at that stage. Effects that reference 'each player' only affect each player at that staging area.\n\n \n\nThis whole paragraph is referencing encounter card effects, so I believe the bold sentence at the end is supposed to imply \"encounter card effects that reference 'each player' only affect each player at that staging area.\"  However, perhaps it truly is meant to affect doomed on player cards as well...\n\n \n\nThe only other somewhat relevant portion from the rules insert is the following:\n \n\n>  \n> \n> Encounter cards with the Doomed X keyword still affect each player.\n\n \n\nNow, you could use this rule as a benchmark for player cards with doomed, or you could just argue that it says encounter cards and specifically excludes \"player cards\" for the reason that doomed on player cards is not supposed to affect each player regardless of their current stage.\n\n \n\nIf you read the rules insert literally here, then I see no reason why doomed on player cards would affect players at different staging areas.  However, I think the intent from the designers is that doomed should still affect all players regardless of staging area. I suppose the other players would not be allowed to benefit from the effect, which is really odd, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1832631","commentId":1832631,"userName":"Teamjimby","timestamp":1443932974,"content":"Eh, if it says encounter cards with doomed affect each player, I would assume player cards also affect each player.  We're getting into Seastan-esque hair splitting here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1832674","commentId":1832674,"userName":"GrandSpleen","timestamp":1443935991,"content":"> Eh, if it says encounter cards with doomed affect each player, I would assume player cards also affect each player.  We're getting into Seastan-esque hair splitting here.\n\n \n\nHah! Man, that guy got a reputation fast :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1832837","commentId":1832837,"userName":"cmabr002","timestamp":1443949680,"content":"> Eh, if it says encounter cards with doomed affect each player, I would assume player cards also affect each player.  We're getting into Seastan-esque hair splitting here.\n\n \n\nI agree that it is hair splitting and that doomed on player cards would still affect each player regardless of staging area, but I can't say that with confidence. \n\n \n\nThe only thing I'm confident about is my confusion surrounding rules and separate staging areas. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1833023","commentId":1833023,"userName":"sappidus","timestamp":1443968690,"content":">  \n> \n> > Eh, if it says encounter cards with doomed affect each player, I would assume player cards also affect each player.  We're getting into Seastan-esque hair splitting here.\n> \n>  \n> \n> Hah! Man, that guy got a reputation fast :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\n \n\nlol, well, you gotta know the nuances of anything you're trying to break, right? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nWe love ya, Seastan!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1834107","commentId":1834107,"userName":"NathanH","timestamp":1444029411,"content":"The Fog On The Barrow Downs rules don't have an exception for player cards with Doomed X, so they should be treated just like any other effect. The Voice of Isengard rules show that the \"Doomed X on player cards\" effect references \"each player\" and therefore the default Fog on the Barrow Downs rules should cause this to only affect the players at this stage.\n\n \n\nI don't think this is even hair-splitting. Doomed on encounter cards usually isn't something that immediately affects the current game situation, unlike most encounter card effects: it's just winding up the \"doom clock\". With that in mind, a given 2-card staging (for a two player game) should deal out the same total threat from Doomed whether those 2 players are in the same staging area or in different ones. This is distinct from most encounter card effects. I assume this is why Doomed is the exception in the rules.\n\n \n\nOn the other hand, Doomed player cards are usually things that immediately affect the current game situation. The Doomed cost is a cost for this game-changing effect. Since the game is only being changed for the players at this stage, it is reasonable for only them to pay the cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1834397","commentId":1834397,"userName":"Seastan","timestamp":1444049661,"content":":ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1834914","commentId":1834914,"userName":"Teamjimby","timestamp":1444065440,"content":"You might very well be right (Seastan often is).  By hair-splitting, I meant that it is such an edge case (one specific quest, a handful of specific player cards) and it has a minor effect on the game, so I would just apply the golden rule of assuming the worst.  But if you want official clarification, I suggest asking Caleb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1834968","commentId":1834968,"userName":"Seastan","timestamp":1444067215,"content":"I wouldn't argue for any hair-splitting here. There's never been a ruling to my knowledge that the Doomed X on player cards behaves any different than Doomed X on encounter cards.\n\n \n\nThat being said, I don't think you'll be very popular if you're playing doomed cards and raising everyone's threat, while only you get the benefit... :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1838319","commentId":1838319,"userName":"cmabr002","timestamp":1444226307,"content":"I asked Caleb.\n\n \n\n>  \n> \n> Q: When the players are divided into separate staging areas in the Fog on the Barrow-downs, will Doomed \"player cards\" raise the threat of all players, or only those players who are sharing a staging area where the Doomed card was played?\n> \n>  \n> \n> Caleb: No. While playing Fog on the Barrow-downs, players and player cards cannot be affected by player cards at a different stage. So, if you play a doomed card at your stage, a player at a different stage will not raise his threat.\n\nEdited October 7, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124254-doomed-cards-in-separate-staging-areas/?do=findComment&comment=1838378","commentId":1838378,"userName":"Seastan","timestamp":1444228112,"content":"Of all days to give up hair-splitting....\n\n \n\n \n\nThanks for the clarification!"}]}