{"url":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/","title":"Leaving game vs discard from play vs return to your hand","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1290331","commentId":1290331,"userName":"Julia","timestamp":1412633933,"content":"Ok, wording. I know, it should be probably be buried somewhere in the rulebook or in the FAQ. I tried to search for the answer, but it seems like the FAQ for a newcomer is like a 7-stages quest requiring too many progress tokens for my party. Hence, the question:\n\n \n\nSneak attack: allows me to play 1 card from hand; the card remains in play for the rest of the phase, and then returns to my hand.\n\n \n\nAll clear so far. Then we have the Descendant of Thorondor [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/the-hills-of-emyn-muil/descendant-of-thorondor-thoem], whose text reads:\n\n \n\nResponse: After Descendant of Thorondor enters of leaves play, deal 2 damage to any 1 enemy in the staging area.\n\n \n\nSo, let's say that I sneak attack Descendant of Thorondor. The card enters play, dealing two damages to one enemy in the staging area. At the end of the phase, the card returns to my hand. Is this leaving play so that I'm allowed to score 2 more damages to an enemy in the staging area (probably the same I hit before)?\n\n \n\nIn the same way, may I play Valiant Sacrifice [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler] after Gandalf is discarded from play at the end of the round? or when one of the lower importance Eagles (such as Vassal of the Windlord [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/the-dead-marshes/vassal-of-the-windlord-tdm]) is added as attachment to Eagles of the Misty Mountains [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/shadows-of-mirkwood/return-to-mirkwood/eagles-of-the-misty-mountains-rtm]?\n\n \n\nThanks (again) for help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1290372","commentId":1290372,"userName":"chuckles","timestamp":1412635622,"content":"I believe yes to all three\n\n \n\n1) Descendant of Thorondor is leaving play by returning to your hand (sneak attack).\n\n2) Gandalf departing is valid for triggering Valiant Sacrifice response\n\n3) Vassals/Guardian & Misty - According to the card (Misty) it was only after it left play that it could be attached."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1290382","commentId":1290382,"userName":"Julia","timestamp":1412635944,"content":"Ok, good to know then! Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1290391","commentId":1290391,"userName":"chuckles","timestamp":1412636298,"content":"Certainly sounds like you are getting good value from your eagle cards, based on the number of eagle related questions :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1290757","commentId":1290757,"userName":"Julia","timestamp":1412667461,"content":"Yeah, I'm just trying to understand how the deck / the cards work, so that I'm actually slowing down the pace of the game to play more cards and test dfferent combos. And results are interesting: in my first attempt at Journey down the Anduin played yesterday, I double sneak-attacked Descendant of Thorondor, basically nuking the Troll in the staging area without him being able to threat anyone. When the troll moved, I had Feint, and on round three I deployed Descendant of Thorondor \"normally\" (i.e., no Sneak Attack) for the last two damages. No need to actually ever defend on it.\n\n \n\nIt's an interesting deck, and having a lot of fun with it!\n\n \n\nI'm just wonderng a little about the cards from the SoM APs: Tactics got eagles, Spirit got Rohan, Lore got Elves, but Leadership? The Dunedain specific attachments, even if interesting, do not seem to be as valid as the boosts got for the other decks.\n\n \n\nAnythoo, time will tell!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1291678","commentId":1291678,"userName":"chuckles","timestamp":1412716568,"content":"^ Nice... I like hearing about other players adventures... tends to inspire me to try similar decks, adventures. Eagle adventures through Mirkwood does sound very appealing at the moment.\n\n \n\nOf the Dunedain attachments I got plenty of use out of the +1 axe and especially the +1 shield (low cost, not restricted and even transferable)... doubt I have ever used the other ones. Initially solo'd using Aragorn a lot ... Quest, ready defend or attack... all three if I managed to get totally expected courage on him!\n\nEdited October 7, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1291698","commentId":1291698,"userName":"Julia","timestamp":1412717648,"content":"Yeah, +1 Axe and +1 Shield sound sweet, but I'm a little worried that they could clog a little the deck. Dunno. Best way is to try this out!\n\n \n\nHappy if this little chat has brought you to mind some ideas for other adventures :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1389027","commentId":1389027,"userName":"pumpkin","timestamp":1420155636,"content":"> ...When the troll moved, I had Feint, and on round three I deployed Descendant of Thorondor \"normally\" (i.e., no Sneak Attack) for the last two damages. No need to actually ever defend on it.\n> \n>  \n\nDoT can only apply its damage on entering/leaving to enemies in the staging area - if the troll engaged on round two (and you used feint) it would't be an eligible target for DoT's damage on round 3 as it would no longer be in staging.\n\nJust saying..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124272-leaving-game-vs-discard-from-play-vs-return-to-your-hand/?do=findComment&comment=1392514","commentId":1392514,"userName":"Julia","timestamp":1420414885,"content":"Yeah, true, there was something moving him back to staging, I guess. Too much time since the previous posts, and too many games played in between to remember that game, but clearly DoT works only on enemies in the staging area."}]}