{"url":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/","title":"Black Riders when revealing from encounter deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1291402","commentId":1291402,"userName":"isthar","timestamp":1412706493,"content":"Apologies if this is answered in some buried thread...\n\n \n\nBlack Riders, A Shadow of the Past, Stage 2, A Shortcut to Mushrooms\n\n \n\n\"When a player fails a Hide test, each Nazgul enemy in the staging area engages that player.\"\n\n \n\nOkay.\n\n \n\nYou're staging. Card from encounter deck is revealed, a Nazgul (Black Rider)\n\n \n\n\"Hide 2. Cannot have non-Morgul attachments.\n\nForced: After engaged player fails a Hide test, Black Rider makes an immediate attack.\"\n\n \n\nYou do the Hide test. You fail it.\n\n \n\nDoes this Black Rider you have in your hand engage you (per Stage 2A) or not?\n\n \n\nI believe it does not: it is not in the staging area, as it is being revealed still.\n\nBut some folks on other threads seem to think it will engage you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1292277","commentId":1292277,"userName":"wlk","timestamp":1412752949,"content":"Good point.\n\nI used to also engage the just revealed Nazgul, but by strictly following the rules, considering he will indeed enters the staging area after resolving the hide/when revealed, he should probably not engage.\n\nThis makes the quest much more easier I guess, and is a bit odd thematically: why failing a hide would let you avoid that actual Nazgul ?\n\nMoreover, if no Nazgul is lurking in the staging area, you don't even have to try to succeed the hide test then.\n\nI guess he was designed to engage you, but I cannot figure how to explain it with the rules.\n\nYou should send the question to Caleb.\n\n \n\n> - Enemies are added to the staging after resolving their “when revealed” effects. (FAQ 1.6 page 15)\n> \n> - If the encounter card with the Hide X keyword also has a “When Revealed” or “Forced” effect, the Hide test must be resolved before resolving the rest of the card. (BR Rulebook page 7)\n\nEdited October 8, 2014 by wlk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1292541","commentId":1292541,"userName":"GrandSpleen","timestamp":1412776779,"content":"You know, it looks like you're right, and failing a Hide test triggered off of a Black Rider just revealed from the encounter deck will not cause that Rider to engage and attack you.  There's this bit in the BR rule sheet:\n\n \n\n\"If the encounter card with the Hide X keyword also has a “When Revealed” or “Forced” effect, the Hide test must be resolved before resolving the rest of the card.\"\n\n \n\nSo Hide tests are resolved before When Revealed effects.  When Revealed effects are resolved before adding the card to the staging area (from this bit in the FAQ: \"Q: When an enemy makes an attack as part of its “when revealed” effect, is that enemy in the staging area? A: No. Enemies are added to the staging after resolving their “when revealed” effects.\")\n\n \n\nSo if a Rider is revealed, and you fail the Hide test, he is not in the staging area, and will not engage or attack you.  Other riders who were already in the staging area, of course, will do so.\n\n \n\nIt all follows the rules very well, but to be honest I have never played it this way, as I thought the Rider would engage.  I wonder if this was the intended sequence of events?  This is significantly easier ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1293452","commentId":1293452,"userName":"PsychoRocka","timestamp":1412815991,"content":"This is insane.... I've never really thought of this but its a very valid point.\n\nIt seems like oversight or a mistake from the developers though, surely this is not the way you are meant to play.\n\nThe quest is about one tenth (perhaps even less) the original difficulty if this is indeed how its meant to be played...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1293872","commentId":1293872,"userName":"isthar","timestamp":1412856997,"content":"I really didn't think I stumbled on such an insane point, hey, imho the quest is actually reasonably hard as it is! It just buys you a small breather... you still have to hurry to get the nazgul's killed if they ever show up... I sent a question to FFG via the web site feedback thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1293878","commentId":1293878,"userName":"PsychoRocka","timestamp":1412857309,"content":"Yeah definitely post that here...... if I've randomly been playing some sort of uber difficult version of this quest every time I've ever played it I will be quite shocked!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1293998","commentId":1293998,"userName":"isthar","timestamp":1412865187,"content":"Well, those of you suspecting the intent of the designer... you win! (I just figured it was so obvious that staging area != card in hand...)\n\n \n\n> Your interpretation of the timing is correct. Unfortunately, that’s not how the scenario is intended to work. When a Black Rider is revealed and you fail its Hide 2 test, it is meant to engage you and attack. I think everyone involved in developing this scenario understood this intent so intuitively that no one bothered to scrutinize the timing as closely as you have.\n> \n>  \n> \n> As a result, it will probably be necessary to errata each quest stage to change the phrase “each Nazgul enemy in the staging area” to “each unengaged Nazgul enemy in play.” In the meantime, you can choose to play it as written or as intended. Either way, I hope you’re enjoying The Black Riders!\n>  \n> \n> Cheers,\n> Caleb\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1294316","commentId":1294316,"userName":"wlk","timestamp":1412877491,"content":"> (I just figured it was so obvious that staging area != card in hand...)\n\n \n\nTBH, that's not that obvious.\n\nUsually I reveal the card as physically putting it in the staging area (so resolving the when revealed after) even though I'm aware of tweaking the order, and most of the time it's not significant.\n\nThe core rules was not so clear about it. Only the FAQ made it explicit, so I guess we took a bad habit.\n\nSo did the designers/playtesters :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'll try to turn the encounter card face up first, checking for keywords, then moving it to the staging area.\n\n \n\nGood news is that we all played it as intended.\n\nEdited October 9, 2014 by wlk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124333-black-riders-when-revealing-from-encounter-deck/?do=findComment&comment=1294861","commentId":1294861,"userName":"PsychoRocka","timestamp":1412901570,"content":"Wow yeah so it is the way we've all always played it. Funny that the mistake has been overlooked for so long."}]}