{"url":"https://community.fantasyflightgames.com/topic/124559-can-i-overkill-indestructible-enemys/","title":"Can I &quot;overkill&quot; indestructible enemys?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124559-can-i-overkill-indestructible-enemys/?do=findComment&comment=1295538","commentId":1295538,"userName":"Crabble","timestamp":1412955732,"content":"So I'm asking this question especially because of Durin's Bane in the Shadow and Flames scenario. He regenerates 3 damage in the refresh phase before there is the action window for player actions (and with that the opportunity to use the Dark Pit action). So if I want to use the Dark Pit action in this or later rounds after damaging Durin's Bane it would be nice to place more damage then 27 (his HP) on him.\n\n \n\nAs an example: Durin's Bane hast already taken 25 damage and raging Gimli swings at him with 8 attack Durin's Bane would normally take 5 damage. Now will there be:\n\na) 30 damage on him and after regeneration he would still have 27 damage and by that making me autosucceed if this stays the same until I use the Dark Pit action?\n\nOr will it be\n\nb) 27 damage on him (because this is his max. HP) and after regeneration he would have 24 damage so that I still need cards with combined costs of 3+ to succeed with the Dark Pit action?\n\n \n\nMy guess is b) because it's worse for the players which normally is the right case in such situations and also the wording for Indestructible in the Shadow and Flames rulesheet is \"...even when it has damage EQUAL to its hit points\" and not \"...even when it has damage EQUAL OR HIGHER to its hit points\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124559-can-i-overkill-indestructible-enemys/?do=findComment&comment=1295570","commentId":1295570,"userName":"alogos","timestamp":1412957761,"content":"I was suprised myself, but I asked not too long ago Caleb and got response A."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124559-can-i-overkill-indestructible-enemys/?do=findComment&comment=1296478","commentId":1296478,"userName":"Jban","timestamp":1413036699,"content":"I always used the option A in my games.\n\n \n\nSomething I thought quite logic because whenever an enemy attacks us we also consider the total attacking value of that enemy (and not not the required attacking value to kill). The excess damage is ignored most of the times but it effects us rather frequently.\n\n \n\nExample:\n\n \n\nFrodo (CatC) defends an attack made by the Ungoliant Spawn. There is no shadow effect, and we use Frodo's ability to raise 3 instead of losing Frodo. So the complete attack value resolves, and you had to assign 3 damages to Frodo. In case B, you should only raise 2 for Frodo because he Frodo can't take anymore damages.\n\n \n\nSo for us attacking an enemy it isn't different, if we deal 11 damage by our attack, the enemy will get 11 damage tokens unregardless of its hitpoints or whatsoever. Afterwards you can conclude whether that enemy would die or not.\n\n \n\nHope this explains this ruling a little bit (from my point of view)\n\n \n\nGrtz,\n\nJban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124559-can-i-overkill-indestructible-enemys/?do=findComment&comment=1296718","commentId":1296718,"userName":"Crabble","timestamp":1413063146,"content":"Ok I can see that. Thanks for the answers!"}]}