{"url":"https://community.fantasyflightgames.com/topic/124584-the-ring-goes-south-questions/","title":"The Ring Goes South: Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124584-the-ring-goes-south-questions/?do=findComment&comment=1296018","commentId":1296018,"userName":"kyrie","timestamp":1412978620,"content":"Following questions came up as we played the first quest in The Road Darkens:\n\n \n\nQUESTION 1:\n\n \n\nThe forced effect of quest card 4B reads: \"After an enemy engages a player, place 1 damage on each active location.\n\n \n\nHowever, the Watcher in the Water reads: \"Cannot leave the staging area but is considered to be engaged with each player.\"\n\n \n\nTherefore, when the Watcher is added to the staging area, do you place 1 damage on each active location per player (since technically he is considered engage with each player)? If yes, does this happen each turn, or just when the Watcher first comes into play?\n\n \n\n \n\nQUESTION 2:\n\n \n\nThe shadow effect of encounter card Regiments of Crows reads: \"Undefended damage from this attack must be assigned to the active location.\"\n\n \n\nI have not come across this wording before. Does it mean, \"Damage dealt beyond the defense of the defending character\"? Or does it mean \"Excess damage dealt beyond the remaining hit points of the defending character\"? Or does it mean, \"Damage dealt from an undefended attack must be assigned to the active location\"?\n\n \n\nI played it the first way, and it nearly destroyed the Doors of Durin in one go. This makes it very deadly, but I am thinking it means to say \"damage from undefended attacks\" which would make it still nasty, but not unbearable.\n\n \n\nWhat do some of you think?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124584-the-ring-goes-south-questions/?do=findComment&comment=1296111","commentId":1296111,"userName":"GrandSpleen","timestamp":1412985340,"content":"1) Watcher in the Water does not trigger 4B forced effect.  We got an official answer about this just the other day, see the thread here [https://community.fantasyflightgames.com/index.php?/topic/124241-new-watcher-in-the-water-and-engagement/].\n\n \n\n2) I'm reasonably certain that \"undefended damage\" refers to any damage from an undefended attack.  I guess it would be clearer if they wrote \"damage from undefended attacks.\"  But let's see what everyone else thinks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124584-the-ring-goes-south-questions/?do=findComment&comment=1296169","commentId":1296169,"userName":"chadgar24","timestamp":1412991987,"content":">  \n> \n> 2) I'm reasonably certain that \"undefended damage\" refers to any damage from an undefended attack.  I guess it would be clearer if they wrote \"damage from undefended attacks.\"  But let's see what everyone else thinks.\n\nI agree, it would say 'damage from this attack.....'  if it were damage dealt from a defended attack.  So if you did it undefended all the damage goes on the Active Location IMHO"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124584-the-ring-goes-south-questions/?do=findComment&comment=1296471","commentId":1296471,"userName":"Jban","timestamp":1413036013,"content":"Agree"}]}