{"url":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/","title":"Immediate attack!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296372","commentId":1296372,"userName":"ruchlas","timestamp":1413023054,"content":"Hello,\n\n \n\ni have a doubt about immediate attacks that i happen to face very often lately. Do we always deal a shadow card at the enemy or only when the card effect says it directly? When an enemy is revealed that makes an immediate attack from the staging area, do i have to deal him a shadow card?\n\n \n\nAnd a second question similar. What about when a shadow effect says that the enemy makes an adittional attack but it doesn't say nothing about shadow cards? Some shadow cards say that i have to deal a new shadow card to the enemy but some others not. The right would be to deal shadow card but i doubt exactly because some cards DO mention it and some others NOT."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296388","commentId":1296388,"userName":"Noccus","timestamp":1413026341,"content":"1. Yes\n\n2. Yes\n\nUnless it says otherwise, every attack gets it's own shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296496","commentId":1296496,"userName":"Teamjimby","timestamp":1413038123,"content":"I've been unsure of myself lately about whether or not you can play feint on an immediate attack.  Normally you would play feint after an enemy engages you but before the attack.  But is there an action window to play a feint before the attack is already in motion?  I'm thinking about cards like Haradrim Elite or Black Riders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296502","commentId":1296502,"userName":"Jban","timestamp":1413038625,"content":"Feint is considered to have a Combat Action. So therefore you can only feint enemies during the Combat Phase. Haradrim Elite and Black Riders attacks during the Quest Phase cannot be feinted by that reason.\n\n \n\nHope this clarifies your question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296507","commentId":1296507,"userName":"Teamjimby","timestamp":1413039282,"content":"True, I forgot about that.  What about if I was using Mr Underhill against the Black Riders?  Or if there was a shadow card that gave the enemy another immediate attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296515","commentId":1296515,"userName":"Jban","timestamp":1413039698,"content":" 1. Mr Underhill can be used during the questphase.\n 2. The additional immediate attack can be fought with Mr Underhill.\n    \n    Feint can only be used if the original attack was situated in the Combat Phase. \n\nGrtz,\n\nJban\n\nEdited October 11, 2014 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296628","commentId":1296628,"userName":"alogos","timestamp":1413051221,"content":"Also, you can't «feint» (using a card with the same effect as feint) an immediate attack. If the enemy has begun his attack, it cannot be cancelled by «feint», it only says that it cannot attack. But using an effect like «cannot attack» when an enemy is already attacking as, therefore, no effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1296684","commentId":1296684,"userName":"GrandSpleen","timestamp":1413057638,"content":"When a card is revealed during the quest phase, you're in the middle of staging and have no action window.  So there's no chance to use Mr. Underhill (an Action) to prevent an attack from a card that has just been revealed (and for Mr. Underhill specifically, the targeted enemy needs to be engaged with you)\n\n \n\nAlso, the wording \"immediate\" has gotta mean that the attack is declared as soon as the trigger occurs (whether it be engaging a player, a When Revealed effect, or whatever) -- no action window to play any sort of Action card such as Mr. Underhill.  \n\n \n\nAnd just to agree with alogos above, you can't cancel an attack with Feint or Mr. Underhill, you can only prevent one from being declared in the first place.  Once an attack is declared, it's too late to use a prevention type card: \n\n \n\nQ: When should Feint (CORE 34) be played?\nA: This card should be played any time before\nresolving step 1 of the target enemy’s attack during the\ncombat phase. (Once the act of resolving an enemy’s\nattack begins, it is too late to prevent it from attacking\nwith Feint.) (FAQ, pg 10)\nEdited October 11, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1605800","commentId":1605800,"userName":"Courchevel","timestamp":1430777958,"content":"Sorry to raise from the grave this topic, but still not crystal clear for me :\n\nLet's say I am questing with Boromir (exhausted) and I reveal Haradrim Elite. Then i give a shadow card to the elite and I can now follow the 4 steps of a classical attack.\n\nBut can I use Boromir readying effect in order to block with him as i would normally be allowed to play player action during the different steps of an attack ? Or I cannot use Boromir readying effect as I am still in the reinforcement phase of the quesr where I do not have any opportunity to play action ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1605847","commentId":1605847,"userName":"GrandSpleen","timestamp":1430780819,"content":"I believe not-- the defender must be immediately declared before you have any chance to use an Action such as Boromir's readying effect.  \n\n \n\nThis kept causing me trouble in the Helm's Deep scenario recently (curse you, Warrior of Dunland [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/lord-of-the-rings-saga-expansions/the-treason-of-saruman/warrior-of-dunland-r1397]!).  \n\n \n\nAfter the defender has been declared (or you have declared the attack undefended), you resolve the attack just like you would during the combat phase.  You can then take actions, such as heal a character, but if you want to have Boromir quest and be ready for immediate attacks, you need to use his Action before you begin to reveal cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1605850","commentId":1605850,"userName":"Teamjimby","timestamp":1430780833,"content":"It creates an action window because you resolve the combat steps as normal.  This is one of the rare instances where you get player actions during combat and it lets you take advantage of a few cards like Wingfoot (with Beravor for example) or the new Merry with Fast Hitch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1605860","commentId":1605860,"userName":"Teamjimby","timestamp":1430781300,"content":"> I believe not-- the defender must be immediately declared before you have any chance to use an Action such as Boromir's readying effect. \n\nHmm, I think I disagree.  The FAQ says to follow the 4 steps of combat, which have action windows between each step.  The first step is choose an enemy and you don't choose a defender until the second step.  While the choice of enemy might be obvious, I think it would give an action window before you have to choose a defender."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1605952","commentId":1605952,"userName":"GrandSpleen","timestamp":1430786173,"content":"Perhaps you are right -- I thought I had read long ago that you couldn't do this, that an immediate attack skips step 1 (choose attacker) as the card has already chosen it for you, and you are then right at step 2 (declare defender) without an action window.\n\n \n\nBut I have now done as thorough a search as I can, and I can't find what I'm thinking of.  The FAQ says just what you mention-- follow the four steps-- so there appears to be an action window before you select your defender.  I'm happy with that! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1606233","commentId":1606233,"userName":"Courchevel","timestamp":1430806391,"content":"To express it in one sentence, you have a window of actions to ready boromir to block an haradrim elite's immediate attack during the reinforcement.\n\nThank you guys for your clarification. I was playing like teamjimby described, but as not everyone seems to agree on this ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608086","commentId":1608086,"userName":"krokodiler","timestamp":1430896660,"content":"Here is a question I've asked Caleb once, maybe it'd be helpful:\n\n \n\nQ: Forced effect on Black Rider: if I fail Hide test then BR will attack me \"immediately\". That means that 4 steps of \"Resolving Enemy Attacks\" must be followed. But, I think that there is no Step 1 in such attack as an enemy has already been \"chosen\". So, am I allowed to play Sneak Attack to put an ally card into play to declare him as a defender in this attack? Rules say I can only take actions at the end of each step. Maybe it would be better (and within the rules) to play Sneak Attack earlier, during Action window of the Hide test?\n\nA: You are correct: there is no action window to Sneak Attack a defender into play for the first Forced attack made by a Black Rider. Your first action window would be after the Declare Defenders step. (emphasis mine) That could be significant if you find yourself engaged by more than 1 Black Rider making a Forced attack: since you resolve each attack separately, you could use Sneak Attack to put a defender into play for the second Black Rider’s attack.\n\nEdited May 6, 2015 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608171","commentId":1608171,"userName":"alogos","timestamp":1430907332,"content":"Yeah, I don't see why you should have an action window before declaring a defender. The attacking enemy is already defined.\n\nWeird that the official faq mention the 4 step... I remember seeing Caleb's answers that didn't mention the first step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608194","commentId":1608194,"userName":"Courchevel","timestamp":1430909545,"content":"I start to be fed up with all these contradictions in the rulings.\n\nThe answer from Caleb is clearly in contradiction with the faq :\n\n> (1.26) Enemy attacks outside of the combat phase\n> \n> If an enemy attacks outside of the combat phase, it is still dealt a shadow card at the beginning of the attack. Then follow the 4 steps under Phase 6 “Combat” in the rules. Any shadow cards dealt to the attacking enemy are discarded after the attack resolves.\n\nAnd sorrry the answer from Caleb make no sense for the second part of his answer :\n\n> That could be significant if you find yourself engaged by more than 1 Black Rider making a Forced attack: since you resolve each attack separately, you could use Sneak Attack to put a defender into play for the second Black Rider’s attack.\n\nNo again, no !\n\nIf there is 2 Black riders, then you have to go through step one, so you definitely will have an opportunity to play a sneak attack before step 2, so before the first attack, not before the second one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608367","commentId":1608367,"userName":"Teamjimby","timestamp":1430919968,"content":"Right, there are several situations where you would have multiple enemies attacking you due to failing a hide test or certain treacheries.  It seems to me that you would certainly resolve the first step and therefore have an action window before choosing a defender."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608665","commentId":1608665,"userName":"krokodiler","timestamp":1430929171,"content":"So, I've sent Caleb an e-mail regarding our doubts and he responded:\n\n \n\nHi Michal,\nThanks for bringing this to my attention. It looks like the answer I gave you previously was incorrect since it does contradict our FAQ. It was, however, the way that I played the scenario myself. I liked the tension it created in my games when I knew that if an enemy attacked me during the quest phase, I would not have the opportunity to respond until the attack was already underway. That way I had to think twice before committing everyone to the quest, even if I had a Sneak Attack in my hand.\nSadly, I have to concede that the ruling in the FAQ is cleaner and easier to comprehend, so I will recant my previous ruling rather than amend the FAQ. I doubt that many players will be upset like I am to know they have an action window during which time they can ready a character or Sneak Attack one into play in order to defend an immediate attack.\nSo, just to be clear: anytime an enemy makes an attack outside of the combat phase, you deal it a shadow card and follow all 4 steps of the ‘resolving enemy attacks’ portion of the combat phase. That also means that you have action windows after each of those 4 steps.\nCheers,\nCaleb\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1608748","commentId":1608748,"userName":"Teamjimby","timestamp":1430931353,"content":"There you have it.  Thanks for following up with Caleb.  I'm just glad that there isn't a contradiction with the FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1609861","commentId":1609861,"userName":"Courchevel","timestamp":1430987415,"content":"Thank's Caleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1609871","commentId":1609871,"userName":"alogos","timestamp":1430988024,"content":"I...\n\n \n\n \n\nI....\n\n \n\n \n\n \n\nI don't see why we couldn't use feint then...\n\n \n\nI'm not upset, I'm in the «whatever, this can't make any sense anymore» zone.\n\n \n\nEDIT: messed up.\n\nEdited May 7, 2015 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1609888","commentId":1609888,"userName":"Courchevel","timestamp":1430989736,"content":"We cannot use feint Out of the combat phase because feint is a specific \"combat action\".\n\nFeint.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Feint.png]\n\nEdited May 7, 2015 by Courchevel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1610006","commentId":1610006,"userName":"alogos","timestamp":1430999499,"content":"* «feint»\n\n \n\nFeint is not the only cards that could «feint»"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1610170","commentId":1610170,"userName":"Teamjimby","timestamp":1431007917,"content":"You definitely can't use feint because you'd have to play that before you even choose an attacker, right?  Otherwise they are already attacking and it's too late.  That would be like saying you could use feint after you've revealed the shadow card if it turns out to be a nasty one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=1610353","commentId":1610353,"userName":"alogos","timestamp":1431013138,"content":"... I got confused.\n\n \n\nWell, after a good re-reading, I just messed up with the fact that step 1 is to choose an engaged attacking enemy, but there is only one to choose from, which isn't even engaged, but yeah, I would not have time to play a «feint» before the begining of its attack.\n\n \n\nI stand corrected.\n\n \n\nStill, step 1 is really weird in this case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2423570","commentId":2423570,"userName":"Rajam","timestamp":1474422779,"content":"Bump! I have a question regarding immediate attacks: can you attack back, or do you still need to wait until combat phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2423651","commentId":2423651,"userName":"Kakita Shiro","timestamp":1474428468,"content":"> Bump! I have a question regarding immediate attacks: can you attack back, or do you still need to wait until combat phase?\n\nBarring an effect like Roheryn, Anduril, or Quick Strike, you'll have to wait your turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2477268","commentId":2477268,"userName":"Boromore","timestamp":1477582156,"content":"I suspect this has been asked before, but I can't find an answer...if I play Quick Strike in an action window during an enemy attack, which takes precedence? The original enemy attack, or the Quick Strike?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2477281","commentId":2477281,"userName":"Kakita Shiro","timestamp":1477582626,"content":"Fairly certain it is Quick Strike; if the enemy is dead, there's no enemy attack to resolve."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2477490","commentId":2477490,"userName":"shosuko","timestamp":1477588833,"content":"> I suspect this has been asked before, but I can't find an answer...if I play Quick Strike in an action window during an enemy attack, which takes precedence? The original enemy attack, or the Quick Strike?\n\nThe Quick Strike is an action - when you have an action window you can play the card and fully complete it's effects.  This means you can use it to attack before an enemy does.  If you destroy an enemy before it attacks, then it never gets a chance to attack itself and will be discarded.\n\n \n\nAlso note that Quick Strike is an action, so you can do it during any phase action window.  This means, if an enemy is engaged with you at the beginning of your turn during preparation phase you can even do the attack then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2477833","commentId":2477833,"userName":"rsdockery","timestamp":1477600058,"content":"Ooh, what if Na'asiyah is defending, you trigger her action, and then you play Quick Strike? Her bonuses last \"for this attack\"; since the enemy's initial attack hasn't resolved, does she still have the attack bonus during her own attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2478012","commentId":2478012,"userName":"sappidus","timestamp":1477607089,"content":"> Ooh, what if Na'asiyah is defending, you trigger her action, and then you play Quick Strike? Her bonuses last \"for this attack\"; since the enemy's initial attack hasn't resolved, does she still have the attack bonus during her own attack?\n\nWithout drilling too much into the precise wording, Na'asiyah's ability says to give her +2 ATK or +2 DEF for each trigger of the action (not and), so how would you parlay any putative timing shenanigans into an advantage?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124614-immediate-attack/?do=findComment&comment=2478360","commentId":2478360,"userName":"shosuko","timestamp":1477630101,"content":"Na'asiyah's ability would only apply to the attack during which you activated her action.  So if you go into an attack, and during the action window play a Quick Attack, the Quick Attack would not gain the bonus since it isn't \"This Attack\" the ability was activated with."}]}