{"url":"https://community.fantasyflightgames.com/topic/124707-close-call/","title":"Close Call","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1297349","commentId":1297349,"userName":"awp832","timestamp":1413149720,"content":"So, a few questions about Close Call,  firstly can I pick the amount of X?\n\nA Hero gets hit for 5 damage, can I choose to take Doomed 3 and cancel 3 of it,  or does it only come in all-or-nothing?   Secondly,  can I play the card and choose 0, raising my threat by 0 and canceling no damage? Seems odd but I don't see why not.  You might want to do this  because of Keys of the Orthanc.\n\nThe bigger issue though, is I'm not 100% sure I get how this card is supposed to work.  Suppose Aragorn is sitting at 4/5 damage, and gets hit for an attack that deals 3 damage,  his 2 Defense stops 2 damage, the last damage gets through -Aragorn is dead.    It is at this point that one might logically assume that Close Call would be a smart move.   Is this even a legal play though?   As soon as the lethal damage is dealt,  Aragorn is dead, correct?  And damage must be dealt in order for Close Call to be able to cancel it.  So is there even a chance to play close call?\n\nEdited October 12, 2014 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1297361","commentId":1297361,"userName":"GrandSpleen","timestamp":1413151271,"content":"The situation you describe with Aragorn is legal.  Frodo works the same way-- you can cancel damage that would kill a character.  Since the damage was cancelled, it is the same as if it were never placed.  Also true for a card such as Muck Adder [http://hallofbeorn.com/Cards/Details/Muck-Adder-CatC] -- Frodo can survive being \"damaged\" by the Adder if he uses his ability (here's [https://community.fantasyflightgames.com/index.php?/topic/69996-frodos-muck-adder-resolved/?hl=%2Bmuck+%2Badder] a thread with a previous ruling about Muck Adder).\n\n \n\nI believe you can choose your X value.  So if a character takes 7 damage, but you only want to cancel 3 of it, you can play Close Call for 3 threat.\n\n \n\nAlso, I don't think \"raising your threat by 0\" counts as \"raising your threat\" for a response such as the one on Keys of Orthanc.  So this couldn't be a \"free resource\" type of card.  I don't have any official link.  I'm pretty sure there has been similar discussion before, not about Keys of Orthanc/Doomed, but other similar kinds of \"raising by 0\" effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1304730","commentId":1304730,"userName":"Nizi","timestamp":1413748124,"content":"What in the case of Foe Beyond? It says the effect can't be cancelled, but I'd think that refers to cards that cancel the \"when revealed\" effect. The damage that would be cancelled is just a part of the effect. That said, it logically still falls in the category of the \"effect\". So which is it? Can this card cancel some of that damage?\n\n \n\nAlso: are you sure you can choose the X value? I know it applies to cards with cost 'X', but there's no \"choice\" element in the textbox."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1304942","commentId":1304942,"userName":"GrandSpleen","timestamp":1413769126,"content":"Yeah, you can't cancel the effect, but you can still cancel the damage.  Go for it.  As for choosing X, I can see it going either way. I still think you can choose, but it's worth submitting as a rules question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1489941","commentId":1489941,"userName":"Bonarchie","timestamp":1426363430,"content":"Hi, all!\n\n \n\nThere hasn't been a clarification about the timing of damage being dealt, though.\n\n \n\nAre there two separate steps, i.e. (a) the damage being dealt, and (b) the physical placement of the damage tokens ?\n\n \n\nThe wording of Close Call (and Frodo for that matter) implies that the damage has already been dealt,\n\nwhich means they could be dead before you can save them.\n\n \n\nI know that the developers didn't intent that, of course, and we all save the character in such situations,\n\nbut I think the wording isn't clear enough.\n\n \n\nedit: sorry for bumping the thread.\n\nEdited March 14, 2015 by Bonarchie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1489951","commentId":1489951,"userName":"GrandSpleen","timestamp":1426363937,"content":"nt, nevermind, sorry in a hurry and my post just echoed stuff written above.. now I'm out of time!\n\n \n\nbut yes, if you can cancel damage and not trigger the Adder's forced effect (as above), you can certainly cancel damage and not discard your hero as a result of that damage that was (not) placed (the damage was canceled!)\n\nEdited March 14, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1489975","commentId":1489975,"userName":"Bonarchie","timestamp":1426365219,"content":"Thanks GrandSpleen for your reply.\n\n \n\nI wasn't aware of the previous ruling on Muck Adder (and in my haste I didn't read it before typing my post above).\n\n \n\nI think that the timing of damage is important enough that warrants an answer in the FAQ\n\n(if not in a new printing of the rulebook)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1490836","commentId":1490836,"userName":"alogos","timestamp":1426442749,"content":"The timing of cancelling is a little weird, for it to cancel, it must happen, but when cancelling, it«rollback» to the situation before. So after cancelling, the damage where «never» dealt in the new timeline. It's a timey wimey stuff. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124707-close-call/?do=findComment&comment=1490867","commentId":1490867,"userName":"GrandSpleen","timestamp":1426445649,"content":"2fb.jpg [http://i2.kym-cdn.com/photos/images/newsfeed/000/711/667/2fb.jpg]"}]}