{"url":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/","title":"Does The Balrog attack right after coming into play? (Journey in the Dark)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298264","commentId":1298264,"userName":"GrandSpleen","timestamp":1413226092,"content":"In Journey in the Dark, at the end of the quest phase, you remove 1 damage token from Doom, Doom, Doom per its Forced response.  Then, if there are 0 damage tokens left, you put The Balrog into play.\n\n \n\nThe second Forced response on Doom, Doom, Doom says that, if The Balrog is in play at the end of the quest phase, it will attack the first player.  Here's the card:\n\n \n\nDoom-Doom-Doom.jpg [http://hallofbeorn.com/Images/Cards/The-Road-Darkens/Doom-Doom-Doom.jpg]\n\n \n\nDoes this mean that The Balrog will attack immediately after he comes into play (if he comes into play at the end of the quest phase)?  Or has the trigger for that second Forced response passed, having occurred when The Balrog was not yet in play, and he will make his first attack during combat phase?\n\n \n\nMy head says he will attack immediately, but my heart says NOOOO PLEASE STOP HITTING ME!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298283","commentId":1298283,"userName":"Teamjimby","timestamp":1413227141,"content":"They both trigger at the same time (end of the quest phase), so you get to choose the order.  Personally I would chose to trigger the second ability first (thus avoiding the immediate attack), but if you think the quest is too easy feel free to trigger the first ability :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited October 13, 2014 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298324","commentId":1298324,"userName":"GrandSpleen","timestamp":1413229397,"content":"Since I was unsure, I went ahead and played it the harder way.  After 8 tries I had my first victory against this quest, defeating the Balrog and returning the discarded hero via Fortune or Fate for the best possible result.  Aside from gathering enough attack power to hurt the Balrog and staying alive, the really tricky part was clearing The Great Bridge without questing to victory in the same turn.  I needed only 2 more progress tokens on the quest to win.  If I wanted to use Fortune or Fate, I would have to clear the bridge and finish the quest on separate turns -- no action window in between triggering the bridge's Response and placing the finishing progress tokens on the quest.  Faramir gave me some flexibility in my willpower, and I needed it.  Luckily, Mines of Moria came out during the final round and absorbed the two progress tokens that otherwise would have ended the game.  Gimli took his dive for the Balrog, came back out on the next turn, and we quested to victory.  Whew!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298703","commentId":1298703,"userName":"PsychoRocka","timestamp":1413249509,"content":"Interesting.... may have to put in fortune and fate just for this quest...\n\nSeems very very hard to beat the quest before Doom, Doom, Doom has its last token taken off and the Balrog appears.\nAlso definitely don't want to gain four burdens from one saga quest. Still going to go with my initial strategy of playing the quest till I can eventually beat it without the Balrog appearing but should this fail/take far too long I will have to sacrifice a hero and use fortune and fate to bring it back. Would be pretty cool killing the Balrog as well not to mention the 50 victory points you get for killing it!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298723","commentId":1298723,"userName":"GrandSpleen","timestamp":1413251318,"content":"If you play solo with one deck, you can finish it before the Balrog shows up.  With 2 decks it might be possible but very unlikely.  3 or 4 decks, forget about it.\n\n \n\nBut yeah, it was definitely satisfying to smite the Balrog, drag it down into the abyss, then hop back out and make my escape like nothing ever happened :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298754","commentId":1298754,"userName":"PsychoRocka","timestamp":1413253328,"content":"I play two handed so am hoping I can manage it after several attempts! Who am I kidding after I'm able to achieve this I'll probably want to play again until I can pull off Killing it and resurrecting the hero before finishing too :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited October 14, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1298950","commentId":1298950,"userName":"alogos","timestamp":1413276119,"content":"I don't think you can choose to execute the second effect before the first since there is no Balrog in play, so you can only choose to do the first effect, and then, you'll have to choose the second effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299007","commentId":1299007,"userName":"Julia","timestamp":1413284432,"content":"Yup. Plus, if the Balrog was supposed not to attack the round he shows up, they'd have probably structured the card swapping the two Forced effects and using a different wording. Something like:\n\n \n\nForced: if at the end of the quest phase there are no tokens on this card and the Balrog is in play, then the Balrog attacks.\n\n \n\nForced: if at the end of the quest phase there are tokens on this card, remove one token from this card. If there are no tokens left, then put the Balrog in play.\n\n \n\n(after all, tokens are counters to have the big boss arriving. Unlikely that he arrives, looks around, makes a mad laugh and says \"ok, I'll attack next round\")\n\n \n\nSo, aye, I'd go the hard way too\n\nEdited October 14, 2014 by Julia"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299053","commentId":1299053,"userName":"gandalfDK","timestamp":1413289377,"content":"Although I'm not sure Balrogs can speak, or know the Common Speech, but Julia has got a fair point and appart from that, the rule with this game has almost always been: do it the hard way. But it does trigger the Golden Rule, doesn't it, so technically the first player gets to choose which response to trigger/check first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299163","commentId":1299163,"userName":"Teamjimby","timestamp":1413296875,"content":"I'm still not convinced, but I can't think of any other card that had 2 simultaneous effects like this to compare it to.  I think the Golden Rule still trumps here, but it would be worth shooting an email to Caleb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299174","commentId":1299174,"userName":"monkeyrama","timestamp":1413297283,"content":"> Although I'm not sure Balrogs can speak, or know the Common Speech\n\n \n\nThis is actually why the Balrog in Moria was so angry. Hadn't had anyone else who spoke Balrog to have a chat with for a couple of ages. It's sad, really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299344","commentId":1299344,"userName":"GrandSpleen","timestamp":1413304756,"content":"I went ahead and submitted the question to Caleb.  I'll let you know when I get a response."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299425","commentId":1299425,"userName":"GrandSpleen","timestamp":1413310045,"content":"I got a very fast reply to this!  Here's the answer:\n\n \n\nEncounter card effects should always be resolved in reading order - from top to bottom. Therefore, you must resolve the first Forced effect on Doom, Doom, Doom (if able) before resolving the 2nd Forced effect. That means that the Balrog will make an attack during the quest phase that it is added to the staging area.\nI hope you’re enjoying The Road Darkens!\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299437","commentId":1299437,"userName":"Teamjimby","timestamp":1413310813,"content":"Golden rule?  More like fool's gold!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1299448","commentId":1299448,"userName":"gandalfDK","timestamp":1413311268,"content":"And again, the Nameless One has his minions against us.. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1301916","commentId":1301916,"userName":"PsychoRocka","timestamp":1413472956,"content":"> If you play solo with one deck, you can finish it before the Balrog shows up.  With 2 decks it might be possible but very unlikely.  3 or 4 decks, forget about it.\n> \n>  \n> \n> But yeah, it was definitely satisfying to smite the Balrog, drag it down into the abyss, then hop back out and make my escape like nothing ever happened :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI did it man!!!! Second attempt everything just seemed to fall into place in the last few rounds! Saved resources for Fortune or Fate and drew it on pretty much one of the last few turns I could have as if I failed at questing or tried to stick around on stage 3 I would have threated out with both decks and lost. A few turns prior Elrond made a valiant sacrifice to weaken the Balrog and the rest of my company of Elves along with Rumil and some Galadhon Archers destroyed it outright. Was then able to bring Elrond back and only incur two treacheries!!! Going to choose them tomorrow and try Breaking of the Fellowship!\n\n \n\nMan, thank you so much for so quickly realising and posting the trick to this quest. Fortune or Fate is an absolute live saver if you don't want to lose a hero or take four burdens and keep a relatively perfect campaign pool :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=1301930","commentId":1301930,"userName":"GrandSpleen","timestamp":1413473482,"content":"Congrats :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Sounds like an epic game.  I'm pretty concerned with avoiding Burdens too.  We still have 6 saga expansions to go if they continue to do 2 boxes per volume, and that's potentially 18 quests worth of Burdens that will pile up.  If you're not careful, half the deck will be Burdens when you get to the last quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/?do=findComment&comment=3122113","commentId":3122113,"userName":"peke12","timestamp":1513090823,"content":"If you finish the quest before all damage counters are removed from Doom, doom doom, You still only need to take 2 burden cards into your pool.\nThe campaign card states, when the balrog is in play... \nThe balrog is not in play as long as there are still damage counters on Doom, doom, doom."}]}