{"url":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/","title":"*ongoing* complete playthrough w/ direct damage + Silvan stealth","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1303724","commentId":1303724,"userName":"byzantine","timestamp":1413619451,"content":"Hi all!\n\n \n\nI´m pretty experienced with this game, having played through every scenario up to The Voice of Isengard multiple times. I recently tried out a Tactics direct damage deck (paired with a Caldara spirit deck) that was extremely satisfying to play, if quite tough at times (no healing with two Hobbits!).\n\n \n\nSince then a few amazing cards have come out that I hope will go along great with it, so I´ve decided to give it another try. Since I don´t see this kind of deck discussed very much, I thought I´d share my experience with the community.\n\n \n\nI plan on doing a complete playthrough of the adventures released so far with the decks, although I might alterate them slightly depending on my experiences and, hopefully, your input. I play two-handed, which means that I play in 2 player-mode where I control both decks.\n\n \n\nThere´s two quests the decks simply cannot handle (Lake-Town, Shadow and Flame) because of the rather unfair „Immune to Player Effects“-Bosses. I´ll try them when I get there for a lark, but fully expect to get obliterated.\n\n \n\nSo, without further ado, here´s the decks:\n\n \n\nThe Eagles Are Coming! (and Going!):\n\nLeadership/Tactics – 52 cards\n\n \n\nHeroes (Starting Threat 23):\n\nMerry (T)\n\nThalin (T)\n\nSam Gamgee (Le)\n\n \n\nAllies (26):\n\nBoromir x2\n\nDefender of Rammas x3\n\nDescendant of Thorondor x3\n\nGaladhon Archer x3\n\nGwaihir x2\n\nRumil x2\n\nVassal of the Windlord x3\n\n \n\nBill the Pony x2\n\nErrand Rider x3\n\n \n\nGandalf x3\n\n \n\nAttachments (17):\n\nBlack Arrow x1\n\nBorn Aloft x3\n\nDagger of Westernesse x3\n\nHorn of Gondor x2\n\n \n\nKing Under the Mountain x3\n\nO Lorien! x2\n\nSteward of Gondor x3\n\n \n\nEvents (9):\n\nFeint x3\n\n \n\nA Very Good Tale x3\n\nSneak Attack x3\n\n \n\nStrategy:\n\nWith the low starting threat you can keep most tough enemies in the staging area for a long time. Defender of Rammas or Sam Gamgee (or Thalin, in a pinch), can block smaller ones while various direct damage dealers take care of the tough ones (or soften them up a bit, at least).\n\n \n\nSteward of Awesome goes on Thalin so he can afford the expensive Tactics allies, while the Horn of Gondor goes to the partner deck.\n\n \n\nGandalf can make a lot of appearences over a game with Sneak Attack and Born Aloft - a merciless killing machine when combined with Descendent of Thorondor, Thalin, etc.\n\n \n\nThe deck also has a surprising amount of Willpower to offer (especially early on); quite often all three heroes will be off questing, which is rather odd for a Leadership/Tactics-deck I suppose.\n\n \n\nElven Alliance:\n\nLore/Spirit – 52 cards\n\n \n\nHeroes (Starting Threat 20):\n\nHaldir of Lorien (Lo)\n\nMirlonde (Lo)\n\nGlorfindel (S)\n\n \n\nAllies (24):\n\nDaughter of Nimrodel x2\n\nElrond x2\n\nGaladhrim Minstrel x3\n\nGildor Inglorion x2\n\nHenamarth Riversong x2\n\nMirkwood Runner x3\n\nSilvan Tracker x3\n\nWarden of Healing x2\n\n \n\nArwen Undomiel x2\n\n \n\nDefender of the Naith x3\n\n \n\nAttachments (10):\n\nAsfaloth x2\n\nElf-Stone x3\n\n \n\nLight of Valinor x3\n\nUnexpected Courage x2\n\n \n\nEvents (18):\n\nDaeron´s Runes x3\n\nDeep Knowledge x3\n\nThe Tree People x3\n\n \n\nA Test of Will x3\n\nElrond´s Counsel x3\n\nHasty Stroke x3\n\n \n\nStrategy:\n\nWhile I know the other deck works, this one is a bit of a gamble as I´ve not really tried it much. It continues the theme of killing stuff while not engaging it with Haldir while maintaining a low Threat level.\n\n \n\nA few staples such as A Test of Will or Warden of Healing are present; Silvan allies make up the bigger part of the deck. I´ve tried them with Galadriel and Celeborn and kind of found them lacking, but I also know Silvan Tracker is defensively sound, while the Mirkwood Runner will hopefully prove himself at finishing off weakened enemies.\n\nEdited October 20, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1303727","commentId":1303727,"userName":"byzantine","timestamp":1413619683,"content":"Scenario 1: A Passage Through Mirkwood,\n\nwhere we fend off nasty Spiders and Orcs and Insects oh my!\n\n \n\nAn early A Very Good Tale gets me ahead on the ally-curve, but Necromancer´s Reach + Hummer Horns as a shadow card teach me never to spend the last Spirit Resource with A Test of Will still in hand. I heal the damage with a brave Warden of Healing and blow through the quest, never encountering Ungolianth´s Spawn.\n\n \n\nThe first test is passed, a good deck should be able to do APTM in 4 turns (unless you get a very unlucky Ungolianth´s Spawn draw). The second test is quickly approaching though, as an intimidating shadow looms over us...\n\n \n\nScore 94: 23 Threat Lo/S + 26 Threat Lo/T + 40 4 rounds + 5 Damage – 0 VP\n\n \n\nScenario 2: A Journey Down the Anduin,\n\nwhere we shall meet (and greet) one of the deadliest beasts to roam Middle Earth!\n\n \n\nThe second test went well also. I kept the Hill Troll in the Staging Area for the first turn, whittling away at him with a Sneak Attack Descendent of Thorondor. A regular Descendent and an Errand Rider then told A Very Good Tale to get Gandalf´s attention, and that was it for our ghastly foe. They did the same again next turn, though instead of throwing flames the wizard reduced our threat this time around.\n\n \n\nThe rest of the scenario went smoothly, the Silvans did well (especially the MW Runner, who finished off a wounded Worg – hate those so much!), and we ended up taking down enemies and locations for a heapload of VP.\n\n \n\nScore 98: 25 Threat Lo/S + 24 Threat Le/T + 60 (6 rounds) + 3 Damage – 14 VP\n\n \n\nScenario 3: Escape from Dol Guldur,\n\nwhere one of our brave heroes is abducted!\n\n \n\nThe final test for the decks. Thalin got abducted, while Merry got Caught in Web during setup (he later got rescued by Elrond). The worst thing about the scenario for me is only being able to play one ally per turn, although some cards can get around that (A Very Good Tale, Sneak Attack). I didn´t really draw anything bad from the encounter deck (although I had to A Test of Will a King Spider at an inopportune moment), rescued Thalin fairly easily and killed the Nazgul with SA Gandalf + regular Gandalf + Descendent over two turns.\n\nOn the last turn I used A Test of Will on Ungolianth´s Spawn, though I´m fairly certain I would have made it anyway.\n\n \n\nAll in all, Dol Guldur is not quite as scary as it used to be. However, the Nightmare versions of those quests are next, and that will be a lot more challenging for my decks...\n\n \n\nScore 139: 32 Threat Lo/S + 32 Threat Le/T + 80 (8 rounds) + 0 damage – 5 VP\n\nEdited October 18, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1303913","commentId":1303913,"userName":"Narsil0420","timestamp":1413642255,"content":"Very nice! Looking forward to seeing these in action more. I'm surprised you don't have Galadhrim's Greeting to keep your threat down but I guess that the T/Le deck has SA Gandalf for threat reduction. Also, no traps?\n\nI might try Glor/Galadriel/Haldir when she comes out..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1304165","commentId":1304165,"userName":"7theye","timestamp":1413678020,"content":"How are you playing? Two handed ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1304355","commentId":1304355,"userName":"byzantine","timestamp":1413714516,"content":"@Narsil0420\n\nWith low threat decks (starting threat <  28) I never have a problem dying to threat, and my decks always shift into combat mode eventually, so I´m not bothered much by high treat enemies engaging me late in the game. So the GG mostly serves to improve my score, and I´d rather win games then improve my score; so I´ve started leaving it out. Definitely still a must in high threat decks (starting threat > 30) though.\n\n \n\nTraps are so unreliable. I love them in theory, but they always disappoint me in the end. ;(\n\n \n\n@7theye\n\nYes, I play 2-handed. I wanted to try 4-handed for a lark, but that´s just too much stuff going on for me to handle alone. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nOnwards to the nightmare quests:\n\n \n\nScenario 1.2: A Passage Through Mirkwood (Nightmare),\n\nwhere the Spiders and Insects get decidedly nastier.\n\n \n\nI´m scared of Ungolianth´s Spawn taking out half my heroes with her nasty, nasty When Revealed effect, but imagine my surprise when she shows up during setup! Much, much better this way! The rest of the nightmare cards are tough, but not particularily scary for me.\n\n \n\nI don´t put any progress on stage 1 for three turns, always just drawing the threat level of the staging area. Two Backtrack´s during turn two are brutal, but I Test of Will the second one to avoid any Threat gain.\n\n \n\nTurn two was particularily nasty as those damned Hummerhorns show up as a shadow card again to take out my blocking Defender of Rammas. Merry would have died if not for Bill the Pony buffing him up.\n\n \n\nA Black Arrow plus Descendent take out Ungolianth´s Spawn, and when I have to fish her out again on stage 3 my board is flooded with allies and I take her down easily.\n\n \n\nScore 116: 24 Threat Lo/S + 30 Threat Le/T + 60 (6 rounds) + 3 damage – 1 VP\n\nMVP card: Bill the Pony for saving my Hobbits\n\n \n\nScenario 2.2: A Journey Down the Anduin (Nightmare),\n\nwhere our usual strategy could get us killed!\n\n \n\nUff, that was a tough game, but I´m very happy I succeeded on the first try. Smoking Blood, of course, is the card I feared the most as it removes damage from enemies (and gives me threat as well), and I had to Hasty Stroke it twice. A third copy of Smoking Blood as an encounter card only healed a single point on someone Thalin had damaged thankfully; I didn´t draw a single A Test of Will the whole game! I also drew no healers except for Silvan Trackers and a single Elrond, and almost died because of mass damage.\n\n \n\nBut first things first. I took my sweet time on Stage 1, finally killing the Hill Troll with a Sneak Attack Descendent of Thorondor in my own Resource Phase (fearing Smoking Blood healing it up if I waited longer). That, of course, is exactly the turn a second Hill Troll decides to show up, but by now my board is built up enough that I can kill him in melee.\n\n \n\nThere´s a few close situations here as Pursuit on the Shore brings a third Hill Troll for me to kill, and I have to Hasty Stroke a Wolfrider shadow card who would have otherwise murdered a hero. During Stage 2 I have to be very, very careful about who quests for fear of The Necromancers Reach killing my damaged heroes, and of course this is where Pursued by Shadow shows up to raise one decks Threat by a whopping 9!\n\n \n\nIn the end I make it to Stage 3 and easily kill everything there, though Sam sadly dies to a Troll Attack! shadow card before we win. Like I said, a really tough game, and definitely one of my favorite scenarios right now.\n\n \n\nScore 198: 39 Threat Lo/S + 43 Threat Le/T + 120 (12 rounds) + 9 damage + 8 (dead characters) – 21 VP\n\nMVP card: Hasty Stroke for saving me from Smoking Blood twice\n\nEdited October 19, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1304516","commentId":1304516,"userName":"byzantine","timestamp":1413729887,"content":"Scenario 3.2: Escape from Dol Guldur (Nightmare),\n\nwhere the real nightmare begins.\n\n \n\nThis game started out weird, with two The Necromancer´s Reach (yay!) and one Dark Interrogation (ouch!) as the cards guarding the Objectives. Sooo...I start out with two cards in the starting hands and Haldir taken prisoner, but at least there´s nothing in the staging area.\n\n \n\nIt all goes downhill pretty fast when Thalin kills a Crazed Prisoner while Ungolianth´s Spawn shows up for a rematch. She immediately eats Merry, and when the Nazgul swoops down on the next turn my old nemesis, the Hummerhorns, show up as a shadow card again as well. Team Leadership/Tactics is out of the game and that´s that for now.\n\n \n\nFAIL!\n\nMVP (for the bad guys): Dark Interrogation. Having your hand reduced to 2 cards DURING SETUP is not really an ideal start.\n\n \n\nScenario 3.2: Escape from Dol Guldur (Nightmare),\n\nwhere the real nightmare begins.\n\n \n\nNothing special here, really. Just got flooded with locations and enemies.\n\n \n\nFAIL!\n\nMVP (for the bad guys): Dungeon Labyrinth. I just couldn´t get rid of the one I got on turn 1 or 2.\n\n \n\nScenario 3.2: Escape from Dol Guldur (Nightmare),\n\nwhere the real nightmare begins.\n\n \n\nBetween the back-to-back Crazed Captives, the back-to-back Dungeon Labyrinths with a Torture Master thrown in for good measure and the damned Hummerhorns as a shadow card (again!!) this one goes even faster.\n\n \n\nFAIL!\n\nMVP (for the bad guys): Crazed Captive. Killing one is bad, killing two is basically game over.\n\n \n\nRight now Nightmare Escape from Dol Guldur feels a bit like running against a wall with my head, so I´m going to leave it for now and perhaps come back to it later. It certainly has earned it´s fearsome reputation as one of the (if not the) toughest quests right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1304996","commentId":1304996,"userName":"Glaurung","timestamp":1413775775,"content":"Forget about it with your decks. You will not make it. I make it 2 times with a dwarfes decks with very good synergy and both time it was on the edge…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1305003","commentId":1305003,"userName":"7theye","timestamp":1413777053,"content":"> Forget about it with your decks. You will not make it. I make it 2 times with a dwarfes decks with very good synergy and both time it was on the edge…\n\n \n\nHe's not playing solo though. He's playing some hybrid two player version where he controls both decks so it is much more beatable then the true, real solo way you play Glaurung. Dol Guldur is much easier two player then solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1305074","commentId":1305074,"userName":"byzantine","timestamp":1413788375,"content":"Sorry if I somehow have not made it clear that I´m playing two-handed. The decks make absolutely no sense whatsoever for solo play.\n\n \n\n*I added I line to the OP to make it clearer that I play two-handed.*\n\n \n\nI´m pretty sure I could win NM Dol Guldur with a bit of luck, but replaying it again and again is boring to me, so I will press on to the next quests when I get the time for it.\n\n \n\n \n\nEdited October 20, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1305997","commentId":1305997,"userName":"byzantine","timestamp":1413843866,"content":"Scenario 4: The Hunt for Gollum,\n\nwhere we visit some locations on the trail of an odd creature indeed.\n\n \n\nWell, this was a rather relaxed game after the nightmare quests. The few Hunters from Mordor that showed up are disposed of easily, but only one Clue card (up until the last turn) means stage 3 goes rather slow.\n\nThe nightmare version of this quest awaits next, hopefully presenting more of a challenge.\n\n \n\nScore 137: 27 Threat Lo/S + 36 Threat Le/T + 80 (8 rounds) + 0 damage – 6 VP\n\nMVP card: A Very Good Tale. It fetches me a few important Willpower allies, speeding stage 3 up a bit.\n\n \n\nScenario 4.2: The Hunt for Gollum (Nightmare),\n\nwhere the locations get nightmarish.\n\n \n\nI get location-locked, unable to get rid of the current location because of the ones in the staging area. I give up at almost 50 Threat with no hope of winning.\n\n \n\nI adapt one of my decks slightly to add another Asfaloth to increase the chance of drawing one, as the mighty steed would have made all the difference in the world.\n\n \n\nFAIL!\n\nMVP (for the bad guys): Watched Path. I had, like, seven card drawing effects in hand that I couldnt´t use because of this.\n\n \n\nScenario 4.2: The Hunt for Gollum (Nightmare),\n\nwhere the locations get nightmarish.\n\n \n\nThis game starts out much better, with a mix of enemies and locations. Gandalf proves what a badass he is by finishing off two enemies in one turn, and Thalin plus Descendent of Thorondor rule the skies as they take out three Ravenous Hawks over the game (using Born Aloft).\n\n \n\nThe nightmare version of this quest is much, much more enjoyable, if not that hard. I was kind of surprised to lose the first game, but I had some really bad luck with my own draws and the encounter deck draws. It happens.\n\n \n\nScore 146: 33 Threat Lo/S + 33 Threat Le/T + 80 (8 rounds) + 0 damage – 0 VP\n\nMVP card: Asfaloth. Obviously, against a location-heavy treachery deck.\n\nEdited October 22, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1307333","commentId":1307333,"userName":"byzantine","timestamp":1413930851,"content":"Scenario 5: Conflict at the Carrock,\n\nwhere the Trolls dwell!.\n\n \n\nI get a first turn Bee Pastures and goof around on stage 1 until I can recruit Grimbeorn. Three heroes get Sacked! during this phase of the game, although one is rescued by Elrond.\n\n \n\nOnce I go to stage 2 I rip into the Trolls at will. With allies like Grimbeorn, Boromir and Gwaihir on my side, I don´t even need to resort to Gandalf/Descendent shenanigans to bring them down. Onwards to the nightmare version for a hopefully more challenging experience.\n\n \n\nScore 129: 27 Threat Lo/S + 23 Threat Le/T + 80 (8 rounds) + 0 damage – 1 VP\n\nMVP card: Feint. Not that I couldn´t have sacrificed some Errand Riders or something, but there´s something especially satisfying in not even letting a Troll attack you.\n\n \n\nScenario 5.2: Conflict at the Carrock (nightmare),\n\nwhere the Trolls have bigger muscles and sometimes more heads as well!.\n\n \n\nThis is one of my favorite quests right now. Tough, but not too random. And very satisfying, after killing your way through hordes of Trolls.\n\n \n\nTurn 1 saw a Hill-Troll, which I Feint and kill immediately (Haldir with Dagger of Westernesse 5, Glorfindel 3, Mirlonde 2, Mirkwood Runner 2 *brought on by a Galadhrim Minstrel with The Tree Folk* = 12 Attack).\n\n \n\nTurn 2 I only kill a lowly Marsh Adder, but the second Frightened Beast gives me Threat again.\n\n \n\nTurn 3 sees me kill another Hill-Troll, but it gives me even more threat as I have to block with Bill the Pony. The Leadership/Tactics-deck is getting quite high in Threat and I sure miss a The Galadhrim´s Greeting right about now.\n\n \n\nTurn 4 to 6 are largely uneventful, and I continue to place one Progress exactly on the Quest because an active location acts as a buffer.\n\n \n\nOn Turn 7 the Trolls finally show up! I immediatley kill Rupert, and a second Savage Hill-Troll, buffing the remaining Trolls.\n\n \n\nTurn 8 gets Haldir another Dagger of Westernesse, so he can now attack for 7 twice (with Unexpected Courage) – insanity! We kill Louis and Morris; also, I think it is this turn that Gandalf finally shows up (not late, but just on time) to relieve me of my Threat-worries.\n\n \n\nOn Turn 9 all Trolls are dead, but there is no progress on Stage 2 because I quested unsuccessfully by one or so – weird.\n\n \n\nTurn 10 sees me Test of Will a third Frightened Beast, and I move on to Stage 3, where I kill another Savage Hill-Troll and another Hill-Troll (and now, writing this, I realize there shouldn´t have been one in the discard pile as there are only two – apparently I forgot to add one of them to the VP display...).\n\n \n\nThis means I have now killed all VP-enemies except for the Marsh Adder.\n\n \n\nTurn 11 the Marsh Adder shows up as the last card in the deck, and I can kill it with Haldir. The rest of the gang takes care of Rob and Bob easily, who was already wounded by various damage dealers.\n\n \n\nAll in all still an awesome quest, and I was somewhat unreasonably giddy about managing to kill the last VP-enemy missing – gotta catch them all! Well, better preserve that feeling because next up is a quest I don´t enjoy at all... saving the darned eagle! :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nScore 157: 33 Threat Lo/S + 37 Threat Le/T + 110 (11 rounds) + 0 damage – 23 VP\n\nMVP card: Haldir really cleaned house, but King Under the Mountain takes the MVP as the card that kept me flush with shiny toys.\n\nEdited October 22, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1308478","commentId":1308478,"userName":"byzantine","timestamp":1414014237,"content":"Scenario 6: A Journey to Rhosgobel,\n\nwhere we get our direct damage shoved right back into our stupid faces.\n\n \n\nI don´t like changing my decks for specific quests, but in this case I make an exception. I add 3 Healing Herbs (instead of Mirkwood Runners) to improve my chances of healing the damned eagle.\n\n \n\nI draw an amazing starting hand with Asfaloth, Healing Herbs, Light of Valinor, Test of Will and a Warden of Healing, and I plan to take advantage of it. The Treachery deck has all kinds of nasty direct damage cards ready for me, but because of my careful questing it only kills off Thalin with back-to-back Festering Wounds.\n\n \n\nI get rid of Rhosgobel with Asfaloth and start healing Wilyador with my Warden of Healing while I jerk around on Stage 1, waiting for an Athelas to show up. None ever does, but a second Healing Herbs urges me to rush through Stage 2, which a Sneak Attack Gandalf helps me do. I heal up Wilyador, and win. Yay.\n\n \n\nScore 84: 23 Threat Lo/S + 21 Threat Le/T + 40 (4 rounds) + 0 damage +9 (dead Hero) – 9 VP\n\nMVP card: Healing Herbs. With no Athelas in sight these really saved my bacon.\n\n \n\nScenario 6.2: A Journey to Rhosgobel (Nightmare),\n\nwhere the Hunters roam.\n\n \n\nI much prefer the nightmare version of this quest, but it´s still mainly a luck-based quest. Everything goes smoothly, I get an early Athelas, and then three (!) consecutive Athelas guarding each other.\n\n \n\nBut then it all starts going downhill. Merry is killed by the second Exhaustion in a row. Then back-to-back Swarming Insects and Festering Wounds take out almost my entire board, including Mirlonde and Sam. I still have a chance to win this, but the next turn a Necromancer´s Reach kills Thalin, taking out one deck and ending any hopes of still winning this.\n\n \n\nFAIL!\n\nMVP (for the bad guys): Exhaustion. Two of those are just brutal.\n\n \n\nScenario 6.2: A Journey to Rhosgobel (Nightmare),\n\nwhere the Hunters roam.\n\n \n\nThere´s not much to report here. I get a better draw with fewer direct damage cards, and two Healing Herbs and an Athelas are enough to win. The nightmare version seems a little less random then the original, but I´m still not a fan.\n\n \n\nScore 124: 29 Threat Lo/S + 29 Threat Le/T + 70 (7 rounds) + 0 damage – 4 VP\n\nMVP card: Healing Herbs. The card is basically made for this scenario.\n\nEdited October 23, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1309098","commentId":1309098,"userName":"byzantine","timestamp":1414070117,"content":"Scenario 7: The Hills of Emyn Muil,\n\nwhere we take a nice vacation.\n\n \n\nThere´s not much to say about this quest, it´s almost like a relaxing holiday for my guys after the punishments of Rhosgobel.\n\n \n\nI take some Threat early on from questing, but Haldir starts cleaning enemies and Asfaloth locations. I could have finished a turn eariler if not for two Emyn Muil locations showing up Turn 5, but at least Asfaloth spares us another Staging phase for Turn 6.\n\n \n\nScore 100: 31 Threat Lo/S + 32 Threat Le/T + 60 (6 rounds) + 0 damage – 23 VP\n\nMVP card: Asfaloth. The horsie made this go much faster then expected.\n\n \n\nSadly further nightmare decks have not arrived at my store yet, but I´ll get back to them when I receive them. For now, I continue the hunt for Gollum.\n\n \n\nScenario 8: The Dead Marshes,\n\nwhere we capture a certain former Hobbit.\n\n \n\nI am quite lucky to make the first few Escape Tests by 1 point each, although I would have had an Elrond´s Counsel in hand for an emergency. A late Pursued By Shadow gives me quite a lot of Threat, but I don´t really care about anything in this scenario that doesn´t place resource tokens on Gollum.\n\n \n\nSo I Test of Will a Whisp of Pale Sheen (which would place 2 resource tokens on him), and in the end there´s only two resource tokens on the little stinker so I make the final test easily.\n\n \n\nScore 115: 33 Threat Lo/S + 32 Threat Le/T + 50 (5 rounds) + 0 damage – 0 VP\n\nMVP card: Light of Valinor. Having Glorfindel for questing and Escape tests is neat.\n\n \n\nScenario 9: Return to Mirkwood,\n\nwhere we meet Spiders and Orcs and Insects once more!\n\n \n\nA Turn 1 Gollum´s Anguish raises my Threat early on, but over the next few turns nothing spectacular happens. Asfaloth gets rid of several locations, and the few enemies are dispatched easily.\n\n \n\nOn Turn 4 a Hill Troll shows up, and is dispatched off over two turns, though he does raise my Threat a bit again.\n\n \n\nDuring the final Stage an Attercop, Attercop shows up to serve as kind of an „end boss“, but a brave Vassal of the Windlord sacrifices himself so Haldir, Gwaihir and Thalin can take it out easily.\n\n \n\nScore 134: 39 Threat Lo/S + 39 Threat Le/T + 60 (6 rounds) + 0 damage – 4 VP\n\nMVP card: Asfaloth, again. Helped to get rid of locations, thus letting me quest much faster then normally possible.\n\nEdited October 23, 2014 by byzantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125123-ongoing-complete-playthrough-w-direct-damage-silvan-stealth/?do=findComment&comment=1311743","commentId":1311743,"userName":"byzantine","timestamp":1414276932,"content":"Scenario 10: The Massing At Osgiliath,\n\nwhere we are hunted by the horrifying Witch King!\n\n \n\nWow was this quest scary when it first came out! Not so much anymore, but there´s still a lot that can go wrong here.\n\n \n\nI start out by killing two Snaga Scout´s and sending a Wolves of Mordor back to the encounter deck while taking a bit of damage on heroes. I kill off the remaining enemies on turn two with the help of a Galadhon Archer and a Sneak Attack Descendent of Thorondor.\n\n \n\nOn Turn 3 I draw a Cut Off!, which makes me discard all allies in my hand. Ouch! As a consolation price I draw a Ranger to sacrifice on Stage 3, after which I engage the Witch King and kill him the turn after. I don´t think I´ve ever done that before, I usually just rush through the last stage in the questing phase; but with two Pelennor Fields in play that wouldn´t have been easy. Plus, it´s much cooler this way anyway.\n\n \n\nScore 159: 41 Threat Lo/S + 36 Threat Le/T + 80 (8 rounds) + 3 damage – 1 VP\n\nMVP card: None, really. It was a team effort – my direct damage strategy really had a chance to shine, with Sneak Attack and Born Aloft allowing me to play Descendents and Galadhon Archer´s to great effect (especially with all the Cut Off!´s making me discard allies in hand).\n\n \n\nScenario 11: Into the Pit,\n\nwhere the Goblins roam!\n\n \n\nThere´s not much to say about this quest. We get rid of the first three locations fast with the help of Asfaloth, run into some Goblins that we kill and that´s basically it.\n\nOne of the quests very much in the need of improvement from the nightmare deck (that I sadly don´t have yet).\n\n \n\nScore 107: 25 Threat Lo/S + 29 Threat Le/T + 60 (6 rounds) + 0 damage – 7 VP\n\nMVP card: Haldir and Thalin. Nothing really stands out, but those two went to town on the Goblins, so I´ll give it to them I suppose.\n\n \n\nScenario 12: The Seventh Level,\n\nwhere we find the tragic fate of the dwarven kingdom of Moria.\n\n \n\nAnother quest that can really use the nightmare update to make it more interesting. I start out with two Watchful Eyes, but Thalin has the Book of Mazarbul and basically ignores it while Elrond cures Sam of his. By the time a third Watchful Eyes appears and Thalin loses the book, I have Unexpected Courage on them instead. All in all three of the dreaded Watchful Eyes only give me two additional cards.\n\n \n\nA Turn 1 Upper Hall, two Deep Knowledge and a Daeron´s Runes give me lots of Threat, but also lots of cards; so I get all the tools I need to win this. Between the Watchful Eyes and the Undisturbed Bones (which kill some allies) the staging area is kept fairly clean. In the end we rush through Stage 2 in two turns, defending against, but otherwise ignoring, some enemies on the way.\n\n \n\nScore 110: 25 Threat Lo/S + 34 Threat Le/T + 50 (5 rounds) + 1 damage – 0 VP\n\nMVP card: Thalin and Haldir. They once more put the hurt on the Goblins; they make an awesome team.\n\n \n\nScenario 13: Flight from Moria,\n\nwhere we are pursued by Shadow and Flame!\n\n \n\nWhat a fun quest! The randomness of the Quest deck is a fun mechanic in my opinion, and with a Balrog hovering over you threatening to kill your heroes you become paranoid about every card drawn from the Encounter deck.\n\n \n\nThe original setup is pretty crazy; between the Treachery cards with Surge, the Abandoned Tools and the two (!) Massing in the Deep 10 cards were drawn; 3 of them are enemies that fill my staging area, including the tough Chieftain of the Pit. At least I also draw out one A Foe Beyond before it can hurt me.\n\n \n\nI take 5 Threat from questing and some more from Doomed effects during Turn 1 and can see this game going badly already. My decks refuse to be of any help either, with almost no card draw, no Gandalf, no A Very Good Tale showing up for the entire game.\n\n \n\nOver the first three turns Sam, Thalin and Mirlonde are all overcome by Shadow of Fear, which makes questing even harder. Taken aback by all the Threat gain I stupidly play Arwen to help with questing, and am punished for it immediately when Dark and Dreadful kills her and, more importantly, Sam Gamgee and I stare helplessly at my A Test of Will and Glordfindel´s empty resource pool. Well, at least Sam did his job by playing Steward of Gondor first, but of course I draw almost nothing but Leadership cards from this point forward with that deck.\n\n \n\nThe A Wrong Turn Quest card adds even more cards to the staging area, but at least an Elfstone sneaks in Gwaihir, who brings a Descendent of Thorondor along and they help get rid of the countless enemies that clutter the staging area at this point.\n\nOn Turn 5 we finally find an Escape from Darkness, and I grab the Abandoned Tools with Merry. 4 more turns and I´m out of here!!\n\n \n\nOf course, this wouldn´t be fun if an endboss didn´t show up. They´ve got a Cave Troll! This puts me in an awkward position, with one team down a hero, and Haldir unable to shoot it as it´s immune to ranged damage. It introduces itself with a Sudden Pitfall shadow card that would take out another hero, but I have a Hasty Stroke ready.\n\n \n\nBoromir and Gwaihir really shine here, as it is mainly them who take out the beast over three turns while fighting off other Goblins along the way while Merry chips away at our escape route (although Merry has to pitch in to kill it off and take a turn off chipping away at the exit).\n\n \n\nAt some point here I´m starting to topdeck with both decks. Not good. Finally A Foe Beyond takes out Thalin, but with the Cave Troll out of the way I can escape with 4 of 6 heroes still alive.\n\n \n\nAn awesome, very tough game; the combination of my decks kinda crapping out on me (no Threat reduction and card draw), all the additional cards added to the staging area and my stupid, stupid mistake that led to Sam dying made for a very tense game indeed.\n\n \n\nScore 206: 46 Threat Lo/S + 45 Threat Le/T + 100 (10 rounds) + 3 damage + 17 (dead heroes) – 5 VP\n\nMVP card: Boromir. He fought off a Stray Goblin for two turns while still bringing the pain to the Cave Troll, then even killed the Troll and the Goblin on the same turn with the help of Merry!\n\nEdited October 25, 2014 by byzantine"}]}