{"url":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/","title":"Ally Heroes?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304326","commentId":1304326,"userName":"drowsword","timestamp":1413706092,"content":"Just wanted to throw out an idea for a potential neutral card attachment:\n\n \n\nTitle: An Unlikely Hero\n\nType: Attachment\n\nSphere: Neutral\n\nCost: 5\n\nTraits: Warrior\n\nText: Attach to an ally controlled by a single player. That ally card is now considered a hero card for all intents and purposes. That ally collects 1 resource, matching its sphere, during the resource phase. When that ally leaves play, discard this attachment and all resources on that ally.\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304333","commentId":1304333,"userName":"MyNeighbourTrololo","timestamp":1413708475,"content":"\"When that ally leaves play, discard this attachment and all resources on that ally.\" Why the text? It's something that's going to be done by the game rules anyways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304337","commentId":1304337,"userName":"soulred","timestamp":1413709230,"content":"Personally, I think it should only be useable if at least one hero has already been killed. Otherwise you've got 4 heroes (or 5 depending on the scenario you are playing) which seems a little too strong. The card would likely need some rewording too. \"All intents and purposes\" is a little vague. Also, would it still count as an ally for the purpose of cards that target allies? And there would need to be a way to figure a threat cost for the ally, say in case it got targeted by Fallen into Evil. And what happens if the attachment gets removed... especially if the attached ally is your last hero!\n\n \n\nStill not a bad idea, it would just need to be a very wordy card to work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304678","commentId":1304678,"userName":"OMZA","timestamp":1413744005,"content":"Is this card unique or could I have 6 heroes? I don't like this idea, we already have heroes that also stand in their ally version, which means that I can play a card called \"unlikely hero\" on characters like Boromir, Faramir, Gandalf, likely Legolas in the near future..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304683","commentId":1304683,"userName":"OMZA","timestamp":1413744226,"content":"And why that trait - warrior? It will pair in a strange way with no warrior characters such as our mr. Woodman, Barliman Butterbur, or Galadriel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304710","commentId":1304710,"userName":"SauronTheGreat","timestamp":1413746229,"content":"you might want to also put in the phrase: limited 1 per deck\" otherwise you could end up with up to 7 heroes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304739","commentId":1304739,"userName":"gandalfDK","timestamp":1413748914,"content":"> And why that trait - warrior? It will pair in a strange way with no warrior characters such as our mr. Woodman, Barliman Butterbur, or Galadriel.\n\nSince when is Warrior a trait? It's a keyword, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304764","commentId":1304764,"userName":"OMZA","timestamp":1413752197,"content":"> > And why that trait - warrior? It will pair in a strange way with no warrior characters such as our mr. Woodman, Barliman Butterbur, or Galadriel.\n> \n> Since when is Warrior a trait? It's a keyword, right?\n\nRight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304765","commentId":1304765,"userName":"MyNeighbourTrololo","timestamp":1413752277,"content":"Is it? Keywards are Ranged, Sentinel, Doomed and that kind of stuff. Warrior is clearly a trait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304772","commentId":1304772,"userName":"OMZA","timestamp":1413752699,"content":"> Is it? Keywards are Ranged, Sentinel, Doomed and that kind of stuff. Warrior is clearly a trait.\n\nRight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304773","commentId":1304773,"userName":"OMZA","timestamp":1413752870,"content":"Always right, I am not really sure about the nature of words in bold like noble or warrior, but it could nbe enough reading Boon cards in Black riders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304814","commentId":1304814,"userName":"CJMatos","timestamp":1413756609,"content":">  \n> \n> > And why that trait - warrior? It will pair in a strange way with no warrior characters such as our mr. Woodman, Barliman Butterbur, or Galadriel.\n> \n> Since when is Warrior a trait? It's a keyword, right?\n> \n>  \n\n \n\n \n\nWarrior is a Trait ever since Core set with the Beorn, Brok Ironfist, Gondorian Spearman, Guard of the Citadel allies and Dunhere, Gimli, Glorfindel (lore) heroes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1304818","commentId":1304818,"userName":"OMZA","timestamp":1413756978,"content":"> > > And why that trait - warrior? It will pair in a strange way with no warrior characters such as our mr. Woodman, Barliman Butterbur, or Galadriel.\n> > \n> > Since when is Warrior a trait? It's a keyword, right?\n> \n>  \n> \n>  \n> \n> Warrior is a Trait ever since Core set with the Beorn, Brok Ironfist, Gondorian Spearman, Guard of the Citadel allies and Dunhere, Gimli, Glorfindel (lore) heroes\n\nThanks, we agreed on that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1305406","commentId":1305406,"userName":"joezim007","timestamp":1413819245,"content":"An Unlikely Hero (Unique)\n\n \n\nNeutral Attachment - Cost of 5\n\n \n\nAttach to a unique ally.\n\n \n\nAttached character loses the ally card type and gains the hero card type and the Warrior trait.\n\n \n\n-----\n\n \n\nAs simple as that. Could add the Limit 1 per deck. I'd be ok with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1305884","commentId":1305884,"userName":"MightyRauros","timestamp":1413838120,"content":"Do we still want the new hero collecting resources? While it is inferred, probably specifying it should be better.\n\n \n\nWhat about this:\n\n \n\nAn Unlikely Hero (Unique)\n\n \n\nNeutral Attachment: Cost 5\n\n \n\nAttach to a unique ally\n\n \n\nWhen a hero you control is destroyed, attached character looses the ally card type and gains the hero card type. Attached character now collects resources during the resource phase and their cost is now considered their threat cost.\n\n \n\nLimit 1 per deck.\n\n \n\nI'm not personally convinced that the addition of a trait is needed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1306137","commentId":1306137,"userName":"joezim007","timestamp":1413851998,"content":"I dont think we need to wait for a hero to die. It costs 5 so it will take 5 turns to make back the cost (plus the cost of the ally) and it would generally take 3 or more turns just to get the ally and the attachment paid for and put into play, so I don't see the point of the extra cost of losing a hero unless we lower the resource cost.\n\nYou did catch a major flaw in my card's design, though. I did not mention converting the cost to the starting threat cost.\n\nI still don't think we need to mention anything about the implied changes.\n\nEdited October 21, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1306233","commentId":1306233,"userName":"MightyRauros","timestamp":1413859131,"content":"Yeah, I debated the cost in my revision. One thought I had was make it optional like Brok Ironfist: high cost or free upon hero death. But I realized allowing players to have 4 heroes is a huge deal that needs to be compensated for. I thought of having them raise their threat by the allies cost as an option, but I think allowing the ally to replace a dead hero is a better choice.\n\n \n\nAs I have it above, I could see a lower cost being justified. Maybe a 3? If a hero does not need to die, then it needs some high costs to go along with it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/125170-ally-heroes/?do=findComment&comment=1306792","commentId":1306792,"userName":"joezim007","timestamp":1413904824,"content":"I don't understand why people consider this to be so amazingly powerful. What do you gain by having an extra hero?\n\n \n\n- Resources. There are so many other ways to generate extra resources for way cheaper.\n\n- A target for undefended attacks. There are some allies that can do this, and with the release of Nin-In-Eilph, we'll have a neutral attachment that allows other allies this ability. Also, if an ally dies (more likely with undefended attacks), they just go to the discard pile. If a hero dies, it counts against your score and you lose the resource generation. Although, this attachment should stop making the ally a hero the moment it dies because it'll be dead and the attachment will no longer be attached or in play, so it wouldn't count against your score.\n\n- Another sphere. This is an awful lot of trouble to gain an extra sphere. Songs are much easier.\n\n- More attachments can target heroes. After spending so many resources to make a decent ally into a hero, this is probably the largest benefit. There are some allies that can do some amazing things, but can't build up the readying or the stats that you'd like to make them powerhouses. If we convert them to a hero, they are opened up to a much more powerful world.\n\n \n\nAll-in-all I think that the cost of 5 greatly helps to mostly neutralize the first 3 benefits and makes the card well-balanced and difficult to pull off. If we make it limited to 1 per deck, then the third and fourth benefit are almost completely neutralized due to the fact that you cannot rely on the card showing up in a game at all.\n\n \n\nI think making the card cost 4 and limited to 1 per deck is good. Otherwise make it cost 5 and making it unique should be enough to keep it from getting out of hand. The only other change we need to make, then, is to make sure it can't be attached objective allies:\n\n \n\n----\n\n \n\nAn Unlikely Hero (unique)\n\n5 cost Neutral Attachment\n\n \n\nAttach to a unique non-objective ally.\n\n \n\nAttached character loses the ally card type and gains the hero card type. The attached character's printed cost becomes its printed starting threat.\n\n \n\nAn-Unlikely-Hero.jpg?psid=1 [https://eoym1q-dm2306.files.1drv.com/y2pdSKk3I76GsxHIHJH4il4uS-YBY02KvtLz4o0qq1Nxv1ENMpxSatqBXzUMXwkXj84EOvY_QhLI-gbBrrTLlqLJPfh6L94qbKPI35AQ1UzwnI/An-Unlikely-Hero.jpg?psid=1]\n\n \n\n----\n\n \n\nOther people may have alternative opinions and that's fine. I'm done debating the"}]}