{"url":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/","title":"Breaking of the Fellowship quest card 2b","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1311911","commentId":1311911,"userName":"GrandSpleen","timestamp":1414297782,"content":"Hi,\n\nI'm having trouble understanding what's supposed to happen when you get to card 2B on Breaking of the Fellowship.  Here is what the quest card says:\n\n \n\nForced: At the end of the refresh phase, shuffle Seat of Seeing and Forod's Choice into the encounter discard pile. Then, place the encounter discard pile on the bottom of the encounter deck. Starting with the first player, each player creates his own staging area and advances to a different stage 3A of his choice. In player order, each player moves 1 encounter card from this staging area to his. When there are no encounter cards left at this stage, discard it. \n\n \n\nWhat I don't understand is the last two lines (which I bolded).  \n\n \n\nEach player goes to their own 3A.  Then each player moves 1 encounter card into their staging area.  After each player has done this, there might still be more cards left in the encounter area.  What happens to them?  Do they just sit in limbo?  I can't see any card effect that would have them come and jump into another player's staging area, so unless you clear them with your 3B quest card responses, they just sit there, never engaging or contributing threat, archery or anything else.\n\n \n\nWhen I first read this (and in my first two playthroughs), I moved ALL of the encounter cards, 1 by 1, until there were no more cards left at 2B.  However, the quest card doesn't say \"until there are no cards left.\"  So I'm thinking you're not supposed to do that.\n\n \n\nSo then you end up with extra encounter cards sitting at 2B doing nothing but take up table space...?? Maybe when someone advances to stage 4B, they will rejoin the original staging area, and all of those cards will be active again.  But I do not see any directions that indicate this.  As I'm reading, you simply enter your own 3A/B staging area, then advance to 4A (still in your own staging area, not joining the original staging area and its leftover encounter cards).\n\n \n\nAnyway, I can't figure this out.  What am I doing wrong?  \n\nThanks for help,\n\nGS\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312041","commentId":1312041,"userName":"gandalfDK","timestamp":1414317334,"content":"No, it is just as with stage 1B, with the cards in player order.\n\n \n\nAll the cards in the staging area of 2B, for example 4 cards and you are playing a twoplayer game, will come down into the two separate staging areas of your indivual stages 3B. Player 1 gets card A and C (first and thirth) and Player 2 gets B and D. And then there are no cards left in the staging area of 2B and you discard stage 2B. So spread the cards of stage 2B in player order over the different stage 3B's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312043","commentId":1312043,"userName":"gandalfDK","timestamp":1414317437,"content":"You do have to move all encounters cards from 2B, because otherwise you cannot discard it and thus not advance to stage 3. It says: \"When there are no encounter cards left at this stage, discard it.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312052","commentId":1312052,"userName":"PsychoRocka","timestamp":1414318557,"content":"Yeah gandalfDK has it right, each player advances to a different stage 3 and you continually move encounter cards into each players staging till none are left at stage 2 and it is discarded.\n\nOtherwise the effect on stage 3A of adding an extra encounter card to staging if the threat moved from stage 2 to this stage is less than 4 would make no sense as with only one card this would ALWAYS trigger.\n\nEdited October 26, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312195","commentId":1312195,"userName":"GrandSpleen","timestamp":1414339677,"content":"That is what I thought at first, but what I really want to know is: how does the text support this?  \n\n \n\nWhat if I wrote this: \"In player order, each player draws 1 card from his deck.  When there are no cards left in any player's deck, advance to the next quest stage\"\n\n \n\nWould you continually draw cards until there are none left?  Or just 1 per player?  When I first read \"The Company Divided,\" I immediately understood it as \"move cards until there are none left,\" but I got very confused after reading it closely. The text doesn't say this at all, does it?\n\nEdited October 26, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312203","commentId":1312203,"userName":"gandalfDK","timestamp":1414340848,"content":"How else will you get : \"when there are no cards left at this stage, discard it.\" There are no other ways of getting this staging area empty.. \n\n \n\nI understand what your problem is, but a look the other way around delivers the same problem. There is also nowhere stated that you have to leave cards or not divide them over the players. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=1312205","commentId":1312205,"userName":"GrandSpleen","timestamp":1414341174,"content":"Yeah I agree as well, the problem is that (unless I'm reading wrong), playing the card as written can result in a \"dead\" 2B staging area, which happened in my game.  You could still clear its remaining cards with 3B quest card Responses, but there would be no reason to do so.  \n\n \n\nI'm sure the intent is to divide up all of the cards.  I guess I am just griping over the wording."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=3534846","commentId":3534846,"userName":"player3351457","timestamp":1542154514,"content":"I know this is resurrecting an old topic... but my buddy and I were playing this last night and we got stuck on the travel phase. In usual \"split the staging area, pretend you are playing solo for a second\" games in the past (hobbit, dwarrowdelf), there are specifications as to what to do with locations. I.e. do we each have an active location? Do we still only have one active location? Can we not travel at all?\n\nAlso, if we haven't reached 2B/3B yet, do we ignore \"in this stage\" effects?\n\nThanks for your help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125717-breaking-of-the-fellowship-quest-card-2b/?do=findComment&comment=3534959","commentId":3534959,"userName":"Wandalf the Gizzard","timestamp":1542163795,"content":"Each player may have an active location, as per normal rules. \"In this stage\" would refer to the active stage; no matter whether all players are present or some are at a different stage.\n\n> On 10/26/2014 at 12:32 PM, GrandSpleen said:\n> \n> I'm sure the intent is to divide up all of the cards.  I guess I am just griping over the wording.﻿\n\nYou're not the only one. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]"}]}