{"url":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/","title":"Crazy Multiplayer stories","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313304","commentId":1313304,"userName":"7theye","timestamp":1414434521,"content":"I thought I would ask a more light hearted topic about the craziest, funniest or downright insane stufs you have seen in MP games. \n\n \n\nHere is my list of 3 things\n \n\n \n\n3. No Test of Will: Playing a three player nightmare hobbit quest with the trolls. Going mono deck, I have leadership and a tactics and spirit player. We keep hitting the dame treachery that moves you onto step two and get troll stomped. After the 3rd reset within about 2-3 rounds the tactics guy jokes out loud that the spirit guy (mono spirit) should just mulligan if we don't get Test of Will. He casually tells us that he has not included any of them (no Elenaor either). As I try not to drop my deck, the tactics guy asks to see his deck and confirms this is true. After wondering why he didn't at least sideboard it after 3 losses in a row he asks him how on earth he thought to leave it out in a mono spirit nightmare game. He tells us that he he wanted to focus on willpower and has loaded up on Favour of the Lady and such cards. sigh. \n\n \n\n2. No Uniqueness:  After sitting down for a MP game we get into the second round before someone drops a gandalf into play (OHUH version). He is sticking around. Next round a guy dumps Core Gandalf into play. I look at him and point out he can't do that as there is already a unqiue Gandalf in play. The worst part is that this guy is old, like 40-50 or something and acting like a child. He suddenly starts shouting about how no one wants him to play Gandalf anymore. He pulls out a rulebook and points to something random in there and throws it at me telling me to find this rule. I calmy point out that you cannot have more than one unique in play. He then tells me that he can't even play his Steward of Gondor then because I've already played it. I tell him yes and he loses it. Starts going on about how everyone but him can play these cards and we are making up rules. I point out this is a co-op game when he gets up and goes home. He then screams that everyone can play Gandalf over and over again. \n\n \n\n1. Exhaust: After sitting down to a MP game one guy has Beravor on the table. We are committing to the quest and he exhausts Beravor and draws cards. I think he has counted the will power but I am not 100% sure but I decide to watch him more carefully. Next round he leaves her upright along with Denathor and takes an enemy. He declares Denathor as defender and immediately looks to the encounter deck and elects to keep the top card there. He then attacks back with Beravor and draws two cards (see what he is doing?). I point out to him that you have to exhaust those heroes to use those actions and then then cannot defend or attack. He tells me he did exhaust them to defend and when they exhaust he draws cards. He even puts his finger under the word exhaust and smiles at me. Obviously we are getting no where. After a game I leave because this is stupid. Worst part is that this guy told me that he and his son never win anything which means they must be horrible if he is using these rules.\n\n \n\n \n\nWhat have you guys seen?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313318","commentId":1313318,"userName":"MyNeighbourTrololo","timestamp":1414435199,"content":"Lold at the third case. Second one is sad though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313376","commentId":1313376,"userName":"Olorin93","timestamp":1414437967,"content":"This is hilarious! Where do you find these people? I only play this game with my girlfriend and two close friends (known them for about 10 years) and we never get cross.\n\nTest of Will is an auto-include for me if I have Spirit access. Favour of the Lady is not worth the cost imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313414","commentId":1313414,"userName":"silverthorn","timestamp":1414439945,"content":"I have vague memories of playing five-player The Black Riders. I'm not great on specifics, there's been a lot of water under that bridge, game wise but it was completely freaking insane (I rarely play more than two-handed so plunging head-first into a five-player game was a bit of a culture shock. Oddly enough, I've never played more than two-handed since then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313457","commentId":1313457,"userName":"MyNeighbourTrololo","timestamp":1414441791,"content":"Funny, the most tragic thing that ever happened to me is \"fighting\" with friend because he keeps his discard pile facedown near his deck or places his hand on the table so close to his player cards that are actually in play that it's hardly distinguishable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313494","commentId":1313494,"userName":"GrandSpleen","timestamp":1414443342,"content":"We had a nice win one time in Return to Mirkwood: On the final round our threat was 40 and 43.  Gollum was with me, and there were 2 Attercop, Attercops engaged with me.  We had to clear them to win.  Beregond defended against one and killed it thanks to Spear of the Citadel.  We had put Arwen's sentinel-granting ability onto Gildor on the other player's end of the table, and we then sacrified Gildor to the other spider.  Now we had Glorfindel with a Rivendell Bow for ranged support from the other deck (3 atk), and Aragorn (3), Ithilien Tracker (1), Denethor (1), and Erebor Hammersmith (1) on my end of the table for the attack.  Total power of 9.  We needed 10.  After scouring our cards and racking our brains, we were about to give in and hope for another innocuous round, when I noticed that Elrond, my partner's hero (and also stuck with a copy of Caught in a Web) was ready.  With Vilya.  We recalled that Elrond's deck ought to have two copies of Silverlode Archer in it still.  We went for it, and voila--- Silverlode Archer into play via Vilya.  Gave us 11 combined attack power and a miraculous win.  We might have still survived another round, but there may have been more enemies coming out, etc., and it was hard to tell whether or not something would have ended the game for us.\n\nEdited October 27, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313574","commentId":1313574,"userName":"FetaCheese","timestamp":1414447122,"content":"I thought crazy stories meant funny stories but now I am mad instead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1313772","commentId":1313772,"userName":"divinityofnumber","timestamp":1414461135,"content":"Those three stories that the OP mentions seem incredibly frustrating. Thankfully, I play with a group that has been playing since day one and knows the details of the rules. \n\n \n\nOne key for fun LOTR play is to coordinate ahead of time. If you know that you're meeting to play in a few days, you need to email with the group and figure out who will be playing what. That way you do not run into those problems of people holding dead cards in their hand like that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1314000","commentId":1314000,"userName":"FetaCheese","timestamp":1414487385,"content":"In casual multiplayer or spontaneous games, we often ignore the unique character rules for the sake of inclusion. \n\n \n\nAs for me, my wackiest multiplayer stories are correcting my pals during gameplay. Yes, I am THAT guy.... yay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125835-crazy-multiplayer-stories/?do=findComment&comment=1314018","commentId":1314018,"userName":"alogos","timestamp":1414491783,"content":"The one I get twice already was players who have 3 ranged hero, obviously to play Rumil, and then I see Sneak Attack.\n\n\"Got a bad news for you my friend\""}]}