{"url":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/","title":"Thoughts on Elfstone?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1315888","commentId":1315888,"userName":"Rob_Oz","timestamp":1414606592,"content":"Hey all,\n\n \n\nWith the arrival of The Road Darkens I've broken out my Hobbit deck that I built last year with the Black Riders box.  One card in TBR that garnered much attention from the community (myself included) was Elfstone.  Indeed, I threw Beorn into my Hobbit deck as one way to capitalize on Elfstone.  A year later, I think its safe to say my enthusiam for Elfstone has waned quite a bit.  Make no mistake I really want to like this card but almost everytime I play I find it sitting unused in my hand.  Perhaps I've not constructed my deck properly to take advantage of the card, but I tend to think that the card just isn't quite as good as I once thought.  Here are a few reasons I think may be why:\n\n \n\n1) Randomness - Unless you've built a deck that has a lot of ways to manipulate itself (Imladris Stargazer, Gandalf, etc, etc) you don't have a lot of control over what allies will be in your hand at the time Elfstone appears.  Furthermore you likely have even less control over when and what locations appear from the encounter deck.  This makes it difficult to play the card effectively.  This problem tends to be exacerbated in multiplayer.  Certainly everyone likes the ability to pop an ally into play with Elfstone, but the fact that the card specifically targets the first player adds more randomness.  While the players obviously can gameplan to try and exploit Elfstone together, the \"first player\" aspect of the card makes it that much trickier to use.\n\n \n\n2) Locations powering up - Over the past year or so I think we've definitely seen the power level of Locations get ramped up.  Certainly we are all aware of the increase of \"Immune to player card effects\" on pivotal story Locations in many quests (Brandywine Bridge in TBR and Doors of Durin in TRD are two examples).  Additionally I find that even non-unique locations have gotten nastier such that I'd prefer to get rid of them as quickly as possible.  As a result, I'm often reluctant adding even just +1 quest point from Elfstone on to a location as that increase can jeopardize my ability to explore the active location.  Moreover, newer locations often have higher quest point values of 4, 5, or even 6 points.  Adding an additional quest point on top of those high values with Elfstone just isn't appealing.  The Time mechanic of the VoI cycle just makes this problem worse.  With the time counters disappearing every round locations really need to get cleared ASAP.\n\n \n\n3) Elfstone is in Lore - As we know, Lore cards tend to be a bit expensive while the sphere itself lacks resource acceleration.  I find this often makes it hard for me to find a time to play Elfstone.  This last drawback can really make me hold the card in my hand for a long time when I factor in the two aforementioned drawbacks.  The higher cost of many of Lore's cards, the \"active location\" requirement for Elfstone, and the increased power level of new locations often just don't permit a good window of opportunity to play Elfstone.\n\n \n\nAnyone else have any thoughts on this card?\n\nEdited October 29, 2014 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1315897","commentId":1315897,"userName":"MyNeighbourTrololo","timestamp":1414607144,"content":"My feeling about the Elfstone are close to yours. I don't use it in solo much, because my solo decks tend to be agressive and filled with cheap-to-medicore allies and/or strong resource acceleration, so Elfstone is just not needed. But I tried to use in multiplayer, like a lot, and almost never it was used to the great success because of the reasons you've already stated:\n\n1) First player does not always has a good candidate to put into play;\n\n2) Clearing current location is too crucial to risk a failure;\n\n3) Lore player has enough on his plate and can't spare a resource for a probability of someone putting something into play later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1315924","commentId":1315924,"userName":"chrsjxn","timestamp":1414608518,"content":"I tend to play high cost ally decks, because 4 resources gets you an ally with basically hero stats. So anything that gets one of those into play for fewer resources is awesome. Timely Aid is the best, if you're under the secrecy threshold. Or Vilya, if you're not.\n\n \n\nBut with Asfaloth or a light staging area, it's pretty easy to be in a good place for Elf-stone. And since it's an ally in your hand, you know if you have a good candidate before you play the card.\n\n \n\nOutside of solo play, though, I'd probably find it a bit worse. Though now you can steal the first player token, so maybe it's not as big of a deal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1315931","commentId":1315931,"userName":"joezim007","timestamp":1414608769,"content":"In 1 and 2 player it works pretty well. Obviously, if you're playing \"cheap\" decks, then it doesn't help much, but I like to balance the costs a little more to get some more powerful allies in. Generally, you are going to go through and explore locations anyway, so why not use a card that triggers off of it? The extra quest point kinda sucks, but most of the time it doesn't have much impact and the ally you bring into play will have a greater positive impact than the negative impact of the extra quest point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316090","commentId":1316090,"userName":"chuckles","timestamp":1414616289,"content":"If you could choose which player got the 'free' ally then I would like this card a whole lot more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316217","commentId":1316217,"userName":"danpoage","timestamp":1414622957,"content":"I agree that it can be situational, but I also think that it is very powerful. While you can make the argument that it is less powerful in multiplayer, I disagree. In our four player games, it is almost always the case that two of the players will have high cost allies worth using. The Lore player who includes Elf-Stone will often include Gildor Inglorion or Anborn - both excellent options for this card. To avoid missing with this effect, you simply have to ask the first player if they could benefit from a free ally, if not you save it until the next round. Unlike others' experiences above, I have never had an Elf-Stone sit in my hand unused, unless I draw it the last round of the game (in which case many excellent cards are dead).\n\nA for solo play, this is amazing in a deck that is designed to use it. My Hobbit secrecy deck does not have any access to Tactics and yet is consistently able to get Beorn, Landroval and Boromir into play. The key with ally mustering is not to be reliant on only a single method. With Timely Aid, Sneak Attack, A Very Good Tale and Elf-Stone (the latter two cards will often be 2x instead of 3x) and a deck filled with powerful allies of all spheres, it is very rare for any one of these cards not to be useful.\n\n \n\nAnother thing to consider is the use scrying and card draw to help improve these mustering cards. Outside of card draw and effects like Gildor or Imladris Stargazer, I agree that Elf-stone can definitely miss. But when I include Elf-stone in a deck, I am going to have card draw (Lore hero means plenty of that) and I will often include Imladris because of how well it works with other cards like Timely Aid and Expert Treasure-Hunter. In this context, Elf-Stone is an amazing bargain, especially when I am mustering allies that I don't even have the resources to pay for normally.\n\nSome will site examples of where the card is dead, and it has been dead for me on occasion, but I think this misses the larger point. The game doesn't need any more powerful cards that do not require planning, strategy and good decision-making. The fact that Elf-stone requires these things and gives a powerful benefit, all while being thematic, makes it an excellent card. If it allowed you to choose the player or was changed in some way to be easier to pull off, it would be power without constraints and it would be boring\n\n \n\nThis is why I don't play Outlands - it is powerful without requiring much thought. I much prefer cards like Elf-stone that require a well-designed deck and a more deliberate strategy. This goes for multiplayer as well. The best multiplayer games are where there has been at least a minimal amount of forethought and strategy between players (including which decks to play). This avoids having an Elf-stone in hand with no one at the table (including yourself) who can take advantage of it.\n\nEdited October 29, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316306","commentId":1316306,"userName":"7theye","timestamp":1414630542,"content":"Totally agree with Dan.\n\n \n\nGame is to the point where it is overpowered:\n\n \n\n-Dwarfes\n\n-Outlands\n\n-Elrond/Vilya\n\n-new Gandalf hero\n\n \n\nBuilt correcetly, these decks are easy to work and can smash most scenarios. For instance, to make new Gandalf work throw in his new toys and expert treasure hunter, pair with with Elrond and Vilya and laugh at the high threat by throwing in Glordinfel and suddenly you will never lose. Same iwth Dwarfes and Outlands.\n\n \n\nI like Elfstone bc its a great card but it requires some thinking and it doesn't always work. I think we need more cards like this and less 'auto-win' cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316315","commentId":1316315,"userName":"leptokurt","timestamp":1414631126,"content":"My main beef with Elfstone is that thematical it belongs to a Silvan or Noldor deck. I'm currently playing a Silvan deck, and the Silvan trait already has better options to bring extra allies into the game.\n\n \n\nA nice combo (for solo play) might be the new Galadriel ally and Elfstone. Not only is she able to put Elftsone for free into the game, she also lets you arrange the remaining four cards of the playerdeck so that you have a good chance to put a high cost ally at the top of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316360","commentId":1316360,"userName":"divinityofnumber","timestamp":1414636465,"content":"I enjoy it for some of the reasons already mentioned. There are some nice Lore and Leadership allies with hero-type stats that feel amazing to get out for one resource. I don't typically play Elfstone outside of single player, however. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316381","commentId":1316381,"userName":"Bullroarer Took","timestamp":1414638634,"content":"I use Elfstone in my Noldor deck which has a lot of expensive allies. Vilya brings them in most of the time, but a couple of copies really smooth out the first few turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1316964","commentId":1316964,"userName":"Rob_Oz","timestamp":1414691818,"content":"To be clear, I emphatically did NOT mean to imply that I thought Elf Stone was weak, under-powered, etc, etc.  I like the design of the card.  If I were to distill my point down simply it would be that in light of the increased power level of Locations and the Time mechanic, I find Elf Stone rather difficult to use barring a deck specifically designed to exploit it. \n\n \n\nSpeaking for myself, I'm not a fastidious, rigorous deck builder.  I'd much rather jump in and play a scenario than invest time on deck-building.  This absolutely plays into the lack of effectiveness I've experienced with Elf Stone, but I do think my original criticisms of the card are still fair.\n\n \n\nRE:Outlands - I don't care for Outlands either.  The cards don't require much thought to play and, more importantly to me, have little connection to the world of Tolkien.  As a fan of Tolkien's work, I'm not all that keen on a powerful deck archetype based on characters that really aren't part of the LOTR story.\n\nEdited October 31, 2014 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1317040","commentId":1317040,"userName":"Glowwyrm","timestamp":1414695801,"content":"My only beef with Elf-Stone is that it doesn't work with \"Immune to Player Card Effects\" locations anymore (and we're getting a lot of those).  That is about the only time it ends up as a \"dead\" card in my hand because I have to wait to play it until the immune location is cleared. \n\nOne thing that hasn't been mentioned is how well it combos with a location management strategy.  I always include it in an Idraen deck since I am going to be clearing locations like mad anyways and I want to reap the maximum benefit from this.  An extra point of progress is worth the extra resource acceleration, even if I only save a couple of resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1317553","commentId":1317553,"userName":"leptokurt","timestamp":1414748815,"content":"So let's make some positve PR for Elfstone, as it really is a card, as has been said, that requires some strategic planning.\n\n \n\n \n\n1) It's power cost ratio is amazingly good.\n\n \n\n2) It helps to handle a typical solo player problem: I have tons of WP but no ATT to take out the boss monster, because these (lore) allies are so expensive.\n\n \n\n3) If you don't need it you can feed Protector of Lorien with it without starting a drama (lots of games get lost because I can't bring myself to burn the precious cards in my hand).\n\n \n\n4) Combos nicely with certain heroes (Idraen, Legolas, Glorfindel).\n\n \n\n5) Acts as a last turn effort to turn the tide if some boss monster is approaching and you're in dire need of some extra fighting power or damage (Beorn, Gandalf!!!!).\n\n \n\n6) It's well balanced!\n\nEdited October 31, 2014 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1317566","commentId":1317566,"userName":"MyNeighbourTrololo","timestamp":1414750018,"content":"I think the entire thread can be summed up in one sentence: \"Elfstone is not a universal card\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/125988-thoughts-on-elfstone/?do=findComment&comment=1318153","commentId":1318153,"userName":"leptokurt","timestamp":1414787103,"content":"> I think the entire thread can be summed up in one sentence: \"Elfstone is not a universal card\".\n\nWhich would be rather boring. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"}]}