{"url":"https://community.fantasyflightgames.com/topic/126162-4th-cycle-and-the-road-darkens/","title":"4th cycle and The Road Darkens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126162-4th-cycle-and-the-road-darkens/?do=findComment&comment=1318725","commentId":1318725,"userName":"Scroll Lock","timestamp":1414860368,"content":"Hi guys, few weeks after release of VoI I sold my whole LOTR LCG collection except for the core set and FoS (haha, I still remember the shortcuts) from different reasons. I am now thinking about comeback to the game, but I want to hear from you what do you rhink about the 4th cycle and the new saga expansion? Thank you all for answers. (Btw, I am pure solo player, sometimes I played 2-handed)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126162-4th-cycle-and-the-road-darkens/?do=findComment&comment=1318874","commentId":1318874,"userName":"FetaCheese","timestamp":1414870516,"content":"VoI quests are exceptional,  best quests in the game imo mechanically speaking, (also a bit easier than normal thanks to seperate nightmare mode, which I prefer and yes I do play both). Time mechanic really benefited the game. Also they are very innovative co pared to the older cycles (Trouble in Tharbad etc).\n\n \n\nNightmare mode is excellent, really saved the older quests. Worth every penny for players with near complete collections.\n\n \n\nNew player cards strike the balance between power and fun. New silvan elves are really fun, unlike outlands. New Gandalf hero is really strong, but as far as I can tell, not Dain strong, which is good. He allows new types of decks to develop.\n\n \n\nMy experience with the new saga expansion is too limited to comment right now.\n\n \n\nOverall I feel the game is in a great place right now, probably more than ever before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126162-4th-cycle-and-the-road-darkens/?do=findComment&comment=1318905","commentId":1318905,"userName":"richsabre","timestamp":1414872379,"content":"the cycle so far is promising.. new game mechanics for both player cards and encounter cards keep the game feeling fresh...the art is as amazing as it ever was, and we're seeing some epic characters in this cycle...again i cant yet comment enough on the saga"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126162-4th-cycle-and-the-road-darkens/?do=findComment&comment=1318924","commentId":1318924,"userName":"MyNeighbourTrololo","timestamp":1414873184,"content":"Lemme tell you what - if your aim is to break your teeth, this cycle is not that good, but it still can be sometimes. If your aim is to have an immersive thematic fun with a bit of challenge (or a lot of it if you're not a power player), then this new cycle does a dramatic job. \n\nEdited November 1, 2014 by MyNeighbourTrololo"}]}