{"url":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/","title":"Question about Murzag","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319102","commentId":1319102,"userName":"faith_star83","timestamp":1414884990,"content":"Hey Guys, maybe I am overthinking this, but how does Murzag's (from the Morgul Vale Quest) ability work?\n\n \n\nThe ability reads:\n\n>  \n> \n> Forced: After Murzag attacks, reveal the top card of the encounter deck. If that card is an enemy, put it into play engaged with the defending player.\n\n \n\nSo...after he makes his attack, I reveal a card from the encounter deck and if it is an enemy I put it into play engaged with the defending player. But what happens if it is not an enemy? Do I put it back on top of the encounter deck or add it to the staging area / resolve it?\n\n \n\nAlso another question: If my friend uses a Character with Sentinel to defend for me (but Murzag is engaged with me) and I reveal an enemy through Murzag's ability, who is considered to be the 'defending player' and gets the revealed enemy?\n\n \n\nThanks for your help! Btw, having a really hard time with MV...despite running 3x Test of Will I always get smashed by either Watcher in the Woods or The Master's Malice :-(\n\n \n\nEdit: Spelling / Clarification\n\nEdited November 1, 2014 by faith_star83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319134","commentId":1319134,"userName":"GrandSpleen","timestamp":1414887740,"content":"Murzag is a beast.  Look for turn 1 Feint in your hand, or some other way to keep him from attacking.  When he attacks he will indeed add the revealed card to the staging area if it's a location (or resolve its effects if it is a treachery).  We had an official clarification way back:\n\n-----------------------\n\nSince \"reveal and add to the staging area\" is just long-hand for \"reveal\" we've mostly stopped using \"and add to the staging area\" in order to save space and allow room for more effects or flavor text. Therefore, Murzag's Forced effect works the same as any other effect that forces players to reveal cards from the encounter deck: resolve any \"when revealed\" effects and keywords, then resolve the staging of that card. If it is a treachery card, it is discarded after resolving its effects. If it is a location, add it to the staging area. If it is an enemy, Murzag's ability instructs the defending player to put it into play engaged with him instead of adding it to the staging area. That enemy will make an attack since it is still the \"resolve enemy attacks\" part of the combat phase, but it will not be dealt a shadow card.\nHope you're enjoying the conclusion of the Against the Shadow cycle!\nCaleb\n\n------------\n\n \n\nAnd that is from this thread here [https://community.fantasyflightgames.com/index.php?/topic/94687-morgul-vale-captain-murzag-forced-effect-question/?hl=murzag].\n\nEdited November 2, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319246","commentId":1319246,"userName":"Teamjimby","timestamp":1414895939,"content":"To answer your other question, the defending player is the player with whom the enemy is engaged.  So if your friend defends for you via sentinel, you are still considered the defending player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319397","commentId":1319397,"userName":"faith_star83","timestamp":1414922998,"content":"Thank you very for your help, guys! I knew somebody already asked this, but my search did not turn up any results (it seems I searched in the main forum, hoping the search would include sub-forums as well - which it does not).\n\n \n\nAlso I saw the updated entry in the FAQ, which basically says exactly what is in GrandSpleen's quote of Caleb. But still I was not sure...now I am!\n\n \n\nActually, I just had another moment of uncertainty: I revealed a The Power of Mordor [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/heirs-of-numenor/the-power-of-mordor-hon] this morning and was not sure how to handle it in MV. Murzag is in the staging area, but he cannot leave play , so doesn't get shuffled into the encounter deck. But he still counts as a card in the staging area, right? Does this mean I have to search my deck or x (being the number of non-Murzag cards in the staging area that get shuffled into the encounter deck) + 1 (for Murzag) and reveal them?\n\n \n\nAgain, thank you for your help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319404","commentId":1319404,"userName":"OMZA","timestamp":1414925450,"content":"It is strange to me that the enemy put into play by Murzag is not dealt a shadow card when attacking, but whatever enemy attacking outside of the combat phase is indeed dealt a shadow card. But those are the rules and clarifications..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319428","commentId":1319428,"userName":"jjeagle","timestamp":1414930678,"content":">  \n> \n>  \n> \n> Actually, I just had another moment of uncertainty: I revealed a The Power of Mordor [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/heirs-of-numenor/the-power-of-mordor-hon] this morning and was not sure how to handle it in MV. Murzag is in the staging area, but he cannot leave play , so doesn't get shuffled into the encounter deck. But he still counts as a card in the staging area, right? Does this mean I have to search my deck or x (being the number of non-Murzag cards in the staging area that get shuffled into the encounter deck) + 1 (for Murzag) and reveal them?\n> \n>  \n> \n> Again, thank you for your help!\n\n \n\nYes BUT you also count 1 for To the Tower. See this ruling from Caleb:\n\n \n\nThe Power of Mordor should read:\n\n\"When Revealed: Count the number of encounter cards in the staging area and shuffle them into the encounter deck. Reveal an equal number of cards from the encounter deck and add them to the staging area. This effect cannot be canceled.\"\n\nIt should not use the word 'Then'. That will be corrected in the next FAQ.\n\nWithout the word 'Then', The Power of Mordor interacts with To The Tower and a Captain enemy like this:\n\n-You count the number of encounter cards in the staging area, including To The Tower and the Captain enemy.\n\n-Shuffle all the cards counted into the encounter deck, except To The Tower and the Captain enemy.\n\n-You reveal the number of encounter cards that you counted and resolve their staging.\n\nThis does make The Power of Mordor a nastier treachery card in The Morgul Vale than in any previous scenario, since you are in a way revealing 2 additional encounter cards. However, it seemed fitting to us that The Power of Mordor should be stronger when you are in fact on the very doorstep of Mordor in that scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126185-question-about-murzag/?do=findComment&comment=1319490","commentId":1319490,"userName":"faith_star83","timestamp":1414935895,"content":"Thank you very much, jjeagle! Also for this question there was already an official ruling...sory for the cross-post, then.\n\n \n\n> It is strange to me that the enemy put into play by Murzag is not dealt a shadow card when attacking, but whatever enemy attacking outside of the combat phase is indeed dealt a shadow card. But those are the rules and clarifications...\n\n \n\nIndeed it makes sense, since the shadow cards are dealt at the beginning of the combat phase, so I wonder why this ruling does not apply to other attacks suchs as e.g. the ones induced by Morgul Bodyguard [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/against-the-shadow/the-morgul-vale/morgul-bodyguard-tmv] as well."}]}