{"url":"https://community.fantasyflightgames.com/topic/126195-ever-my-heart-rises-west-road-traveller/","title":"Ever My Heart Rises + West Road Traveller","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126195-ever-my-heart-rises-west-road-traveller/?do=findComment&comment=1319344","commentId":1319344,"userName":"TragicTheBlathering","timestamp":1414911524,"content":"So I was woundering about this card Ever My Heart Rises (been playing Darrowdelf Nightmare recently).\n\n\n\n\n\nEver My Heart Rises\n\nResponse: After you travel to a Mountain or Underground location,\n\nready attached character and reduce your threat by 1.\n\nWest Road Traveller\n\nResponse: After you play West Road Traveller from your hand,\n\nswitch the active location with any other location in the staging area.\n\nSo if I use West Road to travel, dose Every My Heart still trigger? If so.. what about Strider's Path and Thror's Map.. also as responses are resolved in player chosen order.. think this might combo with Strength of Will?\n\nI dunno.. I was thinking of ways to do threat managment and I'm sick of 3x Greating + 3x Tomb or w/e.\n\nEdited November 2, 2014 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126195-ever-my-heart-rises-west-road-traveller/?do=findComment&comment=1319357","commentId":1319357,"userName":"OMZA","timestamp":1414914481,"content":"If you switch the active location, then you are not travelling. So, neither the travel effects of the location are activated nor the responses for travelling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126195-ever-my-heart-rises-west-road-traveller/?do=findComment&comment=1319366","commentId":1319366,"userName":"TragicTheBlathering","timestamp":1414916063,"content":"then why do the cards specifically say that the effects do not trigger? Doesn't that clause in the text imply that without the clause then they would trigger from a travel effect.. so implying that this is still traveling?\n\nEdited November 2, 2014 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126195-ever-my-heart-rises-west-road-traveller/?do=findComment&comment=1319608","commentId":1319608,"userName":"GrandSpleen","timestamp":1414946152,"content":"OMZA was talking about West Road Traveler.  It uses the word \"switch\" so you aren't considered to have \"traveled\" to that location, and cannot trigger the response on Ever My Heart Rises.\n\n \n\nStrider's Path, however, uses the word \"travel.\"  If you use this card, you can trigger EMHR.\n\n \n\nThror's Map is like West Road Traveler.  No use of the word travel, so you can't trigger EMHR.  "}]}