{"url":"https://community.fantasyflightgames.com/topic/126204-rating-dwarrowdelf-nightmare/","title":"Rating Dwarrowdelf Nightmare","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126204-rating-dwarrowdelf-nightmare/?do=findComment&comment=1319492","commentId":1319492,"userName":"jjenks476","timestamp":1414936030,"content":"The NM packs for this cycle have been fantastic in terms of revitalizing an already great set of quests.\n\n \n\nStarting off for pure thematic reasons the Redhorn Gate has always been a great adventure but the original version could be a little like strolling up a hill rather than a grueling trek through sleet and snow. The NM version adds a couple of key and frightening new enemies and brings in some more blizzard treacheries. First off the new artwork is amazing on the NM cards and you really feel like you are on a snowy mountain with Trolls from afar casting stones at you. The Frozen SIlverlode can really mess with players strategies by making it so players can not gain willpower through player card effects. Another card that can really sting is the treachery Carhadras the Cruel which puts all of the snow cards in the encounter discard pile back on top of the encounter deck then immediately forces you to reveal 1 or 2. This can have huge consequences as the worst cards in the game are snow cards meaning Freezing Cold, Blinding Blizzard and all those other awful treacheries come right back into play. \n\n \n\nOverall the intensity of this quest is seriously ratcheted up and overall is my favorite NM pack in this cycle. Best new card is the Wolfpelt Goblin both for his vicious artwork and his ability, which really adds new dimension to the traveling phase. \n\nFun value\n\nOriginal 3 out of 5 stars\n\nNM 5 out of 5\n\nDifficulty Value\n\nOriginal 2 out of 5 eyes of Sauron\n\nNM 4 out of 5\n\nEdited November 2, 2014 by jjenks476"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126204-rating-dwarrowdelf-nightmare/?do=findComment&comment=1324469","commentId":1324469,"userName":"player1922162","timestamp":1415284351,"content":"Nice. I'm thinking of getting the first two. Certainly not my favorite cycle but those first two I always liked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126204-rating-dwarrowdelf-nightmare/?do=findComment&comment=1324578","commentId":1324578,"userName":"Glaurung","timestamp":1415290618,"content":"Hmmm raiting for those quest can be very different… is depend from what site and prespective to look….\n\nThe Road to Rivendell looks pretty cool but for more then 1 player. For solo is maybe to easy. Watcher is different more players more easy… Red horn I didn try yet…."}]}