{"url":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/","title":"nightmare decks...?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1319652","commentId":1319652,"userName":"Trialus","timestamp":1414951548,"content":"Howdy all. I came late to the game, and have been working on catching up with all of the previous expansions and adventure packs. I am starting to get close to being caught up and have been considering delving into the nightmare decks. Before I do, I'd like to ask a few questions about them....\n\n1). How do they work? Are they completely stand alone or are they combined with some of the original cards?\n\n2). Do they tend to change the flavor or theme of the adventure or just add difficulty?\n\n3). Finally... I am not a real power player. I play mostly single hand solo and tend to favor theme and interesting combos in decks (though I still enjoy winning and am not above using easy mode or throwing in some cards that don't perfectly adhere to a theme). Just for the added challenge the nightmare quests probably wouldn't be worth it for me, but they seem to contain great artwork and be very thematic. That said, would people recommend them based on those criteria?\n\nThank and I look forward to hearing peoples answers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1319712","commentId":1319712,"userName":"Chris51261","timestamp":1414956294,"content":"Hey! So Nightmare decks are what's kept this game rolling for me once I'd caught up playing through the expansions and new adventure packs, they're alot of fun and let you kind of take on the challenges of old scenarios with new twists. What they do is remove cards, a lot of times the tamer cards or ones that helped you, and replace them with more vicious versions, new cards, or ones with added nastiness. So they're not stand alone, they just augment the old quest. For your second question, I do actually think they add to theme. For example, Nightmare Escape from Dol Guldur feels a lot darker and adds more dungeon locations. It feels like you're desperately searching for your captured comrade before he's executed or something, very cool. All that being said, these are very tough scenarios. While I think some of them you can still do with thematics in mind, some of them require tight deckbuilding. I would say try one out, and if you like it, buy more! A good one to start out with is Nightmare Journey down the Anduin. Gives you a good feel of Nightmare. Nightmare Khazad Dum is also a good option, it makes those quests more interesting and is only $20 for 3 fairly varied challenges. Anyway, hope that helps.\n\nEdited November 2, 2014 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1319822","commentId":1319822,"userName":"chuckles","timestamp":1414963161,"content":"> 2). Do they tend to change the flavor or theme of the adventure or just add difficulty?\n> \n>  \n\nI think the best ones do both.\n\n \n\nRecently played through the nightmare version of \"The hills of Emyn Muil\". The changes made to quest a made it lot more fun for me to play. In stark contrast to the the original version which I found insanely boring! \n\n \n\nRemoving most copies of some very familiar encounter cards; Chieftan Ufthak, Dol Guldur Beastmaster, Dol Guldur Orcs, The Necromancer's Reach, Necromancer's Pass, Enchanted Stream, Evil Storm & Pursued by Shadow was refreshing and the two new enemies; Tunneling Nameless Thing & Orc Interceptor synergise much better with the encounter deck/quest.  \n\n \n\nThe nightmare version isn't overly hard, not with the current player card pool, but because I found the changes enjoyable I would happily play it again.\n\nEdited November 2, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1319962","commentId":1319962,"userName":"Trialus","timestamp":1414974626,"content":"Thank you guys for the explanations and advice. I'm sure it sounds a bit weird, but since NM mode replaces some of the more forgiving cards, would it be possible to combine easy mode and NM mode to get the changes offered by the NM deck while somewhat mitigating the increase in difficulty?\n\nThanks again for the input!!\n\nPS can anyone tell me what card my forum avatar is from?\n\nEdited November 3, 2014 by Trialus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1319985","commentId":1319985,"userName":"Chris51261","timestamp":1414977403,"content":"Combining easy mode and Nightmare mode might be sort of possible to an extent, and it might alleviate a little bit of the challenge, but my gut tells me it'd still probably be tough, since you'd be making the encounter deck smaller and increasing your chances of Nightmare cards popping up, which are by an large worse than the cards you remove for easy mode. I don't know though, I've never tried. And your avatar is from Ranger of Ithilien from The Massing at Osgiliath."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126216-nightmare-decks/?do=findComment&comment=1320034","commentId":1320034,"userName":"Trialus","timestamp":1414980462,"content":"Cool...thanks man"}]}