{"url":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/","title":"[Official Answer] Secret Entrance","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/?do=findComment&comment=1321490","commentId":1321490,"userName":"MightyRauros","timestamp":1415062520,"content":"Secret Entrance has a great benefit if you fail to travel there: you now know what shadow card Smaug will be dealt next!\n\n \n\nWhile Secret Entrance is the active location, The Lonely Mountain's [Threat] is reduced by half (round up).\nTravel: The first player must exhaust a hero and name a card type to travel here. Then, reveal the top card of the encounter deck. If the revealed card is not the named type, return Secret Entrance to the staging area. (The players cannot travel again this round.)  \n\n \n\nOr so I thought. Then I noticed it said \"reveal.\" The consensus I found online was that the card had to be added to the staging area. Now this went from a great card to a brutal one. You're triggering a treachery or adding threat to the staging area, in the hopes of decreasing threat, and you don't get to know what is coming next. \n\n \n\nJust to be safe, I decided to ask the team:\n\n \n\nI'm playing through \"The Lonely Mountain.\" Is the intention of Secret Entrance (card 65) to add a card to the staging area or simply to see the top card of the encounter deck? Thanks!\n\n \n\nAnd Caleb answered:\n\n \n\nSecret Entrance should read: “Look at the top card of the encounter deck. If the looked at card…” There is no need to actually reveal and resolve the top card of the encounter deck when traveling to the Secret Entrance. Thanks for asking.\n\nHope you’re enjoying the On the Doorstep box!\nCheers,\nCaleb\n\n \n\nSecret Entrance's status as a fantastic location is back!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/?do=findComment&comment=1321558","commentId":1321558,"userName":"GrandSpleen","timestamp":1415067721,"content":"Wow, I always just revealed it as instructed.  I figured it was a fair tradeoff: potentially very strong effect from Secret Entrance, with the risk of adding more threat to the staging area, or triggering a nasty treachery.  This makes it a much more forgiving card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/?do=findComment&comment=1321720","commentId":1321720,"userName":"faith_star83","timestamp":1415090121,"content":"Given that in the newest version of the FAQ they explicitly explain that \"to reveal\" always means revealing and adding an encounter to the staging or area (or resolving it if it is a treachery) you would think they'd be more careful with the terminology on such cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/?do=findComment&comment=1322761","commentId":1322761,"userName":"Mndela","timestamp":1415143433,"content":"Sure, i always have played the 'hard' version. So finally, i never travelled to here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126341-official-answer-secret-entrance/?do=findComment&comment=1322961","commentId":1322961,"userName":"GrandSpleen","timestamp":1415158053,"content":"Yeah, I think I've only traveled there maybe one time.  And failed to travel there several :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}