{"url":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/","title":"Ithilien Pit","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324293","commentId":1324293,"userName":"Nerdmeister","timestamp":1415262039,"content":"ffg_ithilien-pit-eaad.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_ithilien-pit-eaad.jpg]\n\n \n\nYou can attack enemy in the staging area.\n\nYou can attack enemy if he is engaged with another player.\n\nJust wondering if you can attack an enemy, which has been moved to an out-of-play area by Saruman´s effect?\n\nEdited November 6, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324319","commentId":1324319,"userName":"PsychoRocka","timestamp":1415265124,"content":"Hmmmmmmmmmmmm thats a hard one but pretty sure no because both Ithilien Pit and the Enemy are out of play. \n\nThis means they can't be targeted by cards that do x to an enemy \"in play\" or \"in the staging area\" or \"engaged with a player\" so I assume they also can't be attacked. Might have to ask for a ruling on this one but pretty sure it will be no."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324322","commentId":1324322,"userName":"Nerdmeister","timestamp":1415265675,"content":"Though there has already been a ruling, which states that a card added to the victory display can still interact with the game mechanics.\n\nThe relevant ruling pertains to Caradhras location from Redhorn Gate, which could be removed by placing progress while it is still in the staging area. A quest effect triggered later in the scenario, which places it as the active location would then fetch it back from the victory display.\n\n \n\nAlso the phrases \"in play\", \"in the staging area\" or \"engaged with a player\" doesn´t appear on the card.\n\nEdited November 6, 2014 by Nerdmeister"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324326","commentId":1324326,"userName":"PsychoRocka","timestamp":1415266297,"content":"Yeah but the victory display is an area in play, just one you rarely interact with.\n\nI don't think that being able to interact with the victory display (which is almost a bit like a third discard pile in a way) means you can interact with cards that are \"out of play\".\n\nI only brought those phrases up as you would not be able to target that out of play enemy with any cards that use any of that phrasing so I really don't think you'd be able to attack it either.\n\n \n\nEdit: Also this would be too powerful, removing their threat, any abilities they have, stopping their attack for the turn AND you can attack back and kill them before they are returned to play? Seems far too good.\n\nEdited November 6, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324332","commentId":1324332,"userName":"alogos","timestamp":1415267123,"content":"We already asked it (French are very curious people) :\n\n \n\n>  \n> \n> Saruman’s ability causes the chosen enemy or location to be “considered to be out of play.” It does not actually leaves play, and therefore does not re-enter play. It simply no longer contributes its threat and effects to the game state. In the case of a location, you cannot travel to that location or place progress on it because it is not a legal target while it is considered to be out of play. In the case of an enemy, it does not make engagement checks and cannot be engaged or make attacks. Any cards attached to the target location or enemy remain attached (because it has not actually left play) but they would also be considered to be out of play because the card they are attached to is considered out of play. The same is true for guarded objectives: they remain attached to the enemy/location and are considered to be out of play as well. I will make a note to add that little bit to the FAQ.\n\n \n\nBolded revelant sentence. (and made it bigger... bold isn't really visible)\n\nEdited November 6, 2014 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324336","commentId":1324336,"userName":"PsychoRocka","timestamp":1415267470,"content":"So because Ithilien Pit is also \"out of play\" and does not contribute its effects to the game state, the enemy can no longer have attacks declared against it by any player from Ithilien Pit's effect :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1324373","commentId":1324373,"userName":"Nerdmeister","timestamp":1415272501,"content":"Seems so. Not because the enemy is out-of-play and inactive but because the attachment is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1754929","commentId":1754929,"userName":"Mndela","timestamp":1440529180,"content":"One question i have just thought:\n\nCan more than 1 player join their character's attack despite they are not ranged -to an enemy with Ithiien Pit attached, of course-?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=1756030","commentId":1756030,"userName":"Chris51261","timestamp":1440564405,"content":"No, it doesn't lift the way attacks are declared, so player 1 can attack it, and player 2 could send ranged characrers to help, and then player 2 can attack it again if be so chooses and player 1 could use his ranged characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2368597","commentId":2368597,"userName":"staurasi","timestamp":1471367512,"content":"Sorry, I still cannot understand how it works. At least not in the case where the enemy is engaged with a player.\n\n \n\nIf the enemy is engaged with player 1, and player 1 declares an attack, player 2 can participate with ranged characters because player 2 joins an attack declared by another player (ok till now).\n\nThen player 2 can declare an attack..\n\n1) with or without a ranged character?\n\n2) Player 1 can participate with only ranged characters? I would say yes, because he also participates to an attack declared by another player. But it seems odd that player 1 must use a ranged character to attack an enemy engaged with him.\n\nEdited August 16, 2016 by staurasi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2368951","commentId":2368951,"userName":"Slothgodfather","timestamp":1471374926,"content":"I actually thought that the trap let you ignore not just where the enemy was (staging area or engaged with someone else) but also ignored the need for ranged.  \n\n \n\nSince \"any character may choose attached enemy as the target of an attack\" - doesn't that negate the need to have ranged?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2369136","commentId":2369136,"userName":"Teamjimby","timestamp":1471379615,"content":"Attacks are declared per player (with any number of characters that player controls).  Ranged is the exception to the rule because it lets you participate in other players' attacks.  The same thing is true for boss enemies that are engaged with multiple players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2371394","commentId":2371394,"userName":"Slothgodfather","timestamp":1471468550,"content":"So say the trapped enemy is engaged with my friend and I am first player.  Since the trap is on enemy, I can choose to have my characters (regardless of the ranged keyword) attack that enemy.  This is during my attack, so then my friend would be unable to commit anyone to that attack, correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2371414","commentId":2371414,"userName":"Emilius","timestamp":1471469190,"content":"> So say the trapped enemy is engaged with my friend and I am first player.  Since the trap is on enemy, I can choose to have my characters (regardless of the ranged keyword) attack that enemy.  This is during my attack, so then my friend would be unable to commit anyone to that attack, correct?\n\nCorrect!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2371817","commentId":2371817,"userName":"sappidus","timestamp":1471487610,"content":"> So say the trapped enemy is engaged with my friend and I am first player. Since the trap is on enemy, I can choose to have my characters (regardless of the ranged keyword) attack that enemy. This is during my attack, so then my friend would be unable to commit anyone to that attack, correct?\n\nWell, your friend's Ranged characters could join in. Then, if they could ready somehow (or, in the case of a Trollshaw Scout or Hour of Wrath/Path of Need shenanigans, never exhaust in the first place), those same characters could attack the enemy again during his own attack declarations.\n\nEdited August 18, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2372009","commentId":2372009,"userName":"Emilius","timestamp":1471500242,"content":"FAQ:\n\nQ: What counts as a “ranged” attack?\n\nA: A ranged attack is an attack made by a character with the ranged keyword against an enemy engaged WITH ANOTHER PLAYER."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2372144","commentId":2372144,"userName":"staurasi","timestamp":1471513569,"content":"> FAQ:\n> \n> Q: What counts as a “ranged” attack?\n> \n> A: A ranged attack is an attack made by a character with the ranged keyword against an enemy engaged WITH ANOTHER PLAYER.\n\nLet's keep apart Ithilien Pit for the moment, we are talking about ranged keyword and ranged attack in general.\n\nI was a bit confused too about ranged attacks and thanks to Emilius I reread faqs and core rules about that.\n\n \n\nWe mainly use ranged characters to participate to normal attacks declared by others player. That's because this way you maximize the damage on the enemy. So I never put enough attention to the case where someone declares a ranged attack.\n\nBut if player 1 declares a ranged attack to an enemy engaged with player 2, player 2 cannot join the attack in any way.\n\nYou can say that core rules says:\n\n> ... or it can participate in attacks that are declared by other players\n> \n>  \n\nthat's true, but before saying that it clearly states:\n\n> A character with the ranged keyword can be declared by its controller as an attacker against enemies that are engaged with other players\n> \n>  \n\nAnd then:\n\n> A character can declare ranged attacks against these targets while its owner is declaring attacks, or it can participate in attacks that are declared by other players.\n> \n>  \n\nSo, it's not clearly stated, but I see no way for player 2 to participate to a ranged attack declared by player 1 to an enemy engaged with him.\n\n \n\nWith 3 players:\n\nPlayer 1 declares a ranged attach against an enemy engaged with player 2.\n\nPlayer 2 cannot participate.\n\nPlayer 3 can join the attack declared by player one with ranged characters.\n\nEdited August 18, 2016 by staurasi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2372204","commentId":2372204,"userName":"rmunn","timestamp":1471519168,"content":"> So, it's not clearly stated, but I see no way for player 2 to participate to a ranged attack declared by player 1 to an enemy engaged with him.\n> \n>  \n> \n>  \n> \n> With 3 players:\n> \n> Player 1 declares a ranged attach against an enemy engaged with player 2.\n> \n> Player 2 cannot participate.\n> \n> Player 3 can join the attack declared by player one with ranged characters.\n\n \n\nI have a vague memory of having some debate over this wording at some time in the past, and disagreeing with the position you state here. Specifically, note that the \"it can participate in attacks that are declared by other players\" line does not state any limits about who that attack can be against. (The words \"these targets\" are not repeated in that clause, nor are they implied by the sentence structure). If I'm player 2, and player 1 uses Bard to declare an attack against one of my engaged enemies, that is an attack that has been declared by another player. Therefore, my Legolas can participate in that attack.\n\n \n\nHowever, the rules-as-written about Ranged are unclear enough that I decided to play by my own house rules regarding Ranged:\n\n \n\n1) I changed the definition of a Ranged attack to be \"any attack by a character with Ranged against an enemy not engaged with that character's controller\", rather than \"an enemy engaged with another player\". The Ranged keyword does not in itself grant the ability to attack the staging area, but if you do have the ability to attack the staging area via some other method (like Hands Upon the Bow), I felt that that attack should be considered a Ranged attack. (But only if the character already has Ranged: Théodred's ability does not count as Ranged).\n\n \n\n2) I changed the wording of the \"characters with Ranged can join in other players' attacks\" to be: \"Characters with Ranged may declare attacks against enemies controlled by other players. When they do so, any character who would be eligible to join in an attack declared by the engaged player may join in this attack.\" This expands the rules to allow participation by melee characters engaged with that player, as well as Ranged characters, which might be overpowered; I haven't had much chance to test this. But it's the only way I can find to make the rules consistent. Otherwise, you could get the following situation that doesn't make any intuitive sense:\n\n \n\nPlayer A controls Gimli, player B controls Legolas. An orc is engaged with player A.\n\n \n\n1) On player A's turn, he could attack that orc with Gimli, and Legolas could participate. If he chooses not to do so...\n\n2) On player B's turn, he could attack that same orc with Legolas, but Gimli could not participate -- even though Gimli is entirely eligible to attack that orc normally.\n\n \n\nThis asymmetry is unintuitive and makes the attacking rules harder to understand. Instead, by saying \"anyone who would be eligible to attack that orc normally can also participate in an attack declared by someone else\", you get:\n\n \n\n1) On player A's turn, he could attack that orc with Gimli, and Legolas could participate. If he chooses not to do so...\n\n2) On player B's turn, he could attack that same orc with Legolas, and Gimli could participate.\n\n \n\nThis provides symmetry: whether the attack is declared by A or B, the same characters are eligible to attack the orc. Gimli is eligible because he's right next to it, and Legolas is eligible because he has a bow and can reach it from far away.\n\n \nSo with my house rules, your 3-player situation would become:\n \nPlayer 1 declares a ranged attack against an enemy engaged with player 2.\nPlayer 2 can participate with any of his readied characters, whether they are melee or Ranged. (They must still exhaust to participate, and follow all other rules as normal). Note that if player 2 uses a Ranged character to participate in this attack, his attack is NOT considered Ranged, because the enemy is engaged with player 2. (The orc is too close, so Bard has to drop his bow and pull out his sword so the orc doesn't skewer him while he's lining up the shot. Bard isn't as well trained with a sword as with a bow, so he doesn't get his \"-2 to enemy's defense\" bonus this time.)\nPlayer 3 can participate with any of his Ranged characters, but not his melee characters. (They must still exhaust to participate, and follow all other rules as normal). These characters, when they participate, ARE engaging in a Ranged attack, so any bonuses (or penalties) to Ranged attacks will apply to them.\n \nThis makes far more intuitive sense out of the Ranged keyword, and IMHO the Ranged rules should be errata'd to read something like this.\nEdited August 18, 2016 by rmunn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126499-ithilien-pit/?do=findComment&comment=2372553","commentId":2372553,"userName":"staurasi","timestamp":1471532118,"content":"> I have a vague memory of having some debate over this wording at some time in the past, and disagreeing with the position you state here. Specifically, note that the \"it can participate in attacks that are declared by other players\" line does not state any limits about who that attack can be against. (The words \"these targets\" are not repeated in that clause, nor are they implied by the sentence structure). If I'm player 2, and player 1 uses Bard to declare an attack against one of my engaged enemies, that is an attack that has been declared by another player. Therefore, my Legolas can participate in that attack.\n> \n>  \n\n \n\nWell, I'm not a native english speaker so I can't be sure about sentence structures and clauses. I think you can ask the developers if in doubt.\n\n \n\nThere already have been some discussions about this matter.\n\nhttps://community.fantasyflightgames.com/topic/120958-two-player-attacking/#entry1247288 [https://community.fantasyflightgames.com/topic/120958-two-player-attacking/#entry1247288]\n\nhttps://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/#entry904795 [https://community.fantasyflightgames.com/topic/93221-participating-in-attack-ranged-attack-oh-no-not-again/#entry904795]\n\nboth links point to the relevant post inside the discussion.\n\n \n\nI like your house rules and I find them more thematic and intuitive but I don't think the developers will consider them for a few reasons I'll explain, but you can try to ask them.\n\nHas I can see, but this is simply my opinion, developers tend to contain ranged attacks and attacks to the same enemy (one attack declared per enemy per player, enemies immune to ranged damage, no ranged attacks in staging area etc..).\n\nDo not forget that players already have one opportunity to maximize the number of characters committed for one attack, in our example is during player 2 attack turn.\n\nRanged characters with some readying effect would be really overpowered otherwise."}]}