{"url":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/","title":"New, solo player - Got the core set. What next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/?do=findComment&comment=1325074","commentId":1325074,"userName":"BenStark","timestamp":1415311394,"content":"Hi folks,\n\n \n\nI picked up the LotR LCG core set on a whim at B&N for like $10.  My wife and I tried to figure it out but since she hates card games, she wasn't too thrilled with it; and I don't have any friends in the area who enjoy LotR or co-op games, so it's just me.\n\n \n\nI've played through the three scenarios in the core set box.  I beat the first one by the skin of my teeth, and lost the other two thoroughly.  But I enjoyed it.  I was wondering where I should go from here?  I think my next purchase should be Khazad-dum since I like Dwarves, but I'm not sure.\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/?do=findComment&comment=1325094","commentId":1325094,"userName":"MyNeighbourTrololo","timestamp":1415312283,"content":"Just everything in order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/?do=findComment&comment=1325139","commentId":1325139,"userName":"Glaurung","timestamp":1415315252,"content":"Yes you should go and buy everything in order. First Shadow of Mirkwood cycle, Khazad-Dum and so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/?do=findComment&comment=1325140","commentId":1325140,"userName":"chiller087","timestamp":1415315259,"content":"TL;DR version:  In my opinion, find a way to flesh out your core set with the missing cards (either a new core set or look on ebay for the extras...personally I recommend going the ebay route for extras).  Grab Khazad-dum, then start building your Dwarrowdelf and Mirkwood cycles, then go from there.\n\n \n\n \n\nLong version:\n\n \n\nYou could look online and find someone who's selling all the \"missing\" cards from the core set, and buy those.  That way you'll still have a full playset of everything without all the extra stuff you don't need.  (Make sure they sell you at least 2 copies of Gandalf as well so you'll have 6, which is enough for 2 decks.)\n\n \n\nOr, picking up a 2nd core set would be another option if the first option doesn't pan out. You won't have a \"full\" playset because you'll be lacking a 3rd copy of cards like Horn of Gondor and Unexpected Courage, but most of those particular cards will do fine with just 2 copies in your deck.  But buying a 2nd core will also give you another full set of encounter card decks (which you won't need), another full set of core heroes (which you won't need) and another full set of tokens (which you may need).\n\n \n\nKhazad-dum is definitely worth picking up.  The Dwarrowdelf cycle will flesh out most of your dwarves and give you Elrond, Spirit Glorfindel (everyone uses him), Light of Valinor, Elrond's Council, Arwen Undomiel (also very popular), and a bunch of other cool cards. \n\n \n\nThe Mirkwood cycle will give you all the Eagles (except Gwaihir, he's new) as well as a lot of staple cards for many decks. The Sylvan allies you get in the core and Mirkwood won't be all that wonderful until you grab the Voice of Isengard box and start buying into the Ringmaker cycle (LOTS of sylvan love there).  The quests in this cycle aren't known for being all that difficult or exciting (although with a limited card pool, they will pose more of a challenge).  The Hills of Emyn Muil is probably the most boring until you try the Nightmare version.  Conflict at the Carrock and Journey Along the Anduin are probably the most engaging.\n\n \n\nThe Against the Shadow cycle (and the Heirs of Numenor box) focused heavily on Gondor-themed cards.  Beregond + Gondorian Shield makes for a great defender; slap Unexpected Courage on him to make him a star.  This cycle also gives you the Outlands deck that everyone loves to hate (since it makes most quests a snap to finish).  The real draw of this cycle, imo, are the quests.  They are much more interesting and engaging, and a full-blown story is woven into them, starting from the Heirs of Numenor box all the way to The Morgul Vale, the last adventure pack in that cycle.  Also: Most can be quite difficult.  Into Ithilien can be really brutal.\n\n \n\nAnd don't forget both Hobbit expansions, which further builds the dwarven card pool and gives you Hobbit Heroes.  The Black Riders and The Road Darkens saga expansions are FFG's attempt to actually put you in a scenario that resembles the actual story, instead of all the other quests, which basically amount to a bunch of \"What if?\" situations, but are not technically part of the story.\n\nEdited November 6, 2014 by chiller087"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126556-new-solo-player-got-the-core-set-what-next/?do=findComment&comment=1325174","commentId":1325174,"userName":"chuckles","timestamp":1415317174,"content":"> Hi folks,\n> \n>  \n> \n> I picked up the LotR LCG core set on a whim at B&N for like $10.  My wife and I tried to figure it out but since she hates card games, she wasn't too thrilled with it; and I don't have any friends in the area who enjoy LotR or co-op games, so it's just me.\n> \n>  \n> \n> I've played through the three scenarios in the core set box.  I beat the first one by the skin of my teeth, and lost the other two thoroughly.  But I enjoyed it.  I was wondering where I should go from here?  I think my next purchase should be Khazad-dum since I like Dwarves, but I'm not sure.\n> \n>  \n> \n> Thoughts?\n\nI agree with trololo with about buying things in order... if you can find them as i'm not sure that they are all currently available.\n\n \n\nThe trouble with skipping Mirkwood and jumping straight to Khazad-dum is the increasing difficulty level vs your limited card pool... though Khazad-dum might be possible? Jumping to say Heirs or later Deluxe boxes wouldn't be. \n\n \n\nThere are numerous members in this forum who have have great blog sites who have posted articles about this subject... check peoples signatures.\n\n \n\nWhen I first started playing I personally found these two blogs really helpful (sorry to all the other amazing blogs out there) \n\n * http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/  [http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/%C2%A0]\n * http://hallofbeorn.wordpress.com/beorns-path/ [http://hallofbeorn.wordpress.com/beorns-path/]\n\nI really wish we could sticky a list of blogs and video play though sites... \n\nEdited November 6, 2014 by chuckles"}]}