{"url":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/","title":"Storage Solutions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325021","commentId":1325021,"userName":"Rainelotr","timestamp":1415308829,"content":"The amount of cards in this game have gotten to be simply ridiculous. Right now my enjoyment of this game is severely hampered by the fact that I can't ever find anything reliably and it takes half as much time to get things set up as it actually does to play. The player cards are bad enough but I find the huge amount of quests are the real problem as they actually do require a certain amount of organization to utilize. \n\n \n\nI mean really now. I recently misplaced a new quest in my latest saga expansion and it took literally 3 hours to find it, over the course of 2 days while I reorganized the entire set and the problem is even after having organized it it's still NOT REALLY very organized. \n\n \n\nAny chance of FFG releasing some sort of manageable and upgradable storage solution? Is one already out there? Is there a commonly used solution for people who have everything? \n\n \n\nWhat does everyone else do? Are there threads that have gone on before this that you can direct me to? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325060","commentId":1325060,"userName":"Chris51261","timestamp":1415310575,"content":"I got a bunch of these:\n\n \n\nhttp://www.amazon.com/gp/product/B0002TT3LG/ref=pd_lpo_sbs_dp_ss_1?pf_rd_p=1944579842&pf_rd_s=lpo-top-stripe-1&pf_rd_t=201&pf_rd_i=B0002TT3L6&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=02F532WYRRQYNWWSHC2X [http://www.amazon.com/gp/product/B0002TT3LG/ref=pd_lpo_sbs_dp_ss_1?pf_rd_p=1944579842&pf_rd_s=lpo-top-stripe-1&pf_rd_t=201&pf_rd_i=B0002TT3L6&pf_rd_m=ATVPDKIKX0DER&pf_rd_r=02F532WYRRQYNWWSHC2X]\n\n \n\nI sorted everything out and labeled them, like Leadership cards, Lore cards, etc. Each cycle usually gets it's own case, and I usually will pick up one of the smaller cases for the deluxe and saga expansions. Nightmare decks and stuff can all fit in one. It keeps them very orderly. If I want to play like the the Hunt for Gollum, I know it's on the top of my Shadows of Mirkwood box, and that I need some sets out of my core set box. I know some people have super fancy cases and stuff but I just keep all those in the core set cardboard box, and usually leave my player cards on the shelf unless I'm deckbuilding. It works for me, but I feel your pain as more and more cards come out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325155","commentId":1325155,"userName":"chiller087","timestamp":1415315967,"content":"I use Longboxes right now.  My player cards are in two serperate longboxes (Tactics/Spirit and Leadership/Lore) and my encounter cards are in an even bigger 3-row long box that is almost chock full.  My quest cards are in clear sleeves and the encounter cards are all in black, and I just line them up in the respective cycle groups, in adventure pack order.\n\n \n\nBut man, it's a heavy quest box to be carrying around.  I tend to leave it in my car and only bring it into the game shop when we want to try a few quests.  And since I've got every expansion out there, and it's all sleeved, I'm running out of room.  I just \"nightmared\" all my core+mirkwood encounter decks (since I have no desire to play these quests \"normally\" anymore) and so now there's even less room.\n\n \n\nI'm looking for something more \"all-in-one-ish\" but until I do it's long boxes for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325194","commentId":1325194,"userName":"Bullroarer Took","timestamp":1415318605,"content":"I have five 2\" binders for the different spheres.  The encounter cards are kept in their original boxes in a chest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325206","commentId":1325206,"userName":"chrsjxn","timestamp":1415319442,"content":"I'm using these for LCGs: http://www.amazon.com/gp/product/B008J2IQ34/ref=oh_aui_detailpage_o01_s02?ie=UTF8&psc=1 [http://www.amazon.com/gp/product/B008J2IQ34/ref=oh_aui_detailpage_o01_s02?ie=UTF8&psc=1]\n\n \n\nCards fit laying down horizontally in the bins, or standing up (depending on if you've sleeved them, or how tall the sleeves are). And they lock and are reasonably water tight, so I'm not worried about moving them around or leaving them stored somewhere.\n\n \n\nUnfortunately, my LOTR cards are in fat sleeves, and just spilled over into a 3rd one. But I have all of netrunner right now in a single box, with space to grow (since I store those without sleeves)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325746","commentId":1325746,"userName":"Rainelotr","timestamp":1415370061,"content":"I've been playing this since it came out and did not save my individual boxes because it wasn't an effective storage solution until now when there are so many, a one box solution is difficult. Even with the bulk I'm still looking for that one location for all my adventure packs and quests. \n\n \n\nRunning through the archives and look at this. He knew what he was doing for sure! \n\n \n\nA Custom Made Case [http://http//community.fantasyflightgames.com/index.php?/topic/95568-my-solution-for-lotr-cards-storage/]\n\n \n\nI like your idea chrsjxn, but it certainly isn't elegant (sorry) and with the sheer size we'd probably be looking at 3 or so like you said. If I'm going to spend $90 on storage then I'd just as soon start working on something custom to be honest. At least then it'd look aesthetically pleasing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325850","commentId":1325850,"userName":"shoreless","timestamp":1415375404,"content":"I keep a four-inch binder with all my player cards sorted by sphere/release order, then all the quests are in my core box with one of the inserts from Go7 [http://go7gaming.com/product-category/game-inserts/] -- but it's almost full!\n\n \n\nAs @BirdExplorer says, 'How did it come to this [https://www.youtube.com/watch?v=xdBcsdk8pEY]?'"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325901","commentId":1325901,"userName":"Teamjimby","timestamp":1415378268,"content":"For people that use binders, are you able to fit 3 copies of the cards in a single slot?  What about sleeves?  Do you remove them to store in the binder and put them back on when you make a deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1325954","commentId":1325954,"userName":"faith_star83","timestamp":1415380674,"content":"> For people that use binders, are you able to fit 3 copies of the cards in a single slot?  What about sleeves?  Do you remove them to store in the binder and put them back on when you make a deck?\n\n \n\nI keep all my player cards unsleeved in binders, and sleeve them when I include them in a deck. Although I have to admit that the un/-sleeving is a bit of work, for me personally this is the best solution. The Encounter cards I keep in the respective packs / deluxe boxes..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1326367","commentId":1326367,"userName":"soullos","timestamp":1415406754,"content":"> For people that use binders, are you able to fit 3 copies of the cards in a single slot?  What about sleeves?  Do you remove them to store in the binder and put them back on when you make a deck?\n\n \n\nI keep them in the sleeves and can only fit 2 sleeved cards per slot. You \"can\" 3 sleeved cards per slot, but I fear it will bulge too much and maybe damage the cards. Better safe than sorry. I use FFG clear sleeves and Premium PRO-Binders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1329275","commentId":1329275,"userName":"TwiceBorn","timestamp":1415641098,"content":"> For people that use binders, are you able to fit 3 copies of the cards in a single slot?  What about sleeves?  Do you remove them to store in the binder and put them back on when you make a deck?\n\n \n\nYes, I sometimes place 3+ copies of cards unsleeved in a single slot (I've had as many as 5 for encounter cards like \"Sacked!\" from Conflict at the Carrock). They fit without problems. Haven't noticed any damage or warping to cards yet… but as soullos said, if you're worried about potential damage to cards, then you're always free to limit how many cards to slide into a single slot. \n\n \n\nAnd yes, I currently re-sleeve cards when building decks… which is why I try to run a particular deck or set of decks through a series of quests before switching to another set of decks.\n\nEdited November 10, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126553-storage-solutions/?do=findComment&comment=1329302","commentId":1329302,"userName":"Olorin93","timestamp":1415642552,"content":"Topics like these appear from time to time. There is no wrong way of storing cards; just a matter of what you find most convenient. Many sort player cards by sphere, some keep them in binders and so on.\n\n \n\nHere's my solution. Eventually, the core box just couldn't hold it all. It's not particularly beautiful, but works fine.\n\nhttp://s688.photobucket.com/user/BeaverGuy93/media/Foto2014-10-22190350_zps03124e6e.jpg.html [http://s688.photobucket.com/user/BeaverGuy93/media/Foto2014-10-22190350_zps03124e6e.jpg.html]\n\nEdited November 10, 2014 by Olorin93"}]}