{"url":"https://community.fantasyflightgames.com/topic/126693-new-player-future/","title":"New Player - Future ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1327484","commentId":1327484,"userName":"Deepspace5","timestamp":1415505648,"content":"Greetings!\n\n \n\nI just stumbled into this game the other day... I knew it existed but never knew it was a 1-2 player co-op game!\n\n \n\nEssentially this game's core set is going on my Christmas Wish List this year...  What, if anything should I include in that list as far as expansions go?\n\n \n\nWhere do I start?\n\n \n\nI've poked around and searched a little bit, but I didn't really find anything for a brand new player.  Is there some type of step by step guide to get started in the game?  My intent being playing will mainly be to play with the wife in a very casual manner...but having options for deck building is always a plus.\n\n \n\nDo I get everything very slowly in order or can I be content with just the core set?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1327490","commentId":1327490,"userName":"Teamjimby","timestamp":1415506141,"content":"You should definitely start here: http://talesfromthecards.wordpress.com/new-player-guides/ [http://talesfromthecards.wordpress.com/new-player-guides/]\n\n \n\nUnless you are sure you will like the game, I'd recommend just getting a core set and playing the first quest a few times.  Then if you like it you can start getting expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1327499","commentId":1327499,"userName":"Deepspace5","timestamp":1415506562,"content":"Thank you!  Some of the other guides I was finding were broken links.  This one works!\n\n \n\nI'll definitely just put the core set down...see how big of a hit it is and go from there.  I am, after all, trying to keep up with the X-Wing hobby."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1327750","commentId":1327750,"userName":"shoreless","timestamp":1415537092,"content":"Welcome to the game, and great user name!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1328057","commentId":1328057,"userName":"TwiceBorn","timestamp":1415559317,"content":"After I played the first two scenarios in the Core set a few times, I was hooked and went and bought the 6 adventure packs in the Mirkwood Cycle a few days later. Most players struggle with the Escape from Dol Guldur set in the Core set, and that quest might unfortunately leave a bad taste in your mouth (it can be beaten using Core set cards only, but is extremely difficult -- especially for a solo player -- and luck dependent).\n\n \n\nI think picking up adventure packs/expansions in the order that they were released gives you a gradual intro to the game, and it has been very satisfying for me. Getting an additional quest cycle (or maybe the first few adventure packs in a cycle) with the Core set will give you a greater range of quests on which to form an opinion of the game (Core + Mirkwood has already made this my favourite game, bar none… and from what I understand, the game only gets better from there!).\n\n \n\nThe other reason to suggest going with the Mirkwood Cycle instead of another cycle is that Mirkwood requires only Core to play (and not getting another deluxe expansion first, as all the other cycles require).\n\n \n\nAs others have said, welcome to the game… I hope you enjoy it as much as I do! \n\nEdited November 9, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1332417","commentId":1332417,"userName":"BenStark","timestamp":1415832109,"content":"I've found this thread very helpful as a new player myself.  Thanks for the info folks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126693-new-player-future/?do=findComment&comment=1332438","commentId":1332438,"userName":"Bullroarer Took","timestamp":1415833157,"content":"Do not try the core set adventures using solo tactics unless you really like losing."}]}