{"url":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/","title":"Quick Question - Followed By Night","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1329913","commentId":1329913,"userName":"legolas18","timestamp":1415668095,"content":"So, this card says:\n\n\"The first player (choose 1): deals 1 damage to all allies in play and Followed By Night gains surge, or all enemies engaged with players make an immediate attack, if able.\"\n\nCan I choose the second even if there are no enemies engaged? If so, then great. But if not, then I'll lose. I thought that I couldn't choose it without being able to fulfill it, but just wanted to clarify."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1330017","commentId":1330017,"userName":"GrandSpleen","timestamp":1415675245,"content":"I think you can choose the second since the card allows a choice-- it doesn't use the wording \"must either.. or...\" or something like that.  All that choosing stuff is hard for me to remember how to play correctly, so I usually just follow the card as literally as I can.  In this case you'd be able to make a choice regardless of the game state.\n\n \n\nThe second option does say \"if able,\" after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1330355","commentId":1330355,"userName":"Chris51261","timestamp":1415709720,"content":"I asked Caleb about this a while back to prove boooored wrong. Here's what he said:\n\nWhen resolving any When Revealed effect that gives you a choice between two effects, you must choose an effect that you can fully resolve. Followed by Night is an odd example because you can always resolve either effect. That’s because it targets either ‘all allies’ or ‘all enemies’ and the word ‘all’ can include 0.\n\nSo you can pick the harmless option, you played it right. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1331302","commentId":1331302,"userName":"legolas18","timestamp":1415759089,"content":"Well great! That's one of the few times I've heard good news about the rules in this game! Thanks to both of you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1702693","commentId":1702693,"userName":"Emilius","timestamp":1437740447,"content":"Hi guys,\n\nI need a confirmation please.\n\nSo with the card Followed by Night, can I always choose one of the 2 options?\n\nFor example, if I haven't allies can I choose the first option or if I haven't engaged enemies, can I choose the second option because \"all\" can be considered 0?\n\nAnd what happens with the encounter card \"Fallen Stones\":\n\nWhen Revealed: The first player (choose 1): removes all progress tokens from play, or reveals 2 cards from the encounter deck and adds them to the staging area.\n\nCan I choose the first option if I haven't progress tokens in play?\n\nThank you for anche answer\n\nEdited July 24, 2015 by Emilius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/?do=findComment&comment=1702798","commentId":1702798,"userName":"GrandSpleen","timestamp":1437746834,"content":"As I understand it, yes you can choose the \"0\" option in both of those cases.\n\n \n\nIf you want to play by the \"spirit\" of the card,you should choose an effect that would do something to the game state, but if you want to play to the \"letter of the law,\" you can choose the non-effect.  I tend to play by whichever ensures my absolute victory  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}