{"url":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/","title":"Campaign Mode?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/?do=findComment&comment=1331826","commentId":1331826,"userName":"WillisRBC","timestamp":1415806799,"content":"Hi all.  I have one base set of this game.  I'm wanting to get started playing it with my fiance and my 10 year old son.  I'm interested in the campaign mode, and was hoping someone could tell me about it.  All I can find is that it's in the black riders set.  Can you not do campaign mode without that set?  Like I said, we are just getting started, so any advice would be helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/?do=findComment&comment=1331859","commentId":1331859,"userName":"Ryodu","timestamp":1415808625,"content":"> Hi all.  I have one base set of this game.  I'm wanting to get started playing it with my fiance and my 10 year old son.  I'm interested in the campaign mode, and was hoping someone could tell me about it.  All I can find is that it's in the black riders set.  Can you not do campaign mode without that set?  Like I said, we are just getting started, so any advice would be helpful.\n\nRight now The Saga Expansions (Black Riders and The Road Darkens) are the only sets that have been released that allow for campaign play. There are also two stand alone quests that were released at Gen-Con and for the Fellowship Event (The Old Forest and Fog on the Barrow Downs respectively). These are the only quests that cater towards campaign mode.\n\n \n\nThere are some fans however that have tried to apply campaign mode to the other quests in the series. That thread, if I'm to assume it's the correct thread, can be found here:\n\n \n\n http://boardgamegeek.com/thread/1214867/tale-years-mega-campaign-mode-lotr-lcg [http://boardgamegeek.com/thread/1214867/tale-years-mega-campaign-mode-lotr-lcg]\n\n \n\nThat being said, I have not taken the plunge yet into campaign mode so my knowledge may be a little limited and I would wait to hear from others than myself who may be more familiar (at least with the fan made stuff).\n\nHope this helped!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/?do=findComment&comment=1331862","commentId":1331862,"userName":"WillisRBC","timestamp":1415808946,"content":"So with what I have, what would I need to be able to play fun games with my family and maybe a few friends?  Is 4 players the max?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/?do=findComment&comment=1331957","commentId":1331957,"userName":"Ryodu","timestamp":1415812813,"content":"I would most definitely say yes. I will admit that the core set does get repetitive after awhile (as there are only 3 quests) but I can imagine a 10 year old, especially if he loves LOTR, not noticing it. That being said, there is an awesome buying guide out there that helps you out. Details what you should buy if you want to have efficient decks or fun quests or fun heroes, etc.\n\n \n\nHere's the link: http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [http://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\n \n\n4 players is the max. I feel like I've heard some people talk of 5 or more player games but that is a house rule and could easily get out of hand.\n\n \n\nAlso, as you may have noticed already, the game can be quite challenging and so part of the fun/replay factor is trying a quest several times, sometimes with different decks, and trying to beat it finally or in the best way possible.\n\n \n\nTL:DR - Yes I would say that you could still have fun. Especially if your son LOVES lotr. The game can get repetitive though so check the above link for a buying guide that can help you. It's a great game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126975-campaign-mode/?do=findComment&comment=1331989","commentId":1331989,"userName":"TwiceBorn","timestamp":1415813987,"content":"I recently ordered/received this set of cards, that a player designed to make a campaign out of the Core set scenarios and Shadows of Mirkwood: http://community.fantasyflightgames.com/index.php?/topic/122061-shadows-of-mirkwood-campaign/?hl=%2Bshadows+%2Bmirkwood [https://community.fantasyflightgames.com/index.php?/topic/122061-shadows-of-mirkwood-campaign/?hl=%2Bshadows+%2Bmirkwood]. I haven't tried them out yet (or The Black Riders saga expansion, for that matter), but look forward to.\n\nEdited November 12, 2014 by TwiceBornh"}]}