{"url":"https://community.fantasyflightgames.com/topic/126947-next-faq/","title":"Next FAQ","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331405","commentId":1331405,"userName":"Glaurung","timestamp":1415766236,"content":"Next FAQ should to come out in a few months (as they do about every 6 months, twice a year) what do you guys think about? Which cards will get erratas? What rules can be change again?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331477","commentId":1331477,"userName":"Teamjimby","timestamp":1415771909,"content":"I certainly hope Blue Mountain Trader gets limit once per round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331494","commentId":1331494,"userName":"jjeagle","timestamp":1415773657,"content":"I think the top priority should be to overhaul the FAQ so it actually includes the many official answers to significant rules questions that have only been made known through responses to individual emails.\n\n \n\nIt's frustrating to have to trawl through forums and use the excellent Unofficial FAQ to find these answers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331586","commentId":1331586,"userName":"MyNeighbourTrololo","timestamp":1415784056,"content":"As mentioned before, Blue Mountains Trader should be the top guy on this list,\n\n \n\nAlso, I think it should be mentioned that moving resources does not equals adding them to prevent these \"omg my Harbor Master has endless defense now\" threads coming up here and there. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331679","commentId":1331679,"userName":"Glaurung","timestamp":1415797123,"content":"Sounds like everyone agree unlimited draw and unlimited hand size is no problem at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331686","commentId":1331686,"userName":"MyNeighbourTrololo","timestamp":1415797388,"content":"It was there all along. If it still haven't been fixed... developers simply don't care? Or they realize that implementing such groundbreaking change in rules would cause more unexpected problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331761","commentId":1331761,"userName":"Tracker1","timestamp":1415803620,"content":"> Sounds like everyone agree unlimited draw and unlimited hand size is no problem at all?\n\nI don't think we will ever see limits placed on these, especially now that they are designing scenarios that target hand size and card draw. I think that's the approach they took to the problem.\n\nCreating limits to hand and draw will open a giant can of worms that i think they are going to steer clear of.\n\nIf you think it's important, maybe you can come up with a variant, or test out how it changes the game to play with such rules. Maybe it's no big deal. I've never tried it, other than in decks that don't have much card draw or rely on discarding cards as a strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331799","commentId":1331799,"userName":"Mndela","timestamp":1415805395,"content":"Blue Mountain Trader can be errated, because it is only question about 1 card. However, to want to unlimited drawing it is not only question of 1 card, if you want to get this 'combo' you must build an entire specific deck. So i think Blue Mountain Trader will be errated but not Wild of the West."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331851","commentId":1331851,"userName":"danpoage","timestamp":1415808108,"content":"I agree that there should be a hand size limit, and cards like Legacy of Durin need limits as well. I'm wondering what would be the best way to add these limits, because some scenarios (The Fords of Isen being a prime example) actually want you to draw cards and punish you for having too many cards in your hand. I wonder if the hand size limits were built into future quest cards? That would give the designers flexibility to have card draw and hand size interact differently on an individual quest basis.\n\nEdited November 12, 2014 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331853","commentId":1331853,"userName":"Ryodu","timestamp":1415808346,"content":"> Sounds like everyone agree unlimited draw and unlimited hand size is no problem at all?\n\nI'm not sure if there should be a limit on this as it is more a preference towards how you want to play. Granted I understand why it would be nice to have some sort of cap, or like in MTG maybe you have to discard at the end."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331874","commentId":1331874,"userName":"Glaurung","timestamp":1415809460,"content":"BMT it is quite clear is too broken… what about any other cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331881","commentId":1331881,"userName":"danpoage","timestamp":1415809865,"content":"Will of the West needs to be removed from the game after it is played, this will stop the recursion decks without having to effect other cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331895","commentId":1331895,"userName":"Bullroarer Took","timestamp":1415810521,"content":"If there is a hand size limit it needs to be more than 6 cards.  There are a couple of Lore heroes that can draw cards at the start of the game but not afford to pay for them.  Personally I would like to see what jjeagle is requesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331906","commentId":1331906,"userName":"Rapier1","timestamp":1415810794,"content":"I still want to see Steward of Gondor and Unexpected Courage get nerfed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331925","commentId":1331925,"userName":"Glaurung","timestamp":1415811656,"content":"> Will of the West needs to be removed from the game after it is played, this will stop the recursion decks without having to effect other cards.\n\nActually 3 copies of that card is enough to do all broken things…. Maybe limit one per deck and add victory value…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331970","commentId":1331970,"userName":"FetaCheese","timestamp":1415813188,"content":"Is unlimited hand size really bad though? With the exception of a single deck (recursion effects notwithstanding), I havent found drawing to be excessively overpowered or anything like that, mostly because Lore that gets all the good drawing effects have no resource acceleration.  Even Leadership/Lore decks aren't anything special compared to other color combinations. Again, except for the infamous combo deck, I have never seen card draw advantage overwhelm a game, whether during my own playthroughs or in youtube vids."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331978","commentId":1331978,"userName":"Raven1015","timestamp":1415813426,"content":"Well, the Dwarf card draw can get pretty crazy. Legacy of Durin combined with Ori and/or King Under the Mountain and resource acceleration, and you can pretty much draw your deck every game. I think Legacy of Durin at least should be \"limit once per round\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1331980","commentId":1331980,"userName":"FetaCheese","timestamp":1415813591,"content":"Ah yes dwarves, rarely play them these days I've forgotten how ridiculous they can get!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332010","commentId":1332010,"userName":"MyNeighbourTrololo","timestamp":1415814771,"content":"> I still want to see Steward of Gondor and Unexpected Courage get nerfed.\n\n \n\nWas there any instances of cards getting directly nerfed in the errata before?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332045","commentId":1332045,"userName":"Raven1015","timestamp":1415816068,"content":">  \n> \n> > I still want to see Steward of Gondor and Unexpected Courage get nerfed.\n> \n>  \n> \n> Was there any instances of cards getting directly nerfed in the errata before?\n> \n>  \n\n \n\nZigil Miner was the biggest one. Erebor Battle Master got nerfed in the last one. I think Thror's Map could probably count as a nerf as well. Beravor and Protector of Lorien were 2 Core cards that got limits put on them after the fact.\n\nEdited November 12, 2014 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332063","commentId":1332063,"userName":"MyNeighbourTrololo","timestamp":1415816764,"content":">  \n> \n> >  \n> > \n> > > I still want to see Steward of Gondor and Unexpected Courage get nerfed.\n> > \n> >  \n> > \n> > Was there any instances of cards getting directly nerfed in the errata before?\n> > \n> >  \n> \n>  \n> \n> Zigil Miner was the biggest one. Erebor Battle Master got nerfed in the last one. I think Thror's Map could probably count as a nerf as well. Beravor and Protector of Lorien were 2 Core cards that got limits put on them after the fact.\n> \n>  \n\n \n\nBy directly I meant simply lowering the numbers. Like from 2 attack to 1 attack and stuff.\n\n \n\nZigil Miner was technically reworked, in a good, decent way. Erebort experience a simple change of targeting.\n\n \n\nI just don't get how he wants those cards he lists to be nerfed, except for number changes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332105","commentId":1332105,"userName":"Crabble","timestamp":1415818287,"content":"Erebor Battle Master should also have been renamed to Erebor Warrior or something like that cause ripping away 3 attack is quite a big deal but he is still usefull.\n\nThor's Map was unfortunate cause I really liked to play the original version together with Legolas to get a \"new\" location in the active location slot after Legolas cleared one in the combat phase. Now this card is \"only\" usefull to prevent some travel effects in the travel phase but unfortunatly nothing outside of that phase....\nZigi ist fine, with Stargazer you can still get a fair amount of ressources on your heros and more important burn through your deck.\nSteward of Gondor and Unexpected Courage I don't know how you should nerf these cards? Make them more expensive? I don't think they will ever do that and from my perspective I'm fine with the way they are.\n\n \n\n> I think the top priority should be to overhaul the FAQ so it actually includes the many official answers to significant rules questions that have only been made known through responses to individual emails.\n> \n>  \n> \n> It's frustrating to have to trawl through forums and use the excellent Unofficial FAQ to find these answers.\n\n \n\nThats the main thing I would really appriciate to see in the new official FAQ!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332119","commentId":1332119,"userName":"Raven1015","timestamp":1415818651,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > I still want to see Steward of Gondor and Unexpected Courage get nerfed.\n> > > \n> > >  \n> > > \n> > > Was there any instances of cards getting directly nerfed in the errata before?\n> > > \n> > >  \n> > \n> >  \n> > \n> > Zigil Miner was the biggest one. Erebor Battle Master got nerfed in the last one. I think Thror's Map could probably count as a nerf as well. Beravor and Protector of Lorien were 2 Core cards that got limits put on them after the fact.\n> > \n> >  \n> \n>  \n> \n> By directly I meant simply lowering the numbers. Like from 2 attack to 1 attack and stuff.\n> \n>  \n> \n> Zigil Miner was technically reworked, in a good, decent way. Erebort experience a simple change of targeting.\n> \n>  \n> \n> I just don't get how he wants those cards he lists to be nerfed, except for number changes.\n> \n>  \n\n \n\nAh, I get what you're saying. Yeah, I don't see how you could errata those cards without completely changing them into a different card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332263","commentId":1332263,"userName":"chuckles","timestamp":1415824889,"content":"I don't want to see many many Errata's - Blue mountain trader is probably the only one I can think of at the moment. I think it is too late in the development of this game to change SoG ,UC, WotW or add blanket hand size limits.\n\n \n\nIf WotW was errated I prefer the idea of adding it to your victory display after playing over limiting it to 1 card per deck... there are a number of cards that became coasters for me though errata's or like that leadership attachment that is per deck... far too unlikely to appear for me to bother including it. \n\n \n\nUsing the encounter deck and quests to target/effect/limit card draw, deck size or other perceived unbalances is a better way to handle this, now, in my opinion.\n\n \n\nI would also love them to release revised core rules or perhaps a separate document containing all quest specific keywords and rules. I think danpoage brought up how these keywords can get used in subsequent quests and having to remember or search through all the individual rules sheets to find them isn't ideal.\n\nEdited November 12, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332742","commentId":1332742,"userName":"Glaurung","timestamp":1415854987,"content":"UC easy can get unique. I think that will be good idea. Or limit ine per character. That bring us to some new deck building."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1332751","commentId":1332751,"userName":"booored","timestamp":1415855421,"content":"We also play this card as unique."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1333987","commentId":1333987,"userName":"Rapier1","timestamp":1415946798,"content":"I would prefer a tweaking of costs and numbers for Steward, I would prefer UC to be restricted in targeting (only willpower 1 characters for instance)\n\n \n\nHowever I do agree it's more likely we'll get erratas of the following form:\n\nLimit one per deck (Steward or UC)\nLimit one per character (UC)\n\nIs now Unique (UC)\n\n \n\nStill any of those would do as a band aid fix."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334031","commentId":1334031,"userName":"Glaurung","timestamp":1415952705,"content":"Hmm looks like all that cards is still very powerful sibce core set times…. Designers dont make anymore so powerfull cards in last 2 cycles. Also they give us more recources generation cards , maybe SOG will get some errata now but that will be not so painful. I belive UC can be limit one per hero. That will be enough. Anyway there can be unique fix too. Will se what happen? Maybe we can make kind of bet?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334057","commentId":1334057,"userName":"MyNeighbourTrololo","timestamp":1415954746,"content":"I don't see how making UC unique would bring us to \"new deckbuilding\". Players will still include 2 or 3 copies of it in each deck, not much new deckbuilding there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334064","commentId":1334064,"userName":"Glaurung","timestamp":1415955478,"content":"For example in 3 players game Beregond can defend 3 4 times with UC and Shield of Gondor. So that is cool but ca nbe a bit boring when 1 hero just keep all defences line. If UC will be unique or limit once per hero we start ti use cram and of example event Behind the strong walls..... Who wonna use other cards when is so easy put 3 UC in each player deck and make a crazy thinks... Like Beravur before errata's can draw 6 8 cards per round with 3 UC on him. \n\n \n\nIm pretty sure UC in sigh of light of designers and they still think what to do with that card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334097","commentId":1334097,"userName":"MyNeighbourTrololo","timestamp":1415959403,"content":"Well, I use stuff like Cram and Behind the Strong Walls even now, existance of UC haven't stopped me. Just having hte options is good. And they come from different spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334143","commentId":1334143,"userName":"Crabble","timestamp":1415963280,"content":"If they want to make changes on UC or Steward (which I still doubt they will do) they should make UC unique or 1 per hero. Restricted would be too much of a nerf to that card at least for me who often plays UC on Legolas for multiple attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334170","commentId":1334170,"userName":"JanB","timestamp":1415964931,"content":"Play with only one coreset as a base and you will have only UC in your deck at maximum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334172","commentId":1334172,"userName":"MyNeighbourTrololo","timestamp":1415965235,"content":"Thats a funny thing, btw. They buy several core sets to get the multiple copies of stewards/courages and then complain about how these cards break the game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334183","commentId":1334183,"userName":"gandalfDK","timestamp":1415966177,"content":" \n\n> Play with only one coreset as a base and you will have only UC in your deck at maximum.\n\nIndeed. I don't think Steward of Gondor, UC or Will of the West should be errated. If you want to house rule them into lesser cards, that's fine with me. But everybody plays in a different way/style and if you only have 1 Core Set, you would only have 2 WotW, 2 SoG and even just 1 UC. The chances of them showing up, especially the UC where everybody seems having problems with (everybody being the small minority of players who vocalize in the forums not to forget), are very small. So you guys here should just not complain about their strength if you yourself include multiple copies because they are so strong... That's just hypocritical. And even then, I for one don't mind strong cards. If you want a higher challenge, make up your own house rules. Now you want everyone to follow your rules via the FAQ, because you think it is an easy game. \n\nMy games haven't been that easy even with multiple copies of UC (OTCGN multiplies my Core Set ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]) and I think that many players (who are or are not on this forum) find this game to be hard too.\n\nSo, even though Saurons forces have been stronger all along, I think the Free Folk had some power up their sleeves too. And let's be honest, nobody plays that stupid 'draw your whole deck'-deck and even so, WHO CARES?! Let them be, it's their game too, so if they want to play that deck, then let them. It is a cooperative game, not competative.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334189","commentId":1334189,"userName":"JanB","timestamp":1415966577,"content":"Ok .. what cards next?  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334242","commentId":1334242,"userName":"Crabble","timestamp":1415970548,"content":">  \n> \n>  \n> \n> > Play with only one coreset as a base and you will have only UC in your deck at maximum.\n> \n> Indeed. I don't think Steward of Gondor, UC or Will of the West should be errated. If you want to house rule them into lesser cards, that's fine with me. But everybody plays in a different way/style and if you only have 1 Core Set, you would only have 2 WotW, 2 SoG and even just 1 UC. The chances of them showing up, especially the UC where everybody seems having problems with (everybody being the small minority of players who vocalize in the forums not to forget), are very small. So you guys here should just not complain about their strength if you yourself include multiple copies because they are so strong... That's just hypocritical. And even then, I for one don't mind strong cards. If you want a higher challenge, make up your own house rules. Now you want everyone to follow your rules via the FAQ, because you think it is an easy game. \n> \n> My games haven't been that easy even with multiple copies of UC (OTCGN multiplies my Core Set ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]) and I think that many players (who are or are not on this forum) find this game to be hard too.\n> \n> So, even though Saurons forces have been stronger all along, I think the Free Folk had some power up their sleeves too. And let's be honest, nobody plays that stupid 'draw your whole deck'-deck and even so, WHO CARES?! Let them be, it's their game too, so if they want to play that deck, then let them. It is a cooperative game, not competative..\n> \n>  \n\nVery well said. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nNext card: Theoden! Give him a usefull ability that is worth to be on such a high power charakter (ducking my head and waiting for the hate to come :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  )."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334260","commentId":1334260,"userName":"FetaCheese","timestamp":1415971648,"content":"Agreed GandalfDK. I consider myself a \"core\" player (not hardcore, but I have almost everything printed for this game, I deckbuild, I play rather well and try NM mode) and I have a challenging time with the harder quests as it is (I avoid playing dwarves and outlands, admittedly). I can only imagine how tough things are for the vast majority of players who have nowhere near the dedication of this forum! Nerfing cards because of a small vocal minority would be at the expense of the majority. Just because you are good at something it doesn't mean its easy! Glaurung is not a good benchmark for difficulty. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] In the end would gameplay be healthier and less cheesy or toxic? I dont think so, this game doesn't mess around.\n\nAnd besides, all these so called OP cards have been part of the game since its inception and the gameplay is balanced around them. Power level is high for both the player AND the encounter cards and I am fine with it. UC and Steward are BASELINE, they have always been and will probably always will, as new player cards are designed around them.\n\nAlso keep in mind the encounter deck has its own meta, that evolves over time to provide answers to player strategies (draw hate, discard attachments etc). I say trust the designers, the latest mechanics they have been introducing have been great.\n\nI'd love to hear some reports on the new HoN NM quests with houseruled limitations on player cards. I bet the quests are near unwinnable since they are balanced around player staple cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334265","commentId":1334265,"userName":"Scroll Lock","timestamp":1415971847,"content":"Thedoen would be ok with 10 or 11 threat instead of 12"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334267","commentId":1334267,"userName":"FetaCheese","timestamp":1415971933,"content":"> Thats a funny thing, btw. They buy several core sets to get the multiple copies of stewards/courages and then complain about how these cards break the game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nI think people have different expectations about how often the player should be winning a given quest. A player that criest \"nerf UC!\" probably considers a 50% success chance too high for a NM quest, while someone like me considers it ideal. People have different views."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334269","commentId":1334269,"userName":"MyNeighbourTrololo","timestamp":1415972022,"content":"> Thedoen would be ok with 10 or 11 threat instead of 12\n\nYeah, I think giving Theoden +1 starting threat because his ability gives him 1 wp too was a jerk move."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334305","commentId":1334305,"userName":"Rapier1","timestamp":1415974031,"content":"> Agreed GandalfDK. I consider myself a \"core\" player (not hardcore, but I have almost everything printed for this game, I deckbuild, I play rather well and try NM mode) and I have a challenging time with the harder quests as it is (I avoid playing dwarves and outlands, admittedly). I can only imagine how tough things are for the vast majority of players who have nowhere near the dedication of this forum! Nerfing cards because of a small vocal minority would be at the expense of the majority. Just because you are good at something it doesn't mean its easy! Glaurung is not a good benchmark for difficulty. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] In the end would gameplay be healthier and less cheesy or toxic? I dont think so, this game doesn't mess around.\n> \n> And besides, all these so called OP cards have been part of the game since its inception and the gameplay is balanced around them. Power level is high for both the player AND the encounter cards and I am fine with it. UC and Steward are BASELINE, they have always been and will probably always will, as new player cards are designed around them.\n> \n> Also keep in mind the encounter deck has its own meta, that evolves over time to provide answers to player strategies (draw hate, discard attachments etc). I say trust the designers, the latest mechanics they have been introducing have been great.\n> \n> I'd love to hear some reports on the new HoN NM quests with houseruled limitations on player cards. I bet the quests are near unwinnable since they are balanced around player staple cards.\n\n \n\nYou're totally highlighting the reason why these cards need to be changed. At least from my point of view.\n\nit is nothing to do with having one powerful card - and everything to do with how they are negatively influencing the card designs. UC being 2 cost unrestricted hero ready means that any restricted hero ready has to fit into only cost 1 and cost 0. Which leads to a really small design space for a very important aspect of the game. It's difficult for them to make new cards that will actually compete with the good core set ones.\n\nSteward of Gondor being 2 cost to get 2 resources instantly (and +2 a turn there after) and gaining another trait as a bonus - really hurts their ability to make new cards that give you resource acceleration . I don't think a card exists that's even close to this resource generation. (resourceful is 1 for +1 a turn in  its ideal circumstances, though it isn't unique).\n\nYes you are right, the encounter cards and player cards have  been taking account of the core set strong cards - however we now have more variety than we did and if these cards were nerfed (say they both just cost +1 each, no other changes) then new cards could be put into the game to help offset the balance in power you're concerned about, but they can't fit currently.\n\nIf we don't fix these glaring issues eventually they will ruin the future of the game. I mean it's a deck builder, but you're saying you can't beat nightmare reliably without power cards. I think that's true too - but I want them to make the power cards a better choice (rather than obvious) and then fill in the newly created design space with more alternatives.\n\nThe likelihood is that we will get a core set 2nd edition at some point as most of the best and worst cards are there, and I'm sure the current designers would take the opportunity to change many of the cards to better fit the direction that the traits went."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334325","commentId":1334325,"userName":"MyNeighbourTrololo","timestamp":1415975444,"content":"I wonder if 2nd Edition Core set (if it'll ever happen, ofc) will start a new line of game, rebooting the franchise, or will it support everything released already?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334430","commentId":1334430,"userName":"FetaCheese","timestamp":1415978532,"content":"An updated starter box would be cool but there is no need to reboot Lotr LCg as the mechanics are pretty robust, if complicated. AGoT on the other hand was a mess of a game.\n\nEdited November 14, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334455","commentId":1334455,"userName":"FetaCheese","timestamp":1415979224,"content":"UC should be limited once per hero and Steward should enter play exhausted imo but I still hold its too late to change them without screwing over the majority of players and messing around with the game's difficulty. Imo, there is also enough unexplored design space left, like Oh Lorien/tighten our belts/zigil mimer compared to Steward. I'd rather see errata focusing on truely problematic cards like Dain Ironfoot tbh. (Edit: because stuff like Dain, Outlands etc make UC and Steward look OP or constrictive).\n\nEdited November 14, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334457","commentId":1334457,"userName":"Mndela","timestamp":1415979281,"content":"I am playing this game since 3 years ago. I like UC and Stewards, but if i don't want to get bored, i change the way of gainning resources. (Me and some friends do it, without problems).\n\n \n\nBut i think new players enjoy with UC and Stewards, so i wouldnt make faqs about them. I would 'leave' they leave those cards along the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334528","commentId":1334528,"userName":"alogos","timestamp":1415981810,"content":"> And let's be honest, nobody plays that stupid 'draw your whole deck'-deck and even so, WHO CARES?! Let them be, it's their game too, so if they want to play that deck, then let them. It is a cooperative game, not competative..\n\n \n\nA faq only purpose in a card game like this is for competition, even if they do not really exist yet (official with prize I mean). Someone who buy one coreset and never go on internet would never see such faq and errata (until reprint) and has a cooperative game, will play with his own houserules.\n\n \n\nA faq should aim to balance the game in competitive play, or else whoever would care about it ?\n\n \n\nSo yes, it is indeed important to complain about UC and errata it in some way or change the rules of tournament with some restricted cards list and stuffs (wich would be better in my opinion). Not at all hypocritical. Competitive LotR is very far from being playable still, and all discussion on errata are meaningless in some way. We have it nonetheless because there are people organizing parties plays in store and it's better to have all players having fun and following the same rules with a healthy fake competition. We never saw absurd combo deck in those encounters, but success rate is still proportionnal to how many overpowered cards they have.\n\nSo while I agree with the last statement of GandalfDK, I disagree with the remaining. Also, if the card being discussed wasn't in the coreset, all his argument become invalid..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334544","commentId":1334544,"userName":"Bullroarer Took","timestamp":1415982604,"content":"In my superhero attachment deck I have Steward and Courage, but the card that really breaks the deck is Burning Brand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334588","commentId":1334588,"userName":"Chris51261","timestamp":1415984225,"content":"They could avoid having to do the super annoying \"errata cards that have been the same for years\" and just start throwing more attatchment hate into newer adventure packs. I'm all for keeping the game challenging and difficult, but the list of errata is pages long. Let's not make it so every time you play a card you're checking to see if it still does what you think it does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334760","commentId":1334760,"userName":"Rapier1","timestamp":1415990993,"content":"> UC should be limited once per hero and Steward should enter play exhausted imo but I still hold its too late to change them without screwing over the majority of players and messing around with the game's difficulty. Imo, there is also enough unexplored design space left, like Oh Lorien/tighten our belts/zigil mimer compared to Steward. I'd rather see errata focusing on truely problematic cards like Dain Ironfoot tbh. (Edit: because stuff like Dain, Outlands etc make UC and Steward look OP or constrictive).\n\n \n\nI personally, don't think Outlands is as bad. It's easy to think of ways to completely shut outlands down (we have no remove all allies type cards in the encounter deck, or how about the encounter cards that remove this card and another card with the same name). \n\nWe could even potentially have some anti-trait encounter cards (all cards that share the most common trait receive blank text boxes would wreck them for example).\n\nbut more to the point Outlands and Dain and Glorfindel, aren't hurting the design space as badly. Dain is too powerful because he scales too well with multiple decks. It would be better if Dain was less strong or did less, yes. I would accept an errata on Dain. \n\nHowever Dain is the top end of a power curve for heroes that boost decks (with Glorfindel the top end of the solo hero stat power house). While Dwarf cards do need to consider that Dain exists, he only hurts dwarf design. All heroes need to take account of UC. All cards need to be costed with the idea that resource acceleration can occur at the rate of Steward of Gondor.\n\nOutlands itself is a powerful trait, but from a design perspective it only matters for cards with the Outlands trait. (It may be we never get any more if it's already too strong since the design builds on itself). These examples you give though, only effect a small amount of the game. UC and Steward effect a lot more of the design.\n\nThat's why they're worse. Your suggestion to just avoid using the power cards works for Dain (avoid dwarfs, or play weaker dwarfs, they're sitll good without him). but for UC, Fast hitch is costed because of UC, so are all ready effects. They all take account of UC's existence, even if you don't use it.\n\nYou have to avoid ready effects entirely, to not have UC effect your deck.\n\nEdited November 14, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334774","commentId":1334774,"userName":"Raven1015","timestamp":1415991716,"content":"Hmm, I think when it comes to UC and Steward, you have to remember that these were staples of the Core Set for a good reason. Think back to when you first had a Core Set, which had a mix of great cards, good cards, ok cards, and some terrible ones. Remember how difficult the Core Set can be with just Core Set cards (and without all the knowledge and experience you have now). Steward and UC were essential tools against that difficulty and made perfect sense at the time. So I don't think there was any \"mistake\" made with those cards (although we can argue about leaving enough design spaces for yourself later on). Of course, now with a bigger card pool, then all those issues arise that you guys are talking about.\n\n \n\nBasically, the big split among players seems to be between those who have the philosophy that players should just limit themselves and those who want those limitations actually built into the cards through errata. I'm somewhere in the middle. I would be fine if they errata'd Unexpected Courage to \"limit 1 per deck\". That's how many copies are in the Core anyway, and that's my favorite change. Making it unique isn't thematic, and limit 1 per hero fixes the issue somewhat, but it's still better than other readying in Spirit. Limit 1 per deck means you can't rely on it and will have to deck build specifically to try to get it, which makes it more interesting, while making something like Steed of the Mark better, as that card will be way more consistent in comparison. I personally think Steward, on the other hand, is fine as it is. At the end of the day, though, perhaps less errata is better, and players can limit themselves. As I said, I'm still a bit undecided on the issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334797","commentId":1334797,"userName":"MyNeighbourTrololo","timestamp":1415992758,"content":"I don't think that Fast Hitch has anything to do with UC. Fast Hitch gives an extra action to the weakest type of heroes in the game, costing more would have simply killed it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334870","commentId":1334870,"userName":"Rapier1","timestamp":1415996503,"content":"> I don't think that Fast Hitch has anything to do with UC. Fast Hitch gives an extra action to the weakest type of heroes in the game, costing more would have simply killed it.\n\n \n\nThat could be the case, it might be that even if UC cost more Fast Hitch would still need to be only cost 1, because getting two actions out of hobbits is less valuable. I don't agree though, I think it could have been 2 (if UC wasn't just better).\n\nEdited November 14, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1334880","commentId":1334880,"userName":"MyNeighbourTrololo","timestamp":1415996866,"content":"2 would make it simply not worth it. Look at the most hobbit heroes. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335037","commentId":1335037,"userName":"booored","timestamp":1416003030,"content":"> A faq only purpose in a card game like this is for competition\n\nnot really. You need coherence among the community for a community to form. The rules is what binds us all together and creates discussion points and deck sharing. While yes, without competition the FAQ isn't as important.. but errats and tweaks to the game design are still needed for the life of the game and the ability for the community to work together. While many of us use custom rules and eve ncustom cards, if you look around the \"community\" is all about office rule chat and deck design. So I am thinking it is still pretty important."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335039","commentId":1335039,"userName":"Rapier1","timestamp":1416003121,"content":"> 2 would make it simply not worth it. Look at the most hobbit heroes. \n\n \n\nFast hitch is an example (because it's the same card with a restriction). However you're missing the bigger picture here.\n\nUnexpected Courage costs 2, targets any hero.\n\nFast Hitch costs 1, targets any hobbit.\n\nSo what's the design space left for my targets any elf card? If it costs 1 it's just better than Fast hitch because as you rightly say, Elven heroes are better than hobbit heroes. If it costs 2, it's just worse than Unexpected Courage (without the restriction).\n\nThe design space for pitching cards between the two is non-existent, and it isn't because Fast Hitch should have been cost 0. It's because Unexpected Courage should have been more than cost 2.\n\n \n\nEdit: I might even go so far as to say, Unexpected Courage should never have existed. \n\nEdited November 14, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335046","commentId":1335046,"userName":"booored","timestamp":1416003311,"content":"> (snip)\n\nMaking it restricted also is a good fix, as the decision point of what to put it on becomes sharper, also it limits its use. You can not untap 4 times to block val.5.. .but you can block twice to block val.5. This is a pretty good limiter on it.\n\nI think my fav is making it unique. Limit one per deck is not cool. I know we have Word of Command very easy to play now, but still. Drawing singletons is anti-deck design as you can not count on it. Unique dose the exact same thing (apart form multiplayer) and you can also play it as a singleton if you like without any loss of functionality. So Singleton and Unique is practically the same change."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335077","commentId":1335077,"userName":"MyNeighbourTrololo","timestamp":1416004490,"content":">  \n> \n> > 2 would make it simply not worth it. Look at the most hobbit heroes. \n> \n>  \n> \n> Fast hitch is an example (because it's the same card with a restriction). However you're missing the bigger picture here.\n> \n> Unexpected Courage costs 2, targets any hero.\n> \n> Fast Hitch costs 1, targets any hobbit.\n> \n> So what's the design space left for my targets any elf card? If it costs 1 it's just better than Fast hitch because as you rightly say, Elven heroes are better than hobbit heroes. If it costs 2, it's just worse than Unexpected Courage (without the restriction).\n> \n> The design space for pitching cards between the two is non-existent, and it isn't because Fast Hitch should have been cost 0. It's because Unexpected Courage should have been more than cost 2.\n> \n>  \n> \n> Edit: I might even go so far as to say, Unexpected Courage should never have existed. \n> \n>  \n\nDesign space is still a lot. Example: An elf attachment that readies them and costs 2. Would totally use. Wanna know why? Because its from leadershit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335154","commentId":1335154,"userName":"Rapier1","timestamp":1416008793,"content":"> > \n> \n> Design space is still a lot. Example: An elf attachment that readies them and costs 2. Would totally use. Wanna know why? Because its from leadershit.\n> \n>  \n\n \n\nThat's a really narrow design space you're talking about though. We don't just want Spheres to become interchangeable because we haven't got any room for anything else. If the spheres start to bleed into each other too much they become meaningless and design suffers.\n\nWe could make Unexpected Leadership (Cost 3 because of the leadership tax, otherwise identical to unexpected courage) or Unexpected Ready Elves (the 2 cost version, elf only, but it's paying the leadership tax...) but once you get to that point you're really scrapping the barrel.\n\n \n\nI mean really we're looking for new designs, \"ready two elves in play\", or new triggers \"if the staging area contains more enemies than you have allies then ready exhaust this card to ready the hero.\"\n\nBut it's difficult to do that in a very narrow space - all the effects start to blend together. Exactly like the counterexample you've given that I have expanded upon. \n\nEdited November 14, 2014 by Rapier"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335164","commentId":1335164,"userName":"joezim007","timestamp":1416009321,"content":"I agree that it limits the design posibiities, but I think Caleb and Matt still have plenty to work with and they are pretty good at this. Look at Lembas..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335175","commentId":1335175,"userName":"MyNeighbourTrololo","timestamp":1416009908,"content":"> Another one of these unnecessary long-ass posts.\n\nDesign space is limitless even now, with existance of UC, all it needs is a clever mind and the desire to use it. I could give you 10 viable readying attachments, of any combination of spheres, that would compete with UC, if I'd wanted to. All UC limits, honestly, is mindless implementation of spirit readying attachments, like Steed of the Mark was, that's all. And to finish my post, a little funny fact for you: readying effects are actually leadershit's thingy, not spirit's.\n\nEdited November 15, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335193","commentId":1335193,"userName":"joezim007","timestamp":1416012775,"content":"> > Another one of these unnecessary long-ass posts.\n> \n> Design space is limitless even now, with existance of UC, all it needs is a clever mind and the desire to use it. I could give you 10 viable readying attachments, of any combination of spheres, that would compete with UC, if I'd wanted to. All UC limits, honestly, is mindless implementation of spirit readying attachments, like Steed of the Mark was, that's all. And to finish my post, a little funny fact for you: readying effects are actually leadershit's thingy, not spirit's.\n\nIt's kinda both. Spirit has 3 readying attachments that I can think of plus LoV. Leadership only has 1 or 2, but Leadership has a lot of one-time effects for readying, like Cram and Strength of Arms and it targets more than just single heroes often times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335258","commentId":1335258,"userName":"joezim007","timestamp":1416020582,"content":"How about this?\n\nSacrificial-Leader.jpg?psid=1 [https://eoym1q-dm2306.files.1drv.com/y2pAnMiI7VX_gHkKJgFYYlDQjJCViMJKuJg_wu4DTz5bOONSPh1_tf2yqlKfXgScJe-YxGoog-a9AsroEgR095809BXYmFH84YHfjfB5WIxtCc/Sacrificial-Leader.jpg?psid=1]\n\nThe image will probably be broken, so:\n\nSacrificial Leader (unique)\n\n1 Cost Leadership Attachment\n\nSkill (trait)\n\nAttach to a Leadership hero.\n\nAction: Exhaust Sacrificial Leader and attached hero to ready 2 other characters.\n\nSee? If you put your mind to it you can come up with plenty of unique readying abilities. If I can come up with this, imagine what the guys who are getting paid can think of.\n\nEdited November 15, 2014 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335262","commentId":1335262,"userName":"FetaCheese","timestamp":1416020847,"content":"Fast hitch exist and it didn't mess with anything. The color pie is a lot more fluid in Lotr."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335423","commentId":1335423,"userName":"MyNeighbourTrololo","timestamp":1416044869,"content":"Readying stuff from Leadershit:\n\nAragorn\n\nElrohir\n\nSam Gamgee\n\nPrince Imrahil\n\n \n\nForlong\n\nOrthanc Guard\n\n \n\nCram\n\nHeir of Mardil\n\n \n\nCommon Cause\n\nEver Vigilant\n\nGrim Resolve\n\nLure of Moria\n\nStrength of Arms\n\nSwift and Silent\n\n \n\nTotal: 14\n\n \n\n \n\nNow, readying stuff from Spirit:\n\nIdraen\n\n \n\nEomund\n\nWestfold Horse-breaker\n\n \n\nEver My Heart Rises\n\nMiruvor\n\nSpare Hood and Cloak\n\nSteed of the Mark\n\nUnexpected Courage\n\nRenewed Friendship\n\n \n\nTotal: 9\n\n \n\n \n\nLeadershit currently possesses almost as twice readying effects as Spirit does. So, I stand resolute - readying is definetely native Leadershit thingy.\n\nEdited November 15, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335454","commentId":1335454,"userName":"joezim007","timestamp":1416053681,"content":"I'm not saying that it isn't. I'm saying that both spheres are readying spheres. If you have 9 different readying effects in your sphere, it certainly isn't unknown territory. They each specialize in readying in different ways. Spirit has several semi-universal repeatable readying attachment, while Leadership specializes in characters having built in readying and having one-time readying effects, like Cram and events. Sadly, if we need to ready a hero without a built in readying effect, we tend to look to Spirit because they have more decent repeatable options. This gives Spirit the illusion of being the primary readying sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335541","commentId":1335541,"userName":"Rapier1","timestamp":1416066781,"content":"> How about this?\n> \n> Sacrificial-Leader.jpg?psid=1 [https://eoym1q-dm2306.files.1drv.com/y2pAnMiI7VX_gHkKJgFYYlDQjJCViMJKuJg_wu4DTz5bOONSPh1_tf2yqlKfXgScJe-YxGoog-a9AsroEgR095809BXYmFH84YHfjfB5WIxtCc/Sacrificial-Leader.jpg?psid=1]\n> \n> The image will probably be broken, so:\n> \n> Sacrificial Leader (unique)\n> \n> 1 Cost Leadership Attachment\n> \n> Skill (trait)\n> \n> Attach to a Leadership hero.\n> \n> Action: Exhaust Sacrificial Leader and attached hero to ready 2 other characters.\n> \n> See? If you put your mind to it you can come up with plenty of unique readying abilities. If I can come up with this, imagine what the guys who are getting paid can think of.\n\n \n\nI feel like you are getting hung up on specifics here. I didn't claim it was impossible to create new and interesting effects even given the constraints that we have. I claimed that the scope for the design is a lot narrower than it should be, because of mistakes made in the early card designs (in the core set).\n\nThis game is certainly not alone in having over and under-powered cards in the core design that are improved on over time. \n\n \n\nNor do I claim that we have reached the point, now, where we can't make any more good ready effects with what's available. We can.\n\nBut when we have double the card pool we have now (which realistically would only be beginning to fill out all the minor traits like Beorning). Will you still be able too come up with good ready effects then? Even Trololo claiming 10 designs would still not have enough to double the card pool. (We have more than 10 ready effects now).\n\nMy argument is that it's harder to fix the issue the more cards you make. FetaCheese rightly said that the encounter decks are designed with the player cards in mind. New player cards are also designed based on what already exists.\n\nWe should make the change sooner (and so have better cards designed from now) rather than when we have no choice - otherwise we'll end up with a second edition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335570","commentId":1335570,"userName":"MyNeighbourTrololo","timestamp":1416069533,"content":"You pick on this poor UC too much. If anything is ought to be fixed - it's total mistakes of the core set like Power in Earth and Favor of the Lady."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335585","commentId":1335585,"userName":"Crabble","timestamp":1416070671,"content":"Favor of the Lady? It's the same like Dúnedain Quest only that you can't change the owner of this attachment but thats negletable. The card was good in core set days and maybe through Mirkwood cycle but since then you can get willpower easier and cheaper. I don't mind this attachment it's ok but wouldn't use it anymore.\n\n \n\nPower in the earth was  **** from the get go but I don't know would you use it if it grants a location -2 or even -3 threat? I mean sure you can get location looked in 3-4 player games but normally that should tell you to redesign your decks to clear out locations more efficient. I doubt that I would use this card if it grants -2 threat and with -3 i'm sure people would say it's op. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited November 15, 2014 by Crabble"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335592","commentId":1335592,"userName":"MyNeighbourTrololo","timestamp":1416071020,"content":"Dunedain Quest is of the leadershit. Spirit cannot farm resources as easily as leadershit does.\n\n \n\nAnd what if that location has some nasty travel/explore effect? What that tells you? There are less blunt ways of redesigning the card than just adding threat reduction.\n\n \n\nThe problem is, overall, is that core set is an abomination. Such high curve of cards ranging from utterly useless to auto-include to this day + not 3 copies of each player card. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335650","commentId":1335650,"userName":"Rapier1","timestamp":1416075245,"content":"> Dunedain Quest is of the leadershit. Spirit cannot farm resources as easily as leadershit does.\n> \n>  \n> \n> And what if that location has some nasty travel/explore effect? What that tells you? There are less blunt ways of redesigning the card than just adding threat reduction.\n> \n>  \n> \n> The problem is, overall, is that core set is an abomination. Such high curve of cards ranging from utterly useless to auto-include to this day + not 3 copies of each player card. \n\n \n\nI think abomination might be too strong a word, but I agree.\n\nOverall the core set is all over the place, especially compared to the later designs. This another reason I hope to get a core set 2nd edition at some point (that's designed to work with the cards from the rest of the game)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335921","commentId":1335921,"userName":"jjenks476","timestamp":1416102886,"content":"I forget who mentioned it but I think the best way to deal with Unexpected Courage is to limit it to hero's with a threat of 9 or less. This will make it not quite as powerful while still having a smattering of good heroes who could use it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335923","commentId":1335923,"userName":"Glaurung","timestamp":1416103347,"content":"Maybe is not bad idea but bring additional headech. I think limit one per hero is ok."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335949","commentId":1335949,"userName":"chuckles","timestamp":1416105909,"content":"Of all the UC errata suggestions I like the once per hero option best.\n\nEdited November 16, 2014 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1335971","commentId":1335971,"userName":"FetaCheese","timestamp":1416108065,"content":"╔═════════════════ ೋღ☃ღೋ ════════════════╗\n\n~ ~ ~ ~ ~ ~ ~ ~ ~ Repost this if ~ ~ ~ ~ ~ ~ ~ ~ ~\n\n~ ~ you are a beautiful strong readying attachment ~ ~\n\n~ ~ ~ ~ ~ ~ ~ who don’t need no nerf ~ ~ ~ ~ ~ ~ ~\n\n╚═════════════════ ೋღ☃ღೋ ════════════════╝\n\nHaters gonna hate. UC for life.\n\nEdited November 16, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336129","commentId":1336129,"userName":"chuckles","timestamp":1416125268,"content":"> ╔═════════════════ ೋღ☃ღೋ ════════════════╗\n> \n> ~ ~ ~ ~ ~ ~ ~ ~ ~ Repost this if ~ ~ ~ ~ ~ ~ ~ ~ ~\n> \n> ~ ~ you are a beautiful strong readying attachment ~ ~\n> \n> ~ ~ ~ ~ ~ ~ ~ who don’t need no nerf ~ ~ ~ ~ ~ ~ ~\n> \n> ╚═════════════════ ೋღ☃ღೋ ════════════════╝\n> \n> Haters gonna hate. UC for life.\n\n \n\nSo made me laugh out loud when I read this :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336369","commentId":1336369,"userName":"joezim007","timestamp":1416162469,"content":"> > How about this?Sacrificial-Leader.jpg?psid=1 [https://eoym1q-dm2306.files.1drv.com/y2pAnMiI7VX_gHkKJgFYYlDQjJCViMJKuJg_wu4DTz5bOONSPh1_tf2yqlKfXgScJe-YxGoog-a9AsroEgR095809BXYmFH84YHfjfB5WIxtCc/Sacrificial-Leader.jpg?psid=1]\n> > \n> > The image will probably be broken, so:\n> > \n> > Sacrificial Leader (unique)\n> > \n> > 1 Cost Leadership Attachment\n> > \n> > Skill (trait)\n> > \n> > Attach to a Leadership hero.\n> > \n> > Action: Exhaust Sacrificial Leader and attached hero to ready 2 other characters.\n> > \n> > See? If you put your mind to it you can come up with plenty of unique readying abilities. If I can come up with this, imagine what the guys who are getting paid can think of.\n> \n>  \n> \n> I feel like you are getting hung up on specifics here. I didn't claim it was impossible to create new and interesting effects even given the constraints that we have. I claimed that the scope for the design is a lot narrower than it should be, because of mistakes made in the early card designs (in the core set).\n> \n> This game is certainly not alone in having over and under-powered cards in the core design that are improved on over time. \n> \n>  \n> \n> Nor do I claim that we have reached the point, now, where we can't make any more good ready effects with what's available. We can.\n> \n> But when we have double the card pool we have now (which realistically would only be beginning to fill out all the minor traits like Beorning). Will you still be able too come up with good ready effects then? Even Trololo claiming 10 designs would still not have enough to double the card pool. (We have more than 10 ready effects now).\n> \n> My argument is that it's harder to fix the issue the more cards you make. FetaCheese rightly said that the encounter decks are designed with the player cards in mind. New player cards are also designed based on what already exists.\n> \n> We should make the change sooner (and so have better cards designed from now) rather than when we have no choice - otherwise we'll end up with a second edition.\n\nHow many readying abilities do you think we need? I agree that it greatly limits the options but we don't really need to double the options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336406","commentId":1336406,"userName":"lleimmoen","timestamp":1416166288,"content":"Had to sign in one more time for this. Rapier is so right. UC needs errata, long before others, save Dain perhaps. And both seem actually very easy to me. UC limit one per deck. One per hero is not nearly enough, it still compares terribly to Steed of the Mark then. And I do want to play the Steed and not feel like an idiot. One per deck is simple. One-core-set players will be happy, too.\n\n \n\nPlus, even the errata may be optional. I do not want to make it hard on new players. Play without errata of the strong cards like Beravor or UC (in the future, we hope) till you get better at it and your card pool grows.\n\n \n\nDain, another easy fix, it seems. Make it only work for allies, just like the Battle Master. The card then remains very strong but it comes with an important drawback in the early game.\n\n \n\nWell, I am off again. Enjoy everyone!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336455","commentId":1336455,"userName":"Bullroarer Took","timestamp":1416170416,"content":"Leave UC alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336458","commentId":1336458,"userName":"MyNeighbourTrololo","timestamp":1416170508,"content":"Limit 1 per deck suggestion is stupid. Limit 1 per deck is for borderline strong cards, not \"simply strong ones that somehow limit the design space\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336483","commentId":1336483,"userName":"FetaCheese","timestamp":1416172195,"content":"Limit 1 per deck cards are essentially unplayable since you will rarely draw them. Completely unreliable.\n\nGenerally speaking we need less armchair designers in this forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336657","commentId":1336657,"userName":"Rapier1","timestamp":1416184858,"content":"> Limit 1 per deck cards are essentially unplayable since you will rarely draw them. Completely unreliable.\n> \n> Generally speaking we need less armchair designers in this forum.\n\n \n\nThis seems a bit harsh on the actual designers.\n\nYou seem to be implying that limit 1 per deck is such an awful design that only fan designers would come up with it.\n\nBut the actual designers have put this in the game three times now. I don't think a single \"armchair designer\" came up with or suggested the limit one per deck concept until it was already in the game.\n\nI also think that it's not bad design at all, as a limiter on a card of strong power. It makes the powerful effect require additional cards to become reliable (fetch cards, card draw)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336673","commentId":1336673,"userName":"FetaCheese","timestamp":1416186358,"content":"I'm not implying it, facts are facts.\n\n \n\n2 of the 3 cards are essentially unplayable and Black Arrow is a nifty little gimmick but not much else. There are a nice little experiment but are weak overall. There is also evidence for the limited impact of these cards. UC cant be 1 per deck...Readying effects form the basis of most  decks. They are just too important. One in 50 UC would be unplayable except for fringe decks like that Istari card that exhausts gandalf to search for 1 card..and it still wouldn't be worth it.\n\n \n\nSince readying is vital to the game and all future ready effects would be weaker (since UC was nerfed), half the decks would include Boromir. Then everone would complain about Boromir they way we (I :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) do about Glorfindel and we'd have more armchair designers asking for Boromir errata.... a devious cycle thatd never end, I can see it already. Player power level would grow so much weaker we'd be forced to dwarf our way out of  the outlands (Funny how little UC Iis used in those decks but UC is the one to be called imbalanced). One core (foundational) card fixed to destabilise the whole game? No thanks. The developers know best. \n\nEdited November 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336717","commentId":1336717,"userName":"jjenks476","timestamp":1416189792,"content":"I think limit 1 per deck isn't a bad idea. I use Fall of Gil-Galad all the time, it's a great card when you are building a deck with Fortune of Fate or Landroval. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336765","commentId":1336765,"userName":"chuckles","timestamp":1416193616,"content":"Personally, I think it is very bad idea. I'm not fan of any of the 1 per deck cards - auto excludes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336844","commentId":1336844,"userName":"FetaCheese","timestamp":1416202369,"content":"> I think limit 1 per deck isn't a bad idea. I use Fall of Gil-Galad all the time, it's a great card when you are building a deck with Fortune of Fate or Landroval. \n\n \n\nMeh. Fall only works on destroyed heroes, not discarded ones, so no nifty Caldara or Boromir combos can be triggered that'd make it worthwhile. In a spirit heavy deck its not worth it because Fortune or Fate is expensive and FoGG isnt drawn consistently enough. Better threat reduction options here and even as a 1-of spirit has better options. \n\n \n\nIn tactics it cant be attached to Beorn hero, it doesn't work on Boromir and you are not guaranteed to have it when you need it. And if you need it you are doing it wrong, since you probably lost your decked out defender AND had to have a 5 cost Landroval in play or else the attacker will kill another hero next turn. I dare say expecting a hero to die is not a winning strategy in general at this moment (might change with a wider card pool). Besides, it really is a question of timing, which 1 per deck cards dont have. Readying shouldn't be that random.\n\n \n\nRight now, FoGG works better in theory than in practice.\n\nEdited November 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336873","commentId":1336873,"userName":"MyNeighbourTrololo","timestamp":1416207131,"content":"1 per deck is not that bad of design by iteself (though we would be much better off without it), but slapping it on a regular quality card is just insane. If you wan't UC to become 1 per deck, then it should cost 0 and give +1 to all stats to attached hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336946","commentId":1336946,"userName":"tricil","timestamp":1416217346,"content":"> Plus, even the errata may be optional. I do not want to make it hard on new players. Play without errata of the strong cards like Beravor or UC (in the future, we hope) till you get better at it and your card pool grows.\n\n \n\nGiven that new players generally do not buy two core sets right away, UC already is limited to 1 per deck implicitly. This whole discussion really only affects those people that have more than one (ideally, three) core sets. This might be the majority of people on this forum but probably just a small fraction of all people who own this LCG in the real world."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336964","commentId":1336964,"userName":"lleimmoen","timestamp":1416221290,"content":"> I'm not implying it, facts are facts.\n> \n>  \n> \n> 2 of the 3 cards are essentially unplayable and Black Arrow is a nifty little gimmick but not much else. There are a nice little experiment but are weak overall. There is also evidence for the limited impact of these cards. UC cant be 1 per deck...Readying effects form the basis of most  decks. They are just too important. One in 50 UC would be unplayable except for fringe decks like that Istari card that exhausts gandalf to search for 1 card..and it still wouldn't be worth it.\n> \n>  \n> \n>  \n\nSome armchair players around here? Who are you actually kidding Fetta? I think there are quite a few players who insert certain cards into a deck just once. I can speak for myself, I do this very often and it works. Card draw, search, deck-building? Fetching attachments have becomes especially easy. I do have Black Arrow in my Silvan deck with Master of the Forge in there. I think I have the card out in at least 67% of the games. And the card makes a difference almost every time it is in play.\n\nI think you're being quite too hasty with the keyboard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336965","commentId":1336965,"userName":"lleimmoen","timestamp":1416221336,"content":"> 1 per deck is not that bad of design by iteself (though we would be much better off without it), but slapping it on a regular quality card is just insane. If you wan't UC to become 1 per deck, then it should cost 0 and give +1 to all stats to attached hero.\n\nJust silly, really. Hard to believe you play this game at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336966","commentId":1336966,"userName":"Mndela","timestamp":1416221400,"content":"> 1 per deck is not that bad of design by iteself (though we would be much better off without it), but slapping it on a regular quality card is just insane. If you wan't UC to become 1 per deck, then it should cost 0 and give +1 to all stats to attached hero.\n\n \n\nI agree. In fact, i dont see UC overpowered. A lot of times one player put in table one copy of them saying 'who wants?' and nobody ask for it.\n\n \n\nI think UC likes a lot the new players with his first CORE set, and some Adventure Pack of 1st cycle\n\nEdited November 17, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336970","commentId":1336970,"userName":"lleimmoen","timestamp":1416221700,"content":"And, of course, nerfing UC won't hurt anything. Except the very inexperienced players, maybe, as I said above. Fetta, you completely contradict your two arguments. In one you state that the broken decks do not use Courage, in the other you say that nerfing it would destroy the game. One can make a great deck without Courgage, no problem. No need for the Tactics Boromir either. Just browse the strategy sections here and there a little. I have not been using it -- at all -- because it seems like cheating. But I would like to use it legitimately, following the rules. The game would only gain for it as the designing space would gain breath."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336972","commentId":1336972,"userName":"lleimmoen","timestamp":1416221864,"content":">  \n> \n> > 1 per deck is not that bad of design by iteself (though we would be much better off without it), but slapping it on a regular quality card is just insane. If you wan't UC to become 1 per deck, then it should cost 0 and give +1 to all stats to attached hero.\n> \n>  \n> \n> I agree. In fact, i dont see UC overpowered. A lot of times one player put in table one copy of them saying 'who wants?' and nobody ask for it.\n> \n>  \n> \n> I think UC likes a lot the new players with his first CORE set, and some Adventure Pack of 1st cycle\n> \n>  \n\nWow, how do you people play the game? So here we have another point of view, this one claiming it is actually a useless card. Interesting. But it supports my argument that the card is not essential to win games, yes. The point remains, it is ridiculous in comparison with other readying attachments, especially Steed of the Mark. But others, including events, too, even though they do not come off the same sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336981","commentId":1336981,"userName":"Mndela","timestamp":1416222793,"content":"For example, yesterday in Dunland Trap 4 players. All of us at the limit, in 3b, with a lot of Dunland enemies...\n\nPlayers had the next heroes:\n\n1. (me) Glorfindel spirit · Denethor · Idraen\n\n2. Beorn · Eowyn · Frodo\n\n3. Elladan · Elrohir · Eleanor\n\n4. Balin · Dain · Sam\n\n \n\nThe player with twins + eleanor put into play the UC saying 'who wants?' , and the other players reply 'don't you have something tactics?', lol. We prefered something that increases our attack or tactics events with direct damage instead UC. Of course, we had plenty of enemies. And he was the only player with tactic cards (we wanted tactics cards, no UC), and the player with Beorn didnt have any tactic card (for example, he play Emery hability) in deck.\n\nReasons: Glorfindel had Valinor, Idraen always can be ready (a lot of ways to explore locations during the game), Denethor..., ok it could be good, but we needed kill enemies just now!\n\nBeorn, can't be attached, Eowyn (are you kidding me?), Frodo...poor player, he had 40 threat atm\n\nElladan, useless... he had not weapons, Eleanor...pfffffffff, Elrohir..., it was the better option, but he could get one miruvor of mine, and parting gifts from balin (he had 7 resources on him)\n\nBalin... for?, Sam... what? Dain ..., finally we attached UC on him cause of his high defense and hitpoints, but only because the player with UC hadn't any tactics card in hand (and true, in fact, Dain didnt need UC for the rest of the game).\n\nEdited November 17, 2014 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1336988","commentId":1336988,"userName":"Mndela","timestamp":1416223171,"content":"This is good example how UC is worse than other cards:\n\n \n\nMiruvor on Elrohir : for 1 cost you can ready the hero 2 times (using his ability of paying because miruvor also gives you a res)\n\nUC: for 2 cost you can ready the hero only 1 time\n\n \n\n...yes ok, Miruvor only is for 1 ocassional use, and UC if for all the game..., but the games usually are of 4 or 5 rounds, no more. And you dont need ready the same hero each round.\n\nIn some moments, the hero hurry be ready just this round, and sometimes UC is too expensive to put into play so fast..., Miruvor then is more better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1337085","commentId":1337085,"userName":"FetaCheese","timestamp":1416229910,"content":"> And, of course, nerfing UC won't hurt anything. Except the very inexperienced players, maybe, as I said above. Fetta, you completely contradict your two arguments. In one ythat the broken decks do not use Courage, in the other you say that nerfing it would destroy the game. One can make a great deck without Courgage, no problem. No need for the Tactics Boromir either. Just browse the strategy sections here and there a little. I have not been using it -- at all -- because it seems like cheating. But I would like to use it legitimately, following the rules. The game would only gain for it as the designing space would gain breath.\n\n \n\nI do not see the contradiction here because UC to me isnt just about power levels but rather the variety in deckbuilding that'd be lost if it got nerfed. \n\n \n\n \n\nWhat I meant was that UC allows decks that aren't Dwarves and Outlands to bridge the gap with those tier 1 decks that rarely use UC themselves (since UC isn't as gamebreaking as you make it sound). Players would have to come up with alternatives due to UC being 1 per deck, so other reading effects would become much more precious, Boromir being king among them and one of the most played heroes already. UC being nerfed ruins the game because its VITAL to the game's variety with the current card pool being limited as it is. Gandalf/Elrind decks, outlands and dwarves would be unchanged practically, while everytning else would suffer. Whole deck archetypes could potentially be erased, like superhero attachment ones. \n\n \n\n \n\nUC restricting design space is mostly a myth. All readying attachements except for steed of the mark have found their place in decks and there is more mount support incoming for rohan decks. Afterall not all cards can be equal. Changing UC now is to the game's detriment at this point in time. The game is balanced around it.\n\n \n\nUC feels like cheating? Really? Then what does Dain and Outlands feel like? Why does noone argue against Test of Will, a much more powerful card that is essential in the majority of decks and which is still to this day UNIQUE while UC is not? What about Blue Mountain Trader?\n\n \n\nEdit: I assure you I play this game a lot. A LOT. And I have never felt UC broke the game. Powerful yes but not broken. Hell sometimes, I dont even bother putting all 3 copies in a deck, I often use just 1 or 2 and its more than enough, so my experience says its not in need of errata. But I am not a spike type of player. I dont combo it with Dain. \n\nEdited November 17, 2014 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1337119","commentId":1337119,"userName":"Mich the One","timestamp":1416231971,"content":"> Plus, even the errata may be optional. I do not want to make it hard on new players. Play without errata of the strong cards like Beravor or UC (in the future, we hope) till you get better at it and your card pool grows.\n\n \n\nIf the designers make the UC limitation errata optional (as in the FAQ saying: \"you can apply this rule if you want\") then what is the point of the whole operation? \n\n \n\nObviously, the co-op nature renders all the erratas and rulings de facto optional, but the whole point of the official updates is to keep a unified framework for the community and for the designers. If we explicitly adopt the \"use this rule if you want\" into the official rules then what will the default position for future design, rulings etc be? Seems unnecessarily confusing.  \n\n \n\nPerhaps the idea is to create an expanded easy mode which does or does not incorporate certain erratas. But then the easy mode gets less streamlined, which is to the detriment of beginner players. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1337177","commentId":1337177,"userName":"MyNeighbourTrololo","timestamp":1416236466,"content":"> Just silly, really. Hard to believe you play this game at all.\n\nLol!  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nTry harder, kiddo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1337180","commentId":1337180,"userName":"Bullroarer Took","timestamp":1416236731,"content":"UC is pretty valuable in attachment decks. If you want to get rid of that archetype you are entitled to your opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/126947-next-faq/?do=findComment&comment=1337181","commentId":1337181,"userName":"Distractionbeast","timestamp":1416236754,"content":"The more I think about it (and knowing full well this can never happen), the more I think that UC really should be an event.  I'd probably like to see it as a 0 cost event that readies a hero you control.  Here's why:\n\n \n\nIt is probably most comparable to Cram and Swift And Silent.  Swift and silent trades a resource cost for the added secrecy effect of keeping the card, potentially making it the better card in that type of deck.  Cram can be put onto any hero in play, but must be played in the planning phase onto a pre-chosen target.  The drawback of only targeting heroes you control allows Cram and other Leadership effects to reign in multiplayer situations, giving Leadership a bit more ownership over the readying mechanic - which I actually think would be good for the spheres.  This version of UC may still turn out to be a shoe-in for Spirit, but far less game-changing and taking up a card slot which might be better used by more specialized cards, especially in other spheres (Cram, Swift&Silent, Behind Strong Walls, etc.).\n\n \n\nThematically, I think it makes more sense to play UC as an event, since it would be more unexpected to play directly from the hand to aid a specific situation and in multiplayer could \"unexpectedly\" turn the tide of a battle or quest from the perspective of other players.  \n\n \n\nIf 0 cost turns out to be too cheap, and 1 is too much, I'd look at adding either \"... and raise your threat by 1\" or \"... then add UC to your victory display\".  UC is still an iconic effect and I'd hate to over complicate it unnecessarily.\n\n \n\nThat's my say.  Let the flaming commence."}]}