{"url":"https://community.fantasyflightgames.com/topic/127126-versus-games/","title":"Versus Games","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1334921","commentId":1334921,"userName":"Bullroarer Took","timestamp":1415998392,"content":"I love LOTR for theme and scratching my solo itch, but from time to time I look at the 1v1 games and wonder if I should try one.  Those of you who have experience with any of the other LCGs please weigh in and say what you like and dislike about the other LCGs.\n\n \n\nFor my part I am really drawn to the Cthulhu mythos and the roaring 20s vibe, but there are SOOO many cards out already and it doesn’t have a very big following in my area from what I can tell.  Netrunner and Thrones seem to be one and two here, but the theme of Netrunner leaves me cold.  Of course Thrones has a reboot coming so I could (and probably will) move in on the ground floor.  But I would still like to hear other’s opinions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335017","commentId":1335017,"userName":"Thanatopsis","timestamp":1416002355,"content":"I play the Star Wars: LCG\n\n \n\nIf you research this game, the first controversy you will find is the objective set system. Honestly, it's not better, it's not worse, it's just plain different. And, you may be the type of person that likes it or hates it.\n\n \n\nI love it because it allows for a strong thematic tie-in and it can actually be harder to deck build. Instead of rating individual card value you are now rating individual card value and that card's value within a set.\n\n \n\nThat mechanic aside, I like the speed and theme of the game. Heck, the world championship was won with the trench run card that successfully blew up the death star!\n\n \n\nI can chat about the game some more if you like, but I urge you to at least research the game and watch a few games on youtube."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335108","commentId":1335108,"userName":"Khamul The Easterling","timestamp":1416006026,"content":"Hey;\n\n \n\nI am also for Star Wars LCG.  I own it and some expansions and it is a very good game.  As good as LOTR is, I do like a little variety so just this last summer I did a lot of researching on all the LCG's and decided on Star Wars.  When I play board/card games its either just me alone or with my one good gaming friend.  I looked most of them:\n\n \n\nCthulu - Worst ratings, older game, don't like the theme a whole lot, just seems like on a lower level then the rest.\n\n \n\nGame of Thrones - My gosh, I calculated the amount it would cost to buy the whole collection right now and its like $3,000-$4,000.....I looked at a fair amount of gameplay videos and it just didn't seem that great and it also seemed like it's better with more than 2 people.  \n\n \n\nNetrunner: This one looked pretty cool.  However, I am totally with you on that I don't like the theme at all.  Computers and electronics are not something I think is a good theme for a game.  I like more medieval type games.  Another reason I didn't get this one is because when I compared Netrunner and Star Wars and asked which was more fun with just Core set and few expansions almost everyone said Star Wars is a better out of the box game and it would be great even if you didn't have the whole collection.  \n\n \n\nStar Wars is the best \"side game\" to LOTR where its really fun and you don't have to sink so much money into it.  So I bought it and I think its a great game.  My board game friend and I almost always play it when we get together.  I also highly recommend watching some tutorial and game videos of it.  If you want to ask me any questions about the Star Wars LCG and how it plays feel free to do so.  I have about 50 games under my belt.  \n\n \n\nHope this helps,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335158","commentId":1335158,"userName":"MyNeighbourTrololo","timestamp":1416008907,"content":"Opposed to the previous dude, I own and enjoy Call of Cthulhu LCG. It has a lot of strategy and stands out, compared to other competitive card games I've played, and I've played: Warhammer Invasion LCG, Android Netrunner LCG and Star Wars LCG.\n\nBut I also enjoy a lot the Cthulhu mythos itself and its other boardgame incarnations.\n\n \n\nAndroid netrunner stands out because of it's non-mirrored style - gameplay dramatically changes between corp and the runner.\n\n \n\nWarhammer Invasion has this medieval feel being mentioned previously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335196","commentId":1335196,"userName":"Raven1015","timestamp":1416013215,"content":"I've played both AGOT and Netrunner, although keep in mind that I only own the Core Sets for both. I actually really like both of them.\n\n \n\n* Netrunner: I totally get why it's so popular. If I had more free time than I do, then I'd probably get more involved in it. The asymmetrical play is cool, and the whole \"bluffing\" and mindgames aspect is so different than I've experienced in any other card game. However, if you're not feeling the theme, then no matter how good the gameplay is, it's probably not for you.\n\n \n\n* AGOT: I really love AGOT, probably more than Netrunner. I only have the Core Set, and I've heard things get ponderous with more expansions, and I never got more involved because the buy-in is so huge, but I'm all-in for 2nd edition, and plan on adopting that as my official 2nd LCG (for whatever that's worth). Great strategy in the game and lots of meaningful decisions in almost every aspect. The downside is you'll have to wait about a year.\n\n \n\nAlso, I don't know how tied you are to the idea of sticking with an FFG LCG, but Doomtown by Alderac is essentially an LCG. Plus side, it's just started, so you don't have to worry about a big buy-in. Great strategy and interesting mechanics. If you don't like a theme centered around old West combined with machines/magic/undead, then you might not like it though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335274","commentId":1335274,"userName":"Glaurung","timestamp":1416023131,"content":"If you look for really good and new game is new FFG warhammer lcg. Just come out. Much better the Star wars. I know fanboy will kill me now but that game one of the best versus game I ever seen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335631","commentId":1335631,"userName":"shoreless","timestamp":1416074441,"content":"Yeah, Conquest is very good if you enjoy that theme. It mixes up all the best stuff from the other LCGs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335665","commentId":1335665,"userName":"Bullroarer Took","timestamp":1416076164,"content":"Thanks for the opinions folks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335694","commentId":1335694,"userName":"Thanatopsis","timestamp":1416078344,"content":"I think the lesson here is that none of ffg's lcgs are bad. It all comes down to what theme you want and who else in your area plays the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1335718","commentId":1335718,"userName":"Eryx_UK","timestamp":1416080470,"content":"Star Wars: Played this for the first series of packs and then sold it. Don't like the mechanics and found that it played too heavily into competitive builds. Just not fun to play.\n\n \n\nCall of Cthulhu: Definitely one of the best LCGs and one that needs more love from players. Tough to master but once you do it's a great game to play. But if you aren't a Lovecraft fan you might have trouble getting into it as well.\n\n \n\nA Game of Thrones: Played this for a while and then sold it. Nice idea but I found it suffers from two issues: If you are winning you will be jumped by everyone and if you aren't winning you are just playing kingmaker. \n\n \n\nWarhammer Invasion: Another one bought and sold. Started out well but became bogged down once too many expansions were out and game play was a little bland for my tastes.\n\n \n\nAndroid: Played once and hated it. Couldn't get my head around how it played. Not keen on the source material/concept either though.\n\n \n\nWarhammer 40K Conquest: Only just out but so far seems a lot of fun. Will probably only appeal to fans of the 40K universe though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1336121","commentId":1336121,"userName":"player1922162","timestamp":1416124144,"content":"I've been playing Netrunner casually for the last six months. Initially it was amazing fun, but the novelty has worn off. Have not played the others but was close to buying Star Wars. From what I've read the only one I'd really never get into is CoC despite Eldritch being one of my top three and I get most things Lovecraftian. Conquest seem intriguing but I think I'll hold off for whatever is up next."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1336124","commentId":1336124,"userName":"Glaurung","timestamp":1416124878,"content":"Star wars is good game is fast and have interesting mechanic but  Warhammer is better. I don't like Star wars theme and Warhammer either  but as a gamer i must to say Warhammer is really cool versus game. Take my hat off for Designers...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1336126","commentId":1336126,"userName":"Glaurung","timestamp":1416124922,"content":"The best game for me is LOTR LCG anyway....if MECCG not  die........."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1336132","commentId":1336132,"userName":"booored","timestamp":1416125630,"content":"If your a tolkien fan and looking for a good card game that is not this one.. there is Middle Earth CCG (MECCG). It plays solo, 1v1, TvT and A41. Also it has some of the strongest connections of theme to gameplay of any card game ever. If you're looking at this game and think it is thematic.. you ain't seen nothing yet. It is hard to describe how amazing MECCG is. The big problem is that is a CCG and a old one and a popular one. So it is difficult to get the cards at some kind of reasonable price.\n\nAs for the other LCGs. Call of Cthulhu is by far the greatest LCG in print. That is a game of pure skill and cunning and brutal decision making. It has some of the best deck building ever in card games and THE BEST resource system ever. Only the skilled may apply. This game is for the hardcore.\n\nIf you're looking for a good game outside of FFG then check out DOOMTOWN RELOADED. AEG's reprint of Deadlands. Extremely strong theme, apart from MECCG the strongest I know of and the game (like MECCG) is so unique it is hard to describe without demoing it. The game is almost like a board game as it has a strong area control angle to it. AEG reprinted it in a ECG (Endless Card Game) but it is the exact LCG format, so it is no longer a lame ass CCG. I can not recommend DTR enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1336902","commentId":1336902,"userName":"faith_star83","timestamp":1416212070,"content":"I am quite avidly playing Netrunner, for the exact reason that I also wanted to play a 1v1 card game next to lotr. The theme isn't that bad, I like the film noir-esque flair of the dystopian future the game is set in.\n\n \n\nNetrunner really is a lot of fun to play and it is also quite challenging, because you need to master two completely different play-styles (Runner and Corp).\n\nThere are some design / balancing issues (imho) with the game at the moment, though recent Data Packs have been introducing awesome stuff and the designers remain very creative. As opposed to other card games, however, Netrunner is in large part a mind game and a big part of the game revolves around \"information\". As the Corp you need to plan your moves based on what you think the Runner knows and what kind of tricks you think he has up on his sleeves. As the Runner you need to carefully consider what the Corp might be up to and try and find the weak spots.\n\nThe game has quite a steep learning curve and is quite complex, but once you get used to it, it really is a lot of fun.\n\n \n\nI also looked at agot (Core Set only) and I will definitely buy the new core set and give it a spin. I do love the theme (and books) of asoiaf. Getting into agot now, is no really an option anyway I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337073","commentId":1337073,"userName":"Mich the One","timestamp":1416229061,"content":"> If you're looking for a good game outside of FFG then check out DOOMTOWN RELOADED. AEG's reprint of Deadlands. Extremely strong theme, apart from MECCG the strongest I know of and the game (like MECCG) is so unique it is hard to describe without demoing it. The game is almost like a board game as it has a strong area control angle to it. AEG reprinted it in a ECG (Endless Card Game) but it is the exact LCG format, so it is no longer a lame ass CCG. I can not recommend DTR enough.\n\n \n\nIs Doomtown it any good solo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337240","commentId":1337240,"userName":"Raven1015","timestamp":1416240332,"content":"No, you can't really play Doomtown solo, unless you enjoy pretending you're two different players and playing against yourself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337323","commentId":1337323,"userName":"Mich the One","timestamp":1416243064,"content":"> No, you can't really play Doomtown solo, unless you enjoy pretending you're two different players and playing against yourself.\n\n \n\nThanks. I will give it a pass, then.\n\n \n\nStill, I have to admit I have been guilty of doing the \"two player, one person\" alzheimer type of thing in the past. I know it is popular in the wargaming hobby, and I can actually see why. For some people it is the narrative that is important. It is more enjoyable to recreate a story than to game. I am so glad LotR can do both solo!\n\n \n\nWe need more good solo card games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337329","commentId":1337329,"userName":"Raven1015","timestamp":1416243234,"content":"Yeah, I'll admit to doing the same too. I've even created some basic little solo versions of Netrunner for myself, which are decently fun. Some card games are harder to do it with, though. Like with Doomtown, if you know the little tricks the other deck has in hand, it drains a lot of the fun away.\n\n \n\nDefinitely there's a need for more good solo card games!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337544","commentId":1337544,"userName":"Bullroarer Took","timestamp":1416251835,"content":"So I’ve spent a bit of time reading rulebooks, watching the tutorial videos and watching games from Worlds, Gencon etc.  Cthulhu and Thrones are the two I concentrated on the most.\n\n \n\nThrones – because of the reboot this game becomes accessible to a new beginner.  (Waiting doesn’t bother me.)  In my area there are a lot more Thrones players than Cthulhu players from what I can tell.  What I have noticed with Thrones and also heard a number of comments that seem to confirm it is that once you get behind it’s really hard to recover.  So the “flop” becomes really important.  The TC guys very frequently pick the winner of a match correctly just from seeing the flop.\n\n \n\nCthulhu – The meta size in my area appears to be non-existed, but I’m still looking.  I tried to play it on Lackey and after waiting for 2 hours I finally found a game, but he didn’t have the most recent card set and couldn’t see my cards.  (I was net-decking obviously.)  It took us so long to get on the same page that my window of opportunity closed.  Still, the game appears to be incredibly deep and the resourcing is nothing short of inspired.  The size of the card pool is huge, but they guy who took second at worlds basically built his deck from one expansion box.  (That can be interpreted as both good and bad.)\n\n \n\nI’ll probably play around with both of these games a little more and then end up waiting for Thrones.  (Unless I find a Cthulhu group.)  I prefer paper to on-line and there is a semi-regular thrones group in the area.\n\n \n\nThanks for the info folks and I'm still listening if someone has more to say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127126-versus-games/?do=findComment&comment=1337733","commentId":1337733,"userName":"Olorin93","timestamp":1416260401,"content":"I played Netrunner with an acquaintance two or three times and I just couldn't get into the theme. I don't mind Scifi at all, but I found the gameplay less engaging than most other boardgames - and, having played LotR, I missed the cooperative aspect. I did get 6 out of 7 victory points and nearly beat my opponent the first time I played, though - beginner's luck, he called it (I was corp)."}]}