{"url":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/","title":"A challenge to the paradigm","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1338936","commentId":1338936,"userName":"l3afonthewind","timestamp":1416338134,"content":"So I’ve been mulling this thought over for a while, and imagine it’s gonna cause waves, but I’m interested in what you all think.\n\n \n\nSince the beginning of this game, certain things have been true about the strengths of the spheres: Lore heals and draws, Tactics is a murder machine, etc. One of these long-held notions is that when it comes to questing, the Spirit sphere is king. Here comes the wave: I hold that this is no longer the case, and that Spirit was usurped a while back. By Leadership.\n\n \n\nLeadership is actually the questing sphere. Before you kneejerk and flame me, let me elaborate.\n\n \n\nWhen I say “the questing sphere,” I specifically mean the sphere that most effectively rallies large amounts of willpower to progress the quest (Battle and Siege quests aside, as they are distinct exceptions to the rules). At this point in the game, I have played around with the different spheres a lot, and I have definitely noticed that any time I’m throwing big numbers in the Willpower column, it’s due to a leadership card, or leadership tricks. Now, I won’t argue for a moment that Spirit doesn’t have the strongest questers on the single character level. Eowyn, Glorfindel, and a few others are packing 3+ printed willpower and bring to bear fantastic utility for questing.\n\n \n\nWhat sets Leadership apart from Spirit in the questing arena is the amount of consistent, cheap, and most importantly, static stat boosts that sweep the whole table instead of lean on a few individually strong questers. Heroes like Dain Ironfoot and Celeborn ensure that Leadership is doing its thing from turn one. Similar effects like Visionary leadership and my personal favorite, Sword that was Broken are relatively cheap and provide similar static and sweeping effects to characters within its target audience. What makes these sweeping boosts so effective is that one of leadership’s other strengths is ally mustering. Between the resource ramping, and “cheating” tricks like A Very Good Tale, the amount of allies you can belch onto the table to take advantage of the static boosts is huge. A smaller boost to more characters gets you more bang for your buck than a larger one on a single character (isolated situations aside), which leads me to my next point.\n\n \n\nAll that said, Spirit is still good at questing. It does have some of the power questers, and arguably has the most tricks to play with that affect the quest phase. However, the willpower boosts available to Spirit are fleeting affairs that can provide large surges of will power, at the cost of repeatability and cost. I’m speaking here of things like Astonishing Speed, Untroubled by Darkness, Lay of Nimrodel, and cards like it. They are either expensive and hard to repeat, or so situational it is tough to build around. Further, since Leadership has so much action advantage in sphere, not only is Leadership capable of putting up bigger willpower numbers, but it does it in such a way that their characters can do (and are actually worth doing) other things afterward.\n\n \n\nIf you were to build a pure Spirit deck whose only aim was to amass willpower, and I did the same with Leadership, I can promise the Leadership deck would bring in more willpower to most quests, ally hate quests aside. However, since we’re not limited to one sphere, I find a Leadership-Spirit deck provide the fastest willpower ramp, but Leadership does the heaviest lifting.\n\n \n\nIn a recent interview ( I want to say with Team Covenant, I wish I could remember which so I could cite it), an FFG designer brought up a cool point that faction separation doesn’t mean each faction has monopolies on competencies, but that certain things are easier or cheaper for certain factions to do than for others. I think that’s the case here. Leadership has trounced Spirit in questing. I am not negative on Spirit, mind you. Spirit is great for threat management, location control, and hard counters for the encounter deck. Back in Mirkwood, I would have included questing at the fore of that list, but things have changed.\n\n \n\nThoughts? What have your experiences been when trying for a dedicated questing deck?\n\n \n\nPS-I'm going to post this to BGG, too, if you want to follow the whole discussion.\n\nEdited November 20, 2014 by l3afonthewind"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1338957","commentId":1338957,"userName":"MyNeighbourTrololo","timestamp":1416339069,"content":"Well, leadershit was extremely strong at questing since the core set, due to existance of Faramir, the main questing engine... and the nature of the sphere itself (lots and lots of allies)...\n\nAnd let's not forget the Sword that was Broken.\n\nEdited November 18, 2014 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1338963","commentId":1338963,"userName":"Bullroarer Took","timestamp":1416339177,"content":"No argument from me, and I think that the title expressed it best.  It was a paradigm shift that occurred after the first cycle.  Why is another question.\n\n \n\nEdit:  Faramir is a great point that I had forgotten.  (Even though I use him a lot!)\n\nEdited November 18, 2014 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1338979","commentId":1338979,"userName":"Thanatopsis","timestamp":1416339850,"content":"You are correct, but I think the counter point comes down to semantics. \n\n \n\nLeadership is the best at ally mustering and global stat boosts. It just so happens that these qualities allow it to contribute a lot of willpower.\n\n \n\nAnother semantic detail, Leadership may be the best at contributing willpower. But, Spirit is still the best at questing. Questing is more than straight will power. Spirit has the ability to counter when revealed effects, surge, etc. in addition to putting up a healthy amount of willpower. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1339127","commentId":1339127,"userName":"joezim007","timestamp":1416346747,"content":"My only issue with Leadership being the top willpower sphere is that you need to build for it: Dwarves or Gondor (Celeborn's boost is too temporary). And then, you also need to include Aragorn + Sword that was Broken, Visionary Leadership, and/or Faramir. Dain really just needs Dwarves, but can still use the help of these other cards.\n\nWith Spirit, you're not as limited in some ways. You can grab almost any three heroes and have a decent head start, then put in almost any allies and build up quickly and definitely don't need to restrict themselves to a trait. Obviously there are some combinations that work a lot better than others, but that's always the case.\n\nSo, definitely, with the right cards, Leadership is amazing at building up willpower, but Spirit can do it with less restriction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1339831","commentId":1339831,"userName":"l3afonthewind","timestamp":1416409851,"content":"Haha, ****, you guys are too agreeable. Here I thought it was a subversive thought. Totally agree though. I guess it's better to say that Leadership brings the heat in willpower, not in all aspects of questing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1339886","commentId":1339886,"userName":"alogos","timestamp":1416414129,"content":"Spirit is king in threat control. Leadership was a very versatil sphere, but is really broken in something that only spirit and to a very minor extense lore was able to do with use of sneak attack gandalf for threat reduction.\n\nBy allowing leadership to access too strongly in srong point allowed to other, it has somewhat becomes the main sphere, overstepping its boundary.\n\nTake the exemple of Tactics. It is the stronger in term of dealing with enemies. So big success here.\n\nAnd in my opinion, Tactics should be able to access some few threat reduction cards, like it had acces to card draw with Foe-Hammer. That was very smart design. Spirit and Lore already have some sort of enemies managment. And now, with Mablung Tactics will have a second ressource managment. Theoden, Legolas, Merry and trained for war can be considered some kind of quest management.\n\nI'm quite please that this gap in sphere are smartly dealt with. Just waiting for a threat reduction one and the sphere will be perfect...\n\nI'll left other sphere analysis for others.\n\n \n\n \n\n(oh my, there is also ever onward... did you guys remember this card ever existed ?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340002","commentId":1340002,"userName":"joezim007","timestamp":1416422402,"content":"> Haha, ****, you guys are too agreeable. Here I thought it was a subversive thought. Totally agree though. I guess it's better to say that Leadership brings the heat in willpower, not in all aspects of questing.\n\nYea, once Visionary Leadership came out, I knew Leadership Gondor could definitely be the best questing in the game. I rarely even needed Faramir because Sword that was Broken + Visionary Leadership gave practically everyone in the deck +2 willpower, which put Faramir and 4wp, so rarely did I quest with enough guys to make his +1 for everyone any better than his 4 he contributed normally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340086","commentId":1340086,"userName":"leptokurt","timestamp":1416428602,"content":"No, leadership is not better in willpower than spirit. I don't see a paradigm shift here, as the purple sphere is simply doing its thing. Leadership was always meant to boost character stats. Steward of Gondor, all these Dunedain attachments, Sword that was Broken, Faramir, Boromir, Dain, Thorin etc. - all these cards provide some extra power to other cards.\n\n \n\nSpirit still exeeds all other spheres at offering WP by far. A quick comparism of ally stats makes that pretty clear. So if you wanna max your WP value, you play spirit and splash in some Songs of Wisdom plus Faramir (or some of the other WP boosters)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340645","commentId":1340645,"userName":"alogos","timestamp":1416476234,"content":"The problem is that Willpower boost from Leadership far exceed the Willpower stats on Spirit.\n\nGlobal boost + lot of small affordable ally = madness\n\nYes, leadership is definitly better in willpower than spirit. Never have I seen such high willpower score than when playing leadership. The only times spirit got close was because of ethir swordmen that include all other outlands of different sphere, so not spirit only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340686","commentId":1340686,"userName":"booored","timestamp":1416482093,"content":"Farmimer is and always has been the most powerful questing agent in the gamer period."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340694","commentId":1340694,"userName":"leptokurt","timestamp":1416482861,"content":"> The problem is that Willpower boost from Leadership far exceed the Willpower stats on Spirit.\n> \n> Global boost + lot of small affordable ally = madness\n> \n> Yes, leadership is definitly better in willpower than spirit. Never have I seen such high willpower score than when playing leadership. The only times spirit got close was because of ethir swordmen that include all other outlands of different sphere, so not spirit only.\n\nNo.\n\n \n\n1) Leadership needs time to build up their WP. The first two turns are crucial in most scenarios, and a spirit deck still offers the most WP at this point of the game. No one cares if you have 30 WP or 40 WP on turn 15.\n\n \n\n2);Leadership is dependend on certain cards showing up. And these cards are limited to certain traits or characters. So if you don't get Faramir, if you don't get Visionary leadership, your allies will sit there, dwiddling their thumbs.\n\n \n\n3) Faramir combined with spirit allies is still better than Faramir combined with leadership allies.\n\n \n\n4) Let's not forget that a low threat level means that you can send more characters to the quest, without risking to be slaughtered afterwards. With a threat of > 25 you can send everyone to the quest in most of the new scenarios without risking to engage an enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340728","commentId":1340728,"userName":"Distractionbeast","timestamp":1416485917,"content":"The way I've always thought about it is that Leadership is the sphere of global effects or mass effects.  In other words, it doesn't have many single allies or heroes that quest well, but it has ways of mass-boosting a group of characters.  I'm not saying this is absolute, but it's certainly the impression I've gotten about the design intentions behind the sphere.  \n\n \n\nThe same goes for combat.  Leadership is obviously not the best at combat, but it has ways of boosting groups of characters to make them combat-worthy.  Again, this is not absolute, but especially in the core set I see what appears to be intent.  I'd still consider Spirit the sphere of questing because it's characters and events are more individually oriented to do it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340755","commentId":1340755,"userName":"alogos","timestamp":1416489239,"content":"> 1) Leadership needs time to build up their WP. The first two turns are crucial in most scenarios, and a spirit deck still offers the most WP at this point of the game. No one cares if you have 30 WP or 40 WP on turn 15.\n\nThis is another topic. Leadership can also defends itself in it. Another debate nonetheless.\n\nAlso we have seen Sam, Aragorn I and Celeborn with Denethor ally or Galadriel Ally, that defends themself quite good (if not for Eowyn, it is the better starting sphere for willpower !).\n\n\n\n> 2);Leadership is dependend on certain cards showing up. And these cards are limited to certain traits or characters. So if you don't get Faramir, if you don't get Visionary leadership, your allies will sit there, dwiddling their thumbs.\n\nIrelevant. You could not draw your strong spirit allies. Spirit may be more stable, but again, this is another topic.\n\n\n\n> 3) Faramir combined with spirit allies is still better than Faramir combined with leadership allies.\n\nThat's true. I completly agree. Leadership strong point is the stat bonus, and the subject at hand is that it overshadow all other sphere by doing so. Not just Spirit and its brute questing power. The point is that Leadership is overstepping its bounds.\n\nI'm considering each sphere individualy, without mixing them. Wanting to max something and ending up to splash some Leadership is totaly fine. That's why we are having different answers, we are not talking with the same basis.\n\n\n\n> 4) Let's not forget that a low threat level means that you can send more characters to the quest, without risking to be slaughtered afterwards. With a threat of > 25 you can send everyone to the quest in most of the new scenarios without risking to engage an enemy.\n\nThis is another topic. Leadership can also defends itself in it. Another debate nonetheless.\n\nConclusion :\n\nGiving a generic scenario in a random turn, Leadership has cards that are better than other sphere to do what other sphere should do. This is due to stats bonus cards being quite strong and other combo (like sneak gandalf). It cannot be superior in all point, but being superior in strong point of other sphere is what is wrong.\n\nWant to quest ? Gondor/Dwarf armies > spirit\n\nWant to draw ? Sneak gandalf > almost all, praise mithrandir advice to defend the lore sphere here.\n\nWant to deal with enemies ? Gondor/Dwarf armies > tactics\n\n(Remember that I'm still talking about monosphere deck)\n\nOutlands are another deal... and can be considered almost leadership with Hirluin\n\nSo, what happen when you mix spheres ? Leadership is far too powerfull in helping. It's a thin line because Leadership is a sphere of helping, but helping better than other sphere ? Well, this is paradigm shift and it happens in brute quest power.\n\nWhat is good is when there is condition to triggered effect. Valiant Sacrifice is good, because it has a trigger and although it is not lore and a powerfull card draw, this card fit well in leadership and is not overpowered. Same with Ancient Mathom and Foe Hammer. This is the type of card I want, it doesn't count has paradigm shift."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340803","commentId":1340803,"userName":"leptokurt","timestamp":1416492655,"content":"@ alogos: you're really making good points, and I certainly can agree with your conclusions.\n\n \n\n \n\nWith all that has been said, I'm a bit worried about leadership getting too strong in what it's doing. Just played Celebrimbors secret the first time and was quite surprised how easily my Denethro/Boromir (leadership)/ Mablung deck could defeat the scenario, despite having up to 5 locations in the staging area at one point.\n\n \n\nComparing all 4 spheres, leadership is probably the most uncomplicated one. It generates tons of resources, has some awesome and straightforward event cards, the only really weakness are their allies (compared to other spheres). Like I said, leadership has probably become too strong. Perhaps that's why I played merely with the other three spheres for a long while, my current Gondor deck and Celeborn being the exceptions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1340830","commentId":1340830,"userName":"joezim007","timestamp":1416494639,"content":"> Faramir is and always has been the most powerful questing agent in the gamer period.\n\nEh. Sword that was Broken is just as powerful and doesn't require you to exhaust a character that has decent willpower in order give willpower to others. Visionary Leadership affects more than one player's characters and has the greatest potential for willpower boosting assuming other players are also heavily using Gondor allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1341017","commentId":1341017,"userName":"booored","timestamp":1416501978,"content":"yeah but it is massively restricted by requiring aragorn to be in play.\n\nleptokurt has the truth of it. Spirit wins hands down for starting power. Those initial turns at the start which are so important."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127365-a-challenge-to-the-paradigm/?do=findComment&comment=1341620","commentId":1341620,"userName":"shoreless","timestamp":1416536907,"content":"Keep an eye out for the next episode of TGC ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}