{"url":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/","title":"New and wanting to play Multiplayer","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/?do=findComment&comment=1343914","commentId":1343914,"userName":"WillisRBC","timestamp":1416752462,"content":"Hey guys, as I've mentioned in other threads, I have a single core set and myself, my son, and my fiance that are interested in playing.  What would I need to get, besides a second core set, to be able to make a third decent deck to play the game with 3 players?  I'm interested in the campaign option in Black Riders as well, but I don't know what it has in it as far as deck creation is concerned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/?do=findComment&comment=1343942","commentId":1343942,"userName":"Teamjimby","timestamp":1416755891,"content":"The campaign is going to be very hard unless you buy many of the other expansions.  If you haven't already, you should check out the new player guide [http://talesfromthecards.wordpress.com/new-player-guides/] on the Tales from the Cards blog.  You could definitely make 3 decks with just 2 core sets, but they won't be able to do any of the more recently released quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/?do=findComment&comment=1343959","commentId":1343959,"userName":"Scroll Lock","timestamp":1416757893,"content":"Maybe Khazad Dum will be a good purchase, if you dont want to invest too much money to this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/?do=findComment&comment=1344106","commentId":1344106,"userName":"FetaCheese","timestamp":1416771512,"content":"Khazad Dum and the last 3 packs of the Dwarrowdelf cycle are a great starting point for building up respectable decks. Then I'd grab Dain Ironfoot and the 1st Hobbit expansion for its dwarven player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127661-new-and-wanting-to-play-multiplayer/?do=findComment&comment=1345131","commentId":1345131,"userName":"TheRealGreenman","timestamp":1416855559,"content":"I agree with the above post. The cheapest way to get some fully useaful decks (and by that i mean some decks that can get real odds of winning most quests) are Dwarves. The good thing is that you can easily make decks that work together and compensate each other. Just get Dain, Kazad and both Hobbit boxes and you get most of the best dwarf cards."}]}