{"url":"https://community.fantasyflightgames.com/topic/127859-lost-realm/","title":"Lost Realm","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1346927","commentId":1346927,"userName":"Qaanaaq","timestamp":1416962359,"content":"Maybe my tastes are not like the majority, but even if i enjoy the saga expansions, \n\nI cannot wait how the story comes to an end in VoI, and I am so thrilled to get some spoiler article about the Lost Realm! \n\n \n\nThe story is what counts. Its interesting why have some games not yet inspired some storytelling?\n\nI was thinking to make a playthrough series with a voiceover, a story generated by the events in the game.\n\nIt could make even a lost effort very nice. \n\nEdited November 26, 2014 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1347155","commentId":1347155,"userName":"booored","timestamp":1416979952,"content":"Cool. I have often thought of doing this as well.. not this game as I do not think it is thematic at all and story is like not even in the ballpark for this game. Still I have written narratives that read like a book or w/e with conversations and everything based on Arkham Horror games and stuff, so I know that games can inspire people in this way.\n\nYou should definitely do this. It is fun, the games become etched in your memory and I think a lot of people on this forum would get a kick out of it.\n\nClipboard_1.jpg [http://s10.postimg.org/jiah15ae1/Clipboard_1.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1347161","commentId":1347161,"userName":"Raven1015","timestamp":1416980960,"content":"If storytelling is your thing, I do some session reports that mix storytelling with gameplay description. Here's one for a Dwarrowdelf Campaign:\n\n \n\nhttp://talesfromthecards.wordpress.com/2014/09/17/dwarrowdelf-campaign-the-redhorn-gate/ [http://talesfromthecards.wordpress.com/2014/09/17/dwarrowdelf-campaign-the-redhorn-gate/]\n\n \n\nAnd I've also done one for each of the Saga quests (currently up through Ring Goes South).\n\n \n\nThat being said, I think more people should incorporate story!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1347338","commentId":1347338,"userName":"shoreless","timestamp":1417004450,"content":"Hear Hear!\n\n \n\nI feel as though Celebrimbor's Secret did an excellent job of showing narrative without  a lot of extra flavor text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1349610","commentId":1349610,"userName":"Otherworlder","timestamp":1417191467,"content":"Sometimes with the right combination of quest and deck, it becomes a story too good not to tell. For me one of the best in terms of storytelling is probably Steward's Fear. Just so many name drops and little details, and the locations (the tavern, the sewer, the Houses of the Dead, so wonderful) set the mood so perfectly, and of course the art really helps. In fact I felt like I have to go into this quest with a thematically appropriate deck, so I built a mono-lore Denethor-Aragorn-Mirlonde, with lots of palantir-assisted scrying by Denethor and Aragorn resetting and saving the day when threat gets too high.Everything just linked together into a wonderful and intricate story in my head as I played. In fact I am now working on a fanfic based on it.The fact I got slaughtered by the quest and still am trying to beat it probably helped with motivating a fanfic (where I definitely get to win). :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited November 28, 2014 by Otherworlder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1356494","commentId":1356494,"userName":"Epi Lepi","timestamp":1417708566,"content":"Well they changed the upcoming page to say Q1 2015 for Lost Realm. That's... something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1356872","commentId":1356872,"userName":"Catastrophic09","timestamp":1417727594,"content":"Yeah there's no way it would have ever been here before the end of this year, I bet it will be late Q1 if not Q2 which is fine to me I can catch up on replaying all of this current epic cycle, Campaign stuff and building decks with all the new cards but I am certainly stoked for this next cycle!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1358555","commentId":1358555,"userName":"Crabble","timestamp":1417864251,"content":"Yeah that one was expected because we're still missing Pack 6 of the ringmaker cycle which hopefully will be available before christmas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1360051","commentId":1360051,"userName":"silverthorn","timestamp":1418039947,"content":"> Yeah that one was expected because we're still missing Pack 6 of the ringmaker cycle which hopefully will be available before christmas.\n\n \n\nI hope so. I'm running through the Ring-Maker cycle and I'm hoping not to have to stop for a while until the Antlered Crown (I think that's the name) comes out in the UK."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127859-lost-realm/?do=findComment&comment=1386216","commentId":1386216,"userName":"Noccus","timestamp":1419957204,"content":"Lost Realm is at the printer now.\n\nThey might actully pull off a release in Q1.\n\nThis could be their first on time release!"}]}