{"url":"https://community.fantasyflightgames.com/topic/127875-what-i-want-to-see-in-each-sphere/","title":"What I want to see in each sphere...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/127875-what-i-want-to-see-in-each-sphere/?do=findComment&comment=1347167","commentId":1347167,"userName":"GrandSpleen","timestamp":1416982537,"content":"Thinking mostly about heroes here..\n\n \n\nTactics - I want to see another defensively oriented hero.  Beregond is the man of course, and I don't want to see someone better than him, just another character who does it differently.  Of all the Tactics heroes, Beregond is the only pure defender, and Beorn is the only other tactic hero at all who has a defensive ability (other than Sentinel).\n\n \n\nLore - another hero with a scry.  In the Core set we had one hero for each of Lore's apparent 'flavors' -- healing, card draw, and scry.  Since then we've got *plenty* more heroes with draw abilities, one for healing (Elrond), but none for scry.  I'm longing for that particular spice!\n\n \n\nLeadership - some global trait-based love other than +stats.  Dain, Boromir, Celeborn give us some stat love, and of course that is a fundamental kind of ability.  But how about a hero whose ability reads almost like an Event card?  'When a Rohan ally enters play, that ally may target enemies in the staging area when declaring attacks.'  Or let's pretend To the Eyrie is text on a hero card: 'Response: After an ally is destroyed, exhaust 1 Eagle character to move that ally from the discard pile to its owner's hand.' But put a limit on it per round, or a higher cost.\n\n \n\nSpirit - a hero who can recover allies from the discard pile, perhaps.  Character recursion is a minor theme in Spirit (Caldara, Stand and Fight, Fortune and Fate, and Dwarven Tomb although that is not character-specific).  Or even hero recursion?  A sacrifice ability similar to Landroval: after a hero is discarded, discard this hero to return that other one to play.\n\n \n\nNeutral - a bunch more Creature allies to pave the way for a Radagast hero :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/127875-what-i-want-to-see-in-each-sphere/?do=findComment&comment=1347210","commentId":1347210,"userName":"legolas18","timestamp":1416989043,"content":"What about a Tacitcs Eowyn kinda like this:\n\nEowyn\n\nTactics\n\n9\n\n4\n\n1\n\n1\n\n3\n\nAction: Pay one resource from Eowyn's resource pool to replace her Attack or Defense with her Willpower (and her Willpower with the corresponding value) until the end of the round.\n\nThat way, she could defend one round, attack another, etc.\n\nAnd something like this:\n\nThranduil\n\nSpirit\n\n11\n\n2\n\n2\n\n1\n\n6\n\nAction: Discard one card from your hand to choose a Slivan ally in your discard pile. Return that ally to your hand and deal damage to Thranduil equal to the hit points of the chosen character.\n\nResponse: After any number of cards are returned from your discard pile to your hand or deck, reduce your threat by one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/127875-what-i-want-to-see-in-each-sphere/?do=findComment&comment=1347215","commentId":1347215,"userName":"MyNeighbourTrololo","timestamp":1416989457,"content":"Hungry for the spoil articles, are we?"}]}