{"url":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/","title":"Do you play Fog on the Barrow-downs with Fellowship Frodo?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353178","commentId":1353178,"userName":"GrandSpleen","timestamp":1417476023,"content":"The Fog on the Barrow-downs and The Old Forest quests can be played in Campaign mode and fit into the Lord of the Rings saga campaign.  The rules insert for Fog on the Barrow-down doesn't actually mention using a Ring-bearer, though (I don't know about The Old Forest, I don't have that one).  If you are playing in campaign mode, it instructs you to follow the campaign mode rules from the Black Riders rules insert.  That means using the heroes from your campaign log, which would include your Fellowship sphere Ring-bearer.\n\n \n\nAt the Fellowship event night, we played without Frodo.  We weren't doing a campaign, and nothing directed us to use him, so we just didn't.\n\n \n\nWhenever I play it now, though, I use him whether we're doing a campaign or not.  The reason being that other saga expansion quests in The Black Riders and The Road Darkens are intended to be played with a Ring-bearer, whether you are in campaign mode or not.  Since Fog on the Barrow-downs fits in the campaign, I have been treating it the same way.  That means no Spirit Frodo hero, though.\n\n \n\nHow about others?  Do you use a Ring-bearer when you play these PoD quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353211","commentId":1353211,"userName":"Bullroarer Took","timestamp":1417477972,"content":"Don't have either yet. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353212","commentId":1353212,"userName":"MyNeighbourTrololo","timestamp":1417478020,"content":"I think it can be done both ways. If you have needed saga box - play with Frodo and stuff, you don't - what's stopping you from just playing it as a regular quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353292","commentId":1353292,"userName":"PsychoRocka","timestamp":1417483561,"content":"I play both as Saga quests with the ring bearer and ring present as well as any boons or burdens in my campaign pool thus far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353304","commentId":1353304,"userName":"booored","timestamp":1417484281,"content":"if you playing as part of the campaign with boons and burdens and all that crap you need to use the campaign toons as well. If your just playing it as a stand along thing, then you can't. Though of course nothing is stopping you either way.\n\nEdited December 2, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1353596","commentId":1353596,"userName":"Catastrophic09","timestamp":1417512222,"content":"I thought the follow the campaign rules includes putting Fellowship Frodo into play right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1356713","commentId":1356713,"userName":"Rob_Oz","timestamp":1417718384,"content":"Two answers to this question.\n\n \n\nAt our Fellowship Event in October we did NOT use Fellowship Frodo. Our event was in the Washington D.C. area and we had participants from Maryland, D.C., and Virginia attend. Most did not know one another beforehand, so we couldn't really coordinate campaign stuff (what boons/burdens do we use?) so trying to play campaign mode with Fellowship Frodo would just complicate matters. Moreover, omitting Frodo gave us more time to just get the scenario going.\n\n \n\nAt home playing solo, yes, I absolutely use Fellowship Frodo as the scenario is intentionally designed to be used as part of the LOTR Trilogy campaign. I did the same when I recently received my copy of the Old Forest. Indeed, now that I have The Old Forest, Fog on the Barrow Downs and The Road Darkens I've started the campaign all over again so I can play all eight scenarios in order (SotP, TOF, FotBD, AKitD, FttF, TRgS, JitD, TBotF).\n\nEdited December 4, 2014 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1358488","commentId":1358488,"userName":"Glaurung","timestamp":1417853435,"content":"I have a,question about it.\n\nWith additional hero aa Frodo quest became more easy or not? Thank you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128257-do-you-play-fog-on-the-barrow-downs-with-fellowship-frodo/?do=findComment&comment=1358631","commentId":1358631,"userName":"GrandSpleen","timestamp":1417879064,"content":"I thought about that as well.  There are no cards that target the 'Ring-bearer' or the ring itself in this deck.  It's nice to have the extra body for questing right from the start, and of course you've got access to the Frodo's cancellation effect.  On the whole I'd say he makes it easier.\n\n \n\nThere's just one hiccup.  When I lose this quest, it always seems to be due to threating out.  The treachery Chill Fog [http://hallofbeorn.com/Cards/Details/Chill-Fog-FotBD] forces you to discard all resources, then raise your threat for each resource discarded.  If you have Fellowship Frodo sitting around collecting resources, this one can get nastier.   I started putting songs into my deck just so I could spend Frodo's cash.  But Frodo himself can cancel it, so it's not that bad."}]}