{"url":"https://community.fantasyflightgames.com/topic/128423-pippin-vs-durins-bane/","title":"Pippin vs. Durin&#039;s Bane","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/128423-pippin-vs-durins-bane/?do=findComment&comment=1356241","commentId":1356241,"userName":"sensei yaourt","timestamp":1417690674,"content":"Hellow everyone,\n\n \n\nI was wondering how Pippin (The Black Riders) interacted with Durin's Bane (Shadow and Flame).\n\n \n\nDurin's Bane state : \"Durin's Bane [...] is considered to be engaged with each player whose threat is 1 or greater [...].\" -AND- as an engagement cost of 1.\n\n \n\nPippin's text is : \"Each enemy in play gets +1 engagement cost for each Hobbit hero you control\"\n\n \n\nSo, i obviously control at least 1 Hobbit hero, making Durin's Bane engagement cost 2.\n\n \n\n \n\nNow, my question is : \n\nIs the rule text of Durin's Bane a \"reminder\", clarified for simplicity purposes, that is supposed to be treated as \"Durin's Bane [...] is considered to be engaged with each player whose threat is equal or greater than Durin's Bane engagement cost [...].\" ?\n\n- OR -\n\nIs 1 an absolute value that cannot be changed with the application of Pippin, Take no Notice or anything else with the same kind of game text ?\n\n \n\n \n\nI would tend to favor the former for 3 reasons :\n\n1) Durin's Bane as en engagement cost of 1, Pippin make it 2, and it would make sense that the big bad Balrog don't engage players with a lower threat than its engagement cost.\n\n2) It makes perfect \"role-play\" sense... Pippin is a sneaky hobbit, he can use all his carrot-stealing skills to be unnoticed by the Balrog for a few extra second before all hell break loose.\n\n3) It is better for me and i'm having enough difficulties beating this one as it is, an extra turn before i start loosing and Ally a day could be good.\n\n \n\nYet, the other one makes perfect sense too :\n\n1) Durin's Bane game text explicitely state \"[...] threat is 1 or greater [...]\" and it could very well be because game design intended it to be that way, not because game text was already way too long for the card. That would make the engagement cost of 1 the \"reminder\", not the game text.\n\n2) Pippin is a somwhat dumb hobbit and could very well shout \"AAAAAAAAAHHHHHHHHHH, it's a dragon, run everyone !\" upon seeing the Balrog, giving his position away.\n\n3) Game designers, while i love what they did with this one, are notorious sadist and want it to be as difficult and tear enducing as possible.\n\n \n\n \n\nI'd love to get some kind of official clarification on this one, as well as your take on it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128423-pippin-vs-durins-bane/?do=findComment&comment=1356297","commentId":1356297,"userName":"wlk","timestamp":1417696806,"content":"Strictly following the rules, Pippin has no effect on Durin's Bane text, so I'd say this doesn't change the \"1 or greater\" condition, so you are engaged with the Balrog as soon as your threat is 2 or more.\n\nSame would apply with Take no notice.\n\nAlso note that since the Balrog is \"considered to be engaged\", it doesn't trigger any \"engagement\" effect like Sam's one (by previous official ruling).\n\nEdited December 4, 2014 by wlk"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128423-pippin-vs-durins-bane/?do=findComment&comment=1356477","commentId":1356477,"userName":"GrandSpleen","timestamp":1417707604,"content":"Yeah, even if Pippin knocks the engagement cost up to 4, you'll still be engaged with Durin's Bane.  Just followed the text as written.  The engagement cost still has meaning, though, for cards like Hobbit Cloak, Westernesse Dagger, and so forth."}]}