{"url":"https://community.fantasyflightgames.com/topic/128635-ancient-foundation-does-not-stack-celebrimbors-secret/","title":"Ancient Foundation &quot;does not stack&quot; (Celebrimbor&#039;s Secret)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/128635-ancient-foundation-does-not-stack-celebrimbors-secret/?do=findComment&comment=1359599","commentId":1359599,"userName":"GrandSpleen","timestamp":1417988651,"content":"What is meant by Ancient Foundation's ability \"does not stack\" with other copies of Ancient Foundation?  Does this mean when resolving Scoured effects, you resolve one copy of AF, but ignore others?  Or does this mean you shouldn't count other copies of AF when calculating X...?  \n\n \n\nHere's [http://hallofbeorn.com/Cards/Details/Ancient-Foundation-CS] a link to the card.  The text reads \"Scour: Assign X damage amoung locations in play. X is the number of locations in play. This ability does not stack with other copies of Ancient Foundation. \"\n\n \n\nI tried posting an image of the card from Hall of Beorn, but strangely got the message \"You are not allowed to use that image extension on this community\" (it's a jpg).  Haven't seen that before and I've linked cards from Beorn's site in the past.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/128635-ancient-foundation-does-not-stack-celebrimbors-secret/?do=findComment&comment=1359846","commentId":1359846,"userName":"ricedwlit","timestamp":1418009249,"content":"According to the rules insert for VOI:\n\n \n\nSome cards in The Voice of Isengard expansion have passive abilities with the text “This ability does not stack with...” While two or more effects that do not stack with one another are active, only one of them will affect the game state.\n\n \n\nBased on this I would take it you only assign the X damage once (your first option), no mater how many copies of Ancient Foundation are in play.  I would count every copy of Ancient Foundation when determining what the value of X is.\n\nEdited December 8, 2014 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128635-ancient-foundation-does-not-stack-celebrimbors-secret/?do=findComment&comment=1359850","commentId":1359850,"userName":"GrandSpleen","timestamp":1418009711,"content":"Ahhh, thank you very much.  Somehow, I never would have thought to look back in the VoI rules!"}]}