{"url":"https://community.fantasyflightgames.com/topic/128879-when-does-bofur-s-return-to-hand/","title":"When does Bofur (S) return to hand?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/128879-when-does-bofur-s-return-to-hand/?do=findComment&comment=1363708","commentId":1363708,"userName":"midwestborn86","timestamp":1418280427,"content":"The spirit ally Bofur reads: \"If you quest sucessfully this phase and Bofur is still in play, return him to your hand\". Does this imply that as soon as will power is calculated he comes back or does he come back to your hand at the end of phase? Since ''at the end of the phase'' isn't written I play it where he comes back to your hand right after calculating willpower.\n\n \n\nThis is one of those finicky rules that 99.9% of the time won't matter but I've ran into a couple of scenarios where the number of allies in play effects progress. Dreadful gap for instance. Also say you finish a particular quest stage and advance to a stage that reveals more cards (such as stage 3 of Road to Rivendell). If you run into an \"undisturbed bones\" after Bofur leaves play you may have to allocate damage to allies you wish to keep unharmed. \n\n \n\nIs it correct to bring Bofur back to your hand right after you calculate willpower and determine you quested successfully but before placing progress tokens?\n\nEdited December 11, 2014 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128879-when-does-bofur-s-return-to-hand/?do=findComment&comment=1363733","commentId":1363733,"userName":"JanB","timestamp":1418283644,"content":"Mmm, nice question. Until now i've played Bofur that he goes back to the hand at the and of the phase. But now ... i think i will return him after quest successful and before placing progress tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128879-when-does-bofur-s-return-to-hand/?do=findComment&comment=1363777","commentId":1363777,"userName":"alogos","timestamp":1418291764,"content":"Determining if you quested successfully means that you have counted all willpower, and you will place this number of token on the quest. It's the same number. You don't recount to know how much token you place.\n\nBut you might consider taking it back in your hand before placing token, that seems right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128879-when-does-bofur-s-return-to-hand/?do=findComment&comment=1365370","commentId":1365370,"userName":"midwestborn86","timestamp":1418409910,"content":"I understand that the number you count is the the number you place which is why I asked. It seems since Bofur's text doesn't say at the \"end of the round\" you would return him to your hand immediately after counting willpower and determining you quested successfully but before placing tokens.\n\nEdited December 12, 2014 by midwestborn86"}]}