{"url":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/","title":"Sauron Mode?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364488","commentId":1364488,"userName":"Bullroarer Took","timestamp":1418332703,"content":"If you ever played the Sauron expansion to Knizia’s Lord of the Rings game you probably know where I’m going with this.  Knizia’s basic LOTR game is cooperative like the current LCG with the players are playing against the system.  (In fact I think it is the LCGs spiritual parent in many ways.)  But with the Sauron expansion one person takes control of the dark side and now the system, “Sauron”, gets a brain with some choices over which cards to play when.\n\n \n\nSo imagine that in LOTR LCG.  Imagine that one player takes control of “Sauron” and the event deck.  He draws 6 cards for his opening hand and can take a mulligan.  If there is a set up command for the player to search the encounter deck for a location card, now Sauron does that and chooses the worst for the player instead of the player choosing the best.  Every time the good guys would normally draw a card from the encounter deck, Sauron draws a card, adds it to his hand and chooses which to play.  This includes when Shadow cards are played.  So shadow cards will nearly always be nasty and the worst enemies will always come out.  The game would slow down of course, but now even the simple games become Nightmares.\n\n \n\nWhat do you think?  Are there any potential sticking points?  I’m not thinking about a scoring system yet, just win/loss."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364508","commentId":1364508,"userName":"SauronTheGreat","timestamp":1418333683,"content":"That sounds great!  I also thought that it might be cool if the FFG people would make the game to-sided.  What I mean is that you could play as the evil side instead of the good.  There would be a price on all treacheries, locations, and enemies.  I also have not figured out the details, but bosses would be your heroes.  Instead of spheres, you would have encounter sets.  so for instance, ungoliant's spawn could only by cards from the \"spiders of mirkwood set\".  the encounter deck would be made of various different player cards.  I have often wanted to control the enemies, treacheries and locations that make me so mad when they come out of the encounter deck at the wrong time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364547","commentId":1364547,"userName":"gandalfDK","timestamp":1418335759,"content":"In multiplayer, with 4 persons for.instance, Sauron would only be able to reveal 4 cards the first turn. So with six starting cards, three and four playergames would bust out Sauron within one or two turns upon which Sauron is no longer able to reveal 'enough ' cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364562","commentId":1364562,"userName":"Bullroarer Took","timestamp":1418336800,"content":"@Gandalf - Every time Sauron is supposed to reveal one or more cards he draws that many cards first and adds it to his hand of six.  Then he plays the required number of cards (in the order he choses) down to the original six.\n\n \n\n@STG - I tried to make a system like that work, but there were way too many problems.  The framework of the game fights you.  I would love to see a true VS version of the game, but it needs to be built from the ground up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364572","commentId":1364572,"userName":"Raven1015","timestamp":1418338230,"content":"I think it's workable, just have to fiddle with \"hand size\" of shadow player and scale it based on number of regular players. I also think having the \"shadow player\" always be able to choose the nastiest card with full knowledge would make them too powerful. \n\n \n\nHere's a variant that might be interesting. Keep in mind, I've never tried it, so it could be complete crap as well (this is copied from a reply I made to a similar post on BGG awhile back) and keep in mind this is based on just 1 player:\n\nSo I imagine it like this:\n\n- shadow player draws 3-4 cards at start of game\n- shadow player picks 1 to use for staging that turn (2 if there is surge)\n- shadow player places the rest of his hand facedown into a deck for shadow cards to be drawn from for that combat phase (in the order he chooses). \n- shadow player draws back up to 3-4 at end of round\n\nIn this way, the shadow player has to make some decisions about whether to use that nasty card with a nasty shadow effect during staging or during combat, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364636","commentId":1364636,"userName":"GrandSpleen","timestamp":1418343934,"content":"I tried something like this awhile back,  and figuring out how to interact with encounter card scry effects was a sticking point.  I ended up with a solution where the Sauron player would, at the START of the questing phase, select his cards to play (before characters committed to the quest), and scry effects could target that lineup of cards.  I can't remember exactly how it worked, and it certainly wasn't perfect.\n\n \n\nThe way I did it, the Sauron player ends up being very very powerful, limited by card draw and not by any sort of resources as the players are.  If you want to make it an even fight,  you really need to handicap the encounter deck in some way.\n\nEdited December 12, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364655","commentId":1364655,"userName":"Bullroarer Took","timestamp":1418345508,"content":"> I tried something like this awhile back,  and figuring out how to interact with encounter card scry effects was a sticking point.  I ended up with a solution where the Sauron player would, at the START of the questing phase, select his cards to play (before characters committed to the quest), and scry effects could target that lineup of cards.  I can't remember exactly how it worked, and it certainly wasn't perfect.\n> \n>  \n> \n> The way I did it, the Sauron player ends up being very very powerful, limited by card draw and not by any sort of resources as the players are.  If you want to make it an even fight,  you really need to handicap the encounter deck in some way.\n\nAt what point in the game's evolution did you try this?  (Which card sets were available?)  I think that Sauron would be very powerful this way.  Maybe a 6 card hand is too many,  but some of the player decks are pretty powerful now too except against the hardest of quests.  (But that was the problem in the Knizia game too:  Sauron was brutally powerful.)\n\n \n\nVery good point about scry effects like Hennemarth.  Have to think about that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364726","commentId":1364726,"userName":"GrandSpleen","timestamp":1418354958,"content":"It was probably a year ago... didn't make it outside of my own house.  Dwarves were available, Outlands was not.  The problem was that you needed a very aggressive player deck to have any chance, and even then the 'Sauron' player could destroy if he got the right opening hand (I think I was calling it 'encounter mode' or something, with an 'encounter master' or EM).\n\n \n\nThen I hit upon something though: you could play to win as the EM, or you could consider yourself more like a D&D dungeon master and play... to tell a story, and create a tense experience for the other players.  That's about where I left it off, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1364854","commentId":1364854,"userName":"player1922162","timestamp":1418370151,"content":"I think one possible solution would be to make three draw decks. One for enemies, locations and treacheries. One of them would be the active draw deck at a particular time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365460","commentId":1365460,"userName":"joezim007","timestamp":1418413372,"content":"If giving a player control of the encounter deck makes it too hard for players, then ramp up player power: double the standard card draw and resource generation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365469","commentId":1365469,"userName":"Bullroarer Took","timestamp":1418413709,"content":"> If giving a player control of the encounter deck makes it too hard for players, then ramp up player power: double the standard card draw and resource generation.\n\nGood point.  We could run the quests in easy mode, but with an intelligent encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365611","commentId":1365611,"userName":"joezim007","timestamp":1418419563,"content":"> > If giving a player control of the encounter deck makes it too hard for players, then ramp up player power: double the standard card draw and resource generation.\n> \n> Good point.  We could run the quests in easy mode, but with an intelligent encounter deck.\n\nEasy Mode is slightly different than what I said, but removing the super bad encounter cards would help too. You could also eliminate shadow cards, but that might be taking it too far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365679","commentId":1365679,"userName":"Bullroarer Took","timestamp":1418423316,"content":">  \n> \n> >  \n> > \n> > > If giving a player control of the encounter deck makes it too hard for players, then ramp up player power: double the standard card draw and resource generation.\n> > \n> > Good point.  We could run the quests in easy mode, but with an intelligent encounter deck.\n> > \n> >  \n> \n> Easy Mode is slightly different than what I said, but removing the super bad encounter cards would help too. You could also eliminate shadow cards, but that might be taking it too far.\n> \n>  \n\nI know it was, but easy mode let's you start with an extra resource on each hero and so I made the jump."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365740","commentId":1365740,"userName":"Teamjimby","timestamp":1418427571,"content":"I like the idea of a Race For The Galaxy style resource system for the Sauron player where you pay to play a card by discarding other cards.  Here are some rough ideas:\n\n \n\n* Sauron player draws a certain number of cards each round, like maybe 2 per player. \n\n* During questing, Sauron player plays encounter cards equal to the number of players.  He would choose the cards before characters commit to the quest, so they could be scryed.  By default he plays cards for free (not forced to discard any other cards), but there are extra costs for certain cards.  Extra costs might be 1 to play a surge, 1 to play a unique card or card with victory points, 1 to play a card with the gold border (removed in easy mode).  You could also add a cost for playing multiple enemies or locations on the same turn (so Sauron can't play 4 locations on turn, then 4 enemies the next turn).  So maybe the second enemy costs 1, third enemy costs 2, etc.  He would pay the cost after cards are revealed so the good guys don't know what is coming.\n\n* In combat, Sauron gets to draw one card for each attacking enemy (feints and quick strikes would negate).  He then has the option of playing shadow cards (before defenders are declared) at the cost of 1 per card.  He could also play no shadow cards and just keep the extra cards.  I might also put restrictions on nasty shadow effects like extra attacks and limit those to one extra attack per enemy.  Alternatively, to keep suspense on all the attacks, he could play shadow cards on all attacks, but only pay 1 if there is an effect.\n\n* At the end of turn Sauron would discard to a limit (4 feels about right).\n\n \n\nThis gives Sauron a resource system comparable to the heroes instead of just picking the nastiest card.  It would also limit the ability to completely screw over the players by adding in certain costs.  What do you think?\n\nEdited December 12, 2014 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1365840","commentId":1365840,"userName":"Bullroarer Took","timestamp":1418434404,"content":"I like it Jimby! How many resources per turn do you think Sauron should get?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366047","commentId":1366047,"userName":"Teamjimby","timestamp":1418454131,"content":"Well in the scenario I described, the cards themselves are the resources.  It makes more sense if you've played Race for the Galaxy.  However you could do a similar approach and give Sauron actual resource tokens instead.  I've never tested this idea, so I couldn't add any further hypothesis about how many cards would be appropriate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366374","commentId":1366374,"userName":"OMZA","timestamp":1418487070,"content":"I'm thinking about two different sauron decks, one is autoplayed, with locations and treacheries and, maybe (why not? Just trying to balance the force) blank cards. The other one is only made of enemies and enablers, cards that allow that sauron player to play the enemies that should have now some kind of invocation cost. I'm thinking in some sort of \"discard a location in the staging area to add 2 sauron resources\", and some enemis that could be played in response (like, Avenger, response: after one Orc dies, play Avenger for 0 resources engaged with and attacking the player thatkilled the orc\", just ideas, needed for further thinking and better wording). Sauron player must be able to play cards and effects on each phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366394","commentId":1366394,"userName":"MyNeighbourTrololo","timestamp":1418489576,"content":"You guys tempt me to create a player-encounter-cards-pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366422","commentId":1366422,"userName":"OMZA","timestamp":1418492366,"content":"> You guys tempt me to create a player-encounter-cards-pack.\n\nThat would be much appreciated"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366482","commentId":1366482,"userName":"Bullroarer Took","timestamp":1418497242,"content":"Good ideas developing here.\n\nAs a community we we be interested in FFG developing a cycle that could work this way? (My vote is yes.)\n\nEdited December 13, 2014 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366494","commentId":1366494,"userName":"GrandSpleen","timestamp":1418498397,"content":"They could release a set of guidelines for a new mode of play, much as they have done for Easy Mode and the Race Against the Shadow tournament format.  But I for one would not be interested in buying packs intended to be played competitively."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1366510","commentId":1366510,"userName":"OMZA","timestamp":1418499220,"content":"What about some nightmare-like expansions? In my opinion a lot of things must be changed both regarding rules and encounter deck composition to play competitively, but it could be fixed changing some old cards in old missions and adding the \"second\" playable encounter deck, with the enemies and the events that produce resources or conditions to put enemies into play. Then, some rules must give some power to sauron player to control the attack and risk with, probably, some kind of shadow effects. It can allow even shadow effects detrimental for the enemies, it will be much more interesting and risky the combat phases. Or to substitute the shadow cards for combat action events like current player events."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1367076","commentId":1367076,"userName":"joezim007","timestamp":1418562026,"content":"> Good ideas developing here.\n> \n> As a community we we be interested in FFG developing a cycle that could work this way? (My vote is yes.)\n\nI would be ok with a couple quests, but not a whole cycle because that entire cycle is lost to people who play solo and dont have any friends that play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1367120","commentId":1367120,"userName":"Bullroarer Took","timestamp":1418568883,"content":"When I said a cycle that \"could\" work this way I meant that the game could be played in assuring mode - or not. So the normal way of playing could be used as well. But maybe that would make the quests too easy when Sauron isn't used. If that were the case, then I agree an entire cycle is too much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1367725","commentId":1367725,"userName":"booored","timestamp":1418625185,"content":"people have been talking about a vs game from before it was released. If you can work out some decent rules I think it would be very popular.\n\nIn our game club we run a \"Sauron Mode\" ... basically if you look at the nightmare packs they replace cards in the core and deluxe but the individual cycle expansions do not replace those same cards. \"Sauron Mode\" for us means that the nightmare cards are put in permanently.\n\nEdited December 15, 2014 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1367809","commentId":1367809,"userName":"JanB","timestamp":1418636464,"content":"this game is a coop-game .. sauron mode sucks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1421096","commentId":1421096,"userName":"Bullroarer Took","timestamp":1422218559,"content":"Looks like someone else is trying the idea:\n\n \n\nhttp://www.boardgamegeek.com/thread/1307160/versus-variant [http://www.boardgamegeek.com/thread/1307160/versus-variant]\n\n \n\nBut it doesn't change the basic shortcoming of the concept."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1421100","commentId":1421100,"userName":"Gizlivadi","timestamp":1422218895,"content":"The problem for me is, no way to play solo, unless they make some kind of really big core set that includes free peoples encounter cards and scenarios, as a kind of special product thing. I'd buy the hell out of that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1421338","commentId":1421338,"userName":"booored","timestamp":1422238740,"content":"I meant as a extra level of difficulty above nightmare. Not adding a vs system."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1421570","commentId":1421570,"userName":"MyNeighbourTrololo","timestamp":1422253617,"content":"> I meant as a extra level of difficulty above nightmare. \n\nBUT WRYYYY"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1424859","commentId":1424859,"userName":"jormungandr","timestamp":1422443232,"content":"say what?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1427766","commentId":1427766,"userName":"booored","timestamp":1422619793,"content":"> say what?\n\nWell the nightmare packs replace cards in a given encounter set, right? So when you play a deluxe expansion or a core set quest like you have replacement cards. Well we noticed a while back that when you play a cycle adventure, say \"Return to Mirkwood\" ONLY the \"Return to Mirkwood\" set has replacement nightmare cards even though the entire encounter set also contains cards from the core set.\n\nSo we have a game mode we run that we called \"Sauron Mode\" in which you replace ALL the cards in a given encounter set, not just the cycle pack. To do this you first make the nightmare deck for the 3 base quests, and then use those nightmare mixed sets in addition to the changes you make on the cycle adventure.\n\nWhat you end up with is a much much harder nightmare deck.\n\nEdited January 30, 2015 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1427823","commentId":1427823,"userName":"jormungandr","timestamp":1422625154,"content":"that's really cool! My confusion was aimed at trololo, though. I should have quoted that. Good explanation though, I'll try that out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1429916","commentId":1429916,"userName":"Yenninho","timestamp":1422782289,"content":"I would be more excited if FFG should release a Sauron core set than a pvp mode. The Sauron core set would contain villains and strong enemies who would function as the heroes we have now. Instead of spheres, we have sort of affiliations like mordor, isengard, easterlings... with their own treacheries. The encounterdeck would containthe free peoples en the locations could be places to conquer. It would be just like an evil campaign to slave the free people, take angmar, gundabad, dale, maybe the conquest for rivendell. I think FFG would attract new players with this mode and just make more money, they would have mine :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1429919","commentId":1429919,"userName":"MyNeighbourTrololo","timestamp":1422782675,"content":"That'll be a new game, not a mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1430215","commentId":1430215,"userName":"Yenninho","timestamp":1422809873,"content":"Well, They'd have my approval :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1430542","commentId":1430542,"userName":"jormungandr","timestamp":1422827737,"content":"I would buy that within a heartbeat. Nazgul>any hero i care to mention."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1430835","commentId":1430835,"userName":"booored","timestamp":1422850000,"content":"Agreed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1433377","commentId":1433377,"userName":"jormungandr","timestamp":1422994509,"content":"I 2nd that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1433426","commentId":1433426,"userName":"Teamjimby","timestamp":1422996738,"content":"Didn't they make a Nazul board game that kind of does that?  I don't think it was particularly successful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1433634","commentId":1433634,"userName":"TragicTheBlathering","timestamp":1423005666,"content":"There's a famous co-op board game by Reiner Knizia [http://www.boardgamegeek.com/boardgamedesigner/2/reiner-knizia] called \"Lord of the Rings [http://www.fantasyflightgames.com/edge_minisite.asp?eidm=58&enmi=Lord%20of%20the%20Rings:%20The%20Board%20Game]\". It is in fact a pretty cool game imo, and has been \"remade\" by cryptozoic for the \"Hobbit [http://www.boardgamegeek.com/boardgame/140612/hobbit-unexpected-journey]\" series of games.\n\n \n\npic1654883_t.jpg [http://cf.geekdo-images.com/images/pic1654883_t.jpg]\n\nAnyway the expansions for LoTR are harder to find now, but one of those expansions was called Sauron [http://www.boardgamegeek.com/boardgameexpansion/3819/lord-rings-sauron]. What made this expansion interesting is that the original game was a 100% co-op experience and this expansion turned it into a Team vs Player game. As one player too on the roll of Sauron.\n\nLord of the Rings is often credited as the \"break out\" game that in fact brought co-op to modern boardgaming. There are a few co-ops before it, but it is often cited as the start of this currently very strong genre. It also has the Sauron expantion that was the first (I know of) to switch a co-op into a vs game. We see this a lot. Like Ghost Stories: Black Secret [http://www.boardgamegeek.com/boardgameexpansion/95699/ghost-stories-black-secret]\n\nSo this game is a pretty important one for the hobby and imo, well worth it if you are a LoTR fan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1433679","commentId":1433679,"userName":"Solaufein","timestamp":1423007261,"content":"> Didn't they make a Nazul board game that kind of does that?  I don't think it was particularly successful.\n\n \n\n \n\nWizkids made one, which barely counts. FFG could probably do something darkside for LOTR and make it interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1434845","commentId":1434845,"userName":"Solaufein","timestamp":1423072342,"content":"> There's a famous co-op board game by Reiner Knizia [http://www.boardgamegeek.com/boardgamedesigner/2/reiner-knizia] called \"Lord of the Rings [http://www.fantasyflightgames.com/edge_minisite.asp?eidm=58&enmi=Lord%20of%20the%20Rings:%20The%20Board%20Game]\". It is in fact a pretty cool game imo, and has been \"remade\" by cryptozoic for the \"Hobbit [http://www.boardgamegeek.com/boardgame/140612/hobbit-unexpected-journey]\" series of games.\n> \n>  \n> \n> pic1654883_t.jpg [http://cf.geekdo-images.com/images/pic1654883_t.jpg]\n> \n> Anyway the expansions for LoTR are harder to find now, but one of those expansions was called Sauron [http://www.boardgamegeek.com/boardgameexpansion/3819/lord-rings-sauron]. What made this expansion interesting is that the original game was a 100% co-op experience and this expansion turned it into a Team vs Player game. As one player too on the roll of Sauron.\n> \n> Lord of the Rings is often credited as the \"break out\" game that in fact brought co-op to modern boardgaming. There are a few co-ops before it, but it is often cited as the start of this currently very strong genre. It also has the Sauron expantion that was the first (I know of) to switch a co-op into a vs game. We see this a lot. Like Ghost Stories: Black Secret [http://www.boardgamegeek.com/boardgameexpansion/95699/ghost-stories-black-secret]\n> \n> So this game is a pretty important one for the hobby and imo, well worth it if you are a LoTR fan.\n\n \n\n \n\nI'll echo this. I've whiled away many an hour on that game. The theme is pretty strong for a Knizia game, and it is a blast, even if it can be soul crushingly difficult sometimes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/128927-sauron-mode/?do=findComment&comment=1435135","commentId":1435135,"userName":"Bullroarer Took","timestamp":1423082480,"content":"I wish I mentioned that game in the OP..."}]}