{"url":"https://community.fantasyflightgames.com/topic/129183-otd-caught-in-webs/","title":"OTD &#039;Caught in Webs&#039;?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129183-otd-caught-in-webs/?do=findComment&comment=1368736","commentId":1368736,"userName":"midwestborn86","timestamp":1418702573,"content":"My question is about the card from OTD not to be confused with the core set 'caught in a web'. \"Caught in Webs\" says to remove a character from the quest and make it unconscious. It does not use the word 'then'. If you reveal this outside the quest phase for instance at setup would you still make the character unconscious and try to perform as much of the effect as possible or did they mean for this card to say ''remove the character from the quest, then make it unconscious''?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129183-otd-caught-in-webs/?do=findComment&comment=1368740","commentId":1368740,"userName":"GrandSpleen","timestamp":1418703111,"content":"I don't think you will make anyone unconscious.\n\n \n\nThe exact wording is: \n\n \n\nWhen Revealed: Choose a hero to be removed from the quest and make that hero unconscious. If no hero was removed from the quest by this effect, this card gains surge.\n\n \n\nFirst you must choose a hero to be removed from the quest,  You can't do this if nobody is questing, so you have chosen no one.  No eligible target.  Then you will make \"that\" hero unconscious, with \"that\" meaning the hero who has been chosen.  Since no one has been chosen, no one can become unconscious.\n\n \n\nAlso, the last part, about Surge, makes it look pretty clearly like the designers expected this card to be able to completely whiff, and to provide you with another card in such an event.  \n\nEdited December 16, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129183-otd-caught-in-webs/?do=findComment&comment=1368791","commentId":1368791,"userName":"midwestborn86","timestamp":1418708190,"content":"Gotcha, I realize that now. I tend to be a rules purest and over-think things when I start a new quest and try to get every little kink out."}]}