{"url":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/","title":"On the Doorstep questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1373042","commentId":1373042,"userName":"Dwarf king Bronze beard","timestamp":1419020474,"content":"1. Does Lazy Lob's when revealed effect still work if i have been searched him from the encounter deck at the start of the quest phase because of The Spider's Glade?\n\nffg_lazy-lob-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_lazy-lob-otd.jpg]  ffg_the-spiders-glade-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-spiders-glade-otd.jpg]\n\n \n\n2.Smaug the Magnificent attacks and i defend with my ally which dies, then Smaug attacks again because of shadow card which had riddle effect. Can i defend again with another charecter or is this attack consired undefend? Also if Bilbo Baggins defends against Smaug, can i use Bilbo's magic ring twice when Smaug attacks again and can i defend only once with Bilbo and use his ring, then switch the defender to another charecter if Smaug attacks again?\n\nffg_smaug-the-magnificent-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_smaug-the-magnificent-otd.jpg] ffg_bilbos-magic-ring-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_bilbos-magic-ring-otd.jpg]\n\n \n\n3. When i'm trying burgle and i reveal my topmost card, can i use example daeron's runes to draw the topmost card from my deck into my hand and then reveal another card?\n\n \n\n4. Can unconcious charecters use their attachments or passive abilities like Dain's boost?\n\n \n\nI hope that someone can help me with these  :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]\n\n \n\nAlso i might need some advice for the Lonely Mountain quest  that how i can win it (in singleplayer)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1373191","commentId":1373191,"userName":"SauronTheGreat","timestamp":1419024167,"content":"1. I have always played no, it doesn't activate, after all, it is a \"when revealed\" and your not revealing it, you're searching the encounter deck and putting it into play.\n\n2. Not undefended unless the shadow card specifically says so\n\n3. I heard els ware that you can, but don't quote me on that.  I personally don't see why not\n\n4. No they can't.  The quest card says \"unconscious characters can not attack, defend... Trigger Effects...\" dains ability is considered an effect and so is an attachment.\n\nand on beating the quest, you'll have to tell me what sets you have before I can help you on this one..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1373278","commentId":1373278,"userName":"GrandSpleen","timestamp":1419028351,"content":"Agree with SauronTheGreat on 1, 2, 3 but have something to add about 2 and 3.\n\n \n\n2: You can only use Bilbo once to defend.  He will be exhausted after that defense, so he could not defend again.  You could ready him via Cram or some other card effect, but you still could only use his ring's effect once: the effect requires the ring to be exhausted, and there's no way to ready the ring for a second go.  So Smaug attacks, Bilbo defends, exhausts the ring, then Smaug attacks again and you start all over by choosing a new defender (or declaring the attack undefended-- your choice).\n\n \n\nthere's an action window after revealing the card from your deck.  You can now use any card effects such as King Under the Mountain, Daeron's Runes, etc., to draw it/take it into your hand.  You do NOT, however, reveal a new card.  The card that you just drew remains the 'revealed' card (meaning you can now discard it for 1 guaranteed match during a burgle attempt).  Official word on that was this:  \n\n \n\n------------------------------\n\n\"Good question. The first revealed card remains the \"revealed card\" unless you use the effect on The Lonely Mountain. In order to use the effect on The Lonely Mountain you must take the revealed card into your hand.\"\n------------------------------\n\n \n\n4: It's silly, but there's no reason you cannot use attachments that are attached to an unconscious character.  The character cannot trigger effects (meaning, text written on its own card).  It is the player who triggers an attachment's effect, however, and not the attached character, so the state of the attached character is not relevant.  \n\n \n\nI'm not sure about passive effects since they are very clearly not \"triggered\" effects (there's a passage in the FAQ differentiating \"triggered\" and \"passive\" effects, I believe).  It's an obvious question and one that I can't remember seeing an answer to.  From a strict reading of the card, there is nothing that causes passive text to go inactive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1373909","commentId":1373909,"userName":"Dwarf king Bronze beard","timestamp":1419063434,"content":"I found it:\n\n(1.36) Triggered abilities vs. Passive abilities\n\nTriggered abilities are abilities on cards that have a\n\nbold trigger word such as Action or Response. These\n\nabilities are only applied when they are triggered.\n\nPassive abilities are abilities on cards that have an\n\nongoing effect without a bold trigger word. Because\n\npassive abilities don’t have a trigger they are always\n\nactive and cannot be “triggered”\n\n \n\nThen for Lonely Mountain quest. I meant that i need some gameplay tips since i'm playing with my own campaign rules and i have to use same deck for all six quests, so changing my deck means that i would have to start everything again which wouldn't make me happy...\n\n \n\nAlso thanks for helping me with these :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited December 20, 2014 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1374017","commentId":1374017,"userName":"Dwarf king Bronze beard","timestamp":1419074663,"content":"I have another question concidering stage 2b in the Lonely Mountain quest and Smaug the Golden. If smaug has already 5 progress tokens and i quest succesfully at the stage 2, do i have to advance to the stage 4 and then do burgle test or not?\n\nSorry i can't get any pictures right now so i hope that you can still help me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1374079","commentId":1374079,"userName":"Laco","timestamp":1419078919,"content":"> I have another question concidering stage 2b in the Lonely Mountain quest and Smaug the Golden. If smaug has already 5 progress tokens and i quest succesfully at the stage 2, do i have to advance to the stage 4 and then do burgle test or not?\n\nI have a supplementary question. Progress tokens are still not put on quest card. I do so when I go to stage 4?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1374587","commentId":1374587,"userName":"SauronTheGreat","timestamp":1419111459,"content":"what heroes are you using?  and, if it wouldn't be too much trouble, what about your deck?  we can't easily give you tips unless we know what we have to work with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1374647","commentId":1374647,"userName":"GrandSpleen","timestamp":1419114537,"content":"Let's see..\n\n \n\nIf you are forced onto stage 4 during the staging step (e.g., from the effect on Pretending to Sleep), you can place progress tokens onto stage 4 and, if sufficient, immediately return to stage 2.\n\n \n\nIf you put a progress token onto Smaug the Golden \"after questing successfully,\" I think the intent is that you will place the progress token after you have placed progress tokens on the quest card.  This means you will go to stage 4 after you've already placed progress tokens, and can't immediately return to stage 2 and must face Smaug's fury.  I do not think you should make a burgle attempt either.  You quest successfully, put progress on the quest, then put a progress token on Smaug.  After that token is placed, you go to stage 4, which removes Smaug the Golden from play.  There is still text remaining on Smaug the Golden (\"Then, the first player makes a burgle attempt\") but, because Smaug has been removed from play, the text is inactive.  I would do it this way simply because it doesn't make thematic sense to do it the other way, and I'm pretty sure that's how it was intended to be played.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1374654","commentId":1374654,"userName":"GrandSpleen","timestamp":1419114959,"content":"As for advice on beating it: make your priorities 1) getting a defender to the 8 defense, or 6 with a healing option.  Beregond with his shield is the most obvious choice, but it sounds like you are already locked into some hero choices so that may not be an option.  It is best if that guy is a sentinel as well-- Arwen or Dunedain Signal can help with that.  \n\n \n\nNext, populate your deck with 1) readying effects for that defender, 2) +willpower attachments and effects, 3) allies with 2 or more willpower, and 4) weapons or +attack effects for the final battle.  Number (2) is important because of the +threat effect on Smaug the Golden.  If you have Bilbo as a super quester, Smaug is rendered impotent.  \n\n \n\nNow the big one: you can neuter Smaug if you can remove his shadow cards.  Dawn Take You All is one option, but it is not repeatable, and it is a Combat Action so you can't use it vs. Smaug's attacks if you fail a burgle.  The better option is Rider of the Mark.  Put them into your deck with spirit, and if only one of your decks includes spirit then include in the other deck a Song of Travel (to pay for Spirit) or, if you have dwarves, you can use Narvi's belt.  Your ideal setup, then, is to get one Rider of the Mark onto each side of the table.  Every time Smaug attacks, use the Rider to discard his shadow card, guaranteeing he will not attack multiple times.  Then you have some risk free defense for the character you have made into an uber defender.\n\n \n\nSmaug is immune to player card effects, but his shadow cards are not.  Both Dawn Take You All and the Rider of the Mark do not target the enemy in question.  Also, both of these require the enemy to be \"engaged\" with you.  Smaug is in the staging area, but \"considered to be engaged\" with the first player, so these cards should be legal.\n\n \n\nedit: I managed to burgle all of the treasures from The Lonely Mountain with very little fuss following this 'formula.'  I had Galadriel-Glorfindel(Sp)-Haldir with Legolas-Beregond-Gloin.\n\nEdited December 20, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1375161","commentId":1375161,"userName":"Dwarf king Bronze beard","timestamp":1419157952,"content":"> There is still text remaining on Smaug the Golden (\"Then, the first player makes a burgle attempt\") but, because Smaug has been removed from play, the text is inactive.\n\nActually it doesn't read on Smaug, it reads on the quest card and now when i'm thinking it, it actually could work that i would do burgle test even i would advance to stage 4. Because in Hunt for Gollum at the stage 1B you have to resolve it's forced effect even you would advance to the next stage, when quested succesfully. It's hard to explain it since i'm not so good at English (as you might know) but you probably understand what i'm trying to say.\n\n \n\nffg_the-burglars-turn-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-burglars-turn-otd.jpg]  ffg_smaug-the-golden-otd.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_smaug-the-golden-otd.jpg]\n\nEdited December 21, 2014 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129461-on-the-doorstep-questions/?do=findComment&comment=1375443","commentId":1375443,"userName":"GrandSpleen","timestamp":1419178839,"content":"Ah, good point, it's on the quest card.  \n\n \n\nYou're probably right, and I figured my interpretation was weak even as I was writing it.  Once you start to resolve an effect, you have to resolve it fully, so you would do the burgle after advancing to stage 4.  I guess I am just trying to make Smaug tougher :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}