{"url":"https://community.fantasyflightgames.com/topic/129546-gandalf-a-in-the-road-darkens/","title":"gandalf a in the road darkens...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129546-gandalf-a-in-the-road-darkens/?do=findComment&comment=1374473","commentId":1374473,"userName":"player723290","timestamp":1419103857,"content":"hi everybody...!\n\nI have here the new expansion... great!\n\nBut I'm not sure to understand the new hero gandalf.\n\nyou have to Play with the top card of your deck faceup.\n\nis it mandatory?\n\nit means that gandalf gives resources of the color of the faced up card. right?\n\nif not, may i use gandalf's neutral resource to play, for example, a leadership card? \n\nThe problem is that I use a deck with Leadership, Lore, and Spirit icons.\n\nif it is possible i can change the hero, but if it is not so...\n\n \n\nso if i want to use gandalf I have to sacrifice one of my hero... and the risk is that, if i can't use the neutral resource to play cards I have no resources for one of my color.\n\nit works only with a two color deck...?\n\n \n\ni suppose that with three gandalf is useless...\n\nis it so? \n\n \n\ntanks...\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/129546-gandalf-a-in-the-road-darkens/?do=findComment&comment=1374570","commentId":1374570,"userName":"SauronTheGreat","timestamp":1419110123,"content":"I don't think he is useless.  I know people don't often use songs but this could be a case in which a song could be of use. Also, you can play the top card with either gandalf's resources OR with those of a hero who has the same icon.   You can also use expert treasure hunter from on the doorstep to essentially draw an extra card each turn if you want.  There are also cards like gandalfs staff or word of command to get extra boosts solely because you are using gandalf.  yes, he is different, and it is a pain not to be able to use the gandalf allie, but I would not call him useless.  \n\nNow i personally don't own the road darkens, this is all looking at the card from the outside with actually using it, but that is how i see it.  \n\nfeel free to correct me anyone, if you own him and feel I am wrong"}]}