{"url":"https://community.fantasyflightgames.com/topic/129530-born-aloft/","title":"Born Aloft","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1374077","commentId":1374077,"userName":"goblin981","timestamp":1419078754,"content":"Can you use Born Aloft on objective allies?  If yes how do you then play the ally?  0 cost?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1374174","commentId":1374174,"userName":"PocketWraith","timestamp":1419088004,"content":"Hmm. I'm sure you shouldn't be able to, since that's obviously not the intent of the card, but I can't see anything in the rules that would actually prohibit it. However, since the objective allies don't have a printed cost, I don't think you could play them at all. Incidentally, if this were allowed (which I reiterate, it shouldn't be) it would break Return to Mirkwood - Gollum only causes you to lose if he's destroyed, not if he leaves play, so if you put him into your hand you could just play on without the threat gain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1374229","commentId":1374229,"userName":"GrandSpleen","timestamp":1419091654,"content":"from the wording of the card, it returns to its \"owner's\" hand.  You control objective allies, but do not own them.  And the encounter deck doesn't have a \"hand,\" so maybe using Born Aloft on an objective ally would have no effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1376574","commentId":1376574,"userName":"Nerdmeister","timestamp":1419240692,"content":"One might argue that in this case the encounter draw pile is \"the hand\".\n\nI have nothing to back it up  though :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1376828","commentId":1376828,"userName":"SauronTheGreat","timestamp":1419255785,"content":"The question is not what your hand is but whether an objective ally is considered an ally or just an objective.  I guess there is nothing preventing you from doing it AS LONG AS the ally does not read \"if ----- leaves play, the players have lost the game\"  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/129530-born-aloft/?do=findComment&comment=1377131","commentId":1377131,"userName":"GrandSpleen","timestamp":1419270044,"content":"I will respectfully disagree with the servant of the Morgoth here.  Objective allies are certainly considered 'characters' and 'allies,' can have attachments that are legal for allies, will take damage from card effects targeting characters or allies, and being 'allies' they are legal to be used as defenders or attackers, etc.  So Born Aloft may be attached to an objective ally, no problem.\n\n \n\nWhen you discard the attachment though, there is no 'hand' for the ally to go to, so it will not leave play.  "}]}