{"url":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/","title":"The Three Trials question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378142","commentId":1378142,"userName":"legolas18","timestamp":1419316008,"content":"On Stage 2B: Trial of Intuition it says, \"Instead of placing progress tokens here, discard an equal number of cards from the top of the encounter deck.\" Or something like that. But what's confusing is that if you happen to discard the Key, wouldn't it just be discarded?? I don't think that was its intended purpose, but that seems like what it would do. Anyone else wonder about this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378150","commentId":1378150,"userName":"GrandSpleen","timestamp":1419316531,"content":"Each of the keys has the text, \"If Key of the <animal> is discarded, add it to the staging area.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378170","commentId":1378170,"userName":"legolas18","timestamp":1419317549,"content":"Oh! Haha. Foolish old me. Alright, thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378483","commentId":1378483,"userName":"SauronTheGreat","timestamp":1419341753,"content":"The annoying is that the first quest in over hill and under hill has this same mechanic but the troll key and purse don't go into the staging area if discarded!  It makes me so mad cause this is one of my least favs but I have to do it all the time to get the treasures for the other hobbit quests.  I spend 20 mins on my least favorite quest only to realize I have to do it AGAIN!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378618","commentId":1378618,"userName":"GrandSpleen","timestamp":1419347474,"content":"Troll Key and Purse received errata awhile back.  The official FAQ adds language to them, instructing you to put them in the staging area if discarded.  And just for good measure, we also have official clarification that these do go into the staging area when discarded, from whatever state.  Here's the official response on that, from a bgg thread [http://boardgamegeek.com/thread/843685/troll-key-and-troll-purse]:\n\n \n\n\"Thanks for writing! Anytime the Troll Key or Troll Purse would be discarded (whether as shadow cards or by questing successfully at stage 2) they are added to the staging area. After they are added to the staging area, you check if there is a troll enemy in play to attach them to. They were worded this way so players would have a better chance at discovering the treasure and avoid the frustration you described.\n\nEnjoy the scenario!\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/129720-the-three-trials-question/?do=findComment&comment=1378807","commentId":1378807,"userName":"SauronTheGreat","timestamp":1419355636,"content":"ok good!  that annoyed me soooooo much"}]}