{"url":"https://community.fantasyflightgames.com/topic/129869-the-hunt-for-gollum-%E2%80%94-stage-1b-questing/","title":"The Hunt for Gollum — Stage 1B Questing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129869-the-hunt-for-gollum-%E2%80%94-stage-1b-questing/?do=findComment&comment=1380840","commentId":1380840,"userName":"YGrams","timestamp":1419483854,"content":"I wonder whether someone could help me understand how the Forced effect on stage 1B of The Hunt for Gollum works with respect to the calculation of threat in the staging area. Entry 1.24 of the FAQ specifically addresses this card and explains, \"Questing successfully and the physical placement of progress tokens are two separate game occurrences.\" The Forced effect therefore takes place before tokens are placed, but I am unsure whether the total threat in the staging area should then be recalculated before placing the tokens; entry 1.43 of the FAQ leads me to believe that it should be recalculated, but I note that at least one prominent member of the community does not play it so (https://hallofbeorn.wordpress.com/2013/04/08/beorns-path-part-8-playtesting-the-hunt-for-gollum/ [https://hallofbeorn.wordpress.com/2013/04/08/beorns-path-part-8-playtesting-the-hunt-for-gollum/]).\n\n \n\nTo give an example, say that, in a solo game, I have committed 8 threat to the quest and after staging, there is 5 threat in the staging area. I have therefore quested successfully and the Forced effect resolves. If I then choose a card with 2 threat to reveal and add to the staging area, does its threat count against the number of tokens I place (i.e. do I place 3 tokens or 1)? How about if I choose The Old Ford, which has a threat of X where X is the number of ally cards in play, and I have four allies? There would then be 9 threat in the staging area against my 8; would I no longer have quested successfully, and would I need to increase my threat by one?\n\n \n\nThank you for your help! Apologies for bringing up such an old quest: I only recently got into the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129869-the-hunt-for-gollum-%E2%80%94-stage-1b-questing/?do=findComment&comment=1381012","commentId":1381012,"userName":"SauronTheGreat","timestamp":1419512239,"content":"I believe that it doesn't.  it says \"after the players quest successfully...\"  even though questing and actually putting progress are in different steps, after you calculate how much progress you have made (or the encounter deck  has made) questing is over for that round.  so, for stage 1, you resolve questing before and the extra threat or effect does not count.  that is why stage 2 is so much worse because not only do you have only 2 cards to pick from but the threat counts against you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129869-the-hunt-for-gollum-%E2%80%94-stage-1b-questing/?do=findComment&comment=1381195","commentId":1381195,"userName":"GrandSpleen","timestamp":1419533765,"content":"Agree with Sauron.  Questing is already resolved, and the number of tokens to be played is decided.  Adding more threat to the staging area won't change that.  You have already calculated threat vs. willpower, which has determined that you've quested successfully.  "}]}