{"url":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/","title":"quest Marathon","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1382354","commentId":1382354,"userName":"SauronTheGreat","timestamp":1419643795,"content":"I am going to do a quest marathon and anyone can join me.  Here's how it works.  Before new years day, I will be done with ALL the quests I own (including nightmare).  I will play each once and only once.  I, personally will be using the same heroes and the same deck (if anyone wants to know my deck, just ask) which will make it hard to do specialized quests like Rhosgobel but I will push through. \nThen I will post the following: \nfirst: heroes I used.\nSecond: what quest I did\nThird: whether I had Victory or Defeat, using a the following system:\nnext to victory or defeat I will write one of the following depending upon how hard the playthrough was:\nsandbox-I could have been asleep the whole time \neasy-no challenge\nmoderate-this was fun but not too challenging\nhard-this was tough, barely made it through or barely didn't\nbrutal-this was a nightmare.  I didn't make it and wasn't close\nfourth: how many turns it took me to win or lose\nand lastly: my score (only if I won, if not I will leave this blank)(I will use new scoring). \nI am going to post what I complete ever day, adding to what I already had using edit. \nI did core and Mirkwood today in about 3-4 hours so I will go ahead and post that bellow:\n\nHeroes: Dain, Ori, Oin\nQuest:Pas thru Mirkwood\nV or D: Victory-easy\nRounds: 7\nscore: 94closing s corp\nheroes: same\nquest: J D the Anduin\nV or D: Victory-hard\nRounds: 12\nScore: 144\nHeroes: same\nQuest: Dol guldor\nV or D:Defeat-Brutal\nrounds: 9\nScore:-\nHeroes: same\nQuest: Hunt for Gollum\nV or D: Victory-Moderate\nRounds: 14\nScore: 152\nHeroes: same\nQuest: Conflict at Carrock\nV or D:Victory-easy\nrounds: 10\nscore: 128\nHeroes: same\nquest: J to Rhosgobel\nV or D:Victory-hard\nRounds: 5\nscore: 71\nHeroes: same\nQuest: Hills or Emin Muil\nV or D: Victory-sandbox\nRounds: 11\nScore: 111\nHeroes: same\n quest: The dead marshes\nV or D: Victory-moderate\nrounds: 13\nscore: 162\nHeroes: same\nQuest: Return t Mrikwood\nV or D: Defeat-Brutal\nrounds: 6\nscore: -\n\nHeroes: same\n\nquest: into the pit\n\nV or D: Victory-moderate \n\nrounds: 11\n\nscore: 143\n\nheroes: same\n\nquest: the seventh level\n\nV or D: defeat-brutal\n\nrounds: 4\n\nscore:-\n\nheroes: same\n\nquest: flight from Moria\n\nV or D: victory-moderate\n\nrounds: 11\n\nscore: 126\n\nheroes: same\n\nquest: redhorn gate\n\nV or D: victory-easy\n\nrounds: 15\n\nscore:152\n\nheroes: same\n\nquest: the long dark\n\nV or D: Victory- easy\n\nrounds: 7\n\nscore: 93\n\nheroes: same\n\nquest: shadow and flame\n\nV or D: victory-hard\n\nrounds:14\n\nscore: 157\n\nheroes: same\n\nquest: me must away ere break of days\n\nV or D: victory-hard\n\nrounds: 14\n\nscore:160\n\nheroes: same\n\nquest: over misty mountains grim\n\nV or D: victory-moderate\n\nrounds: 6\n\nscore: 93\n\nheroes: same\n\nquest: dungeons deep and caverns dim\n\nV or D: victory-moderate \n\nrounds:12\n\nscore: 139\n\nheroes: same\n\nquest: flies and spiders\n\nV or D: victory- easy\n\nrounds: 10\n\nscore: 139\n\nheroes: same\n\nquest: the lonely mountain\n\nV or D: victory-hard\n\nrounds: 8\n\nscore: 96\n\nheroes: same\n\nquest: the battle of five armies\n\nV or D: victory-moderate\n\nrounds: 10\n\nscore: 129\n\nheroes: same\n\nQuest: massing at osgiliath\n\nV or D: victory moderate\n\nrounds: 12\n\nscore: 149\n\nheroes: same\n\nquest: battle at lake town\n\nV or D: defeat-brutal\n\nrounds: 3 \n\nscore:-\n\nThanks,\nHope you join me in this adventure!\n\nPs... if anyone can tell me how to attach stuff I can put this all into a table and make it so much easier to read...\n\nEdited December 31, 2014 by SauronTheGreat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1382455","commentId":1382455,"userName":"Khamul The Easterling","timestamp":1419651376,"content":"All the quests including nightmare in 5 days?  Man I wish I had that much spare time...I could maybe do 1 quest a day!\n\nAnyway, looking forward to see how you do!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1382685","commentId":1382685,"userName":"SauronTheGreat","timestamp":1419685551,"content":"well, I only own about half the quests so... it will be easier.  I also don't own any nightmares.  it still may be too much. we will see"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1382756","commentId":1382756,"userName":"Dwarf king Bronze beard","timestamp":1419693211,"content":"Maybe i could do it, but since i got five packs as Christmas presents and today i bought Three Trials and Trouble in Tharbad + my old quests (all hobbit and deluxe expansions, shadows of mirkwood cycle, dwarrowdelf cycle, against the shadow cycle, nightmare hills of emyn muil and battle at the lake-town), it is just too much. But i try to get at least from the core set to the end of dwarrowdelf cycle.\n\n \n\nI start it tomorrow since my friend and i haven't been beaten encounter at amon din yet and we want to win it today with new cards i got.(They smell and feels just so good)  ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] \n\nAlso great idea for making this, it's really fun idea to compare and share quests with others :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1382776","commentId":1382776,"userName":"SauronTheGreat","timestamp":1419695332,"content":"ok guys, just do what you can.  I will try my best to get them all done but we will see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1383456","commentId":1383456,"userName":"PsychoRocka","timestamp":1419761505,"content":"I'm going to try just the first three quests in the core set and the mirkwood cycle but in nightmare mode =)\n\nHeroes used are Celeborn, Elladan and Elrohir in one deck and Elrond, Haldir and Glorfindel (spirit) in the other deck (two handed play).  I'll update this post as I go. Forgot to record rounds in the first quest so won't bother now lol... I use the old scoring system so am not used to counting rounds.\n\n \n\nPassage Through Mirkwood Nightmare\nVictory: Victory - Moderate\n\nScore: 75\n\nNotes: Wow had the Spiders web exhaust all three heroes on the tactics leadership side of the table during setup which was pretty **** nasty. I removed it with Power of Orthanc instantly however. I managed to cancel the Hummerhorns Shadow effect with a hasty stroke early on (not being able to cancel it would have resulted in Celeborn dying). I got out a Warden of Healing and used him at the end of every turn to heal. I managed to avoid a few other nasty effects such as Ungoliants Brood only stopping Celeborn from readying as all other characters were ready including Elrohir after defending as I used Gandalf to quest for that deck that turn so because he was going to leave play the no readying effect meant nothing. Got Don't Leave the Path as my stage 3 and added Ungoliants Spawn and Forest Spider into play. I defended all attacks did 8 damage to Ungoliants Spawn and used Pursuing the Enemy to do the last point of damage returning Orophin to my hand. This also killed a forest spider in the process. Pretty fun and fairly easy game although I did think I was going to lose a hero several times but thanks to an early warden of healing and other tricks I easily won. I also used two Gildor's Counsels halfway through slowing the game right down and allowing me to get more cards out and slow down enemies etc appearing. I also travelled through TWO abandoned camps only losing one character each time and only an ally.\n\n \n\nJourney Along the Anduin Nightmare\nVictory: Victory - Hard\n\nScore: 80\n\nNotes: This was A LOT harder than the previous game. Defeated the Hill Troll twice after Pursued on the Shore came out near the end, again using Gildors Counsel for a round or two helped massively and by saving Gandalf to push through stage 2 I was able to avoid too many encounter cards coming out. I had to reduce the tactics/leadership decks threat with both a second gandalf and galahadrims greeting and it was still at 42 at the end of the game! Explored two copies of Gladden Fields, killed two marshland outlaws and two wargs as well as two goblin snipers. I also had two copies of Brown Water Rats one of which had a ranger spikes and the other had a forest snare. Very close game with lots of damage on heroes and many close calls...\n\nEdited December 28, 2014 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1383644","commentId":1383644,"userName":"Dwarf king Bronze beard","timestamp":1419783276,"content":"I finally started this and as Sauron does this, i try to beat all quests with same heroes, deck and scoring system. I'm using Dain, Thorin and Ori as my heroes. But anyway here are my results:\n\nPassage Trough Mirkwood\nVictory-Sandbox\nRounds:3\nScore:59\nNotes: I was very lucky with the encounter cards and thanks for Gandalf who lowered my threat and because of that i made a new record (only one point but still it's a record).\n\nJourney Down Anduin\nVictory-Hard\nRounds:5\nScore:86\nNotes: This was most exciting quest i have been played in a really long time, even it was kind of short. I defeated troll at the second round with Gandalf's assist dealing 4 damage to the troll and defending against it with Gandalf, then Thorin, Ori and one of my allies killed the troll. Second stage i completed next round with WP 22 against 5 threat in the staging area. Then at the last stage Marsh Adder and wargs were revealed and my only ready character Dain defends against them since my threat was already 41 and both of them engaged me. Wargs didn't make me any trouble to Dain with his +1 defense boost of Dunedain warning, then marsh adder attacked and shadow card was wolf rider which attacks Thorin as undefended, shadow card gives +3 attack and Thorin dies...wait i had hardy leadership attached to Dain so Thorin luckily survived, then final round. At the combat phase wargs got that wolf rider for shadow card but i was better prepared than last round so i managed to kill wolf rider and wargs but Thorin and Ori didn't have enough strength to kill Marsh Adder...wait i haven't used king under the mountain. I got Gandalf and i had sneak attack in my hand. I used them, lowered my threat and killed the marsh adder. Pretty good game i think + i made a new record again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEscape from Dol Guldur\nDefeat-Brutal\nRounds:6\nScore:-\nNotes: Ori was the prisoner and when i saved him Dain was already dead, then Hummerhorns and Nazgul engaged me, Ori died because of Hummerhorns and next round Thorin had no chances against all enemies engaged with me and he died too...\n\nHunt for Gollum\nVictory-Sandbox\nRounds:3\nScore:60\nNotes: I only got locations and treacheries so i didn't have to worry about fighting. Nothing interesting really happened.\n\nConflict at the Carrock\nVictory-Moderate\nRounds:12\nScore:142\nNotes:I had pretty slow start since i didn't get my \"classic\" dwarf setup (five dwarfs to get Thorin and Ori's abilities to work) and at the third round Ori got sacked! But i beated this with lots of help of Gandalf, 3 Dunedain warnings and Grimbeorn's strength.\n\nJourney to Rhosgobel\nDefeat-Moderate\nRounds:4\nScore:-\nNotes: I quested too much and lost the game since i had only one athelas and Wilyador had 12 damage.\n\nThe Hills of Emyn Muil\nVictory-Sandbox\nRounds:12\nScore:131\nNotes: REAAALLY boring game. I waited the last 8 turns that i would get some encounter cards with victory points. At the end of the game i had something like 15 allies, 35 resources and only one card in my hand and deck empty. I really don't like this quest.\n\nThe Dead Marshes\nVictory-Sandbox\nRounds:2\nScore:45\nNotes: I had a good start and when i did the last escape test Gollum had 4 tokens which made 10 escape value vs my 14 willpower.\n\nReturn to Mirkwood\nVictory-Sandbox\nRounds:4\nScore:82\nNotes:I had REALLY good luck in this one. I got 3 wasted provisions, eyes of the forest,wood elf path and mountains of Mirkwood as my encounter cards in this game. I also made my new record :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nInto the Pit\nVictory-Sandbox\nRounds:5\nScore:77\nNotes: This time i was a pacifist and i didn't kill any one in this quest i only defended twice against patrol leader and that's all combat of the whole quest!\n\nThe Seventh Level\nVictory-Sandbox\nRounds:4\nScore:75\nNotes:I continued my pacifistic journey in Moria and i didn't encountered anything really bad.\n\nFlight from Moria\nVictory-Sandbox\nRounds:1\nScore:46\nNotes: I got VERY lucky in this one. Round 1: I used we are not idle 3 times and i got lonbeard elder, Erebor record keeper and some extra resources for next turn. I didn't quest with no one since all charecters were exhausted already. I revealed the quest card which was blocked by shadow. I took a risk and no treachery! Then stray goblin came from the encounter deck so i had to raise my threat by 3. After that the goblin attacked to Dain and dealt 1 damage. Round 2:I got Henarmath and lure of Moria and i bought him and looked top card of the encounter deck: orc drummer. So then there would be 5 threat in the staging area + 9 quest points. So i needed to quest 14. After commiting everyone to the quest (except Dain) i noticed that i still needed two WP, well i had sneak attack and Dori. I used them and won the game. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThe Redhorn Gate\nVictory-Moderate\nRounds:17\nScore:208 :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]\nNotes: Well this time i had very bad luck. Everything went well until i got to the final stage. I even killed that mountain troll first time (usually i have so low threat that i don't have to engage it) with no trouble and wargs didn't stop me either. Then at the last stage ordinary mountain goblin attacked me. Dain defends 4 against 2 and i had Dori ready if something bad would happen. Well shadow card was SNOWSTORM! It killed Dain since he had 0 WP :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png]. Then the last 8-12 rounds i tried to find those victory point locations and i runned out almost everything: Cards in my hand and deck, progress -and resource tokens + my all dices (12)! Finally at the 16 round i got Celebdill, i traveled there and next round i won the game. This was even more annoying game than Emyn Muil...\n\nRoad to Rivendell\nVictory-Easy\nRounds:3\nScore:56\nNotes:Otherwise really easy quest but one sleeping sentry came from the encounter deck at the first round during the quest phase, which slowed me little bit but it didn't cause me any serious trouble.\n\n \n\nThe Watcher in the Water\n\nVictory-Easy\n\nRounds:4\n\nScore:72\n\nNotes: I usually beat this quest by using Doors of Durin but this time i defeated that Watcher with a little help of Gandalf.\n\n \n\nThe Long Dark\n\nVictory-Easy\n\nRounds:4\n\nScore77\n\nNotes: First round was little bit challenging and after i got to the stage 2 i failed locate test but fortunaetly i didn't have to trigger any lost effects. Then last round i commited everyone else to the quest except Dain and Henarmath and won the game.\n\n \n\nThe Foundations of Stone\n\nVictory-Easy\n\nRounds:7\n\nScore:93\n\nNotes:I proceeded this time a little slower than normally but i still got good scores and i defeated even one elder thing at the stage 4 which was the old one lair. At the final stage i had just enough WP to win the game thanks for the Durin's axe.\n\n \n\nShadow and Flame\n\nVictory-Moderate\n\nRounds:7\n\nScore:77\n\nNotes:I didn't have any serious troubles in this quest and i defeated Durin's bane at the second try of the black pit.\n\nEdited January 1, 2015 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1384024","commentId":1384024,"userName":"SauronTheGreat","timestamp":1419814721,"content":"> I finally started this and as Sauron does this, i try to beat all quests with same heroes, deck and scoring system. I'm using Dain, Thorin and Ori as my heroes. But anyway here are my results:\n> \n> Passage Trough Mirkwood\n> \n> Victory-Sandbox\n> \n> Rounds:3\n> \n> Score:59\n> \n> Notes: I was very lucky with the encounter cards and thanks for Gandalf who lowered my threat and because of that i made a new record (only one point but still it's a record).\n> \n> Journey Down Anduin\n> \n> Victory-Hard\n> \n> Rounds:5\n> \n> Score:86\n> \n> Notes: This was most exciting quest i have been played in a really long time, even it was kind of short. I defeated troll at the second round with Gandalf's assist dealing 4 damage to the troll and defending against it with Gandalf, then Thorin, Ori and one of my allies killed the troll. Second stage i completed next round with WP 22 against 5 threat in the staging area. Then at the last stage Marsh Adder and wargs were revealed and my only ready character Dain defends against them since my threat was already 41 and both of them engaged me. Wargs didn't make me any trouble to Dain with his +1 defense boost of Dunedain warning, then marsh adder attacked and shadow card was wolf rider which attacks Thorin as undefended, shadow card gives +3 attack and Thorin dies...wait i had hardy leadership attached to Dain so Thorin luckily survived, then final round. At the combat phase wargs got that wolf rider for shadow card but i was better prepared than last round so i managed to kill wolf rider and wargs but Thorin and Ori didn't have enough strength to kill Marsh Adder...wait i haven't used king under the mountain. I got Gandalf and i had sneak attack in my hand. I used them, lowered my threat and killed the marsh adder. Pretty good game i think + i made a new record again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> Escape from Dol Guldur\n> \n> Defeat-Brutal\n> \n> Rounds:6\n> \n> Score:-\n> \n> Notes: Ori was the prisoner and when i saved him Dain was already dead, then Hummerhorns and Nazgul engaged me, Ori died because of Hummerhorns and next round Thorin had no chances against all enemies engaged with me and he died too...\n> \n> Hunt for Gollum\n> \n> Victory-Sandbox\n> \n> Rounds:3\n> \n> Score:60\n> \n> Notes: I only got locations and treacheries so i didn't have to worry about fighting. Nothing interesting really happened.\n> \n> Conflict at the Carrock\n> \n> Victory-Moderate\n> \n> Rounds:12\n> \n> Score:142\n> \n> Notes:I had pretty slow start since i didn't get my \"classic\" dwarf setup (five dwarfs to get Thorin and Ori's abilities to work) and at the third round Ori got sacked! But i beated this with lots of help of Gandalf, 3 Dunedain warnings and Grimbeorn's strength.\n\non dul goldor, you were lucky not to have Dain be the prisoner.  without him to defend, I really con't take any enemies without defending them with a 1 defence :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png].  I lost a hero like round 3 and then threated out because I couldn't quest like 6 rounds later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1384335","commentId":1384335,"userName":"Dwarf king Bronze beard","timestamp":1419843716,"content":"Yea that's what i feared could happen to me if Dain would have been prisoner, but it wouldn't make any difference since i lost the game anyway. \n\nEdited December 29, 2014 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1385957","commentId":1385957,"userName":"Dwarf king Bronze beard","timestamp":1419946087,"content":"Is here anyone else doing this? It seems that i'm the only one here who still does this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1385973","commentId":1385973,"userName":"SauronTheGreat","timestamp":1419946809,"content":"I am, I just need to right down my progress.  I will try to finish the hobbit saga today!\n\nAlso, you were very lucky on the seventh level, or rather, I was very unlucky.  Within 4 rounds there were six enemies engaged with me, one of which was the chieftain of the pit and another was a great cave troll.  It was brutal.  even though that quest is a 3 in difficulty, It can be very brutal!\n\nEdited December 30, 2014 by SauronTheGreat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1386748","commentId":1386748,"userName":"SauronTheGreat","timestamp":1419979047,"content":"oh ya, and BTW, dwarf king, could you post your dwarf deck?  I look down the difficulties you posted and see sandbox almost every time.  I know mirkwood is relatively easy and dwarves are powerful but I can't crush all of mirkwood and kd even with luck!  either your quite a bit better than me (which may very well be) or I have a deck that is not perfect (horrors!). ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1387292","commentId":1387292,"userName":"Dwarf king Bronze beard","timestamp":1420019893,"content":"Here is my deck:\n\n \n\nDurin's Folk\n\n \n\nHeroes (31)\n\n \n\nThorin Oakenshield\n\nDain Ironfoot\n\nOri\n\n \n\nAllies\n\n3x Fili\n\n3x Longbeard Elder\n\n3x Erebor Record Keeper\n\n3x Ered Nimrais Prospector\n\n3x Gandalf\n\n2x Erebor Hammersmith \n\n2x Kili\n\n1x Gloin\n\n1x Keen Eyed Took\n\n1x Longbeard Map-Maker\n\n1x Bifur\n\n1x Dori\n\n1x Master of the Forge\n\n1x Henarmath Riversong \n\n \n\nAttachments\n\n3x Dunedain Warning\n\n2x Steward of Gondor\n\n2x King Under the Mountain\n\n1x Thror's Map\n\n1x Healing Herbs\n\n1x Cram\n\n1x Hardy Leadership\n\n \n\nEvents\n\n3x We are not Idle\n\n2x A Very Good Tale\n\n2x Lure of Moria\n\n2x Sneak Attack\n\n2x Daeron's Runes\n\n2x Hidden Cache\n\n \n\nPS: I try to remeber write strategy of this deck later, now i'm too busy to do it.\n\nEdited January 9, 2015 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1387908","commentId":1387908,"userName":"SauronTheGreat","timestamp":1420053813,"content":"just a few things I would add from my deck:  I use oin instead of thorin for 2 main reasons reasons: #1 threat, with oin, I have a starting threat of 27 instead of 31 which can really matter in a quest such as journey down the anduin.  #2 spheres, with oin, I have all four spheres and can include cards such as erebor battle master and only have to use 2 fili's and am not afraid of drawing a dud in kili.  \n\nyou can access so many more dwarves with tactics and spirit such as dwalin, axehand and erebor battle master.  \n\nI might also add in Narvi's belt so that you don't have to put steward on one hero with all those resources without helping all spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1388068","commentId":1388068,"userName":"Dwarf king Bronze beard","timestamp":1420061772,"content":"Those are good ideas and i may try those but there would be few problems, like slow start since it could take some time to get Steward and Fili in play with only one leadership hero and i wouldn't probably have resources for keen eyed Took's deck recycling ability + Thorin's ability gets you more resources which you need to balance card drawing of Ori and he has also better stats than Oin.\n\n \n\nIt's also shame that i didn't get to my goal but i think that i'm going to try all my quests i have and write my results here, even here aren't lots of people doing this (probably just we two)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1394426","commentId":1394426,"userName":"TwiceBorn","timestamp":1420534550,"content":"This may be a dumb question, but… what does \"Victory - Sandbox\" mean? Does Sandbox = \"very easy\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1394491","commentId":1394491,"userName":"SauronTheGreat","timestamp":1420544123,"content":"yup.  and thats not a dumb question.  I should have clarified. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396451","commentId":1396451,"userName":"Qaanaaq","timestamp":1420651605,"content":"Just a quick suggestion for your dwarf deck name:\n\n \n\nRoyal fivefooters\n\n \n\nFive foot royalty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396515","commentId":1396515,"userName":"Dwarf king Bronze beard","timestamp":1420654243,"content":"> Just a quick suggestion for your dwarf deck name:\n> \n>  \n> \n> Royal fivefooters\n> \n>  \n> \n> Five foot royalty\n\nIt's much better but what's the meaning of the \"five foot\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396671","commentId":1396671,"userName":"TwiceBorn","timestamp":1420661785,"content":"Dwarves are typically no more than 5 feet tall, maybe???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396783","commentId":1396783,"userName":"gandalfDK","timestamp":1420666502,"content":"Most dwarves synergize with contolling 5 dwarves or more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396886","commentId":1396886,"userName":"Julia","timestamp":1420671037,"content":">  \n> \n> > Just a quick suggestion for your dwarf deck name:\n> > \n> >  \n> > \n> > Royal fivefooters\n> > \n> >  \n> > \n> > Five foot royalty\n> \n> It's much better but what's the meaning of the \"five foot\"?\n> \n>  \n\n \n\nWhat about \"The Ax, and the Barrells\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1396970","commentId":1396970,"userName":"TwiceBorn","timestamp":1420675145,"content":"> Most dwarves synergize with contolling 5 dwarves or more.\n\n \n\nAh, I must not be far enough in my card acquisition to have noticed that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1397449","commentId":1397449,"userName":"Dwarf king Bronze beard","timestamp":1420720368,"content":"\"What about \"The Ax, and the Barrells\"?\"\n\n \n\nDo you mean The Axes and the Barrels or what?\n\nEdited January 8, 2015 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1397536","commentId":1397536,"userName":"Julia","timestamp":1420725474,"content":"Not so sure I get your point.. \"the Ax\" is a weapon. \"Axe\", if you prefer the British spelling over the American. I used the singular on purpose (a synecdoche to represent the most renowned dwarven weapon). The comma is needed to give the pause after \"ax\" a greater emphasys, like saying \"and what's next?\". Barrel, not barrell, right, no idea why I used the double \"L\". But still, regardless of subtilities in the spelling, the intent should have been clear. Or?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1397624","commentId":1397624,"userName":"gandalfDK","timestamp":1420729749,"content":">  \n> \n> > Most dwarves synergize with contolling 5 dwarves or more.\n> \n>  \n> \n> Ah, I must not be far enough in my card acquisition to have noticed that. \n> \n>  \n\nMost was not the right word. Rather some heroes, like Bombur (he enhances it, rather then do something with it ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]), Thorin Oakenshild and Ori. Some other things do to with 5 Dwarves under your control, so that's where he got it from I think. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129980-quest-marathon/?do=findComment&comment=1399057","commentId":1399057,"userName":"Dwarf king Bronze beard","timestamp":1420819543,"content":"What about \"Durin's Folk\"? I think it's pretty good and other names were good too, but royal fivefooters doens't fit in that deck so well since i don't think that Ori is anykind of royal or noble hero. And The Ax, and the Barrells doesn't really describes the deck since there aren't any axe weapons or barrels.\n\nEdited January 9, 2015 by Dwarf king Bronze beard"}]}