{"url":"https://community.fantasyflightgames.com/topic/129936-foundations-of-stone-questions/","title":"Foundations of Stone questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/129936-foundations-of-stone-questions/?do=findComment&comment=1381772","commentId":1381772,"userName":"gandalfDK","timestamp":1419597046,"content":"Hello all,\n\nI had some questions about my new FoS AP.\n\nMostly about separate staging areas:\n\nIf player A has Dain and the players are separated, player B doesn't get the bonus right?\n\nThe rulesheet says somewhere: During the encounter phase players only reveal 1 card per player that shares their staging area.\n\nShould it read: Duribg the quest phase/During the staging step of the quest phase or am I supposed to reveal cards twice per round?\n\nIf Watchful Eyes is attached to a hero of Player A and the new encounter deck gets shuffled in the rulesheet reads: remove all other encounter cards from the game. So that does include these sorts of cards?\n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129936-foundations-of-stone-questions/?do=findComment&comment=1381873","commentId":1381873,"userName":"GrandSpleen","timestamp":1419608055,"content":"Dain: correct, no player cards can affect cards at other staging areas, so while you are separated Dain will have no effect on the dwarves who are separated from him.\n\n \n\nIf it says \"encounter phase\" it's an error.  It should say \"quest phase.\"  Just resolve the quest phase for each player individually, as if there were only 1 player in the game.\n\n \n\nWatchful Eyes will get discarded when you get separated.  The cards aren't \"removed\" from the game though; they all get discarded, then shuffled together with the new Foundations of Stone deck.  All of the locations from the original deck get \"removed\" (per the quest card instructions, they are not shuffled into the new deck, and get removed from the game afterward).  \n\n \n\nHope you're enjoying the scenario, it's a good one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/129936-foundations-of-stone-questions/?do=findComment&comment=1382049","commentId":1382049,"userName":"gandalfDK","timestamp":1419621014,"content":"Thanks GrandSpleen!\n\nIt says encounter phase, so maybe I should sent Caleb an email..\n\nI will have my go at it this evening! Happy Holidays!"}]}