{"url":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/","title":"Thalin + shadow enemy&#039;s &quot;add to the staging area&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1384122","commentId":1384122,"userName":"tripecac","timestamp":1419823442,"content":"If Thalin commits to a quest, and then in the combat phase you get a shadow card which adds that shadow card to the staging area, does Thalin's effect apply 1 damage to it?\n\n \n\nOr does Thalin's effect not apply because either:\n\n \n\na) he is not considered \"committed to a quest\" when it is not the quest phase\n\n \n\nand/or\n\n \n\nb) fllipping a shadow card is not considered \"revealing it from the encounter deck\"\n\n \n\n?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1384143","commentId":1384143,"userName":"Bullroarer Took","timestamp":1419824497,"content":"A"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1384145","commentId":1384145,"userName":"Bullroarer Took","timestamp":1419824568,"content":"B is true too, but A happens first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1384267","commentId":1384267,"userName":"TwiceBorn","timestamp":1419836299,"content":"I agree with both of Bullroarer Took's responses.\n\nEdited December 31, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1385345","commentId":1385345,"userName":"tripecac","timestamp":1419896874,"content":"Thanks for the clarifications.\n\n \n\nIs there somewhere where \"A\" and \"B\" are spelled out for us? \n\n \n\nMore specifically, is there a page in the rulebook, official FAQ, or unoffical FAQ which states that characters do not remain commited to a quest once the quest phase ends?\n\n \n\nAnd how about a rule (or FAQ) which explains what precisely is meant by \"revealed from the encounter deck\".  The most restrictive interpretation of that phase would be \"revealed from the encounter deck as a normal encounter card draw during the quest phase\"; a more liberal interpretation would be \"drawn from the encounter deck at any point, and then revealed, either immediately, or as a shadow card)\".  I am curious what the \"correct\" interpretation is, and where it is written."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1385558","commentId":1385558,"userName":"joezim007","timestamp":1419909209,"content":"\"Revealed from the encounter deck\" can happen during any phase, but the revealing must come directly from the encounter. Dealing or flipping a shadow card don't even count as \"revealing\" a card (I don't think) because I don't believe the rulebook ever even uses the word \"reveal\" when talking about shadow cards. I would have to look again to be certain though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1385571","commentId":1385571,"userName":"TwiceBorn","timestamp":1419910052,"content":"Regarding how long characters remain committed to the quest:\n\n \n\n\"Characters committed to a quest are considered committed to that quest through the end of the quest phase, unless removed from the quest by a card effect. They do remain exhausted once this step is complete\" (rulebook p. 14).\n\n \n\nRegarding what precisely is meant by \"revealed from the encounter deck\", see FAQ 1.22:\n\n \n\n(1.22) “When Revealed” Effects\nA card is only considered to be revealed if the card or\ngame effect causing the card to enter play specifically\nuses a form of the word “reveal”.\n \nExample: If the players use the Stage 3b “Don’t Leave\nthe Path!” (CORE 121) quest card effect to search\nfor a King Spider and put it into play, the “When\nRevealed” effect on the King Spider will not trigger,\nsince the effect on “Don’t Leave the Path!” does not\nspecifically use a form of the word “reveal.”\n \nTo my knowledge, a card's Shadow effect (lower half of those cards that have Shadow effects) seldom if ever begins with \"When Revealed.\" Shadow cards are \"dealt\" to players, \"flipped up,\" and then \"resolved\" (rulebook p. 18). Shadow cards are not \"revealed\" (and I appreciate that this can appear counter-intuitive). \n \nDoes this answer your questions?\n \nEDIT: You may also find this thread regarding Thalin's ability (and the official answers provided therein - make sure you read the whole thread, as the designer makes one ruling and shortly thereafter reverses it) of interest: http://community.fantasyflightgames.com/index.php?/topic/122991-thalin-and-revealed-from-discard-pile/?hl=thalin [https://community.fantasyflightgames.com/index.php?/topic/122991-thalin-and-revealed-from-discard-pile/?hl=thalin]\nEdited December 30, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1385572","commentId":1385572,"userName":"GrandSpleen","timestamp":1419910165,"content":"The core set manual tells that cards are \"revealed\" during the staging step of the quest phase.  Other times that cards come out, such as when you deal out shadow cards, the language \"reveal\" is (purposefully) not used.  And probably of more interest to you: there is an official FAQ here [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ.pdf] that answers some questions and provides some clarification.  Of interest may be this passage:\n\n \n\n(1.22) “When Revealed” Effects A card is only considered to be revealed if the card or game effect causing the card to enter play specifically uses a form of the word “reveal”. \n\n \n\nThe take-home message here being: cards are \"revealed\" during the staging step of quest resolution; any other time a card comes into play (like, per a card effect), do not consider it to have been \"revealed\" unless the card effect causing it to come into play specifically used the language \"reveal.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/130138-thalin-shadow-enemys-add-to-the-staging-area/?do=findComment&comment=1385677","commentId":1385677,"userName":"tripecac","timestamp":1419917691,"content":"Thanks!!!\n\n \n\nI need to catch up on reading all those FAQs!"}]}