{"url":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/","title":"One of those &quot;doh&quot; moments","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1383800","commentId":1383800,"userName":"tripecac","timestamp":1419797162,"content":"I was just playing the Seventh Level for the first time, 2 handed via OCTGN.  I got through the first quest phase pretty easily, and was slowly making progress in the second.\n\n \n\nAnd then I got what I thought was a particularly unlucky encounter card draw.\n\n \n\nBecause I was on the second phase (The Fate of Balin), I needed to reveal an additional 2 encounter cards for each phase.  So that's 4 total.\n\n \n\nSo I drew my first encounter card.  And it had Surge.  So I drew the next encounter card, trying to remember that I still had 3 to go after it.  And it said Doomed 2.  So I drew 2 more cards, trying to remember that I still had 3 to go after them.  And one of them said Doomed 2.  So I drew 2 more, telling myself there were *still* 3 to go after them...  And then I drew the other 3.  The total encounter cards I drew that turn were 9.  And there was way too much threat in the staging area now, so I basically conceded, quitting OCTGN.\n\n \n\nDo you see the mistake I made?\n\n \n\nI was so occupied with keeping track of how many encounter cards I had left to draw that I confused the keywords \"Surge\" and Doomed\"; I was so focused on card counts that when I saw \"Doomed 2\" I was thinking \"2 cards\" not \"2 threat\", so I ended up over-drawing.  I really only should have drawn 5 cards, since only one had Surge.  I should have raised my threat by 4 (for the two Doomed 2s), but I could had survived that. But I didn't realize that when I quit OCTGN.  It was only after I closed OCGTN that I realized the mistake.\n\n \n\nOf course, thanks to OCTGN's lack of a Save feature, it was too late to \"fix\" the game.  Oh well.  Lesson learned...  I hope!\n\n \n\nHave you ever had a \"doh\" moment like that, where you thought you just lost a game, and quit, and then realized you'd been momentarily confused?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1383822","commentId":1383822,"userName":"joezim007","timestamp":1419798459,"content":"I got 3/4 the way through a two-handed game before I realized I was only revealing 1 encounter card per round..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384010","commentId":1384010,"userName":"Bullroarer Took","timestamp":1419813727,"content":"Doomed is not surge.\n\nBut more seriously, that is one of the reasons I hate playing two handed. Just so easy to make a mistake like that when there is so much going on.\n\nEdited December 29, 2014 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384083","commentId":1384083,"userName":"PsychoRocka","timestamp":1419819441,"content":"> I was just playing the Seventh Level for the first time, 2 handed via OCTGN.  I got through the first quest phase pretty easily, and was slowly making progress in the second.\n> \n>  \n> \n> And then I got what I thought was a particularly unlucky encounter card draw.\n> \n>  \n> \n> Because I was on the second phase (The Fate of Balin), I needed to reveal an additional 2 encounter cards for each phase.  So that's 4 total.\n> \n>  \n> \n> So I drew my first encounter card.  And it had Surge.  So I drew the next encounter card, trying to remember that I still had 3 to go after it.  And it said Doomed 2.  So I drew 2 more cards, trying to remember that I still had 3 to go after them.  And one of them said Doomed 2.  So I drew 2 more, telling myself there were *still* 3 to go after them...  And then I drew the other 3.  The total encounter cards I drew that turn were 9.  And there was way too much threat in the staging area now, so I basically conceded, quitting OCTGN.\n> \n>  \n> \n> Do you see the mistake I made?\n> \n>  \n> \n> I was so occupied with keeping track of how many encounter cards I had left to draw that I confused the keywords \"Surge\" and Doomed\"; I was so focused on card counts that when I saw \"Doomed 2\" I was thinking \"2 cards\" not \"2 threat\", so I ended up over-drawing.  I really only should have drawn 5 cards, since only one had Surge.  I should have raised my threat by 4 (for the two Doomed 2s), but I could had survived that. But I didn't realize that when I quit OCTGN.  It was only after I closed OCGTN that I realized the mistake.\n> \n>  \n> \n> Of course, thanks to OCTGN's lack of a Save feature, it was too late to \"fix\" the game.  Oh well.  Lesson learned...  I hope!\n> \n>  \n> \n> Have you ever had a \"doh\" moment like that, where you thought you just lost a game, and quit, and then realized you'd been momentarily confused?\n\nOk well first and foremost you are resolving the quest effect completely wrong.\n\n\"Forced: At the end of the staging step, reveal the top X cards of the encounter deck, adding all enemies to the staging area. Discard the other revealed cards without resolving them. X is the number of players.\"\n\nYou do not reveal two extra cards during staging, at the END of the staging step in fact you reveal x cards (2 for two handed) and add all enemies to the staging area. ALL OTHER CARDS whether treacheries or locations are discarded without being resolved which means that neither surge OR doomed trigger to begin with. \n\n \n\nSo in reality you should have only been revealing 2 cards, then another two but only adding these two to staging if they are enemies and instead discarding them if they are not. You were playing the entire stage completely wrong so your confusion between doomed and surge doesn't even matter. \n\n \n\nTwo handed play is fine you can't just jump in and play willy nilly though you need to read the rules several times and do things one step at a time and make sure not to miss anything. I find it really handy to have the core set turn flow (on the back pages) open near me anytime I play so that if its a quest with many time triggers or that is complex in other ways I play it slightly slower and more carefully than other more straight forward quests. \n\n \n\nI feel like overall many people play many aspects of this game wrong and don't really realise at all or will even argue the point (I remember the nightmare story of the guy drawing cards when he would quest or defend with beravor when she exhausts and refused to back down on it) if they are told what they are doing wrong. It certainly takes a lot of strategy and smarts to play this game properly and I find that many people don't put in the time to learn what they are actually doing and the various intricacies of this game and just jump in and make many mistakes that they aren't even aware of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384104","commentId":1384104,"userName":"GrandSpleen","timestamp":1419821925,"content":"My favorite \"doh\" moment isn't even my own.  Legolas18 has an awesome signature here on the forums:\n\n \n\n\"Playing an intense scenario, on the last stage, right when you notice you've been playing with two Bofurs the whole time.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384128","commentId":1384128,"userName":"tripecac","timestamp":1419823565,"content":"> Ok well first and foremost you are resolving the quest effect completely wrong.\n\nYeah, I was fumbling all over the place, in a rush to finish the game before work!  (I realllllly wish OCTGN would let me save!) It was the first time I'd played in months, so I was extra-sloppy! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAnyway, thanks for the clarifications!\n\nEdited December 29, 2014 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384362","commentId":1384362,"userName":"Olorin93","timestamp":1419847602,"content":"I had a \"doh\" moment about a year and a half ago, but the other way around.\n\n \n\nTwo friends and I were trying Dol Guldur for the first time. I played Noldor/Dúnedain, they played Gondor and Rohan respectively. They both died, but urged me to keep going and push through the last stage. I played my favourite lineup of the time: Elrond/Loragorn/Spirfindel, and kept pushing out allies with Vilya. With Gildor, Haldir, Gandalf, Arwen and lots and lots of other willpower-focused allies, I had pretty much quested for everyone throughout the game. When it came to staging on the last quest stage, I was so focused on counting willpower vs threat that I forgot (or maybe I didn't even know) that I was only supposed to reveal 1 card per turn and not 3 like before. My friends stopped me just as I flipped the 3rd card.\n\n \n\n(I still won questing and eventually cleared the third stage thanks to raw questing power, but if they hadn't pointed it out I could've been overrun in the long run.)\n\nEdited December 29, 2014 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130104-one-of-those-doh-moments/?do=findComment&comment=1384370","commentId":1384370,"userName":"MyNeighbourTrololo","timestamp":1419848554,"content":"It was sort of a \"doh\" moment for me, when after an extremely struggling game of Trouble in Tharbad, when we made it out barely by the skin of out teeth, and then I realized Aragorn should have been discarded at the second round for resetting the threat :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] Fun game it was, though. Not regretting for playing it to the end without realizing."}]}