{"url":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/","title":"Dori - Gloin combo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1384704","commentId":1384704,"userName":"gandalfDK","timestamp":1419871174,"content":"Hello all,\n\nI have recently bought the Hobbit UHaOH saga expansion. With that comes Dori which reads: \"After a hero is assigned any amount of damage, exhaust Dori to place that damage on Dori instead\".\n\nQuestion is simple: can I still trigger Gloins (the hero Core Set version) response when I use Dori? I think yes, because it says 'when a hero IS assigned' so it is already 'suffers'.\n\nThanks for answers in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1384775","commentId":1384775,"userName":"GrandSpleen","timestamp":1419874120,"content":"I think no.  The Dori card make a distinction between \"assigning\" and \"placing\" damage.  Dori takes the damage after it has been \"assigned\" and so it has never been \"placed\" on the card (no tokens ever go on the card).\n\n \n\nThe Gloin uses the curious wording of \"suffers.\"  I take that to mean \"has damage placed on him.\"  No damage is ever placed on Gloin, so the response could not be triggered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1384817","commentId":1384817,"userName":"gandalfDK","timestamp":1419875872,"content":"Yeah, but I could interpet that suffers is equal to assigning. Not that I do, but since I have only seen the wording 'suffers' on Gloin we can't really give it a definition, can we?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1385579","commentId":1385579,"userName":"GrandSpleen","timestamp":1419910428,"content":"It's on a couple more early cards (Wilyador from A Journey to Rhosgobel and Shadow Key from Escape from Dol Guldur).  But you're right, any definition we give it has to be conjecture unless we get official clarification.\n\n \n\nGo ahead and submit a question to the developers.  But you know in your heart of hearts what the answer will be!  Right now you're in that spot... that spot that we have all been in a bunch of times.  \"I really want this to work... but I kind of know that it doesn't work.  But I see a loophole....\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1385582","commentId":1385582,"userName":"GrandSpleen","timestamp":1419910656,"content":"p.s. the reason I don't expect this combo to work:  If damage is placed on a characer and then, afterward, moved to Dori, the original character has a window to be killed by the damage.  I don't believe this is how Dori is supposed to work.  He throws himself into the line of fire, intercepting the damage so that it is never placed on the original character to begin with.  This was the original character never takes damage (is \"assigned\" damage which is never \"placed\"), and there is no chance that it will die from the damage.\n\n \n\nDori's value would be substantially reduced if he could not prevent potentially fatal damage.\n\nEdited December 30, 2014 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1385824","commentId":1385824,"userName":"gandalfDK","timestamp":1419936513,"content":"Yeah I understand. Actually from your second answer I may rather not want it to work. Dori´s value would certainly not be worth resources anymore.. \n\n \n\nWell, I kinda want to send in the question just for the sake of it, but you´re right. No I have, Yes I can get. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130200-dori-gloin-combo/?do=findComment&comment=1394481","commentId":1394481,"userName":"gandalfDK","timestamp":1420543382,"content":"> Hi Diedert,\n> \n>  \n> \n> You cannot trigger Gloin’s ability unless you actually place the damage tokens on him. Dori’s ability intercepts the damage before it is placed on the hero.\n> \n> I hope you’re enjoying The Hobbit saga expansion!\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\nEdited January 6, 2015 by gandalfDK"}]}