{"url":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/","title":"Escape from Darkness + Abandoned Tools + active location = ???","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1386978","commentId":1386978,"userName":"tripecac","timestamp":1419994689,"content":"The active quest is Escape from Darkness.  One hero has the abandoned tools.  There is an active location.\n\n \n\nQuestions:\n\n \n\n1) If you successfully quest, can you put progress tokens against the active location?  OR does Escape from Darkness prohibit that?\n\n \n\n2) If you exhaust the hero at the end of the refresh phase to use the abandoned tools, would you put the progress tokens on Escape from Darkness or the active location?\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1387236","commentId":1387236,"userName":"TwiceBorn","timestamp":1420014261,"content":"1) Yes, if you quest successfully, you can place progress tokens on the active location. The card only specifies that \"progress tokens cannot be placed on Escape from Darkness except by Abandoned Tools.\" If the quest stage prohibited the placement of progress tokens on the active location, there would be explicit wording to that effect.\n\n \n\n2) Progress tokens from the use of Abandoned Tools during the refresh phase would be placed on the active location before being placed on the active quest. I believe this interpretation is supported by two entries in the FAQ document:\n\n \n\n(1.27) Bypass the active location\n\nThe only time an active location does not act as a\nbuffer for progress to be placed on a quest is when card\ntext specifically instructs the players to “bypass” the\nactive location.\n \nOf perhaps even greater relevance is the following entry:\n \nQ: Does the effect on Legolas (CORE 5) place progress\ntokens on an active location, if there is one?\n \nA: Yes. Always place progress tokens on an active\nlocation instead of the quest, unless the ability\nspecifically states to bypass any active location.\n\n \n\nLegolas's ability reads: \n\n \n\nResponse: After Legolas participates in an attack that destroys an enemy, place 2 progress tokens on the current quest.\n\n \n\nLegolas' attacks normally occur during the combat phase (i.e., outside of questing, unless some in-game effect would trigger it earlier), so I think that sets a solid precedent that also applies to the placement of progress tokens following the use of Abandoned Tools during the refresh phase in the relevant quest stage (Search for an Exit - Escape from Darkness).\n\nEdited December 31, 2014 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1387599","commentId":1387599,"userName":"tripecac","timestamp":1420040333,"content":"Thanks for the clarification.\n\n \n\nIt sort of makes sense, except for the cardinal rule that a card's text overrides all other rules (including FAQs that do not specifically reference that card).  So when a card specifically refers to itself (as Escape from Darkness does), it *seems* like we should take the card's text literally.\n\n \n\nAlso, it seems a bit weird that we have an inconsistency in the interpretation of these 2 phrases from the card's text:\n\n \n\n1) \"put a progress token on Escape from Darkness\" means \"put a progress token on the active location, if there is one, otherwise Escape from Darkness\"\n\n \n\n2) \"progress tokens cannot be placed on Escape from Darkness\" means \"progress tokens cannot be placed on Escape from Darkness, though they can be placed on the active location\".\n\n \n\nSo, the \"put\" phrase includes the active location, but the \"place\" excludes it.  Odd!\n\n \n\nDid this quest card drive everyone crazy \"back in the day\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1387618","commentId":1387618,"userName":"GrandSpleen","timestamp":1420041184,"content":"Yeah, it's historically been 'sticky.'  As I understand it from an old thread on bgg here [http://boardgamegeek.com/thread/1254416/boromir-tactics-and-escape-moria], one of the original designers ruled long ago that Abandoned Tools does not bypass the active location.  Later, one of the current designers ruled the opposite (forgetting about or unaware of the original ruling).  Big fuss on the bgg forums, someone submitted the question again, and the newer ruling was reversed/revoked/what-have-you, so the original ruling stands and you still have to clear the active location before you can place progress tokens on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1387800","commentId":1387800,"userName":"tripecac","timestamp":1420049196,"content":"I wonder if the original ruling was upheld simply because it was the original ruling. \n\n \n\nIt makes sense; if a precedence is set, it should be followed.  Otherwise, people will be second-guessing rulings forever.\n\n \n\nHowever, in this case, I think the original ruling ended up creating an inconsistency, first with the priority rule (card text overrides other rules) and then with whether or not active locations are included in the phrase \"on Escape from Darkness\".\n\n \n\nAre there other cards in later quests (or expansions) where there are similar inconsistencies?  And are the \"original rulings\" for those cards at least consistent with each other?  Or is it somewhat chaotic, where there is no way to predict what an \"original ruling\" might decide?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130343-escape-from-darkness-abandoned-tools-active-location/?do=findComment&comment=1388111","commentId":1388111,"userName":"GrandSpleen","timestamp":1420064159,"content":"I can't think of anything off the top of my head that leads to counterintuitive in a specific scenario or situation.  But I'm sure there's something.\n\n \n\nGenerally I find the rulings to be predictable and logical, but there are certainly times that an answer comes back and throws us all for a loop.  Sorry I don't think any specifics for ya."}]}