{"url":"https://community.fantasyflightgames.com/topic/130603-combat-questions/","title":"combat questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1389874","commentId":1389874,"userName":"rosacatherine19","timestamp":1420226052,"content":"Two (possibly stupid - I'm new here) questions:\n\n  Do ally cards get disposed of every round?\n\n    Do different heroes/allies have to attack and defend in each round?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1389906","commentId":1389906,"userName":"Khamul The Easterling","timestamp":1420227874,"content":"Hello,\n\n \n\nAlly cards do not get disposed of each round.  The most common way of ally cards leaving play is when they are destroyed by receiving damage tokens equal to the ally's amount of hitpoints.  Or sometimes a special card effect will remove allies from play.  However, there is no limit of how long an ally can remain in play. \n\n \n\n \n\nAs for your second question, I'm a bit confused on what you are asking.  You ask:\n\n \n\n\"Do different heroes/allies have to attack and defend in each round?\"\n\n \n\nWell, when it comes the the combat phase, you first decide if you want to defend any possible attacking enemies engaged with you.  Usually you always want to.  You can defend an enemy by exhausting a ready character (hero or ally - your choice).   Remember though, only 1 character may defend a single enemy.  You can not add up multiple character's defence to defend an enemy.  Although it usually is a good choice to defend, you do not have to defend.  If you choose not to defend an enemy, then the attack will go undefended and the damage must be assigned to one of your heroes.  After all enemy attacks are resolved, you may attack enemies.  So, if you have any ready heroes or ally's remaining, you may declare attacks on your engaged enemy's.  It does not matter who you attack with, you can attack with any combination of the remaining ready characters you have.  \n\n \n\nI'm not sure if you answered your question completely so let me know if I did not.  \n\nFeel free to ask any more questions,\n\nKhamul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1390060","commentId":1390060,"userName":"TwiceBorn","timestamp":1420234786,"content":"If you select a particular hero or ally to defend, then that same hero or ally cannot be selected to make an attack in the same phase unless they have a power or attachment (e.g., unexpected courage from the Core set) that allows them to do so. Some event cards might also allow a character to both attack and defend in the same round.\n\n \n\nSo if I understand your second question correctly, then the answer would be yes, but exceptions apply."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1396356","commentId":1396356,"userName":"muttlee","timestamp":1420647829,"content":"I am also new to the game and have a defending related question.\n\nCan you use the same character to defend multiple attacking enemy's if your character is still alive after every attack or because he has exhausted for the 1st attack means he can no longer do anything until after the refresh phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1396376","commentId":1396376,"userName":"Teamjimby","timestamp":1420648856,"content":"> I am also new to the game and have a defending related question.\n> \n> Can you use the same character to defend multiple attacking enemy's if your character is still alive after every attack or because he has exhausted for the 1st attack means he can no longer do anything until after the refresh phase?\n\nThey would exhaust after the first attack and therefore can't defend or attack unless you have a way to ready them first (like Unexpected Courage)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130603-combat-questions/?do=findComment&comment=1396445","commentId":1396445,"userName":"muttlee","timestamp":1420651337,"content":"Many thanks teamjimby :-) this has clarified 1 of a few questions I have :-D so much to learn!"}]}