{"url":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/","title":"There is one thing in the Warhammer 40k: Conquest LCG called &quot;signature squard&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1393968","commentId":1393968,"userName":"MyNeighbourTrololo","timestamp":1420501672,"content":"To those unfamiliar: each warlord (sort of hero) of this game always comes with a 8-card set, called his \"signature squad\", a cards that are created to specificly support this heroe's mechanics and stuff, which must always be included when you're choosing that warlord.\n\n \n\nI'm just curious of people's opinion. There are heroes like Elrond or Gandalf who are extremely strong by themselves but boosted even further with the attachments that could be only used by them (or almost), and there are just heroes. What if LotR LCG had something like that? If each hero had his little signature set of 5 cards that you always must include and that greatly support those heroes. A deckbuilding space would be reduced to 35(or 40 in case of secrecy) cards your choosing per deck, but it would increase \"thematicness\" and allow to some ballsy hero mechanics. Whaddya think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394013","commentId":1394013,"userName":"chrsjxn","timestamp":1420504541,"content":"Maybe if they did it in a more interesting way than in Conquest, I'd be in favor. But as it is, the 1-ofs in conquest are a major weakness of the game in my mind because of the variability they introduce."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394037","commentId":1394037,"userName":"Bullroarer Took","timestamp":1420506491,"content":"How many warlords do you get when the game starts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394044","commentId":1394044,"userName":"Robin Graves","timestamp":1420506949,"content":"Why not? It's not that big of a deal in my opinion: but certainly adds theme. Now with 40C they went with very generic commanders (Sicarius and Nazdreg aside, and even then) but I can see it work better in LOTR.\n\n \n\nStuff like (and I'm just gonna make up card names okay, not that familiar with the LOTR card game)\n\n \n\nAragorn comes with his signature cards;\n\n \n\nStrider\n\nKingsfoil\n\nElessar\n\nShards of Narsil\n\nFullfill your Oaths!\n\nRanger of the Norh\n\nEdited January 6, 2015 by Robin Graves"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394045","commentId":1394045,"userName":"Robin Graves","timestamp":1420507056,"content":"> How many warlords do you get when the game starts?\n\n \n\nOne; and if your warlord dies (damage equal to his hitpoints= makes it bloodied, it takes damage equal to it's (reduced) hit points again it's fatal) it's game over."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394395","commentId":1394395,"userName":"danpoage","timestamp":1420530740,"content":"While I feel that this works for Conquest, I am not a fan of it for LotR, because our card pool is smaller and grows more slowly relative to competitive LCGs. Also sphere resource requirements are more strict that the faction requirements in Conquest (once you choose a faction in Conquest, you can pay for its units using your normal resources - there is no \"resource match\" issue).\n\n \n\nWe are finally at a point where we can flesh out 50 card decks that are truly unique. Having a 42-45 card deck would feel like a step backward. Granted this is coming from someone who takes particular enjoyment from finding new and interesting archetypes, so I want those extra card slots for less obvious choices. Still, for those who are most interested in theme, this might be a great option - it's just not for me. With many of the heroes you mentioned, it would not be hard to go ahead a make the signature lists, and use them as a house rule.\n\nFor example:\n\nElrond: Vilya x3, Imladris Stargazer x2, Elrond's Counsel x3\nGaladriel: Nenya x3, Galadriel's Handmaiden x3, Miruvor x2\nGandalf: Gandalf's Staff x3, Wizard Pipe x3, Expert Treasure-hunter x2\nGlorfindel: Light of Valinor x3, Asfaloth x3, Elf-stone x2\nBoromir (Tactics): Gondorian Shield x3, Captain of Gondor x2, Gondorian Fire x2, Horn of Gondor x1\nSam Gamgee: Hobbit Cloak x3, Bill the Pony x3, Second Breakfast x2\n\nNotice, though that some of the obvious signature cards would not be playable by the hero without help (via a ring, songs, or other heroes), which is where the comparison between Conquest and LotR kind of falls apart.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394402","commentId":1394402,"userName":"Glaurung","timestamp":1420531427,"content":"With a slow grow card pool as lotr does maybe is not good idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394474","commentId":1394474,"userName":"MyNeighbourTrololo","timestamp":1420542367,"content":"> While I feel that this works for Conquest, I am not a fan of it for LotR, because our card pool is smaller and grows more slowly relative to competitive LCGs. Also sphere resource requirements are more strict that the faction requirements in Conquest (once you choose a faction in Conquest, you can pay for its units using your normal resources - there is no \"resource match\" issue).\n> \n>  \n> \n> We are finally at a point where we can flesh out 50 card decks that are truly unique. Having a 42-45 card deck would feel like a step backward. Granted this is coming from someone who takes particular enjoyment from finding new and interesting archetypes, so I want those extra card slots for less obvious choices. Still, for those who are most interested in theme, this might be a great option - it's just not for me. With many of the heroes you mentioned, it would not be hard to go ahead a make the signature lists, and use them as a house rule.\n> \n> For example:\n> \n> Elrond: Vilya x3, Imladris Stargazer x2, Elrond's Counsel x3\n> \n> Galadriel: Nenya x3, Galadriel's Handmaiden x3, Miruvor x2\n> \n> Gandalf: Gandalf's Staff x3, Wizard Pipe x3, Expert Treasure-hunter x2\n> \n> Glorfindel: Light of Valinor x3, Asfaloth x3, Elf-stone x2\n> \n> Boromir (Tactics): Gondorian Shield x3, Captain of Gondor x2, Gondorian Fire x2, Horn of Gondor x1\n> \n> Sam Gamgee: Hobbit Cloak x3, Bill the Pony x3, Second Breakfast x2\n> \n> Notice, though that some of the obvious signature cards would not be playable by the hero without help (via a ring, songs, or other heroes), which is where the comparison between Conquest and LotR kind of falls apart.\n> \n>  \n\n \n\nI did not meant blind conversion, but smart adaptation.\n\n \n\nExample: Ofc, unliike in conquest, LotR games feature 2-3 heroes from each player, so \"signature squad\" set should be lower than 8. Something around 5 or even 3. Imagine if Thalin came with a set of allies (probably dwavers) that have meh stats but get their attack dramatically boosted when attacking an enemy with at least 1 wound."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394558","commentId":1394558,"userName":"Rapier1","timestamp":1420549908,"content":"I don't quite see the point? I mean why do this instead of leaving it optional?\n\nI already can build a highly thematic deck if I want - I also have the choice not too.\n\nThis change would just reduce my deck building choices?\n\n \n\nIn a competitive game I can see it having value to balance out different leaders (and that might be necessary in the 40k licence).\n\n \n\nIn Conquest, they can use it to make better heroes (Say an Ork Warboss) have a worse signature squad (Regular boyz) and so be balanced more against a weaker leader (an Imperial Guard General).\n\n \n\nI can also see the value of having restricted cards that can only go with certain leaders. But we already have that with cards that target a specific named hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394620","commentId":1394620,"userName":"MyNeighbourTrololo","timestamp":1420554075,"content":"Theoreticly, a couple of cards that must go with a certain hero but otherwise free to include in any deck in any combination given the absence of hero is loads better than having a card that could only be played with a certain hero present, regardless of anything. Just theoreticly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394695","commentId":1394695,"userName":"Rapier1","timestamp":1420558253,"content":"> Theoreticly, a couple of cards that must go with a certain hero but otherwise free to include in any deck in any combination given the absence of hero is loads better than having a card that could only be played with a certain hero present, regardless of anything. Just theoreticly.\n\n \n\nI'm not sure that's even theoretically true.\n\n \n\nA card that can only be played with a certain hero present allows you to carefully tailor the power of cards. Vilya has a powerful effect but you  lose a good hero action for it (Elrond being generally all around good). If you could put it on a Hobbit it would be far more powerful as a card.\n\nThe only reason for signature cards that I can see is a means of forcing a more powerful hero to have a less good deck. For balance reasons. (It might be neat to have for a single hero, say a Glorfindel style, lower threat than it should have, but the cost is in having a \"bad\" card forced into your deck. Maybe along the doomed theme)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394704","commentId":1394704,"userName":"MyNeighbourTrololo","timestamp":1420558628,"content":"\"A card that can only be played with a certain hero present allows you to carefully tailer the power of cards.\" Yeah, that's from the designer perspective. What do we get in terms of deckbuilding from player perspective? A dead card.\n\n \n\nThe \"weak\" hero can be promoted the same way the strong one can be dragged down. It's about hero overall theme after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394755","commentId":1394755,"userName":"Epi Lepi","timestamp":1420560943,"content":"I thought you didn't like cards like Firefoot where the card is almost de facto exclusively for a specific hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394885","commentId":1394885,"userName":"MyNeighbourTrololo","timestamp":1420566412,"content":"I didn't I don't like the cards that are slapped over a specific name, because illusion of a choice is better than a lack of one. And between two evils, as the say, I pick a lesser one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394894","commentId":1394894,"userName":"joezim007","timestamp":1420566903,"content":"How about a similar, yet quite different approach:\n\n \n\nEach hero in the game comes with 2 (maybe 3) special cards tailored for them. When you build a deck, you may have a total of these special cards included with the deck equal to the number of heroes you are playing with (e.g. if you are using 3 heroes, you can include 3 total special cards with your deck; 2 special cards with a 2-hero deck, etc.). These special cards come into play during setup automatically.\n\n \n\nEssentially, it ends up being similar to just choosing some optional special abilities for your heroes. In a 3-hero deck you could include 2 special cards from one hero, 1 from another, and none from the final hero. You could use whatever combination you like. Some of the cards could be allies, so it's a little different than just choosing an optional special ability, and some cards could be events, which would just go straight to your hand instead of entering play.\n\n \n\nI'd hate to have the cards end up in your deck because I hate having 1x cards (for the most part) and they take up deck space. This alternative idea would avoid those pitfalls, but it may be a bit overpowered. Maybe we could just give each hero 1 card and only allow 1 total cards to be chosen.\n\n \n\nIn any case, this is all just theoretical and hypothetical, so there's no real purpose to arguing what the best way to do it is. It's definitely an interesting idea though.\n\n \n\n> I thought you didn't like cards like Firefoot where the card is almost de facto exclusively for a specific hero?\n\n \n\nMostly he's just upset that every time a card like that comes out, it takes up a slot that could be used for a more generic card. Using this system, I'd assume they would just be printed in addition to the current printed card numbers and would make it so fewer \"normal\" player cards would be targeting specific heroes, so it's a win-win: More player cards and fewer of the normal player cards are targeted to specific heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/130963-there-is-one-thing-in-the-warhammer-40k-conquest-lcg-called-signature-squard/?do=findComment&comment=1394930","commentId":1394930,"userName":"Distractionbeast","timestamp":1420568727,"content":"I'm not so sure this is a big deal, personally.  I still think the best approach is to avoid cards that are only compatible with a single character.  Having a \"kicker\" effect for a specific character is fine.  But to take the card pool and create a hard rift in it by placing such specific restrictions on a player card should be done very sparingly and deliberately - probably for thematic reasons alone, since there are always other ways to balance such cards for gameplay.\n\n \n\nAs Mr. Beorn wrote about so eloquently long ago (https://hallofbeorn.wordpress.com/2013/01/05/key-concepts-synergy/ [https://hallofbeorn.wordpress.com/2013/01/05/key-concepts-synergy/]), this is the basic difference between combos and synergies.  Synergies should be encouraged as they free up player choice and expand deckbuilding possibilities, while combos should be limited because they shackle players to specific chains of individually useless cards.  \n\n \n\nIf you want to put more character-specific cards in, I'd have to recommend treating them with special rules.  Like have a separate deck for these character-specific cards.  As a planning action, you may pay some cost to choose one and put it into your hand.  Not that I'd advocate doing this at all anyway since the game is awesome as it is..."}]}