{"url":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/","title":"Multiple shadow cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/?do=findComment&comment=1396023","commentId":1396023,"userName":"koriakin97","timestamp":1420626544,"content":"When enemy has multiple shadow cards do I reveal them all at once or one by one? Sometimes there are nasty effects which I would like to cancel (like discarding attachments), but I can't because another shadow effect can be worse (and kill my hero). In rules it is stated to reveal a shadow card and resolve its effects, so it's hard to say if I reveal them all at once so that I can choose which effect to cancel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/?do=findComment&comment=1396093","commentId":1396093,"userName":"SauronTheGreat","timestamp":1420632184,"content":"first, It depends upon the enemy.  they will usually specify.  in the case of the beastmaster in the core set, it says \"deal an additional shadow after the attack\" so the this one is after the attack.  concerning your first q, I believe (don't quote me on this) that they are revealed one at a time rather that all at the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/?do=findComment&comment=1396100","commentId":1396100,"userName":"alogos","timestamp":1420633195,"content":"Yes, I have seen it somewhere that you reveal them one by one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/?do=findComment&comment=1396307","commentId":1396307,"userName":"koriakin97","timestamp":1420645393,"content":"Thanks for answers. I was thinking about enemies from heirs of numenor who give more shadow cards or shadow effects giving 4 shadow cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131130-multiple-shadow-cards/?do=findComment&comment=1408312","commentId":1408312,"userName":"chadgar24","timestamp":1421365715,"content":"One at a time. There has been an official answer about the morgul bodyguard shadow effect 'immediately attack next player' And even if the attacking enemy has multiple shadow cards and the first one is that shadow effect you discard the other shadow cards without resolving them. Therefore you reveal one at a time and deal with each one at that moment. Which means you have to decide at that moment to use hasty stroke or not."}]}