{"url":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/","title":"optionally engaging an enemy question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/?do=findComment&comment=1397411","commentId":1397411,"userName":"muttlee","timestamp":1420716344,"content":"Hello all\n\nI was hoping someone could help clarify somethings for me.\n\nIf mu threat was let's say 30 and and enemy with a threat of 35 was placed in the staging area, that enemy cant attack me until my threat was 35 or higher. Now if I.wanted I could optionally engage him before I reach 35 threat and bring him down for some fistie cuff action. If I chose to do this my question is this\n\nDoes that enemy get a shadow card dealt?\n\nIf that enemy is still alive after ive attacked it can it then attack me in the combat phase or does it have to wait till next turn?\n\nCan you gang up and optionally engage with 2 or more available cards?\n\nIf you optionally engage your card can no longer participate in the combat phase of that turn because he is now exhausted?\n\nMany thanks and sorry for what.seems a silly question\n\nEdited January 8, 2015 by muttlee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/?do=findComment&comment=1397418","commentId":1397418,"userName":"Nerdmeister","timestamp":1420717182,"content":"Every player has the choice to optionally engage one enemy.\n\nAll enemies engaged with players get shadow cards at the beginning of the combat phase.\n\nYou do not get to attack and enemy right after you have engaged it. You will have to wait until the combat phase.\n\nEngaging and attacking are two distinctly separate actions. Engage means that you put the enemy in front of the player who engaged it; attacking means that you exhaust character(s) in an attempt to kill off enemies (mostly the ones you are engaged with).\n\nEngaging does not require any character to exhaust; it is a player choice (if optionally engaged anyway)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/?do=findComment&comment=1397435","commentId":1397435,"userName":"muttlee","timestamp":1420718939,"content":"Thanks for the reply, i only got the game at Xmas and all of the videos I've watched no1 has optionally engaged.\n\njust so I've got this right. If I choose to optionally engage an enemy I just bring him down and then wait for the combat phase to start, he gets a shadow card and attacks first etc etc.\n\nLooks like I'll have to reply the scenario with the troll from the core set because I've totally misunderstood the hole thing of optionally engaging an enemy haha :-)\n\nThanks again for the reply"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/?do=findComment&comment=1397472","commentId":1397472,"userName":"Nerdmeister","timestamp":1420721862,"content":"You´re welcome  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnd yes, you´ve got it right now"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131240-optionally-engaging-an-enemy-question/?do=findComment&comment=1397663","commentId":1397663,"userName":"joezim007","timestamp":1420731571,"content":"Yea, whether you optionally engage an enemy or the enemy engages you normally, the combat is exactly the same. You can even optionally engage enemies that have a low enough engagement value to engage you automatically. The biggest reason to do this is to prevent an enemy from engaging another player who can't handle the combat as well."}]}