{"url":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/","title":"Questions that need to be answered","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/?do=findComment&comment=1399601","commentId":1399601,"userName":"Dwarf king Bronze beard","timestamp":1420838491,"content":"So i had to ask some of these like a week ago but i didn't have time or i forgotted, but now finally i can ask these things.\n\n \n\nIf Murzag attacks and reveals an enemy, do i have to resolve the revealed enemy's attack too and if i have to, does it attack to the current defender (if there is one), can i decleare new defender or is that attack undefend?\n\n \n\nffg_murzag-tmv.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_murzag-tmv.jpg]\n\n \n\nWhat happens if there are equal number of tokens on the dead villagers and the rescued villagers?\n\n \n\nffg_dead-villagers-eaad.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_dead-villagers-eaad.jpg]   ffg_rescued-villagers-eaad.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_rescued-villagers-eaad.jpg]\n\n \n\nIf trechery card is revealed from the encounter deck and i cancel it with test of will, does Gondorian hamlet's forced effect trigger?\n\n \n\nffg_gondorian-hamlet-eaad.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_gondorian-hamlet-eaad.jpg]\n\n \n\nCan someone clarify me this card's shadow effect as detailed as possible? It's really confusing to me. \n\n \n\nffg_morgul-bodyguard-tmv.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_morgul-bodyguard-tmv.jpg]\n\n \n\nIf Morgul sorcerer would have been dealt to an enemy as shadow card and i would choose this attack undefend, could i choose any of my heroes as an target of attack or would the attacking enemy attack to a hero that was defending the attack?\n\n \n\nffg_morgul-sorcerer-tmv.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_morgul-sorcerer-tmv.jpg]\n\n \n\nAnd then final question: Can i use test of will to a treachery card with a keyword, before resolving any of it's keywords? (i knew this once but i don't remeber it anymore)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/?do=findComment&comment=1399726","commentId":1399726,"userName":"GrandSpleen","timestamp":1420842562,"content":"That is a lot of questions!  Here's your gentle reminder: if you have a question about an older quest, it's probably been asked before.  You can answer it yourself pretty easily by typing the card name (e.g., \"Murzag\") into the search function at the top of the page.  Just make sure you're the \"Rules\" forum when you do it (by default, the search engine will search the forum -- or thread-- that you currently have displayed).\n\n \n\nMurzag: when he reveals an enemy, that enemy will indeed get its own attack, since you are still resolving enemy attacks when it gets revealed, and will attack the engaged player.  It gets no shadow card for this attack, because shadow cards are dealt at the beginning of the combat phase and that moment has already passed.  It operates just like any other attack and you can declare a defender, leave it undefended, or whatever.  Official answer is from this thread here [https://community.fantasyflightgames.com/index.php?/topic/94687-morgul-vale-captain-murzag-forced-effect-question/?hl=murzag].\n\n \n\nEncounter at Amon Din win condition: (dead villages vs. rescued villagers): You do need to have more.  If it's a tie, you lose.  \"Not winning\" is the same as \"losing\" in this game, I suppose!  Although the cards themselves don't spell that out, the rule sheet for Amon Din says \" In order to win the game, the players will need to collect more villager tokens on Rescued illagers thandamage tokens on Dead Villagers.\"\n\n \n\nGondorian Hamlet: effect will still trigger even if you cancel the revealed treachery card.  Although the treachery card's *effects* were canceled, the treachery card itself was still revealed and will trigger the Hamlet's effect.\n\n \n\nMorgul Bodyguard shadow effect (and many other shadow effects like it): after you finish the attack (placing damage tokens on your defender as necessary), move the attacking enemy to the next player (it engages the next player), deal it a new shadow card, and immediately resolve its attack.  The attacked player may choose a defender, or leave the attack undefended, as per usual.  After that attack, finish resolving any other enemies' attacks as per usual.  The \"next player\" is whoever would get the first player token after the person who is being attacked.  So it the first player triggers the shadow effect, the 'next player' is whoever gets the first player token next.  In a solo game, there is no 'next player' and this shadow effect does nothing.\n\n \n\nMorgul sorcerer shadow effect: since it is undefended, you can choose where the damage goes.  It does not have to go on the original defender.\n\n \n\nWhen Revealed cancellation: if you cancel the When Revealed effects of a card, you do not cancel its keywords.  Surge, Doomed, etc., all still apply."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/?do=findComment&comment=1400239","commentId":1400239,"userName":"Dwarf king Bronze beard","timestamp":1420879402,"content":"Thanks very much for helping me  ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/?do=findComment&comment=1506403","commentId":1506403,"userName":"Laco","timestamp":1427314831,"content":"> Morgul Bodyguard shadow effect (and many other shadow effects like it): after you finish the attack (placing damage tokens on your defender as necessary), move the attacking enemy to the next player (it engages the next player), deal it a new shadow card, and immediately resolve its attack.  The attacked player may choose a defender, or leave the attack undefended, as per usual.  After that attack, finish resolving any other enemies' attacks as per usual.  The \"next player\" is whoever would get the first player token after the person who is being attacked.  So it the first player triggers the shadow effect, the 'next player' is whoever gets the first player token next.  In a solo game, there is no 'next player' and this shadow effect does nothing.\n\nGrandspleen this does not match with official answer from Caleb. https://community.fantasyflightgames.com/index.php?/topic/94076-morgul-bodyguard-shadow-effect/#entry918167 [https://community.fantasyflightgames.com/index.php?/topic/94076-morgul-bodyguard-shadow-effect/#entry918167]\n\nDifference is in the word immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131389-questions-that-need-to-be-answered/?do=findComment&comment=1506467","commentId":1506467,"userName":"GrandSpleen","timestamp":1427317639,"content":"Thanks for pointing that out.  I forgot about that ruling, clearly.  It's a weird ruling, so I should remember it!"}]}