{"url":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/","title":"gondola trait, warrior trait, sentinels, noble etc","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/?do=findComment&comment=1398802","commentId":1398802,"userName":"muttlee","timestamp":1420803198,"content":"Hello\n\nI was wondering if there is anywhere that explains what things like these mean. I see on a lot of hero cards with things like warrior, ranger, noble, outlander etc on them and then attachment or event cards that allow you to give someone for example a warrior trait but what does he gain?\n\nIf im correct a ranged character can help oit with an attack on with another player and sentinals can help out with defence (in multiplayer games) but im stuck with the others\n\nMany thanks guys\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/?do=findComment&comment=1398872","commentId":1398872,"userName":"Nerdmeister","timestamp":1420808750,"content":"There are 2 different kinds of expressions you are referring to.\n\nFirstly there are the traits which are written with bold letters at the top of the text box. These never do anything by themselves but may be referenced by other cards, like \"attach to a Silvan hero\", \"all Dwarf characters get...\" or \"exhaust an Istari character to...\" and the traits therefore unlock certain cards for use or synergies.\n\nThe other expression is called a keyword and the effect of keywords are laid out in the back of the rule book. Some examples include ranged keyword to attack enemies engaged with another player and sentinel to defend against attacks made against another player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/?do=findComment&comment=1399582","commentId":1399582,"userName":"muttlee","timestamp":1420837892,"content":"Ok cool, so what would be the advantage then of having an all hobbit or dwarf or gondor etc setup? Im still trying to understand deck building but there is so much to learn! :-D\n\nThanks for the reply, this forum has been such a massive help just reading through the posts!\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/?do=findComment&comment=1399594","commentId":1399594,"userName":"jjeagle","timestamp":1420838218,"content":"You need to look for abilities and effects that key off a trait. The prime example would be Dain Ironfoot who gives a bonus to all Dwarf characters in play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/131333-gondola-trait-warrior-trait-sentinels-noble-etc/?do=findComment&comment=1399691","commentId":1399691,"userName":"muttlee","timestamp":1420841559,"content":"Massive study session is on the cards for me :-P\n\nThanks for the help"}]}