{"url":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/","title":"How to cut down length of play?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1404297","commentId":1404297,"userName":"jimjim19681968","timestamp":1421154084,"content":"I really love this game and am presently enjoying greatly the Forest Masters deck.\n\n \n\nMy only cripe is the game goes on too long.\n\n \n\nWithout reducing difficulty, is there a way to reduce the overall time the game takes to play?\n\n \n\nWhat is the average length? I would figure 60-90 minutes. I would like to get this down to 45-60mins\n\n \n\nTa for any help"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1404338","commentId":1404338,"userName":"Dwarf king Bronze beard","timestamp":1421157385,"content":"I would actually apreciate that advice too since when were playing multiplayer it can take even 2 hours to complete one scenario (i'm pointing at you to catch an orc). Ok maybe not 2 hours but almost. And of course it depends really much of the scenario you are playing.\n\n \n\nBut one way to make game little bit faster is using dices instead of tokens, it doesn't help much but it's little faster than using bunch of tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1404430","commentId":1404430,"userName":"Bullroarer Took","timestamp":1421161560,"content":"This is one of the reasons I prefer playing one handed solo. Multi-player can take so long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1404649","commentId":1404649,"userName":"l3afonthewind","timestamp":1421169375,"content":"There's not a whole lot you can do without potentially compromising the integrity of the board state, but depending on how much that concerns you, a couple suggestions:\n\n \n\n-All players plan simultaneously-\n\nReally the player by player planning only matters when players are affecting each other (like the turn player 4 plays an Errand Rider, he can't really help the other players with their basic planning), which doesn't happen all the time. Other than the potential for misplays, the other downside is that players can miss what other players are doing, and thus overlook tactical options later on. \n\n \n\n-All players Defend/Attack simultaneously-\n\nA big time saver, but has more of the same complications as planning simultaneously when you consider Ranged/Sentinel, and maintaining the correct order of Shadow cards dealt to players for additional attacks or additional Shadow cards dealt. However, if you ascribe to Schrodinger's Shadow Law, then it's less of concern.\n\n \n\n-Delegate-\n\nIf player 1 reveals cards from the deck for staging, player 2 stays on top of time counters, and player 3 watches for forced triggers etc., it takes the mental tax of maintaining the board off of one player, and helps move the game along.\n\n \n\n-Know the quest-\n\nKnowing how the quest stages work (forced triggers, restrictions, progression requirements), and how the enemies/treacheries/locations interact with one another saves time figuring it all out when playing. However, this usually requires one or more previous playthroughs, which doesn't really help the time issue there.\n\n \n\n-Have this site up in the background to help answer rules questions-\n\nhttp://lotr-lcg-quest-companion.com/  [http://lotr-lcg-quest-companion.com/%C2%A0]\n\n \n\n \n\nI usually find playtimes to be variable based both on the quest, as some are sloggier than others, and the number of players. In general, I'd say 45 mins is the baseline for solo, and you can add 15-30 mins for each player you add, depending on the quest. \n\n \n\nHope that helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1407029","commentId":1407029,"userName":"Rapier1","timestamp":1421290923,"content":"I think quest selection is the main issue.\n\n \n\nI would say that most of my 2 player games are less than 45 minutes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1407265","commentId":1407265,"userName":"Catastrophic09","timestamp":1421313509,"content":"All I can suggest are dice and avoiding certain quests that take long. After committing characters to the quest use dice to record what you quested for so after encounter cards are revealed you can quickly compare your quest power with strength in staging area. Using dice to keep track of these larger numbers really saves your brain, time and unnecessary recounting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/131796-how-to-cut-down-length-of-play/?do=findComment&comment=1407288","commentId":1407288,"userName":"jormungandr","timestamp":1421316559,"content":"Also: are you playing aggressive decks or turtling/control decks? Hero selection can make a huge difference, too. I had a Boromir deck that would either win or lose a lot of quests in about 4 turns. Another, Palantir-deck of mine often takes up to 20 turns to win a game. This comment is about single handed solo, 50% NM encounter decks."}]}