{"url":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/","title":"Guys, I need your opinion on this interesting issue","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408233","commentId":1408233,"userName":"Serazu","timestamp":1421362041,"content":"I just finished playing the Dunland Trap quest (bleh - it's too bland and difficult) and an interesting issue came up:\n\n \n\nI was at the 3B quest stage which mentions in its Forced text:\n\n \n\n> After the last time counter is removed from this stage, the players make engagement checks. Then, each engaged enemy makes an attack. If no heroes are destroyed by these attacks, the players win the game.\n> \n>  \n\n \n\nAfter the last time counter was removed, I followed the steps dictated and three Dunledings attacked me. I was at 49 threat. I survived the first and second attack and one remained. My defender was Frodo. He suffered 6-2=4 damage. He used his Response. I both survived all attacks, but at the same time, I passed the threat threshold. Did I win or not? I believe that I won, due to the golden rule on page 4 of the core rules (and almost every card game):\n\n \n\n> If the game text of a card contradicts the text of this rulebook, the text on the card takes precedence.\n> \n>  \n\n \n\nYour thoughts?\n\n \n\nAnd while we 're at it can you please tell me whether Chief Turch's Forced effect applies when he engages me? Is it treated as a Response, ergo it applies?\n\n \n\nMany thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408241","commentId":1408241,"userName":"Gizlivadi","timestamp":1421362381,"content":"Hmmm, I believe you lost. I mean, yeah, no heroes were destroyed, but as the attack resolved your threat was raised over 50, and I think that if your threat is 50 or more at any time, you automatically lose. So while you didn't lose due to losing a hero, you lost due to threat. The Golden Rule does not apply IMO since there is no contradiction between the quest card and the rulebook, it's two different effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408256","commentId":1408256,"userName":"joezim007","timestamp":1421363073,"content":"Hmm... the wording on Frodo is kinda ambiguous:\n\n \n\n>  \n> \n> Response: After Frodo Baggins is damaged, cancel the damage and instead raise your threat by the amount of damage he would have been dealt. (Limit once per phase.)\n\n \n\nI would expect it to say \"raise your threat to cancel the damage\", which would make it clear that the threat gain happens first, which would mean that you lost for sure. I'm going to say, though, that since there is still a step at the end of enemy attacks where you would be allowed to take actions, that the attacks haven't technically \"fully\" completed, so the threat gain happens first. The text says \"If no heroes are destroyed by these attacks, the players win the game.\" which implies that the attacks must finish, so you should think of it as \"After all attacks have finished, ...\".\n\n \n\nGizlavadi is also correct that the golden rule doesn't apply here. It would apply if the card mentioned something about the threat max being changed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408257","commentId":1408257,"userName":"Serazu","timestamp":1421363077,"content":"I thought about that too, but, while not obvious, I believe there is a contradiction here. The rules state: when your threat reaches 50, you lose. The card state: as long as you survive the final attacks, you win. The rules tell me that I lost, but the card tells me I won. Anyway, I'm not positive about anything, hence my question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408269","commentId":1408269,"userName":"Gizlivadi","timestamp":1421363652,"content":">  \n> \n>  \n> \n> The card state: as long as you survive the final attacks, you win.\n\n \n\nThat is, as long as you don't lose due to other lose conditions. The quest card only deals with losing due to a hero dying, not due to threat. If you were right, you would not lose if, for instance, your threat was over 50 while there are, say, 3 time counters in the last stage, and we can all agree that you would lose if that was the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408280","commentId":1408280,"userName":"Serazu","timestamp":1421364008,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > The card state: as long as you survive the final attacks, you win.\n> \n>  \n> \n> That is, as long as you don't lose due to other lose conditions. The quest card only deals with losing due to a hero dying, not due to threat. If you were right, you would not lose if, for instance, your threat was over 50 while there are, say, 3 time counters in the last stage, and we can all agree that you would lose if that was the case.\n> \n>  \n\n \n\nI do not say you are wrong. It's just that, at the same time I survived the attacks (victory condition), I also surpassed the threat threshold and I do not know what takes precedence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408303","commentId":1408303,"userName":"chadgar24","timestamp":1421365028,"content":"Let's look at the win condition for this one. Each quest has its own way of winning and that way is always assuming you did not lose by any other means. In this case you must survive the attacks in the attack phase. Which means...in essence..survive the attack phase, the entire attack phase. Which includes the player action window at the end of it. Normally surviving an action window is no problem, but in your case your threat was 50. So you lost, sorry. And even if you don't think the action window matters the resolution of that attack is removing the damage from Frodo and raising your threat instead. The raising of your threat is done in order to complete the attack ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408308","commentId":1408308,"userName":"Serazu","timestamp":1421365519,"content":"******\n\n \n\nAnyway, what about my question concerning the chieftain?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408338","commentId":1408338,"userName":"Gizlivadi","timestamp":1421367192,"content":"I remove the counter when he engages. I see no reason not to play it that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408339","commentId":1408339,"userName":"chadgar24","timestamp":1421367235,"content":"Yes it applies when he engages you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408349","commentId":1408349,"userName":"Serazu","timestamp":1421367845,"content":"Many thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408461","commentId":1408461,"userName":"Bullroarer Took","timestamp":1421374081,"content":"> Which means...in essence..survive the attack phase, the entire attack phase.\n\nThat is not stated anywhere in the rules and wrong I believe. This is a really interesting situation of simultaneous timing. Normally the first player gets to decide which occurs first, but the \"whichever is worst for the player\" effect runs strong through this one. I would ask."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408497","commentId":1408497,"userName":"Thanatopsis","timestamp":1421377415,"content":"It comes down to the order of a few key events:\n\n1. Frodo is damaged\n\n2. Damage is cancelled per reacation\n\n3. Threat is raised\n\nSo at which point has Frodo survived the attack? Between 2 and 3 or after 3? Does the reaction have to fully resolve or does survival \"interrupt\" the reaction?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408678","commentId":1408678,"userName":"MyNeighbourTrololo","timestamp":1421392326,"content":"I would bet that surviving an attack means that all steps of attack was resolved and after them defending hero was still standing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408715","commentId":1408715,"userName":"Serazu","timestamp":1421395252,"content":"* double post *\n\nEdited January 16, 2015 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408714","commentId":1408714,"userName":"Serazu","timestamp":1421395284,"content":"This is my point. Contrarily to, let's say AGoT, this game has no defined timing structure. In my case, both effects took place simultaneously. So, perhaps it's up to the first player to decide.\n\nOther than that and now that I think of it, my question concerning the chief is moot, since by the time he engages (3A), there are no time counters on the table.\n\nEdited January 16, 2015 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408716","commentId":1408716,"userName":"danpoage","timestamp":1421395316,"content":"Trololo is correct. You have to resolve each of the steps in each enemy attack before you can say that you have survived the attacks. In game terms, \"surviving the attacks\" can be interpreted as \"resolving each step of the combat phase for each of these attacks\". Frodo's ability happens during step 4 (Determine combat damage). Frodo's response cancels the damage that would be dealt by an attack and instead raises your threat. This is happening during the resolution of step 4, which means that you have not yet survived the attacks. The golden rule does not apply because you are eliminated before you finish resolving step 4 and you lose the game. If it's any consolation, your story is as close to winning (without actually doing so) as I have ever seen in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1408722","commentId":1408722,"userName":"Serazu","timestamp":1421396055,"content":"Well, it was epic anyway, no matter the result."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132067-guys-i-need-your-opinion-on-this-interesting-issue/?do=findComment&comment=1409479","commentId":1409479,"userName":"joezim007","timestamp":1421436808,"content":"> It comes down to the order of a few key events:\n> \n> 1. Frodo is damaged\n> \n> 2. Damage is cancelled per reacation\n> \n> 3. Threat is raised\n> \n> So at which point has Frodo survived the attack? Between 2 and 3 or after 3? Does the reaction have to fully resolve or does survival \"interrupt\" the reaction?\n\n \n\nI would also say that there is nothing in Frodo's ability that specifies that the damage is cancelled BEFORE raising threat. I would say that the abilities happen simultaneously. I also believe than enemy's attack consists of every step contained in the enemy attack steps, which would mean the enemies haven't completed all of their attacks until after the free action step of the final attack, which would mean you lose before the you are able to finish the victory condition.\n\n \n\nI'm not convinced that there are any timing issues here. While it isn't very explicit, I think there is enough evidence to say that the ruling most of us have come to is the right one."}]}