{"url":"https://community.fantasyflightgames.com/topic/132291-the-long-dark-of-moria-quest-setup-question/","title":"The Long Dark of Moria - Quest Setup question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/132291-the-long-dark-of-moria-quest-setup-question/?do=findComment&comment=1411011","commentId":1411011,"userName":"chappycatt","timestamp":1421555166,"content":"I asked this question at boardgamegeek, but wasn't sure if I was getting good, official answers...\n\n \n\nI just got \"The Road Darkens\" expansion, and I'm confused about how to setup the second quest, \"The Long Dark of Moria:\"\n\n \n\nThe-Long-Dark-of-Moria-1A.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Road-Darkens/The-Long-Dark-of-Moria-1A.jpg]\n\n \n\nSetup: Set The Balrog, The Great Bridge, and Chamber of Mazarbul aside out of play. Add Doom , Doom , Doom to the staging area and place 10 damage tokens on it. Each player adds 1 different location to the staging area.\n\nI don't understand the last sentence. What location specifically does the quest want me to put in play? It doesn't seem to be The Great Bridge or the Chamber of Mazarbul since the second stage of the quests tells the player to put them in play.\n\nDoes the quest text mean each player should dig through the encounter deck and put into play the weakest location they can find? Someone even suggested I could take locations from other quests :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\n \n\nHelp?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132291-the-long-dark-of-moria-quest-setup-question/?do=findComment&comment=1411041","commentId":1411041,"userName":"Teamjimby","timestamp":1421557403,"content":"Yep.  Each player searches the deck and adds a location to the staging area, and they all have to be different."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132291-the-long-dark-of-moria-quest-setup-question/?do=findComment&comment=1411044","commentId":1411044,"userName":"GrandSpleen","timestamp":1421557534,"content":"When you have set up the game, the staging area should have the following cards in it: \n\n1 - Doom Doom Doom\n\n2 - A location of you choice from the Journey in the Dark encounter set (one per player, and they all have to be different -- no copies)\n\n \n\n \n\nThere are several quests now that use this wording now (\"each player searches the encounter deck for a different enemy\" ... etc), and that's what it means.  Search this scenario's encounter deck for a location (or enemy, per the scenario's instructions) of your choice, and add it to the staging area.  So yes, it can be a weak location.  But 'weak' is a relative term, and depending on the deck(s) that you are bringing, you might favor Ancient Guardroom, which weakens enemies, or if you lack location control, you might favor Mines of Moria."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132291-the-long-dark-of-moria-quest-setup-question/?do=findComment&comment=1412710","commentId":1412710,"userName":"chappycatt","timestamp":1421683927,"content":"thnx"}]}