{"url":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/","title":"threat management, how can I do this!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415326","commentId":1415326,"userName":"muttlee","timestamp":1421836967,"content":"Hello all\n\nAfter having my weekly card night with my mate we seem to be getting killed due to our threat reaching 50 before we can finish. I've watched a few videos from gwahier (eek sorry the spelling) and I've heard him say \"I know my starting threat is high but I can usually get it down the mid 20's by the end of the game!\"....\n\nMy question is how?\n\nWhat's the best way to manage your threat? What cards or combo's to use?\n\nIs there a rule that I'm missing?\n\nMany thanks guys\n\nLee"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415340","commentId":1415340,"userName":"alogos","timestamp":1421838131,"content":"There's not really that much card that reduce your threat. Spirit sphere has almost all of them.\n\n \n\nIt is really dependant on the quest you do and the deck you have, so we can't say much.\n\nThe basic is : take less turn to do the quest, reduce your starting threat, include less doom players cards.\n\nIf all else fail, then it is because of the quest and including more spirit cards, like the one that reduced your threat, would solve the issue.\n\nIf you want to play dirty, use Lore Aragorn with Desesperate Alliance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415367","commentId":1415367,"userName":"muttlee","timestamp":1421840119,"content":"Poo :-( I don't use any sphere cards in my deck but that lore aragorn with desespectate alliance, what packs do I need for them?\n\nAny tips on the 2nd quest of HoN expansion? Me and my mate always get killed by our threat level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415429","commentId":1415429,"userName":"alogos","timestamp":1421844108,"content":"2nd quest of HoN... well, that ring a bell.\n\n \n\nI skip them. 2nd and 3rd.\n\n \n\nBad bad bad...\n\n \n\nSorry, can't help more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415534","commentId":1415534,"userName":"muttlee","timestamp":1421849286,"content":"Haha Nooooooooo! I've heard the HoN expansion is meant to be one of the hardest!\n\nThanks the lore aragorn, I'm going to hunt him down as he can replace my lore faromir"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1415786","commentId":1415786,"userName":"Jban","timestamp":1421858227,"content":"Hall of Beorn gives a nice overview of all cards.\n\n \n\nhttp://hallofbeorn.com/Cards/Search?CardType=None&CardSet=Any&Trait=Any&Keyword=Any&Cost=Any&Sphere=None&Unique=False&IsUnique=Any&Sort=None&Artist=Any&EncounterSet=Any&Category=Threat%20Control&Custom=False&VictoryPoints=Any&HasShadow=Any [http://hallofbeorn.com/Cards/Search?CardType=None&CardSet=Any&Trait=Any&Keyword=Any&Cost=Any&Sphere=None&Unique=False&IsUnique=Any&Sort=None&Artist=Any&EncounterSet=Any&Category=Threat%20Control&Custom=False&VictoryPoints=Any&HasShadow=Any]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1416094","commentId":1416094,"userName":"TwiceBorn","timestamp":1421868827,"content":"In the Core set alone you will find two cards that can help you reduce your threat significantly:\n\n \n\n. The Galadhrim's Greetings (Spirit) - can reduce threat by as much as 6\n\n. Gandalf (can reduce threat by 5)\n\n \n\nIf you have Dwarven Tomb x3 in your deck and use it to retrieve The Galadhrim's Greetings after you have played it, you could end up playing Galadhrim's Greetings as much as 6 times in a game (assuming you draw all 3 Greetings and all 3 Dwarven Tomb). If you use Sneak Attack (x3) with Gandalf (x3) in the same deck to reduce threat, Gandalf alone could reduce your threat by 30 in a single game! Using this strategy, I once ended up with a threat of less than 10 by the end of the game when playing Conflict at the Carrock.\n\n \n\nAt this point, I have only played APs as far as Road to Rivendell. There are a few other threat reduction cards (Dwalin from Kazad-Dum, Eomund from one of the Mirkwood APs, another Lore event in either The Redhorn Gate or Road to Rivendell)… but none of these others, save Dwalin in orc-heavy quests, are as consistently good at reducing threat as Gandalf and The Galadhrim's Greetings. \n\n \n\nThere may be more powerful cards in later APs/expansions that I have not yet played (?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1416307","commentId":1416307,"userName":"Olorin93","timestamp":1421875777,"content":"TwiceBornh summarises it pretty well. If you're two players, at least one of you should have at least one Spirit hero - it's not really a rule, but I've found that Spirit access can make a huge difference. Gandalf and The Galadhrim's Greeting are two of the big ones. Others (outside the core set) include Elrond's Counsel, the Lore version of Aragorn, the Galadriel hero, Galadriel's Handmaiden and the event card Island amid Perils. Galadriel really is game-changing in terms of threat management. She's in the Celebrimbor's Secret adventure pack. But you can find all that from the link to Hall of Beorn above.\n\n \n\nHeirs of Númenor is indeed difficult. Have you tried and beaten the earlier quests? If you don't have Khazad-Dûm and Dwarrowdelf, get them - not just for the scenarios but for fantastic player cards.\n\nEdited January 21, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1417159","commentId":1417159,"userName":"muttlee","timestamp":1421935876,"content":"Many thanks guys, yeah we always have 1 spirit player when we play. I really like the look of lore aragorn but it's hard to get the watcher in the water pack. Only 1 I've found is like £60 on amazon! Anyways I thick it's all about repetition and knowing your cards and combo's."},{"commentUrl":"https://community.fantasyflightgames.com/topic/132647-threat-management-how-can-i-do-this/?do=findComment&comment=1417686","commentId":1417686,"userName":"Khamul The Easterling","timestamp":1421955764,"content":"As for the 2nd and 3rd HoN quests, actually you just need to build a deck specifically for those quests and you can do fine. However, if you just take any old deck, you will get smashed.  A Beregond, Thalin, Legolas deck with many high defense character (defender of rammas, winged guardian, gondorian spearman) gave me a 10/10 record against the Siege of Cair Andros even with a Mumak first turn in one of them!  Build your decks around tactics and battle/siege questing and you should do fine!\n\nEdited January 22, 2015 by Khamul The Easterling"}]}