{"url":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/","title":"Gauging Tournament Interest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1423927","commentId":1423927,"userName":"Penh72","timestamp":1422385050,"content":"Hello Everyone:\n\nI'll post this over at Cardgamedb as well, with a poll (couldn't find that option here) and maybe on the bgg website too, if it seems worth it. This site seems to get more Lotr lcg traffic than Cardgamedb.\n\nI have been thinking about running an online tournament. It would work like this:\n\nA tournament would last 3-6 weeks, depending on how much interest there is. I would choose a quest each week (most likely using only one cycle or set per tournament). Participants in the tournament could play test decks as much as they like against that quest until a certain day of the week (say Thursday or Friday), at which point they must message me their complete tournament legal deck list. After I have received the deck list, the tournament play begins. In the remaining days, the participant may attempt the quest 2 times with their deck, and take score. They would then message me the better of the two scores. The next week, we would play a new quest and everyone would create new decks for it.\n\nTournaments would likely have some additional rules, such as a restricted card pool (for example, using only player cards from the core set and mirkwood cycle for a quest in the mirkwood cycle). We could also sometimes do single handed tournaments and sometimes two handed, if people are interested.\n\nAt the end of the tournament, a winner would be declared by tallying up total accumulated score for the entire tournament.\n\nSo, what do people think? Are you interested in this idea? Do you hate the idea? If you hate it, would you like it better if something about it was different? Would you participate in the tournaments? Please use this thread to let me know.\n\nI suppose the final question would be that it is possible to provide prize support, such as the alternate art Aragorn or something. I would have to purchase that, however, so in that case there would need to be a small entry fee. I'm perfectly fine running the tournament with no fee and no prize apart from forum bragging rights, but would prizes be something that would attract you or the opposite?\n\nThanks, and if you can also enter in the poll on Cardgamedb!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424065","commentId":1424065,"userName":"Teamjimby","timestamp":1422390172,"content":"Hmm.  I like the idea, but the built in LotR scoring system is pretty lame if you ask me.  I also worry that many people wouldn't have the time to craft a new deck each week and run it several times through the same quest.\n\n \n\nI'm not sure exactly how you would do it, but I'd be interested in coming up with a scoring system based on which cards you use.  For example you would get more points if you use Fatty instead of Glorfindel and you get penalized for using cards like Steward of Gondor, sneak attack, and test of will.\n\nEdited January 27, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424101","commentId":1424101,"userName":"Bullroarer Took","timestamp":1422391764,"content":"I am of the opinion that this game does not work for tournaments well at all.  I wish you luck, but I will watch from the sidelines."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424143","commentId":1424143,"userName":"SauronTheGreat","timestamp":1422393276,"content":"I agree with Jimby.  The other thing is is that I only own like have the game cause this game is not cheap if you want to get the whole thing, so I'm working my way up.  scoring using what cards you use would not penalize people like me simply because I don't have $500 to spend on this game.  I don't think there should be a prize for the same reason.  or if there is one, you could say that you could participate without paying but would not be eligible to win.  I think its a great Idea and will see if I can design my own scoring system and encourage ya'll to also."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424155","commentId":1424155,"userName":"Authraw","timestamp":1422393801,"content":"I'd like to say that I'm interested, but I don't think I would be able to commit to playing that much every week.\n\nI've also never been a fan of restricting the card pool back to the Mirkwood cycle. I have already done that so many times--I want more experience with my newer cards.\n\nI'd love to see some sort of organized play for this game, though. It's fun to interact with other players on that level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424218","commentId":1424218,"userName":"Penh72","timestamp":1422395535,"content":"> I'm not sure exactly how you would do it, but I'd be interested in coming up with a scoring system based on which cards you use.  For example you would get more points if you use Fatty instead of Glorfindel and you get penalized for using cards like Steward of Gondor, sneak attack, and test of will.\n\nI'll work on a tournament scoring system and see what you/others think.\n\n> I'd like to say that I'm interested, but I don't think I would be able to commit to playing that much every week.\n\nPerhaps I could dial it back to one quest every 2-3 weeks. What do you think about that?\n\n> I've also never been a fan of restricting the card pool back to the Mirkwood cycle. I have already done that so many times--I want more experience with my newer cards.\n\nThe main reason for doing this is to normalize difficulty level, since the quests become easier the larger the player card pool is, and players without access to some expansions would be at a severe disadvantage, which makes the competitive aspect of it a bit more difficult to judge. I'll try to think of another way around this though (perhaps awarding points for players who stick to the restricted pool?) Also, if enough people enjoy playing, I would be fine with doing more tournaments in the future as well, with different rules (like no pool restrictions)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424269","commentId":1424269,"userName":"Teamjimby","timestamp":1422397243,"content":"Now I'm tempted to come up with a dollar value for every card and every hero and set budgets for the deck design.  It would be like crafting a fantasy football/baseball/basketball team on a fixed budget.  The only problem with that is the sheer volume of cards to which I would need to assign costs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424334","commentId":1424334,"userName":"SauronTheGreat","timestamp":1422399724,"content":"here's what I'm thinking. We would give every card in existence a number between 1 and 10.  We would take into account the cost of the card, but this would be the value of the card compared to the cost.  for instance, sneak attack, feint and test of will would be 9-10 and dark knowledge would be like a 1-2.  We would then rate the heroes anywhere from 50-150.  Sirfindel would be like 145 and fatty would be a 55.  each round would count as 10, each damage would be 3 and each threat would be 2.  This way, one could simply force their way throw a level with great cards, but just as it hurts to use high threat heroes, it would kill your score.  tell me what you think.  \n\nanother Idea I had was that we score based on the cards you PLAY, not on what your deck is built of.  Therefor, this will not only force you to put the not so great cards in your deck but actually to play them.  This would also not penalize you for having more than 50 cards.  what do you guys think?  should threat be higher? should damage be higher?  If you give me a thumbs up, I'll start on the core set with maybe help from Jimby if he wants to give it (or anyone else) and post it. from there we will analyze as a community, because we all have favorite cards that we just like for their own sake, or for the sake of experiences, not because the value of the card itself.  Reply soon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424381","commentId":1424381,"userName":"Teamjimby","timestamp":1422401597,"content":"I just don't like the built in scoring system at all.  Number of rounds, final threat, wounds, etc. doesn't matter to me.  Just win or lose. \n\n \n\nThe kind of thing I'm picturing now is to have people design a deck that can beat several different specific quests.  Like maybe Journey down the Anduin, Conflict at the Carrock, Seventh Level, and Siege of Cair Andros.  The goal would be to design a deck that can beat all of those quests while using as few points/dollars as possible.\n\n \n\nIf you want to make it a tournament, we could just do one quest each week or every few weeks.  If you win the quest you advance to the next round.  Then the point total could be a tie breaker."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424418","commentId":1424418,"userName":"Penh72","timestamp":1422403022,"content":"Rating the cards by usefulness, like a power rating, sounds like a good project. As a community it might be fun to do that for a bunch of cards and see what we all think.\n\nFor the tournament though, I think assigning each card a point value is probably a bit too complicated, both for score tallying but especially for deck building. Most people who play in the tournament probably wouldn't want to spend the extra time to evaluate whether or not to include a card based on how many points it will add to their score--it might be abit too complicated.\n\nI was thinking of something a bit simpler if most people view the official scoring system as flawed. From what I've read/heard, people don't like the timed aspect. In that case we could just use the old method of scoring that doesn't assign points per round. Or, we could just assign points as rewards for completing things, like 2 points for winning the quest, 3 for no heroes dying, 2 for having threat below 35 or something, etc. Something simple like this would probably attract more players, I imagine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424726","commentId":1424726,"userName":"goldensun05","timestamp":1422425099,"content":"Why not just run it as a \"Race Against the Shadow\" type event? For those of you who haven't heard of/played it, it is a tournament style created by FFG that only scores the number of turns it takes you to complete the scenario. You can dowload the full rules here under other rules: 9http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4 [http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=129&esem=4]\n\nThey use chess clocks for tie breakers (obviously can't do that with this style tournament), but doing a tournament where you see who can complete the senario first avoids people having to worry about complicated scoring and points based on cards used."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1424812","commentId":1424812,"userName":"Dwarf king Bronze beard","timestamp":1422436872,"content":"I'm too lazy to read all these things which you have been writed here but first thing i think is completly stupid is the prize thing, because there would be at least one, who would lie of hes/her points to get that reward, so that thing would be useless.\n\n \n\nOther thing which i wouldn't like would be too complicated scoring system. I think that it's good enough what we have right now. Maybe some little scoring changes would be ok but not anything really complicated.\n\n \n\nAnd then if you would start this it should be very easy to participate to that tournament since i'm not anykind of technician/computer expert so it should be something really easy.\n\n \n\nIf all these things are ok when you start this tournament then i would like to try it  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1425155","commentId":1425155,"userName":"Raven1015","timestamp":1422465092,"content":"> Now I'm tempted to come up with a dollar value for every card and every hero and set budgets for the deck design.  It would be like crafting a fantasy football/baseball/basketball team on a fixed budget.  The only problem with that is the sheer volume of cards to which I would need to assign costs.\n\n \n\nThis sounds like an interesting idea. Maybe to simplify it, it would be easier just to break every card type into three tiers. The most powerful would be $3, mid-range cards would be $2, while the marginal cards would be $1. Maybe a truly terrible card could even be a freebie.\n\n \n\nIf I recall correctly, someone ran an OCTGN tournament based on the Race Against the Shadow format a while back on BGG. Players were paired against each other in rounds and could use the spectate function to watch each other's turns and simulate that experience. The drawback here is that it requires participants to have access to OCTGN.\n\nEdited January 28, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1425967","commentId":1425967,"userName":"Narsil0420","timestamp":1422508096,"content":"I would definitely participate in a tournament. I don't like the idea of restricting the card pool too much and I don't need a prize to be motivated!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1426402","commentId":1426402,"userName":"entMoot","timestamp":1422546708,"content":"I would be most interested in a tournament that was either using Race Against the Shadow rules or just going by the official score, if the card pool either wasn't restricted or was limited according to some cut-off (e.g. Core through the end of Dwarrowdelf). No prizes are necessary in my eyes. As Bronze Beard mentioned above, it would be difficult to moderate everyone's play without using OCTGN."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133256-gauging-tournament-interest/?do=findComment&comment=1426491","commentId":1426491,"userName":"Authraw","timestamp":1422550684,"content":"> Perhaps I could dial it back to one quest every 2-3 weeks. What do you think about that?\n\nI think I'd be more willing to try it if it were every two weeks."}]}