{"url":"https://community.fantasyflightgames.com/topic/133335-faromir-and-his-special-ability/","title":"faromir and his special ability?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/133335-faromir-and-his-special-ability/?do=findComment&comment=1425021","commentId":1425021,"userName":"muttlee","timestamp":1422457824,"content":"Hello all\n\nIm finding it hard to see the benefit of his special ability and was hoping someone could explain\n\nIt's the lore faromir from one of the small expansions for HoN. His text reads\n\nRanged.\n\nFaromir gets +1 attack for each enemy in the staging area until the end of the phase.\n\nNow I think great I can an extra attack but then when I engage them they come out of the staging area so I lose an attack point becauae that enemy is no longer in the staging area.\n\nHow can this be any use to the player?\n\nCheers guys and that's again for any help and for my threat management post.\n\nLew"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133335-faromir-and-his-special-ability/?do=findComment&comment=1425172","commentId":1425172,"userName":"GrandSpleen","timestamp":1422465673,"content":"You are correct that he loses the bonus when the enemy engages you.  To take advantage of his bonus, you'll have to:\n\n \n\n1) Keep your threat low and avoid engaging enemies (a bit hard to do since Faramir's starting threat is high).  Then use staging area attack effects such as Great Yew Bow or Hands Upon the Bow to snipe enemies up there.  Hands Upon the Bow is very nice during the quest phase, when you're more likely to have extra enemies in the staging area, anyway.\n\n \n\nor\n\n \n\n2) Keep enemies in the staging area via cards like Ranger Spikes or Noiseless Movement.  Then use Faramir to attack other enemies engaged with you as normal.\n\nEdited January 28, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133335-faromir-and-his-special-ability/?do=findComment&comment=1425251","commentId":1425251,"userName":"alogos","timestamp":1422468164,"content":"In Battle quest, he is quite good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133335-faromir-and-his-special-ability/?do=findComment&comment=1425653","commentId":1425653,"userName":"Mndela","timestamp":1422485588,"content":"If players have low threat, and there are some enemies in staging, each round players can engage one enemy, the most powerful, and Faramir can damage him a lot.\n\nIt is a good strategy. Each round killing the worst enemy in play thanks to Faramir boost (joining his attack by ranged)"}]}