{"url":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/","title":"Quest Challenges","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1428826","commentId":1428826,"userName":"PsychoRocka","timestamp":1422681040,"content":"So after playing many games of the ring maker cycle and the road darkens and now awaiting new quests and player cards from the many amazing packs to come in the next few months (hopefully!) I've thought of a new way to keep the game interesting and to attempt some difficult and daring feats while I wait for new content.\n\n \n\nEach week I'm going to try at least one and potentially two challenges I set for myself and anyone is welcome to join in and see if they can fulfill the challenge as well.\n\nA few examples I've thought of are:\n\n \n\n-Encounter at Amon Din: Have at least three times the amount of rescued villagers than dead villagers at the end of the game.\n\n-The Siege of Cair Andros: Successfully explore all three battleground locations and defeat quest stages 1 and 5.\n\n-Return to Mirkwood: Defeat at least one Attercop, Attercop and two hill trolls or two Attercop, Attercop's and one hill troll.\n\n-Hills of Emyn Muil (Nightmare): Win a game in which you kill at least two Tunneling Nameless Ones\n\n \n\nIf anyone has any suggestions along the way let me know and so long as they seem even faintly achievable by my decks I may add them as a future challenge.\n\nI was inspired to do this just for the record by the many contests and challenges set by the various blogs for this game, most of all by the Mumak Hunt run by tales from the cards a while back:\n\nhttps://talesfromthecards.wordpress.com/2014/05/27/contest-mumak-hunt/ [https://talesfromthecards.wordpress.com/2014/05/27/contest-mumak-hunt/]\n\n \n\nNow unlike those much better and more official challenges I don't expect a story or narrative for these challenges I will be doing if you choose to join in but by all means if you feel like it go for it!\n\n \n\nTo start it off I'm going to attempt to do the following challenge:\n\n-The Seventh Level (Nightmare): Win a game in which you have killed at least fifteen enemies.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1428883","commentId":1428883,"userName":"PsychoRocka","timestamp":1422687046,"content":"Challenge 1 turned out to be very easy and I completed it on my first attempt, because of this I will add a second challenge for this week and then attempt a third (and possibly 4th next week). Not going to add the two new challenges till next Saturday so plenty of time to attempt this one and the second if you are interested =)\n\nPerhaps the first challenge should have instead been 20 enemies instead of 15, ah well!\n\nThis is my notes on the quest log for my victory against the challenge:\n \n\n\"Attempting the following self set challenge:\n\nThe Seventh Level (Nightmare): Win a game in which you have killed at least fifteen enemies.\n\n \n\nTwo cards revealed during set up are both enemies, Goblin Archer and a Cave Troll, so far so good! Leadership/Tactics Deck plays O Lorien and then Galadhon Archer during planning doing 1 damage to the Goblin Archer killing it and bringing the kill count to 1. During combat on the first turn I killed a Goblin Spearman and Goblin Skirmisher bringing the kill count to 3! Second round combat a Cave Troll is added to the victory display after being defeated, kill count at 4. Round 3 during Combat Haldir uses his action to kill a Goblin Scout in staging and the tactics/leadership deck kills a Goblin Spearman still engaged from the last round. Kill count is at 6! Round 4 a Pit Goblin is defeated and the kill count is now 7. By not using Gildors Counsel and only questing with enough willpower to make a little bit of progress each round and delay round 2 for a while is working very well so far, I'm already kind of half way to a kill count of 15! As well as this I'm building up a sizeable force of Silvans and attachments ready to take down Overseer Maurul and his cronies.\n\nRound 5 is terrible with two locations being revealed and no enemies in play. This may be the last round I can stay on stage 1 as well, gotta hope for lots of enemies on stage 2 before I win. 13 progress on stage 1 after questing on round 6 gaining me another round on stage 1 and both a Cave Troll and Goblin Swordsman are revealed. Both are killed during combat with an all out attack against the cave troll and Elladan using a resource to ready and kill the goblin swordsman on his own. Kill count is at 9! Time to proceed to stage 2!\n\nRound 7 I cancel a Watchful Eyes with A Test of Will and a Goblin Swordsman is revealed as well. I push through to stage 2 and Overseer Maurul is added to staging and the Chamber of Records is now the active location. The Swordsman is defeated during combat and Maurul is left on 1 hitpoint!!!! Kill count is 10.\n\nRound 8 Pursuing the Enemy is drawn by the tactics/leadership deck and played during planning returning a naith guide to hand and putting the last point of damage on Overseer Maurul to kill him. Kill count is 11, only 4 more and then questing to victory to go! During staging a goblin archer and balins doom are revealed, then with surge a goblin spearman is revealed, stage 2's special effect then adds a Chieftain of the Pit and Goblin Taskmaster to the staging area as well, the Chamber of Records is cleared just however all three goblin enemies now have many tokens and the Orc Taskmaster will stop them from taking damage so long as they have counters, this is not good.... during combat I am able to take out the Orc Taskmaster with Haldir and all the ready characters on the tactics/leadership side and by removing a resource and readying Elladan I am able to then also attack and kill the Goblin Archer in staging (rivendell bow and dunedain mark attached) as well, not the best outcome but managed to do pretty well. Kill count now at 13! Just have to kill the two enemies still engaged (a goblin spearman and Chieftain of the Pit) and gain victory and the challenge is complete!\n\nAt 40 and 39 threat I need to do this fast however.\n\nRound 9 I used Gildors Counsel finally as I can easily achieve the kill count now and just need to quest to victory next turn, with 2 progress on the quest stage already I need an extra 15 to win. I quest with 15 and Goblin Spearman is revealed, stage 2's effect then reveals two treacheries which are discarded, luck is on my side and the quest stage now has 16 progress, one more and I would have won without beating the challenge!!! During combat I am able to kill the Goblin spearman and Chieftain from last turn AND the newly revealed swordsman bringing the kill count to 16!!!\n\nRound 10 Gandalf and Galahadrims Greeting are both used to put the two deck's threat back to 37 and 36. I then quest with 22 and undisturbed bones and watchful eyes are revealed, stage 2's effect then adds a Goblin Swordsman to staging, I win with a surplus of 20 extra progress points =P\n\n \n\nSuccess! Score of 60, 38 and 36 threat and 14 Victory Points (two cave trolls, chamber of records and Overseer Maurul).\n\nKill count is as follows:\n\n3 Goblin Spearmen\n\n3 Goblin Swordsmen\n\n2 Goblin Archers\n\n2 Cave Trolls\n\n1 Goblin Skirmisher\n\n1 Goblin Scout\n\n1 Pit Goblin\n\n1 Orc Taskmaster\n\n1 Chieftain of the Pit\n\nand Overseer Maurul!\n\nThe Orc Hornblower was the only enemy that at least one copy of was not killed! Considering there is only a single copy of this card and it did not appear that isn't really saying much though.\"\n\n \n\nThe Second challenge I will be attempting is as follows:\n-The Morgul Vale: Win a game in which there is no more than 4 progress on To The Tower\n\n \n\nConsidering I actually have very few wins and a fairly high amount of losses against this quest to begin with this should be a pretty **** difficult one for me, my recent addition of Pursuing the Enemy to my decks since my most previous attempts at this quest may hopefully help to do some of the final points of damage to the Nazgul.\n\nEdited January 31, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1429044","commentId":1429044,"userName":"Dwarf king Bronze beard","timestamp":1422708157,"content":"Nice idea Psycho i would like to test some of these especially that Emyn Muil nightmare thing because i really like that Nightmare version of it and those tunneling beasties are also super cool and i haven't never even killed one so it might be really epic to see that can i achieve that goal. And that siege of Cair Andros challenge is also fun to do but i don't think that i have enough time today so i think i will start it tomorrow or even next week if i'm not able to start it tomorrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1429164","commentId":1429164,"userName":"jormungandr","timestamp":1422717807,"content":"Lol, I just thought of the same idea :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I'll add the challenges to this thread:\n\n \n\n- Clearing PtM in one turn. Remove the other stage 3 (allready cleared by entmoot)\n\n- Clearing CatC in one turn. Although exxtremely unlikely.\n\n- Clearing Encouter at Amon Dîn without any token on dead villagers.\n\n- Killing the witch-king MaO using only hobbits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1430955","commentId":1430955,"userName":"PsychoRocka","timestamp":1422861685,"content":"So far with challenge 2 I have had 6 straight losses against the quest, proving very difficult indeed to even get a win let alone one with only 4 progress on To the Tower, you have to be insanely quick!\n\nI will post comments on some of the more interesting losses after a few more attempts and days and hopefully secure a victory or two or even beat the challenge (very unlikely)!\n\nI've also decided that the format of one easier challenge to start and a harder challenge to follow each week seems like a good idea.\n\nEdited February 2, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1431309","commentId":1431309,"userName":"Dwarf king Bronze beard","timestamp":1422892066,"content":"I think that i don't have time for this in whole week since i have lots of another things to do but maybe at week end i maybe have time to try these challenges.  :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1431332","commentId":1431332,"userName":"Icey2","timestamp":1422893362,"content":"This is a really good idea!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I also like that it alters the strategy a bit so that some cards, I imagine, might become more useful (e.g. Risk Some Light, Shadow of the Past or even The End Comes... well, maybe  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ) for guaranteeing that you will face specific enemies a certain amount of times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1438753","commentId":1438753,"userName":"PsychoRocka","timestamp":1423280200,"content":"Well its Saturday again and I failed dismally to beat the second challenge. Not only this but I didn't even get a single win against Morgul Vale which is somewhat embarrassing. It's definitely one of three or four quests my two decks have the most trouble with and they can beat it but fairly **** rarely. This is the quest log for the most interesting game I had where I thought I might possibly get a victory (but not beat the challenge) but Lord Alcarnon showed a side of himself I don't think I've ever seen and decimated me:\n\n \n\n\"Was doing really well AND had lots of allies and attachments in play and was ready to take on the Nazgul and reduce threat the following turn, both threated out AND had To the Tower reach 10 tokens as I advanced to stage 3 as the stage 3B effect revealed TWO Copies of impenetrable fog revealing four more cards including The Power of Mordor, Terror Drives Them and Sleepless Malice. Because I couldn't discard three cards from either decks hand (2 in each) I had to place 3 progress tokens on To the Tower and raised each decks threat by 5. Insanity, thought I might have a win this time (was nowhere near achieving the challenge as To The Tower had 7 tokens already) as I had threat reduction for both players and built up forces so could possibly kill the Nazgul before threating out/To the Tower having ten tokens. I also killed Murzag with double sneak attack on the first round and didnt let his ability trigger once. What really lost it for me is Lord Alcarnon REFUSING to die by constantly bouncing back to the staging area and on one turn he made about 5 consecutive attacks putting 5 progress on To the Tower in one go.... he stayed in play 2 to 3 more turns than he should have slowing EVERYTHING down, allowing threat to raise too high and putting far too many tokens on To the Tower. Alcarnon is pretty much always the least threatening of the bosses in this quest below Murzag, the Nazgul and even really The White Bridge and the effect of stage 3B but this game showed his true potential big time and he was the MVP of the encounter deck.\"\n\n \n\nI may still give that challenge another couple of tries and even just try to get a victory on Morgul Vale if I get time this week but for now I'm going to move onto some new challenges.\n\nThe first and easier challenge I'm going to try and attempt this week is:\n\n-Encounter at Amon Din: Have at least three times the amount of rescued villagers than dead villagers at the end of the game.\n\nEdited February 7, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1438843","commentId":1438843,"userName":"PsychoRocka","timestamp":1423286563,"content":"Just beat this weeks first challenge on my first attempt like last week. Did so only just and EXACTLY by having 18 tokens on rescued villagers to 6 on dead villagers.\n\nAttempting a self set challenge:\n\nEncounter at Amon Din: Have at least three times the amount of rescued villagers than dead villagers at the end of the game.\n\n \n\nOk so the main focus is to get as many tokens on rescued villagers as possible whilst also getting as few tokens on dead villagers as possible. To do this Burning Farmhouses will have to be cleared ASAP as well as other locations to stop treacheries or enemies moving villagers from them to dead villagers instead of rescued villagers. Ghulat will also need to be killed as quickly as possible to avoid him placing too many tokens on dead villagers. Asfaloth will also be key and hopefully drawn in my starting hand. Lord Alcarnon's ability will also be key so I will not be using him to quest and will only attack with him if really necessary.\n\n \n\nDuring staging a Gondorian Hamlet and second copy of Burning Farmhouse are revealed (as well as the one that starts as the active location) which is not good at all as the farmhouses will automatically put tokens on dead villagers at the end of each turn and the hamlet will do the same when treacheries are revealed if it is in staging. Horrible start and possible spelling of doom for my attempt at the challenge....\n\nEven after a mulligan I do not draw Asfaloth in my staring hand for the lore/spirit deck and I am even more worried about this game.\n\n \n\nDuring staging on round 1 another hamlet and an orc ravager are revealed putting 1 token on dead villagers however I am able to clear the farmhouse that is the active location and also rescue one villager from quest stage 1. I travel to the other farmhouse and destroy the orc ravager during combat. Dead villagers now has 1 token (I use Lord Alcarnon to put the villager discard by the farmhouse in staging's effect back onto the farmhouse) and rescued villagers has 4. Not the best start but not the worst.\n\n \n\nRound 2 a Craven Eagle and Orc Arsonist are revealed and I only put 3 progress on the farmhouse.... not good.. really need Asfaloth to get rid of the two hamlets in staging before treacheries just remove all the villagers and ramp up dead villagers. I destroy both the Eagle and Orc arsonist during combat but use Lord Alcarnon to do so and so the farmhouse puts a token on dead villagers.\nNow there are 4 tokens on rescued villagers and 2 on dead villagers.\n\nRound 3 I get Legolas ally out and play ranger spikes. I need a big push to clear the Burning Farmhouse. Two more Orc Arsonists appear and I am able to clear Burning Farmhouse and rescue another villager from quest stage 1 thanks to ranger spikes. I then travel to one of the hamlets and destroy the Orc Arsonist not in ranger spikes. Rescued villagers now has 8 tokens and dead villagers has 2. Awesome turn around!\n\n \n\nRound 4 a Marauding Orc and Trapped Inside are revealed. Trapped inside puts 2 of the villagers on the active hamlet and 1 from the hamlet in the staging area on dead villagers bringing it up to 5 in one go..... just awful.. I am able to clear the active hamlet however as well as stage 1 bringing the tokens on rescued villagers up to 12 and Ghulat is added to the staging area. I now have to get rescued villagers up to at least 18 or so as Ghulat's attack this round will bring dead villagers up to 6 tokens..... there are no locations in play other than the hamlet I travel to so I am going to have to kill Ghulat then prolong this to get more locations out and rescue more villagers...\n\nGhulat is destroyed during combat by Legolas, Haldir with Bow of Galadrhim and Dunedain Mark attached and Lord Alcarnon. Elladan and Elrohir (after defending both attacks) kill the Marauding Orc. Legolas allies effect triggers and draws me a Gandalf which is perfect as I have had sneak attack in my hand since the start of the game. Rescued villagers has 12 tokens and dead villagers has 6...\n\n \n\nRound 5! Time to hope for two locations! During staging Burnt Homestead is revealed raising each players threat by 6... then Orc Rabble and Secluded Farmhouse are revealed... I explore the hamlet and put 8 progress on stage 2.... Need to slow down progress if I'm going to achieve the challenge.. When travelling to the Secluded Farmhouse the encounter card I have to reveal and add to staging is another Secluded farmhouse which is very helpful! Haldir kills the orc rabble with his ability before it can attack. Rescued Villagers has 14 tokens and dead villagers has 6. So long as I can clear both Secluded Farmhouses before winning and stop any further tokens being put on dead villagers I can still beat the challenge!\n\n \n\nRound 6 Panicked is revealed and then Gondorian Hamlet. This puts 2 tokens from rescued villagers onto the secluded farmhouse in staging but the current secluded farmhouse is cleared and stage 2 now has 13 progress. I travel to the second secluded farmhouse with 4 villager tokens. Rescued Villagers are at 14 tokens again and dead villagers are on 6.... Next turn I need to clear the current location and clear stage 2 and win without a single villager token being put on dead villagers or removed from rescued villagers.... this seems very unlikely to achieve as Gondorian Hamlet will put a token on dead villagers if a treachery is revealed...\n\n \n\nROUND 7! During Staging Orc Ravager is revealed and I suddenly remember Lord Alcarnon's ability that I used a few times at the start of the game and put the villager discard by the orc ravager straight back on the active location, the second card revealed is another Gondorian Hamlet and I clear the active location bringing rescued villagers up to 18 tokens and clearing stage 2!!!!\n\n \n\nScore of 74 (Each deck at 40 threat, 2 damage on Elrohir and 8 Victory Points)\n\n6 tokens on dead villagers and 18 on rescued villagers which is EXACTLY three times the amount of tokens on rescued villagers as there are on dead villagers.\n\nChallenge complete!\n\n \n\nAs the second harder challenge for the week I'm going to attempt:\n\nHills of Emyn Muil (Nightmare): Win a game in which you kill at least two Tunneling Nameless Ones"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1438976","commentId":1438976,"userName":"PocketWraith","timestamp":1423304383,"content":"-Encounter at Amon Din: Have at least three times the amount of rescued villagers than dead villagers at the end of the game. - First time I beat the quest I think I had 10 rescued to 2 dead.\n\n \n\n-The Siege of Cair Andros: Successfully explore all three battleground locations and defeat quest stages 1 and 5. - Done this, and with a limited card pool at that.\n\n \n\n-Return to Mirkwood: Defeat at least one Attercop, Attercop and two hill trolls or two Attercop, Attercops and one hill troll. - I think I had a game with two Atercops, but I'm not sure if there was a Hill Troll as well.\n\n \n\n-Hills of Emyn Muil (Nightmare): Win a game in which you kill at least two Tunneling Nameless Ones - Nope, when I played this I just avoided those guys.\n\n \n\n-The Seventh Level (Nightmare): Win a game in which you have killed at least fifteen enemies. - Is it even possible to beat this quest without killing fifteen enemies?\n\n \n\n \n\n> The Second challenge I will be attempting is as follows:\n> \n> \n> -The Morgul Vale: Win a game in which there is no more than 4 progress on To The Tower\n> \n>  \n> \n> Considering I actually have very few wins and a fairly high amount of losses against this quest to begin with this should be a pretty **** difficult one for me, my recent addition of Pursuing the Enemy to my decks since my most previous attempts at this quest may hopefully help to do some of the final points of damage to the Nazgul.\n\nPretty sure I managed this the first time I played the quest, with a solo Dwarf deck, but I'm not sure if I've beaten the quest at all since then..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133615-quest-challenges/?do=findComment&comment=1439566","commentId":1439566,"userName":"PsychoRocka","timestamp":1423354860,"content":"> -Encounter at Amon Din: Have at least three times the amount of rescued villagers than dead villagers at the end of the game. - First time I beat the quest I think I had 10 rescued to 2 dead.\n> \n>  \n> \n> -The Siege of Cair Andros: Successfully explore all three battleground locations and defeat quest stages 1 and 5. - Done this, and with a limited card pool at that.\n> \n>  \n> \n> -Return to Mirkwood: Defeat at least one Attercop, Attercop and two hill trolls or two Attercop, Attercops and one hill troll. - I think I had a game with two Atercops, but I'm not sure if there was a Hill Troll as well.\n> \n>  \n> \n> -Hills of Emyn Muil (Nightmare): Win a game in which you kill at least two Tunneling Nameless Ones - Nope, when I played this I just avoided those guys.\n> \n>  \n> \n> -The Seventh Level (Nightmare): Win a game in which you have killed at least fifteen enemies. - Is it even possible to beat this quest without killing fifteen enemies?\n> \n>  \n> \n>  \n> \n> > The Second challenge I will be attempting is as follows:\n> > \n> > \n> > \n> > -The Morgul Vale: Win a game in which there is no more than 4 progress on To The Tower\n> > \n> >  \n> > \n> > Considering I actually have very few wins and a fairly high amount of losses against this quest to begin with this should be a pretty **** difficult one for me, my recent addition of Pursuing the Enemy to my decks since my most previous attempts at this quest may hopefully help to do some of the final points of damage to the Nazgul.\n> \n> Pretty sure I managed this the first time I played the quest, with a solo Dwarf deck, but I'm not sure if I've beaten the quest at all since then...\n\nYeah its not a checklist.... I too have completed the Amon Din, Cair Andros and Seventh Level (and possibly the return to mirkwood one) challenges in the past... but it's just fun to set some challenges (whether I've done them before or not) each week and attempt them. Also if you read my playthrough it is very easy to complete Seventh Level without killing 15 enemies if you rush through it."}]}