{"url":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/","title":"Voice of Isengard / Against the Shadow player card awards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/?do=findComment&comment=1432107","commentId":1432107,"userName":"GrandSpleen","timestamp":1422921220,"content":"After the Against the Shadow cycle concluded, community member Glowwyrm posted a thread [https://community.fantasyflightgames.com/index.php?/topic/93784-heirs-of-numenoragainst-the-shadow-player-card-awards/?hl=prowess#entry912786] for us all to digest the cycle and vote for cards in various categories.  I though it would be a good idea to do that for the Voice of Isengard and Ringmaker cycle.  We're a little over a month since its conclusion, so hopefully most folks have had a chance to experience all it had to offer and ruminate on it a bit.\n\n \n\nI'm going to copy and paste the award categories directly from Glowwyrm's 2013 post.   Hop on over to your favorite card database and look through the VoI and Ringmaker player cards (the filter in the deckbuilder at CardGameDB [http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-deckbuilder] is great for this), then vote away! (Saga expansions released during this timeframe are not intended to be included in this cycle wrap-up discussion)\n\n \n\nGeneral Poll:\n\nWhat sphere got the best cards?\n\nWhat sphere got the short stick?\n\nWhat was the best deck archetype to come out of this cycle?\n\n \n\n \n\nAwards:\n\n 1.  The Chuck Norris Exhaust to Win Award (best player card)\n 2.  The Fatty: When He Exhausts, Discard Him Award (worst  player card)\n 3.  Angry Bear Swings Twice Award (most thematic player card)\n 4.  Haldir is a Boy Award (best player card art)\n 5.  Boromir Ringbearer Award (most overpowered player card)\n 6.  Bill the Pony Award (card that seems innocent, but is very powerful)\n 7.  Hail of Apples Award (cool but useless player card)\n 8.  It’s a B+ (not the best player card, but you’ll use it a lot)\n 9.  Gimli and Legolas Superfriends Award (best co-op player card)\n 10. Tom Bombadil is the Witch King Award (most controversial player card)\n\nEdited February 2, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/?do=findComment&comment=1432137","commentId":1432137,"userName":"GrandSpleen","timestamp":1422922568,"content":"And my own answers:\n\n \n\nGeneral Poll:\n\nWhat sphere got the best cards?   I'm going with Lore.  \n\nWhat sphere got the short stick?  This is tough, as I think all the spheres got some very nice cards.  But I'm going to go with Spirit, which seemed to have the *fewest* awesome cards.\n\nWhat was the best deck archetype to come out of this cycle?  Silvan!\n\n \n\n \n\nAwards:\n\n 1.  The Chuck Norris Exhaust to Win Award (best player card)  Eomer gets my vote for single best card.\n 2.  The Fatty: When He Exhausts, Discard Him Award (worst  player card)  Mirkwood Pioneer\n 3.  Angry Bear Swings Twice Award (most thematic player card) The White Council\n 4.  Haldir is a Boy Award (best player card art)  Deep Knowledge\n 5.  Boromir Ringbearer Award (most overpowered player card)  Haldir strikes me as the most powerful card to come out of this cycle. It is actually tough to find one to call 'overpowered,' though. I would have said the Blue Mountain Trader, but he has recently been errata'd.\n 6.  Bill the Pony Award (card that seems innocent, but is very powerful) Booming Ent.  I have not seen much discussion on this guy.  He starts with a respectable 2 attack value, and is capable of getting +7 attack with the current card pool (3 Booming Ents, 1 Treebeard, and 3 Wandering Ents, all damaged).  Give us even more Ents and these will be consistently able to reach high attack values.  And Ents have the HP to soak up archery damage... yes, please!\n 7.  Hail of Apples Award (cool but useless player card)  Message from Elrond\n 8.  It’s a B+ (not the best player card, but you’ll use it a lot)  Pursuing the Enemy.  The weakest effect of the Silvan 'return to hand' cards, but has a nice home in a Silvan deck that includes Tactics.\n 9.  Gimli and Legolas Superfriends Award (best co-op player card)  Power of Orthanc has been an auto-include for me when I'm going against scenarios with nasty Conditions.\n 10. Tom Bombadil is the Witch King Award (most controversial player card) Grima was a pretty divisive card and I think there are still a lot of players who won't touch him.\n\nEdited February 3, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/?do=findComment&comment=1432276","commentId":1432276,"userName":"danpoage","timestamp":1422930740,"content":"Most Supported Sphere: Tactics. Two great heroes and new staple card in Westfold Outrider.\nLeast Supported Sphere: Spirit. This shows just how solid this cycle was. The \"least\" supported sphere got Galadriel, her handmaiden, Ride Them Down and Westfold Horse-breeder.\nBest Archetype: Silvan, with honorable mention to Éomer \"leaves play\" decks.\n\n1. Best player card: Mablung (resource acceleration is *huge* for Tactics Gondor - while this is not strictly an \"exhaust to win\" card, I really appreciate the options that it brings to Gondor and heavy tactics decks)\n2. Worst player card: Orthanc Guard (why would you care about readying an ally with these stats?)\n3. Most thematic: Mirror of Galadriel (perfection)\n4. Best art: Galadriel (One of Magali's best)\n5. Most overpowered: Haldir of Lórien (pre-empting enemy attacks is crazy-good)\n6. Biggest surprise: Westfold Horse-breeder (will become more valuable with each new Mount card)\n7. Cool but useless: Warden of Arnor. (I wanted to like this card but in practice it has minimal impact)\n8. B+: Lembas (readying and healing in one card is fantastic)\n9. Best co-op: Westfold Outrider (one of my favorite all around cards of the cycle).\n10. Most controversial: Gríma or Saruman (doomed can be powerful, but problematic in multi-player)\n\nEdited February 3, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/?do=findComment&comment=1432359","commentId":1432359,"userName":"Pharmboys2013","timestamp":1422937075,"content":"General:\n\nWhat sphere got the best cards? -Going with Tactics, we received Eomer who is the new attacking alpha dog and a handful of all very powerful attachment including rohan warhorse, Firefoot, captain of gondor, Elven Mail, and Bow of the Galadhrim.\n\nWhat sphere got the short stick? Probably spirit, which ironically received Galadriel who is argruably the best hero of the cycle but otherwise a lot of the player cards were pretty expendable \n\nWhat was the best deck archetype to come out of this cycle? Silvan, obvious answer is obvious\n\n \n\nAwards:\n\n1. The chuck norris exhaust to win award (best player card) I'm going to cheat and say the best hero and the best actual player card. Best hero i'm going with Eomer, just an absolute beast and was given all the tools to do awesome as well. Not difficult to give him 7 attack and attacking twice a turn. Best actual card i'll say is O' Lorien, restrictive to a specific archetype sure, but absolutely essential to it's success especially since silvan decks often do use 3 spheres.\n\n2. The Fatty: when he exhausts, discard him award (worst player card) Message from Elrond, instant coaster just dont see the point of it at all. At least they didnt waste any good art on it either.\n\n3. Angry Bear Swings twice award (most thematic player card) Mirror of Galadriel, just a home run all the way around. Have had a ton of really great play experiences with that. Especially if used in desperation with only a few cards in hand. Love it.\n\n4. Haldir is a boy award (best player card art) I'll split this between hero and player card too. Favorite hero art is Celeborn, love the autumn colors in the background and the regal manner of the elf. Card would be Booming Ent, exactly how i picture Ents very very cool illustration.\n\n5. Boromir Ringbearer award (most overpowered player card) I'll go with Haldir as well, just a fantastic ability. Always so satisfying taking out an enemy before he can attack your teammate.\n\n6. Bill the Pony Award (card that seems innocent but is very powerful) Defender of the Naith, tho not at all \"very powerful\" but I think the card is significantly better than people had given it credit for considering neutral sphere for silvan, cheaper cost of O'Lorien, and no other real defensive options for the archetype\n\n7. Hail of Apples Award (cool but useless player card) Defender of the West- I really want to find a reason to use this but i just cant find one. Someday maybe\n\n8. Its a B+ (not the best player card but you'll use it a lot) Galadriel's Handmaiden- just a fantastic ally despite not being flashy. 2 cost, 2 will power and lowering your threat is better than most other comparable options. Big fan\n\n9. Gimli and Legolas Superfriends Award (best co-op player card) Going with Haldir again for the same reason I listed above\n\n10. Tom Bombadil is the Witch King Award (most controversial player card) Saruman, the doomed ability, the fact we know (but not necessarily our heroes in the timeline) that he is a villain, a very cool card overall and certainly controversial"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133851-voice-of-isengard-against-the-shadow-player-card-awards/?do=findComment&comment=1432362","commentId":1432362,"userName":"Teamjimby","timestamp":1422937218,"content":"What sphere got the best cards?  Tactics.  Eomer, mounts, and elven attachments\n\nWhat sphere got the worst cards?  Leadership.  Not much to write home about besides Celeborn and feigned voices.\n\nBest deck archetype?  Has to be Silvan.  I want nothing to do with the doomed cards.\n\n \n\n 1.  The Chuck Norris Exhaust to Win Award (best player card):  Haldir for best hero.  Rohan Warhorse for best non-hero.\n 2.  The Fatty: When He Exhausts, Discard Him Award (worst  player card):  Probably Erkenbrand for hero.  Fall of Gil Galad for non-hero.\n 3.  Angry Bear Swings Twice Award (most thematic player card):  Many good ones.  White Council wins for me, but honorable mentions to ents and ride them down.\n 4.  Haldir is a Boy Award (best player card art):  Galadriel.  No contest.\n 5.  Boromir Ringbearer Award (most overpowered player card):  Legacy of Numenor and Deep knowledge, because they only seem to be used in broken gimmick decks.\n 6.  Bill the Pony Award (card that seems innocent, but is very powerful):  Westfold Horse-Breeder.  I wish I could include 10 of these in a Rohan deck.  Honorable mention to Celduin Traveler and Ithilien Lookout.\n 7.  Hail of Apples Award (cool but useless player card):  Warden of Arnor.  For a unique attachment that only attaches to 2 heroes, it is far too weak.\n 8.  It’s a B+ (not the best player card, but you’ll use it a lot):  Celduin Traveler and Ithilien Lookout.\n 9.  Gimli and Legolas Superfriends Award (best co-op player card):  Lembas\n 10. Tom Bombadil is the Witch King Award (most controversial player card):  I guess Grima.  Possibly Mirror of Galadriel."}]}