{"url":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/","title":"Time Mechanic Kills The Game For Me","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432209","commentId":1432209,"userName":"GondorianFire","timestamp":1422926437,"content":"Does anyone else feel that the time mechanic takes away from the enjoyment of the game? My favorite quests were before The Ring Maker cycle because of this. I feel that the time mechanic rushes me to much and creates a lot of unneeded stress. On top of that I don't like the penalties the encounter cards bring into play. For example the Take Cover! treachery and Orc Skirmisher enemy both have an extremely punishing remove 1 time counter or take lots of damage effect. I tried to introduce a friend to LOTR LCG with the Celebrimbor's Secret quest.  Man what a mistake that was. Thanks to the time mechanic and the above mentioned cards it was a very stressful game that we lost. I wish I could send this feedback to the devs but the sad part is that I'm sure this crap is here to stay :/\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432256","commentId":1432256,"userName":"GrandSpleen","timestamp":1422929559,"content":"On the contrary, I doubt we will see much of 'Timed' outside of the Ringmaker cycle.  Battle and Siege are rare outside of the Heirs of Numenor/Against the Shadow cycle.  I think we'll continue to see 'Time' from... uhh.. time to time, but I don't think it will be in every quest, as it has been lately. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432283","commentId":1432283,"userName":"GondorianFire","timestamp":1422930991,"content":"> On the contrary, I doubt we will see much of 'Timed' outside of the Ringmaker cycle.  Battle and Siege are rare outside of the Heirs of Numenor/Against the Shadow cycle.  I think we'll continue to see 'Time' from... uhh.. time to time, but I don't think it will be in every quest, as it has been lately. \n\nI very much hope this is true because I was strongly considering not buying into the next cycle. Low On Provisions and In Need Of Rest are two more encounter cards that I shudder every time I see them revealed. TBH most of the encounter cards Voice Of Isengard brought I didn't care for. I have yet to try out the Antlered Crown but I may just pass after trying Nin-In-Eilph and Celebrimbor's Secret\n\nEdited February 3, 2015 by GondorianFire"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432350","commentId":1432350,"userName":"GrandSpleen","timestamp":1422936442,"content":"If you don't like the Time mechanic, the Antlered Crown will make you groaaan -- it is TIme on steroids!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432365","commentId":1432365,"userName":"Pharmboys2013","timestamp":1422937283,"content":"I was just about to say I was completely ok with time except for the Antlered Crown...which is a quest I do like, but the amount of time effects in there can truly devolve the experience into focusing on only mechanics and thus sapping the experience  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432468","commentId":1432468,"userName":"legolas18","timestamp":1422947005,"content":"Yeah, time wasn't that great. But like mentioned above, I highly doubt it will be incorporated into The Lost Realm and Angmar Awakened, as those quests will probably be heavily focused on side quests and other new mechanics they're testing out. I like when they flesh out a mechanic like that over the whole cycle as it gives us a chance to see it in play in different environments and situations. But again, I don't think you have to worry about the next cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432650","commentId":1432650,"userName":"Glaurung","timestamp":1422962882,"content":"To be honest I agree…. Time mechanics is really annoying for me too. I donnt like this cycle quesys also cause all that beard Dunland warriors doesn looks like Tolkien game to me. Also quests us really easy to play no challenge at all abd annoying time mechanic doesn bring nothing exiting. Worse cycle by thhe quests but very good about players cards.\n\nBattle and siege looks really organic to the game, time mechanics just a boring…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432671","commentId":1432671,"userName":"MyNeighbourTrololo","timestamp":1422964297,"content":"I'm ok with the Time mechanic. It's interesting and brings a lot of interesting gameplay choices and decisions. It puts a dent on regular turtle tactic of many pre-VoI decks, that's why people hate it probably. Also, I laughed at someone trying to introduce a friend to the game by some late complicated and difficult quest instead of Passage through Mirkwood :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nHe also wishes to send his feedback, LOL! How much crap one guy can shovel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432679","commentId":1432679,"userName":"JanB","timestamp":1422965020,"content":"The time-mechanic is the answer against turtling with low-thread-decks.\n\n \n\ni like the time-mechanic .. some stresstest for your deck can be good :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432706","commentId":1432706,"userName":"joezim007","timestamp":1422967241,"content":"The only thing I have against the time mechanic is the upkeep. It does its intended job well but I can never remember to pay attention to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432718","commentId":1432718,"userName":"Eldainorn","timestamp":1422967985,"content":"I totally agre with the OP. I also dislike Time mechanic, but I surely am not turtling player. I always try to play a game  of LOTR LCG in max 30 minutes in solo and about an hour in 2 player.\n\n \n\nSome of the Time mechanic are just so bad, they really punch you in the face and it really bogs the game down for me. My favourite quests by far have been the Heirs of Numenor, AtS and Mirkwood cycle (Yes!), even thought they weren't as \"evolved\" as later quests.\n\n \n\nIf I had to rate the expansions with their corresponding cycle it would be: \n\n1. HoN + AtS Cycle\n\n2. Core + Mirkwood Cycle\n\n3. KD + DD Cycle\n\n4. VoI + Ringmaker"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432778","commentId":1432778,"userName":"Serazu","timestamp":1422972181,"content":"Strange. I consider this cycle to be the best so far, at least in terms of balance between player cards and challenge of quests. Mirkwood had good player cards, but mostly bland quests, Dwarrowdelf excellent player cards, but rather easy quests, Shadow mostly just ok player cards (with the notable exception of the Outlands mechanic) with mediocre heroes, but the most interesting quests so far, while the latest cycle managed to achieve balance: very strong player cards paired with a modicum of challenge. Anyway, this is my opinion on the matter.\n\nOther than that, I absolutely agree with Glaurung concerning the Dunledings and their ridiculous look; man, those people are the supposed Celts of the Middle Earth embittered by the tragic loss of their homeland to the hands of the Saxons... err, I meant the Rohirrim. Not the uncouth savages depicted in their respective cards! This isn't D&D!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432831","commentId":1432831,"userName":"MyNeighbourTrololo","timestamp":1422974465,"content":"I find a lot of celtic inspiration in these dunlednling arts of this cycle. Not all of them for sure - but that's good, because while inspired by celts, they are not celts. They are wild men of dunland, and art does pretty amazing job of depicting it. And after 3 cycles, they are rather good sight for a sore from orcs eyes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432841","commentId":1432841,"userName":"Distractionbeast","timestamp":1422975007,"content":"I like the time mechanic, and I haven't played most of the current cycle.  The biggest pitfall to avoid I think is making the quests too mechanically complex - and I've gotten that feeling before on a couple of them.  I'd say The Road Darkens is pretty close to that line.  The setup alone took a huge chunk of my precious weekly gaming time. \n\n \n\nIn moderation, I think the time mechanic is a great addition to the game which is a tool for addressing specific gameplay crutches or quest weaknesses.  \n\n \n\nAnd if you really think a quest is to difficult because of the time mechanic, add 1 or 2 to the starting timer when you play.  That should alleviate most of the pressure while maintaining the synergies of the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1432866","commentId":1432866,"userName":"Mndela","timestamp":1422976131,"content":"I like time mechanic, well, it depends. If i want to test a turtle deck, of course not.\n\nTime mechanic is not the question to me. The question is: i like Dunland Trap, Celebrimbor Secret, Antlered Crow..., however i dont like Tharbad, Nin-in-Eliph.\n\nTime mechanic? To like or not to like? It is not the question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433059","commentId":1433059,"userName":"Bullroarer Took","timestamp":1422983519,"content":"Timed works fine sometimes.  An example is Doom, Doom, Doom which is basically a Timed card.   But too much of it at once, or making the Timers too short just brings a level of complexity that I don't enjoy.  I know that by itself Timed isn't so complex, but it just adds another layer.  And when multiple cards have the effect going... yikes.  I hate winning a game and then realizing I missed a trigger, and Timed adds SO many triggers to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433359","commentId":1433359,"userName":"GondorianFire","timestamp":1422993630,"content":"> If you don't like the Time mechanic, the Antlered Crown will make you groaaan -- it is TIme on steroids!\n\n \n\nThanks for the heads up!\n\n \n\n> I'm ok with the Time mechanic. It's interesting and brings a lot of interesting gameplay choices and decisions. It puts a dent on regular turtle tactic of many pre-VoI decks, that's why people hate it probably. Also, I laughed at someone trying to introduce a friend to the game by some late complicated and difficult quest instead of Passage through Mirkwood :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n> He also wishes to send his feedback, LOL! How much crap one guy can shovel.\n\n \n\nThe reason I showed him Celebrimbor's Secret is because I was early to a gaming event and I had it all set up to play a solo game with 2 of my best decks and he wanted to try it out with me. I warned him that I tried it 3 times previously and lost.\n\n \n\n> The only thing I have against the time mechanic is the upkeep. It does its intended job well but I can never remember to pay attention to it.\n\n \n\nYes I forget to remove a time counter and in turn forget to trigger other effects.\n\n \n\n> I totally agre with the OP. I also dislike Time mechanic, but I surely am not turtling player. I always try to play a game  of LOTR LCG in max 30 minutes in solo and about an hour in 2 player.\n> \n>  \n> \n> Some of the Time mechanic are just so bad, they really punch you in the face and it really bogs the game down for me. My favourite quests by far have been the Heirs of Numenor, AtS and Mirkwood cycle (Yes!), even thought they weren't as \"evolved\" as later quests.\n> \n>  \n> \n> If I had to rate the expansions with their corresponding cycle it would be: \n> \n> 1. HoN + AtS Cycle\n> \n> 2. Core + Mirkwood Cycle\n> \n> 3. KD + DD Cycle\n> \n> 4. VoI + Ringmaker\n\n \n\nGlad I'm not the only one who feels this cycle was MEH. \n\n \n\n> I like the time mechanic, and I haven't played most of the current cycle.  The biggest pitfall to avoid I think is making the quests too mechanically complex - and I've gotten that feeling before on a couple of them.  I'd say The Road Darkens is pretty close to that line.  The setup alone took a huge chunk of my precious weekly gaming time. \n> \n>  \n> \n> In moderation, I think the time mechanic is a great addition to the game which is a tool for addressing specific gameplay crutches or quest weaknesses.  \n> \n>  \n> \n> And if you really think a quest is to difficult because of the time mechanic, add 1 or 2 to the starting timer when you play.  That should alleviate most of the pressure while maintaining the synergies of the encounter deck.\n\n \n\nI was considering adding time counters to some of the more time intensive quests but it would feel like a hallow victory that I cheated to get. I do like a challenge but quests like Nin In Eilph and Celebrimbor's Secret became very frustrating and turned me off from this game. I prefer quests from previous cycles that give a fair amount of challenge without forcing me to deal with nasty time consequences. I want to mention that I do not like to turtle as others have mentioned the time mechanic solves this \"issue\". \n\nEdited February 3, 2015 by GondorianFire"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433485","commentId":1433485,"userName":"MyNeighbourTrololo","timestamp":1422999316,"content":"How can you forget to remove time counters? They're most visual of all encounter deck stuff we currently have. They're like response that signify their existance to you with tokens - twice hard to forget as the usual one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433523","commentId":1433523,"userName":"GrandSpleen","timestamp":1423001020,"content":"And yet it is easy to forget."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433588","commentId":1433588,"userName":"Rob_Oz","timestamp":1423003745,"content":"Just to reiterate for the OP - its extremely unlikely you will see the Time mechanic in the next cycle.  Like other card games, its pretty clear that the designers for LotR:LCG plan to introduce new major quest/encounter deck mechanics when they release a new cycle.  It seems quite evident that the new mechanic for the Angmar Awakened cycle will be the side quest mechanic.  In the Against the Shadow cycle that mechanic was Battle/Siege. \n\n \n\nWhile we have seen a few quests outside of Against the Shadow that utilized the Battle/Siege mechanic it was virtually non-existent in the Ringmaker cycle (can't recall if it was in any of the RM quests or not.  Don't think it was).  Following that precedent its very, very unlikely you'll see the Time mechanic in Angmar Awakened.  You can, instead, grow to despise the side quest mechanic as that will be utilized very frequently.\n\nEdited February 3, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433596","commentId":1433596,"userName":"MyNeighbourTrololo","timestamp":1423003924,"content":"> And yet it is easy to forget.\n\nHow? I can't see any logical reason to that. End of the turn - check every encounter card with timed for stuff. It's a whole mechanic. There are cards that exclusively trigger during certain phases and other rare occurances, yet no one creates whine threads about them. This is just a hipocrisy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433613","commentId":1433613,"userName":"booored","timestamp":1423004910,"content":"I think the \"Time\" thing was a pretty decent idea. I hope that they continue to try new ways to shake things up. The great thing about the cycle system is that we only see it for one cycle, and if it is unpopular then it goes away, and if it is popular we see it popup now and then. The game is getting on now... with so many quest it is not hard to think that now and then one will come out you do not like. I wouldn't worry about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1433696","commentId":1433696,"userName":"GondorianFire","timestamp":1423008661,"content":"> Just to reiterate for the OP - its extremely unlikely you will see the Time mechanic in the next cycle.  Like other card games, its pretty clear that the designers for LotR:LCG plan to introduce new major quest/encounter deck mechanics when they release a new cycle.  It seems quite evident that the new mechanic for the Angmar Awakened cycle will be the side quest mechanic.  In the Against the Shadow cycle that mechanic was Battle/Siege. \n> \n>  \n> \n> While we have seen a few quests outside of Against the Shadow that utilized the Battle/Siege mechanic it was virtually non-existent in the Ringmaker cycle (can't recall if it was in any of the RM quests or not.  Don't think it was).  Following that precedent its very, very unlikely you'll see the Time mechanic in Angmar Awakened.  You can, instead, grow to despise the side quest mechanic as that will be utilized very frequently.\n\nThanks for the reassurance. The side quests sound much more interesting to me, but as you say the designers will more than likely utilize them frequently in the new quests. There's only one thing to do now and wait for The Lost Realm  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435615","commentId":1435615,"userName":"divinityofnumber","timestamp":1423106657,"content":"I have enjoyed the Time mechanic greatly. The more cards in the card pool, the more efficient the player decks have gotten. The encounter deck needs a way to keep horde-type player decks in check. The game has had its share of scenarios where most players realize that if you can turtle and stabilize a bit, you've got the win. I hate that feeling.\n\n \n\nMy 4-player group has been playing since day one, and I am so used to hearing things like:\n\n \n\n\"Do you want to flip it (referring to the active quest card) this turn?\"\n\n\"Nah, quest close to what we need; we can eat a threat or two or pitch things to Eowyn if we need to. We'll probably see another two enemies and can for sure get rid of what is out now. Let's stabilize and build for a few turns and then flip it.\"\n\n \n\nThere are those moments when the players have effectively seized control of the scenario. Time messes with the turtling strategy and I really, really like that. The encounter deck is our only opponent...we need it to really challenge us. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435836","commentId":1435836,"userName":"PsychoRocka","timestamp":1423122839,"content":"I personally have been in many situations where I thought I had complete control of the scenario and something completely flipped that and lead to a loss or much much lesser victory. Time shuts down playing slowly or trying to amass forces/attachments which is a legitimate type of play and deck. There are PLENTY of scenarios that do not use time that are seriously challenging.. also there is nightmare.\n\nI don't really get the hate for turtling.... if you are able to keep reducing your threat, slowly amass forces and attachments and beat off everything encounter card and effect thrown at you whilst doing so you are a champ or are playing a quest that is far too easy.\nWhat I think is dodgy is the opposite, decks that can draw their whole deck instantly and win within 3 turns, where is the fun in that? Barely any combat and no time for the encounter deck to shine. Also I'm pretty sure its just the really early quests (like some of the mirkwood cycle) where you can turtle and stabilize and then just be sweet for the remainder of the game without any risk as most quests have either lots of threat raising encounter cards, cards that remove attachments or cards that can wipe out many allies at once or your best ally and can therefore completely shutdown turtling anyway....\n \n\nAs a player who somewhat \"turtles\" threating out is the cause for my losses more often than anything else (losing a hero/multiple heroes and conceding, quest specific loss conditions, objective ally dying etc) so to me threat itself is clearly an inbuilt and already existing counter to turtling.\n\n \n\nTime was ok overall and great in a few key quests but it seems like the majority of players are over it and don't want to see it for a while/very much. I think that all the various other clever ways to punish players for taking too long or not achieving certain goals are all FAR FAR better, more thematic and less frustrating than being punished simply for \"taking too long\" and not taking too long to do anything in particular (I know that the Time mechanic obviously relates to something taking place in the quest that necessitates quick progression) but just how many turns it takes you to progress from one quest stage to the next.\n\nLook at some fantastic examples of quests that already have something similar to \"time\" but done far better:\n\n-Getting \"Lost\" in the long dark\n\n-Extra stages that can be removed in Siege of Cair Andros\n\n-Prowl in Druadan Forest\n\n-Dead Villagers vs Rescued Villagers in Encounter at Amon Din\n\n-Doom, Doom, Doom in Journey in the Dark\n\n-Extra Ringwraiths being added to the encounter deck in Shadow of the Past if you draw too much attention to your party/don't progress through stage 2 fast enough.\n\n-To The Tower in Morgul Vale\n\n-Day, Dusk and Midnight in Stone of Erech\n\n-Proceeding through quest stages in the Old Forest until you have a needed amount of Victory Points, also Old Man Willow raising threat like crazy while you try to beat stage 3\n\n-Finishing Redhorn Gate before your heroes freeze to death (in multiple ways)\n\n-Return to Mirkwood constantly raising your threat from guarding Gollum and escorting him.\n\nEdited February 5, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435920","commentId":1435920,"userName":"Serazu","timestamp":1423131032,"content":"Anyway, if turtling is too much of a problem and breaks the game, the DT can always force a draw cup, much like in AGoT LCG. I, personally, do not consider turtling a stain in the game's dress."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435988","commentId":1435988,"userName":"MyNeighbourTrololo","timestamp":1423138381,"content":"Turtling is not too much of a problem, it's popular tactics, and devs like to deal with those in a different ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435990","commentId":1435990,"userName":"Serazu","timestamp":1423138824,"content":"Correct. The Dunland Trap is a fine example of this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1435994","commentId":1435994,"userName":"booored","timestamp":1423138963,"content":"> (snip)\n\nturteling is a overused word around here. I do not think there is anything wrong with the play style that manages threat and goes for a slower win. Decks like that can be very fun.\n\nThe thing some people are talking about with turteling is about how odds stack. The encounter deck doesn't change its ods. It stays at the same power level for the entire quest. The player board gain more and more power and stability as the game goes longer. Almost all quests once you stabilize your board you are pretty much golden. This is how turteling started getting talked about on this forum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436201","commentId":1436201,"userName":"monkeyrama","timestamp":1423150703,"content":"I'm a little surprised that so few of the 'special' keywords get re-used. Archery has come up regularly. But battle and siege are rare, and could mix interestingly with time etc., and prowl seems to be gone after one scenario etc. It would be nice if they could get re-used sometime. Although I realise this would mean adding those rules to the scenario each time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436247","commentId":1436247,"userName":"GrandSpleen","timestamp":1423152345,"content":"Yeah, there are quite a few keywords that are scenario specific, like Ambush, Prowl, Hide, and Underworld.  I think that's done very intentionally, to lend unique flavor to the different scenarios.  I doubt if Prowl was ever intended to be used again outside of the Druadan Forest, for example.  Underworld is certainly very specific in its theme.  \n\n \n\nBut then we do have keywords that pop up here and there outside of their original scenario.  I expect we will see more of Toughness in the future..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436295","commentId":1436295,"userName":"Teamjimby","timestamp":1423154318,"content":"I loved the time mechanic while I generally despise battle and siege.  As someone that doesn't like to deckbuild for a specific quest, battle and siege make many decks and heroes totally worthless and it makes a core attribute totally worthless.  Meanwhile, time gives a sense of urgency that usually adds more excitement to the game.  I like to play low threat decks with lots of card draw and I had a total blast in this cycle because time and the Dunlendings forced me to play those decks differently.  Although I will admit that time can be overdone.  I don't think there should ever be more than 2 or 3 cards with Time in play at once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436421","commentId":1436421,"userName":"leptokurt","timestamp":1423159248,"content":"Time mechanic was cool.\n\n \n\n \n\n \n\n \n\nThe end"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436895","commentId":1436895,"userName":"Daenarys","timestamp":1423178197,"content":">  \n> \n> > And yet it is easy to forget.\n> \n> How? I can't see any logical reason to that. End of the turn - check every encounter card with timed for stuff. It's a whole mechanic. There are cards that exclusively trigger during certain phases and other rare occurances, yet no one creates whine threads about them. This is just a hipocrisy. \n> \n>  \n\n \n\n1) Stop trolling him. Mistakes happen and things get forgotten, this happens all the time with LCG's due to their complexity. If you remember everything then congratulations....\n\n2) This is not hypocritical\n\n3) It's HYPOCRISY\n\n4) Just saying !!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436905","commentId":1436905,"userName":"MyNeighbourTrololo","timestamp":1423178570,"content":">  \n> \n> >  \n> > \n> > > And yet it is easy to forget.\n> > \n> > How? I can't see any logical reason to that. End of the turn - check every encounter card with timed for stuff. It's a whole mechanic. There are cards that exclusively trigger during certain phases and other rare occurances, yet no one creates whine threads about them. This is just a hipocrisy. \n> > \n> >  \n> \n>  \n> \n> 1) Stop trolling him. Mistakes happen and things get forgotten, this happens all the time with LCG's due to their complexity. If you remember everything then congratulations....\n> \n> 2) This is not hypocritical\n> \n> 3) It's HYPOCRISY\n> \n> 4) Just saying !!!\n> \n>  \n\n1) To stop trolling him I need to start trolling him, which I never did. Yes, mistakes happen and things get forgotten in LCGs, but if anything - Time keywords makes things easier to remember because it:\n\na) normalizes them - there is literally only one natural trigger which happens at the most action-free phase;\n\nb) visualizes them - cards with Time keyword have friggin RESOURCE TOKENS on them. You don't even have to read the text to see that this card has something to do at the end of the round. \n\n2) It is. If Time is easy to forget for you, then other stuff is even easier to forget and then we have two options: there is either something wrong with the game, or with you. Not the Time keyword.\n\n3) Ok.\n\n4) Just saying.\n\nEdited February 5, 2015 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436916","commentId":1436916,"userName":"Daenarys","timestamp":1423178969,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > And yet it is easy to forget.\n> > > \n> > > How? I can't see any logical reason to that. End of the turn - check every encounter card with timed for stuff. It's a whole mechanic. There are cards that exclusively trigger during certain phases and other rare occurances, yet no one creates whine threads about them. This is just a hipocrisy. \n> > > \n> > >  \n> > \n> >  \n> > \n> > 1) Stop trolling him. Mistakes happen and things get forgotten, this happens all the time with LCG's due to their complexity. If you remember everything then congratulations....\n> > \n> > 2) This is not hypocritical\n> > \n> > 3) It's HYPOCRISY\n> > \n> > 4) Just saying !!!\n> > \n> >  \n> \n> 1) To stop trolling him I need to start trolling him, which I never did. Yes, mistakes happen and things get forgotten in LCGs, but if anything - Time keywords makes things easier to remember because it:\n> \n> a) normalizes them - there is literally only one natural trigger which happens at the most action-free phase;\n> \n> b) visualizes them - cards with Time keyword have friggin RESOURCE TOKENS on them. You don't even have to read the text to see that this card has something to do at the end of the round. \n> \n> 2) It is. If Time is easy to forget for you, then other stuff is even easier to forget and then we have two options: there is either something wrong with the game, or with you. Not the Time keyword.\n> \n> 3) Ok.\n> \n> 4) Just saying.\n> \n>  \n\n \n\n \n\nWell i thought i would dignify you with a swift response\n\n \n\n1) I agree but MISTAKES/ FORGETTING happens..Dont delude yourself\n\n2) This is not hypocritical. You are not using this word in the correct context. You may think you are but you are not..\n\n3) You're welcome"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436971","commentId":1436971,"userName":"MyNeighbourTrololo","timestamp":1423180626,"content":"1) Did you even read my post? Jeez.\n\n2) Or so you think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1436994","commentId":1436994,"userName":"Teamjimby","timestamp":1423181505,"content":"This is going downhill fast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1438078","commentId":1438078,"userName":"leptokurt","timestamp":1423249667,"content":"I do sometimes forget to remove time tokens. Perhaps because adding is so much cooler than removing...\n\n \n\nI am a bad person!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1438146","commentId":1438146,"userName":"CaffeineAddict","timestamp":1423251514,"content":"With all the effects on cards, its very easy to miss doing something. I quite often forget the time counters. It generally depends how distracted I am when i'm playing. When i realise i've forgotten something, I back up the game state if I can, and then carry on, but otherwise i'll probably just start a fresh game, as I don't like feeling like i've \"cheated\" somehow.\n\nIts so easy to overlook things, I'm not particularly convinced by anyone who says they've never forgotten anything. Either they're amazingly focused, in which case congratulations, or they never realised they missed something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1440543","commentId":1440543,"userName":"Spurries","timestamp":1423428046,"content":"Even with Time I think Antlered Crown is one of my favorites. Can be difficult but not too difficult. Played 2P the other day and a couple times it looked like we had lost if it wasn't for some location management. Very fun. I think this cycle was one of the best, Tharbad was a bit too easy for Solo player, and Nin in ElPh kinda annoyed me because it could destroy any strategy depending on the quest you draw, but overall a strong cycle and I have nothing but optimism for the direction the game is heading"},{"commentUrl":"https://community.fantasyflightgames.com/topic/133856-time-mechanic-kills-the-game-for-me/?do=findComment&comment=1440890","commentId":1440890,"userName":"Glaurung","timestamp":1423447403,"content":"Dunland trap and A.crown is the best. I only keep that 2. All other stay jn the box I dont wonna play it anymore. Annoying… boring and easy."}]}