{"url":"https://community.fantasyflightgames.com/topic/134080-dunland-trap-questions/","title":"Dunland Trap questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134080-dunland-trap-questions/?do=findComment&comment=1435797","commentId":1435797,"userName":"Casanunda","timestamp":1423118645,"content":"The interaction between Hithaeglir Stream and the various Forced triggers in this quest is giving me issues.  \n\n \n\nHithaeglir Stream states that while it \"... is the active location, players draw 2 cards during the resource phase instead of 1.\"  \n\n \n\nThe forced triggers read \"After a player draws any number of cards, ....\".  \n\n \n\nDo these triggers go off twice while the stream is the active location?  The usage of the words \"any number of cards\" is throwing me off here, it seems to imply that if the cards are drawn simultaneously, the effect only triggers once (per player).  Am I interpreting this correctly?  On a related note, are the cards drawn in the resource phase simultaneous?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134080-dunland-trap-questions/?do=findComment&comment=1435899","commentId":1435899,"userName":"alogos","timestamp":1423129227,"content":"Well, you only draw once during the resource phase, it's the effect of the phase. You just draw 2 cards instead of 1 with the location.\n\n\"any number of cards\" is what it says. The effect triggers only once if you draw X cards, where X should be > 0.\n\n \n\n\"Draw until\", don't know if it exists, but that should be drawing cards one by one. Not sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134080-dunland-trap-questions/?do=findComment&comment=1436238","commentId":1436238,"userName":"GrandSpleen","timestamp":1423152040,"content":"The Fords of Isen location in the Fords of Isen scenario uses the wording \"draw until.\"  There was some discussion about it in an old thread here [https://community.fantasyflightgames.com/index.php?/topic/100910-fords-of-isen-and-dunland-berserker/] but I never saw an official answer.  I think it is still one effect that is being resolved, rather than repeatedly resolving the same effect multiple times, and drawing 5 cards in this manner would still only trigger a Forced effect once.  The Fords of Isen literally can force you to draw 5 cards, and that could mean 5 Berserker attacks, which seems like territory that is reserved for Smaug or particularly nasty Nazgul..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134080-dunland-trap-questions/?do=findComment&comment=1436749","commentId":1436749,"userName":"Casanunda","timestamp":1423172137,"content":"> Well, you only draw once during the resource phase, it's the effect of the phase. You just draw 2 cards instead of 1 with the location.\n> \n> \"any number of cards\" is what it says. The effect triggers only once if you draw X cards, where X should be > 0.\n> \n>  \n> \n> \"Draw until\", don't know if it exists, but that should be drawing cards one by one. Not sure.\n\n \n\nThis is certainly the way that I'm leaning, but I can't seem to find much information on how you draw cards during the resource phase.  Is it one at a time, or simultaneous?  Who knows.  Since it isn't an \"action\", like \"Draw 2 cards\" would be, it seems less cut and dry than things like Daeron's Runes, Stage 2 of this quest, or other card drawing effects.  The Fords of Isen wording I would certainly interpret as only forcing one trigger, as it is also an action. \n\n \n\nI suppose I'll stick with this interpretation for the time being, simply because it means that I beat the scenario fair and square ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png].  That difference of 1 damage would have actually caused me to fail the quest, my heroes were literally maxed on damage taken."}]}