{"url":"https://community.fantasyflightgames.com/topic/134206-gandalf-vilya-and-the-fords-of-isen/","title":"Gandalf, Vilya and The Fords Of Isen","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134206-gandalf-vilya-and-the-fords-of-isen/?do=findComment&comment=1438001","commentId":1438001,"userName":"13thcaesar","timestamp":1423247340,"content":"I have a question about scenario \"The Fords Of Isen\":\n\n \n\nIn this scenario, some cards triggering some effects when player draws any numbers of cards, example Dunland Berserker: After the engaged player draws any number of cards, Dunland Berserker makes an attack.\n\n \n\nGandalf (Hero) have effect: Play with the top card of your deck faceup. Once per phase, you may play the top card of your deck as if it was in your hand. When playing a card this way, Gandalf is considered to have the printed Leadership, Lore, Tactics and Spirit icons.\n\n \n\nVilya have action: Exhaust Elrond and Vilya to reveal the top card of your deck. You can immediately play or put into play the revealed card for no cost, if able. Otherwise, move the revealed card to the bottom of your deck.\n\n \n\nSo, when I use Gandalf effect or Vilya action, and have Dunland Berserker engage with me, then this enemy effect triggering?\nEdited February 6, 2015 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134206-gandalf-vilya-and-the-fords-of-isen/?do=findComment&comment=1438075","commentId":1438075,"userName":"13thcaesar","timestamp":1423249595,"content":"I play solo deck Gandalf / Elrond / Glorfindel (Spirit), and wanted check how many quests I can finish with one deck. I finish 29 quests: 1. The Massing At Osgiliath. 2. The Battle Of Lake-Town. 3. The Stone Of Erech. 4. Passage Through Mirkwood (Nightmare Deck). 5. Journey Down The Anduin. 6. The Hunt For Gollum. 7. Conflict At The Carrock. 8. A Journey To Rhosgobel. 9. The Hills Of Emyn Muil. 10. The Dead Marshes. 11. Return To Mirkwood. 12. Into The Pit. 13. The Seventh Level. 14. Flight From Moria. 15. The Redhorn Gate. 16. Road to Rivendell. 17. The Watcher In The Water. 18. The Long Dark. 19. Foundations Of Stone. 20. Shadow And Flame. 21. Peril In Pelargir. 22. Into Ithilien. 23. The Steward's Fear. 24. The Druadan Forest. 25. Encounter At Amon Din. 26. Assault On Osgiliath. 27. The Blood Of Gondor. 28. To Catch An Orc. 29. Into Fangorn.\n\n \n\nOnly 5 times interfered in the deck:\n\n \n\n* A Journey To Rhosgobel - swapped 3x Flame Of Anor to 3x Lore Of Imladris.\n\n* The Redhorn Gate / Road To Rivendell - removed from the deck ally  Arwen Undomiel.\n\n* Into Ithilien -   Denethor ally swapped for a second copy of Beorn ally. And I added to the deck 3x Light The Beacons.\n\n* The Blood Of Gondor - removed from the deck ally Faramir.\n\n \n\nI have only problem with 4 scenario:\n\n \n\n1. Escape From Dol Guldur.\n\n2. The Siege Of Cair Andros.\n\n3. The Morgul Vale.\n\n4. The Fords Of Isen.\n\n \n\nI do not test this deck in Saga expansion (I personally think it's better to play in this  scenarios more thematics decks). I do not have yet the Ring-maker cycle, The Old Forest and Fog On The Barrow-Downs.\n\n \n\nBut back to the thread, in the scenario Ford Of Isen, I played that Gandalf effect and Vilya action triggering effects Dunland Berserker or Dunland Tribesman, and this scenario, if I played good, its hard to win with this Deck.\n\nEdited February 6, 2015 by 13thcaesar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134206-gandalf-vilya-and-the-fords-of-isen/?do=findComment&comment=1438253","commentId":1438253,"userName":"GrandSpleen","timestamp":1423255531,"content":"Vilya and Gandalf will not trigger an attack by the Berserker.  If the card doesn't explicitly say \"draw,\" you are not considered to have drawn a card.  You could use something like King Under the Mountain and the Berserker would not trigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134206-gandalf-vilya-and-the-fords-of-isen/?do=findComment&comment=1438414","commentId":1438414,"userName":"13thcaesar","timestamp":1423261081,"content":"thanks GrandSpleen\n\n \n\nSo I playing in the hard way "}]}