{"url":"https://community.fantasyflightgames.com/topic/134285-from-siege-to-battle/","title":"From Siege to Battle...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134285-from-siege-to-battle/?do=findComment&comment=1439221","commentId":1439221,"userName":"lecudas","timestamp":1423332334,"content":"I have a rule question that I hope you can help me with (you seldom seem to disappoint!).\n\n \n\nI Just played (and beat) Siege of Cair Andros last night, but ran into a bit of a dilemma. I had succeeded to clear two Battleground locations during the first quest stage. Last up was the Citadel as the active location. It already had 10 progress tokens on it when the question arose…\n\n \n\nMe and my co-player committed characters to quest (it was Siege, so we used defense). During the staging step an enemy came out. After revealing enemies (but before resolving questing) there is an action window, so I used “Hands on the Bow” with Legolas, and destroyed the enemy. With Legolas’ ability I put two progress tokens on the active location - and had thus cleared all three Battleground locations.\n\n \n\nThis means that we beat the quest stage, and moved on to Quest stage 5a. Notice, we have not yet resolved questing.\n\n \n\nSince we have cleared all the Battleground locations, the questing for stage 5 is no longer “Siege” but “Battle”… What happens? Do we resolve the questing using the same characters committed to the quest but adding up Attack instead of Defense? Do we not resolve the question and move into the battle phase?\n\n \n\nWhat we did was the first alternative (which sucked, since we had committed characters with high defense and low attack score)… But what should we have done?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134285-from-siege-to-battle/?do=findComment&comment=1439336","commentId":1439336,"userName":"GrandSpleen","timestamp":1423340788,"content":"You played it correctly.  If the keyword changes in the middle of the questing phase, you'll have to use the currently relevant stat when you complete that last and vital step of the quest phase (count up, compare, place tokens).  \n\n \n\nYou could force a similar scenario by using the Trained for War tactics event card (if I am remembering the name correctly).  It gives the current quest the Battle keyword, if it does not already have a keyword.  You can play that card before or after staging, giving you flexibility to change your quest to Battle if you so desire.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134285-from-siege-to-battle/?do=findComment&comment=1439855","commentId":1439855,"userName":"lecudas","timestamp":1423375479,"content":"Thanks Spleen! Glad to know I beat the scenario fair and square."}]}