{"url":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/","title":"Are Ents too strong?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439557","commentId":1439557,"userName":"leptokurt","timestamp":1423354467,"content":"Perhaps I just missed the discussion, but I wonder why no one here mentioned that these ent guys are way overpowered. They're cheap, they can quest, attack and defend (even in one turn, if you want to), they can soak up so much damage which only makes them stronger. I rarely lost a game in which i could play Treebeard on turn 2. The saga expansions are even worse, because you can play more of them and earlier.\n\n \n\nYes, they're not as bad as these Outland dudes, but man, they're pretty, PRETTY strong. And they can grow fruits...\n\nEdited February 8, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439564","commentId":1439564,"userName":"danpoage","timestamp":1423354838,"content":"It seems fitting to me that the Ents are powerful. After all, they played a huge part in the defeat of an Istari; I imagine many players would be disappointed if they weren't powerful. I don't know if I would say overpowered, though. Losing the ability to act the round they enter play is a pretty significant, and appropriate, drawback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439575","commentId":1439575,"userName":"PsychoRocka","timestamp":1423355311,"content":"If you aren't able to ready them immediately the enters play exhausted drawback I've found is pretty significant. Definitely agree with Danpoage and would not say overpowered but rather simply powerful.\n\nTreebeard's ability to perform two actions every second turn (by readying himself with his ability) with his stellar stats is bit crazy but he does cost 4 and enters play exhausted himself. He may be a little too strong but I really don't think the others so far are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439578","commentId":1439578,"userName":"Catastrophic09","timestamp":1423355508,"content":"Definitely not overpowered, Treebeard is crazy but is unique so he's the only copy on the table and will not do well against hard hitting quests from the beginning and does much better for longer quests or turtleing which isn't too popular in recent quests. \n\nWondering Ent has lots of good stats but you can't use them all and Booming Ent is difficult to get to more than 4 or 5 attack and both of these entering play exhausted is a proper limitation. I do not think they are overpowered at all.\n\n \n\nBeing able to ready the Ents can get the most of their power but this requires Leadership which none of the Ents are currently in. Just like any deck though if you support it properly it can get way strong but I don't see Ents overly powered compared to other traits right now (they are just a small sub-theme)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439617","commentId":1439617,"userName":"GrandSpleen","timestamp":1423358043,"content":"I think the best way to balance Ents  is to stop releasing them.  Make them as rare as they were in Middle-earth.\n\n \n\nWe have some really nice Ent cards now.  With 7 cards you can have a very nice support archetype.  Let it stop there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439768","commentId":1439768,"userName":"joezim007","timestamp":1423368097,"content":"If they are going to release any more ents, then they need to be unique."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439867","commentId":1439867,"userName":"Catastrophic09","timestamp":1423377002,"content":"There has to be more Ents! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] A couple unique ones would be great but a couple more generic ones wouldn't be bad either. Treebeard will always ready himself since he's the most powerful unless Booming Ent gets really strengthened up of which he would need errata to limit his attack if there are lots of more Ents released (limit +3 attack)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1439966","commentId":1439966,"userName":"leptokurt","timestamp":1423387767,"content":"I totally agree that there shall be Ents no more.\n\n \n\nI think that it's Treebeard's ability that makes them OP. Once he's in play you effectively pay only one resource for all the other Ents, which leaves two resources that one can spent to play other cards. That's enough to stall the encounter deck for one round or two. Or you use Treebeard's power to ready Ents after they enter play, which makes their only weak spot irrelevant.\n\n \n\nBtw, if you want to play a strong deck, try Ents together with Hobbits (Frode / Pippin (lore) / Merry). Hell, I think every secrecy deck should go totally nuts with some Ents added to the mix.\n\nEdited February 8, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440000","commentId":1440000,"userName":"Happycatmachine","timestamp":1423391731,"content":"I think they've done a great job with Ents so far. I think they should fill out the lore with more unique ents. Do people find that other players gravitate toward OP decks? My group is pretty small and I don't think any of us would habitually play an exploitative deck. We'd try it out, just to see what it's like (I've built exactly ONE outlands deck, myself) but repeated playing a deck that stomps most quests is boring. I remember getting super-tired of playing Eagles about a yearish ago.\n\n \n\nI say more Ents. Give me the option to play with them. It's not like anyone is forcing me to build a deck with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440146","commentId":1440146,"userName":"joezim007","timestamp":1423404074,"content":"I think Booming Ents would get too powerful if we get too many more ents, but making the new ones unique would limit the number of ents on the table, thus limiting the power growth of the Booming Ents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440336","commentId":1440336,"userName":"jormungandr","timestamp":1423415698,"content":"I would really  like huorns, as there are many more than ents. They would switch over to the staging area if ever the controlling player would have no ent in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440354","commentId":1440354,"userName":"GrandSpleen","timestamp":1423417344,"content":"> Do people find that other players gravitate toward OP decks? My group is pretty small and I don't think any of us would habitually play an exploitative deck.\n> \n>  \n> \n> . . . \n> \n>  \n> \n> I say more Ents. Give me the option to play with them. It's not like anyone is forcing me to build a deck with them.\n\n \n\nSee, that's the thing. I want to play Ents too.  If they are too powerful, it would be boring to play.  Then these guys end up collecting dust."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440362","commentId":1440362,"userName":"MyNeighbourTrololo","timestamp":1423417763,"content":"You gusy all miss few important points.\n\nPoint one: ents are extremely slow, if you're going to lay all your deck on ents, you'll most certainly will be overwhelmed fast.\n\nPoint two: ents function within one player, so if they create non-unique spirit and leadershit ents - it will not hurt the balance as it'll be extremely hard to field so many allies from different spheres at once, especially taking in account that they won't be effective the turn you field them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440383","commentId":1440383,"userName":"GrandSpleen","timestamp":1423419232,"content":"True, but Outlands functions the same way with respect to being a multisphere trait. There are ways around the cost restrictions.  Outlands has Hirluin, Ents have Treebeard, which is not on the same level as Hirluin in terms of resource generation and reliability to be sure.\n\n \n\nDwarves are slow to build power due to their cost, but once established are unstoppable.  And people keep saying that the 'enters play exhausted' is a significant drawback, but I see it as almost negligible.  Due to the low cost (so far) of Ents, you can get them in play a round sooner than you would, say a 3-cost Gloin or Bifur ally.  No one considered Dwarves underpowered due to their speed.  In that case an Ent and a Dwarf couldbe functionally considered equal in terms of their action advantage and access to their stats.  But the Ent can be readied and used sooner through some card effects.\n\nEdited February 8, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440406","commentId":1440406,"userName":"MyNeighbourTrololo","timestamp":1423420351,"content":"Do ents got a leadershit(most rich and easily aquiring resources sphere) hero who can pay for all the ents from different spheres? No. To play Treebreard, you need to draw him first, you need to aquire 4 resources, you need to wait til he builds his pool (you can't give him resources through card effects). It's entirely different from Hirluin. \n\nEdited February 8, 2015 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440413","commentId":1440413,"userName":"Raven1015","timestamp":1423420796,"content":"I don't think Ents are overpowered and I do like their design overall. I will say, however, in the right deck that the \"enters play exhausted\" weakness isn't really that significant. Specifically, if you have a deck with some action advantage and some relatively decent heroes, they can cover for the Ents until they are set up and ready to go. I haven't found readying for the Ents themselves (beyond Treebeard) all that necessary. Basically, as the OP said, the Ents are pretty **** strong. I've gotten the Booming Ents up to 6 attack each several times, and in one particularly memorable instance, smashed all three guardians in The Three Trials during a single round of combat. So again, I wouldn't say they are overpowered, but with just three different Ent allies, they're already on the high end of the power scale. I could see the Booming Ent potentially needing errata in the future if we do get more Ents, with a +3 cap being reasonable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440472","commentId":1440472,"userName":"MyNeighbourTrololo","timestamp":1423423727,"content":"I don't see the need for that. If a player can manage to bring 12 different sphered ents into play and wound them all without losing them - he dam well deserves the benefit :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440797","commentId":1440797,"userName":"soullos","timestamp":1423442294,"content":"I want an ent deck. So more ents please! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1440898","commentId":1440898,"userName":"Glaurung","timestamp":1423447779,"content":"Ents a cool. The problems is not to much of them. We need more!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1441004","commentId":1441004,"userName":"Raven1015","timestamp":1423455399,"content":"> I don't see the need for that. If a player can manage to bring 12 different sphered ents into play and wound them all without losing them - he dam well deserves the benefit :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nHa, true. I loved during that game of The Three Trials when the Raven Guardian's time counters went off...putting 1 damage on all of my Ents. Um, yeah, thanks dude, should've thought that one through!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1441521","commentId":1441521,"userName":"divinityofnumber","timestamp":1423494692,"content":"Treebeard is a beast. But, I do find myself not playing him when I have four resources sometimes. The fact that he comes into play exhausted does give you something to think about and is a big drawback. Sometimes I know that I am going to have multiple enemies engaged with me and I just cannot spend four resources for something that is not able to block that turn. \n\n \n\nI feel like he is powerful, but I find myself playing him when I am already doing well and basically have four resources lying around. He is also nice if you have a way to spam out some big allies such as Elf Stone or Vilya. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1441613","commentId":1441613,"userName":"Calyx","timestamp":1423497704,"content":"Obviously we will get more Ents - we need Quickbeam! I assume he will come in the next saga expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1442910","commentId":1442910,"userName":"MyNeighbourTrololo","timestamp":1423564006,"content":"Who's this Quickbeam bloke everyone talking about? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1442917","commentId":1442917,"userName":"Olorin93","timestamp":1423564265,"content":"He's in the books, in scenes with Merry and Pippin. Might be the only named Ent besides Treebeard, but I'm currently re-reading TTT for the first time in years and haven't come very far yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449461","commentId":1449461,"userName":"leptokurt","timestamp":1423958441,"content":"> Treebeard is a beast. But, I do find myself not playing him when I have four resources sometimes. The fact that he comes into play exhausted does give you something to think about and is a big drawback. Sometimes I know that I am going to have multiple enemies engaged with me and I just cannot spend four resources for something that is not able to block that turn. \n> \n>  \n> \n> I feel like he is powerful, but I find myself playing him when I am already doing well and basically have four resources lying around. He is also nice if you have a way to spam out some big allies such as Elf Stone or Vilya. \n\nI find myself playing him EVERYTIME I have 4 resources, and he never fails to disappoint me.\n\n \n\nHmmmh, perhaps I should have named this thread \"Ents are too strong!\" to make the expected kind of answer a bit more obvious?\n\n \n\n \n\n \n\n \n\n \n\n \n\n(loosers! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449652","commentId":1449652,"userName":"Glaurung","timestamp":1423978916,"content":"What about Radagast? He is more useful now with all that creatures or stlill expensive? Maybe wizard pipe have point with him?\n\nI didn try all those new cards yet….."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449667","commentId":1449667,"userName":"booored","timestamp":1423981368,"content":"It is pretty hard to loose with ents, but it is far less powerful than many other decks. This game is such a push over now it is getting ridiculous!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449672","commentId":1449672,"userName":"GrandSpleen","timestamp":1423983035,"content":"Sadly, Ents aren't \"creatures\" and Radagast can't pay for them :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449709","commentId":1449709,"userName":"gandalfDK","timestamp":1423987194,"content":"> Sadly, Ents aren't \"creatures\" and Radagast can't pay for them :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nBiggest bummer/loss/stupidity ever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449774","commentId":1449774,"userName":"Chris51261","timestamp":1423997351,"content":"> It is pretty hard to loose with ents, but it is far less powerful than many other decks. This game is such a push over now it is getting ridiculous!\n\nTalk me through exactly how you're beating Nightmare Escape from Dol Guldur?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449785","commentId":1449785,"userName":"booored","timestamp":1423999944,"content":"Don't need to. Glaurung has a solo video on YouTube that people who don't know how to play can watch and the card pool is well more powerful now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449794","commentId":1449794,"userName":"Chris51261","timestamp":1424002118,"content":"He has one of normal mode. You show me a deck that's beating Nightmare more than 50% of the time and maybe I can take your, \"This game is too easy\" stuff seriously. Until then, you can say \"don't need to\" all you want, but I'm taking that as \"I can't.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449829","commentId":1449829,"userName":"booored","timestamp":1424006074,"content":"hmm was sure he had a nightmare version up . Still regardless of your inability to understand the game to the point of beating this quest you should also take into account that this quest is well known as a anomaly. Picking one quest out of 30+ is not only unrepresentative but also petulant.\n\n \n\nI'll give you a hint\n\n \n\n• The way to beat this quest on nightmare solo was opened up with the mono faction heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1449969","commentId":1449969,"userName":"Chris51261","timestamp":1424019270,"content":"LOL, man are you pompous! I've beaten it before, and even if I hadn't you are the LAST person I'd ever genuinely ask for help! Despite what you believe I don't think I've ever seen you be right about any complex issue or post some game breaking deck. And there's a myriad of quests that the best you're hoping to do is 50%. I have no idea why I'm feeding into you, because as usual, you talk big but back up exactly none of your talk. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450008","commentId":1450008,"userName":"MyNeighbourTrololo","timestamp":1424023076,"content":"Game may be easy for couple of chosen ones, for others it's as challenging as they come. Hell, even infamous Encounter at Amon Din can give you a hard time once in a while.\n\nEdited February 15, 2015 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450122","commentId":1450122,"userName":"leptokurt","timestamp":1424030546,"content":"> Game may be easy for couple of chosen ones, for others it's as challenging as they come. Hell, even infamous Encounter at Amon Din can give you a hard time once in a while.\n\nTotally agreed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450153","commentId":1450153,"userName":"Chris51261","timestamp":1424032698,"content":"> Game may be easy for couple of chosen ones, for others it's as challenging as they come. Hell, even infamous Encounter at Amon Din can give you a hard time once in a while.\n\nAbsolutely. It's always going to be game to game too, since this is a card game. Card draw can go completely your way sometimes, but completely against you other times. To say \"this game is too easy\" sure makes it sound like someone is quickly glossing over their first and second round loses and focusing way too much on those few wins. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450254","commentId":1450254,"userName":"Spurries","timestamp":1424040312,"content":"> LOL, man are you pompous! I've beaten it before, and even if I hadn't you are the LAST person I'd ever genuinely ask for help! Despite what you believe I don't think I've ever seen you be right about any complex issue or post some game breaking deck. And there's a myriad of quests that the best you're hoping to do is 50%. I have no idea why I'm feeding into you, because as usual, you talk big but back up exactly none of your talk. \n\nDont. Feed. The. Trolls."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450341","commentId":1450341,"userName":"booored","timestamp":1424047166,"content":"> > Game may be easy for couple of chosen ones, for others it's as challenging as they come. Hell, even infamous Encounter at Amon Din can give you a hard time once in a while.\n> \n> Totally agreed.\n\nThe thing is that this quest is now trivial. What people are really saying when they find some of the older quests hard is that they are just not using top tier decks. Sure any game can have a bad draw, but we are talking about the \"possibility\" to beat something. Amon Din, should be like 80% plus if your using the \"correct\" decks. The thing is that this game is not a competitive one and there are a number of factor4s that lead to deck design witch is NOT based on power. Theme or tribes or the illusive \"one deck to rule them all\". Any quest can have a deck designed for that quest to trounce it with no problems, or very little. NM-EfGD is no exception, even with out the common house rule of a chosen captured rather than random. Is that quest still hard, sure it is.. but not unbeatable, and not with a super low near impossible win ratio like before and that win ratio is just going up and up and up and this game has insane powercreep in the player pool relative to the expansions. Amon Din is a perfect example. Look at the old threads people saying it is the hardest quest ever, now only a short time latter we have some respected community members saying they have won NM mode on their first try. Most people that have problems are either new players, bad players or for reasons of their own are not playing with a top tier deck or a deck designed just for that quest. This is why difficulty is so hard to judge. People play this game in so many different ways.\n\nEdited February 16, 2015 by booored"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450451","commentId":1450451,"userName":"GrandSpleen","timestamp":1424053599,"content":"Discussion would be so much more fruitful if you could just do, but from the beginning: acknowledge that \"people play this game in so many different ways\" rather than starting off your comments with choice phrases that \"people who don't know how to play the game\" and \"inability to understand the game.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450595","commentId":1450595,"userName":"booored","timestamp":1424068152,"content":"Isn't that what I just said in the post above?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450771","commentId":1450771,"userName":"joezim007","timestamp":1424088578,"content":"Yes. He's making the point that you started the string of posts by saying so many of us were just bad at the game and THEN finally said we just play differently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450875","commentId":1450875,"userName":"Glaurung","timestamp":1424095904,"content":"Hmmm you still fighting here sometimes yes?\n\nBoored is right many times but he sound a rude for someone I know. For me is better real sometimes sound rode ans have a point then talk to much sweet and spend time for nothing. Anyway I found my way. I make my videos and dont need to fight anymore with anyone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450960","commentId":1450960,"userName":"leptokurt","timestamp":1424099603,"content":"booored = ffg_song-of-mocking-tdm.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_song-of-mocking-tdm.jpg]\n\n \n\nI don't mind folks that have an opinion. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1450965","commentId":1450965,"userName":"leptokurt","timestamp":1424099701,"content":"I think what booored tried to say was that \"Ents are too strong\". I can read that between the lines. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n\nEdited February 16, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1451004","commentId":1451004,"userName":"Noccus","timestamp":1424101818,"content":"> Hmmm you still fighting here sometimes yes?\n> \n> Boored is wrong many times but he sound a rude for someone I know. For me is better real sometimes sound rode ans have a point then talk to much sweet and spend time for nothing. Anyway I found my way. I make my videos and dont need to fight anymore with anyone.\n\nFixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1451028","commentId":1451028,"userName":"Chris51261","timestamp":1424103130,"content":"> > LOL, man are you pompous! I've beaten it before, and even if I hadn't you are the LAST person I'd ever genuinely ask for help! Despite what you believe I don't think I've ever seen you be right about any complex issue or post some game breaking deck. And there's a myriad of quests that the best you're hoping to do is 50%. I have no idea why I'm feeding into you, because as usual, you talk big but back up exactly none of your talk.\n> \n> Dont. Feed. The. Trolls.\n\nLol, right, my fault for wanting the tiniest shred of respect while engaging in a debate, not his fault for being a jerk every third post he makes. What a joke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452139","commentId":1452139,"userName":"Mndela","timestamp":1424180516,"content":"To me Ents are slow. I have seen several times the game plenty of orcs and one player putting into game ents exhausted without doing nothing while a lot of orcs attacking us and killing some characters and heroes.\n\nI dont like Ents, they remember me the slow eagle decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452220","commentId":1452220,"userName":"leptokurt","timestamp":1424184712,"content":"> To me Ents are slow. I have seen several times the game plenty of orcs and one player putting into game ents exhausted without doing nothing while a lot of orcs attacking us and killing some characters and heroes.\n> \n> I dont like Ents, they remember me the slow eagle decks.\n\nI see where you're coming from, but to me there is one big difference between Eagles and Ents: the former are resource consuming and belong to only one sphere, while Ents are cheap and you can play them with any kind of deck. Ents don't eat all your money, so you can easily play some other cards while your Ents get ready for duty.\n\n \n\nSo while Ents might be slow, it is not really a factor, because the player is having enough room /resources) to keep the encounter deck at bay.\n\nEdited February 17, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452226","commentId":1452226,"userName":"MyNeighbourTrololo","timestamp":1424185356,"content":"Ent's can't be played with any kind of deck due to their nature. You're either play with lore/tactics deck (or Elrond deck) or a deck with a long setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452290","commentId":1452290,"userName":"Jban","timestamp":1424188385,"content":"I'm not a complete fan of Ents either. I tried them in quite some decks, but most of the time they just slow me down. They have very decent stats of course, but during a round I can only use one of them (most of the times) and for every function there are equally good alternatives but they can be used during the round they enter play, and most of the time they have a side-effect as well. Another reason for me to not be that fond of Ents is the length of a game, since most games only take 5-8 rounds.\n\n \n\nThe only ent I do like is Treebeard. Since he gets that extra action every 2 rounds, which makes him a very solid defender and attacker in many games. and some readying effects (Ever Vigilant, Spare Hood and Cloak, Brand, ...) make him even more useful.\n\n \n\nScores to me:\n\n \n\nTreebeard: 9/10\n\nWandering Ent: 6/10\n\nBooming Ent: 5/10"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452453","commentId":1452453,"userName":"leptokurt","timestamp":1424196011,"content":"> Ent's can't be played with any kind of deck due to their nature. You're either play with lore/tactics deck (or Elrond deck) or a deck with a long setup.\n\n1) Treebeard is neutral and 2) he can pay for Ents. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452503","commentId":1452503,"userName":"MyNeighbourTrololo","timestamp":1424198370,"content":"1) Yes he is and 2) good luck brining him into the game on the turn 2 and then playing first ent with his resources on the turn 5 ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1452989","commentId":1452989,"userName":"joezim007","timestamp":1424219843,"content":"First off, here are several ways to bring Treebeard in on turn 1, especially when playing the sagas since they have an extra hero. Secondly, even if you get Treebeard in on turn 2, he can buy a 2-cost on turn 4. I agree that his cost of 4 and his slowness are definitely liabilities, but there are ways around it. Also, Treebeard certainly does not need to be the only one contributing resources toward the other ents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1453249","commentId":1453249,"userName":"leptokurt","timestamp":1424238028,"content":"Yeah, one Spare Hood and Cloak, and Treebeard can start his work immediatly. And like joe said, he starts to collect resources on turn 3 already (besides, joe is also right that Treebeard is a blast in the saga expansions).\n\n \n\n \n\nI get that Ents need some time, but I don't think that it does weaken them as much as it should be. Like I said, you still have anough resources left to play other cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1453271","commentId":1453271,"userName":"MyNeighbourTrololo","timestamp":1424240858,"content":"> First off, here are several ways to bring Treebeard in on turn 1, especially when playing the sagas since they have an extra hero. Secondly, even if you get Treebeard in on turn 2, he can buy a 2-cost on turn 4. I agree that his cost of 4 and his slowness are definitely liabilities, but there are ways around it. Also, Treebeard certainly does not need to be the only one contributing resources toward the other ents.\n\n...which still goes against the statement that \"Ents can be used in any deck\". They can't. As simple as that.\n\nEdited February 18, 2015 by MyNeighbourTrololo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1453531","commentId":1453531,"userName":"Olorin93","timestamp":1424268523,"content":">  \n> \n> > First off, here are several ways to bring Treebeard in on turn 1, especially when playing the sagas since they have an extra hero. Secondly, even if you get Treebeard in on turn 2, he can buy a 2-cost on turn 4. I agree that his cost of 4 and his slowness are definitely liabilities, but there are ways around it. Also, Treebeard certainly does not need to be the only one contributing resources toward the other ents.\n> \n> ...which still goes against the statement that \"Ents can be used in any deck\". They can't. As simple as that.\n> \n>  \n\nWell in theory they can, because of Treebeard and the existence of e.g. Song cards. Ents may just not be as effective in certain types of decks. I have yet to try Ents properly but I'm looking forward to it and hoping for more ent allies down the road."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1453561","commentId":1453561,"userName":"MyNeighbourTrololo","timestamp":1424269981,"content":"I thought it was obvious we were talking about Ents being effective in any deck. In theory, you can take 3 spirit heroes and fill the deck with tactics cards only and 3 songs of battle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1453998","commentId":1453998,"userName":"leptokurt","timestamp":1424286494,"content":"> I thought it was obvious we were talking about Ents being effective in any deck. In theory, you can take 3 spirit heroes and fill the deck with tactics cards only and 3 songs of battle.\n\nWe were talking about Ents being \"playable\" in any deck. The word \"effective\" was added by you. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n\n \n\nAnyway, I think it is pretty clear that Ents are more effective in certain decks, which is where I think we all (?) agree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1454021","commentId":1454021,"userName":"Teamjimby","timestamp":1424287065,"content":"I think this discussion is proving that Ents are well balanced.  They can be strong in a properly designed Ent deck, but they're not necessarily strong enough to include in any Lore or Tactics deck.  I've played them a few times so far.  Occasionally I have time to get a few Ents into play and the booming Ents are attacking for 5+.  Other times I'm in a tight situation, drop Treebeard or other Ents into play, and then lose that turn before Treebeard can ready.  Or it's one of those turn 1 losses because I can't play any useful allies and Ents are my only option.\n\n \n\nPersonally, the only change I would make to the Ents is Treebeard's ability.  It should only work on other Ents instead of being able to ready himself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1454067","commentId":1454067,"userName":"gandalfDK","timestamp":1424288857,"content":"I second the last part of tejimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1454136","commentId":1454136,"userName":"MyNeighbourTrololo","timestamp":1424291681,"content":">  \n> \n> > I thought it was obvious we were talking about Ents being effective in any deck. In theory, you can take 3 spirit heroes and fill the deck with tactics cards only and 3 songs of battle.\n> \n> We were talking about Ents being \"playable\" in any deck. The word \"effective\" was added by you. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n> \n>  \n> \n> Anyway, I think it is pretty clear that Ents are more effective in certain decks, which is where I think we all (?) agree.\n> \n>  \n\nWe were talking about Ents being too strong, just how the title says. How fast you shift your judgement just to get an upper hand in the arguement :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1454868","commentId":1454868,"userName":"leptokurt","timestamp":1424323409,"content":">  \n> \n> >  \n> > \n> > > I thought it was obvious we were talking about Ents being effective in any deck. In theory, you can take 3 spirit heroes and fill the deck with tactics cards only and 3 songs of battle.\n> > \n> > We were talking about Ents being \"playable\" in any deck. The word \"effective\" was added by you. :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]\n> > \n> >  \n> > \n> > Anyway, I think it is pretty clear that Ents are more effective in certain decks, which is where I think we all (?) agree.\n> > \n> >  \n> \n> We were talking about Ents being too strong, just how the title says. How fast you shift your judgement just to get an upper hand in the arguement :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n\nWrong again, we I already concluded that Ents are too strong, the remaining discussion is about in which universes Ents would take over the world because of their flawed design. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1454989","commentId":1454989,"userName":"MyNeighbourTrololo","timestamp":1424334190,"content":"Wrong. You concluded that, no one else. So, if thread is going to be like that, I officialy conclude that Outlands is the weakest faction of the game and is utterly unplayable. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1455027","commentId":1455027,"userName":"Mndela","timestamp":1424340156,"content":"I think ents can be compared with Gloin ally, their text could be: Ent, cost 5; when you play an ent, return 3 resources to the controller player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1455406","commentId":1455406,"userName":"leptokurt","timestamp":1424361903,"content":"> Wrong. You concluded that, no one else. So, if thread is going to be like that, I officialy conclude that Outlands is the weakest faction of the game and is utterly unplayable. \n\nI should have made it more clearly that it was sarcasm? :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1455533","commentId":1455533,"userName":"MyNeighbourTrololo","timestamp":1424366159,"content":"It's hard to recognize a sarcasm in plain emotionless text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1455725","commentId":1455725,"userName":"chuckles","timestamp":1424375273,"content":"I'm undecided on whether Ents are too strong, as I haven't played them yet. Hordes of them might be...\n\n \n\nHave been wondered about retrying a low threat solo mono Lore deck as the 2 cost 2 willpower wandering Ents coupled with Treebeard's attack/defence/resource generation should make noticeable difference.\n\n \n\nHowever it does seem really clear that MyNeighbour Trololo and leptokurt have different world views. on Ents"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134312-are-ents-too-strong/?do=findComment&comment=1455750","commentId":1455750,"userName":"Eu8L1ch","timestamp":1424376248,"content":"IMO, Ents are strong but not too strong.\n\nTheir drawback can be significant if you're pressured from the start or if you happen to draw them during mid-late game.\n\nHowever, I think their strong points are many.\n\n \n\nIt seems we all agree that Treebeard is at least good, if not outright awesome, isn't it? So I'll be just considering the Wandering and Booming Ents.\n\n \n\n-1 Well balanced stats (the Booming Ent who has no WP though).\n\n-2 Low cost, both considered in itself (2 resources is low) and in particular compared to what they offer in terms of stats.\n\n \n\n \n\n1 is mostly useful in solo play or for HoN quests, in which you often need different stats to quests even over the course of a single game, but is quite good even in Multi since it means Ents always have a part to play.\n\n2 is partially balanced by their drawback but still makes them very powerful when playing 2, and especially 3-spheres: you'll have a much easier time playing them. In addition to this their low price means they'll often enter play a round earlier than it would have been otherwise, partially overcoming their weakness.\n\n \n\nTheir 3 hp is what makes them particularly useful in my eyes: many encounter sets contain cards which inflict direct damage (treacheries, archery etc). In this situation playing most of the low-cost allies is very risky, whereas Ents can safely absorb a hit or two.\n\nOf the two, I like the Wandering Ent more. The Booming Ent's ability is not very strong since it requires quite a few pieces to fall in line, however I find it so fun to play with that I tend to include them in my decks very often.\n\nTo sum it up: they're very powerful but I do not judge them broken since their drawback is not negligible.\n\nThey're solid allies able to build a strong power-base mid-late game but that should be mixed with other cards more useful at the beginning to make up for their weakness."}]}