{"url":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/","title":"new solo player need advises - expension","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1442061","commentId":1442061,"userName":"XTREM1337","timestamp":1423514813,"content":"I'm a new player, I'll play solo, and I'm wondering, if I have 1 extension to buy, which one would be the best I could get?\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1442232","commentId":1442232,"userName":"gandalfDK","timestamp":1423520197,"content":"This is a rather difficult question.\n\nWould you consider on buying more after tthe first one?\n\nThen I would suggest the Black Riders. That one has great player cards, cool scenarios, familiar scenarios and are designed for pplayer with only one Core Set too. This box would give you a great feel about how the game works and so you could consider more APs or DE.\n\nNo more after this one:\n\nMy personal favorite would be the Road Darkens just for the Gandalf hero, but I think Khazad-Dum could be cool or then again The Black Riders.\n\nAnd what do you consider the best? Easiest to learn the game? Strongest player cards? Most players cards?\n\nI have refered to it a lot, but even if you don't need it, it's a great read: the buying guide on the blog TalesFromTheCards, https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1442339","commentId":1442339,"userName":"OMZA","timestamp":1423524503,"content":"The hunt for Gollum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1442407","commentId":1442407,"userName":"GMLumpy","timestamp":1423526998,"content":"I had a similar question, and I figured it would be better the post it here then start a new thread.  \n\n \n\nI got the core set for my wife and I to play together (we don't do well with competitive games, but co-op, we do great, plus LOTR= brownie points :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ).\n\nanyways, we have the core set and would like to get more expansions to have more quests to play though once we get tired of the core ones.  what expansions should I get in what order that would add to the game play but still be beatable with the core set + the expansion?\n\n \n\nthanks in advanced.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1442525","commentId":1442525,"userName":"CJMatos","timestamp":1423531840,"content":"I always recommend going in order so the older quests don't get too easy and the new ones too difficult due to short card pool....\n\n \n\nThe link gandalf posted is a great help...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1443243","commentId":1443243,"userName":"Otherworlder","timestamp":1423584216,"content":"I am a solo player who sometimes invite a friend or play two-handed, and I would recommend this order:\n\n \n\nThe Road Darkens. (Really fun scenarios, fighting the Balrog can never be dull. Gandalf Hero and his toys, ally Galadriel and Bilbo, will make a deck that can carry through a lot of stuff.)\n\n \n\nKhazadum. (Not sure how I feel about the three scenarios in this box, but you need this to play Dwarrowdelf. And people vouch you can use Dwarfs to do almost anything.)\n\n \n\nWatcher in the Water. (One of my favorite scenarios just so much exhilarating action. Loragorn is a staple-ish player card. Arwen, Elrond's Counsel, Sword That was Broken.)\n\n \n\nFoundation of Stone. (This one has the staples as much as you can consider cards staple in LOTR. Glorfindel+Asfaloth+Light of Valinor.)\n\n \n\nShadow and Flame. (Really fun scenario too. Elrond+Vilya. Power cards that will carry you through really terrible scenarios.)\n\n \n\nIf you are still up for more, then I would just suggest buying based on themes/traits. Or just get everything >.<"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1443289","commentId":1443289,"userName":"Noccus","timestamp":1423586481,"content":"Deluxe box: black riders. Hands down, no contest. For the reasons gandalfDK gave.\n\nAP is more difficult. You interested in the player cards or scenario?\n\nGiven both: I'd say The Stewards Fear. Direct playable outlands deck plus gondorian shield & a good scenario.\n\nI'd recommend this one first & foremost.\n\nPlayer cardwise: The Foundations of Stone: The Glorfindel power pack simply cannot be beaten.\n\nTho the quest is build for multiplayer games.\n\nScenariowise? That's tricky. Everyone likes different quests.\n\nSome of the playerbase favorites are ( to my knowledge, not my own top )\n\nThe Redhorn gate, Massing at Osgiliath, Steward's Fear and the newer The Three Trials.\n\nTaken from different cycles, & 1 PoD."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134501-new-solo-player-need-advises-expension/?do=findComment&comment=1446024","commentId":1446024,"userName":"player1922162","timestamp":1423733915,"content":"Black Riders! Then start buying the Mirkwood scenarios."}]}