{"url":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/","title":"Doom, doom, doom card from the Road Darkens - official errata","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1442812","commentId":1442812,"userName":"krokodiler","timestamp":1423554182,"content":"I've received an answer from Caleb for my question regarding effects on Doom, doom, doom card. So I share, maybe someone find it interesting...\n\n \n\nHere is my question:\n\n \n\nWhat happens if I choose to remove the last damage token from Doom, doom, doom card due to \"When revealed\" effect of Moria Orc during staging step of quest phase (Moria Orc effect is: \"Either remove 1 damage from Doom, doom or reveal an additional encounter card\")? Is Balrog still added to staging area at the end of that quest phase (or at all then)? Text on Doom, doom says: \"At the end of the quest phase, remove 1 dmg token. THEN, if there are no damage tokens here, add the Balrog to the staging area.\"\nIn FAQ there is written: \"(1.15) The word \"then\": If a card effect uses the word \"then\", then the preceding effect must resolve successfully for the subsequent dependent effect to resolve.\" But the preceding effect didn’t resolve succesfully - the last token was already removed earlier, by Moria Orc effect, so I can't remove it at the end of the quest phase.\n\n \n\n(BTW: There is also a treachery card \"Fool of a Took!\" with similar effect to Moria Orc).\n\n \n\nI thought I'd found a backdoor for not putting Balrog into play, but here is what Caleb answered:\n\n \n\nIgnore the word “then” on Doom, Doom, Doom. The Balrog is added to the staging area at the end of the quest phase if there are no tokens left on the objective.\n\nI will probably have to add an FAQ entry to clarify that there is no way to keep the Balrog from entering play when there are no tokens left on Doom, Doom, Doom.\n\n \n\nSo, there is no way to avoid Balrog other than quest like mad in this scenario.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1444329","commentId":1444329,"userName":"chadgar24","timestamp":1423629620,"content":"This is clearly a case of someone trying to find a loophole and play a card as it was not intended. Now Caleb has to spend time and energy to do an errata. Sigh...the Balrog comes out, that's the whole point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1444339","commentId":1444339,"userName":"PsychoRocka","timestamp":1423630107,"content":"Yeah I gotta be honest, this is a really stupid one. Clearly the Balrog appears when Doom, Doom, Doom runs out of counters. Just because the last counter is removed by something other than the effect on Doom, Doom, Doom and the effect is not worded with utter perfection doesn't mean it isn't really clear what happens. \n\nI don't think it even needs Errata....... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1444604","commentId":1444604,"userName":"alogos","timestamp":1423655904,"content":"> I don't think it even needs Errata....... \n\n \n\nYeah, who cares about wording... just write all the cards with \"whenever : do whatever you feel like doing is right.\"... Because everyting else that is already written 'could' be wrong... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1453625","commentId":1453625,"userName":"Mich the One","timestamp":1424272796,"content":"I actually think that was a valid questions to have. It is not about loopholes, it is about having a good understanding of the game rules (or, if you look from a technical angle, the whole point is to learn how things trigger and structure your plays accordingly to gain favorable position).\n\n \n\nI would say the sole fact that Caleb told us to \"ignore\" certain part of the card text shows that it was important to ask.\n\nEdited February 18, 2015 by Mich the One"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1454180","commentId":1454180,"userName":"TwiceBorn","timestamp":1424293552,"content":"Clarity of language may be doubly important for players who aren't native English speakers/readers, and there are quite a few on these boards. Let's not make assumptions about a player's motivation for asking a question. You know what they say about people who assume..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1454294","commentId":1454294,"userName":"GrandSpleen","timestamp":1424296680,"content":"Well, he did say he was looking for a \"backdoor...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1454638","commentId":1454638,"userName":"PsychoRocka","timestamp":1424309223,"content":"> Well, he did say he was looking for a \"backdoor...\"\n\nYeah see this was my reason to be upset with this whole thing as well. The player knew this wasn't supposed to be a way around facing the Balrog but was rather looking for a \"backdoor\" or loophole in which you do not have to face it.\n\nIt is glaringly obvious that it is a simple mistake in the way the card has been worded. Yes it is a little bit of a silly error but even merely just from all the news articles etc its clear the only way to play the quest and not fight the Balrog is to finish the quest before the counters on doom doom doom run out.\n\nDon't you think somewhere along the way they would have mentioned its entirely possible to avoid the balrog from finishing before counters on Doom doom doom run out OR by allowing the last token on doom doom doom to be removed by an encounter card effect rather than the text on doom doom doom itself creating a weird \"backdoor\" where you don't have to face the Balrog when you really should have to! They didn't because it is a very very obvious mistake and use of incorrect language.\n\nI guess I agree that it kind of does need an errata as the game can be quite complex, there are plenty of non english speakers as well as beginners etc but for anyone else it should be pretty clear what the go is here..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1455268","commentId":1455268,"userName":"krokodiler","timestamp":1424357726,"content":"Time for official explanation of my post :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWhen I played this scenario and such situation arose, it seemed to me un-thematic (but I can live playing e.g. Steward of Gondor on Sam or Pippin, so I could live without Balrog appearing, too ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ) that the Balrog, provided that Moria Orc was revealed at the right time, would be Sir Not-Appearing-in-This-Game, so I just ask Caleb to clarify. I've asked Caleb a couple of questions in the same message regarding some effects of the Road Darkens cards, but this one seemed so important to me, that I posted it here titled \"official errata\". And this IS essential clarification to me, because in fact, according to the clarification of the word \"then\" in FAQ, the Balrog could not appear in the game without it. We also have similar case explained in latest FAQ 1.7 with The Power of Mordor card.\n\nEnglish in not my native language. If I knew that this word \"backdoor\" was so meaningful I'd have used another or add ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  When we talk about rules clarifications we absolutely should be very literal (as I was in this case and am in general), but please, do not judge someone's intention based on one little word... :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  It was not obvious to me how to treat such case, that's all. Also, I know little about designer's intention, I just want to correctly play the game.\n\nCheers, no offence :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n \n\nedit: Steward part\n\nEdited February 19, 2015 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1455382","commentId":1455382,"userName":"Mich the One","timestamp":1424361368,"content":"PsychoRocka, I absolutely grant you this \"backdoor\" solution would be against the spirit of the game. Still, I say it is better to have a clear ruling on this then to exercise our instincts on what is or isn't an \"obvious\" mistake. There clearly was potential for misreading the card, now there is not.\n\n \n\nAlso, let me have a more general comment - we are very fortunate that the designers are willing to give their ultimate judgement on rules. Plus there are dudes like GrandSpleen who provide very consistent support to those seeking rule explanations. I am probably one of many who appreciate the discussions. It creates firm grounds for us to develop deep understanding of the game. Seems much better then being left with only a gut feeling in doubtful cases. Also, it is great fun to speculate on game rules and read about it. So, yeah, I say the more posts in this part of forum the better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1455731","commentId":1455731,"userName":"TwiceBorn","timestamp":1424375525,"content":"krokodiler, I hope this exchange doesn't dampen your enthusiasm for participating in future discussions on these boards. Just a little honest misunderstanding between posters/avid fans of the game, all with good intentions, and it's all too easy for that to occur in a medium like this one. I am grateful that you took the time to share Caleb's reply to your question.\n\n \n\nkrokodiler = \"crocodiles\" in Danish, correct (and maybe Norwegian, Swedish and Icelandic, but I don't have time to check)?\n\nEdited February 19, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1456913","commentId":1456913,"userName":"krokodiler","timestamp":1424423771,"content":"TwiceBornh: thank you, and no, it will certainly doesn't :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] But the main problem with participating, is that English is not my native language and writing exactly what I mean is not trivial to me.\n\n \n\nAlso, as I can see @wikipedia, \"krokodiler\" is rather Swedish (in Danish it would be \"krokodiller\"). But I'm Polish :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] And that was only... an impulse, a fancy, to choose this nickname when I registered. And it is just untraslatable and unreasonable play on words that was understandable and (at that time) funny for me (but if I registered today I'd definitely choose another nickname ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1457329","commentId":1457329,"userName":"TwiceBorn","timestamp":1424446813,"content":"Thanks for the correction on krokodiler vs. krokodiller (should've looked it up myself before posting, but, was too lazy to do so).\n\n \n\nAnd don't let the odd spelling or grammatical awkwardness get in the way of posting. I'd say your English is better than that of many (maybe even most?) native speakers. And I'm willing to bet that your English is better than the (non-existent) Polish of the vast majority of anglophone players. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134548-doom-doom-doom-card-from-the-road-darkens-official-errata/?do=findComment&comment=1457536","commentId":1457536,"userName":"krokodiler","timestamp":1424454180,"content":"TwiceBornh, thanks again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nBut it takes time to assemble a sentence that seems for me appropriate enough, but is still harsh and clumsy for native speakers as I think... (also, my pefectionism does not help ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )"}]}