{"url":"https://community.fantasyflightgames.com/topic/134834-new-player-question-regarding-optional-engagements/","title":"New Player Question Regarding Optional Engagements","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134834-new-player-question-regarding-optional-engagements/?do=findComment&comment=1447524","commentId":1447524,"userName":"player24033","timestamp":1423827605,"content":"Hello, as a new player I have a few questions regarding optional engagements. \n\n \n\n1. If you choose to optionally engage an enemy, do you attack the first, or do you have to defend against the enemy attack first before resolving your attack?\n\n \n\n2. Do you have to draw a Shadow Card if you are optionally engaging an enemy?\n\n \n\n3.  Are optional engagements resovled before the enemy attack phase or at the same time?\n\n \n\n4.  If the creature has an opportunity to attack first, even if optionally engaging, what is the point of optionally engaging?\n\n \n\nI have been playing with a hobbit deck which provides bonuses for optional engagements.  It would make sense to optionally engage if you attack first (given the bonus), but if the enemy attacks first, given the hobbit low health (2 HP), they would more likey die before resolving my attack, thus not worth the risk. \n\n \n\nAny help or advice on why or when to optionally engage would be appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134834-new-player-question-regarding-optional-engagements/?do=findComment&comment=1447536","commentId":1447536,"userName":"MyNeighbourTrololo","timestamp":1423828528,"content":"1. Engaging an enemy optionally does not changes the combat phase order. Refer to the end of the rulebook to see how phases are resolved visually.\n\n \n\n2. Yes, you do.\n\n \n\n3. Optional engagement is resolved during the engagement phase, which goes before the combat phase.\n\n \n\n4. The point is you can engage an enemy that wouldn't normally engage you due to it's threat engagement cost being too high. It's also extremely relevant in multiplayer for player to control who's fighting who."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134834-new-player-question-regarding-optional-engagements/?do=findComment&comment=1447537","commentId":1447537,"userName":"PsychoRocka","timestamp":1423828614,"content":"1. Regardless of how an enemy is engaged (via its engagement cost during engagement checks or via optional engagement) it makes an attack during the combat phase\n\n2. .  Same goes for shadow cards. Regardless of how it was engaged all engaged enemies are dealt a shadow card during the combat phase.\n\n3. Before. Each player can optionally engage one enemy and then engagement checks are made. Then each player in player order takes turns resolving enemy attacks.\n\n4. The point is to engage enemies with decks that can handle the defensive and offensive duties necessary to take care of the enemy and keep other weaker players/decks (combat wise at least) safe from nasty foes. Also the Haldir hero card has an ability that can only be used if you did not engage an enemy in combat on any round. Also to remove an enemy from staging that would otherwise stay there (higher engagement cost than any player/decks current threat) to remove its threat from the staging area making questing and placing progress tokens easier. Enemies may also have nasty effects if they stay in the staging area or even just in play too long so you may want to optionally engage that enemy and destroy it as soon as possible.\n\nYeah you are going to need a good defender (with fast hitch, hobbit cloak, ringmail etc attached) like Sam or someone else to defend against attacks. Also only engage nastier foes on a turn you have a feint or similar card that will stop them attacking, let you attack first and destroy them (quick strike) or if you can play a combo like sneak attack Gandalf to kill them before they can attack. Allies that are cheap and have good defensive stats are also useful as are cards that stop enemies making engagement checks or attacks (forget the name of these two cards but they are hobbit themed). Maybe even try playing two handed if you are up to it with a deck that mainly handles combat and modify the hobbit deck to be able to give more raw willpower. The Arwen ally is amazing to buff a suitable defender, as are many other cards.\n\nChump blocking is also a viable defensive option to a degree if you can pull it off..\n\nEdited February 13, 2015 by PsychoRocka"}]}