{"url":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/","title":"Clarification needed: Teaming up when attacking","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/?do=findComment&comment=1448891","commentId":1448891,"userName":"Flrbb","timestamp":1423906611,"content":"In the regular combat phase, when charakters attacking then you declare one charater as the attacker and anyone (who is able; own characters or team mate's with ranged) can join that attack.\n\nI am fine with that.\n\n \n\nThen there are cards like Dunkhere or the Great Yew Bow which clarify that no other can join that attack.\n\nAlso, fine with that.\n\n \n\nBut.\n\nThen there are cards which allow \"out of the usual sequence attacks\". Cards like Knight of Mineas Tirth or Quick Strike. And Haldir of Lorien maybe, too.\n\n \n\nSo....\n\nWhen using Quick Strike for an attack right before the enemy attacks can other charakters join that attack? (well, if other requirements met like ranged and whom the enemy is enganged) If Quick Strike would only allow one attacker it would be printed on it, like on the Yew Bow, right?\n\n \n\nOr when plaing out Knight of Mineas Tirth can other charkters of that player (or ranged from others) join that attack?\n\n \n\nI was used to play so, but it feels sometimes very overpowered. On the other hand these cards become way underpowered when not...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/?do=findComment&comment=1449092","commentId":1449092,"userName":"GrandSpleen","timestamp":1423930263,"content":"You can only use one character for an attack that uses Quick Strike, per the FAQ [http://www.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ.pdf] entry.  Here's the relevant part:\n\n \n\n\"Q: Can characters with the ranged keyword participate in an attack declared through the card Quick Strike (CORE 35)?\n\n \n\nA: No. There is no opportunity for other characters to join a Quick Strike attack. One character is exhausted to pay for the cost of Quick Strike, and the effect is that the exhausted character is immediately declared as an attacker against the target enemy. The card’s resolution does not allow for a standard declaration step in which other characters can declare.\"\n\n \n\nThe same would be true for the Knight of Minas Tirith."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/?do=findComment&comment=1449216","commentId":1449216,"userName":"Flrbb","timestamp":1423939905,"content":"Thanks. Sad new though.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/?do=findComment&comment=1449287","commentId":1449287,"userName":"GrandSpleen","timestamp":1423946446,"content":"Yeah, Knight of Minas Tirith is not as great as he looks.  But Quick Strike is still an excellent card.  Load up Legolas or somebody with weapons and they can go Wham! before an enemy attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/134906-clarification-needed-teaming-up-when-attacking/?do=findComment&comment=1449636","commentId":1449636,"userName":"awp832","timestamp":1423976722,"content":"I have actually been getting a fair bit of use out of Knight of Minas Tirith.  Not for his ability, which isn't great,  but that 3 attack power does certainly pack a wallop.  And if I'm just using him for that anyway,  I have no compuction against putting him in a dual sphere deck."}]}