{"url":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/","title":"Hidden Cache Action","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1456849","commentId":1456849,"userName":"Authraw","timestamp":1424417712,"content":"Hidden Cache is an Event that has the following action: \"Action: Spend 1 resource to draw 1 card.\" I'm a little confused about when I can trigger this action, however.\n\nIs it like spirit Bofur, where you can play the action from your hand? Or do you have to trigger the action as you play the Event? In that case, can I trigger the action multiple times?\n\nMy gut tells me that the intent is that you can only trigger the ability as you play it, but that creates some weird timing issues--is there an action window between playing an Event card and discarding it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1456883","commentId":1456883,"userName":"entMoot","timestamp":1424420583,"content":"Many events have \"Action:\" as part of their rules text. This simply tells you when you can play the event from your hand (any action window, in this case). Events like A Test of Will have Responses instead, which just gives you a condition for when you may play that card as well. For any event, you may choose to play it during an action window or when its response would be triggered, but you only get the effect once as written and discard the event after this effect has been resolved. I don't have a page reference for the rulebook, but I am certain that this is spelled out somewhere in the core rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457269","commentId":1457269,"userName":"GrandSpleen","timestamp":1424445224,"content":"You can play the Action any time you would be able to play any other non-Response Event such as Hands Upon the Bow, Radagast's Cunning, The Tree People, etc.\n\n \n\nThe confusing part probably comes from there being two ways to use Hidden Cache.  One is to use he Action-- you draw a card, but you get no resources as HC was not discarded from your deck.  This Action is there because HC sometimes ends up in your hand, even though you don't want it to.\n\n \n\nThe second way is to discard HC directly from your deck, via a card effect such as Zigil Miner or Expert Treasure Hunter.  In that case you will get the resources, but can't use its card draw Action text.  So the two lines of text are exclusive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457718","commentId":1457718,"userName":"Authraw","timestamp":1424461811,"content":"I don't know how I missed the fact that just about every other event card has the Action keyword. After playing for so long my brain must just skip over it when it's the first word. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nBut that begs the question, then: Why make the discarding of a resource part of the action instead of just making it a cost of 1?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457848","commentId":1457848,"userName":"GrandSpleen","timestamp":1424469438,"content":"Hmm, dunno.  \n\n \n\n \n\n. . . \n\n \n\nDunno.  Good question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457896","commentId":1457896,"userName":"Solaufein","timestamp":1424472175,"content":"My guess is they wanted to make it clear that using the other half of the card doesn't cost anything, so they did things this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457929","commentId":1457929,"userName":"Bullroarer Took","timestamp":1424474029,"content":"I thought I had to play the card and spend one resource to draw a card.  I don't?  So it stays in my hand?  (Play it mind, not discard it.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1457942","commentId":1457942,"userName":"Teamjimby","timestamp":1424474699,"content":"No, you still have to play it, pay a resource, and discard it.  Events never go back to your hand unless they specifically say so.  But that is a good question about why they didn't just make the card cost 1. \n\n \n\nI wonder if they wanted it to match the cost of the other dwarf events like Very Good Tale, Well Equipped, We Are Not Idle, and The End Comes.  That way you can double up on the 0 cost events and get more use out of Zigil Miner.  Although there are also 1 cost events like Durin's Song and To Me O My Kinsfolk, so my theory isn't totally sound."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135433-hidden-cache-action/?do=findComment&comment=1458348","commentId":1458348,"userName":"alogos","timestamp":1424508403,"content":"Also, you can't play discount effect.\n\nThis can mean something.\n\nAlso, it is a 0 cost card for the purpose of Nameless Thing and Zigil Miner and Take Initiative etc...\n\n \n\nBut mostly because playing the response should be free or it could be confusing."}]}