{"url":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/","title":"The Hunt for Gollum &amp; The Conflict at the Carrock - Solo Play (Progression Series Style).","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/?do=findComment&comment=1458401","commentId":1458401,"userName":"The Great Goblin","timestamp":1424517716,"content":"Salutations Everyone, \n\n \n\nAfter having read about The LOTR LCG Progression Series started by Mitch and Matthew at Cardboard of the Rings, I decided to give their idea a go myself.\n \nIn doing so, I hoped to present myself with a challenge, discover combinations and cards that I had never used (or long since abandoned in favour of seemingly better cards) and also to prove to my brother that it is not necessarily impossible to win most adventures solo if you only possess a fairly 'limited card pool'.\n \nTo that end, last night I created a solo deck to play through the Hunt for Gollum, using only the cards in the core set and the aforementioned Adventure Pack. \n \nHere is the deck I used: \n \nAragorn, Theodred, Eowyn ( Starting Threat - 29)\n \nNorthern Tracker x3, Gandalf x3, Faramir x3, Guard of the Citadel x3, Snowbourn Scout x3, Lorien Guide x3, Westfold Horsebreaker x3, Steward of Gondor x3, Celebrian's Stone x2, Unexpected Courage x2, Dunedain Mark x3, Ever Vigilant x3, A Test of Will x3, Hasty Stroke x3, Grim Resolve x2, The Galadhrim's Greeting x3, Dwarven Tomb x2 & Sneak Attack x3.\n \nI won on my first attempt after around 15-16 turns, but wasn't sure if I had forgotten to play Stage 2B correctly once or twice. With that in mind, I decided to play again, and this time implement the scoring system that I had always ignored in the past.\n \nThe second time I won again, after 13 turns, with a final threat of 32, no dead heroes, 2 damage on Theodred and 2 Gladden Fields in the Victory display. I believe this left my final score at around 158pts (apologies if I've got this wrong).\n \nPlaying in this way was a suitably rewarding experience as it confirmed all of the things that I believed it would. Flushed with success, I decided to move on to Conflict at the Carrock with the same deck (rather foolish I know).\n \nBefore starting, I removed a few cards from my deck and substituted them with a few player cards from The Conflict at the Carrock. I had hoped, upon starting this scenario, that I would find Grimbeorn or his bee pastures early on and then use my Aragorn/Theodred resource ramp to add him to my allies ASAP (albeit with some minor changes to the deck).\n \nI started off doing rather well and was lucky enough to get a really strong line up of other allies by around turn 5. Unfortunately, things took a turn for the worst when I ended up accidentally blasting through stage 1 thanks to the low threat of a Hill Troll that entered the staging area during the 5th Quest Phase.\n \nAs my threat was exactly 34, all five trolls in the Staging Area engaged me in the following Engagement Phase. To put it mildly, they squashed me into jelly. I tried again and lost again at around turn 6.\n \nAs this quest is listed as difficulty 7, I wasn't too dismayed by these two crushing defeats. I was also aware that the deck I was using was likely not the best design to tackle the challenge this quest presents.\n \nIn fact, it confirmed what I had always felt, and that is that this mission was a more multi-player friendly experience, at least when attempting it with the limited card pool. \n \nThank you for taking the time to read this...I'm now off to Rhosgobel...  \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/?do=findComment&comment=1458752","commentId":1458752,"userName":"player1922162","timestamp":1424545190,"content":"Victory display cards lowers your score."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/?do=findComment&comment=1458761","commentId":1458761,"userName":"The Great Goblin","timestamp":1424545626,"content":"> Victory display cards lowers your score.\n\n \n\nIndeed they do, Anders1 you are quite right. Here is the way I calculated my score, again I apologise if it is incorrect in some way. \n\n \n\nTurns = 13 (13 x 10*)\n\nFinal Threat = 32\n\nDamage on Heroes = 2\n\nGladden Fields x2 = -6 \n\n \n\n130+32+2-6 = 158\n\n \n\n*according to FAQ. \n\n \n\nThank you for your reply. \n\nEdited February 21, 2015 by The Great Goblin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/?do=findComment&comment=1459403","commentId":1459403,"userName":"silverthorn","timestamp":1424599940,"content":"Progression can be fun but there are certain quests which you will end up having trouble with (especially if you try to keep the same hero combo for each game)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/135547-the-hunt-for-gollum-the-conflict-at-the-carrock-solo-play-progression-series-style/?do=findComment&comment=1459599","commentId":1459599,"userName":"Qaanaaq","timestamp":1424619357,"content":"Well, as far as I can say, not one of the scenarios is unbeatable with limited cardpool.  I have played almost everything up till Heirs of Numenor solo with the following rules.  Beat the quest with only the cardpool that is available, use core set limits for the doubles and singles (ie only one unexpected courage).  This way I was able to beat most quests at 3-4 try,  only Dol Guldur and Cair Andros took more than 10 trials to win.\n\n \n\nConflict at the Carrock is almost easy with low starting threat and tons of allies. "}]}