{"url":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/","title":"Against The Shadow Nightmare Spoilers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465863","commentId":1465863,"userName":"PsychoRocka","timestamp":1424934396,"content":"Just received all three new against the shadow nightmare decks (druadan forest, stewards fear and amon din) and will be spoiling them when I get home in about an hour.\n\nI'm going to try and attempt all three, or at least two, so will try to do a bit of a review of them as well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465905","commentId":1465905,"userName":"PsychoRocka","timestamp":1424938920,"content":"http://imgur.com/a/0eS5n [http://imgur.com/a/0eS5n]\n\nnightmare amon din"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465908","commentId":1465908,"userName":"PsychoRocka","timestamp":1424939296,"content":"http://imgur.com/a/gshdl [http://imgur.com/a/gshdl]\n\nnightmare druadan forest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465909","commentId":1465909,"userName":"MyNeighbourTrololo","timestamp":1424939368,"content":"What's the name of the last card of Amon Din? They now what? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465913","commentId":1465913,"userName":"PsychoRocka","timestamp":1424939907,"content":"They now sundered"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465928","commentId":1465928,"userName":"MyNeighbourTrololo","timestamp":1424941766,"content":"What about most important nightmare? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465939","commentId":1465939,"userName":"PsychoRocka","timestamp":1424943626,"content":"http://imgur.com/a/b7xMm [http://imgur.com/a/b7xMm]\n\nplaying this one right now!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465943","commentId":1465943,"userName":"Mich the One","timestamp":1424944634,"content":"let us know how it went"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1465945","commentId":1465945,"userName":"MyNeighbourTrololo","timestamp":1424945144,"content":"> http://imgur.com/a/b7xMm [http://imgur.com/a/b7xMm]\n> \n> playing this one right now!!!!\n\nOh my goodness, I actually lived long enough to see that <3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466029","commentId":1466029,"userName":"PsychoRocka","timestamp":1424952674,"content":"> let us know how it went\n\nBeat it but by the absolute slimmest margin and thought I had lost for sure the last few rounds.\n\nI had two copies of The Cabals Champion appear very early on and first Asfaloth was crucial to helping clear locations, much more so than usual the active location quite often especially late game (with the help of two Lorien Guides late game this was VERY effective). I did not get a single clue (had one discarded by the effect of Rath Celerdain, this later won me the game as I will explain later) as I only had one sit in staging for a turn and did not have a hero ready to claim it before it was shuffled back into the underworld deck. I had the new plot card Rise to Power which was awful and by the end of the game had 14 tokens on it and was contributing a whopping 14 threat to the staging area, it is an AWFUL AWFUL new plot and I thought would cost me the game and it very very nearly did. I had the enemy Daughter of Beruthiel who I could not leave engaged with a player as I could not afford to raise either decks threat by 4 as either would threat out as they were on very high threat when I finally got to stage 3. She was buffed from the two copies of The Cabals Champion as well so was very strong and had 9 hitpoints and 5 armor. I had to reduce threat back down from 48 or 49 a few times for both decks and had insanely lucky draws as well as a Galahadrims Greeting drawn by the effects of a Galadhrim Minstrel at a critical moment. Gandalf was used to lower threat twice by the tactics/leadership deck and a Secret Vigil (new card introduced in spoilers for Angmar Awakened Cycle) was used to amazing effect to reduce both decks threat by 4 after being attached to a Faithless Conspirator. Near the end I thought I was done for but managed to kill Daughter of Beruthiel with Haldir's ability used the first turn I was on stage 3 and then gandalf used to reduce the tactics/leadership deck back down to 44 threat so that I pay 4 threat and keep her engaged the second turn I was on stage 3 and could attack her this time with both Glorfindel and Haldir (rivendell blade on glorfindel, blade, bow and mark on haldir) and kill her. The following final round I quested with EVERYONE and had a total of 28 willpower, the quest stage had 5 progress and needed 10 more, Rise to Power had 14 resource tokens on it so I needed the staging area's threat to be no more than 4 during the last round of questing, one deck was on 49 threat and the other on 46 and a knife in the dark was revealed first killing Orophin and reducing my total willpower to 25 (he had just come into play so 3 willpower thanks to Celeborn, he also almost killed Celeborn with the effect of Knife in the Back by doing 3 damage to him ironically also due to Celeborn's boost to him) and then the second card! The clue that was dicarded by the effect of the Rath Celedain and put into the encounter deck after a reshuffle rather than shuffled back into the underworld deck or victory display! Incredibly lucky! I would have lost had the plot that raises threat been the plot for this game considering how much harder the nightmare cards make it to get through this quest quickly. I also had MANY more enemies engaged due to a few Faithless Conspirators staying in play multiple rounds due to their ability as well as more locations that reveal more underworld cards than normal. A few times I had MANY enemies engaged and because I did not have Steward powering Elrohir many turns he was only able to block a few key attacks and a few times I had to take undefended attacks or chump block. I got lucky in that respect as well and also saved a hasty stroke for one undefended attack. I also lost both a Warden of Healing and Erestor to A Knife in the Back throughout the game, both luckily have 0 attack power which was a nice upside.\n\nMade the quest much more time intensive and diverse (with the two new plots and buffs to the Villains) and I found it much harder than a normal game of this quest but overall was not TOO intense but this seemed to mainly be due to my good draws and a few good rounds of very tame encounter cards revealed during staging which allowed me to build up forces/attachments. On two occasions False Lead appeared and was actually both beneficial and damaging as it allowed me breathing room but also slowed down the exploration of locations. One of the key cards, Traitors Den appeared once and got to 2 progress but I was then able to clear it stopping a second plot card coming into play during the game, I did not find this too hard to avoid but was certainly very worrisome.\n\nVery fun, probably would be hard pressed to get another win without at least a few losses first the next time I play it I imagine.\n\nVery cool mechanics and very cool art. A few turns had me VERY worried and it was mainly due to new effects on the nightmare cards. Murderous Turncoat is an awesome card that is not too worriesome so long as you have a good uber defender set up and can kill it before the end of the combat phase (Haldir one shotted two of them). The new effect of the nightmare version of the quest that shuffles enemies back into the underworld deck instead of into your discard pile means that unlike almost every game of this quest I've played the underworld deck does not run out (except for stage 3 which shuffles it into the encounter deck which is also much nastier as it now shuffles MANY enemies in and not very few or none) which is pretty interesting and changes the dynamics of the quest late game. By exploring key locations without the Underworld keyworld and only exploring underworld locations when you can take on more foes becomes key throughout the whole game not just the first half. False accusations was EXTREMELY nasty and both times it was revealed I raised both decks threat by 5 as multiple enemies were in play and would steamroll my heroes and kill them if everyone was exhausted, this card is horrid and was one of the main sources of threat in the game as well as a copy of Local Trouble.\n\nI think that's all I have to say =)\n\nEdited February 26, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466081","commentId":1466081,"userName":"PsychoRocka","timestamp":1424956596,"content":"got utterly STOMPED by nightmare druadan first attempt on stage 1... was so brutal, far more than expected but I did have bad reveals very early"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466257","commentId":1466257,"userName":"PocketWraith","timestamp":1424966085,"content":"And it turns out Nightmare Dru-Buri-Dru does still have the irrelevant damage restriction rather than a restriction on the progress you'll actually be placing on him. How on Earth did that make it through playtesting?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466273","commentId":1466273,"userName":"Mich the One","timestamp":1424966825,"content":"Psycho, you used so much words again, have you no shame? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nanyway, good to hear that NM Steward's Fear is difficult but not absolutely frustrating. The original is a very thematic and cool quest IMHO, with decent replayability due to random plots and villains. I am glad NM takes this further, and broadens the game instead of only ramping up the numbers. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466407","commentId":1466407,"userName":"Chris51261","timestamp":1424971495,"content":"> And it turns out Nightmare Dru-Buri-Dru does still have the irrelevant damage restriction rather than a restriction on the progress you'll actually be placing on him. How on Earth did that make it through playtesting?\n\nYou use willpower to calculate the damage you do, but then instead of placing damage you place progress. Since you can only place one damage, you will only place one progress."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466767","commentId":1466767,"userName":"PocketWraith","timestamp":1424984460,"content":">  \n> \n> > And it turns out Nightmare Dru-Buri-Dru does still have the irrelevant damage restriction rather than a restriction on the progress you'll actually be placing on him. How on Earth did that make it through playtesting?\n> \n> You use willpower to calculate the damage you do, but then instead of placing damage you place progress. Since you can only place one damage, you will only place one progress.\n\nThere is nothing in the rules that supports that interpretation. An enemy takes damage when you put the tokens down, not when you calculate the number. If you placed damage and then turned the damage into progress afterwards, sure, but since you place progress instead of damage, you never actually place damage, and so a restriction on how much damage you can place does nothing per the rules as written. It's obviously an oversight, but that is what the rules and the cards actually say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1466825","commentId":1466825,"userName":"Chris51261","timestamp":1424986125,"content":"Not to argue, but how doesn't it support that exactly? \"If an enemy would be damaged this way, place progress tokens on it instead of damage tokens.\" When you attack Dru-Buri-Dru with enough willpower to damage his health, you would be placing one damage, since it's all he can take per round. Thus, you place one progress instead of the damage. Even if you attack him for 20, all that would get through is 1, so that's all the progress you're making. But whatever, even if it's worded weird it's very clear what the intention is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1474963","commentId":1474963,"userName":"PsychoRocka","timestamp":1425449678,"content":"Going to try and attempt and report back on Peril in Pelargir and Encounter at Amon Din tonight, not going anywhere near nightmare into ithilien or siege of cair andros just yet...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1475447","commentId":1475447,"userName":"divinityofnumber","timestamp":1425483154,"content":"So excited to play these, especially Amon Din. I love it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1476395","commentId":1476395,"userName":"Chris51261","timestamp":1425515598,"content":"> Going to try and attempt and report back on Peril in Pelargir and Encounter at Amon Din tonight, not going anywhere near nightmare into ithilien or siege of cair andros just yet....\n\nPeril's nightmare effect is super fun. It genuinely feels like you're chasing down thugs who have stolen the scroll. Into Ithilien got a little tougher because they trimmed out the weaker Harad enemies and made it more important to keep Celador alive, but I was expecting way worse. Siege of CA still came down to removing stages 2 and 4 at the very least, but 4 of the 5 times I played it I got rid of all 3. I have to say, Heirs and Against the Shadow have been my favorite nightmare quests so far. I can't wait for the next 3!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1479371","commentId":1479371,"userName":"Glowwyrm","timestamp":1425667050,"content":"I agree that the Nightmare Heirs scenarios are excellent.\n\nNightmare Peril was good, an improvement on the original and not too tough.  They removed some of the frustrating randomness (Collateral Damage) and focused in on the things that made the scenario feel thematic and fun.\n\nI LOVE Nightmare Siege at Cair Andros.  It is one of my favorite quests and I've played it a half dozen times in the past week.  Again, they pulled out the randomly frustrating cards (Power of Mordor, chaining shadow wimpy orcs) and replaced them with the new battleground locations and the nightmare cards that interact with them.  There's lots of strategic decisions to make about assigning damage to battlegrounds, when and where to travel, and how to deal with lots of big enemies.  I took a different approach to beating the scenario as I'd remove stage two and three (if possible) so that I could siege quest the whole way through.  Often, encounter card draws would nuke the citadel before I could explore it and I was stuck slogging through stage two as well.  My games (I play two handed) come down to a tight finish where my threat is high and I'm down a hero or two and I'm in a last quest push that will mean the difference between victory and defeat.  Those are the best games.\n\nNeed to change my decks up for Nightmare Into Ithilien.  I played it twice and was arched/attacked to death on the second turn both times (well, badly enough that I threw in the towel).  Ithilien Overlook is a terrible, terrible card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1479643","commentId":1479643,"userName":"Chris51261","timestamp":1425677790,"content":"Yeah I did like the fact that some of the cards they took out weren't even just the weakest cards, but the cards where they're just irritating in almost a broken way (Power of Mordor). I actually was able to stall on stage one of Siege due to all the new battleground locations, so those sort of helped. Had they been being destroyed though they'd make things tough in a hurry. Into Ithilien always feels like that doesn't it? Like if I can get through the first 2 rounds, I'm usually in an okay spot! But if I didn't draw anything helpful to deal with the Southrons things get ugly, especially since I like higher threat decks. Overlook definitely was a game changer though, especially if you had 2 out or something awful, lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136079-against-the-shadow-nightmare-spoilers/?do=findComment&comment=1480106","commentId":1480106,"userName":"danpoage","timestamp":1425710477,"content":"Full image spoilers are now available on Hall of Beorn Card Search:\n\n \n\n \n\nhttp://hallofbeorn.com/Cards/Search?Query=%2Bset%3AThe_Steward%27s_Fear_Nightmare%2CThe_Druadan_Forest_Nightmare%2CEncounter_at_Amon_Din_Nightmare&Sort=Set_Number [http://hallofbeorn.com/Cards/Search?Query=%2Bset%3AThe_Steward%27s_Fear_Nightmare%2CThe_Druadan_Forest_Nightmare%2CEncounter_at_Amon_Din_Nightmare&Sort=Set_Number]\n\nThanks to GeckoTH for the images.\n\nEdited March 7, 2015 by danpoage"}]}