{"url":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/","title":"Another game company doing errata decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1466270","commentId":1466270,"userName":"Raven1015","timestamp":1424966779,"content":"This isn't meant as hating on FFG, because I think they generally do good work, but I thought I'd bring this up for discussion. Paizo, the creators of the Pathfinder Adventure Card Game, recently announced two things, both based on a partnership with a printing service.\n\n \n\n* One is that they have released their own custom card creator, and community members can make their own cards and then get them printed out through the service (and others can access them easily as well)\n\n \n\n* Two is that they are allowing players to order \"errata decks\" from the same service that consist of all the cards with errata\n\n \n\nPeople have discussed \"errata decks\" here before, but now we seen an example of another company doing it. It would be nice if FFG would do the same, especially since they have their own in-house print on demand.\n\n \n\nhttp://paizo.com/paizo/blog/v5748dyo5lh6y?Community-Card-Creator-and-Errata-Decks [http://paizo.com/paizo/blog/v5748dyo5lh6y?Community-Card-Creator-and-Errata-Decks]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1466287","commentId":1466287,"userName":"Mich the One","timestamp":1424967360,"content":"If this happened it would be the demise of the obsessive completionist collector types.\n\n \n\nRegardless, the idea would be very nice indeed. However, my guess is FFG is such a big scale operation that the return on this project might not be worth their effort. I would be glad to be wrong, though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nIf this would come to life, my only wish would be that custom player-crafted cards had some additional symbol to show that they are not \"canonical\". I already have trouble remembering the cards as they are now. Add hundreds of custom cards and I would drown, man."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1467087","commentId":1467087,"userName":"soullos","timestamp":1424996352,"content":"Paizo does good work. I hope other companies take notice. This is a great idea. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1475206","commentId":1475206,"userName":"shoreless","timestamp":1425472482,"content":"Yeah, I can only see the custom card ideas as pure profit for them!\n\n \n\nTo divert a little bit, in the spirit of taking ideas from other companies, when can we get some plastic-coated cards like the new Doomtown cards?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1475251","commentId":1475251,"userName":"Mich the One","timestamp":1425475558,"content":"Well, there also might be licencing issues. I obviously am wildly speculating here, but perhaps FFG simply cannot slap a \"Lord of the Rings\" on anything they wish, but are bound to \"control\" that merchandise they produce is in line with the Tolkien lore or with other requirements. It might be hard, impossible even, to enforce it with player custom cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1477264","commentId":1477264,"userName":"HeavyKaragh","timestamp":1425570609,"content":"I think Mitch is right. Pathfinder is Paizo's stuff, FFG doesn't own Middle-eart stuff. Also, there will be problems with art used in the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136103-another-game-company-doing-errata-decks/?do=findComment&comment=1477303","commentId":1477303,"userName":"Raven1015","timestamp":1425571613,"content":"Yeah, the custom stuff is cool, but I posted this more regarding the errata decks, as that would definitely be possible for FFG to do."}]}