{"url":"https://community.fantasyflightgames.com/topic/136485-smaug-town-baiting-and-esgaroth-wharf-battle-of-lake-town/","title":"Smaug, Town-Baiting, and Esgaroth Wharf (Battle of Lake-Town)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/136485-smaug-town-baiting-and-esgaroth-wharf-battle-of-lake-town/?do=findComment&comment=1471143","commentId":1471143,"userName":"TwiceBorn","timestamp":1425260975,"content":"So finally got around to trying my hand at Battle of Lake-Town this weekend, and actually managed to squeeze out 1 win two-handed (out of 5 games), and 1 win straight solo (out of 6 games).\n\n \n\nIn my most recent defeat, the following situation came-up.\n\n \n\nSmaug the Terrible is engaged with my characters. First card out of the encounter deck is the Treachery \"Town-Baiting\" (When Revealed: Smaug makes an attack against Lake-Town. The Last player may declare a defender against this attack. Excess damage from this attack must be placed on Lake-Town. This effect cannot be cancelled).\n\n \n\nQ1. I presume that FAQ 1.42 applies, and that I draw a Shadow card when Smaug resolves his attack against Lake-Town, just as if he were attacking a character?\n\n \n\nQ2. If the answer to Q1 above is indeed \"yes,\" and I draw Esgaroth Wharf as the shadow card (Shadow: Attacking enemy gets +2 attack. Then it makes an additional attack after this one). Would this second attack be against the Town? The characters? Whichever the player that drew the card (or the first player?) chooses?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/136485-smaug-town-baiting-and-esgaroth-wharf-battle-of-lake-town/?do=findComment&comment=1471200","commentId":1471200,"userName":"GrandSpleen","timestamp":1425265662,"content":"I would give him a shadow card.  Not sure about the Esgaroth Wharf effect -- if he is engaged, I would have him attack the engaged player.  If he is not, I would think there would be no effect.  An objective card is not typically a legal target for attacks, so I don't think a shadow card could have Smaug attack Lake-town unless it explicitly stated so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/136485-smaug-town-baiting-and-esgaroth-wharf-battle-of-lake-town/?do=findComment&comment=1471385","commentId":1471385,"userName":"TwiceBorn","timestamp":1425279402,"content":"Thanks for your thoughts, GrandSpleen."}]}