{"url":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/","title":"Two elementary questions from a rather seasoned player","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482168","commentId":1482168,"userName":"Olorin93","timestamp":1425902113,"content":"... or at least, I like to consider myself one by now.\n\n \n\n1) When a shadow card resolves (or has no effect and does not resolve), is it considered \"discarded\" like any encounter card and goes to the victory display if it has victory points? Same thing with locations I clear without travelling to them, e.g. with Asfaloth or Northern Tracker?\n\n \n\n2) Can I declare the same character an attacker or defender several times in the same combat phase? I assume yes, based on Elrohir's, Elladan's, Brand's and Defender of the Naith's abilities but I want to make sure. Moreover, can a character like Elladan attack the same enemy twice?\n\n \n\nI only recently found out that my friends and I have been playing it slightly wrong for years - I don't think we have ever realised that each player only gets 1 optional engagement, so we've just given most enemies to the leadership/tactics players to keep the support decks free. But we've only just restarted and are playing the scenarios in order for the first time, so we'll try to play it correctly this time around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482209","commentId":1482209,"userName":"alogos","timestamp":1425905342,"content":"Shadow card are only discarded at the end of the combat phase (or when making a new attack), not when resolving. Also, their non-shadow text don't apply. And Victory only work when an ennemy is defeated or a location explored, not when they just get \"discarded\". It would work with asfaloth or northen tracker since you explore the location.\n\n \n\nYou, as a player, can declare 1 attack per enemy engage with you during the combat phase, that's the only limit. With this, you can also use card effect to make more attack, but you can't declare 2 attack on the same enemy during the combat phase, whoever is ready to participate in.\n\nTips: with ranged character, you can declare attack on enemy not engage with you AND participate in the attack the other player engaged with that enemy declare his (with at least one character).\n\n \n\nAnd yes, only one optional engagment per player during encounter phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482272","commentId":1482272,"userName":"lecudas","timestamp":1425907868,"content":"So, let's say I am engaged with two enemies. Gimli has Unexpected Courage. Can I attack the first enemy, ready Gimli, and then attack the second enemy?\n\nEDIT: I sure hope so, because that is how I have played it for a long time now!\n\nEdited March 9, 2015 by lecudas"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482359","commentId":1482359,"userName":"Teamjimby","timestamp":1425911189,"content":"That would be legal because you aren't attacking any single enemy more than once.  However you could not use Unexpected Courage to have Gimli attack the same enemy twice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482408","commentId":1482408,"userName":"lecudas","timestamp":1425913168,"content":"Right! That's what I thought - just wanted to make sure. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482556","commentId":1482556,"userName":"Olorin93","timestamp":1425917500,"content":"Thank you for replying!\n\n \n\nHas it been confirmed that Victory only applies when an enemy is defeated or a location explored and not when an encounter card is discarded for any other reason? The phrasing on p. 24 of the core rulebook is a bit vague. The condition mentioned is \"when an enemy or location is defeated\" which sounds simplified for new players, and then \"leaves play\" is used, which is a very general term.\n\nEdited March 9, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482598","commentId":1482598,"userName":"Teamjimby","timestamp":1425918976,"content":"The rulebook says defeated and shadow cards aren't defeated.  There's no other clarification in the FAQ, but I can assure you that is the intent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137240-two-elementary-questions-from-a-rather-seasoned-player/?do=findComment&comment=1482844","commentId":1482844,"userName":"leptokurt","timestamp":1425928320,"content":"Yep, you don't get victory points by discarding shadow cards. You refer only to the shadow effect of a shadow card, the rest of the card is treated like it was blank."}]}