{"url":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/","title":"Escape from Tharbad - Forced effect","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483744","commentId":1483744,"userName":"JanB","timestamp":1425984334,"content":"Hi Folks,\n\n \n\nplayed yesterday 'Trouble in Tharbad' and a questions came up.\n\n \n\nFlucht aus Tharbad (Escape From Tharbad) [http://deckbauer.telfador.net/card.html&id=5720]\n\n \n\nStage 2B says: Forced: After the last time counter is removed from this quest, either raise each player's threat by 3 or Bellach makes an immediate attack against Nalir. Then, place 3 time counters on this stage.\n\n \n\nQuestion: Can i choose that Bellach makes an attack if he is not in play?\n\nEdited March 10, 2015 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483915","commentId":1483915,"userName":"GrandSpleen","timestamp":1425995723,"content":"I think no, you have to select an effect that can be fully resolved.  In some instances, you can select an effect that does nothing, like \"remove all progress tokens from play\" when there are 0 tokens on the board.  It's been clarified in the past that \"all\" includes the number \"0,\" so you can resolve the effect to the letter even if there are 0 tokens in play.  But with this effect, I don't think you can be said to have resolved the Bellach option if he is not in play.  That's how I'm reading it, anyway!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483940","commentId":1483940,"userName":"Chris51261","timestamp":1425997804,"content":"Isn't that \"must either x or y?\" Is just \"either\" the same resolution? Seems odd that they would spell out in the FAQ the exact meaning of their wordings and then not use them. I'm not disagreeing with you, it makes sense you have to resolve one fully, just seems odd."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483949","commentId":1483949,"userName":"GrandSpleen","timestamp":1425998187,"content":"You're thinking of this:\n\n \n\n\"(1.44) “Must X or Y” vs “must either X or Y” If a card instructs a player to perform one task or perform a second task using the structure “... must X or Y...” then the player must attempt to perform the first task, and performs the second task instead only if the first task cannot be performed. If a card instead uses the structure “... must either X or Y...” then the player may choose which task to perform, although one of them must be performed in full, if able.\"\n\n \n\n \n\n \n\nThat says that if the card says \"MUST,\" then you have to choose the first option, and you can only do the 2nd option if you were not able to do the first.   If there is no \"must,\" you can simply choose between the two.  Either way I think you have to choose one that you can fully resolve, because:\n\n \n\n \n\nI was thinking of this, which is not in the official FAQ (it's in alogos's unofficial one):\n\n \n\nQ: With Followed by night, if you can't resolve the choice you chose, do you have to resolve the other?\n\nA: When resolving any When Revealed effect that gives you a choice between two effects, you must choose an effect that you can fully resolve. Followed by Night is an odd example because you can always resolve either effect. That’s because it targets either ‘all allies’ or ‘all enemies’ and the word ‘all’ can include 0.\n\n \n\n(my emphasis)  That is for \"When Revealed\" effects, but I assume the same holds true for any Forced effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483958","commentId":1483958,"userName":"JanB","timestamp":1425998574,"content":"Thanks GrandSpleen, we played it so like you mentioned. But the wording lets you choose the Bellach attack independently he is in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137375-escape-from-tharbad-forced-effect/?do=findComment&comment=1483991","commentId":1483991,"userName":"Chris51261","timestamp":1425999968,"content":"Ahh yeah, I gotcha Grand. Sounds right. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited March 10, 2015 by Chris51261"}]}