{"url":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/","title":"Will LOTR card game ever come to PC?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485151","commentId":1485151,"userName":"jimjim19681968","timestamp":1426070318,"content":"I had my first game (solo) in about 6 weeks last night, and I relished it. I'm questing Conflict at the Carrock and assembled a mighty deck to tackle it. I had forgotten just have incredible this game is.\n\n \n\nHowever, I would love to play this via Steam on a PC.\n\n \n\nDo you think this will ever happen?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485172","commentId":1485172,"userName":"MyNeighbourTrololo","timestamp":1426071733,"content":"I hope it will. But I don't think it will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485190","commentId":1485190,"userName":"Olorin93","timestamp":1426073533,"content":"There's OCTGN for PC play if you haven't heard of it. One thing my friends and I have agreed on several times, though, is that playing with the physical cards is a superior experience to any digital interface. You wind down and interact with each other in a different way and setting compared to using screens and buttons. And even in solo play, I think it's nice to get away from the computer. In my opinion boardgames are always superior to video games.\n\nEdited March 11, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485192","commentId":1485192,"userName":"MyNeighbourTrololo","timestamp":1426073944,"content":"> In my opinion boardgames are always superior to video games.\n\nYeah, especially when you and your friend live in different countries."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485236","commentId":1485236,"userName":"shoreless","timestamp":1426077389,"content":"The sheer convenience of 'electronic' board games provides a strong selling point; I'd love to see an LOTR app with the functionality and polish of Hearthstone, but it won't top playing with, you know, cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485390","commentId":1485390,"userName":"MyNeighbourTrololo","timestamp":1426087636,"content":"> The sheer convenience of 'electronic' board games provides a strong selling point; I'd love to see an LOTR app with the functionality and polish of Hearthstone, but it won't top playing with, you know, cards.\n\nThat's funny. Because the main reason why this kind of games are not turned into PC games is the fear of it hindering the sales of actual physical copies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485540","commentId":1485540,"userName":"Xir","timestamp":1426093706,"content":">  \n> \n> > The sheer convenience of 'electronic' board games provides a strong selling point; I'd love to see an LOTR app with the functionality and polish of Hearthstone, but it won't top playing with, you know, cards.\n> \n> That's funny. Because the main reason why this kind of games are not turned into PC games is the fear of it hindering the sales of actual physical copies.\n> \n>  \n\nWell, FFG can sell physical cards with \"code\" to activate digital cards in the application with no additional cost or sell digital cards in the application itself only (without the need of buying physical cards). \n\nThat could make both FFG and players happy. \n\n \n\nThere are also retailers who FFG need to take into account as well but I think it is doable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485550","commentId":1485550,"userName":"shoreless","timestamp":1426094012,"content":"Should they ever do it (which is dubious), I have to imagine you would pay a small fee for the app, then you either (1) buy the physical copies and get a unique code or (2) buy the digital packs through the app. No idea if this would be profitable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485729","commentId":1485729,"userName":"MyNeighbourTrololo","timestamp":1426099716,"content":"Just some theorycraft:\n\nThey are sitting on a complete game. They have no need to design it, come up with cards, card design and stuff - everything is already here. All they need to make it work is game code itself (which for this game is not that hard - I made LotR LCG simulator in a Warfract 3 map editor) and graphic user interface + netcode. And just import everything from the base game. Unlike physical version, all erratas and stuff are already there and can be integrated instantly without any fuss. \n\n \n\nThe only questionable thing here is a potential playerbase. They can start a Greenlight as they did with their other digital versions and see if the people are interested before they even design anything. But, well, yeah, for how many exactly years does LotR LCG or any other LCG of FFG exists and there have been zero movements towards the digital version again? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485753","commentId":1485753,"userName":"Olorin93","timestamp":1426100548,"content":">  \n> \n> > In my opinion boardgames are always superior to video games.\n> \n> Yeah, especially when you and your friend live in different countries.\n> \n>  \n\nYes, absolutely. You'll cherish coming together to play all the more. I live quite far away from my friends I play with due to studies and employment in different places, so we can only meet and tackle some scenarios maybe every other or third month if we're lucky. That's always something to look forward to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1485886","commentId":1485886,"userName":"MyNeighbourTrololo","timestamp":1426105145,"content":"That level of delusion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1486172","commentId":1486172,"userName":"Chris51261","timestamp":1426116146,"content":"It sounds like someone needs a hug. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1486827","commentId":1486827,"userName":"-Istaril","timestamp":1426168112,"content":"I think people are forgetting one of the largest issues: licensing. FFG has experimented with digital content, but the main reason I suspect the LOTR LCG will never make it there is that I doubt FFG's license for LOTR extends to computer games. If they were going to try their hand at offering a digital distribution of an LCG, I'd guess it'd be with something like Netrunner (where they own the Android IP). The market is probably larger there too, and the game's click-based action system lends itself better to remote play.\n\nEdited March 12, 2015 by -Istaril"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1486945","commentId":1486945,"userName":"danpoage","timestamp":1426173968,"content":"> ...All they need to make it work is game code itself (which for this game is not that hard - I made LotR LCG simulator in a Warfract 3 map editor) and graphic user interface + netcode. And just import everything from the base game. Unlike physical version, all erratas and stuff are already there and can be integrated instantly without any fuss. \n\nThis is the funniest thing I've read in a while. The idea the modeling the game in software (with all of its quirky rules) is \"not that hard\" is hilarious. I too started this process and got about 70% to implementing the Core Set before I realized how truly time-consuming this would be. Each expansion, heck even Nightmare decks add features which completely change the core rules of the game. Making an engine that actually understands each card in the context of the rules of game would be a huge undertaking, to say nothing of making a UI that isn't a total nightmare to use. And no, OCTGN is not good enough to just copy, as is. I would love to play this \"simulator\" that you made so easily. I suspect that I could break the hell out of it, but it would be an enjoyable process."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1487223","commentId":1487223,"userName":"MyNeighbourTrololo","timestamp":1426184277,"content":"Nothing that crowd of paid experienced programmers can't do. There are things made much harder that good ol' LotR LCG. Do you have a copy of Warcraft 3?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1488747","commentId":1488747,"userName":"Mich the One","timestamp":1426269009,"content":"Sorry for the incoming wall of text, but there is so much to think about.\n\n \n\nFirstly, I admit I know nothing about programming. So I will not dare commenting on whether creating the software is easy. As far as I am concerned it is all witchcraft. \n\n \n\nBut hey, look at Hearthstone. It might be a simpler game than LotR, agreed. But is it really such a difference? If I am not mistaken, Hearthstone was originally made by a rather small team of programmers, and has been an explosive success regardless. I mean, tens of millions of users.\n\n \n\nSo it seems it is perfectly doable, plus LotR would not have to be as polished. I imagine we would all make without exquisite sound assets, music, animations, slick UI, ladders and other fireworks.\n\n \n\nFFG bought cardgamedb. What if they bought OCTGN and just support it as an official platform? If I remember correctly, there is a subscription fee of minimum $3 per month for registered OCTGN users now. I would gladly pay that (and more) to subscribe for LotR LCG online. Mind you, FFG are owned by Asmodee now, which is a part of an investment fund, I believe they do have the resources for such small acquisition :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Ah, it so easy to spend other people's money.\n\n \n\nBut we come to the biggest problem, which is likely licensing, as already mentioned by Istaril. Art from the artists could probably be managed (if it is not already covered), but the Middle-earth licence? Hmm... yeah. Is that even possible? Warner Bros seemed to hold the license for LotR computer games (Lego games, Shadow of Mordor). I have no idea whether that is an exclusive licence, or maybe only tied to the movie-universe-LotR so that there is still room to have non-movie games. \n\n \n\nIf anyone knows more about the intellectual property situation, could you please share your knowledge? that would be fascinating\n\n \n\nAlso, when I now think about it, it is actually a good thing that OCTGN is not being chased by IP holders. They could probably be choked if someone up the Midde-earth food chain came to a great idea that OCTGN infringes their IP by monetizing it through subscription fees. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1488780","commentId":1488780,"userName":"MyNeighbourTrololo","timestamp":1426271617,"content":"Hearthstone was, and is, explosive success because it's extremely causal, random, fast, non-demanding to the player card game based on an extremely popular worldwide universe and published by one of the most notorious game distributors. \n\n \n\nAnd OCTGN is not monetizing anyones IP, OCTGN offers their own additional services for monthly fee which involve zero game stuff, like account pictures, reconnects and stuff. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1488795","commentId":1488795,"userName":"GrandSpleen","timestamp":1426272255,"content":"> Making an engine that actually understands each card in the context of the rules of game would be a huge undertaking\n> \n>  \n\n \n\nYeah I agree, I'm no programmer but I do have some basic exposure to it.  When I try to interpret rules I try for consistency as much as possible, and sometimes do that by wondering what the rule would do if a computer parsed it (this is why some immunity rules give me headaches)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1489236","commentId":1489236,"userName":"ricedwlit","timestamp":1426297403,"content":"Okay, I'll chime in here (context: I am a programmer and have been for many years).  I agree with Dan and GrandSpleen: creating a stable engine for this game would NOT be easy.  You could cobble one that works with what we have now, but then as each expansion came out (with new mechanics, new keywords, new overrides), the code would grow to look like Frankenstein's monster as programmers would need to rework everything to fit.  Just think about all the questions we send in to Caleb: the programmers would ask all of those and even more.\n\n \n\nI'm not saying it couldn't be done - just that it wouldn't be easy.  (One last thought: the UI would also be hard - imagine being able to provide a tool tip to the user as to why they a character couldn't perform an action that normally they could but are now blocked by some other effect).\n\nEdited March 14, 2015 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1489333","commentId":1489333,"userName":"danpoage","timestamp":1426307257,"content":"Exactly. I'm not saying it's impossible. I have been a part of teams that made far more complex software, with advanced UI even. These kind of teams are not cheap, it takes TIME to make quality software. Hearthstone was not made over a few Mountain Dew-fueled weekends and this game makes Hearthstone look like Checkers. It is also worth noting that managing such a software project takes a certain corporate skill set, which is certainly not FFG's expertise.\n\nLastly, there is a question of whether or not FFG would even want to undertake such an endeavor (assuming they had approval from their new owners). As makers of physical games, they may see software (with lower margins) as undercutting their core market. To be clear, I would love to see this happen, and if someone wants to pay me a year's salary, I'll happily go off and create the engine. Still, even with a working engine, getting UI and UX as good as Hearthstone is a huge challenge in itself. The (literally) million dollar question is whether or not all of that work means that FFG grows the player base. If LotR LCG Software only sold to existing players, it wouldn't be worth the cost to create and support. It is fun to dream, though.\n\nEdited March 14, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1489476","commentId":1489476,"userName":"MyNeighbourTrololo","timestamp":1426325966,"content":"They always can purchase/rent an existing game engine and modify it, like many of the game companies do. It can save a bit of man hours and munay. Also, regarding the new stuff that comes out - when it comes out, it comes out on new cards, always on new cards, which makes it a lot easier to implement. It's not easy, yes, but it's not that hard as you trying it to make look like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1489598","commentId":1489598,"userName":"jimjim19681968","timestamp":1426339619,"content":"Thanks for all this input.\n\n \n\nIt's fascinating to hear of the possibilities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1489671","commentId":1489671,"userName":"Mich the One","timestamp":1426344382,"content":"> And OCTGN is not monetizing anyones IP, OCTGN offers their own additional services for monthly fee which involve zero game stuff, like account pictures, reconnects and stuff. \n\n \n\nSure. But there have been web services that provided a \"neutral framework\" for something and still ended up in trouble because they were effectively a platform for dealing with copyrighted stuff (file exchange, music distribution). Of course it is not exactly the same. But sometimes it is not a matter of having a right or just claim, being subjected to a threat of a lawsuit or a dispute from some big guys can be awful in itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1490370","commentId":1490370,"userName":"Raven1015","timestamp":1426397571,"content":"I think perhaps the one feasible way it could happen is if FFG partners with a company that specializes in making apps/programs of this nature, as several other board game companies have done. Handelabra Games and Sentinels of the Multiverse is one example. Obsidian and Pathfinder Adventure Card Game is another. This gets around many of the problems. On the other hand, whether FFG wants to go this route is another matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1490416","commentId":1490416,"userName":"MyNeighbourTrololo","timestamp":1426403120,"content":"What? PACG goes digital? But it's literally a dice roller fest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1491399","commentId":1491399,"userName":"Raven1015","timestamp":1426484775,"content":"That it is. UI looks good though and it appears they are adding some light story elements. I think I'll actually enjoy playing it more in tablet form if I don't have to set everything up and shuffle for a \"dice fest\"\n\n \n\nhttps://www.youtube.com/watch?v=smGMt0B7qeM [https://www.youtube.com/watch?v=smGMt0B7qeM]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1491433","commentId":1491433,"userName":"MyNeighbourTrololo","timestamp":1426490087,"content":"Well, that's strange, kinda, because PACG is most fast and easy to setup game in my collection :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137466-will-lotr-card-game-ever-come-to-pc/?do=findComment&comment=1491807","commentId":1491807,"userName":"Raven1015","timestamp":1426516658,"content":"Considering my lack of free gaming time, I can only really justify setting up a game that I love. And I'd have to say that while I like PACG, I don't love it. Tablet form is a lot easier to stomach because I could play it for five minutes, save, then come back to it later whenever."}]}