{"url":"https://community.fantasyflightgames.com/topic/137508-using-lotr-lcg-for-tabletop-rpgs/","title":"Using LotR: LCG for tabletop RPGs?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137508-using-lotr-lcg-for-tabletop-rpgs/?do=findComment&comment=1485801","commentId":1485801,"userName":"Kanosint","timestamp":1426102190,"content":"Dear,\n\n \n\nI regularly play this game - and a certain other solo card game - during my off time.\nFor quite some time now I've been using the Encounter decks along with some tables and die rolls to generate terrain, but I want to do one better.\nI want to use ALL types of card in the game for random generation during tabletop RPGs, both as a self-imposed challenge and because I enjoy twists and turns that surprise even the GM.\nMy question, however, is the following: have you ever done so? Do you have any advice or remarks about this subject? It seems few if any people have ever discussed the potential of using this game for something beyond its intended purpose, yet it seems very fir for this indeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137508-using-lotr-lcg-for-tabletop-rpgs/?do=findComment&comment=1486178","commentId":1486178,"userName":"TwiceBorn","timestamp":1426116343,"content":"I have The One Ring RPG by Cubicle 7 (awesome game, one of the rare RPGs where I have found it a real pleasure to read adventures and sourcebooks just for the sake of reading), but have unfortunately never had the chance to play it… and probably won't for the foreseeable future. :-(\n\n \n\nThat having been said, I have always thought the LCG could be a great source of inspiration and potential encounters for the RPG, and definitely would consider doing what you have in mind.\n\n \n\nYou might also want to ask the same question on Cubicle 7's boards for The One Ring RPG.\n\n \n\nIf you give the LCG/RPG blend a go, let us know how it works out for you! I, for one, would love to hear more about that. \n\n \n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137508-using-lotr-lcg-for-tabletop-rpgs/?do=findComment&comment=1486731","commentId":1486731,"userName":"shoreless","timestamp":1426162392,"content":"I also enjoy The One Ring. Fantastic game; possibly more thematic than this game! There is a good bit of overlap between the two as there are only so many places you can go for 'original' adventures in Middle-earth, but they fleshed out Wilderland a great deal and that is a very fun region to explore. \n\n \n\nI don't know about actually combining the two, mechanically. I would have to think about it. I just don't see much useful overlap without a major overhaul of the game rules, one way or the other. I have, however, considered using them for their art. When I run my TOR game I use clippings from the actual Cubicle 7 books, as well as their Hobbit Tales game. Hobbit Tales is a wonderful game on its own and using the cards for both the hazard generation (per the rules) or simply as manipulatives is a good choice. Certainly LOTR LCG can be mined for the art, the cards can be used to represent items in a characters inventory ('Oh yeah, I have that scroll you gave me...'), or you can bite off some plot twists if you need them for your game.\n\n \n\nBut, to reiterate, I can't really see a way to combine these two games in particular without some serious house rules. "}]}