{"url":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/","title":"The Secret Defenders","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487111","commentId":1487111,"userName":"Teamjimby","timestamp":1426180123,"content":"https://fantasyflightgames.com/en/news/2015/3/12/the-secret-defenders/ [https://fantasyflightgames.com/en/news/2015/3/12/the-secret-defenders/]\n\n \n\nhalbarad.png [https://images-cdn.fantasyflightgames.com/filer_public/73/b9/73b9491e-7992-4b2d-90d3-7245d1b1f6c2/halbarad.png]\n\nheir-of-valandil.png [https://images-cdn.fantasyflightgames.com/filer_public/6e/01/6e018a15-8088-4506-9c14-44dae583eb16/heir-of-valandil.png]\n\nweather-hills-watchman.png [https://images-cdn.fantasyflightgames.com/filer_public/dc/a2/dca2553e-f567-4d69-ba2a-ef8dfd0b8298/weather-hills-watchman.png]\n\nathelas.png [https://images-cdn.fantasyflightgames.com/filer_public/86/87/868735c6-bb3c-4593-9df4-8b6da5e01b7e/athelas.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487120","commentId":1487120,"userName":"MyNeighbourTrololo","timestamp":1426180534,"content":"Thanks for hijacking it with some style at least."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487128","commentId":1487128,"userName":"gandalfDK","timestamp":1426181009,"content":"First impressions:\n\nWOOOOOOOOTTT!!!\n\nThat art! Especially Halbarad looks bad ass!\n\nHeir of Valandil, cool card and thematic too! I hereby send my summons aagain to Derek or Mike for more info on Valandil. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\nHmm, Athelas is good, but the exhaustion is a bit painfull, because the conditional removal of Condition attachment might not be worth the extra cost. It doesn´t show up that often that you want a healing card that discards an condition attachment. Also, sometimes a character can´t exhaust because of the condition attachment. Both in one card seems good, but I find myself mostly looking for 1 card that can do healing or 1 that removes a condition attachment, not both.\nNice synergy with Weather Hills Watchman but still not sure if it is cost efficient emough to set cards aside for Ranger Summons, especially in solo not.\n\nHalbarad, Aragorn and Mablung! :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] ftw!\n\nEdited March 13, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487191","commentId":1487191,"userName":"Teamjimby","timestamp":1426182954,"content":"I don't normally care much for their deck designs, but these decks look both effective and thematic.  I'm looking forward to more signals and allies to make these cards effective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487242","commentId":1487242,"userName":"shoreless","timestamp":1426184849,"content":"Sore excited! I love that we'll have some decks to try from the get-go. Halbarad + Sam is huuuuuuge!\n\nEdited March 12, 2015 by shipwreck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487265","commentId":1487265,"userName":"MyNeighbourTrololo","timestamp":1426185708,"content":"Mablung."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487295","commentId":1487295,"userName":"Glowwyrm","timestamp":1426186758,"content":"Rangers are going to be a very interesting way to play.  Most of the time when I'm engaging enemies, my plan is to destroy them right away.  Otherwise, you're having to pour a lot of resources into defense and you risk being overwhelmed by them.  At least two ranger cards benefit from keeping multiple enemies engaged with you without destroying them (the ranger that let's you draw cards for each engaged enemy, Heir of Valandil).  Sounds like lots of strategic decision making will go into playing the ranger decks, which is great!  Also sounds like the quests in the cycle will be combat heavy with lots of enemies hitting the table, which is AWESOME!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487299","commentId":1487299,"userName":"danpoage","timestamp":1426186798,"content":"In multi-player, Halabard pairs so well with Haldir (on the other side of the table). Between Dúnedain and Hobbits, engagement-trick decks look like a very powerful archetype. I like all of the interesting decisions that these decks allow. It's also nice to see cards like Son of Arnor get pulled from mothballs and re-evaluated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487354","commentId":1487354,"userName":"Mndela","timestamp":1426188721,"content":"Halbarad..., Halbarad..., Halbarad... i only have in mind 1 name today... Halbarad..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487778","commentId":1487778,"userName":"Bullroarer Took","timestamp":1426207481,"content":"No spirit cards yet.  Hmmm..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487804","commentId":1487804,"userName":"Pharmboys2013","timestamp":1426208779,"content":"Very exciting new preview. Pleased with Halbarad, I really like how they're succeeding in creating heroes that really help anchor a respective thematic archetype without just giving a blanket stat buff *cough*Dain*cough*.  Cannot wait to give tactics Aragorn, Halbarad, and Mablung a go...although my concern with this new dunedain playstyle still exists in that we'll need some strong and consistent forms of defense to withstand the attacks of the swarms of enemies we'll be pulling towards us. His real strength will come in multiplayer which to me personally is a little disheartening since i normally only get to play solo or 2 player but overall excited to use\n\n \n\nHeir of Valandil is certainly a cool card and i will be interested to see how useful it will be in actual practice. One would think keeping multiple enemies engaged with you turn after turn could be a slipperly slope to defeat as you are overcome but considering all existing Dunedain allies have a high cost of at least 3 this will have a significant impact.  Then again, using a hero lineup like i listed above gives you access to Steward and Mablung should generate multiple resources himself a turn so we'll see if this will make my cut.\n\n \n\nWeather Hills Watchman is fantastic. Reasonably priced, good useful stats (more than 1 hit point on an ally is huge), and the ability is clutch. Makes the existing signals a better play since they can be fetched compared to possibly better stat giving attachments and also provides some more consistency to what i've previously viewed as a possibly over gimmicky-ranger summons combo\n\n \n\nAthelas-my least favorite of the group. A decent card to be sure but my head instantly compares it to Lembas which i think is a much better card.  Both healing single use attachments have trait requirements so Athelas may still prove viable in thematic builds where other healing options may not be avaliable. I think i'm hung up on having to exhaust the character.  Will have to use it in play to have a better verdict I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487819","commentId":1487819,"userName":"Bullroarer Took","timestamp":1426209439,"content":"Conditional attachments"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487829","commentId":1487829,"userName":"Pharmboys2013","timestamp":1426209975,"content":"> Conditional attachments\n\n \n\nI'll presume the intent of simply stating an encounter card subtype was to add to the argument of Athelas when I compared it to Lembas.  I am aware it did do that and took that into consideration despite not specifically mentioning it in my post.  That is certainly a good use for it, there are alternatives for doing that as well though, namely Elrond, Miner of the Iron Hills, Power of Orthanic (which no one uses but....), and indirectly but most importantly A test of will.  I dont hate Athelas, i just think i'll have to use it in game to really make a good judgement on its utility but right now I really like Lembas"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487846","commentId":1487846,"userName":"Teamjimby","timestamp":1426210439,"content":"In addition to Son of Arnor gaining relevance again, Forest Snare may also see renewed play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487873","commentId":1487873,"userName":"Gizlivadi","timestamp":1426212067,"content":"Absolutely love the new hero. He's exactly what I wanted him to be (some good low-ish threat hero with decent willpower and a engage enemy ability) and in my favorite sphere no less. Will have to test him, but he may very well be my favorite hero ever.\n\n \n\nAnd of course the attachmens are amazing. Not sure about the ally (it would have been better if he searched the top 10 cards, and be kinda equivalent to Horse breeder) but still seems pretty usable. And I am glad we got an Athelas attachment. Gives me hope for an Anduril, Sing, Glamdring attachment, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487874","commentId":1487874,"userName":"Raven1015","timestamp":1426212070,"content":"> In addition to Son of Arnor gaining relevance again, Forest Snare may also see renewed play.\n\n \n\nGood call. Keep a bank of 1-2 enemies engaged with you at all times without having to suffer the attack. Maybe a partner deck can be in charge of this. Grima works well bumping the Snare down to 2, even if both players have to take a threat hit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487910","commentId":1487910,"userName":"Gizlivadi","timestamp":1426213369,"content":"Another card that will get a lot more use is Dunedain Watcher. Shasow cancelling is nice in Leadership, and discarding an ally to outright cancel a shadow effect is actually pretty good. Now with Heir of Valandil it's much more accesible, so I'm hoping to using her more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487937","commentId":1487937,"userName":"Bullroarer Took","timestamp":1426214873,"content":">  \n> \n> > Conditional attachments\n> \n>  \n> \n> I'll presume the intent of simply stating an encounter card subtype was to add to the argument of Athelas when I compared it to Lembas.  I am aware it did do that and took that into consideration despite not specifically mentioning it in my post.  That is certainly a good use for it, there are alternatives for doing that as well though, namely Elrond, Miner of the Iron Hills, Power of Orthanic (which no one uses but....), and indirectly but most importantly A test of will.  I dont hate Athelas, i just think i'll have to use it in game to really make a good judgement on its utility but right now I really like Lembas\n> \n>  \n\nI was in a hurry (cooling dinner) so I'm sorry if that came across as terse and was misread.  Yes, I believe that the ability to remove conditional attachments is the primary use for the card.  To me removing the damage is secondary.  Sure there are other options, but in an attachment deck like I usually run, it's a pretty powerful card.  I might replace the two Power of Orthancs in my deck with it.\n\n \n\nBy the end of the cycle I would like to see the Dunedain XXX ally that can be discarded to cancel a When Revealed effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487950","commentId":1487950,"userName":"Pharmboys2013","timestamp":1426215612,"content":"I would be all for an ally ability like that. Theres already kind of a precedent for that within dunedain itself with the watcher"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487954","commentId":1487954,"userName":"Gizlivadi","timestamp":1426215720,"content":"> I would be all for an ally ability like that. Theres already kind of a precedent for that within dunedain itself with the watcher\n\n \n\nPossibly one of our unknown spirit cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1487970","commentId":1487970,"userName":"Catastrophic09","timestamp":1426216566,"content":"So many great cards, I'm stoked!! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] All these combos are wild and Sam can easily get out of control with all these ways to engage enemies now! From the space thats left I can make really good guesses... The only player cards not spoiled are # 6 and 13. 6 is likely a Spirit ally and 13 is a Spirit attachment. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488004","commentId":1488004,"userName":"Gizlivadi","timestamp":1426217779,"content":"I hope in this box, or maybe in the cycle, we get a Dunedain artifact, such as Palantiri, Elendilmir, etc "},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488011","commentId":1488011,"userName":"PocketWraith","timestamp":1426218135,"content":"While in general keeping enemies engaged rather than killing them can be problematic, Dunedain with Halbarad and Heir of Valandil are going to be nice for Nightmare Journey Down the Anduin. Since you can't kill the Brown Water Rats anyway, they may as well reduce the cost of your allies and let Halbarad quest without exhausting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488035","commentId":1488035,"userName":"Pharmboys2013","timestamp":1426219341,"content":"I have no idea if it would be an actually viable pair of decks but it would be fun to do the Tactics Aragorn/Halbarad/whoever\n\nalong side a mono-tactics deck utilizing Hama and thicket of spears. The Dunedain deck should have no problem pulling all enemies to them and the other deck can lock them as needed. Willpower could potentially be an issue but maybe Theoden could be a good fit for one of the decks since at least 4/6 heroes would be tactics.  Gonna have to try it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488086","commentId":1488086,"userName":"williamobrien","timestamp":1426222121,"content":"I don't think Halbarad and Tactics Aragorn really go together.  The strength of Aragorn is to pull enemies to you after the Enemy Attacks step, so you get free shots at them.  If you've engaged two with Halbarad, you're getting less use out of Aragorn's ability.  If you're running multiplayer, I think you actually want to have them in separate decks, with the Halbarad deck emphasizing defense and then letting the Aragorn deck pull the enemies back over after Halbarad's team defends them.\n\n \n\nMechanically, Halbarad seems like he should really be running with Sam and/or Pippin most of the time.  Lots of draw and Sam can get huge.\n\n \n\nThematically and mechanically, Halbarad and the elf-twins works pretty well.  Engage two enemies, Elrohir defends both, Elladan kills both."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488269","commentId":1488269,"userName":"Mndela","timestamp":1426243117,"content":"> In addition to Son of Arnor gaining relevance again, Forest Snare may also see renewed play.\n\n \n\n5th cycle was in mind of the developers when they built the core, and Son of Arnor? ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488270","commentId":1488270,"userName":"Mndela","timestamp":1426243201,"content":"Athelas - Cloak - Hammersmith runs very good. You use Cloak and when it is used you discard it by Athleas. Then you return cloak by hammersmith, and return to do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1488285","commentId":1488285,"userName":"MyNeighbourTrololo","timestamp":1426246662,"content":"I do not know why you neglect Son of Arnor, I found him useful plenty of times. A leadershit ally with 2 attack and cost 3 is pretty useful by itself, this one even bears a useful entering play ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1491545","commentId":1491545,"userName":"joezim007","timestamp":1426504039,"content":"Does an objective ally count as a character? I believe it does, and if so, this Athelas just made Journey to Rhosgobel super easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1491556","commentId":1491556,"userName":"MyNeighbourTrololo","timestamp":1426505142,"content":"Remember that you can't heal more than 5 per one heal instance on the eagle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1494675","commentId":1494675,"userName":"Ecthelion III","timestamp":1426640021,"content":"> Does an objective ally count as a character? I believe it does, and if so, this Athelas just made Journey to Rhosgobel super easy.\n\n \n\nAthelas isn't going to be the only card that makes Rhosgobel easy.  Distant Stars from \"Escape from Mount Gram\" (best art EVER!) allows you to search the encounter deck and pull out copies of Forest Grove.  Plus, in Rhosgobel it's pretty much a given that someone will be playing Lore for the healing, so Distant Stars should be an auto-include."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1494778","commentId":1494778,"userName":"PocketWraith","timestamp":1426645288,"content":"I don't see how Athelas is going to make Rhosgobel easy when Healing Herbs already exist, not to mention Ally Elrond, Lore of Imladris, and in a pinch even Waters of Nimrodel. We have enough ways to instantly heal Wilyador for 5 as it is that one more really won't make a difference.\n\nDistant Stars, on the other hand, is a new way of messing with that quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137690-the-secret-defenders/?do=findComment&comment=1495084","commentId":1495084,"userName":"joezim007","timestamp":1426679800,"content":"I forgot that you cant heal more than 5 at a time, so I was just thinking that this was the cheapest way to heal all damage."}]}