{"url":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/","title":"Control of encounter cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1489816","commentId":1489816,"userName":"Bonarchie","timestamp":1426355058,"content":"Hi, all!\n\n \n\nI believe there is a rule discrepancy regarding the concept of controlling an encounter card.\n\n \n\nIn the rulebook (p.23) it is written explicitly that actions and responses can be triggered by their controller, while in the FAQ (1.06) it is clarified that players do not gain control of encounter cards unless control of the card is explicity granted by a card effect.\n\n \n\nIn accordance with the above, one can assume that you cannot optionally trigger actions and responses written in encounter cards, although this clearly contradicts the spirit of the rule (since there are many encounter cards printed with optional triggers).\n\n \n\nWhat is your opinion in the matter? I thank you in advance for your answers.\n\n \n\n(Note: English is not my native language. Also, this is my first post!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1490837","commentId":1490837,"userName":"alogos","timestamp":1426442889,"content":"Well, how can we have opinion?\n\nThe cards encounter cards with «action» are clearly meant to be used by players, and we do not control them. Either they have added in some rule of some ap pack that you can use action on encounter cards as you controlled them, or they never bothered explaining it more in details."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1490858","commentId":1490858,"userName":"GrandSpleen","timestamp":1426445172,"content":"They have indeed added a rule in an expansion.  From Khazad-dum's rule sheet: Encounter Cards with Actions An “Action:” on an encounter card in play can be triggered by any player, following normal restrictions on triggering abilities.\"\n\n \n\nWelcome to the community!\n\nEdited March 15, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1490868","commentId":1490868,"userName":"Bonarchie","timestamp":1426445669,"content":"Thanks for the answers !\n\n \n\nI never thought to look in the Khazad-Dum's rulesheet, since encounter cards with actions/responses\n\nhad already been printed for the Core Set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493442","commentId":1493442,"userName":"Davachido","timestamp":1426601012,"content":"I think this might be due to the fact the game assumes the encounter deck always triggers a response. (Since the deck can't 'choose' since it isn't a player.) In the core set there are only responses on encounter cards that are not objectives I think. The same can be said for encounter cards all the way through shadows of mirkwood. The first 'Action:' encounter card shows up with Khazad-dum and as Grandspleen pointed out that's when the rule first shows up.\n\n \n\nThe only 'actions' I can find on cards in the encounter deck from the core set are the three objectives in the third scenario and rules pertaining to how to use those actions fall under the guarded keyword on p.24, where it states you follow what the card says in order to claim it.\n\n \n\nSo other than clearing up possibly how responses are trigger by the deck (re; always) I don't see much of a rule conflict."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493484","commentId":1493484,"userName":"GrandSpleen","timestamp":1426602287,"content":"deleted nevermind!\n\nEdited March 17, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493646","commentId":1493646,"userName":"alogos","timestamp":1426609572,"content":"Well, Response are Response because you can choose not do them, so a Response on an encounter card is basically a Forced. There is indeed an overlook on the rule here. But the meaning can be safely assumed.\n\nEdited March 17, 2015 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493675","commentId":1493675,"userName":"Bonarchie","timestamp":1426610372,"content":"> So other than clearing up possibly how responses are trigger by the deck (re; always) I don't see much of a rule conflict.\n\n \n\nIMHO responses printed on encounter cards are optional (they don't trigger automatically, that's only true for forced effects). For example:  Old Forest Road and Forest Gate from the core set, and Bag End from The Black Riders.\n\n \n\nThe rulebook states (p.23 under Card Effects) that on the cards found in the quest and encounter decks, card effects fall into one of 6 categories: constant effects, forced and when revealed effects, shadow and travel effects, and keywords. I'm not sure why, but responses are excluded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493703","commentId":1493703,"userName":"Davachido","timestamp":1426611233,"content":"The first two you just stated don't contradict what I said. As the response triggers however the responses purposely have the word 'may' in them. So you don't have to do the trigger if you don't want to. Bag end I've always played as happening regardless as again, I think the deck always triggers the response. As if it was an optional response it would make playing something like Cair Andros very weird. I honestly think there is a distinction in the words for design space such as treachery cards that stop responses from being activated. So it's something they could add in Nightmare, similar to the recent incident with 'keywords' for the Balrog.\n\n \n\nI agree with you on your second paragraph, it isn't stated, though I don't see it as a rules conflict. Just that they forgot to clarify that the encounter deck can and does trigger responses. As all the responses on encounter cards can then specify the players and some clause to go with it if it's optional or not.\n\nEdited March 17, 2015 by Davachido"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1493837","commentId":1493837,"userName":"GrandSpleen","timestamp":1426614952,"content":"You guys are just agreeing without realizing it.  \"They forgot to clarify\" as Davachido pointed out, which leads to a \"rules conflict\" as Bonarchie contends, unless you assume something about that \"clarification.\"  And indeed it is an assumption that \"the encounter deck always triggers its responses\" such as Bag End!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/137863-control-of-encounter-cards/?do=findComment&comment=1495391","commentId":1495391,"userName":"Bonarchie","timestamp":1426693048,"content":"Hi, all!\n\n \n\nI sent a relevant question to Caleb, who answered that responses are always optional (even if printed on quest or encounter cards). They are triggered only if a player chooses so.\n\nEdited March 18, 2015 by Bonarchie"}]}