{"url":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/","title":"Distant Stars too powerful?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1495167","commentId":1495167,"userName":"Ecthelion III","timestamp":1426684776,"content":"I was reading through some of the past news articles and took another look at Distant Stars, the Lore event that was spoiled in the Escape from Mount Gram article.  It looks to be uber powerful.  Maybe I'm reading it wrong, but it looks like it could break Rhosgobel and smash some other quests pretty hard, too.\n\n \n\nAs far as I understand it, its text box says: “Exhaust a Ranger or Scout [hero/character] to discard a non-unique active location.  Then, search the encounter deck and discard pile for a non-unique location and make it the active location.”\n\n \n\nHere is a Top 5 list of quests for Distant Stars:\n\n \n\n \n\nTop 5 Quests for Distant Stars\n\n \n\n#1: A Journey to Rhosgobel\n\nBy using Distant Stars to bring copies of Forest Grove out, you can bring Athelas out quickly.  Simple but extremely powerful.\n\n \n\n#2: The Three Trials\n\nDo you hate lots of shadow cards and threat raising?  Me too.  Distant Stars can get rid of the pesky, but non-unique, Barrow locations (except on Trial of Strength).\n\n \n\n#3: We Must Away, Ere Break of Day\n\nSadly, the Troll Cave is immune to player card effects, but the Troll Camp, which is almost necessary to beat the quest, is not.  Many players wait around for this location to show up before facing the trolls, but with Distant Stars, the wait is over.\n\n \n\n#4: Conflict at the Carrock\n\nAlthough you can’t use Distant Stars to get Grimbeorn by use of the Bee Pastures, you can bring Oak-wood Grove out.\n\n \n\n#5: Flight from Moria\n\nI almost didn’t mention this one, but for the sake of completeness (and making the list a Top 5), I did.  There’s one card in particular that warrants this card’s inclusion, similar to the way Sleeping Sentry warrants A Test of Will’s inclusion, and that card is Dreadful Gap.  All of us who have played this quest multiple times know that having 3 victory points  and 10-20 quest points shoved in front of us isn’t an appealing prospect.  If you’re using Abandoned Tools on the last quest card, Dreadful Gap will act as a buffer until you can clear it, no matter how hard you’re trying to not travel to any locations.  Trying to clear it is a nightmare.  Once it is cleared, The Nameless Fear now has +3 threat.  Distant Stars can simply discard this location and bring Plundered Armoury out.\n\n \n\n \n\n \n\nOther cards Distant Stars would be good against: Gladden Marshlands, Impassable Bog, Eilenach, etc.  The List Goes Ever On.\n\n \n\nOne potential drawback might be the exhaustion of a Ranger or Scout.  If the card allows you to use an ally, Snowbourn Scout just found a new purpose in life.  If you have to use a hero, the Elladan/Elrohir brothers are perfect candidates.  Just pay a resource to ready one of them after attacking/defending and you can use Distant Stars in the action window at the end of the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1495232","commentId":1495232,"userName":"GrandSpleen","timestamp":1426687471,"content":"It's a cool effect but I wouldn't call it overpowered.  The most powerful use of the card that you listed above is in The Three Trials-- I was surprised to go back and find that those barrows are not unique!  Other than that, this card just shortens the \"waiting game\" that you have to play in some quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1495269","commentId":1495269,"userName":"alogos","timestamp":1426688669,"content":"Doesn't beat a Saruman on Nazgul of Dol Guldur or the like.\n\n \n\nI would like to add locking the game with Anduin's Bank. Search for two of them early enough and have galadriel to permanent threat stagnation. Enjoy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496024","commentId":1496024,"userName":"Gizlivadi","timestamp":1426711219,"content":"I think it's a pretty powerful effect, bot not overpowered. Nothing wrong with strong cards IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496367","commentId":1496367,"userName":"Ecthelion III","timestamp":1426723773,"content":"> Other than that, this card just shortens the \"waiting game\" that you have to play in some quests.\n\n \n\nSome quests, like NM Carrock, require you to hurry or die.  But you're right, a Balrog won't come along and kill you if you don't get a Troll Camp in the staging area the first round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496379","commentId":1496379,"userName":"PsychoRocka","timestamp":1426724218,"content":"> Doesn't beat a Saruman on Nazgul of Dol Guldur or the like.\n> \n>  \n> \n> I would like to add locking the game with Anduin's Bank. Search for two of them early enough and have galadriel to permanent threat stagnation. Enjoy.\n\nIsn't Nazgul of Dol Guldur unique now? Saruman doesn't do anything to it. \n\n \n\nI think distant stars will be a very powerful card as it can remove a location from staging OR as the active area and replace it with a much less harmful location or in many scenarios a positive or beneficial location. This can reduce overall threat in staging, remove a location that may lead to defeat or bring out a useful or needed location. Also like Ecthelion has pointed out it works marvellously well with Elrond's twin sons both of whom I use. If it allows you to exhaust a ranger or scout ally then it will be even more insane as you can exhaust a fairly unimportant ally and get this great effect. Based on the physical space left on the card (that has not been spoiled) and how overly powerful this could be I think it will definitely be exhaust a Hero. Especially since it also costs 0 resources.\n\nI feel like locations have always had the least player card support. There are so few cards that can effectively help against locations and are not either underpowered (Ravenhill Scout, Power in the Earth, Snowborn Scout) or very trait/deck specific (Warden of Arnor, Ancestral Knowledge, Short Cut).\n\nEven Asfaloth the ultimate location control card more or less requires that you run Glorfindel as a hero. Other than Asfaloth and Lorien Guide I personally do not run any other location control cards as they are either unplayable in my deck or simply do not seem useful/powerful enough for their cost. \n\n \n\nI think that perhaps the designers are seeing this and hence we are getting cards like Expert Trackers and Distant Stars. Expert Trackers is quite powerful and can clear a location instantly in many cases and can target the active location or one in staging much like distant stars. The only problem that I personally have is I play two handed and the deck that runs lore features Haldir and therefore attempts to engage as few enemies as possible, this means expert trackers is really not very good for my decks but I think distant stars will be an almost auto include as soon as its released. That way if I don't have Asfaloth or a Lorien Guide helping me clear a particularly nasty location I can instead just remove it from staging or as the active location and replace it with the least harmful/most beneficial location in that scenario. \n\n \n\nAnother thing worth noting is that locations in nightmare quests can be FAR FAR nastier than the nastiest of normal locations and I feel like more location support cards are needed to combat this as well.\n\nEdited March 19, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496495","commentId":1496495,"userName":"PsychoRocka","timestamp":1426730956,"content":"Also I have a few specific locations that I personally have had a lot of trouble with in nightmare quests that Distant Stars would be super helpful for. \n\n \n\nA Flooded Ford and Gladden Marshlands in Nightmare Journey Along the Anduin: One raises your threat every single encounter card reveal if it has any progress tokens on it and the other has 10 threat.... enough said!\n\n \n\nTorture Chamber in Nightmare Dol Guldur: Can lead to a defeat if it is not removed from play fast enough as it essentially \"kills\" any heroes that have been taken as prisoners and you consequently lose because of this. (Dungeon Labyrinth in this quest is also pretty nasty and it's threat and quest points can skyrocket to ridiculous levels) \n\n \n\nHives and Hives in Nightmare Conflict at the Carrock: Don't want every character in play to take 3 damage from clearing this location? Get rid of it with Distant Stars!\n\n \n\nBrambles and Thorns in Nightmare The Hills of Emyn Muil: This location does 1 damage to every character that commits to questing and has 5 quest points. It can often stay in play more than just one round especially if you don't have Asfaloth or something similar to deal with it and even more so if you cannot get it out of staging and into the active location slot. This can rack up damage on heroes and also force you to hold allies back from questing so they don't instantly die (and contribute no willpower to the quest phase) so removing this with distant stars could save your hide big time! \n\n \n\nThis is just Nightmare quests for the first cycle let alone for the second and third cycles both of which have just as many if not more nasty locations distant stars would be awesome for!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496546","commentId":1496546,"userName":"PsychoRocka","timestamp":1426734302,"content":"bleh absolutely no idea how but completely misread the card and didn't realise the location you discard must be the active location and cannot be a location in staging.... nowhere near as powerful. Often times you cannot travel to the specifically nasty location as you are location locked already or it has a nasty travel effect you cannot fulfil or actually want to avoid. \n\nMay not be adding this card to my decks after all haha. Still seems very good but definitely not as powerful as I thought and most certainly not overpowered. \n\nEdited March 19, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496671","commentId":1496671,"userName":"Ecthelion III","timestamp":1426740580,"content":"> bleh absolutely no idea how but completely misread the card and didn't realise the location you discard must be the active location and cannot be a location in staging.... nowhere near as powerful. Often times you cannot travel to the specifically nasty location as you are location locked already or it has a nasty travel effect you cannot fulfil or actually want to avoid. \n> \n> May not be adding this card to my decks after all haha. Still seems very good but definitely not as powerful as I thought and most certainly not overpowered.\n\nStrider's Path."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1496877","commentId":1496877,"userName":"monkeyrama","timestamp":1426756016,"content":"But still, that means that the card requires you to have another card in hand to make it more effective. It's not insanely powerful, but I can see that in specific scenarios it'll be a handy one to have around!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138214-distant-stars-too-powerful/?do=findComment&comment=1498207","commentId":1498207,"userName":"Gizlivadi","timestamp":1426817785,"content":"> bleh absolutely no idea how but completely misread the card and didn't realise the location you discard must be the active location and cannot be a location in staging.... nowhere near as powerful. Often times you cannot travel to the specifically nasty location as you are location locked already or it has a nasty travel effect you cannot fulfil or actually want to avoid. \n> \n> May not be adding this card to my decks after all haha. Still seems very good but definitely not as powerful as I thought and most certainly not overpowered. \n\n \n\nMakes Thrór's Map and Key much more interesting in Antlered Crown."}]}