{"url":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/","title":"Do you sleeve your cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1495694","commentId":1495694,"userName":"Star Lord","timestamp":1426701526,"content":"As a player of many card games in the past, I have a habit of sleeving my cards. I believe that it will allow your cards to be kept in good condition for years, as your hand can wear and tear the cards just by touching them over and over. I plan to sleeve the player's cards, but I can't decide if I should do the same for encounter cards, because every expansion and adventure pack has them, and buying sleeves for them will be expensive. So I'm curious to know if anyone would sleeve them or just play the cards as it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1495726","commentId":1495726,"userName":"Teamjimby","timestamp":1426702206,"content":"I don't sleeve any encounter/quest cards.  A particular encounter set doesn't see a whole lot of wear because there are so many encounters to choose from.  Plus, each card in a set receives similar amounts of wear so you won't end up with uneven wear that marks particular cards.\n\n \n\nI didn't even sleeve my player cards for the first 2+ years, but I started to be able to notice when a common card like test of will was on top of my deck.  So now I sleeve my player cards.  But now coming up on 3 years of playing encounter cards unsleeved, I have yet to notice any wear on those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1495794","commentId":1495794,"userName":"Bullroarer Took","timestamp":1426704574,"content":"Sleeve player and sometimes encounter. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1495811","commentId":1495811,"userName":"Olorin93","timestamp":1426705084,"content":"I sleeve all encounter and quest cards, but only player cards I use. There are lots of heroes and events that never see play for me.\n\n \n\nI didn't sleeve encounter cards for a long time, but when I started buying nightmare packs it was pretty much a necessity (and recommended on the packaging) because the texture and colour is slightly different compared to the normal cards and knowing what might come gives you a slight advantage. And once a few scenarios were sleeved, I had to either keep sleeving or remove sleeves depending on set combinations... so, almost everything from Passage Through Mirkwood to The Antlered Crown is sleeved in FFG's transparent sleeves. For player cards I use ultra-pro's matte ones, in different colours to tell different decks apart.\n\nEdited March 18, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1495955","commentId":1495955,"userName":"Thanatopsis","timestamp":1426708955,"content":"I sleeve my player cards with a quality sleeve (FFGs card game sleeve but there are several good options). However, I sleeve the encounter cards with penny sleeves.\n\n \n\nMy thought process being that I touch and shuffle the player cards much more and they need a hardier sleeve to withstand the abuse. The encounter cards spend almost no time being touched or slid and only occasionally are shuffled. \n\nEdited March 18, 2015 by Thanatopsis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496047","commentId":1496047,"userName":"MyNeighbourTrololo","timestamp":1426711909,"content":"No I don't. But I would, if I had means to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496109","commentId":1496109,"userName":"Gizlivadi","timestamp":1426714467,"content":"I've always found this cards to be a little uncomfortable, at least compared to Magic or other card games. Too thin, the edges too sharp and brittle (there's something about the guillotine they use I don't like). That's why I try to sleeve all my encounter cards, but recently I've been unable to find good cheap sleeves for them so I just decided to play them unsleeved. It's not so bad for encounter cards, but I still sleeve all my decks.\n\nEdited March 18, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496386","commentId":1496386,"userName":"PsychoRocka","timestamp":1426724640,"content":"My player decks are sleeved but no encounter cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496420","commentId":1496420,"userName":"TwiceBorn","timestamp":1426726351,"content":"I sleeve player cards that are in my \"current\" decks, or that I make frequent use of (rotating in and out of decks).\n\n \n\nI tend to play and replay the scenarios from a given deluxe expansion and associated cycle over and over with different decks, usually over a period of several months. During that period, I sleeve all the encounter cards from that expansion and related APs. Once I am ready to move on to a new expansion/set of APs, I unsleeve the encounter cards from the deluxe expansion/APs I have just finished playing, then proceed to sleeve the cards from the next expansion/cycle as I play the new set of quests. That way, I get to protect my encounter cards, while only having to unsleeve/resleeve them every few months, which is not too onerous.\n\n \n\nI use the FFG One Ring and Eye of Sauron art sleeves for obvious reasons. \n\n \n\nEDIT: Not having all cards in my collection (player and encounter) sleeved at all times evidently saves me money too… sleeves get expensive after a while!\n\nEdited March 19, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496497","commentId":1496497,"userName":"soullos","timestamp":1426731187,"content":"I sleeve all my cards with FFG clear sleeves, expect for NM encounter cards (they're unsleeved and stored in a Dragon Shield clear case box). I'm still working through easy mode, so I won't be needing NM anytime soon. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Sleeving everything is expensive. I tend to buy one huge order to last me the whole year, but I rather buy sleeves than rebuy the cards if they get damaged from wear and tear. I like that peace of mind. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496914","commentId":1496914,"userName":"Gandalf_","timestamp":1426761336,"content":"I only sleeve the decks we are using (player cards). The rest are stored in binders. I don't sleeve the encounter cards. There's no use to that. The don't see much action after all and sleeving them all would be extremely expensive especially for an LCG-model game. \n\nEdited March 19, 2015 by dimile"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496951","commentId":1496951,"userName":"TwiceBorn","timestamp":1426764467,"content":"I guess I must play and replay and replay the same quests more than other players do… trying to get the most bang for my buck!  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496961","commentId":1496961,"userName":"gandalfDK","timestamp":1426764886,"content":"All player sleeved with FFG clear sleeves.\n\nOnly current encounter deck sleeved with FFG clear sleeves. This option is nice so you don't have to buy an insane amount of sleeves for all encounter cards but you can just circle arouns with the sleeves you have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1496967","commentId":1496967,"userName":"Ecthelion III","timestamp":1426765254,"content":"> All player sleeved with FFG clear sleeves.\n> \n> Only current encounter deck sleeved with FFG clear sleeves. This option is nice so you don't have to buy an insane amount of sleeves for all encounter cards but you can just circle arouns with the sleeves you have.\n\nExactly what I do, too.\n\nThe FFG sleeves are good quality, but the shipping costs..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1497008","commentId":1497008,"userName":"Eldainorn","timestamp":1426769121,"content":"I am sleeving all encounter and quest cards with clear sleeves (as cheap as it gets, there are a lot of cards now). For player cards I use FFG Nazgul sleeves or Ultra Pro Matte black sleeves. Player cards not in use are not sleeved just stored in a box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1497168","commentId":1497168,"userName":"-Istaril","timestamp":1426776678,"content":"My encouter and quest cards are all sleeved in clear sleeves (yeah, I haven't started buying nightmare yet, I'm going to regret that - but I love the card back). My player cards are kept in binders, except my active decks (2-3) in opaque sleeves. All heros are sleeved at all times in a sleeve colour fitting their sphere. \n\nEdited March 19, 2015 by -Istaril"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1497279","commentId":1497279,"userName":"Thanatopsis","timestamp":1426780518,"content":"> All heros are sleeved at all times in a sleeve colour fitting their sphere.\n\nOh, I like this. Too many times have I shuffled my heroes into my deck and had to search for them.\n\nEdited March 20, 2015 by Thanatopsis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1497482","commentId":1497482,"userName":"divinityofnumber","timestamp":1426786292,"content":"I use regular UltraPro sleeves for my player decks and the much cheaper, clear, penny sleeves for the encounter cards. If you order through somewhere like Amazon.com, you can get 1,000 clear sleeves for a cheap price. For about 15-20 USD you can sleeve every encounter card ever printed. \n\n \n\nExample:\n\nhttp://www.amazon.com/Sleeves-Sleeve-Baseball-Sports-Packaging/dp/B000Y4HI7A/ref=sr_1_1?ie=UTF8&qid=1426786272&sr=8-1&keywords=ultra+pro+penny+sleeves [http://www.amazon.com/Sleeves-Sleeve-Baseball-Sports-Packaging/dp/B000Y4HI7A/ref=sr_1_1?ie=UTF8&qid=1426786272&sr=8-1&keywords=ultra+pro+penny+sleeves]\n\nEdited March 19, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1504074","commentId":1504074,"userName":"jormungandr","timestamp":1427210858,"content":"I sleeve my decks and my favourite encounter decks. See through hard sleeves. Nothing fancy here. A bit annoying with the NM packs though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1504106","commentId":1504106,"userName":"Glaurung","timestamp":1427212160,"content":"I sleeve all my lotr cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1504135","commentId":1504135,"userName":"Eryx_UK","timestamp":1427213167,"content":"All mine are sleeved and you can fit three sleeved cards into the pockets of A4 deck sleeves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138236-do-you-sleeve-your-cards/?do=findComment&comment=1505184","commentId":1505184,"userName":"chuckles","timestamp":1427253246,"content":"All my player cards are sleeved with clear sleeves (FFG), quest cards clear, hero's white sleeves and before I ran out of time, for all things games related, I started sleeving the encounter decks too. Initially using a different colour for each encounter cycle...\n\nEdited March 25, 2015 by chuckles"}]}