{"url":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/","title":"Deep in the Shadows of Mordor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498018","commentId":1498018,"userName":"Ecthelion III","timestamp":1426807788,"content":"https://fantasyflightgames.com/en/news/2015/3/19/deep-in-the-shadows-of-mordor/ [https://fantasyflightgames.com/en/news/2015/3/19/deep-in-the-shadows-of-mordor/]\n\n \n\nWhat do you think?  Personally, I'm going to use Palace Remains (from Assault on Osgiliath Nightmare) in my non-Nightmare games so the quest is playable solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498065","commentId":1498065,"userName":"PsychoRocka","timestamp":1426810412,"content":"Jesus, more nightmare already, they are absolutely pumping these out. \nAt this rate I wouldn't be surprised if the nightmare pack for Voice of Isengard comes out before the first AP for the Angmar Awakened cycle!!\n\nSome of the art for these packs is utterly amazing. Haradrim Warrior and Warrior of Nurn look epic!\n\nAlready having plenty of trouble beating the other AtS nightmare decks and these look even more diabolical....\n\n \n\nEastern Quarters ability I find really clever and new; when you cancel the when revealed effects of an encounter card you lose control of the location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498147","commentId":1498147,"userName":"PsychoRocka","timestamp":1426814784,"content":"Also Nightmare Morgul Vale could very well be MORE manageable than the normal version of the quest for my decks as the captains are what I have least trouble with and the massive threat gains and couple of enemies worse than the captains is where the real difficulty lies for me. If the nightmare version removes some of these and replaces them with cards that focus on the captains and placing progress on to the tower instead, eg: Noxious Fumes, Warrior of Nurn etc it may end up making the quest not necessarily easier but at least easier to beat without threating out or having to face x2 of The Masters Malice or Orc Vanguard in a single turn. We will have to wait and see what cards are taken out and replaced! \nI feel like this has been done to an extent with most of the AtS and Heirs nightmare decks which I think is really clever. \nThey are still making them more difficult but in a more traditional way and spread out across all encounter cards rather than just 3 or 4 especially bad cards that more or less spell defeat when they appear. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498151","commentId":1498151,"userName":"Authraw","timestamp":1426814966,"content":"> Personally, I'm going to use Palace Remains (from Assault on Osgiliath Nightmare) in my non-Nightmare games so the quest is playable solo.\n\nI had the exact same thought when I read the article. This quest was so easy for our 2 player games that it really felt like a dud."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498199","commentId":1498199,"userName":"Chris51261","timestamp":1426817145,"content":"They're really impressing me with these recent Nightmare releases. I'm glad they fixed Assault on Osgiliath being vulnerable to turn 1 victories, and the last two quests it appears that they really focused on making the core mechanics of the quests more impactful. Really, really cool looking, can't wait for them to arrive. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498200","commentId":1498200,"userName":"Gizlivadi","timestamp":1426817229,"content":"I care very little on the actual mechanics and how horrible these cards are... I'm much more interested in the art and theme. And even with that I'm always in love with the Nightmare decks. The art is much improved as always and the actual enemies are creative and cool. I mean, just look at those human enemies, the Haradrim Warrior, Black Númenorean and especially the Warrior of Nûrn. Actual human \"Mordorians\" and allies of Mordor are really interesting and cool IMO, and they nailed it with those. My only doubt though is whether a generic \"Black Numenórian\" enemy as a unique boss is thematic or not. I mean, there wasn't only one or a couple, they were a sizable faction if I remember correctly, and probably some had names (even though I admit the Mouth of Sauron is the only individual Black Númenorean mentioned and he had forgotten his name.). But still, It'd be cool to have human bosses that are FFG invented, like the whole 3 we have (as opposed to so many orcs/trolls).\n\n \n\nAnyway, these new Nightmare decks actually I would buy for the theme and art alone, although I would certainly try them with Silvans which I still haven't mastered or some powerful aggro deck.\n\nEdited March 20, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498226","commentId":1498226,"userName":"PsychoRocka","timestamp":1426819029,"content":"My Silvan/Noldor two handed decks are struggling pretty hard Gizlivadi. Definitely doable beating these new nightmare quests with Silvan decks but probably quite hard to do so... Other aggro deck types may do a lot better. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498247","commentId":1498247,"userName":"PsychoRocka","timestamp":1426821083,"content":"I'm tempted to try and find a full print of Warrior of Nurn or Sentry of the White Bridge for sale!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498251","commentId":1498251,"userName":"Chris51261","timestamp":1426821265,"content":"The Nazgul is going to be crazy with more cards to support him. I can already see a Warrior of Nurn popping up and healing him when he has 4 damage, lol. I just recently played through Morgul Vale and remember thinking a few of the cards I was glad to see and how those would be gone in the Nightmare version, so we'll see!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1498260","commentId":1498260,"userName":"PsychoRocka","timestamp":1426821602,"content":"Oh man didn't even think of that......... thats insane!!!!!! \n\nGotta take them out the turn they enter play and pray they don't show up as shadow cards or that you have a hasty stroke ready!\n\nEdited March 20, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1499685","commentId":1499685,"userName":"Chris51261","timestamp":1426891696,"content":"Yeah, Morgul Vale was a quest I felt okay not running 3 copies of Hasty Stroke, but now it's out of the question for the most part. Having to deal with the Nazgul for extra turns doesn't sound like something I want to be a part of, lol. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138371-deep-in-the-shadows-of-mordor/?do=findComment&comment=1500093","commentId":1500093,"userName":"Glaurung","timestamp":1426922277,"content":"What can I say! Amazing probably rhe best cycle become even better! Nightmare art is really deep Tolkieb shot! Cannot wait!"}]}