{"url":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/","title":"Thalin + Forceds/Keywords/...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1503831","commentId":1503831,"userName":"Jban","timestamp":1427195851,"content":"Hi all,\n\n \n\ndespite this situation has been chewed on many times I still get confused by what exactly happens. So therefore this topic with some examples such that I get it correct from now on. I'll describe how I interpret the situation and if I'm wrong please tell me. All situations are pretty similar from a certain point of view, but I thought it was useful if others read this threat the situation they triggered is covered.\n\n \n\nMy understanding of the rulings tell me that the priority is as follows:\n\n \n\nPassive Text > Forced (+When Revealed, Keywords) > Responses. \n\n \n\nSituation 1: Thalin vs Eastern Crows\n\nThalin.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Thalin.png]                    Eastern-Crows.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Eastern-Crows.png]\n\n \n\nBecause Thalin is committed to the quest, he will kill the eastern crows before the surge Keyword triggers. Secondary the forced of Eastern crows will not be triggered because the passive text outruns him. So despite the crows are the destroyed, the Forced will not trigger because it is secondary in priority and will never be reached.\n\n \n\nThis seems very strange to me but if I follow the priority scheme this seems the correct interpretation.\n\n \n\nSituation 2: Thalin vs Goblin Archer\n\n \n\nGoblin-Archer.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Goblin-Archer.png]\n\n \n\nThe players don't have to deal damage for the archer, because it's forced is not triggered.\n\n \n\nSituation 3: Thalin vs Crazed Captive\n\n \n\nCrazed-Captive.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Escape-From-Dol-Guldur-Nightmare/Crazed-Captive.jpg]\n\n \n\nThe players don't have to raise their threat by 7, nor does the Doomed 1 trigger.Maybe not that bad to run the dwarf to prevent this incredible raise.\n\n \n\nSituation 4: Thalin vs Toughness\n\n \n\nUruk-hai-Tracker.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Road-Darkens/Uruk-hai-Tracker.jpg]\n\n \n\nDespithe the Uruk-Hai tracker having the Toughness Keyword he will still suffer the damage of Thalin, next to that it is also possible to kill these enemies with toughness when combined with Expecting Mischief.\n\n \n\nConclusion:\n\nDespite there are no Eastern Crow loops possible in Journey down the Anduin, that first sting of Thalin seems to be very efficient weapon against all other kind of malice. Nothing is as fast as Thalin and therefor nothing gets triggered either. I really think it is somewhat strange myself but if you just follow the priority rules it looks like it works like this. Any confirmation or explanation if I'm wrong would be nice. \n\n \n\nGreetings,\n\nJban\n\nEdited March 24, 2015 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1503960","commentId":1503960,"userName":"Teamjimby","timestamp":1427205757,"content":"I know the first two are right, but I'm not so sure about the last two."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1503992","commentId":1503992,"userName":"alogos","timestamp":1427207774,"content":"The fact that keyword are placed before everything else doesn't mean it doesn't happen.\n\nSure you should resolve line by line, but when you have 3 distinct keyword/effect, you should read all of them to know wich one will have to happen.\n\nIn the exemple of Eastern Crow, they are killed before surge because of thalin's passive, however, they are defeated and their text should happen.\n\nIT IS NOT SECOND IN PRIORITY.\n\nIt just happen on another trigger. It is killed before being revealed, meaning no surge, but it is still defeated.\n\nSo you'll also take the 7 threat of Crazed Captive.\n\nAnd I don't see why Uruk-hai Tracker should take a damage.\n\nAgain, Surge happen as when revealed (keyword are shortcut, not passive), but the passive of Toughness will work.\n\nIf we follow what you said, that means Thalin could deal damage to immune to players card effect ennmies that are revealed. Well, that would be wrong too.\n\n \n\nPassive Text > Forced (+When Revealed, Keywords) > Responses is right, but :\n\n1- Keyword are shortcut to other Forced, Passive or other effect.\n\n2- Forced/Response are not skipped if previous paragraph don't trigger. \n\n \n\nEdit: And yes, Thalin can stun the game, and it's lame... no dead loop though, as surge is not triggered.\n\nEdited March 24, 2015 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504014","commentId":1504014,"userName":"GrandSpleen","timestamp":1427208752,"content":"Agree with alogos on all of the above.  Thalin defeats the enemy before you are required to resolve the Surge or Doomed keyword, so you never have to resolve the Surge/Doomed.  But those 'when defeated' Forced triggers will still trigger, as they trigger off of the enemy... being defeated!  Which is what Thalin does.  It's not a question of timing.  And the Toughness on the Uruk is active as long as the Uruk is in play, it's a passive effect with no trigger.  The 'trigger' for other keywords, such as Surge, is being 'revealed.'  Thalin's ability triggers before those, but Toughness has no trigger and is active as soon as that card comes out of the deck.  Thalin will do no damage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504158","commentId":1504158,"userName":"Jban","timestamp":1427214171,"content":"So its all within the exact wording of the keyword ? If the keyword is worded as a \"when enters play\" Thalin will shut it down and otherwise it will still be resolved? At least it's an explanation I can work with. Thanks a lot!! I'll go through my keywords then and then I'm ready to go. I didn't know how to solve all, so therefor always picked the worst case. But since this wasn't consistent on the first 2 situations I had to ask it in here to be sure.\n\n \n\nStill somewhat confused upon the crow loop, since I meant I read some Caleb answer to this on Boardgamegeek, that's it not possible. Probably some mistake, or a revised statement. (Some reply to this is still welcome)\n\nThanks,\n\nJban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504164","commentId":1504164,"userName":"GrandSpleen","timestamp":1427214275,"content":"The Crow loop isn't possible simply because the card won't surge.  You'll have the crow come out, he'll be defeated and go back into the deck, but you won't get an infinite loop because there's no infinite surge thing going on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504217","commentId":1504217,"userName":"Jban","timestamp":1427215896,"content":"Encounter deck: only 2 crows. --> eternal loop?\n\nEdited March 24, 2015 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504276","commentId":1504276,"userName":"-Istaril","timestamp":1427217418,"content":"No, because they don't surge. First one is revealed, killed by Thalin, shuffled back into the deck. Repeat for each card you have to reveal (normally one per player): you'll reveal nothing but Crows, they'll all die, but as none will surge, you get no loop.\n\n \n\nNow, if you have no enemies in play to use them as shadow cards, no card effects that put encounter cards in play at times other then when Thalin is Questing (or does so without revealing them), then yeah... you'll have a pretty clear path to victory, facing only the crows for the rest of the game. That's still not an endless loop though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504351","commentId":1504351,"userName":"alogos","timestamp":1427219535,"content":"Don't forget to add Galadriel to lower your threat by one each turn, and you can take the loop to the number you want.\n\nAlso, from the new faq, the loop now require only 1 crow, because now, don't know why they changed that, you don't reshufle as soon as you draw the last card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1504722","commentId":1504722,"userName":"GrandSpleen","timestamp":1427231679,"content":"Good point alogos, I forgot about that change.  But THAT's a tricky timing question... will the crow's Forced effect really precede reshuffling the encounter deck?  That Forced effect is not a part of the card's \"staging,\" is it?\n\n \n\nFor others, alogos is referring to:\n\n \n\nQ: When I reveal the last card of the encounter deck, do I immediately reset the quest deck before resolving the staging of the revealed card?\nA: No. Resolve the staging of the revealed card, including any ‘When Revealed’ effects, before resetting the quest deck, if able. If you are unable to completely resolve the staging of the card because it instructs you to interact with the encounter deck in some manner, then reset the quest deck and finish resolving the effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1506289","commentId":1506289,"userName":"leptokurt","timestamp":1427311069,"content":"> Don't forget to add Galadriel to lower your threat by one each turn, and you can take the loop to the number you want.\n> \n> Also, from the new faq, the loop now require only 1 crow, because now, don't know why they changed that, you don't reshufle as soon as you draw the last card...\n\nWut?????\n\n \n\nDoes that mean that if the encounter deck is empty at the end of the quest phase I don't have to deal any shadow cards later on?\n\n \n\n(sorry for hijacking the thread...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1506475","commentId":1506475,"userName":"GrandSpleen","timestamp":1427317792,"content":"No, you will still need to reshuffle the encounter deck discard pile when it is empty at any point during the quest phase.  It just doesn't interrupt staging of the card currently being revealed.  Previously, we had been doing the reshuffle \"immediately\" per the core manual, as in before carrying out 'When Revealed' actions on the card you just revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1511168","commentId":1511168,"userName":"leptokurt","timestamp":1427524761,"content":"> No, you will still need to reshuffle the encounter deck discard pile when it is empty at any point during the quest phase.  It just doesn't interrupt staging of the card currently being revealed.  Previously, we had been doing the reshuffle \"immediately\" per the core manual, as in before carrying out 'When Revealed' actions on the card you just revealed.\n\nOk, that sounds much better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=1511346","commentId":1511346,"userName":"PsychoRocka","timestamp":1427545119,"content":"> No, you will still need to reshuffle the encounter deck discard pile when it is empty at any point during the quest phase.  It just doesn't interrupt staging of the card currently being revealed.  Previously, we had been doing the reshuffle \"immediately\" per the core manual, as in before carrying out 'When Revealed' actions on the card you just revealed.\n\nHowever if only one or two cards remain in the encounter deck at the end of the quest phase but there are several enemies in play only a few will be dealt shadow cards during combat and the rest will not. I have had this happen a few fair times and love when it does as it provides a momentary respite from nasty shadow effects!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138736-thalin-forcedskeywords/?do=findComment&comment=2407729","commentId":2407729,"userName":"Seastan","timestamp":1473461307,"content":"From Caleb:\n\n \n\n>  \n> \n> Toughness will cancel Thalin’s damage."}]}