{"url":"https://community.fantasyflightgames.com/topic/138710-questing-points-versus-text-newbie/","title":"questing points versus text?? newbie","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138710-questing-points-versus-text-newbie/?do=findComment&comment=1503447","commentId":1503447,"userName":"alexbobspoons","timestamp":1427154365,"content":"So my set hasnt arrived yet but i am trying to get used to the rules via the downloads, thus newbie question.\n\n \n\nOn questing, it says you need to meet the questing points total but also the text may have extra rules. It then shows a quest card 3b think its something like stay on the path. The text looks to say you need to find and kill spawn of ungoliant to win.\n\nSooo\n\nDo you:\n\n1: need to complete the number of quest points AND kill ungoliant spawn? (Cant see quest point number as silly arrow in the way in the rulebook)\n\nOr\n\n2: complete number of quest points OR kill ungoliant (granted it implies you have to kll ungoliant spawn)\n\nAnd\n\n3: what happens if the ungoliant spawn card has been dealt as a shadow card and then dissapeared into the discarddeck? Its gone? Do you then have to go through the rest of the deck before being able to reshuffle the discards (complete with ungoliant spawn) back into the encounter deck?\n\n \n\nI know these questions might seem silly, sorry, newbie.\n\nJust not too sure from the text of online rulebook and the ffg faq dudnt have anything.\n\n \n\nThanks for advice.\n\n \n\nEdit: looking on the card database, the quest/scenario has two 3a/3b cards, dont leave the path but also beorns path. If the number is supposed to dictate the order they appear in, then how come they are both 3, which comes first? Why isnt one 3 and the other 4? \n\nEdited March 23, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138710-questing-points-versus-text-newbie/?do=findComment&comment=1503503","commentId":1503503,"userName":"PocketWraith","timestamp":1427157042,"content":"To complete a quest card you need progress on it equal to the quest points and to satisfy any other conditions on the card (usually - there are occasional exceptions, but those tend to have fairly clear card text, like \"Once [condition to be fulfilled], immediately advance to the next stage.\")\n\nIn the case of Passage Through Mirkwood, if you look at quest card 2, you'll see it says \"Forced: \"When you defeat this stage, proceed to one of the 2 \"A Chosen Path\" stages, at random.\" That's why there are two, and you only need to complete one of them to win the game.\n\nAnd returning to the initial question with respect to this particular quest, you do need progress and other conditions - but the quest card which requires you to kill Ungoliant's Spawn has 0 quest points and has you immediately search the deck for Spider enemies and put them into play, so you can pull out US rather than risk losing it as a shadow card; whereas the other requires 10 progress and only requires US to not be in play - so you don't need to worry about it unless you reveal it during regular staging, at which point you will need to get rid of it somehow in order to win the quest.\n\nEdited March 24, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138710-questing-points-versus-text-newbie/?do=findComment&comment=1503749","commentId":1503749,"userName":"alexbobspoons","timestamp":1427178702,"content":"Awesome thank you that all makes perfect sense.\n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138710-questing-points-versus-text-newbie/?do=findComment&comment=1503787","commentId":1503787,"userName":"Olorin93","timestamp":1427187841,"content":"Adding to that, if you've already encountered and defeated Ungoliant's Spawn during the game and the \"Don't Leave the Path!\" version of 3B shows up, the fastest way to win if you're sufficiently prepared is to dig her out of the discard pile and defeat her again. A very common question among new players is whether they win automatically if they've already defeated or discarded her, but you need to beat her during stage 3 specifically."}]}