{"url":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/","title":"Difference between these sleeves please?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1506593","commentId":1506593,"userName":"alexbobspoons","timestamp":1427322705,"content":"Ok, hoping you folks know more than me here.\n\n \n\nId like to sleeve all my cards, Im like that.\n\n \n\nI already have a box of about 1000 of these:\n\nhttp://www.ultrapro.com/product_info.php?products_id=1005 [http://www.ultrapro.com/product_info.php?products_id=1005]\n\nSo it makes sense to use them. They fit just great and feel/look great. No reason not to use them when I have them sat doing nothing (taken off a card collection I wanted in binders).\n\nThe box I have seems to match these and they have the little hologram on.\n\nWaste of money if they dont get used.\n\n \n\nBut.. they are (Ill use usa pricing) $3 for 50 which equates to $6 per 100 (yay maths)\n\nwhereas, these others are $5 for 100 and seem similar-ish: http://www.ultrapro.com/product_info.php?products_id=1073 [http://www.ultrapro.com/product_info.php?products_id=1073]\n\n \n\nand yet, these are only $2 for 100 : http://www.ultrapro.com/product_info.php?products_id=632 [http://www.ultrapro.com/product_info.php?products_id=632]    and are \"premium\" so are they all that different??\n\n \n\n \n\nSo part of me wants to get exactly the same ones so they all match perfect and nothing looks off when shuffling and playing etc. But the prices just seem odd.\n\nIm not really aware of the difference between \"Soft Sleeves\", \"Deck Protectors\" and \"Board Game Sleeves\"\n\nIs it just minor millimeters here and there? or also thickness/grade of plastic, or something else too?\n\nThey all have nice write-ups but dont really tell you the comparative differences. So I am a bit lost really.\n\n \n\nId appreciate some info from those with more experience if you have the time please. Thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nPS: If I didnt already have so many, Id just choose one and stick with it and never have a need for this thread, but $60 worth of sleeves need using.\n\n \n\nThanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1506710","commentId":1506710,"userName":"Thanatopsis","timestamp":1427327494,"content":"Your first link is to board games sleeves. These will not fit LotR LCG cards. This game uses card game sleeves. Perhaps you copied the wrong link? Board game sleeves are the same height but a little thinner.\n\n \n\nYour third link is to what most folks call \"penny sleeves\". These will protect your cards from wear but they are difficult to shuffle and age very quickly. The beauty is that they are cheap to replace. The use of \"Premium\" is just advertising. With that said I sleeve my encounter cards with these to keep costs down.\n\n \n\nYour second link is for what most strategy card game players use. This is an example of a quality sleeve that will stand up to shuffling and handling quite well. Your quoting 5 cents per sleeve which is a little on the low end for quality sleeves. You can pay up to ten cents for Dragon Shields.\n\n \n\nAs for nomenclature, you want soft sleeves. Hard sleeves (a term rarely used in these circles) is used for rigid protection. They are not shuffleable. You put your Babe Ruth rookie card in these things. \n\n \n\nDeck Protector is an Ultra Pro term for high-quality card game sleeves. It's like refering to facial tissue as Kleenex"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1506844","commentId":1506844,"userName":"Thanatopsis","timestamp":1427333204,"content":"I just noticed that your link is for European Board game sleeves, these are narrower than LotR cards, but also taller. I hope you're into Euro-gaming... or Illuminati ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nMayDay Games has a good tool for figuring this all out (see below). Dark Green is what you want for LotR LCG (or any FFG LCG for that matter).\n\nBased on your first link, European Board Game sleeves are the purplish blue\n\n \n\nFFG has a really good color coded system for their sleeves. LotR LCG packaging tells you that you need 'N' 50 card packages of grey sleeves. FFG sells their American Card Game Sleeves in grey packaging. \n\n500px-Sleeve-Chart.jpg [http://wtactics.org/wiki/images/thumb/a/a5/Sleeve-Chart.jpg/500px-Sleeve-Chart.jpg]\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1507136","commentId":1507136,"userName":"alexbobspoons","timestamp":1427352563,"content":"Thanks very much great info.\n\nThe ones I already have do have the \"euro\" and \"board game\" as the title on the box (maybe they were boxed wrong) and seem a great fit.\n\n \n\nHaving so many of these to use, I dont think I want to swap to another manufacturer and have differences.\n\n \n\nSo I need to either use the ones I have for decks and the ultradeck \"pennys\" for encounters, or just get the deck ones for everything.\n\n \n\nHere in uk, the ultradeck deck ones seem to be £2 per 50 (£4 per 100) wheras the ultradeck pennys are £5 per 500 (£1 per 100) so quite a cost diff.\n\n \n\nMight buy some penny ones :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThank you very much\n\n \n\nEdit: bought 1000 penny ones for £8 for encounter decks. Should keep me going a while along with the 1000 heavier duty ones ive got. Just need to resleeve all those new encounter cards I sleeved last night now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited March 26, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1507503","commentId":1507503,"userName":"Teamjimby","timestamp":1427380453,"content":"FYI, there are currently around 1,800 encounter cards and 1,200 player cards.  So if you have or are getting a full set you'll want another 1,000 penny sleeves and some more of the ones you already have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1507698","commentId":1507698,"userName":"monkeyrama","timestamp":1427386740,"content":"Seriously. That many?  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png] No wonder I'm running out of space..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/138895-difference-between-these-sleeves-please/?do=findComment&comment=1508309","commentId":1508309,"userName":"alexbobspoons","timestamp":1427407948,"content":"Ill be getting a full set, just not all at once :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n(Though ive spent a bit this past two weeks!!)"}]}