{"url":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/","title":"Lost Realm mini thoughts","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1526561","commentId":1526561,"userName":"Autobot Tran","timestamp":1428119087,"content":"heyo! first post but ive been playing this game since the end of the khazad dun cycle, I have everything and have been enjoying it since. I just wanted to start off by saying, man this game has humbled me! I've been playing competitive games for a very long time. Been doing FNM regionals and states and frequently top 8 but dang for some reason i cant wrap my head around this game! maybe its because its not competitive so I make more thematic decks? (thats what i tell myself at least)\n\n \n\nPlayed so far all three scenarios 1-handed solo.\n\n \n\nIntruders in Chetwood - This quest was pretty straight forward. You start off with a beast of an enemy in the staging area, but the quest card reads \"enemies dont make engagement checks\" so it is possible to build up your board position for a bit. this quest was fun but nothing spectacular, I think it did a good job to setup the scene of the story and introduce us to quest cards. Took it down on my second try.\n\n \n\nThe Weather Hills - In this quest you make an \"orc encounter deck\" and a regular encounter deck. You're chasing down some orcs and everytime you clear a new location you reveal an enemy from the orc deck. The original encounter deck has mostly locations and a few \"weather\" cards that all surge if its the first weather card you encountered. This quest was nasty! I half enjoyed and half had a headache all day from it. The key to this quest is make sure your characters dont have damage on them. Thematically i suppose youre going through harsh climates and the weather is having very adverse effects on your party.\n\n \n\nI enjoyed the pacing of this one because you know when youre about to flip over an enemy because you more or less know when you will clear a location. however I did get location locked a few times in this quest which was frustrating. (im sure i can retool my deck or travel decisions to help this, but it was still an issue with a few decks i had) Beat this guy once out of 4ish plays.\n\n \n\nDeadmen's Dike - WOWzas! this one is pretty awesome thematically. Fighting against ghosts and they are draining your deck (life force maybe?) away. Some conditions make it harder for you to play cards from your hand if a copy is in your graveyard, some shadow effects trigger based on cards in your graveyard. Really like the theme and it felt a lot different having to worry about my deck size. I really had to think if it was worth using my draw spells etc. although the answer is probably still always yes.  Anywho this quest was bonkers hard.\n\n \n\nOnly played it twice so far and while i really like the feel of it thematically and how it feels different with handling your graveyard it was a struggle to play. There are so many triggers that trigger based on cards in your graveyard and so many end of refresh phase triggers it really felt like a lot of book keeping (I didnt enjoy a lot of the book keeping form the locations and time counters from last cycle too much) so thats really the only gripe for me. Definitely want to fine tune my decks and knock this quest out\n\n \n\nPlayer cards  - I love the numenorean player cards! they make me feel so powerful. each dude has at least 1 fatty stat which is awesome. cant wait to see more player cards from this cycle. Some of the cards seem overcosted but there are a few attachments that help lower the cost of numenorean allies.\n\nQuest cards - the quest cards that come as player cards is awesome. 4 travel cost and once you complete it each player may search their deck for any card. \n\nas for the quest cards that are in the encounter deck... I was under the impression that they were \"side quest\" type things like in video games where you usually get a reward for doing it... maybe a shiny new equipment! lol that is not the case the quest cards that come off the encounter deck might as well be mandartory they are so brutal if they stay in the staging area. they are so restrictive... plus they all surge! wild. but i still love that they are designing new card types. \n\n \n\nOverall - really digging the expansion. I actually read the story and am interested in where its headed. The numenoreans feel like theyre powerful and not just dorky little bodies. Downside is theres a bit too much bookkeeping for my tastes and dang its friggin hard... and i would feel dirty if i played easy mode lol \n\nEdited April 4, 2015 by Autobot Tran"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1526669","commentId":1526669,"userName":"Glaurung","timestamp":1428125703,"content":"Sound cool! This cycle looks very ok."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1526714","commentId":1526714,"userName":"Pharmboys2013","timestamp":1428126785,"content":"I've only attempted the 1st and 2nd quest in two player and have gotten stomped.  I used a Halbarad, Sam, Pippin deck and my friend used Aragorn (tactics), Elladan, Elrohir.  I was pleased with the build of my pseudo-hobbit deck but as soon we had finished the first turn of \"intruders in chetwood\" I realized it was precisely the WRONG strategy to tackle this quest.  We moved onto \"the weather hills\", like autobot alluded to, healing is really a must in this one.  Very interesting  though in both theme and mechanics, very unconventional in the way in which you progress.  I liked it...despite our two losses. I'm taking my deck back to the drawing board tonight but overall am not unhappy in that these quests have already presented an immediate challenge.  Havent even bothered with Deadmen's Dike yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1527420","commentId":1527420,"userName":"Bullroarer Took","timestamp":1428165093,"content":"Two tries on Chetwood solo and two losses. Not even close really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1527437","commentId":1527437,"userName":"Pharmboys2013","timestamp":1428166212,"content":"Played Chetwood another 3 times solo with just a pure power deck Glorfindel (spirit), Boromir (tactics), and Mablung.  Lost the 1st try again. Won the second but it was kind of sloppy, Won the 3rd cleanly.  Looking to take another tackle against the Weather Hills with a different deck that will once again be an ideal match against the scenario....still waiting to play Deadmen's Dike. Having a lot of fun so far"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1527665","commentId":1527665,"userName":"Bullroarer Took","timestamp":1428180877,"content":"Beat Chetwood on my third try. It's just a straight forward tough quest. There is no secret strategy that beats it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1528309","commentId":1528309,"userName":"koriakin97","timestamp":1428237317,"content":"I easily beat chetwood with my thematic Dunedain deck now that I know how to play with them. The second one is harder, I passed it only when I had some luck with drawing. The third one is nightmare, I stagger to move forward on the first stage (without indestructible boss enemy) and I get killed when this undead opponent which revives 3-4 others turns up. Having to defend 4 attack of strength 3 kills me nearly immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1528911","commentId":1528911,"userName":"Ecthelion III","timestamp":1428274168,"content":"> I get killed when this undead opponent which revives 3-4 others turns up. Having to defend 4 attack of strength 3 kills me nearly immediately.\n\n \n\nPlease don't kill me when I bring this card up, but the way to beat the Cursed Dead is:\n\n \n\nThe End Comes!\n\n(http://hallofbeorn.com/Cards/Details/The-End-Comes-RtR [http://hallofbeorn.com/Cards/Details/The-End-Comes-RtR])\n\n \n\nYes!  A use for a worthless card!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1529202","commentId":1529202,"userName":"Nickpes","timestamp":1428293472,"content":"I like what I am reading ... hope i will get my hands on it in a couple of weeks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1529871","commentId":1529871,"userName":"Pharmboys2013","timestamp":1428326641,"content":"Beat weather hills 2-player. I used the same Boromir/Mablung/Glorfindel and my friend used a Elrond/Halbarad/Erkenbrand deck (Halbarad didn't really contribute too much but Elrond's bonus healing with Erkenbrand's ability worked wonderfully) it's def a difficult but fun quest. I enjoyed how for the first part of it enemies aren't much of an issue but the main challenge is surviving all the hazerdous weather. Healing such essential. It was almost reminiscent of Druadan Forest in regards to how if you didnt have consistent methods to remove damage counters it would likely not be possible to beat the quest.\n\nAlso tackled Deadmen's Dike and I actually beat it on my first try solo (using the same deck as before) I feel like a got pretty lucky encounter draws and even avoided having that enemy that returns all discarded versions of itself to play activate by selectively having them discarded with Dunedain Hunters (granted Boromir could have taken them all anyway). I really liked the theme of it and will look forward to playing it with some different decks. I don't anticipate victory will come as smoothly in as it did this game in my future attempts"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1543828","commentId":1543828,"userName":"Spurries","timestamp":1428495069,"content":"Deadmans Dike is giving me some real trouble. I thought I had the game in hand when the Sorcery card made me discard a just played Gandalf and Faramir. Then the Boss killed a hero and it was time to scoop.\n\nAnother game, also had the board under control, had one enemy engaged. Staging is a side quest, fine. WITH SURGE, oh no! Surges into a Cursed, dead, which brought 2 more back from discard. Now I have 4 enemies engaged. Well played, encounter deck, well played. Oh, the side quest was one where it brought back one undead enemy each refresh phase too. Scoop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1559009","commentId":1559009,"userName":"Bullroarer Took","timestamp":1428807175,"content":"These are some really good quests in this box. I think even G- will be pleased."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1559099","commentId":1559099,"userName":"Glaurung","timestamp":1428810346,"content":"> These are some really good quests in this box. I think even G- will be pleased.\n\nI got a box already will back home tomorrow and try it at last! This cycle is soppose to be good! I rrally hope for that. After last cycle I lost my lure ti game a bit(only nightmare quests make me happy) but all new cards looks amazing!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1564000","commentId":1564000,"userName":"Ecthelion III","timestamp":1428898376,"content":"What are your general thoughts on the player cards? I think they are worthless in solo but can totally crush hordes of enemies in multi.\n\nDunedain Hunter rocks.\n\nI've been hearing lots of hate on the Star Brooch, but I personally love it. It seems like a great way to counter those really nasty cards like Black Breath and that one from Stone of Erech that reduce your willpower to 0. The only drawback is you have to be engaged with an enemy, but in solo play at least that's never a problem."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1565260","commentId":1565260,"userName":"Glaurung","timestamp":1428932341,"content":"We have Sonkran festival in Thailand now and my box stack in post office for few days… need to wait"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1622882","commentId":1622882,"userName":"faith_star83","timestamp":1431725484,"content":"I finally got my hands on the Lost Realm, quite frustrating really. I pre-ordered this way back already, but somehow amazon.de never go the box I guess?!\n\nAnyhow, yesterday and today I set myself quite nicely: LOTR Movie Soundtrack and a good stock of Beer. First I started with some deckbuilding: I was really looking forward to build a Dunedain Deck with Tactigorn, Mablung and Halbarad.\n\n \n\nImmediately I started against Intruders in Chetwood Solo -Handed (the other Deck was a Galadriel, Haldir & Legolas elven ranged support deck). It was not possible to defeat the scenario, simply because I had not enough starting willpower and too high start threat. After remodeling both decks after a couple of losses I finally managed to bring home a win that felt more lucky than earned.\n\n \n\nImmediately, I set out against The Weather Hills only to be utterly defeated again. Now I had enough, I felt that the Galadriel deck was performing fine, but the Dunedain Deck lacked in everything: Questing Power, Defense and Attack Strength. I absoultely love Mablung and Tactigorns -1 Defens can get absurd when coupled with Haldir & Rivendell Blade, but anyhow I ditched the Dunedain deck and built another Elf deck with Celeborn, Elrond & Glorfindel and added lots of Healing Power to both decks. The two decks combined were just absurd, and I blasted through the quest with barely a scratch.\n\n \n\nConfident I then took on Deadmen's Dike and was happy to finish it in five rounds, but seriously gasping for breath. What a quest, it's really intense and I really love it. Cursed Undead is insane, one time I faced five of them in the same round. I deliberately did not use any draw spells or Galadriels ability and managed to survive. The worst was a triple Heavy Curse in the second round which made some of my most important cards 3 or even 6 resources more expensive to play. I almost played no cards until quest stage two. :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n\n \n\nI really had a blast playing through these scenarios blindly, although I have to admit that they were to difficult for me to take on without some refined decks. I think key to Intruders in Chetwood is having a good starting Willpower to overcome the first rounds and deal with the first Orc War Party. After that it is not that hard anymore. As for The Weather Hillls  agree that healing effects are almost a must have. And Deadmen's Dike is just insane and I did not have a clear strategy other than try to stay alive. :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\n \n\nI felt that location control was also very important in all threee quests, so I was glad to have Asfaloth and Legolas along. Both really did a lot of work, especially Legolas shooting down Orcs and Ghouls every round and constantly adding progress was really a valuable hero.\n\n \n\nI am wondering, though, does anybody have a Dunedain thematic deck and is willing to share the list? Did anyone try a deck with Tactigorn, Halbarad and Mablung? Or did you try Idraen or Beravor? I think Expert Trackers has quite some potential and I really liked Aragorn's ability, too. I felt that especially Halbarad did not pull his weight, it's nice to have hime quest and attack, but often I defeated the enemies in the same round anyway and his 2 Attack or Willpower seemed to rarely matter.\n\n \n\n@koriakin97 If you were willing to share your list I'd be really interested to see what you put together..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1623539","commentId":1623539,"userName":"Glaurung","timestamp":1431786012,"content":"I love Deadmens Dike. Undead are really cool and discard mechanic is something new! Difficult and solid quest with very fierce and cunning boss! Bravo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1634311","commentId":1634311,"userName":"Nickpes","timestamp":1432471290,"content":"Got my hands on it at last. I am not sure i understand the way Rangers of the North work. I set them aside and wit till a card effect puts them in encounter deck. But which are these cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1634315","commentId":1634315,"userName":"CJMatos","timestamp":1432471777,"content":"> Got my hands on it at last. I am not sure i understand the way Rangers of the North work. I set them aside and wit till a card effect puts them in encounter deck. But which are these cards?\n\n \n\nThis one Ranger Summons [http://hallofbeorn.com/Cards/Details/Ranger-Summons-TLR]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1634566","commentId":1634566,"userName":"Nickpes","timestamp":1432498005,"content":"Thx. I believe that now with the Dunedain it is time for me to start using leadership a bit more :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1634817","commentId":1634817,"userName":"Glaurung","timestamp":1432521335,"content":"I think in solo or 2 players game Ranger of the North useless. But in 4 players game when each player have 3 rangers and encounter deck is tin (as at Osgiliath) should be cool!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1635106","commentId":1635106,"userName":"monkeyrama","timestamp":1432557788,"content":"Ranger of the North also slightly depends on timing. In some quests even in solo play you get through the encounter deck, so it's worth hanging on to the card until the deck is thinner, then pop it in. I grant you, not as useful as in 4 players, but it has its place in solo play. I've certainly had some good uses of it so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636684","commentId":1636684,"userName":"danpoage","timestamp":1432666677,"content":"I really don't like that he has surge. If he didn't, I would consider using him. As it is, Leadership has more consistently effective ways of getting powerful allies into play and his When Revealed is not *so* good that it warrants setting up a combo like that. I can see using him thematically in some easier quests, but for the difficult quests I really don't want to wait around and hope he doesn't get discarded as a shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636719","commentId":1636719,"userName":"GrandSpleen","timestamp":1432667378,"content":"> I really don't like that he has surge. If he didn't, I would consider using him. As it is, Leadership has more consistently effective ways of getting powerful allies into play and his When Revealed is not *so* good that it warrants setting up a combo like that. I can see using him thematically in some easier quests, but for the difficult quests I really don't want to wait around and hope he doesn't get discarded as a shadow card.\n\n \n\nHe'd be broken if he did not have Surge!  Imagine a 4-player game with 12 copies of this guy getting into the deck.  Let's say you have a thin scenario with 36 encounter cards.  If you manage to get all 12 copies in there, now he constitutes 25% of the deck (12/48).  Of course, in reality you will be putting him into the deck once it has already been thinned out, and you won't be putting all 12 in unless you're really lucky, but still.... that is too much potential.  If we're removing Surge we need to compensate in some way, maybe \"The first copy of Ranger of the North revealed each round gains Surge.\"  \n\n \n\nHe shouldn't wholly replace an enemy or location (that's functionally the same as preventing an attack and discarding the enemy)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636767","commentId":1636767,"userName":"danpoage","timestamp":1432668602,"content":">  \n> \n> > I really don't like that he has surge. If he didn't, I would consider using him. As it is, Leadership has more consistently effective ways of getting powerful allies into play and his When Revealed is not *so* good that it warrants setting up a combo like that. I can see using him thematically in some easier quests, but for the difficult quests I really don't want to wait around and hope he doesn't get discarded as a shadow card.\n> \n>  \n> \n> He'd be broken if he did not have Surge!  Imagine a 4-player game with 12 copies of this guy getting into the deck.  Let's say you have a thin scenario with 36 encounter cards.  If you manage to get all 12 copies in there, now he constitutes 25% of the deck (12/48).  Of course, in reality you will be putting him into the deck once it has already been thinned out, and you won't be putting all 12 in unless you're really lucky, but still.... that is too much potential.  If we're removing Surge we need to compensate in some way, maybe \"The first copy of Ranger of the North revealed each round gains Surge.\"  \n> \n>  \n> \n> He shouldn't wholly replace an enemy or location (that's functionally the same as preventing an attack and discarding the enemy).\n> \n>  \n\nI would have preferred a version without surge with a limitation on the number that could be added to the encounter deck. In any case, I recognize that other players enjoy these big risk/big reward kind of strategies but it is not to my taste."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636839","commentId":1636839,"userName":"monkeyrama","timestamp":1432670651,"content":"If he shows up, though, he's an ally with stats of a 4 cost ally, with an ability, for 1 cost in leadership, and actually no change to the encounter deck. It's not that bad, when put that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636841","commentId":1636841,"userName":"monkeyrama","timestamp":1432670664,"content":"Or a 2-cost ally, if it's an Ent..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636962","commentId":1636962,"userName":"legolas18","timestamp":1432675477,"content":"These quests were grueling. I try really hard to stick to theme as much as I can, so with two people our decks currently consist of Halbarad, Erkenbrand, and Aragorn (Tactics) on the first one and Haldir, Glorfindel, and Idraen on the second. After minor tweaks here and there and some hero changes (namely Beravor), we managed to trudge through the Intruders in Chetwood and The Weather Hills. But I don't think there's any way we'll be able to get through Deadman's Dike. I'll have to drastically change the decks for that one.\n\nAlthough I really enjoy Halbarad's and Tactigorn's abilities, my overall feeling on them is that they don't really do much. I do appreciate Halbarad's questing ability, as with some buffs he can be pretty effective, but I don't think I've used his engagement ability even once. Aragorn's Response has helped in the past, but on average I only get to use it effectively once or twice a game.\n\nMaybe they'll become more effective as the cycle brings us new cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1636968","commentId":1636968,"userName":"PocketWraith","timestamp":1432675679,"content":"The surge on Ranger of the North is really a non-issue as far as I'm concerned. I'm always happy when my staging includes a treachery which ends up doing nothing and gaining surge, and this is better than that as it has a positive effect and gives you an ally before going back to staging as normal. I just wish he had a shadow effect like Misty Mountain Eagle or Ithilien Guardian."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1637063","commentId":1637063,"userName":"Authraw","timestamp":1432680009,"content":"I actually don't mind seeing the Ranger of the North go as a shadow card. Especially in quests where the shadow effects are nasty, I don't mind knowing that I've diluted them. Although I would find even more use for him if he had a helpful shadow effect, even just 1 direct damage to the attacking enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1649510","commentId":1649510,"userName":"Lecitadin","timestamp":1433512569,"content":"I kinda like it when a quest \"forces\" you to adopt a certain strategy, like healing for Weather Hills."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1669140","commentId":1669140,"userName":"leptokurt","timestamp":1435057198,"content":"I've only been playing Chetwood so far, and it feels meh to mee. My Silvan deck got some easy wins, but 80 percent of the games I lost without having a chance from the start.\n\n \n\nFeels to me like the only strategy here is to manipulate the encounter deck as often as possible as the outcome of the game depends heavily on the encounter cards that you're drawing. As long as you get locations you're fine. Otherwise you're screwed - badly!\n\n \n\nETA: Haven't used the new player cards yet, but I'm not very enthusiastic about them. Lots of them are useless for solo play and the Dunedain mechanics are not very appealing.\n\nEdited June 23, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144441-lost-realm-mini-thoughts/?do=findComment&comment=1670937","commentId":1670937,"userName":"leptokurt","timestamp":1435175070,"content":"The second scenario is cool. Had to get uesd to the meachanics and gotbeaten with my Silvan deck several times. Then I replaced Celeborn with Halbarad who turned out to be very useful, once he was pimped with some Dunedain Warnings.\n\n \n\nHalbarad LOVES Forest Trap btw. :wub: [//content.invisioncic.com/Mfantflight/emoticons/default_wub.png]\n\n \n\nHalbarad HATES shadow efffects like \"ATT gets plus your number of allies in play\"! WTF?!? Just whenI was stomping the encounter deck??? :angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png]\n\nEdited June 24, 2015 by leptokurt"}]}