{"url":"https://community.fantasyflightgames.com/topic/144952-location-questions/","title":"Location questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1528137","commentId":1528137,"userName":"Star Lord","timestamp":1428214468,"content":"I'm rather confused about the Location cards when we played the game. It says that when it's in the Staging Area, it contributes its Threat to the quest, but when it's the Active Location it doesn't contribute its Threat. And players can move to the Location during the Travel phase to make it the Active Location. And it is discarded when the Progress tokens exceeded its quest points. Am I right about this, and can someone help explain it clearly because it seems weird that it would contribute its Threat but all of a sudden it won't. Also, if I draw two Locations, can I choose which one to travel to during the Travel phase? Will that discard the extra Location card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1528416","commentId":1528416,"userName":"Teamjimby","timestamp":1428244148,"content":"You're correct about staging area vs active location.  If you draw two locations you choose which one to travel to and the other one stays in the staging area.\n\n \n\nI don't have a great thematic justification for why the active location doesn't contribute its threat.  Maybe the locations represent areas where darkness might grow, and the active location can't do that because you are already there killing all the enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1528478","commentId":1528478,"userName":"Star Lord","timestamp":1428248466,"content":"So if the Progress tokens exceeds the Active Location's quest point, it is immediately discarded, and the tokens are then transferred to the current Quest, right? I'm just trying to figure it out because it seems to be the most ambiguous card type in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1528636","commentId":1528636,"userName":"Authraw","timestamp":1428257890,"content":"Not quite. When a location is the active location, it acts as a \"buffer\" and receives progress tokens before the current quest card. Once you've put the required amount of progress on it, it is considered \"explored\" and you discard it along with any progress tokens on it.\n\nI've always imagined that locations in the staging area are contributing threat because the heroes aren't able to confront whatever dangers are lurking there. The active location doesn't because it's where the heroes currently are; it has become a known danger, rather than just the threat of danger to come."},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1528639","commentId":1528639,"userName":"CJMatos","timestamp":1428258255,"content":"Yes. As soon as a location as progress tokes equal to its quest points it is imediately discarded.\n\n \n\nIf it is the active location, the remaining progress tokes go to the quest card...\n\n \n\n \n\n \n\nAs to the threat on staging vs non-threat as active the best explanation is the one Teamjimby gave you....\n\n \n\n-------------------------------------------------------------//------------------------------------------\n\n \n\nBut one thing, nothing prevents you from exploring locations that are on the staging area. For instance, with the response from Northen Tracker [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/northern-tracker-core].\n\n \n\nOther thing is that you can only have one active location at a given time, except card efects tell you otherwise (later quest on game). So if you have one active location, you cannot travel to another until the first one is explored (usually)...\n\nEdited April 5, 2015 by CJMatos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1529325","commentId":1529325,"userName":"Star Lord","timestamp":1428298847,"content":"Thanks. So, once you have enough Progress tokens on the Active Location, it is discarded along with all the tokens on it, right? And only then will you be able to start accumulating tokens on the current Quest? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1529540","commentId":1529540,"userName":"alexbobspoons","timestamp":1428307029,"content":"> Thanks. So, once you have enough Progress tokens on the Active Location, it is discarded along with all the tokens on it, right? And only then will you be able to start accumulating tokens on the current Quest? \n\nYes i believe this is the case, and any \"extra\" can be put onto the quest. Eg if the location can accept 3 progress and your questing is resolved giving you 5 progress, then 3 go onto the location (location is thus explored and so the location and its 3 tokens are discarded) and your remaining 2 tokens can go onto your quest.\n\n \n\nThematically, i imagine that things in the staging area (enemies or locations) are both distant \"threats\" and so the heroes picking their journey around them, stealthily walking etc are all thus actions delaying progress on their actual quest (explaining how threat levels reduce your questing resolution total) wheras once you have travelled to a location (or engaged an enemy) it is no longer a distant \"threat\" because you are indeed actively tackling the situation (which still delays your main quest, either because exploring the location is a buffer absorbing progress tokens or because fighting enemies often prevents characters being able to commit to quest (generally speaking, not including special abilities etc)\n\n \n\nSo in my mind, the whole mechanics of the staging and threat works perfectly thematically. In a real quest, having to skirt around an upcoming location or monster would indeed take extra time and so would indeed result in less progress being made on your quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] i do love how well the mechanic is thought out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/144952-location-questions/?do=findComment&comment=1537256","commentId":1537256,"userName":"CJMatos","timestamp":1428437877,"content":"> Thanks. So, once you have enough Progress tokens on the Active Location, it is discarded along with all the tokens on it, right? And only then will you be able to start accumulating tokens on the current Quest? \n\n \n\nCorrect"}]}