{"url":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/","title":"The Hammerstroke engagement question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1528934","commentId":1528934,"userName":"AvogadroTheMole","timestamp":1428276167,"content":"I have been scouring the rule book, FAQs & fora for a specific, rule-based, answer but have not yet found one.\n\nIf I use The Hammerstroke while engaged with one or more enemies do these enemies trigger engagement triggers such as Sam Gamgee's and many enemies' forced effects, such as those in Peril in Pelargir?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1528985","commentId":1528985,"userName":"CJMatos","timestamp":1428279206,"content":"I would say that it does trigger those effects.\n\n \n\nBut Sam only readies one time, because the engagment of all enemies in play happens all at the same time...\n\n \n\n \n\nAs to the forced effects on Peril in Pelargir, sincerely i don't play that quest for a long time and don't remember, but it would seem to me that each and everyone of them would happen..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1528998","commentId":1528998,"userName":"GrandSpleen","timestamp":1428279856,"content":"If you use The Hammer-stroke and become newly engaged with an enemy, you can trigger Sam's response (2 times, 3 times, 4 times, no limit) and you will have to trigger Forced effects that trigger off of enemy engagement, such as those in Peril in Pelargir.  Also note that engagement that results from a card effect such as The Hammer-stroke does NOT count as \"optional engagement.\"  So the Umbar Assassin, for example, will force you to discard a hero.\n\n \n\nIf you use The Hammer-stroke and you were already engaged with an enemy, that enemy's Forced effect will not trigger and you cannot trigger Sam's response."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1529168","commentId":1529168,"userName":"AvogadroTheMole","timestamp":1428290534,"content":"GrandSpleen,\n\nYours is the interpretation I was going with, but I have not been able to find any documentation to prove it. I do not suppose you know of any? The problem is I can see Hammerstroke functioning here a little like it does with an auto-engaging enemy, such as Chief Turch in the 2nd Dunland quest. You trigger the event, the chief engages you and instantly re-engages the original 1st player. Maybe here you trigger a fresh or re engagement of all enemies in play. It feels a little silly for this to happen to those you are already dealing with. But other effect resolutions in this game have been silly from time-to-time, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1529268","commentId":1529268,"userName":"Teamjimby","timestamp":1428297598,"content":"I'm with GrandSpleen on this one.  There aren't really any official rulings on the matter, but it makes sense logically.  The best official ruling I can find is this quote from the FAQ: \"An enemy remains engaged with a player until it is defeated or until a card effect returns it to the staging area, engages it to another player, or removes it from play.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1529279","commentId":1529279,"userName":"GrandSpleen","timestamp":1428297760,"content":"If I am understanding you correctly, from your Turch comparison:  you are worried that you may use Mr. Hammer-stroke (which is an Encouner action), and then any enemies you have engaged will go do Forced engagement checks anyway, and engage players based on threat level?  That would not happen simply because engaged enemies do not make engagement checks.  Once you play the Hammer-stroke, you won't have any more cause for engagement checks during this encounter phase (unless there are some immune enemies in the staging area)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1529290","commentId":1529290,"userName":"GrandSpleen","timestamp":1428298094,"content":"Or perhaps it's timing you are thinking about.  Maybe you are thinking that The Hammer-stroke must be played after engagement checks have all been completed.... so playing The Hammer-stroke would re-trigger any nasty engagement Forced effects that have just been resolved.\n\n \n\nIt's true that you cannot take any actions while players are optionally engaging enemies.  But you may take actions before regular engagement checks.  So, just have everyone pass on optional engagement, then play The Hammer-stroke, and all of those enemies will engage that player and stay there... triggering each relevant Forced effect only once."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1530494","commentId":1530494,"userName":"AvogadroTheMole","timestamp":1428350002,"content":"I am not confused about timing. I did not want to explain the exact situation that spawned this query in my original post to avoid bogging readers in details. I fear I may have made a poor choice there.\n\nI was playing The Old Forest with my girlfriend using a Hobbit deck teamed with a Haldir/Legolas/Loragorn ranged/sentinel deck. Several of the enemies have unpleasant forced:when engages effects, such as deal damage based on victory locations or discard an attachment. I encountered a situation where I had an enemy engaged from a previous turn, she had an enemy engaged as well, and there were two enemies in the staging area that would sort to her (I could only optionally grab one, since my threat was low). I played The Hammerstroke to draw them all to myself to leave her free to use Haldir and Sentinel/range assist me. I was unsure if the pesky enemy already in front of me gave Sam an extra +1 to the other +3 (on top of standing up from the first one to arrive). And if the pest's forced engage would trigger and cost me another attachment.\n\nI was pretty sure it made sense for the enemy already in front of me to be unaffected by the event. But I had difficulty finding direct text anywhere that covered this. Teamjimby's quote seems to cover this because it says \"until a card effect engages it to ANOTHER player.\" That tells me a card effect cannot re-engage an enemy to me unless it is first not engaged with me by some effect.\n\nI appreciate you guys taking the time to help. I spent too much time yesterday digging for answers. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1531940","commentId":1531940,"userName":"alogos","timestamp":1428398328,"content":"I don't know if this from the faq can help you:\n\n> (1.49) Engaging enemies vs being engaged\n> When a player engages an enemy, that enemy has also engaged him, and when an enemy engages a player, that player has also engaged that enemy. There is no difference between engaging an enemy and being engaged by an enemy. Effects that trigger “after an enemy engages you” will trigger at the same time as effects that trigger “after you engage an enemy.”\n> \n>  \n\n \n\nYou engage them, so they engage you. So everything with \"when engages\" effect should trigger.\n\nThe fact that they are engaged with another player doesn't change anything to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1531984","commentId":1531984,"userName":"Nerdmeister","timestamp":1428399482,"content":"> I don't know if this from the faq can help you:\n> \n> > (1.49) Engaging enemies vs being engaged\n> > \n> > When a player engages an enemy, that enemy has also engaged him, and when an enemy engages a player, that player has also engaged that enemy. There is no difference between engaging an enemy and being engaged by an enemy. Effects that trigger “after an enemy engages you” will trigger at the same time as effects that trigger “after you engage an enemy.”\n> > \n> >  \n> \n>  \n> \n> You engage them, so they engage you. So everything with \"when engages\" effect should trigger.\n> \n> The fact that they are engaged with another player doesn't change anything to that.\n\nBut the question pertains to when the enemies are already engaged with the player who is playing Hammerstroke; not to other players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1533477","commentId":1533477,"userName":"alogos","timestamp":1428409797,"content":"I though this was the point that was cleared.\n\n \n\nOh, if it was just that... yeah, that's pretty hard to demonstrate, that engaged enemies doesn't re-engage you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1537252","commentId":1537252,"userName":"CJMatos","timestamp":1428437486,"content":"> If you use The Hammer-stroke and become newly engaged with an enemy, you can trigger Sam's response (2 times, 3 times, 4 times, no limit) and you will have to trigger Forced effects that trigger off of enemy engagement, such as those in Peril in Pelargir.  Also note that engagement that results from a card effect such as The Hammer-stroke does NOT count as \"optional engagement.\"  So the Umbar Assassin, for example, will force you to discard a hero.\n> \n>  \n> \n> If you use The Hammer-stroke and you were already engaged with an enemy, that enemy's Forced effect will not trigger and you cannot trigger Sam's response.\n\n \n\n \n\nHow can you say no limit if there aren't any time to exhaust Sam again? Am i missing something here?\n\nEdited April 7, 2015 by CJMatos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1537306","commentId":1537306,"userName":"PocketWraith","timestamp":1428439531,"content":"> > If you use The Hammer-stroke and become newly engaged with an enemy, you can trigger Sam's response (2 times, 3 times, 4 times, no limit) and you will have to trigger Forced effects that trigger off of enemy engagement, such as those in Peril in Pelargir.  Also note that engagement that results from a card effect such as The Hammer-stroke does NOT count as \"optional engagement.\"  So the Umbar Assassin, for example, will force you to discard a hero.\n> > \n> >  \n> > \n> > If you use The Hammer-stroke and you were already engaged with an enemy, that enemy's Forced effect will not trigger and you cannot trigger Sam's response.\n> \n>  \n> \n> How can you say no limit if there aren't any time to exhaust Sam again? Am i missing something here?\n\nYou can only ready him once, but there's no limit to the stat boosts he can get from it. So if you engage say 4 enemies he readies and gets +4 wp/att/def."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145013-the-hammerstroke-engagement-question/?do=findComment&comment=1537316","commentId":1537316,"userName":"CJMatos","timestamp":1428439799,"content":"Thank you... Forgot he gets the stat boosts in the same response..."}]}