{"url":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/","title":"Interaction: Horn of Gondor + Location in Fog on the Borrow-Downs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1529610","commentId":1529610,"userName":"Nerdmeetsyou","timestamp":1428311581,"content":"There is a location in the quest Fog on the Borrow-Downs that I don't know the english name of. In German it is called \"Uraltes Hügelgrab\".\n\nIt takes allies from play and puts them face down under the location.\n\nWhen the location gets explored, then they get returned to hand.\n\n \n\nQuestion now is: Does this interact with Horn of Gondor, and if it does, when?\n\nI see three scenarios here:\n\n1. You get the ressources when they get faced down, as they now leave play.\n\n2. You get the ressources when they get returned to hand, as they did not leave play, but just where faced down.\n\n3. You don't get ressources at all: Because when they get faced down, they don't leave play. And when they get returned to hand, they are no Allies anymore, just some facedown cards that get returned.\n\n \n\nWhat do you think? Or is there a definit answer in the FAQ already?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1531914","commentId":1531914,"userName":"alogos","timestamp":1428397821,"content":"Don't have the card, but if I remember correctly, they didn't \"leaves play\" so the horn of gondor didn't work.\n\nThen, between 2 and 3... I'm not sure how to answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1536886","commentId":1536886,"userName":"GrandSpleen","timestamp":1428424925,"content":"I would say they surely leave play.  Somewhere I believe it is written that facedown cards lose all of their card text, including card type (ally), etc.  I can't find it just now.  \n\n \n\nIt reminds me of Eagles of the Misty Mountains.  In that case, an eagle ally leaves play, then you attach it facedown to the EotMM.  I would not say that the returning eagle ally has \"entered play.\"  If it has not entered play, it is not in play... and if a facedown card is not in play (at least, not 'in play' per its regular card type), then when an in-play card becomes a facedown card, I'd say it has left play!  \n\n \n\nIf I have a few Silvan Refugees on the table when this card comes out, I'd have to discard the Refugees, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1541332","commentId":1541332,"userName":"alogos","timestamp":1428483466,"content":"> I would say they surely leave play.  Somewhere I believe it is written that facedown cards lose all of their card text, including card type (ally), etc.  I can't find it just now.  \n> \n>  \n> \n> It reminds me of Eagles of the Misty Mountains.  In that case, an eagle ally leaves play, then you attach it facedown to the EotMM.  I would not say that the returning eagle ally has \"entered play.\"  If it has not entered play, it is not in play... and if a facedown card is not in play (at least, not 'in play' per its regular card type), then when an in-play card becomes a facedown card, I'd say it has left play!  \n> \n>  \n> \n> If I have a few Silvan Refugees on the table when this card comes out, I'd have to discard the Refugees, I think.\n\nEagles of the misty mountain requires the allies to leave play. But here, we don't really make the ally leaves play, we turn it face down, that is sure.\n\n \n\nAlso, good catch, it should be 3 instead of 2 because when eagles of the misty mountain leaves play with all its eagles allies attachment, you don't get extra ressources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1545489","commentId":1545489,"userName":"GrandSpleen","timestamp":1428503860,"content":"I still like answer #1 best, we went from a game board that has \"Bill the Pony\" in it, to a game board that does have \"Bill the Pony\" in it (facedown card loses its title).  Bill the Pony has left play!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1545944","commentId":1545944,"userName":"PocketWraith","timestamp":1428515426,"content":"I'm pretty sure this doesn't count as leaving play, based on a comparison with the first quest of The Lost Realm:\n\nIarion [http://hallofbeorn.com/Cards/Details/Iarion-TLR] causes you to lose the game if he leaves play.\n\nRescue Iarion [http://hallofbeorn.com/Cards/Details/Rescue-Iarion-TLR] takes Iarion and puts him facedown under it.\n\n \n\nSince obviously the designers intended this sidequest to be part of the quest, not simply make you lose the moment it's revealed, we can conclude that putting a card facedown does not inherently mean that card has left play.\n\n \n\nThis does seem somewhat inconsistent though, so I'd ask Caleb to be sure. Might be a rules clarification or errata is needed somewhere to make everything make sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/145280-interaction-horn-of-gondor-location-in-fog-on-the-borrow-downs/?do=findComment&comment=1546305","commentId":1546305,"userName":"GrandSpleen","timestamp":1428527320,"content":"That's a good point, and definitely enough to make me reverse my position.  And now that you mention it, we see a similar circumstance in The Ring Goes South.  When the Watcher comes out on quest stage 4, you put Frodo and the ring facedown under him.  The One Ring says \"If The One Ring leaves play, the players lose the game.\"  But obviously you don't lose when Frodo is grabbed by the Watcher, so you all are right and going facedown does not count as leaving play.  So now I'm with alogos, and the answer to the OP's question looks to be #3, no resources at all are awarded."}]}