{"url":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/","title":"Silvan Tracker healing ready Characters","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1532470","commentId":1532470,"userName":"Eu8L1ch","timestamp":1428404906,"content":"Silvan Tracker's ability reads:\n\n \n\n\"Response: After a Silvan character readies during the refresh phase, heal 1 damage from that character.\"\n\n \n\n \n\nQuestion:\n\n \n\n- Does a ready, damaged, silvan character heal during the refresh phase?\n\n \n\nOf course, to have this question make sense I'm assuming that you can ready an exhausted card (but nothing happens ofc).\n\n \n\n \n\n \n\nIn the rulebook, you can read on page 22, refresh phase section:\n\n \n\n\"During the refresh phase, all exhausted cards ready\"\n\n \n\nBut, on page 31 (quick reference), refresh pahse:\n\n \n\n\"• Each player refreshes all cards he controls.\"\n\n \n\n \n\nNow, it seems clear that the quick reference should be viewed just as a shortcut, thus the actual rules are those comprised in the \"rulebook\" section, so I think if we want to follow the letter of the rulebook a (silvan) character that was ready doesn't heal any damage during refresh.\n\n \n\nIf all of the above is correct, however, I'm wondering what the intent was: was it phrased \"refresh exhausted characters\" just to make clear that ready characters do not need to refresh, so that it might be acceptable as some kind of house rule to have ready characters \"ready\" during refresh (thus healing 1 dmg), or do you think it would be against the spirit of the rules?\n\nIt seems a bit strange to me that you cannot get a benefit because you couldn't do something you usually want to avoid - also see Galadriel + Arwen : it's very strange that something that's supposed to work in you favor can actually hinder you.\n\nI think having the option to exhaust characters as an action during combat phase would solve both these issues.\n\n \nEdited April 7, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1533591","commentId":1533591,"userName":"alogos","timestamp":1428410165,"content":"The rulebook in the section that summarize the step... summarize the steps.\n\nSo page 22 is better worded than page 31.\n\n \n\nThe trick is better demonstrated with Arwen, exhausting should not be \"free\" and available at demands, even if it seems a disavantage. If you need to heal, then the risk is to exhaust first. That is a basic risk/reward type bonus, even if weird.\n\nBasic rules: do not interpret or use logic/thematic to find a \"why\" to how something is worded. It shoud be used as it is worded. When in doubt, though, ask Caleb.\n\n \n\nI recommend using Spare Hood and Cloack if you want to get away from this limitation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1535243","commentId":1535243,"userName":"Eu8L1ch","timestamp":1428414788,"content":"> The rulebook in the section that summarize the step... summarize the steps.\n> \n> So page 22 is better worded than page 31.\n> \n>  \n> \n> The trick is better demonstrated with Arwen, exhausting should not be \"free\" and available at demands, even if it seems a disavantage. If you need to heal, then the risk is to exhaust first. That is a basic risk/reward type bonus, even if weird.\n> \n> Basic rules: do not interpret or use logic/thematic to find a \"why\" to how something is worded. It shoud be used as it is worded. When in doubt, though, ask Caleb.\n> \n>  \n> \n> I recommend using Spare Hood and Cloack if you want to get away from this limitation.\n\n \n\n \n\nThanks for your answer.\n\n \n\nMy question was twofold: whether my literal interpretation was correct and whether the literal interpretation was taken into account when creating the card, so that the card effect is exactly what it was supposed to be (\"the spirit of the rules\").\n\nEven though I think we came to the same conclusion as far as the rules go, I don't think I agree on your risk-reward argument: all it takes is one enemy engaged with you to be able to exhaust all your characters during the combat phase, and I don't see no risk/reward in this - there is the risk of having to fight the enemy, but that has nothing to do with your choice of risking to heal or not - it's more a matter of whether you'll have to deal with that enemy or not.\n\nFeels kinda weird, imo.\n\nAlso, I don't understand your argument for Arwen-Galadriel: what I'm saying is that it doesn't make sense from a thematic point of view, in this there's no rules-interpretation doubt. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n\"Basic rules: do not interpret or use logic/thematic to find a \"why\" to how something is worded.\" From a rules-interpreting standpoint, I agree 100%. However, part of what makes me like this game so much is the fact that it's higly thematic, so I think finding ways to have rules make more sense from a thematic (and logical too) standpoint would enrich the game.\n\n \n\n \n\n \n\n \n\nEdited for clarity\n\nEdited April 7, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1536796","commentId":1536796,"userName":"monkeyrama","timestamp":1428422138,"content":"I'm a little confused. Why is exhausting characters by the time of the refresh phase something we want to avoid? If a Silvan ally is ready by the refresh phase, and hasn't been used and readied by another effect, didn't we just waste that character for a turn...?\n\n \n\nI'm probably being stupid, but I don't quite get what the original question was about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1536808","commentId":1536808,"userName":"alogos","timestamp":1428422448,"content":"> \"Basic rules: do not interpret or use logic/thematic to find a \"why\" to how something is worded.\" From a rules-interpreting standpoint, I agree 100%. However, part of what makes me like this game so much is the fact that it's higly thematic, so I think finding ways to have rules make more sense from a thematic (and logical too) standpoint would enrich the game.\n\n \n\nThat's the beauty of the cooperative game without any competition:\n\nDon't follow a rule if you don't like it.\n\n \n\nI'm playing a computer game where you can put enemy on fire AND freezing them. While having a thematic point of view, of course it seems crazy, but when seeing it as a programmer, it makes sense. Card Game is the same, it may make the thematic strange, but having mechanics that interfere in a strange way is really interesting.\n\n \n\nJust remember which rules are homemade when playing outside :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n@Monkeyrama: nothing ever go as planned... If every turn ends with all you character exhausted... well, either you're dying or you are a **** of a genius planner."},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1543256","commentId":1543256,"userName":"monkeyrama","timestamp":1428492845,"content":"Well, yes, but in the case of using the Sylvan Tracker to heal, all it would take is to attack one enemy with literally everyone to make sure that this triggers - evidently it's good not to use all characters etc to the limit every turn (as you say, makes it sound like it's all going pear-shaped!) but it's not hard to utilise the Tracker's ability if there is an enemy engaged. But I think that I'm barking up the wrong tree/going down the wrong rabbit hole with my thinking here.\n\n \n\nThe link between theme and mechanics is a very interesting one though - what is the rational behind the Tracker's ability thematically? It's a neat mechanic though, no question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1555966","commentId":1555966,"userName":"Eu8L1ch","timestamp":1428703687,"content":"Imagine this scenario: Journey down the Anduin, I have 1 silvan tracker in play, 2 damaged mirkwood runners. If i commit the runners and Necromancer's Reach is revealed (1 dmg to each exhausted character) I lose both, so I decide to keep them ready. Now, if an enemy shows up, I get to heal both and next round I can commit them without risking. If not, I'm stuck with damaged runners.\n\nQuestion: doesn't it feel awkward for me to hope an enemy is revealed in order to be able to heal my silvans?\n\nFirthermore, as monkeyrama said, all I need is just one enemy to exhaust all my characters during combat phase, making me able to heal all my silvan characters.\n\n \n\nAlso, I know I can play with the rules I want, but it's not an argument in favor of having rules that feel weird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/146728-silvan-tracker-healing-ready-characters/?do=findComment&comment=1556208","commentId":1556208,"userName":"GrandSpleen","timestamp":1428716417,"content":"I don't understand what the reason for discussion is.  Just for the sake of discussion?  Or are you advocating an errata to the core rules of the game?\n\n \n\nedit: that's now a jab or anything, I'm just curious where this is going\n\nEdited April 11, 2015 by GrandSpleen"}]}