{"url":"https://community.fantasyflightgames.com/topic/170634-new-will-of-the-west-and-removed-from-the-game/","title":"&quot;New&quot; Will of the West and removed from the game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/170634-new-will-of-the-west-and-removed-from-the-game/?do=findComment&comment=1572958","commentId":1572958,"userName":"sensei yaourt","timestamp":1429169142,"content":"Hello everyone,\n\n \n\nFirst, i must say, while i totally understand why Will of the West was errated the way it was, i'm slightly unhappy about it (just slightly)...\n\nProblem was with the Lore \"win before quest phase during turn 1\" deck and a \"once per phase\" limitation on Ravens of the Mountain would have killed that already... But game masters when the safe route and made sure any kind of recursion couldn't be infinite, i praise them for that (i really do), i love the game when it's fair, not when it's all comboty.\n\n \n\nThat being said, it makes me a bit sad cause now i have a very hard time soloing certain senarios instead of just a hard time cause i end up (cause i played them or there were discarded or destroyed) with situational cards in my discard pile and a desperate need to get them again without means of getting them back... I could play more of them, but a solo deck not directly aimed at a specific senario simply doesn't have that kind of card-space... Well... back to deckbuilding again...\n\n \n\nNow, the rule part of the topic... sorry it took so long to came but i needed to vent :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAfter digging through my rulesheets, i found the entry for \"removing from the game\" in A journey to Rhosgobel\n\n \n\n> When a card is removed from the game, it should be set aside and ignored for the rest of the game.\n> \n> \n> Do not place any “removed from game” cards in the discard pile, as effects that bring cards back from the discard pile no longer interact with these cards.\n\n \n\n \n\nNow... I understand the principle behind \"removing a card from the game\", i've played other cardgames before... Yet, does that means the card can no longer be interacted with it in any way, shape or form ?\n\n \n\nWhat if i discard my Will of the West one way or another and play if from the discard pile with Map of Earnil.\n\n> \" Action: Discard Map of Earnil to play any [spirit] event card in your discard pile as if it were in your hand. Then, place that event on the bottom of your deck.\"\n\n \n\nI discard my Map of Earnil, i pay 1 [spirit] ressource, play Will of the West from my discard pile, shuffle my discard pile into my deck, then remove it from the game...\n\n- Do i still remove it from the game even if it's in my deck ?\n\nAnd now i place it on the bottom of my deck...\n\n- Do i still place it at the bottom of my deck even if it's removed from the game ?\n\n \n\nIf it was placed in the victory pile, i would definitively put it back in my deck... but, then again, i guess victory pile is still an \"in the game\" kind of location... My educated guess is i'm screwed :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\nAnd a quick follow up, if \"removed from the game\" doesn't mean \"can't be interacted with in any way\", are there any cards yet that can interact with cards removed from the game ?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/170634-new-will-of-the-west-and-removed-from-the-game/?do=findComment&comment=1573018","commentId":1573018,"userName":"alogos","timestamp":1429173146,"content":"If we look at Beorn ally, it is quite the same. If he die the same phase you used his ability, he won't be shuffled back.\n\n>  \n> \n>  \n> \n> (1.02) Simultaneous Effect Timing\n> If two or more conflicting effects would occur simultaneously, the first player decides the order in which the effects resolve.\n> Example: Tom plays Sneak Attack (CORE 23) to put Beorn (CORE 31) into play during the combat phase. Sneak Effect has the condition, “At the end of the phase, if that ally is still in play, return it to your hand.” During combat, Tom uses Beorn’s triggered effect, which has the condition, “At the end of the phase in which you trigger this effect, shuffle Beorn back into your deck.” At the end of the phase, a situation arises in which two conflicting effects are attempting to resolve simultaneously on Beorn. The first player determines which of the two effects resolves first. (The second effect no longer applies when Beorn leaves play.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/170634-new-will-of-the-west-and-removed-from-the-game/?do=findComment&comment=1573772","commentId":1573772,"userName":"GrandSpleen","timestamp":1429194914,"content":"If you use Map of Earnil to play a an event that made it into your discard pile, I believe the play sequence should look like this:\n\n \n\n1- discard Map\n\n2- fully resolve the chosen event's text\n\n3- put that event on the bottom of your deck\n\n \n\n \n\nFor Will of the West, 'fully resolving' the card's text includes removing it from the game.  At that point, you will not be able to put it on the bottom of your deck, and alogos pointed out the mostly analogous situation with Beorn.  \n\n \n\nAnd no, I don't think there are any player cards that interact with cards that have been 'removed from the game...' although they might have done this with an encounter deck card at some point."}]}