{"url":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/","title":"dark knowledge","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1587933","commentId":1587933,"userName":"muttlee","timestamp":1429715327,"content":"Am I able to do this. If I have beregond hero, can I play dark knowledge attachment on to him as long as I have a lore hero and use his resources to pay for it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1587988","commentId":1587988,"userName":"alogos","timestamp":1429716981,"content":"You only need to pay a ressource with a hero that can pay for lore cards. After that, to whom you attach it does not matter. (the card say it need to be an hero though),"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1589510","commentId":1589510,"userName":"Dwarf king Bronze beard","timestamp":1429792109,"content":"I have a simple deck building question for this card. How do you use it or do you even put it in your deck? I have been playing this game about 1 and half year, but i haven't ever concidered to use this in my deck. Any ideas?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1589642","commentId":1589642,"userName":"GrandSpleen","timestamp":1429799255,"content":"In the early days, it was a bit more popular for people using the Gloin resource engine.  You build a deck around Gloin taking a lot of damage (and healing), turning that damage into resources.  Put Dark Knowledge on him to take the guesswork out of defending.   If that allows you to take an attack undefended, then you have even gained some crude method of action advantage by using this card.  I don't think Dark Knowledge gets a lot of play these days, though.\n\n \n\nIt can also be useful if you are trying to set up Small Target [http://hallofbeorn.com/Cards/Details/Small-Target-EaAD], although in that case Silver Lamp [http://hallofbeorn.com/Cards/Details/Silver-Lamp-VoI] is probably a better option since it's in-sphere and comes with no drawback.\n\nEdited April 23, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1589951","commentId":1589951,"userName":"TwiceBorn","timestamp":1429810414,"content":"I attached it to Denethor during the first few cycles, since I never used him for questing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590226","commentId":1590226,"userName":"Courchevel","timestamp":1429819087,"content":"Question arising with new cards :\n\nWhat happens if I play star brooch then dark knowledge (let's say on Aragorn) ?\n\nDo I have the same result if I play dark knowledge then star brooch ?\n\nIf the answer to the latest question is no, that means there is a sort of order effect depending on when we played the cards ? That would be new to me.\n\nI'd like some opinions here"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590283","commentId":1590283,"userName":"GrandSpleen","timestamp":1429821091,"content":"\"Cannot\" is absolute, and Star Brooch says the hero cannot have their willpower reduced.  So it'll just nullify that downside of Dark Knowledge.  The order you play them wouldn't matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590288","commentId":1590288,"userName":"Courchevel","timestamp":1429821225,"content":"Thx, however, the \"cannot\" is not so absolute for Beorn cannot have attachment ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited April 23, 2015 by Courchevel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590294","commentId":1590294,"userName":"GrandSpleen","timestamp":1429821474,"content":"I see what you mean, but I'm just pulling that language directly from the FAQ:\n\n \n\n(1.14) The word “cannot” If a card effect uses the word “cannot”, then it is an absolute: that effect cannot be overridden by other effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590300","commentId":1590300,"userName":"Courchevel","timestamp":1429821770,"content":"I am still confused for the rulling coming from joking during gencon between danpo and Caleb on Beorn whose attachments would not be discarded after he recovers from his texts blankening."},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590839","commentId":1590839,"userName":"GrandSpleen","timestamp":1429847392,"content":"The way I see it, it's kind of a play restriction.  \"Cannot have attachments.\"    Beorn's text is blank, so he is a legal target for the attachment.  Once he is no longer blank, you can't attach anything to him, but: there is no rule written anywhere that would now govern discarding this attachment.  Card immunity rules make no such provision.  So if you discard it, you are not supported by anything written down.  Intuitively, it makes sense to get rid of an attachment that is attached to a card which reads \"Cannot have attachments.\"  But you have to interpret rules legalistically, not intuitively.  If nothing has instructed you to discard something, then discarding it is not the rule.  \n\n \n\nSo, I have to read 'cannot have attachments' as a play restriction only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/173757-dark-knowledge/?do=findComment&comment=1590957","commentId":1590957,"userName":"Courchevel","timestamp":1429858729,"content":"Thank for deeper explanations GrandSpleen. It's just the language finaly that's stop me.\n\nIn English, \"Beorn cannot have attachment\" is not the same sentence as \"Players cannot put/play attachment on Beorn\"\n\nSo for me, there is absolutely nothing in the rules that says that Beorn cannot have attachment is a play restriction. And it's not, because encounter deck attachment fails on Beorn (poison, condition, tentacles, ...) so it's not just about player that cannot.\n\nIn addition, in the rules you have the \"cannot\" is absolute : which means for me, still in English, nothing can revert it. So when Beorn have his text active : any attachment should \"not be on Beorn\". So the attachment should stop from being attached to him, and naturaly an unattached attachment should be discarded (most logical way to handle an unattached attachments, but it can stay in play unattached, if you prefer).\n\nSo I know I am wrong, and the ruling is totally clear : but sorry, I am still thinking that this is not what is written in the rules book and on my cards. For me, it should mean to errata Beorn from \"Beorn cannot have attachments\" to \"attachments cannot be attached to Beorn\"."}]}