{"url":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/","title":"Forced effect on Helm&#039;s Deep Stage 3B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1591029","commentId":1591029,"userName":"tricil","timestamp":1429864535,"content":"Hey there,\n\n \n\nNot sure how many people had a chance to play the Helm's Deep scenario yet but I am wondering about the transition from Stage 2 to 3. Stage 3B has a forced effect that reads: \"After resolving the quest, if the encounter deck did not place at least 1 progress on this stage as the result of questing, the first player reveals 1 encounter card\". If the encounter deck completes Stage 2 during the questing phase, does this effect trigger right away as the resolution just happened and no progress was placed here? Or does it only trigger the next round?\n\n \n\nCheers,\n\nMichael\n\n \n\n \n\nEdit: Official ruling in post #4.\n\nEdited April 24, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1591213","commentId":1591213,"userName":"PocketWraith","timestamp":1429880112,"content":"I think it triggers immediately. It's a similar principle to the second stage of Shadow and Flame, which gets 4 automatic progress if at least one hero committed to the quest that round and also will trigger as soon as you advance. As you note, all the conditions are met for it to happen, so it should happen at that point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1591279","commentId":1591279,"userName":"tricil","timestamp":1429882646,"content":"Thanks for the response! I would be in favour of that interpretation as the quest certainly should become more difficult at that point. I just want to make sure that this corresponds to how the designers meant it to be. I guess the phrasing of stage 2B of SaF is even more clear in that respect (\"at the end of the quest stage\" vs. \"after resolving questing\"). It would make sense if both applied in the same situations.\n\nEdited April 24, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1591338","commentId":1591338,"userName":"tricil","timestamp":1429884507,"content":"Just got an official response fom Caleb. It's not the ruling I had hoped for but I guess it makes sense given the different phrasing from SaF stage 2B (not clear when \"after resolving questing\" is exactly).\n\n \n\n>  \n> \n> Hi Michael,\n> In retrospect, stage 3B probably should have been worded: “After resolving the quest at this stage, if the encounter deck…” to make it clearer that you only trigger that effect after questing at that stage. I may add that to our next FAQ.\n> I hope you’re enjoying The Treason of Saruman!\n> Cheers,\n> Caleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1920565","commentId":1920565,"userName":"Laco","timestamp":1449351214,"content":"In this forced effect \"place at least 1 progress on this stage as the result of questing\" is meant on active location or active quest card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?do=findComment&comment=1920986","commentId":1920986,"userName":"GrandSpleen","timestamp":1449382546,"content":"The quest card."}]}