{"url":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/","title":"Good Harvest and 0 cost cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1591929","commentId":1591929,"userName":"DukeWellington","timestamp":1429901400,"content":"I don't know how much this topic has been discussed in forums already, but the official ruling in the latest FAQ regarding Good Harvest and 0 cost cards has raised some confusion that I need cleared up.\n\nThe question was, if you play good harvest can you then play 0 cost cards that are off color. The answer was no. The card only allows you to spend resources off color but does not grant the hero a resource match symbol as, say, Gandalf's ability does.\n\nThis seems to make sense, but when I thought about it more there are problems, particularly with Elrond, Grima, and Hirluin. If you have Elrond and no tactics hero, can you play Dundain Hunter? It would seem that you cannot, according to the ruling with Good Harvest. If you lower the cost of Knights of the Swan to 0 using Grima, can you still play the card, with either Elrond or Hirluin? It seems that you cannot.\n\nThis just seems lame, but by the letter of the rules I can't see any other interpretation. Am I missing something?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1592024","commentId":1592024,"userName":"GrandSpleen","timestamp":1429904343,"content":"You've got it right.  \n\n \n\n1- you need a resource match to buy cards from any sphere\n\n2- heroes may be granted additional resource icons through card effects (songs, Narvi's Belt)\n\n3- there are some card effects that allow you to spend any color resources for other spheres but *don't* grant a resource icon (Elrond, Good Harvest)\n\n4- 0 cost cards require a resource match.\n\n \n\nSo, Good Harvest, etc., don't give you the necessary setup to play 0-cost cards.  You still lack that all-important resource match.\n\nEdited April 24, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1592639","commentId":1592639,"userName":"OlorinCZ","timestamp":1429945602,"content":"Do I get it right? \nWith mono-Lore Elrond deck I CAN play for example Imladris Stragazer because she costs 2, but not D. Hunter because no resources needed? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1592892","commentId":1592892,"userName":"GrandSpleen","timestamp":1429969124,"content":"yup!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1593829","commentId":1593829,"userName":"OlorinCZ","timestamp":1430038263,"content":"wow...thanks for the clarification...I am not arguing with the rules nor with you, but still find it strange  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1594187","commentId":1594187,"userName":"GrandSpleen","timestamp":1430067052,"content":"It's definitely not intuitive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174035-good-harvest-and-0-cost-cards/?do=findComment&comment=1594912","commentId":1594912,"userName":"Nerdmeister","timestamp":1430115737,"content":"Might be to avoid a deck that includes the whole range of zero-cost cards spread out across the spheres with mono-sphere heroes.\n\nMight be possible to make a heavy carddraw deck from some chosen lore cards and then sit with 20+ cards in hand by round 3 with enough circumstantial 0-cost cards to clear the table (or close to it), thus making the remainder of the game that much easier.\n\nNot something I have looked into seriously but the thought has crossed my mind."}]}