{"url":"https://community.fantasyflightgames.com/topic/174497-guarded/","title":"guarded...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174497-guarded/?do=findComment&comment=1597884","commentId":1597884,"userName":"alexbobspoons","timestamp":1430261186,"content":"So you draw (or in setup) a guarded card and put its guarding card against it. You then defeat the guarding card and thus the objective is available to claim.... but do you HAVE to claim it straightaway and if you dont what happens?\n\n \n\n1: is the guarded card discarded as it wadnt claimed? (Dont think so, would make dol guldur even more impossible if you HAD to claim some of the damaging objectives on turn-1 if they were guarded by an enemy who instantly engaged)\n\n2: does the guarded card sit in staging until somebody wants to claim it?\n\n3: does it sit in staging, and the next revealed encounter card goes against it as a \"new\" guard?\n\n \n\nAppreciate advice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174497-guarded/?do=findComment&comment=1597887","commentId":1597887,"userName":"PocketWraith","timestamp":1430261428,"content":"It sits in staging until you want to claim it, unless some other card effect tells you to do something with it, like the Dungeon Jailor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174497-guarded/?do=findComment&comment=1597944","commentId":1597944,"userName":"alexbobspoons","timestamp":1430264457,"content":"Thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nSo sometime worth leaving them in staging until you need them.. good to know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174497-guarded/?do=findComment&comment=1598301","commentId":1598301,"userName":"OlorinCZ","timestamp":1430294636,"content":"It waits in the staging area till you want to claim it indeed. \n\nIf it would not be so, that would make escape from Dol Guldur even crazier. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174497-guarded/?do=findComment&comment=1598386","commentId":1598386,"userName":"alexbobspoons","timestamp":1430304342,"content":"Yes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIn Hunt for Gollum they are still in-play within the staging area and so still affect the stats of the Mordor Hunters, and  some of the treacheries I have seen so far just affect \"any clue\" wheras some affect clues attached to heroes, so theres not as much reason to leave them in staging.\n\nBut with Dol Guldur, the negative qualities of the objectives, raising threat etc, means you just dont want to pick them up until you really have to.\n\n \n\nSeems a bit funny thematically, in that you fight a guard that is protecting Galdalfs map.. then travel to two or three different locations, covering miles... and then pick up Gandalfs map to use it further in your journey, so story-wise its a bit odd, but in terms of game mechanics I dont think you could play it any other way and be able to survive.\n\nIn some ways thematically it would be nice that any unattached unclaimed staging objective would be automatically attached to the next drawn encounter card so that the objective would always have a guard if unclaimed. This would simulate the dying guards passing it on to other creatures, or the map/key etc moving from one location to another by way of say floating down the river, being carried by creatures etc etc.\n\n \n\nBut then as I type I thought:\n\nMaybe story/thematically another way to explain it is that you would actually pick up the objective when you complete its guard (kill enemies, explore location etc) and so are thus kind-of carrying it in your pack (thus it sits in staging)... and then when you get to the point in your journey that you are actually \"using\" the objective item, its use kicks in the aspects/powers/conditions of its card text (eg you can carry a torch but it isnt until you light the torch that you draw attention to yourself and its negative powers start affecting... You can carry a map, but it isnt until you start unfolding and reading/following the map that its takes your attention and starts distracting you etc etc)."}]}