{"url":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/","title":"How does everybody feel about Saruman&#039;s Treason quests?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1597667","commentId":1597667,"userName":"RebelX","timestamp":1430250242,"content":"Hi everybody,\n\n \n\nI am more of a lurker on these forums and even though I own every expansion that has been released in my country so far quite a few have remained unplayed until this day.\n\n \n\nThere is always a lot of talk about player cards on this forum but I have not read anything on the new saga quests so far and I am really interested in the general opinion.\n\n \n\nHow are thee quests? Are they thematic enough? unique? Challenging?\n\n \n\nHow do they compare to the other saga extensions?\n\n \n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1597803","commentId":1597803,"userName":"GrandSpleen","timestamp":1430256536,"content":"I have only played the first two so far (The Uruk-hai and Helm's Deep).\n\n \n\nFirst off: spoiler alert, obviously.\n\n \n\nThe first one was on the easy side, I felt.  We won on our first attempt (2-player), then I won on my second attempt (solo 2-handed), then when I tried it 2-player again it took 3 tries, but we beat it on the 3rd attempt without any major deck modifications.  You only get 2 heroes for the entirety of the first quest, not counting the Fellowship Aragorn.  It felt appropriately thematic, as we were 'chasing' a pursuit tracker that got ever closer to its goal.  \n\n \n\nI played Helm's Deep a couple of times in a 3-player group, and we lost each time.  It's got a very hard setup (a 4-threat enemy in the staging area, per player, plus 1 reveal per player).  You're meant to lose at questing quite a bit during this scenario, but that tricked my playgroup into believing it was OK to lose at questing early on.  Both times we tried the game, we committed nobody to the quest, giving up the first quest stage without a fight.  This allowed us to clear out some enemies, but then we're that much closer to failure (the encounter deck wins if it clears the 3rd quest stage-- well technically stage 4, but you start counting at 2 so it's the 3rd stage you're fighting over).  There's a very mean treachery in here that sunk us: places 3 progress on the quest and blanks all of your characters' textboxes, making those happy little Response and Actions on your heroes and allies quite worthless.  Gimli in particular was not happy about that, and it kills all your Sentinel and Ranged.  It looked like Helm's Deep would be significantly easier as a solo experience.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1597836","commentId":1597836,"userName":"tricil","timestamp":1430258579,"content":"I have played all three quests quite a lot so far but only solo. I think that all three are thematic, mechanically interesting and very well done. As in the Lost Realm, my impression is that the difficulty is increasing with each quest, with the first one definitely more on the easy side and the last being very challenging.\n\n \n\nRegarding the Uruk-Hai, GrandSpleen summed it up very well. The quest does not require any major deckbuilding and can be won with a variety of decks. I guess that the only thing to keep in mind is that you have one hero less, which can be quite important when thinking about card costs and sphere ratios. The pursuit value provides a nice incentive to replay the quest as it acts like a scorer but is much easier to keep track of than the usual quest score.   \n\n \n\nI partially agree with GrandSpleen regarding Helm's Deep. If you end up in the last stage with the Defence keyword, things will end up being very close and it often is game over sooner than later. After playing this quest with a couple of different decks, I think it is important to quest heavily from turn one to make sure you can stay in the first and second Defence stage (i.e., actually stage 2 and later stage 3) as long as possible. If you can stay in Stage 2 for a while and manage most revealed enemies one by one, however, surviving should not be too hard. Of course, my experience is from solo play and I fully agree that this scenario will be more difficult with 2+ players. But if all players make sure to bring strong questing and some combat abilities to the table, this should definitely be doable. I will probably revisit this quest every now and then in the future to try out my stronger decks.\n\n \n\nRegarding the last quest, Saruman is certainly a badass and my impression is that he will be as challenging to fight in multiplayer as he is in solo. I had to do a bit of deckbuilding to get a win out of this scenario and even that victory felt somewhat lucky. As in the other quests, the mechanics here felt fresh and unique to me, which definitely makes this quest worth revisiting. Especially Saruman and his wizardry stuff is very innovative and even getting close to him turns out to be hard. He is certainly a boss enemy that you do not want to miss!\n\nEdited April 28, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1597925","commentId":1597925,"userName":"SauronTheGreat","timestamp":1430263382,"content":"I myself am considering going on a spending spree and getting the quests in dwarrowdelf I don't have (FoS and TWitW) and getting road darkens and this box.  I want to know, would that be overkill?  would we get crushed by this box?  We need a challenge cause our dwarf decks can take on any quest including lake town reasonably easily.  But are these new quest hard enough that I shouldn't bother?  I love the saga theme and decided early on that I would get SoM and Dwarrowdelf, and all the sagas.  somehow I ended up with lake town and osgiliath also.  is this worth it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598084","commentId":1598084,"userName":"PsychoRocka","timestamp":1430273222,"content":"> I have only played the first two so far (The Uruk-hai and Helm's Deep).\n> \n>  \n> \n> First off: spoiler alert, obviously.\n> \n>  \n> \n> The first one was on the easy side, I felt.  We won on our first attempt (2-player), then I won on my second attempt (solo 2-handed), then when I tried it 2-player again it took 3 tries, but we beat it on the 3rd attempt without any major deck modifications.  You only get 2 heroes for the entirety of the first quest, not counting the Fellowship Aragorn.  It felt appropriately thematic, as we were 'chasing' a pursuit tracker that got ever closer to its goal.  \n> \n>  \n> \n> I played Helm's Deep a couple of times in a 3-player group, and we lost each time.  It's got a very hard setup (a 4-threat enemy in the staging area, per player, plus 1 reveal per player).  You're meant to lose at questing quite a bit during this scenario, but that tricked my playgroup into believing it was OK to lose at questing early on.  Both times we tried the game, we committed nobody to the quest, giving up the first quest stage without a fight.  This allowed us to clear out some enemies, but then we're that much closer to failure (the encounter deck wins if it clears the 3rd quest stage-- well technically stage 4, but you start counting at 2 so it's the 3rd stage you're fighting over).  There's a very mean treachery in here that sunk us: places 3 progress on the quest and blanks all of your characters' textboxes, making those happy little Response and Actions on your heroes and allies quite worthless.  Gimli in particular was not happy about that, and it kills all your Sentinel and Ranged.  It looked like Helm's Deep would be significantly easier as a solo experience.  \n\nThis treachery is a must cancel for me by the sounds of it. No Response effect on Elrohir and Elladan is bad bad news"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598150","commentId":1598150,"userName":"Pharmboys2013","timestamp":1430278972,"content":"Me and my friend opened our boxes today and took our first stabs at it.  Only had time for the 1st quest and we lost both times we attempted it.  Werent even close really.  Will need to go back to the drawing board on it I suppose"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598180","commentId":1598180,"userName":"GrandSpleen","timestamp":1430280126,"content":"Some great player cards in this box, by the way.  Both heroes are extremely useful, and then you get very nice cards like Arod, Hama ally, Legolas ally... lots to be liked here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598239","commentId":1598239,"userName":"player1922162","timestamp":1430287510,"content":"I thinl that once again they have outdone themselves. All six quests from the two new big boxes are top notch. They are not the most difficult, but none of them are easy. Side quests from Lost Realm are perhaps the best mechanic ever and Helm's Deep is arguably the best quest made so far rivaling Into Ithilien for me.\n\nThe only negative is that the story line does not feel as strong as it did in the two previous cycles but there are six quests left for that to change."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598482","commentId":1598482,"userName":"jjenks476","timestamp":1430312299,"content":"I haven't played the new quests too much, beat Uruk'hai first attempt, then played Helms Deep 3 times, all losses. I enjoy the defense mechanism a lot, I hope they do it again for the assault on minas tirith."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1598916","commentId":1598916,"userName":"Pharmboys2013","timestamp":1430328208,"content":"So this morning tried going at the quests solo. Used a mostly ent focused deck of Treebeard, Merry, and Mirlonde. (Sure Pippin would be thematically perfect, but then I cant play Lembas which is just too good with Treebeard)\n\n \n\nLost pretty quick again on the 1st quest with some pretty unfortunate encounter draws but then beat it on the second attempt.  Was worried though with Ugluk since i was utilizing ally Gandalf as my primary defender and Ugluk's attacks cant be defended by allies.\n\n \n\nThen tried Helm's Deep and actually won on my first attempt.  It was difficult but I had kept things under control for the most part.  I had the benefit of not running into a ton of enemies during staging so even though the encounter deck naturally throws a lot of them at you I was able to manage them well.  It also didnt hurt that I had two booming ents swinging for 6 relatively early on in the game.  The mechanics of Helm's Deep itself were really fun to play.  It was a true paradigm shift in the manner at which the encounter deck works to go thru the quests and it was also a nice touch to have the beneficial locations you actually wanted to keep in play in most cases.  Will be looking forward to going at it again, I doubt I'll easily replicate today's success."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1599752","commentId":1599752,"userName":"soulred","timestamp":1430375235,"content":"Really enjoyed this set!\n\n \n\n1st quest was the most difficult for me. Losing a hero right off the bat brought back some bad memories of Escape from Guldor (thought not nearly as bad). Merry was my captive, which meant losing some of my Hobbit synergy AND my heaviest attacker. Combat was tricky do to all the enemies with toughness, and archery is bad for squishy heroes (again, hobbits). Took several tries but managed to win eventually. I did have to crack my Phial of Galadriel to survive though =(\n\n \n\n2nd quest was the easiest, but probably my favorite out of all three. I loved the defense mechanic and hope we see it show up again!\n\n \n\nLast quest was another tough one. So many different things get thrown at you over the course of the game. Take your time in first stage and get those Ents! They made all the difference for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1607615","commentId":1607615,"userName":"Autobot Tran","timestamp":1430862612,"content":"Just finished playing each quest once 2H solo. First impressions were they are so thematic and awesomely constructed. I really enjoyed this saga box. Aragorn is a monster and his ability is ridonkulous.\n\n \n\nOne deck i had Treebeard Elrond and Pippen. The other deck was Theodred (Spirit) Eowyn and Idraen. I feel like some of the recent cards are sooo powerful, but i like it that way. Tactics Legolas is so strong especially if you can get multiple attacks on him and Treebeard is omg sooooo powerful i love it. \n\n \n\nI beat first quest after the second try and 2nd and 3rd quest on the first try. They were all hard though. I felt like the third one was the easiest cuz the ents help out a ton. The first quest i had trouble with cuz i made 2 fresh decks and being down a hero hurt a lot.\n\n \n\nMy thoughts for the quests are they are thematic home-runs they felt awesome and mirrored the events in the book pretty well. I cant wait for the Road to Isengard nightmare version to come out so Saruman can obliterate me. Anyway i think the saga quests do an excellent job of capturing the events in the book and each quests feels unique and innovative. They might not be the quests i go to to replay over and over to try new decks and new archtypes but Ill definitely play them again to get a feel for specific events in the book"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1608381","commentId":1608381,"userName":"Mndela","timestamp":1430920554,"content":"I haven't still played it, but artwork is really really amazing! Congrats. I see artwork always is better, without never stopping. +10"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1608573","commentId":1608573,"userName":"Bullroarer Took","timestamp":1430926690,"content":"This box is Black Riders good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1608622","commentId":1608622,"userName":"Autobot Tran","timestamp":1430927870,"content":"> This box is Black Riders good.\n\n \n\nI decided to restart the saga quests and OMG i hate hate hate the first quest to the Black Riders, \"a shadow of the past\" maybe its because i make thematic decks to play the quests... or maybe its Hide tests lol i donno but I think im gonna skip that quest everytime i restart"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1608816","commentId":1608816,"userName":"Bullroarer Took","timestamp":1430933696,"content":">  \n> \n> > This box is Black Riders good.\n> \n>  \n> \n> I decided to restart the saga quests and OMG i hate hate hate the first quest to the Black Riders, \"a shadow of the past\" maybe its because i make thematic decks to play the quests... or maybe its Hide tests lol i donno but I think im gonna skip that quest everytime i restart\n> \n>  \n\nI use theme decks for the sagas and I love SooP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1608909","commentId":1608909,"userName":"RebelX","timestamp":1430937390,"content":"> This box is Black Riders good.\n\nThat is great to hear. I think this was the best product they have released so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1609581","commentId":1609581,"userName":"Glaurung","timestamp":1430961995,"content":"> > This box is Black Riders good.\n> \n> That is great to hear. I think this was the best product they have released so far.\n\nBlack riders, Heirs of Numenot and almost all packs in third cycle a best product for the game in my opinion.\n\nReally bad ones is : hobbit sagas boxes. Voice of Isengard and whole fourth cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1609899","commentId":1609899,"userName":"Mndela","timestamp":1430990421,"content":"(to me, the best scenario still is Anduin) ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1609928","commentId":1609928,"userName":"PsychoRocka","timestamp":1430992785,"content":"I love the new box, the new cards are great and the scenarios are both thematic and challenging especially Helms Deep. When I first saw people saying they found this quest fairly easy I was dismayed (I did not have the box yet) but it was very very challenging for me (even had to use up Phial of Galadriel to eventually beat it) which is what I wanted from a quest that tries to encapsulate the epic battle of Helms Deep. Road to Isenguard was pretty great too and I found Saruman pretty awesome. He can raise your threat, make you discard allies etc (via wizardry effects from shadow cards) as well as provide fearsome attacks (at 7 or 8 strength) every time any player draws a card and can heal himself. I think he is somewhat similar to Thaurdir from the Lost Realm mechanically as they both heal themselves from attack effects, are both indestructible but must have no hitpoints remaining to beat the quest and both make multiple attacks a turn based on other effects (players drawing cards or treacheries with the sorcery keyword being revealed) that are based off magic; Sorcery keyword and Wizardry keyword.\n\n \n\nThe Uruk Hai was I suppose less amazing than the other two scenarios but not by much and was still very enjoyable.\nThe new boons and burdens are great too. Beyond All Hope is a thematic and mechanical home run in my opinion, even if I personally have not yet used it and have no immediate plan to either.\n\nAlready cannot wait for the next saga box!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1614298","commentId":1614298,"userName":"Lecitadin","timestamp":1431279575,"content":"The only way I could beat Helm's Deep solo (after a few tries) was by NOT (or almost not) questing during the first 2 stages. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1615271","commentId":1615271,"userName":"koriakin97","timestamp":1431352948,"content":"How does Helm's Deep scenario work with side quests? Does playing e. g. Gather Information mean that we get a turn without questing and powerful effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1615363","commentId":1615363,"userName":"danpoage","timestamp":1431356617,"content":"Not exactly, though side quests do help some. The current quest stage along with all side quests are in play, so the forced effects on (for example) stage 2 would still trigger - even when the active quest is a side quest. Player side quests can still help with Helm's Deep, as they allow you to quest normally (they don't have the Defense keyword) and avoid having to put progress on the main quest stage. Now if only there was some way to mitigate all of the terrible locations in that quest.\n\nEdited May 11, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1615402","commentId":1615402,"userName":"koriakin97","timestamp":1431357672,"content":"You're right, I forgot that they don't have the keyword. And for locations we have Thor's key  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1615908","commentId":1615908,"userName":"Mich the One","timestamp":1431378236,"content":"(sorry for going off-topic, but I do not want to start a new thread for this)\n\nMy box of Treason of Saruman seems to be missing one card. Has it happened to anyone else? I seem to be missing 1A/1B for Helms Deep and it is killing me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1616563","commentId":1616563,"userName":"gandalfDK","timestamp":1431425648,"content":"http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS [http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS]\n\n \n\nThis one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1616945","commentId":1616945,"userName":"Mich the One","timestamp":1431444218,"content":"> http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS [http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS]\n> \n>  \n> \n> This one?\n\n \n\nyes, this one. I guess I can proxy it...\n\nStill, just for the sake of it, I contacted FFG customer support and asked for help. I would be impressed if they shipped one little card over the ocean, though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 12, 2015 by Mich the One"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1617214","commentId":1617214,"userName":"Eldainorn","timestamp":1431451786,"content":">  \n> \n> > http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS [http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS]\n> > \n> >  \n> > \n> > This one?\n> \n>  \n> \n> yes, this one. I guess I can proxy it...\n> \n> Still, just for the sake of it, I contacted FFG customer support and asked for help. I would be impressed if they shipped one little card over the ocean, though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\n \n\nBelieve me, I am sure they will. They shipped Arkenstone (the treasure card from Hobbit box of course, not the real one =P) over the ocean for me. And you are no different. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 12, 2015 by Eldainorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1620623","commentId":1620623,"userName":"Mich the One","timestamp":1431619660,"content":">  \n> \n> >  \n> > \n> > > http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS [http://hallofbeorn.com/Cards/Details/The-King-of-the-Golden-Hall-ToS]\n> > > \n> > >  \n> > > \n> > > This one?\n> > \n> >  \n> > \n> > yes, this one. I guess I can proxy it...\n> > \n> > Still, just for the sake of it, I contacted FFG customer support and asked for help. I would be impressed if they shipped one little card over the ocean, though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> > \n> >  \n> \n>  \n> \n> Believe me, I am sure they will. They shipped Arkenstone (the treasure card from Hobbit box of course, not the real one =P) over the ocean for me. And you are no different. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\n \n\nWow, they actually did. Just got a shipping confirmation. That is quality customer service on FFG's part, I am impressed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1630107","commentId":1630107,"userName":"Tracker1","timestamp":1432170523,"content":"Just played the first scenario a number of times.\n\nFor starters I had to try Gimili and Legolas heroes with Aragorn. No big surprise, they did not do so well.\n\nI did learn a lot about the quest, and it seemed quite difficult, and strong questing was going to be important to catch up to the orcs. Very nice pursuit mechanic. Also, having to deal with some pretty tough enemies early on was a challenge, toughness keyword is making these guy harder to finsh off.\n\nSo I put together a deck I was much happier with and still fit the theme of the scenario somewhat.\n\nI used the new spirit Theoden along with Theodred. Really like the new Theoden. Seems like he's going to open up a lot of new rohan possibilites.\n\nHave not gotten to the next 2 scenarios yet, but I'm happy that I'll be able to reserect Gandalf. The designers did a great job with that surprise. Very cool to see the story reflected so well in the game here, well other than the 3 hunter heroes not really being playable for the scenario, but oh well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1630181","commentId":1630181,"userName":"GrandSpleen","timestamp":1432174680,"content":"They are playable in 2-handed :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  My own thematic playthrough used Gimli/Legolas on one side, and Theoden/Eowyn on the other (captives were Merry and Pippin)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1631044","commentId":1631044,"userName":"Bullroarer Took","timestamp":1432225535,"content":"At the end of TRD I had Sam and Pippen(Sp) in one hand and Aragorn (Lo), Merry (T) and Boromir (T) in the other.  Merry and Pippen were taken captive.\n\n \n\nSo for Chasing the Uruk-Hai I decided to go back to one handed since I assumed I would want Sam on the next leg.  This left me with Boromir and a free hero to replace Aragorn.  As many have already found out, the Three Hunters can't quest their way out of a paper bag.  So I replaced Aragorn with Eowyn and it became easy.  For Helm's Deep I added Théoden and while it was hard, I have beaten the quest.  I haven't had time to play Isengard yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1631464","commentId":1631464,"userName":"GrandSpleen","timestamp":1432241682,"content":"Actually now that I think about it, I had Sam/Theoden on one side (not Eowyn) because Sam was in my group at the end of Breaking.  Was sort of disappointed that I didn't get to switch him out for free, but I kicked him out as soon as I got to Helm's Deep so it's all good.  Go catch up to Mr. Frodo, Sam!\n\n \n\n \n\n> At the end of TRD I had Sam and Pippen(Sp) in one hand and Aragorn (Lo), Merry (T) and Boromir (T) in the other.  Merry and Pippen were taken captive.\n\n \n\nOo, did you sacrifice Gandalf and then just leave him out for Breaking?  So only 2 heroes on one end of the table?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1631651","commentId":1631651,"userName":"Bullroarer Took","timestamp":1432251449,"content":"Yes.  It worked really well because Sam and Spippen turned into a really good secrecy/support deck. And it wasn't that hard to get Sentinal on Boromir to defend them.  Spippen could always send the enemy back to staging too, but in practice that was never needed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1631814","commentId":1631814,"userName":"Ecthelion III","timestamp":1432262989,"content":"> Yes.  It worked really well because Sam and Spippen turned into a really good secrecy/support deck. And it wasn't that hard to get Sentinal on Boromir to defend them.  Spippen could always send the enemy back to staging too, but in practice that was never needed.\n\n \n\nYou use Spirit Pippin?  I salute you, sir!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1631862","commentId":1631862,"userName":"Bullroarer Took","timestamp":1432265957,"content":"Embrace the blue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1644530","commentId":1644530,"userName":"leptokurt","timestamp":1433181326,"content":"Seems I am to dumb to defeat the first quest. How on earth can I keep that cursed track below 30? It always takes me 6-7 turns before I can finish stage 1, so that's at least 22-24 points. Then there are some enemies, treacheries and when revealed effects, travel effects and stuff... :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nAnd even when I have that done in time, I get always stomped by Ugluk. I'm playing spirit Theoden and Thedored plus Erkenbrand as the prisoner, not in campaign mode.\n\n \n\n \n\nETA: Just won a game, but basically it was because I got all the good cards when I needed them most.\n\nEdited June 1, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1645029","commentId":1645029,"userName":"Spurries","timestamp":1433208576,"content":"I managed to beat \n\n \n\n> Seems I am to dumb to defeat the first quest. How on earth can I keep that cursed track below 30? It always takes me 6-7 turns before I can finish stage 1, so that's at least 22-24 points. Then there are some enemies, treacheries and when revealed effects, travel effects and stuff... :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n> \n>  \n> \n> And even when I have that done in time, I get always stomped by Ugluk. I'm playing spirit Theoden and Thedored plus Erkenbrand as the prisoner, not in campaign mode.\n> \n>  \n> \n>  \n> \n> ETA: Just won a game, but basically it was because I got all the good cards when I needed them most.\n\n \n\nI was just able to beat it with Boromir and Eowyn, lot of questing alies and only tactics cards were to get boromir boosted.  Song of Travel turn 1 was a must for early 2 cost allies.\n\n \n\nWould be interested in other's solo decks, anyone post one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1645159","commentId":1645159,"userName":"Ecthelion III","timestamp":1433217336,"content":"I don't have a decklist right now, but I completed it solo with Gandalf/Treebeard (Glorfindel as the prisoner). The pursuit value was 22 or 23 at the end."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1645292","commentId":1645292,"userName":"leptokurt","timestamp":1433230565,"content":"Well, thankfully I found Tracker1's \"protector deck\" https://community.fantasyflightgames.com/index.php?/topic/177561-aragorn-protector-of-helms-deep-solo-deck/ [https://community.fantasyflightgames.com/index.php?/topic/177561-aragorn-protector-of-helms-deep-solo-deck/]which is pretty cool. Unfortunatly I am not in these attachement driven decks (and I have only one core set plus I try to keep the theme by not including Steward of Gondor)). However, it reminded me that I totally forgot to include Blood of Numenor which is a big help in the fight against Ugluk. I'm still loosing like 80 percent of may games, but it helps to know that it is at least possible to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1646497","commentId":1646497,"userName":"Spurries","timestamp":1433296044,"content":"Today I ran Boromir Sam Balin leadership deck with a lot of allies, visionary leadership(think it is 95% one of Tracker1s, I have since added Galadriel and Gimli who rule in this deck) and absolutely housed Helms Deep solo.  Stayed on Stage 2A for the entire quest until I made it to stage 5A.  Had a decent draw from encounter deck, with no nasty treacheries poppping out, but was able to travel strategically and let the deck make a little progress if it suited the situation.  This quest certainly seems easier for solo players(for once) but it honestly might be my favorite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1650602","commentId":1650602,"userName":"Glaurung","timestamp":1433588238,"content":"I dont understand when people build up a power decks(what they should do eventually if they come to certain level) and play standard and proud to win. I dont even bother myself to play TOS until nightmare come. I know I will win most of the time from first attempt. So if you know the game mightmare is your level. Couse only nightmare give you a real expirience of middle earth journey!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1650635","commentId":1650635,"userName":"tricil","timestamp":1433592009,"content":"Fully agree with Glaurung! To get a decent and challenging solo play experience these days, you either have to play Nightmare mode or build decks without Boromir, Gandalf, Glorfindel and Elrond (did I forget anyone?). Helm's Deep is certainly a great quest but it's also so much more fun if you can beat without any power cards.\n\n \n\nEdit: I guess I should add Hama and Galadriel to the list. They can make a quest so boring...\n\nEdited June 6, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1650720","commentId":1650720,"userName":"PocketWraith","timestamp":1433600966,"content":"> Fully agree with Glaurung! To get a decent and challenging solo play experience these days, you either have to play Nightmare mode or build decks without Boromir, Gandalf, Glorfindel and Elrond (did I forget anyone?). Helm's Deep is certainly a great quest but it's also so much more fun if you can beat without any power cards.\n> \n>  \n> \n> Edit: I guess I should add Hama and Galadriel to the list. They can make a quest so boring...\n\nDain/Dwarves and Hirluin/Outlands should also be on that list for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1651097","commentId":1651097,"userName":"Ecthelion III","timestamp":1433637914,"content":"> Fully agree with Glaurung! To get a decent and challenging solo play experience these days, you either have to play Nightmare mode or build decks without Boromir, Gandalf, Glorfindel and Elrond (did I forget anyone?). Helm's Deep is certainly a great quest but it's also so much more fun if you can beat without any power cards.\n> \n>  \n> \n> Edit: I guess I should add Hama and Galadriel to the list. They can make a quest so boring...\n\n \n\nBrandon will kill you for hurting on Boromir. :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\n \n\nWhile I use Gandalf because he's fun to play, I always avoid including Elrond and Eagles/Gildor in my Gandalf decks, even in Nightmare. Vilya is a cheap and boring card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1651158","commentId":1651158,"userName":"Seastan","timestamp":1433643827,"content":"I found that the current power of Rohan decks are well suited to the Treason of Sauman. Rohan decks are not quite at the same level as the broken power decks, and still leave a good and thematic challenge. I was playing campaign mode and had Theoden fall in helms deep. Theodred stepped up and took his place in the Road to Isengard to wreck vengeance upon Saruman for his fallen father. It was quite fun.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1666574","commentId":1666574,"userName":"FeloniusBard","timestamp":1434868357,"content":"Report on 4-player: \n\n \n\nQuest 1 is fun, but relatively easy if you don't play a thematic deck. Any of the standard \"power\" heroes combinations should win this scenario. I'd put the difficulty at maybe 4 out of 10. \n\n \n\nQuest 2 is more difficult but still quite beatable. We never even sniffed quest stage 4, we managed to win from 3B. However, 3 of 4 players were running full or partial Spirit decks. Between the 4 of us we easily canceled 7 or more treacheries, so some of the really nasty stuff we avoided. The other card that makes this quest much easier is Thror's key for those culvert/sewer locations that bring out more enemies. This quest really just demands having a balance of all the usual abilities---sentinel + ranged, and a sizable dose of healing. \n\n \n\nOne other thing---I don't know if we did it right or not, but there are a couple of 2 progress locations that you can get rid of using Asfaloth during the refresh phase action window that doesn't trigger the nasty effect. I'd rate the difficulty at about 6 out of 10. We were never really comfortable the entire game, but we were never really in danger of losing either. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1666952","commentId":1666952,"userName":"GrandSpleen","timestamp":1434905527,"content":"> One other thing---I don't know if we did it right or not, but there are a couple of 2 progress locations that you can get rid of using Asfaloth during the refresh phase action window that doesn't trigger the nasty effect. I'd rate the difficulty at about 6 out of 10. We were never really comfortable the entire game, but we were never really in danger of losing either. \n\n \n\nThere's one location with a wizardry effect that makes you exhaust characters.  Is that what you're thinking of?  If you used Asfaloth during the Refresh phase, it would have to be *after* characters were readied, as there is no action window in the Refresh phase before that.  So any characters exhausted by the wizardry effect would remain exhausted through the following round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1666973","commentId":1666973,"userName":"Ecthelion III","timestamp":1434906581,"content":">  \n> \n> > One other thing---I don't know if we did it right or not, but there are a couple of 2 progress locations that you can get rid of using Asfaloth during the refresh phase action window that doesn't trigger the nasty effect. I'd rate the difficulty at about 6 out of 10. We were never really comfortable the entire game, but we were never really in danger of losing either. \n> \n>  \n> \n> There's one location with a wizardry effect that makes you exhaust characters.  Is that what you're thinking of?  If you used Asfaloth during the Refresh phase, it would have to be *after* characters were readied, as there is no action window in the Refresh phase before that.  So any characters exhausted by the wizardry effect would remain exhausted through the following round.\n> \n>  \n\nI think he's talking about Helm's Deep (specifically Postern Door). Helm's Gate is also good to use Asfaloth on, although it's 2 quest points.\n\nEdited June 21, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1667017","commentId":1667017,"userName":"SauronTheGreat","timestamp":1434910600,"content":"> Fully agree with Glaurung! To get a decent and challenging solo play experience these days, you either have to play Nightmare mode or build decks without Boromir, Gandalf, Glorfindel and Elrond (did I forget anyone?). Helm's Deep is certainly a great quest but it's also so much more fun if you can beat without any power cards.\n> \n>  \n> \n> Edit: I guess I should add Hama and Galadriel to the list. They can make a quest so boring...\n\nDefinitely add Sprifindel to that list.  I think he is probs the most powerful hero in the game with light.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1667034","commentId":1667034,"userName":"GrandSpleen","timestamp":1434912910,"content":"Oh yeah, thought we were talking about Road to Isengard for some reason"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1673460","commentId":1673460,"userName":"Glaurung","timestamp":1435382142,"content":"> > Fully agree with Glaurung! To get a decent and challenging solo play experience these days, you either have to play Nightmare mode or build decks without Boromir, Gandalf, Glorfindel and Elrond (did I forget anyone?). Helm's Deep is certainly a great quest but it's also so much more fun if you can beat without any power cards.\n> > \n> >  \n> > \n> > Edit: I guess I should add Hama and Galadriel to the list. They can make a quest so boring...\n> \n> Definitely add Sprifindel to that list.  I think he is probs the most powerful hero in the game with light.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nIf you are a experience player just play Night6. All heroes is ok in nightmare."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691036","commentId":1691036,"userName":"Nickpes","timestamp":1436807649,"content":"Have a question after playing Helms Deep. It was the last battle, the enemy with 5 att which place three progress when destroying a character, was attacking Erkenbrand. If he would kill him (he had three damage already) I would lose the game. If not, then I would kill him on my attack turn and would win the game. The acting location was the wall that gives me +1 defence ane I had a shield on Erkenbrand.\n\n \n\nUnfortunatelly the shadow that adds a progress on active location and gives +1 attack on my enemy appeared, which means I lost the game.\n\n \n\nThen I had a thought and would like you help guys. If I would use the last damage point of Erkenbrand to cancel the shadow, would it still count that the enemy killed him (placing the three progress tokens on activbe location exploring it and raising my threat on 51) or not and the attack would go undefended (which might have win the game for me) ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691061","commentId":1691061,"userName":"GrandSpleen","timestamp":1436808932,"content":"If you use Erkenbrand's ability to place the damage, he'll die and the attack will go undefended.  The attack itself did not destroy a character, so you won't have to place 3 progress.   But then you've still got a 5 or 6 point undefended attack that will probably destroy another hero, place 3 progress on that active location, and cause your threat to raise to 51 anyway.\n\n \n\nI'm not sure whether that would be a 5 or 6 point attack.  If you use Erkenbrand's ability and it kills him, do you still cancel the shadow effect?  I suppose the answer is yes, but I'm not sure.  He would go into the discard pile before you finish resolving the effect, I think, but I don't know if going into the discard pile would prevent the remainder of the text from resolving (probably not?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691492","commentId":1691492,"userName":"PsychoRocka","timestamp":1436831307,"content":"Whether or not Erkenbrand is killed by the initial attack or not and whether or not the shadow is cancelled, the undefended attack will kill a hero which will still place the progress and consequently raise your threat as Grandspleen mentioned. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691526","commentId":1691526,"userName":"GrandSpleen","timestamp":1436834247,"content":"Unless he's got some fancy Treebeard with 7 HP or Beorn!\n\n \n\nOr a Defender of the West floating around, or White Tower Watchman! \n\nEdited July 14, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691577","commentId":1691577,"userName":"PsychoRocka","timestamp":1436838428,"content":"Very true. White Tower Watchman would still fall to that attack however still resulting in a dead character from said attack. \n\nMost allies with defender of the west would as well. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691652","commentId":1691652,"userName":"GrandSpleen","timestamp":1436844178,"content":"good point, dunno why I didn't think of that!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1691660","commentId":1691660,"userName":"Nickpes","timestamp":1436844493,"content":"Or maybe Aragorn with the attachment that gives bonus hit points for the Artifact (and offcourse treebeard)\n\n \n\nSO Erkenbrand would not be killed by the initial attack and it would go undefended is what I understand. Do not remember if that would be any good to me right now, but it was something I thought later and did not know the answer  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 14, 2015 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1698843","commentId":1698843,"userName":"Nickpes","timestamp":1437455715,"content":"Tried the Road to Isengard today ... lost (though I played wrong damaging myself since I read wrongly stage 2), but have a question\n\n \n\n \n\nStage 1 has that players cannot gain resources and cards, so in a solo game , player starts with 7 cards and 4 resources (including Aragorn). Since I do not get any resources on planning phase, I can get at MOST only ONE Ent of Fangorn, right ? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1698853","commentId":1698853,"userName":"PsychoRocka","timestamp":1437457596,"content":"You start with six cards and no resources. During the first resource phase each hero gets one resource and each player draws one card. Because Stage 1 dictates that players cannot draw cards or gain resources you do not draw your seventh card or place resources until you are at stage 2.\n\n \n\nDrawing your seventh card and putting resources on heroes is NOT part of setup it is what happens during the first resource phase of the first round/turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1698866","commentId":1698866,"userName":"PsychoRocka","timestamp":1437458982,"content":"Not sure what resources or cards have to do with how many Ents you can get anyway?\n\nIf you have four heroes that can all perform the \"quest action\" on Ent of Fangorn the most resource tokens you can place per turn is 4, so you can get one ent and put a resource on another (each needs 3 resources to join you).\n\nYou could theoretically get all four under your control in 3 turns in Solo, 4 resources across 3 turns is 12 resources getting you each ent. If you have even one hero with 2 or less willpower however this is extremely unlikely. \n\nIn two handed play I managed to get all four across two turns but most attempts it takes three turns. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/174488-how-does-everybody-feel-about-sarumans-treason-quests/?do=findComment&comment=1698912","commentId":1698912,"userName":"Nickpes","timestamp":1437464718,"content":"> You start with six cards and no resources. During the first resource phase each hero gets one resource and each player draws one card. Because Stage 1 dictates that players cannot draw cards or gain resources you do not draw your seventh card or place resources until you are at stage 2.\n> \n>  \n> \n> Drawing your seventh card and putting resources on heroes is NOT part of setup it is what happens during the first resource phase of the first round/turn. \n\n \n\nUps ... I just realized that I played it all wrong ... I thought I should place resources from my heroes on the Ent of Fangorn ... stupid me :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]  ... thanks  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}