{"url":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/","title":"Treebeard + Gimli + Song of Mocking = crazy combo??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598164","commentId":1598164,"userName":"Pharmboys2013","timestamp":1430279573,"content":"Not sure if this is legitimate or not, so wanted to pose this to the forums to see if its a valid combo or not.\n\n \n\nSo would using Treebeard's ability and putting the damage on Gimli from song of mocking still net Treebeard his stat boosts? It would be kinda crazy, and cool for that matter to have the potential to quest for 6 and attack for 6 using only two heroes and 1 player card.\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598168","commentId":1598168,"userName":"GrandSpleen","timestamp":1430279787,"content":"hmm good question!  I lean toward 'no, wouldn't work.'\n\n \n\nTreebeard says: \"Action: Deal 1 damage to Treebeard to give him +1 Willpower and +1 Attack until the end of the phase. (Limit 5 times per phase.)\" \n\n \n\nIf you haven't dealt him damage, you can't get the +willpower etc.  And I believe Song of Mocking prevents damage from ever being placed on the target hero (otherwise it could not prevent damage that would be fatal -- the damage would be dealt and the hero would be discarded before the damage got moved to the Song of Mocking hero).  But I seem to remember some weird discussions about the Song of Mocking's timing long ago, and no clear resolution comes to mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598185","commentId":1598185,"userName":"Pharmboys2013","timestamp":1430280420,"content":"Yea I get what you're saying.  Still not sure I feel conclusive about it. If Treebeard's ability was worded more like \"Action: Deal 1 damage to Treebeard.  Gain +1 WP and +1 ATK this phase for each damage dealt to Treebeard using this effect. (limit x5 per phase)\" then i would feel more solidly that it wouldnt work since it explicitly states Treebeard needs to have taken damage.  \n\n \n\nI guess the core of it is if theres a difference between being dealt damage and actually taking damage in regards to player card effects.  If that even makes sense...my head hurts"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598218","commentId":1598218,"userName":"PocketWraith","timestamp":1430283800,"content":"I'm pretty sure a similar question came up a while back and the answer was no, if an ability triggers off a character being dealt damage, they have to actually be dealt damage for it to work, not have that damage cancelled or moved elsewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598230","commentId":1598230,"userName":"GrandSpleen","timestamp":1430284966,"content":"This one is not perfectly analogous as the wording is different, but here [https://community.fantasyflightgames.com/index.php?/topic/130200-dori-gloin-combo/?hl=gloin] is a thread stating that Gloin can't get resources if Dori is used to intercept his damage.  The official response is this:\n\n \n\n\"You cannot trigger Gloin’s ability unless you actually place the damage tokens on him. Dori’s ability intercepts the damage before it is placed on the hero.\nI hope you’re enjoying The Hobbit saga expansion!\nCheers,\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598237","commentId":1598237,"userName":"Pharmboys2013","timestamp":1430286196,"content":"yea, didnt know if there was precedence or not.  think i'm just going to avoid doing it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598264","commentId":1598264,"userName":"entMoot","timestamp":1430290349,"content":"I agree with GrandSpleen that this should be taken in analogy to the Gloin ruling.\n\n \n\nWhen a card uses language like \"Deal 1 damage to Treebeard to...\", dealing the damage is a cost. If you do not deal the damage to Treebeard you are not paying the cost.\n\n \n\nI believe that if the card were worded \"Deal 1 damage to Treebeard. Treebeard gets...\", then the damage could be dealt to someone else with Song of Mocking (or prevented by other means). Since the damage isn't a cost with this second templating, the ability would still function."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174520-treebeard-gimli-song-of-mocking-crazy-combo/?do=findComment&comment=1598303","commentId":1598303,"userName":"OlorinCZ","timestamp":1430294788,"content":"Agreed.\n\nThe same with the Erkenbrand. You actually have to put that damage on the character. "}]}