{"url":"https://community.fantasyflightgames.com/topic/174716-playing-with-fellowship-heroes-artifacts-and-boons/","title":"Playing with Fellowship Heroes, Artifacts and Boons","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174716-playing-with-fellowship-heroes-artifacts-and-boons/?do=findComment&comment=1600610","commentId":1600610,"userName":"Edvando","timestamp":1430417682,"content":"Hello beloved LOTR players!\n\n \n\nMy brother really love playing with hobbits. When we used to play LOTR from Decipher, he had a deck that used all four main hobbits; Frodo, Sam, Merry and Pippin. His favorite quests are from the saga boxes that let him put frodo in his deck. We ignore the first player takes Frodo rule shamelessly for his enjoyment. I think he would much more inclined to play if he could have frodo em any quest, but I want to balance that because he get one more hero for free.\n\n \n\nWhat are the tried and true ways that people have came up with in this forum to balance the fact that we use Frodo?\n\n \n\nAlso, the boons are mostly getting dirty in the box. Anyway to put then into our decks in a balanced way?\n\nEdited April 30, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174716-playing-with-fellowship-heroes-artifacts-and-boons/?do=findComment&comment=1600756","commentId":1600756,"userName":"Thanatopsis","timestamp":1430423258,"content":"You could\n\n- play nightmare with four heroes\n\n- not let Frodo collect resources (essentially treat him as an ally)\n\n- choose three of the four heroes to receive resources each round\n\n \n\nBy design the burdens offset the boons. Feel free to throw in Sting, but you better throw in Gandalf's Delay as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/174716-playing-with-fellowship-heroes-artifacts-and-boons/?do=findComment&comment=1603607","commentId":1603607,"userName":"Ecthelion III","timestamp":1430632601,"content":"I sometimes just go and play a random non-saga quest with all of the boons and burdens in my Campaign Pool. I use Fellowship Frodo or Aragorn when I do without any shame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174716-playing-with-fellowship-heroes-artifacts-and-boons/?do=findComment&comment=1606116","commentId":1606116,"userName":"Edvando","timestamp":1430797674,"content":">  \n> \n> - not let Frodo collect resources (essentially treat him as an ally)\n> \n> - choose three of the four heroes to receive resources each round\n\n \n\nI like those ideas.\n\n \n\nHow many burdens should I put to balance having essentially a free ally in play?\n\n \n\n>  \n> \n>  \n> \n> Feel free to throw in Sting, but you better throw in Gandalf's Delay as well\n\n \n\nIn my mind having 1 sting in my deck that may or may not appear is not really balanced with 1 less card in my hand (which lessen my chance to find sting). Some burdens are somewhat quest specific."}]}