{"url":"https://community.fantasyflightgames.com/topic/174859-text-box-blanking-vs-keyword-abilities-granted-by-other-cards/","title":"Text box &quot;blanking&quot; vs. keyword abilities granted by other cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/174859-text-box-blanking-vs-keyword-abilities-granted-by-other-cards/?do=findComment&comment=1602416","commentId":1602416,"userName":"GrandSpleen","timestamp":1430516102,"content":"I recently had a question about cards that \"blank\" the text box of other cards.  I submitted the question to the designers and got a reply, and thought I would share it here.\n\n \n\nDevilry of Saruman [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/lord-of-the-rings-saga-expansions/the-treason-of-saruman/devilry-of-saruman-r1405] (Helm's Deep treachery) has: When Revealed: Place 3 progress on the current quest (bypassing any active location). Until the end of the round, treat each character’s text box as blank (except for Traits).  (not \"printed text box\")\n\n \n\nShadow of Fear [http://hallofbeorn.com/Cards/Details/Shadow-of-Fear-RD] (Road Darkens Burden treachery) has: When Revealed: Treat the printed text box of each character in play as blank (except for Traits) until the end of the round.  (\"printed\" text box)\n\n \n\nMy question was: how about cards that grant keyword abilities, such as Ranged (Dunedain Cache) and Sentinel (Arwen)?  Do these get \"blanked\" out by treacheries like the ones above?\n\n \n\nHere's the official answer:\n\n \n\n\"Both Shadow of Fear and Devilry of Saruman work the same way. 'Printed text box' is the most accurate term, but sometimes it is shortened to 'text box' for space. If a card effect grants a character Ranged, Sentinel, or some other ability, it will not be canceled by either of those two treacheries. \nI hope you’re enjoying Helm’s Deep!\nCheers,\nCaleb\"\n\n \n\nThis was also confirmed to be the same with Thror's Key.  Some encounter cards give text to other cards, like Tangled Woods [http://hallofbeorn.com/Cards/Details/Tangled-Woods-VoI] (each Forest location gains \"Exhaust a hero to travel here\").  If Thror's Key is on a location, it still gains the effect added by Tangled Woods."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174859-text-box-blanking-vs-keyword-abilities-granted-by-other-cards/?do=findComment&comment=1602439","commentId":1602439,"userName":"OlorinCZ","timestamp":1430516800,"content":"Good to know.\n\nNow image if Legolas had a Rivendell bow giving him otherwise plus 1.\n\nIf one of those treacheries come into play would he still have ranged because of the bows effect?\n\nI would think so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/174859-text-box-blanking-vs-keyword-abilities-granted-by-other-cards/?do=findComment&comment=1602657","commentId":1602657,"userName":"GrandSpleen","timestamp":1430531168,"content":"Yeah, I agree with you -- Normally if you attach Rivendell Bow to a character, they get Ranged.\n\n \n\nIf they already have a printed Ranged keyword, the bow gives them +1 attack.\n\n \n\nIf Legolas's printed text box is considered blank (due to a treachery effect), Rivendell Bow will grant him Ranged, but not +1 to his attack (the printed Ranged word is nonexistant for the moment).\n\nEdited May 2, 2015 by GrandSpleen"}]}