{"url":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/","title":"Helms Deep and player side quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1603567","commentId":1603567,"userName":"PsychoRocka","timestamp":1430627457,"content":"So I'm not sure exactly what the go is with the new Saga quest Helms Deep and its interaction with player side quests.\n\n \n\nFor example if you play Gather Information while at stage 2, 3 or 4 what exactly happens.\n\nSo as we know when there are side quests (encounter or player) in play at the beginning of each quest phase you choose which quest is the current quest for this phase.\n\nIf for example you choose Gather Information does it gain the defense keyword? Every quest stage in play still contributes its effect whether it is the current quest or not. See this rules discussion:\n\nhttps://community.fantasyflightgames.com/index.php?/topic/174096-side-quest-and-principal-quest/ [https://community.fantasyflightgames.com/index.php?/topic/174096-side-quest-and-principal-quest/]\n\n \n\nHowever when you look at the rules for defense it is the same as for siege and battle and only applies if a quest with Defense is the current quest so therefore Gather Information would allow you to quest normally when you choose it to be the current quest.\n\nYou can therefore play Gather Information, choose it to be the current quest each turn and even if you do not quest successfully rather than playing progress on Stage 2 3 or 4B (getting closer to defeat) you will instead gain threat. Even if you do quest successfully if you take multiple turns to clear Gather Information (or even if you do so in one go really) that is still a few turns you did not have to stop the encounter deck placing progress on the quest via the defense mechanic and a few easily earned tokens on Defense of Helms Deep.\n\nTo me this seems a little bit dodgy and can give you a fair bit of an advantage/edge in this quest if you use multiple player side quests to get tokens on Defense of Helms Deep without having to defend against the actual siege. I guess on the flip side you may accidentally have your threat raised by A LOT by using this strategy considering the very high threat this quest generates and consequently may threat out or have too many enemies engage and destroy you due to a higher threat than normal.\n\nJust wanted to bring up this weird interaction with player side quests and this saga quests mechanics. I am not even really 100% sure this is how it works so avoided using gather information in all my games against this quest as I just was not sure how it would work and did not want to risk playing incorrectly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1603587","commentId":1603587,"userName":"GrandSpleen","timestamp":1430629494,"content":"Yeah, I looked into that too.  Gather Information (and any other sidequests that are coming up) really neuter Helm's Deep if you can quest well.  In my 2-player games so far, I have not had any trouble gaining advantage over the encounter deck by round 2 or 3, and they stop putting progress down.  \n\n \n\nThis means I can safely play Gather Information without risk of raising my threat. \n\n \n\nIn my opinion, The Defense of Helm's Deep [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/lord-of-the-rings-saga-expansions/the-treason-of-saruman/the-defense-of-helm%E2%80%99s-deep-r1395] objective card should really have different text.  It says \"Forced: At the end of the quest phase, place 1 resource token here.\"  When you get 8 resource tokens, you go to stage 5.  It would be better to limit the adding of resources.  Making it occur only when stage 2, 3, or 4 was the active quest during that quest phase.  Maybe change the text to \"Forced: After resolving the quest in which Assault on Helm's Deep, The Hosts of Isengard, or The Wall is Breached was the active quest, place one resource token here.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1603638","commentId":1603638,"userName":"PsychoRocka","timestamp":1430636107,"content":"Do you start at 1B or 2B because I found Helm's Deep extremely challenging starting at 2B and it takes me many turns to match the threat in staging and stop it from placing progress and even then nasty shadow and treachery effects can still place progress..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1603956","commentId":1603956,"userName":"GrandSpleen","timestamp":1430668312,"content":"I really don't want to earn Poisoned Counsels so I have been going straight to 2B.  First turn we always lose questing, but by turn 2 they either make a tiny bit of progress, or we've got it locked down.  Mostly this is because we are clearing enemies, not building willpower.  We're doing that too, but it's more of a slow buildup.\n\n \n\nOur decks are Gimli/Legolas/Treebeard, which sends nobody questing, and Theoden(Sp), Eowyn, Erkenbrand, which sends everybody except Erkenbrand, including any allies that managed to get down on the table.  We also send Aragorn.  \n\n \n\nWe try to save our cancels for the awful Devilry of Saruman card (blanking text boxes and placing 3 progress).  But we have had to use them against that silly Warrior of Dunland's immediate attack.  He likes to come out as a result of 2B's forced effect, at the end of the combat phase, forcing an attack when everyone is exhausted.  \n\n \n\nWe haven't won yet, but losses have been due to hero death or threating out (it's a campaign, so we have to be perfect!), not due to progress.  We haven't yet been forced onto stage 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1604457","commentId":1604457,"userName":"PsychoRocka","timestamp":1430708682,"content":"Haha yeah I really didn't want to earn Poisoned Counsel either. \n\nSorry for whatever reason I assumed that you had already beaten it, lots of people seem to be reporting having little trouble beating it which seems bizarre as it seems crazy hard to me. Perhaps some players are forgetting the trigger on Stage 3B and the trigger on Helms Gate that make stage 3 just awful and capable of revealing 4 cards a turn instead of 2 against two players. \n\nYeah Devilry of Saruman is a more or less must cancel for me as well as it shuts down mega defender Elrohir... \n\nYeah Warrior of Dunland is definitely one nasty foe, 5 attack, attacks as soon as he enters play, has archery, has 4 threat..... so nasty!!\n\nYeah fair enough, see until my victory I was suffering the opposite and could handle combat but not threat and progress being placed on quest stages. Then again I was leaving an enemy or two in staging and only taking on what I could handle (2 to 3 enemies a turn, 4+ if I have everything in place) and not taking on every foe.  Considering within a few turns you are easily handling threat and questing maybe leave enemies with less threat in staging a little longer to make combat less intense? \nHaven't been forced to stage 3 yet thats very impressive, I'm sure with a few more attempts you will get there =)\nI had to use up my Phial of Galadriel to get my win though....."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1604500","commentId":1604500,"userName":"GrandSpleen","timestamp":1430711864,"content":"Yeah, I tried 5 more times today and something just went wrong every time.  2 or 3 of those were turn-1 or turn-2 losses due to hero death (the shadow effect on Shadow of Fear [http://hallofbeorn.com/Cards/Details/Shadow-of-Fear-RD]is such a jerk).   The longer games saw us on stage 2 and stage 3.  I handle enemies fine, but can get location locked and that pushes me through the quest stages faster.    I got 5 tokens on The Defense of Helm's Deep once, and was doing fine with only 1 token on stage 3.  Then a hero died (Shadow of Fear!!).  I got 7 tokens (!!) another time, but that time was the time I lost to progress defeating stage 4.\n\n \n\nWill try again tomorrow, "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1604601","commentId":1604601,"userName":"PsychoRocka","timestamp":1430721188,"content":"Shadow of Fear is an AWFUL treachery (shadow effect too!), I personally grabbed Pursued by the Enemy instead  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175002-helms-deep-and-player-side-quests/?do=findComment&comment=1605436","commentId":1605436,"userName":"GrandSpleen","timestamp":1430764535,"content":"Finally won, and it was a very very close game.  I had to use two boons: Ho! Tom Bombadil! canceled a staging area attack from a Warrior of Dunland, and Leaf-Wrapped Lembas stalled the encounter deck from making progress by allowing me to quest with everyone and then ready them for combat.  Lots of damage to go around, but I managed to get a Warden of Healing into play by round 4 or so, and a Self-Preservation onto Treebeard later on.  He had a Burning Brand but it wasn't all that crucial, and he converted from defender to quester in the last couple of rounds.  Had a nice thematic ending, using Aragorn's readying effect to repeatedly ready Theoden for his ride out.  Threat ended at 47 for the Rohan deck and 49 for Gimli and Legolas.  Gimli definitely won the contest. But just to spite the encounter deck, Legolas used his Response to put progress tokens on stage 5 before we were done.\n\nEdited May 4, 2015 by GrandSpleen"}]}