{"url":"https://community.fantasyflightgames.com/topic/175294-another-lurker-revealed/","title":"Another Lurker Revealed","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175294-another-lurker-revealed/?do=findComment&comment=1606769","commentId":1606769,"userName":"Mikallo","timestamp":1430838495,"content":"Hi all, I've been lurking here for a while. I first popped up after an article about a sylvan deck and asked a question. TeamJimby answered, Epi Lepi pointed me towards Tales from the Cards, and then Joezim007 supplied the link to the new player buying guide. Since then I've followed the forums, browsed through multiple blogs (tales, hall, warden), and started playing. The active community helped draw me in. I thought it was neat people here actually tried out each other's decks when debating back and forth (tactics aragorn) rather than the typical \"Nuh uhs\" and \"uh huhs!\" I usually see in forums. The game kept me. I'm working through the cards in order (only core and hunt so far), but I enjoy the back and forth and can't figure out how Glaurung shuffles so quickly in the meantime. I only have the core and hunt so far. \n\n \n\nI probably won't pop up too much, because I'm so far behind the curve and the search function here and on BGG has turned up answers to all of my (many!) questions so far. \n\n \n\nI did do as many recommended online and kept logs of my initial games and tried Ninjadorg's scenarios. Eventually, I discovered an excel spreadsheet is much quicker (and I think cooler) for data collection. I posted them here [https://drive.google.com/folderview?id=0B6EZPkpi1V2SfnBieEhzZGF0NnpBcnZXc2V2T0Q3ZDNEOHh2Z1NublNhSzZXOGpNc0pDZnM&usp=sharing]if anyone (else) is bored during lunch at work.\n\n \n\nIt's going to be a long while before I catch up. To help justify my suddenly growing card collection to my wife, I try to keep my average cost per play down to a $1 a game before I buy a new pack (Four more shadows of the mirkwood are en route via UPS...). I wanted to play a minimum of 10 games with Hunt for Gollum cards (scenario or player cards) before I opened the next AP. I'll play at least 10 or more games with those cards before I open the AP after that...I figured it would prolong the enjoyment and prevent a spendgasm binge.\n\n \n\nAnyway, just figured it'd be polite to poke my head up once if I'm going to lurk around. Eventually, I'll be more current and start trying some of the different custom scenarios. I'm not there yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175294-another-lurker-revealed/?do=findComment&comment=1606817","commentId":1606817,"userName":"danpoage","timestamp":1430839543,"content":"Welcome to the game, Mikallo! As I'm sure you have already seen, the community is filled with friendly people who are happy to help. Good luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175294-another-lurker-revealed/?do=findComment&comment=1607102","commentId":1607102,"userName":"raven614","timestamp":1430847768,"content":"Yeah right with you i lurk everyday and love it you never know when another great post will com up. Tactics Aragorn anyone?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175294-another-lurker-revealed/?do=findComment&comment=1607208","commentId":1607208,"userName":"leptokurt","timestamp":1430850615,"content":"Hi there! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}