{"url":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/","title":"Newish player looking for the best way to make the most out of the vast content.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1606664","commentId":1606664,"userName":"cfrun0","timestamp":1430835706,"content":"Hi!! I recently got the game a month or 2 ago. I love it! I play solo.  I was wondering what is your opinion on how to go through the game? I bought a huge lot on ebay and have all the cards (including adventure packs) from core through Against the Shadow cycle. I also have the first 4 sagas and the Massing at Osgilath. It is a lot of cards! Currently, I have decided to go through the game by only playing cards available in that cycle (I am at the Hills of Emyn Muil now). For example, I have only used core and the Shadow of Mirkwood cycle to get through the Mirkwood cycle. How would you suggest I move from cycle to cycle? How should I incorporate the Saga expansions, nightmare decks, and extra print on demand cards? Again, I am just looking to get the most out of my Lotr LCG experience!!! Thanks in advance!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1607225","commentId":1607225,"userName":"TwiceBorn","timestamp":1430850861,"content":"Welcome to the addiction!\n\n \n\nLike you, I've been playing \"progression style\" -- playing each quest first only with the player cards that were available at the time of an expansion/AP's release. I play scenarios by order of release, so… Mirkwood, Massing at Osgiliath, Khazad-Dum, Dwarrowdelf, Battle of Lake Town, Hobbit saga, Heirs of Numenor, etc.\n\n \n\nI personally prefer to approach quests that way because you see how the game/quests/player cards evolved over time, and scenarios are always more challenging at the time of initial release… so I want to see if I can beat quests with restricted card pools. Earlier cycles are good \"training grounds\" for the more difficult cycles (I have heard that HoN and Against the Shadow are particularly difficult… I have those APs/expansions, but have not yet played them, so can't comment from personal experience, but I'll take the word of the pros). \n\n \n\nAfter I've defeated the quests several times in progression style, both straight solo and solo 2-handed, I'll eventually revisit them again later building more thematic decks using the full card pool I have at my disposal. One day, I imagine that I will play them all in chronological order (as set in Middle-Earth's timeline, not product release date).\n\n \n\nReally, there is no \"best way\" to enjoy the game. It all comes down to a matter of personal preference. \n\n \n\nI hope this helps. Have fun!\n\nEdited May 5, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1607240","commentId":1607240,"userName":"Teamjimby","timestamp":1430851178,"content":"I would also recommend the progression style where you limit your card pool.  It's something you can only really enjoy once, so you shouldn't pass up the opportunity.  You'll have plenty of time to use the whole card pool later on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1607348","commentId":1607348,"userName":"Julia","timestamp":1430853723,"content":"I play with some sort of \"progressive\" method too, based on cycles: during a series of 6 APs, specific traits and interactions among certain subsets of cards are developed, so that I first create a common pool with all the player cards released within a cycle, and then I search the better sinergy among those. So, for instance, I created an Eagle deck with cards from Hunt for Gollum to Return to Mirkwood, and then played with this deck all the quests in the Shadows of Mirkwood cycle.\n\n \n\nAnyhoo, it's also very important (imho, at least) to play \"enough\" games with the core set cards only, to acquire an exact cognition of what are the limits and possibilities granted by each sphere, and learn the basics for a good deck. Don't be afraid to try different combos even if you have a winning deck at hand: the game is incredibly vast, and there's a lot of stuff to explore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1608906","commentId":1608906,"userName":"cfrun0","timestamp":1430937370,"content":"Thanks for all the advice. How would you suggest to incorporate the sagas, print on demands, and nightmare decks??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1609012","commentId":1609012,"userName":"Teamjimby","timestamp":1430939723,"content":"Don't worry about POD or Nightmare for a long time.  I'd wait to do the Hobbit boxes until you get to Khazad-Dum because you'll need the Dwarf support.  I'd also wait to start the LotR sagas until you finish Dwarrowdelf because it has a lot of strong and thematic cards like Loragorn and Glorfindel to help you escape the Shire."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175288-newish-player-looking-for-the-best-way-to-make-the-most-out-of-the-vast-content/?do=findComment&comment=1609079","commentId":1609079,"userName":"alexbobspoons","timestamp":1430941539,"content":"My plan is to play everything one-pack at a time in date-release order which will include sagas as they were published.\n\nI will also be taking steps back to enjoy old favourite encounters every so often with my newer tweaked decks.\n\n \n\nI am putting Nightmare decks to one side and basically, when I get to the point an older favourite encounter suddenly seems too easy, then I will upgrade it to Nightmare mode.\n\n \n\nThis method of play should pretty much cover all released content other than POD encounters, which I think I may also aim to slot in with its date-published even though they are rated harder.\n\n \n\nThats my plan, going awesome fun so far, hope the thoughts help your own play-plan."}]}