{"url":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/","title":"can you take more damage than you have hp?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1606951","commentId":1606951,"userName":"awp832","timestamp":1430843584,"content":"I've started to notice an inconsistency in my play, which sort of bugs me.    Anyway,  my question is this;\n\nCan a character take more damage than it has HP?   Ordinarily it seems no, it can not -as per page 20 of the rulebook.   A character or enemy is destroyed as soon as it has 0 hp.   But there are some corner cases that sort of cast this into doubt.  Take Thaudir (The Lost Realm #33) for example.   He is indestructible and can not be destroyed by damage.   However, he can still take damage, and suppose I can put more damage on him than his 9 HP,  is that allowed?   This is very desirable to do because of the victory conditions on Deadman's Dike and Thaudir's healing effect.  \n\nAnother case,   suppose we have Boromir who is severely wounded, already having taken 4 damage.   Boromir decides to get cheeky and block an Orc Vanguard (8 attack, HoN #58).  Suppose there is no shadow effect, Boromir plays Close Call (The Dunland Trap, #5).  Does Boromir have to call Doomed-6 to survive?  Or need he only call Doomed-1?   If he can not take more damage than he has HP, it seems like he only needs to make this Doomed-1, which makes CC a much more powerful card than I was giving it credit for.   In the same situation,  it's the difference between Gondorian Discipline (Encounter At Amon Din, #60) being able to save his life, or not.\n\nOf course it's tempting to say  \"well of course you can take more damage than you have hp...\"   in that case,  what about Archery?   Say it's a 4 player game with 2 Southern Mercenaries in play.   Can I just assign all 8 Archery damage to a poor old Snowbourn Scout with 1 hp? \n\nEdited May 5, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1607088","commentId":1607088,"userName":"Teamjimby","timestamp":1430847241,"content":"I'm not 100% sure about placing more damage than an enemy has HP, but I know the Boromir situation you describe would indeed be doomed 6 (and Gondorian Discipline would not save him).  This has come up with Frodo before and the alternate interpretation would make him an absolute beast since he only has 2 HP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1607112","commentId":1607112,"userName":"PocketWraith","timestamp":1430847981,"content":"I believe you can place more damage on an indestructible enemy than its HP. Pretty sure this came up way back in the context of Durin's Bane."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1607157","commentId":1607157,"userName":"Courchevel","timestamp":1430849237,"content":"The main distinction here is that : enemies are not characters.\n\nThaudir is an enemy. Enemy (indestructible) can have more damge than their hp.\n\nCharacters cannot have more damage than their hp. However, you will have to cancel all the damage to prevent Boromir to die. Because playing close call for one will cancel one of the damage from the orc vanguard the 5 remaining will be directed to boromir and he will suffer the one damage to kill him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1607766","commentId":1607766,"userName":"awp832","timestamp":1430870736,"content":"I guess I'm not seeing the distinction.   Enemies are not characters, agreed, but they are treated in the same fashion in this case.  pg 20 says\n\n\"Any time one of these cards (characters and enemies) has 0 hit points, it is immediately defeated\"\n\nStill,  I understand the problem with Frodo, hm..  Is it possible that damage and combat damage are treated differently in this case?   Because otherwise I'm still not seeing why you couldn't just sacrifice a weak ally to absorb every single point of archery damage in a round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1607862","commentId":1607862,"userName":"GrandSpleen","timestamp":1430876924,"content":"Direct damage and combat damage aren't treated differently, but an attack results in a single instance of multiple damage tokens being assigned, while a direct damage effect such as Archery is several different instances of damage being assigned (and then applied simultaneously).   Any enemy or character is discarded once they have more damage tokens than HP.  The Indestructible keyword prevents this, so there is your one exception.\n\n \n\nThere is no rule that prevents you from placing excess damage tokens on a character or enemy.  If you place it all in one go, you can do that (e.g., 10 strength undefended attack onto Boromir, you'll place 10 tokens, and then discard him).  With an Indestructible enemy, you can just keep piling it up (because, simply put, there is no rule that prevents you from doing so).  \n\n \n\nThere seems to be a distinction between 'assigning' damage and actually placing the tokens.  Think of it this way: you can place damage tokens beyond a character's HP, but you cannot assign extra instances of damage to a character who has already been assigned damage up to or beyond their HP.  You cannot overassign Archery damage (ruling here) [https://community.fantasyflightgames.com/index.php?/topic/121857-archery-and-frodo/?hl=archery] because, although Archery damage is placed simultaneously, it is assigned point by point.  But a single act of assigning damage, like an undefended attack, can end up placing more tokens on a character than they have HP.  So for Close Call or Frodo you'll have to eat the full amount with your threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175305-can-you-take-more-damage-than-you-have-hp/?do=findComment&comment=1620983","commentId":1620983,"userName":"Thanatopsis","timestamp":1431632267,"content":"As GrandSpleen noted there is extra emphasis on assigning damage and then placing damage. Many of the other LCGs emphasize this. In the Star Wars LCG I assign damage to a character but then any number of game effects might do something to this damage (for instance there is a Protect keyword that can reassign damage). Then I place the damage on the character.\n\n \n\nToughness sort of works this way. If an enemy has toughness 2, I may assign 5 damage, but I only place 3.\n\n \n\nPhysically this can be modeled in the game by putting damage tokens next to card as assigned damage and then moving it to the card as placed damage. In the case of archery damage, tokens are assigned next to a card one at a time. Combat damage has these tokens assigned all at once and then placed on the target.\n\n \n\nTactics has many cards that affect assigned damage (before the counters hit the card). \n\nLore has many cards that affect dealt damage (after damage tokens are on a card - healing)"}]}