{"url":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/","title":"Newbie Looking To Play With My Wife","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1606914","commentId":1606914,"userName":"Red Die Guy","timestamp":1430842774,"content":"Hi All,\n\n \n\nEuphemism aside, whats the best way to play with my wife? I have just ordered the game and intend to play solo a couple of times to learn the rules. I have read some of the guides such as Beorn's deck building etc and although I have decent experience of card games and strategies (loads of games with friends) my goal is for my wife to enjoy this too.\n\n \n\nThe two reasons I bought this was because of the theme (she loves the LotR) and that its co-op - both of which my wife should appeal to my wife. I just need advice on how deliver the perfect first gaming experience (LoTR card game experience that is) to keep her interested. We play light board/card games together very occasionally but this is the first serious one I want to introduce her to, hopefully with the aim that she will ask me to play rather than the other way around (a man can dream).\n\n \n\nAny advice would be greatly appreciated as this purchase was just for her and I need to get her hooked. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nCheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1606925","commentId":1606925,"userName":"Teamjimby","timestamp":1430843143,"content":"If your wife is anything like my wife, the key to selling a new game is to make sure she wins or at least comes close to winning in the first game.  Assuming you are just starting with a single core set, the game is going to be very hard.  Don't try any quests other than Passage through Mirkwood until you have beaten it a few times.  Also, don't be afraid to play on easy mode if you think a brutal loss will crush her enthusiasm.\n\n \n\nIf you want to keep things simple, you could use the premade decks.  I would probably use leadership and spirit. \n\n \n\nIf you think she can handle a 2 sphere deck and you want the best chance to win, check out these decks: https://www.boardgamegeek.com/thread/1294079/back-basics-two-pair-tandem-decks-using-one-core-s [https://www.boardgamegeek.com/thread/1294079/back-basics-two-pair-tandem-decks-using-one-core-s]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1606949","commentId":1606949,"userName":"divinityofnumber","timestamp":1430843579,"content":"I think that building in some early mastery experiences, senses of accomplishment, would be helpful in increasing her interest in the game, as Teamjimby mentioned above. My wife and I play quite often and really enjoy this game. In the early days of the game, she really enjoyed Tactics (the red cards) decks, since they are able to deal a lot of damage and kill off enemies. Each of the four spheres have certain specialties. For example, Tactics sphere is good at killing things. Killing enemies has an immediate and tangible effect on the game state, so feels satisfying. The Legolas hero has the Ranged keyword, and he can even kill things that are engaged (fighting) with other players. Killing off an enemy that is damaging one of your fellow players feels good. I think my recommendation would be to start her out with Tactics. \n\nEdited May 5, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1607177","commentId":1607177,"userName":"Narsil0420","timestamp":1430849780,"content":"Oh play CARDS with your wife... I was going to say...!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1607361","commentId":1607361,"userName":"Julia","timestamp":1430854258,"content":"Not so sure what's the problem of \"wives\" here. When I play, I tend to see \"players\", and not looking at their sex or make assumptions based on being males or females.\n\n \n\nAnyhoo, possibly the main problem here is that she's not that into \"heavier\" games, while LotR is a heavier game, no doubt. If she never built a deck in her life, build her a deck. No probs if it's mono or dual, you play together and you can play with cards revealed (like you were soloing 2H), so that you can guide her through the most difficult choices and explain her keywords interactions. First guide, then follow, she needs to understand the game and this does not mean understanding the rules, but the timing of different effects and when to push and when to defend.\n\n \n\nPlay Passage through Mirkwood until you beat it easily, and then move to Anduin. Before levelling up, be sure she wants to level up in difficulty. Otherwise try to have access to some different easy quest (Hunt for Gollum, for instance) just to increase variety without going crazy with prisoners in Dol Guldur of Trolls roaming the Carrock.\n\n \n\nAnd spend some time in reading flavour text and stuff, the game is well done also in terms of references to Tolkien's lore, and it's a pleasure for fans also under this pov"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1607725","commentId":1607725,"userName":"alexbobspoons","timestamp":1430867909,"content":"Id say this game is awesome fun as a nwebie.\n\nBut journey down the anduin and escape from dol guldur are both very hard, especially with only core cards.\n\nAs others mentioned, stick to passage through mirkwood a lot... also if you want to spend money, i agree with buying/playing hunt for gollum.\n\nOnly go for journey/anduin and dol guldur once already hooked (and be ok losing)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1607889","commentId":1607889,"userName":"DukeWellington","timestamp":1430878570,"content":"> Not so sure what's the problem of \"wives\" here. When I play, I tend to see \"players\", and not looking at their sex or make assumptions based on being males or females.\n\nJeez, way to remind us all of how easily a feminist can get offended. Lighten up, it's just a guy asking for help. Can we give him some help without the politically correct language police please?\n\nI like the suggestions already made. I would add that you should make sure the quests are quick, as nothing turns off a casual player like a long slog. That is another reason to play only passage through mirkwood. It is short and sweet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1607938","commentId":1607938,"userName":"GrandSpleen","timestamp":1430882971,"content":"Nobody made any generalizations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1608068","commentId":1608068,"userName":"TwiceBorn","timestamp":1430893995,"content":"It must be said, though, that Journey Down the Anduin is easier two-player than solo (as is Escape from Dol Guldur… which remains very tough with only Core set cards). Still, as others have said, definitely focus on getting a good win ratio vs. Passage Through Mirkwood before moving on to Journey Down the Anduin. My spouse is not really big on complex games, but she enjoys playing Lord of the Rings with me, and thus far she has really enjoyed Journey Down the Anduin, Hunt for Gollum, and Conflict at the Carrock. Haven't played much beyond that with her. I do handle the deck-construction, as she has not interest in that.\n\n \n\nThat may be another recommendation: in the beginning, try to ensure that she mostly plays with the same/familiar cards. There are a lot of details in this game, and getting comfortable with a set of cards and their synergies can ease the learning curve. Try seeing if you can consistently beat given scenarios solo 2-handed with the same pair of decks before handing one to her.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1608237","commentId":1608237,"userName":"Red Die Guy","timestamp":1430912944,"content":"Thank you all for the great advice. A really good response I must say. Seems like an excellent community on this board.\n\n \n\nRegards to assumptions based upon sex; I honestly did not realise I did this. I apologise if I offended anyone, that was never my intent.\n\n \n\nApologies for the wall of text below. I understand if you do not want to read it!\n\n \n\nSo, it seems that the consensus is to play Passage Through Mirkwood solo until I consistently beat it. I like the idea of play 2 decks and then later giving one of these decks for my wife to use. Also many thanks for the link Teamjimby, I'll take a look and go from there. I think it will really help if we can win the first playthrough or come close at the very least.\n\nAs people kindly mentioned; if she can slay loads of stuff or get my bacon out of the fire I think this will resonate positively and spur discussion. We have some great gaming memories together where I have gone off trying to accomplish the 'win' condition only for my wife to come to my rescue (eg. Forbidden Island). I can see lots of potential for this here! I think the artwork in this LCG is stunning so that helps immersion. As does the flavour text of course.\n\n \n\nInitially when we both discussed this game I said that you can pick a few of your favourite characters and go questing and slaying etc but now I am wondering if that was wise what with the varying strength of the spheres in the core game. That being said I asked her last night which were her favourite characters from LotR and she said: Gandalf (I know not playable hero in core), Samwise, Legolas, Arwen, Eowyn, Faramir (ally I know), Aragorn and Galadriel - so its looking like Legolas, Eowyn and Aragorn from the core, so I'll take a look at these first. Perhaps filling any sphere difficiencies with my own choices. I am probably getting well ahead of myself here but I won't get to play for a little while yet anyway so I can digest all the guides and deck building in the interim.\n\n \n\nWhich pack/expansion is Hunt for Gollum in? I had intended to purchase The Hobbit expansions later but will refrain if it would be better to expand upon the core first.\n\n \n\nIf you read this far - thank you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1608446","commentId":1608446,"userName":"divinityofnumber","timestamp":1430922813,"content":">  \n> \n>  \n> \n> So, it seems that the consensus is to play Passage Through Mirkwood solo until I consistently beat it. I like the idea of play 2 decks and then later giving one of these decks for my wife to use. \n\n \n\nThis sounds like a good idea, to get yourself used to the rules of the game. But, the thing to remember here is that it will be important to resist too much advice-giving while she learns. You will have already played the deck that she is using, so it will be tempting to make all sorts of suggestions and this can turn into essentially playing her hand for her. For me, sometimes it takes great effort to resist giving advice when I see good plays that someone could make. It will be important to let her go through the learning experience on her own. Your role, as the person who has already learned the rules, will be to answer any questions she has about what she \"can\" do, and not to tell her what she \"should\" do. \n\nEdited May 6, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1608911","commentId":1608911,"userName":"alexbobspoons","timestamp":1430937428,"content":"> Thank you all for the great advice. A really good response I must say. Seems like an excellent community on this board.\n> \n>  \n> \n> Regards to assumptions based upon sex; I honestly did not realise I did this. I apologise if I offended anyone, that was never my intent.\n> \n>  \n> \n> Apologies for the wall of text below. I understand if you do not want to read it!\n> \n>  \n> \n> So, it seems that the consensus is to play Passage Through Mirkwood solo until I consistently beat it. I like the idea of play 2 decks and then later giving one of these decks for my wife to use. Also many thanks for the link Teamjimby, I'll take a look and go from there. I think it will really help if we can win the first playthrough or come close at the very least.\n> \n> As people kindly mentioned; if she can slay loads of stuff or get my bacon out of the fire I think this will resonate positively and spur discussion. We have some great gaming memories together where I have gone off trying to accomplish the 'win' condition only for my wife to come to my rescue (eg. Forbidden Island). I can see lots of potential for this here! I think the artwork in this LCG is stunning so that helps immersion. As does the flavour text of course.\n> \n>  \n> \n> Initially when we both discussed this game I said that you can pick a few of your favourite characters and go questing and slaying etc but now I am wondering if that was wise what with the varying strength of the spheres in the core game. That being said I asked her last night which were her favourite characters from LotR and she said: Gandalf (I know not playable hero in core), Samwise, Legolas, Arwen, Eowyn, Faramir (ally I know), Aragorn and Galadriel - so its looking like Legolas, Eowyn and Aragorn from the core, so I'll take a look at these first. Perhaps filling any sphere difficiencies with my own choices. I am probably getting well ahead of myself here but I won't get to play for a little while yet anyway so I can digest all the guides and deck building in the interim.\n> \n>  \n> \n> Which pack/expansion is Hunt for Gollum in? I had intended to purchase The Hobbit expansions later but will refrain if it would be better to expand upon the core first.\n> \n>  \n> \n> If you read this far - thank you!\n\nHunt for Gollum is the very first expansion pack of the very first cycle (Shadows of Mirkwood)\n\nI find it has a nice mix of quest/fight/location and some interesting tactics. Usually beat it, while I usually lose Anduin and always lose Dol-Guldur.\n\n \n\nThe hero choice for your wife that you mention is certainly possible BUT do bear in mind these three are from different spheres if core versions are used. So her deck would be splitting cards and resource three ways. This isnt hard, but does add a layer of complex to a new player which you might not want to go with at first.\n\nAlso, choice of hero often depends on other things, firstly what their threat level is (you dont want it too high, so if you pick a high threat like Aragorn you often want some lower threat heros to balance that). Also, the heros special abilities and stats often affect the choice more than who the actual hero is.\n\nBerevor is a made-up character yet her sphere, stats and ability make me use her a LOT so the books dont influence that.\n\n \n\nThere is an official \"Easy Mode\" for this game that is included in the rules. I read that often if players want to play with thematic decks (assembled for favourite characters or recreating book-moments... but often sacrificng a perfect/better effective deck) then easy mode makes this much more possible. You may want to give that a test first too to see if your wifes fave heroes  fair well in easy mode.\n\n \n\nLastly, with deck building. You cant expect one deck to be suitable for every scenario/adventure. The adventures are so varied that it often means re-tweaking the decks to be able to tackle the dangers of that scenario.\n\n \n\nBset of luck, its a steep learning curve but AWESOME game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1609951","commentId":1609951,"userName":"Red Die Guy","timestamp":1430995137,"content":"> This sounds like a good idea, to get yourself used to the rules of the game. But, the thing to remember here is that it will be important to resist too much advice-giving while she learns. You will have already played the deck that she is using, so it will be tempting to make all sorts of suggestions and this can turn into essentially playing her hand for her. For me, sometimes it takes great effort to resist giving advice when I see good plays that someone could make. It will be important to let her go through the learning experience on her own. Your role, as the person who has already learned the rules, will be to answer any questions she has about what she \"can\" do, and not to tell her what she \"should\" do. \n> \n>  \n\n \n\nThanks, I'll try to remember this. A very good point. It is far to easy to 'suggest' decisions and I need to reign this in here. I try to bite my tongue when playing Forbidden Island and we quite often beat that so my input is by no means crucial.\n\n \n\n \n\n>  \n> \n> Hunt for Gollum is the very first expansion pack of the very first cycle (Shadows of Mirkwood)\n> \n> I find it has a nice mix of quest/fight/location and some interesting tactics. Usually beat it, while I usually lose Anduin and always lose Dol-Guldur.\n> \n>  \n> \n> The hero choice for your wife that you mention is certainly possible BUT do bear in mind these three are from different spheres if core versions are used. So her deck would be splitting cards and resource three ways. This isnt hard, but does add a layer of complex to a new player which you might not want to go with at first.\n> \n> Also, choice of hero often depends on other things, firstly what their threat level is (you dont want it too high, so if you pick a high threat like Aragorn you often want some lower threat heros to balance that). Also, the heros special abilities and stats often affect the choice more than who the actual hero is.\n> \n> Berevor is a made-up character yet her sphere, stats and ability make me use her a LOT so the books dont influence that.\n> \n>  \n> \n> There is an official \"Easy Mode\" for this game that is included in the rules. I read that often if players want to play with thematic decks (assembled for favourite characters or recreating book-moments... but often sacrificng a perfect/better effective deck) then easy mode makes this much more possible. You may want to give that a test first too to see if your wifes fave heroes  fair well in easy mode.\n> \n>  \n> \n> Lastly, with deck building. You cant expect one deck to be suitable for every scenario/adventure. The adventures are so varied that it often means re-tweaking the decks to be able to tackle the dangers of that scenario.\n> \n>  \n> \n> Bset of luck, its a steep learning curve but AWESOME game\n> \n>  \n\n \n\nOkay I think I'll pick this up first in time then. Thanks for the recommendation. Seems very sensible. If the game really takes off I may even buy an extra core copy.\n\n \n\nAh, the easy mode sounds great! If we can smash that with various spheres that might be best. Although it is a valid point that mono-deck would be easier to learn. I think she would be fine using other characters, so I could just build around Aragorn or Legolas. I suppose the best thing to do is sit down with the game once I get it and really look at the synergies of the spheres from there.\n\n \n\nI am quite excited now! Just hope this pans out (although if not I will just play this with my mates). Thanks for all of your help everyone. I will let you know how we get on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1610037","commentId":1610037,"userName":"alexbobspoons","timestamp":1431001500,"content":"Great stuff\n\n \n\nGetting a few games under your belt helps.\n\n \n\nFirst I played Passage through Mirkwood with each mono deck and enjoyed it but clearly had my favourites as Lore and Leadership, so I composed a duo-sphere deck with Lore/Leadership and had some success, lots of fun and lots of losses at Anduin.\n\nBut\n\nAfter reading up, trying different things, other scenarios, my most successful and fun deck ended up being one from BGG which is tri-sphere and Spirit/Tactics/Leadership with Leadership actually being least important of that. So its funny how your tastes and opinions change over the time of replaying quests and trying different combos.\n\nThe reason for saying this being, make sure you have a good all-round test of all things before making recommendations or judgements on some quests. The game can be very fluid and changeable.\n\n \n\nI think the game is generally aimed at being one where you lose more than you win (ok not you pro deck builders reading I know :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ) but its the fun of the journey that matters. So if you are prepared to lose, then that is a big big bonus to start with :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nBest of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1614039","commentId":1614039,"userName":"Red Die Guy","timestamp":1431258024,"content":"Cheers. I really like how this game has so much variety and repeatability. You mention trying various quests and that's awesome. Plus every so often mixing it up with a mini expansion makes for ever increasing depth.\n\nFingers firmly crossed. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1614580","commentId":1614580,"userName":"alexbobspoons","timestamp":1431299912,"content":"Yes, most card games the experience can be fun, but essentially you are playing against an opponent for a general goal and so deckbuilding and tactics can follow some basic similar paths.... but this game : the different adventures can be SO different that not only is the experience of gameplay constantly varied, but also one peferc deckbuild for a scenario might well be awful at a different scenario.. so you dont stick wirh a standard deck, you are always tweaking/changing. Even the sceanarios themselves play very different if you use different sphere decks.\n\n \n\nThe variety is very impressive :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1615164","commentId":1615164,"userName":"Red Die Guy","timestamp":1431348876,"content":"How do you keep tabs of all of your cards and decks? This will be useful for future reference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1615238","commentId":1615238,"userName":"alexbobspoons","timestamp":1431351719,"content":"> How do you keep tabs of all of your cards and decks? This will be useful for future reference.\n\n \n\nWell I have a case that is generally made for tools (google aluminium flight case for similar)\n\nIts divided up by strips of MDF. I then have the cards in sleeves and simply slotted in. You can buy thin plastic card dividers from card shops cheap, these split them up.\n\nSo I have a section for spare sphere cards (one for each sphere) then a section for current deck/deck, then a section for the encounter decks, each one divided by one of the divider cards.\n\nIf I remember when I am home I will take a photo.\n\nAt the moment, I also have all the adventure packs I havent yet played (plus their sphere cards) off to one side of the box ready for when I \"open\" that pack. So the box is very one sided.\n\n \n\nIf you want to print out dividers on paper/card, then BGG (Board Game Geek) has quite a few files you can download of these.\n\n \n\nI imagine as I use more cards, the sphere sections will get quite big, but sorting through them to make new decks is part of the fun anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1616181","commentId":1616181,"userName":"Ecthelion III","timestamp":1431393851,"content":"This is what I use.  It's just a shoebox with some cardboard in it:\n\n \n\n10996480_385205001672899_384470408813308 [https://scontent-dfw.xx.fbcdn.net/hphotos-xtf1/t31.0-8/10996480_385205001672899_3844704088133083460_o.jpg]\n\n \n\nAnd these are the dividers:\n\n \n\n11201147_385204991672900_750327563090536 [https://scontent-dfw.xx.fbcdn.net/hphotos-xpa1/t31.0-8/11201147_385204991672900_7503275630905369049_o.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1616958","commentId":1616958,"userName":"Mndela","timestamp":1431444560,"content":"Only Passage Mirkwood as nightmare? Where do you place the other encounter cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617081","commentId":1617081,"userName":"Virani","timestamp":1431448126,"content":"I believe he has a regular section for the normal quest as well, you can see it right behind the smilies. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617096","commentId":1617096,"userName":"Red Die Guy","timestamp":1431448785,"content":">  \n> \n> Well I have a case that is generally made for tools (google aluminium flight case for similar)\n> \n> Its divided up by strips of MDF. I then have the cards in sleeves and simply slotted in. You can buy thin plastic card dividers from card shops cheap, these split them up.\n> \n> So I have a section for spare sphere cards (one for each sphere) then a section for current deck/deck, then a section for the encounter decks, each one divided by one of the divider cards.\n> \n> If I remember when I am home I will take a photo.\n> \n> At the moment, I also have all the adventure packs I havent yet played (plus their sphere cards) off to one side of the box ready for when I \"open\" that pack. So the box is very one sided.\n> \n>  \n> \n> If you want to print out dividers on paper/card, then BGG (Board Game Geek) has quite a few files you can download of these.\n> \n>  \n> \n> I imagine as I use more cards, the sphere sections will get quite big, but sorting through them to make new decks is part of the fun anyway.\n> \n>  \n\n \n\nThanks Alex, I will take a look at BGG. Though I have time before my collection grows to make this an issue, it is still nice to know how others store their collections. Fortunately I still have a number of card sleeves from the BSG game which I will use for now and store the cards in the box.\n\n \n\n> This is what I use.  It's just a shoebox with some cardboard in it:\n> \n>  \n> \n>  \n> \n>  \n> \n> And these are the dividers:\n> \n>  \n> \n>  \n\n \n\nExcellent organisation Ecthelion! Extra kudos on the dividers. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617431","commentId":1617431,"userName":"alexbobspoons","timestamp":1431456814,"content":"This is my case at the moment:\n\n \n\ncard%20case.jpg [http://i5.photobucket.com/albums/y185/BobSpoons/card%20case.jpg]\n\n \n\nOn the left are current cards for each sphere and encounter decks (Only 2APs and Core at the moment. They are wedged in with bags of card sleeves.\n\nOn the right are the packs waiting to be used. Also wedged by card sleeve packs.\n\nOn the far right, the thin section has counters, threat counter and some open bags containing my constructed decks ready to play.\n\nIn the lid are playmats and instructions.\n\nPlastic dividers separate everything nicely.\n\nAlex"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617525","commentId":1617525,"userName":"divinityofnumber","timestamp":1431459630,"content":"One helpful thing is to download all of the rules documents and inserts and put them onto an iPad or other tablet. I throw away all of the inserts and simply save everything electronically. It is so nice to be able to sit at a table and play and not have to get up or dig through things to get rules clarifications. Or, sometimes I will be playing in some public space, such as a coffee shop, and it is nice to always have all of the rules documents readily accessible. Plus, it saves space. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617606","commentId":1617606,"userName":"Olorin93","timestamp":1431462762,"content":"Hey, Alex, your storage looks better than mine at this point!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617648","commentId":1617648,"userName":"Virani","timestamp":1431463681,"content":"That definitely looks nice! Better start looking for some storage solution as well. \n\nThe picture from Ecthelion, is that a good indication for how many cards one might have after owning every expansion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1617792","commentId":1617792,"userName":"alexbobspoons","timestamp":1431469122,"content":"I do think the case wont fit a complete collection though. Sleeving cards does take up extra space."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1618171","commentId":1618171,"userName":"Ecthelion III","timestamp":1431487991,"content":"> The picture from Ecthelion, is that a good indication for how many cards one might have after owning every expansion?\n\n \n\nNo. I only own:\n\n \n\n1 Core Set\n\nConflict at the Carrock\n\nKhazad-Dum\n\nThe Watcher in the Water\n\nFoundations of Stone\n\nShadow and Flame\n\nHeirs of Numenor\n\nThe Steward's Fear\n\nThe Lost Realm\n\nThe Black Riders\n\nThe Road Darkens\n\nThe Treason of Saruman\n\n \n\nI'm going to need to make a new one soon.\n\n \n\n> Only Passage Mirkwood as nightmare? Where do you place the other encounter cards?\n\n \n\nSadly, Passage through Mirkwood is my only nightmare quest.  I picked it up to make the quest have a playable level of difficulty, although with my ever-expanding card pool I will probably be grabbing the Saga Nightmare quests at some point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1618307","commentId":1618307,"userName":"Virani","timestamp":1431497816,"content":"> I'm going to need to make a new one soon.\n\n \n\nAnyone know where I can find a picture of a complete collection?\n\nI would rather start with a storage solution with which I can expand, than to start over after every adventure pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1618647","commentId":1618647,"userName":"Ecthelion III","timestamp":1431523147,"content":">  \n> \n> > I'm going to need to make a new one soon.\n> \n>  \n> \n> Anyone know where I can find a picture of a complete collection?\n> \n> I would rather start with a storage solution with which I can expand, than to start over after every adventure pack.\n> \n>  \n\n \n\nThis is a full collection up to Voice of Isengard.  It doesn't look expandable, though:\n\n \n\nhttp://www.outpostzero.net/2014/09/lotr-lcg-storage-solution.html [http://www.outpostzero.net/2014/09/lotr-lcg-storage-solution.html]\n\n \n\n \n\nMaster of Lore uses a binder for the player cards and a smaller box for the encounter cards.  There's still quite a bit of space:\n\n \n\nhttps://masteroflore.wordpress.com/2013/09/14/player-card-binder/ [https://masteroflore.wordpress.com/2013/09/14/player-card-binder/]\n\nhttps://masteroflore.wordpress.com/2014/04/19/encounter-deck-dividers-update-1/ [https://masteroflore.wordpress.com/2014/04/19/encounter-deck-dividers-update-1/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1618805","commentId":1618805,"userName":"alexbobspoons","timestamp":1431528318,"content":"Do note that sleeving cards in sleeves at all, or penny sleeves or quality sleeves all make a big difference. In some cases it doubles the storage space needed, so when deciding what to get, be aware that your sleeving choices may well affect the result.\n\nAlso be aware that you may at first deceide against sleeving, then later decide you want to..\n\n \n\nWith my solution, it is already very heavy and when full will be very very heavy, so a bigger case would be a poor option I feel for me (I sleeve all encounters in penny sleeves and all player cards in quality sleeves). So I plan to buy a second case to-match. This will split the weight better and I think more than cover the capacity for years to come. Two cases isnt too bad to manage.\n\n \n\nI am also thinking about some kind of double size deckbox that will hold my current deck, current encounter deck as well as counters. That way it would be a mini portable kit for lunch breaks and such."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1618856","commentId":1618856,"userName":"Ecthelion III","timestamp":1431529854,"content":"I think I'm going to, instead of making a new case, remove my player cards and put them in Ultra-pro deck boxes.  Then I'll have enough room for the encounters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1626123","commentId":1626123,"userName":"Red Die Guy","timestamp":1431967727,"content":"> One helpful thing is to download all of the rules documents and inserts and put them onto an iPad or other tablet. I throw away all of the inserts and simply save everything electronically. It is so nice to be able to sit at a table and play and not have to get up or dig through things to get rules clarifications. Or, sometimes I will be playing in some public space, such as a coffee shop, and it is nice to always have all of the rules documents readily accessible. Plus, it saves space. \n\n \n\nExcellent idea. I love the thought of visiting the inlaws (outlaws) and putting together decks, playing around with sphere-combos etc all on a tablet just to pass the time! hehe. Not that I dislike my inlaws of course - I love them to bits. Its just nice to have the option since we see them every week.\n\n \n\n\"Huh? What am I reading? Er, Lord of the Rings. No, you can't borrow it once I'm done...erm sorry.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1626536","commentId":1626536,"userName":"Rob_Oz","timestamp":1431984852,"content":"On the topic of stoarge, here's a link to GeckoTH's very well done LOTR: LCG card dividers on Boardgame Geek:\n\n \n\nhttp://www.boardgamegeek.com/filepage/76256/geckoths-lotr-dividers [http://www.boardgamegeek.com/filepage/76256/geckoths-lotr-dividers]\n\n \n\nThe topmost update should provide dividers up through the Lost Realm.  GeckoTH's work is very thorough - he has dividers for encounter decks, player cards and quest cards. I have not yet taken the time to print these, but for those of you that have the time, inclination and ink resources these are some very nice dividers. One of the players in my monthly group uses them and they look really sharp.\n\n \n\nLots of good storage ideas in this thread. As an owner of all currently available material except most of the Nightmare packs (I own the first 6 NM packs) I can let newer players know that a full collection takes up quite a bit of space. At this point in my LOTR:LCG career I typically take my full player card set + about a half dozen scenarios I might want to play to a gaming session. I'm lazy and cheap so I simply use about one large and three small baseball card boxes to store them. Full collection requires several more baseball card boxes.\n\n \n\nGlad I discovered this game in 2012; it would be a wee bit costly to purchase everything all at once nowadays."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1626547","commentId":1626547,"userName":"OKTarg","timestamp":1431985319,"content":"Some great ideas in this thread. I second the idea of playing through the quest a few times yourself before you play with a new player to help minimize the 'rule looking up' stuff in play.\n\nWith respect to deck ideas, a deck made up of eowyn/Aragorn/ and either other spirit hero should be good. You can pump Aragorn up with attachments, always fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1627330","commentId":1627330,"userName":"Red Die Guy","timestamp":1432030753,"content":"Thanks RobOz, that will definitely come in handy further down the line. I will bookmark that. Nice one.\n\n \n\nOKTarg, thanks for the tip. I can see my wife having no problem with attachments as they make literal sense. A deck geared (no pun intended) to this would be ideal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1644393","commentId":1644393,"userName":"Red Die Guy","timestamp":1433176133,"content":"Hello everyone,\n\n \n\nJust an update really. I've played through Mirkwood with each of the 4 core sphere decks (without shadow effects), although not all in one sitting. I started with Tactics which was a newbie mistake as I got absolutely trounced for the reasons most of you are now sniggering at. 4 locations in a row and no way of clearing them.\n\n \n\nNext I played Spirit which looked best for questing (Eowyn is amazing) and took out the gold ring cards and added an extra resource to each hero at the beginning of the game. If I couldn't win this time I was doing something wrong! Oh and I also added 2 more copies of Gandalf (for 3 total). I kept threat really low thanks to the grey wizard and only just beat the Ungoliants spawn with a timely arrival of Gandalf which did 4 damage off the bat and then sacrficed some questing characters to take the blocking hits from enemies before everyone else jumped on the spider stabbing away which JUST killed it. Another turn would have been bad...\n\nI loved this, it was so cinematic (in my head). I could just imagine Gandalf turning up at the darkest hour to save the day. Immense stuff :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI looked through player deck after and there was a generic human scout (apologies can't remember name) which looked really really useful but I never saw any copies during the game which was maybe why it was difficult. Dunno.\n\n \n\nNext up was Leadership which seems middle of the road? Aragorn is an absolute beast. I can see why he costs 12 threat. Readying for one resource is top notch. Early combos with Theodred when resources were scarce meant I always had a resource for Aragorn to readying after commiting to a quest.\n\nI beat the scenario but everyone was brutally wounded and close to death. Gloin and Aragorn had one health left and Theodred two. This was without having to fight Ungoliants spawn too!\n\n \n\nFinally the Lore deck. I had the least idea about this one and so I was glad to play it last.\n\nOh my. Oh my oh my. I love this sphere! I absolutely walked it. Might be because I was now a bit more familiar with the game and the scenario sure but wow, I was able to keep threat low ( I used a starting Gandalf to instantly lower threat. I know it increases by 1 in refresh) and kept locations and enemies at bay. Health was never an issue as there are so many ways of regaining it in this deck. What I loved most was the card draw! So many lovely cards. So many options to choose. This was the one sphere I was actually 'resource poor' all of the time. I actually had to plan ahead in order to use cards haha!\n\nI killed Ungoliants spawn with the tried and tested Gandalf bomb. I think Glorfindel and Denethor both had a wound token each thats it.\n\n \n\nAll in all I absoutely love this game! I know I have to add the gold creatures and reduce starting resource thats fine. What I don't think I am ready for though is shadow effects. Man do they seem nasty!\n\n \n\nAnyway, the point was to learn the game well enough so that my wife could play with me. I feel confident that if I give her the tactics deck that I can fully quest to mitigate. Probably spirit or Lore (for the health boosts).\n\n \n\nWhat do you think?\n\n \n\nPS. Thanks for reading.\n\nEdited June 1, 2015 by Red Die Guy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1644921","commentId":1644921,"userName":"alexbobspoons","timestamp":1433198295,"content":"Really glad you loved it!!\n\nThats all great experience. Every time you play a new scenario OR introduce new mechanics (eg shadow effects) you will likely get hammered, but then with each game learn how to handle those until you are on top of them. Similarly, as your card pool sliwly builds, you will learn which cards work well for which scenatios (which isnt as easy if you instantly buy a huge card pool) and you will start building and tuning effective decks and having multi sphere decks.\n\nSo great.\n\nThis game is about the journey, not always then win. I lose more often than win but its such fun.\n\nWait till you get to journey down anduin, it will hammer you... but you will learn to beat it. Without spoiling, its very thematic with each stage being very different. Very difficult but great fun.\n\nDol guldur is worth playing twice then putting away to get out again in say six months when you are more practiced with a bigger card pool. Ive not yet beaten it and have put it away.\n\nMirkwood and Anduin are both great thematic quests. So great you are enjoying :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nPs: when you do add shadow effects, you will really start to see spirit sphere differently :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 1, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1645339","commentId":1645339,"userName":"TwiceBorn","timestamp":1433235982,"content":">  \n> \n>  \n> \n> All in all I absoutely love this game! I know I have to add the gold creatures and reduce starting resource thats fine. What I don't think I am ready for though is shadow effects. Man do they seem nasty!\n> \n>  \n> \n>  \n\n \n\nAh, but that's why Spirit has the 1-cost Hasty Stroke card… a cheap way to deal with Shadow effects (save your Hasty Strokes for the really nasty ones).\n\n \n\nI love the uncertainty that shadow effects bring to the game… can't imagine playing without them. But I'm sure you'll get there when you feel ready…  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 2, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1645344","commentId":1645344,"userName":"TwiceBorn","timestamp":1433236341,"content":"I don't necessarily agree that you need a bigger card pool to beat Dol Guldur with 2-players. It's definitely a veeeery tough quest (much harder than Anduin), but my wife (who is not a huge gamer/LCG nerd) and I have beaten it using the cards from only one Core set (using dual sphere decks)… with practice and luck (and the right deck construction/strategy), it's definitely doable. That having been said, if your wife gets easily upset after repeated losses (like mine sometimes does :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ), you might want to heed alexbobspoons' advice and \"save it for another day\"… and save your marriage by doing so?  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nDol Guldur and Return to Mirkwood (and, to a lesser extent, Journey to Rhosgobel) are without a doubt the hardest quests in the Core/Mirkwood cycle. \n\nEdited June 2, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1645381","commentId":1645381,"userName":"Red Die Guy","timestamp":1433240735,"content":"> Really glad you loved it!!\n> \n> Thats all great experience. Every time you play a new scenario OR introduce new mechanics (eg shadow effects) you will likely get hammered, but then with each game learn how to handle those until you are on top of them. Similarly, as your card pool sliwly builds, you will learn which cards work well for which scenatios (which isnt as easy if you instantly buy a huge card pool) and you will start building and tuning effective decks and having multi sphere decks.\n> \n> So great.\n> \n> This game is about the journey, not always then win. I lose more often than win but its such fun.\n> \n> Wait till you get to journey down anduin, it will hammer you... but you will learn to beat it. Without spoiling, its very thematic with each stage being very different. Very difficult but great fun.\n> \n> Dol guldur is worth playing twice then putting away to get out again in say six months when you are more practiced with a bigger card pool. Ive not yet beaten it and have put it away.\n> \n> Mirkwood and Anduin are both great thematic quests. So great you are enjoying :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> Ps: when you do add shadow effects, you will really start to see spirit sphere differently :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThanks. I think I will keep things as they are at the moment when I play with my wife. I will refrain from making suggestions and just try to react to what she does by supporting her actions. When I play on my own however I will try the shadow effects and see how badly mauled I get! Fun times await! haha.\n\n \n\nAh yes. I did notice the ability to negate nasty effects in spirit deck. Its a good point. I'll probably start with that sphere. Maybe dual with Lore or Leadership. In fact Aragorn can gain spirit with an attachment can't he? So looks good. Actually, quick Q: with non restricted, generic attachments can you put more than one onto a character? If so do their effects stack? I'm thinking not so have not done so but wanted to check. I had other questions whilst I was playing but forgotten then now!\n\n \n\n>  \n> \n> >  \n> > \n> >  \n> > \n> > All in all I absoutely love this game! I know I have to add the gold creatures and reduce starting resource thats fine. What I don't think I am ready for though is shadow effects. Man do they seem nasty!\n> > \n> >  \n> > \n> >  \n> \n>  \n> \n> Ah, but that's why Spirit has the 1-cost Hasty Stroke card… a cheap way to deal with Shadow effects (save your Hasty Strokes for the really nasty ones).\n> \n>  \n> \n> I love the uncertainty that shadow effects bring to the game… can't imagine playing without them. But I'm sure you'll get there when you feel ready…  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\nSound good! I will definitely try that, cheers!  I'm sure once I add shadow effects there will be no going back (at least when I play solo).\n\n \n\n> I don't necessarily agree that you need a bigger card pool to beat Dol Guldur with 2-players. It's definitely a veeeery tough quest (much harder than Anduin), but my wife (who is not a huge gamer/LCG nerd) and I have beaten it using the cards from only one Core set (using dual sphere decks)… with practice and luck (and the right deck construction/strategy), it's definitely doable. That having been said, if your wife gets easily upset after repeated losses (like mine sometimes does :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ), you might want to heed alexbobspoons' advice and \"save it for another day\"… and save your marriage by doing so?  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n>  \n> \n> Dol Guldur and Return to Mirkwood (and, to a lesser extent, Journey to Rhosgobel) are without a doubt the hardest quests in the Core/Mirkwood cycle. \n\n \n\nHaha my wife probably wouldn't enjoy constantly losing but I know she's a perfectionist so I bet she would insist on beating the scenario eventually. That or she'll hate it intensely and give up entirely ...a fine line for sure. I just have to hope the theme keeps her engaged. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nActually she gave me Journey to Rhosgobel as one of my Birthday presents! That scenario looks hard! But my the eagle cards look rocking. Veyr useful.\n\n \n\nI ordered Dead Marshes for Boromir and can't wait to have a look at that.\n\n \n\nThanks for all of the help! Onwards and upwards! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646166","commentId":1646166,"userName":"TwiceBorn","timestamp":1433276262,"content":">  \n> \n>  \n> \n> Ah yes. I did notice the ability to negate nasty effects in spirit deck. Its a good point. I'll probably start with that sphere. Maybe dual with Lore or Leadership. In fact Aragorn can gain spirit with an attachment can't he? So looks good. Actually, quick Q: with non restricted, generic attachments can you put more than one onto a character? If so do their effects stack? I'm thinking not so have not done so but wanted to check. I had other questions whilst I was playing but forgotten then now!\n> \n>  \n\n \n\nYou can have as many non-restricted, generic attachments on a character as you like/can afford. There is no \"stacking limit\" to these, and their effects are cumulative.\n\n \n\nKeep in mind that while not \"restricted,\" Horn of Gondor, Celebrian's Stone and Steward of Gondor are all \"unique\" attachments, meaning that even though they don't count toward a character's 2 restricted attachment limit, there can only be one copy of those unique cards in play at any one time, regardless of how many copies you may have in hand, how many players there are, etc.\n\n \n\nI apologize if you were already aware of this. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646174","commentId":1646174,"userName":"banania","timestamp":1433276637,"content":"Horn of Gondor and Celebrian' Stone are restricted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646228","commentId":1646228,"userName":"PocketWraith","timestamp":1433279348,"content":"> Keep in mind that while not \"restricted,\" Horn of Gondor, Celebrian's Stone and Steward of Gondor are all \"unique\" attachments,\n\nHorn of Gondor and Celebrian's Stone are both restricted as well as unique."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646311","commentId":1646311,"userName":"alexbobspoons","timestamp":1433282668,"content":"With regard to Rohsgobel, I would try not to read any guides or spoilers on that one.\n\n \n\nIts a great quest and very very different thematically. There was no way my standard deck could handle it. I was beaten time and time again by it with tweaking my deck and then when I did get a deck design that worked, I managed to beat it fairly often. So I would say try not to read up on the trick to beating it (or tricks, there will be a few) because for me the journey of solving that puzzle was pretty intense. Now with my final designed deck, it doesnt seem as hard as it first did when it repeatedly hammered me. So the puzzle is often the key.\n\n \n\nGosh you (and me as another newbie) are in for so much fun. have you seen the variety of different quests? The new one just teased is a trek through a haunted castle. There are city sieges, monster battles, army battles, journeys, searches, spy infiltration... etc etc. Just read up on the cover-blurb on some of the boxes on the FFG website... so exciting!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646511","commentId":1646511,"userName":"TwiceBorn","timestamp":1433297350,"content":">  \n> \n> > Keep in mind that while not \"restricted,\" Horn of Gondor, Celebrian's Stone and Steward of Gondor are all \"unique\" attachments,\n> \n> Horn of Gondor and Celebrian's Stone are both restricted as well as unique.\n> \n>  \n\n \n\nThat'll teach me to post without double-checking the cards in question. Thanks for catching my obvious error, banana, PocketWraith. You'd think I would have memorized the traits of those particular cards by now, but I seem to be making a lot of inaccurate statements due to inattention these days… sigh… [sticks head in sand]… \n\nEdited June 3, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1646928","commentId":1646928,"userName":"Red Die Guy","timestamp":1433337023,"content":">  \n> \n> You can have as many non-restricted, generic attachments on a character as you like/can afford. There is no \"stacking limit\" to these, and their effects are cumulative.\n\n \n\nOh wow. Their effects are cumulative. That seems a little cheeky somehow. Thanks for though.\n\n \n\n> With regard to Rohsgobel, I would try not to read any guides or spoilers on that one.\n> \n>  \n> \n> Its a great quest and very very different thematically. There was no way my standard deck could handle it. I was beaten time and time again by it with tweaking my deck and then when I did get a deck design that worked, I managed to beat it fairly often. So I would say try not to read up on the trick to beating it (or tricks, there will be a few) because for me the journey of solving that puzzle was pretty intense. Now with my final designed deck, it doesnt seem as hard as it first did when it repeatedly hammered me. So the puzzle is often the key.\n> \n>  \n> \n> Gosh you (and me as another newbie) are in for so much fun. have you seen the variety of different quests? The new one just teased is a trek through a haunted castle. There are city sieges, monster battles, army battles, journeys, searches, spy infiltration... etc etc. Just read up on the cover-blurb on some of the boxes on the FFG website... so exciting!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nNo worries. I won't go spoiling any quests. If I did do then really it wouldn't be me (and my wife hopefully!) who beat the quest but somebody else's deck.\n\n \n\nReally looking forward to what the future holds! You make its sound even better than even I had imagined! Glory awaits (post-continual defeats of course) ! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nActually I just remembered another question: there is a card (sorry can't remember name but must be an ally) that allows you to engage an enemy when it is played. Does this mean that you initiate an attack against it straight away (ala Dunhere) or that you just bring it from the staging area to your side in front of your heroes?\n\n \n\nThanks.\n\nEdited June 3, 2015 by Red Die Guy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1647149","commentId":1647149,"userName":"PocketWraith","timestamp":1433349406,"content":"> Actually I just remembered another question: there is a card (sorry can't remember name but must be an ally) that allows you to engage an enemy when it is played. Does this mean that you initiate an attack against it straight away (ala Dunhere) or that you just bring it from the staging area to your side in front of your heroes?\n\nThe latter. You only get to attack enemies after they attack you in the combat phase (unless a card effect specifically allows you to make an attack). Also the card you're thinking of is Son of Arnor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1647302","commentId":1647302,"userName":"TwiceBorn","timestamp":1433356109,"content":">  \n> \n> > Actually I just remembered another question: there is a card (sorry can't remember name but must be an ally) that allows you to engage an enemy when it is played. Does this mean that you initiate an attack against it straight away (ala Dunhere) or that you just bring it from the staging area to your side in front of your heroes?\n> \n> The latter. You only get to attack enemies after they attack you in the combat phase (unless a card effect specifically allows you to make an attack). Also the card you're thinking of is Son of Arnor.\n> \n>  \n\n \n\nSon of Arnor's response, like all responses, is optional. It is handy, however, if you want to pull an enemy from the staging area (especially one that is likely to attack you that round anyway) so that their will power can't be added to the enemy's total during the Quest phase. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1647605","commentId":1647605,"userName":"alexbobspoons","timestamp":1433370842,"content":"Its also good to use son of arnor if you plan to play a specific card on an enemy that needs to be engaged, but you want to avoid the usual engagement situation whereby that enemy will get an attack/hit on you first (no spoiler on what those cards may be)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1647776","commentId":1647776,"userName":"chuckles","timestamp":1433384816,"content":"...And when you have two Goblin Snipers in the staging area at the same time - especially if you don't have any direct damage/attacking the staging area options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1647824","commentId":1647824,"userName":"Goblin King","timestamp":1433389388,"content":"Coming from a guy with 14 years of marriage to a very understanding and gamer friendly wife, don't get your hopes up on a playing partner. She will likely play because she loves you. But unless she's really into games in her own right, it's not going to happen. My wife is a hardcore Star Trek fan. She could not even care one bit for any Star Trek game I brought her. She will play them to humor me and because she know I got them thinking of her, but it is not her thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1648251","commentId":1648251,"userName":"Red Die Guy","timestamp":1433429779,"content":">  \n> \n> > Actually I just remembered another question: there is a card (sorry can't remember name but must be an ally) that allows you to engage an enemy when it is played. Does this mean that you initiate an attack against it straight away (ala Dunhere) or that you just bring it from the staging area to your side in front of your heroes?\n> \n> The latter. You only get to attack enemies after they attack you in the combat phase (unless a card effect specifically allows you to make an attack). Also the card you're thinking of is Son of Arnor.\n> \n>  \n\n \n\nAh thats a shame. I guess it would have cost a lot more resources if that were the case.  Thanks for the examples of uses for Son of Arnor people. Much appreciated.\n\n \n\nGoblin King, I know what you mean. That is my niggling fear too. I have one hope in that we regularly play a game of some sort on the weekend. Hoping the complexity of this is offset by the awesome theme and gameplay!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1648685","commentId":1648685,"userName":"alexbobspoons","timestamp":1433450512,"content":"> ...And when you have two Goblin Snipers in the staging area at the same time - especially if you don't have any direct damage/attacking the staging area options.\n\nNow thats a good point, as each sniper would keep the other from being selectively engaged during combat phase gosh thats fiendish. So Son of Arnor, Gandalf or staging-damage would be the only options. Very good point you made there.\n\nRed-Die, dont worry, i play this game completely solo and love it. At later dates I expect to get new fun from playing two handed. So even if she tires of it, you will not be stopped from enjoying this game (and rheres always other stuff you and wife can do together.... not meaning to sound rude there).\n\nI have so many games in my collection, card, board and tabletop. Almost all of them need multiple players so i am very restricted on when i can get a chance/opponent to play. The vwry few that have solo rules almost all feel like the solo rules were an afterthought of how the game could be squeezed into a sub-standard solo version. Lotr lcg is probably the only game ive had that feels like solo play was included as a design variant from day-1. Sure 2/3/4 player will play out differently, but solo play doesnt feel forced or tacked-on. It feels like a core integral game aspect and purpose-designed.\n\nAs a result, if i have spare time, i dont need another pkayer, i can just play. Its awesome, and a factor that attracted me to this game. I love it.\n\nSo its great if she plays, but you can still enjoy solo if she doesnt :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1649486","commentId":1649486,"userName":"Red Die Guy","timestamp":1433511225,"content":"Haha! Yes we can do other things together. There are actually a load of light board and card games we play so no worries there. It would just be *nice* to share a complex game experience.\n\n \n\nSpeaking of playing solo - I got Dead Marshes in the post yesterday and wow! Boromir seems excellent! I can really imagine him selling his life dearly to end a quest. Great stuff. Can't wait to try it out. Only downside is I'm not a fan of Tactics (might be okay 2 player) but I could dual-deck Boromir into another another sphere. Not sure on the other cards in the AP, as I do not yet have experience with deck building but I am sure there are some nice ones there.\n\n \n\nAny advice on which AP to get next? I'll stick with Shadows of Mirkwood cycle and buy all packs eventually before moving on. I just have Journey to Rhosgobel and Dead Marshes. I probably won't buy anything for a while as I havne't used these yet but its nice to plan. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1650106","commentId":1650106,"userName":"alexbobspoons","timestamp":1433541978,"content":"Well, Journey to Rohsgobel I found needed careful specific deck construction. Dead Marshes I am only just about to play.\n\nPersonally, ive enjoyed playing in order. I would say get Hunt for Gollum next. Not just because it is first, but because when I played that scenario I found that I won it more often than I lost it, which was nice after the losses of anduin and dol-guldur, but each of those wins I also felt I had to work for, so it was a good sense of achievement.\n\nAt the same time, hunt/gollum felt it had a good all round spread of strategy, questing, fighting etc.. wheras some of the other Mirkwood packs can quite concentrate on one main aspect.\n\nSo i would say get Hunt/Gollum next."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1650704","commentId":1650704,"userName":"Goblin King","timestamp":1433599096,"content":"The only success I've had with my wife involving a constructible deck game involved removing the construction aspect.\n\nThis was years ago when I was a competitive player in Legend of the Five Rings CCG.\n\nI built her a deck, which she learned how to play, and enjoyed but then she never wanted to change it. \n\nBasically, I had to construct a deck to play against her, one that is on the same power level and then leave both decks static. \n\nWe still have those two decks and play periodically. I quit L5R about a decade ago. Those two decks are now the only cards I own from the game.\n\nHonestly we have a much better time just playing boardgames together. She also has a lady's Mah Jongg group and plays in tournaments so its not like she isn't a gamer.\n\nI have my LotR collection and I play solo and enjoy deck building as a solitary activity. Deck building games are a big investment in time to learn. They can be frustrating for someone being dropped into them. Why don't you set up a solitaire game and invite her to come watch your play through. Show her the hero cards. Who are her favorite heroes from the movies or books? Show her those cards that you have, explain how their abilities work.\n\nIf she has no real interest, she will let you know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1652214","commentId":1652214,"userName":"Red Die Guy","timestamp":1433769083,"content":"> Well, Journey to Rohsgobel I found needed careful specific deck construction. Dead Marshes I am only just about to play.\n> \n> Personally, ive enjoyed playing in order. I would say get Hunt for Gollum next. Not just because it is first, but because when I played that scenario I found that I won it more often than I lost it, which was nice after the losses of anduin and dol-guldur, but each of those wins I also felt I had to work for, so it was a good sense of achievement.\n> \n> At the same time, hunt/gollum felt it had a good all round spread of strategy, questing, fighting etc.. wheras some of the other Mirkwood packs can quite concentrate on one main aspect.\n> \n> So i would say get Hunt/Gollum next.\n\n \n\nThanks Alex, I will get Hunt for Gollum next. Makes perfect sense really! Sounds like it will be interesting too. I haven't even tried anduin or dol-guldur yet so will be a while anyway.\n\n \n\n> The only success I've had with my wife involving a constructible deck game involved removing the construction aspect.\n> \n> This was years ago when I was a competitive player in Legend of the Five Rings CCG.\n> \n> I built her a deck, which she learned how to play, and enjoyed but then she never wanted to change it. \n> \n> Basically, I had to construct a deck to play against her, one that is on the same power level and then leave both decks static. \n> \n> We still have those two decks and play periodically. I quit L5R about a decade ago. Those two decks are now the only cards I own from the game.\n> \n> Honestly we have a much better time just playing boardgames together. She also has a lady's Mah Jongg group and plays in tournaments so its not like she isn't a gamer.\n> \n> I have my LotR collection and I play solo and enjoy deck building as a solitary activity. Deck building games are a big investment in time to learn. They can be frustrating for someone being dropped into them. Why don't you set up a solitaire game and invite her to come watch your play through. Show her the hero cards. Who are her favorite heroes from the movies or books? Show her those cards that you have, explain how their abilities work.\n> \n> If she has no real interest, she will let you know.\n\n \n\nOkay so we played this together for the first time last night...\n\n \n\nHmmm. How to describe the outcome? Not dead in the water but not exactly sensational. It didn't help that I said 'Oh it'll only take half an hour then we can watch Dare Devil.\" Whoops. 30 mins later and we had just done the 1B. I think if we had carried on then it would have flown by as 2B is nothing and 3 is potentially really quick if you get Angoliants Spawn (she had mono tactics deck).\n\n \n\nHer literal words were: \"Why can't the cards just say +1 attack / +2 defense or something?\"\n\nYeah, card games can be a bit overwhelming with their text. Dang it.\n\n \n\nShe definitely liked the theme and I think she got a kick from coming to my rescue when I was taking about to become brown bread from a king spider, dol guldur orcs and a forest spider (I used mono lore and had higher threat!). A timely use of rain of arrows(?) and Legolas' ranged was awesome. (Not that I probably would have died as I had snare trap and healing cards in hand but shhh).\n\nShe managed to draw two dwarven axes right from the initial set up draw and then citadel plate 2 turns later which I advised to put onto Gimli to make him godlike but funnily enough he never took any damage.\n\n \n\nAll in all in *might* make a return to games night but I do not hold my breath!\n\n \n\nGoblin King, can you kindly tell me if the ladies Mahjongg is online or local? My wife loves Mahjongg! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1652948","commentId":1652948,"userName":"alexbobspoons","timestamp":1433798866,"content":"I cant remember but dwarvern axe and citadel plate may be restricted... so two allowed, so two axes and a plate would be one too many (others correct my newbyness if wrong).\n\nI think the game xan be slow to get into, so she may not grab it... but you sound like you have and soloness means much adventures, keep with it.\n\nMan you are going yo be slaughtered by anduin and goldur.... but with time you will master anduin (probably not so mych guldur, i cant do that one at all).\n\nThis game is awesome, hang on to it!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653119","commentId":1653119,"userName":"chuckles","timestamp":1433806551,"content":"Yes dwarven axe and citadel plate are both restricted.. its one of the reasons why the dunedain Signals are so useful... not being restricted"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653391","commentId":1653391,"userName":"DukeWellington","timestamp":1433828162,"content":"You confirm something about my experiance. The most important thing when playing with casual players is making sure the game doesn't take very long. That's the main reason to be familiar with the quest and also avoid potentially long or complicated quests. For instance, escape from Moria is a brutal quest to throw on a newb unless you know exactly how to play it. I have gone into that quest unprepared and have it suddenly balloon into over an hour of play time. An experiance like that just kills any interest in playing again. In fact, even if she is having fun and ASKS to play another quest, turn her down unless you KNOW it will turn out well. That's my advice, from similar situations.\n\nEdited June 9, 2015 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653416","commentId":1653416,"userName":"TwiceBorn","timestamp":1433831905,"content":"Escape from Moriarty?\n\n \n\nHas FFG released a new Sherlock Holmes crossover scenario for LotR? ;-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653457","commentId":1653457,"userName":"DukeWellington","timestamp":1433834870,"content":"I use my smartphone to post and some pretty strange autocorrects come out. I usually catch and fix them, but a few slip through :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653490","commentId":1653490,"userName":"chuckles","timestamp":1433838521,"content":"> You confirm something about my experiance. The most important thing when playing with casual players is making sure the game doesn't take very long. That's the main reason to be familiar with the quest and also avoid potentially long or complicated quests. For instance, escape from Moria is a brutal quest to throw on a newb unless you know exactly how to play it. I have gone into that quest unprepared and have it suddenly balloon into over an hour of play time. An experiance like that just kills any interest in playing again. In fact, even if she is having fun and ASKS to play another quest, turn her down unless you KNOW it will turn out well. That's my advice, from similar situations.\n\nI love auto-corrects!! Especially reading other peoples at least! \n\n \n\n...and failing that create Dr Watson and Sherlock intervention cards... that get played after 30 mins ;P  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653588","commentId":1653588,"userName":"Red Die Guy","timestamp":1433847635,"content":"Ah, I thought restricted meant you could only have up to 2 on one character? In our case Gimli just had citadel plate and dwarven axe. The other axe was with Thalin.\n\n \n\nSo does restricted mean only 2 for your entire party? If so that seems harsh!\n\n \n\nReally looking forward to trying Anduin. I might experiment dual deck too. Lore with either Spirit or Leadership I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653721","commentId":1653721,"userName":"entMoot","timestamp":1433857221,"content":"You are correct. Restricted is a per character limit. It may have been unclear that you meant the attachments were split between Gimli and Thalin in the initial post, but what you just said is 100% by the book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1653835","commentId":1653835,"userName":"Red Die Guy","timestamp":1433863254,"content":"Many thanks entMoot. I probably wasn't very clear originally.\n\n \n\nPhew! I think I would have struggled if this were not the case. In fact I struggle anyway but thats by the by (have yet to add shadow effects). Can't wait to get kicked by Anduin. Will prob do Journey through mirkwood with shadow effects first maybe.\n\n \n\nWhich deck best combo's with Lore? I like spirit for the anti shadow effects/treachery cards but I think Leadership is generally more appealing. Maybe try Aragorn with Spirit/Lore deck but add in Celebrian's Stone. Although I'm think that might be too risky with just one core copy. Hmmm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1654142","commentId":1654142,"userName":"alexbobspoons","timestamp":1433877248,"content":"> Many thanks entMoot. I probably wasn't very clear originally.\n> \n>  \n> \n> Phew! I think I would have struggled if this were not the case. In fact I struggle anyway but thats by the by (have yet to add shadow effects). Can't wait to get kicked by Anduin. Will prob do Journey through mirkwood with shadow effects first maybe.\n> \n>  \n> \n> Which deck best combo's with Lore? I like spirit for the anti shadow effects/treachery cards but I think Leadership is generally more appealing. Maybe try Aragorn with Spirit/Lore deck but add in Celebrian's Stone. Although I'm think that might be too risky with just one core copy. Hmmm.\n\n \n\nApologies about the misunderstanding with the restricted cards, my bad :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAs to teaming up, eek, my own newbie experience is that usually I play a tri-sphere deck and still end up wanting cards from the other sphere, they all are so well defined with their own strengths. One scenario (wont say which) I used songs to get an extra sphere-icon so I could quad-sphere (thats how bad at dedicated deck building I am).\n\n \n\nI think you have a good grasp that Leadership does go well with Lore (in core situations) as its more the all-round sphere. Each of the other three spheres are best at something, but also lacking at something, whereas Leadership seems middle of the road Jack of all trades to an extent.\n\nMy first (of only ever two) Anduin victory was Lore/Leadership. Its a great quest for variety of theme in its story :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] have fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1654339","commentId":1654339,"userName":"TwiceBorn","timestamp":1433886247,"content":"Hmmm… All this makes me curious as to how much \"easier\" it might be to take on Dol Guldur without shadow cards. You'll have to try and let us know (after you're done with Anduin, of course), Red Die Guy. :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1654834","commentId":1654834,"userName":"Red Die Guy","timestamp":1433933134,"content":">  \n> \n> Apologies about the misunderstanding with the restricted cards, my bad :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> As to teaming up, eek, my own newbie experience is that usually I play a tri-sphere deck and still end up wanting cards from the other sphere, they all are so well defined with their own strengths. One scenario (wont say which) I used songs to get an extra sphere-icon so I could quad-sphere (thats how bad at dedicated deck building I am).\n> \n>  \n> \n> I think you have a good grasp that Leadership does go well with Lore (in core situations) as its more the all-round sphere. Each of the other three spheres are best at something, but also lacking at something, whereas Leadership seems middle of the road Jack of all trades to an extent.\n> \n> My first (of only ever two) Anduin victory was Lore/Leadership. Its a great quest for variety of theme in its story :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] have fun.\n> \n>  \n\n \n\nNo, the fault was mine. I really wasn't at all clear since I did not mention Thalin in that post.\n\n \n\nI like the idea of a tri-sphere deck so thats something for further down the road. More options is always good. Just means resource management becomes more necessary I suppose.\n\n \n\nExcellent. Lore/Leadership it is! Bring on Anduin! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n> Hmmm… All this makes me curious as to how much \"easier\" it might be to take on Dol Guldur without shadow cards. You'll have to try and let us know (after you're done with Anduin, of course), Red Die Guy. :-)\n\n \n\nSure! I'll try Anduin then go straight onto Dol guldur (so Lore/Leadership). I have no idea if thats a mistake but I'll have fun finding out!\n\nWill let you know :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1654921","commentId":1654921,"userName":"alexbobspoons","timestamp":1433940762,"content":"Have great fun :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nYes resource management in Tri-Sphere is certainly more key, but there are cards to help with that as you will no doubt find during your exciting learning curve. Some give extra resources, some allow you to transfer resources, some simply give additional sphere-icons to your heroes so they can spend on multiples.\n\nIt has its plusses of a more varied deck, and its minuses of managing those resources. All simply extra additional depth to a great game.\n\n \n\nPS: hehe you are so gonna hate Hill Trolls pretty soon *huge grin*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1657455","commentId":1657455,"userName":"Red Die Guy","timestamp":1434100650,"content":"**Update**\n\n \n\nI played Journey down the Anduin last night (w/ gold threat cards, no extra starting resource but no treachery cards - baby steps :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ) with dual Lore/Leadership deck but added in about 6 Spirit cards (Galadhrims Greeting, Will of the West, For Gondor) as I had Aragorn so wanted to draw Celebrian Stone. This was a big mistake! I never drew the **** Stone! Haha!\n\n \n\nHeroes: Aragorn, Beravor & Glorfindel. Massive threat total but hoped to mitigate with Gandalf and Greeting then use Will of the west to draw again - didn't work quite like that as I mentioned but still had 2 sneak attacks which I used for Gandalf in the planning phase.\n\n \n\nI really struggled early on with resource management and that **** Hill Troll! Alex, yeah its nuts. I took a ton of threat but drew snare and had enough threat the turn after to trap it. Typically I was whacking away at it prior to drawing snare and had it down to 1 wound! When I drew infighting (I chucked in some new cards because hey, fun right?) I knew exactly what to do with that - when a nasty chieftain guy turned up (Ulfak?) Wham, infighting killed him. Phew.\n\n \n\nOnce I got my economy going by getting Steward of Gondor onto Aragorn since he was the only Leadership character and constantly needing his resource to stand, I was away. Man that cards is great. I also got self preservation onto him which although anathema to his character really helped taking hits as he was my main blocker.\n\n \n\nFrom this point on I got loads of ally cards out and never looked back. I came very close to losing at the beginning with the Hill Troll wailing on me, all of my hero's were close to death. I was having to spend Glorfindel's resource to keep people standing so I couldn't get Daughter of Nimrodel out when I drew it. When I did she got ganked by a treachery!\n\n \n\nBy the way - Quick question - when a card says assign damage to so and so (not infighting but say Dol Guldur orcs, Necromancers reach and Gandalf), is this damage reduced by defense? I don't think so but just wanted to check. Its just after the game I looked at some gold enemy cards for Mirkwood and Hummerhorns look absolutely deadly! If your threat is high and you have no counter to enemy text ability (can't think of any at mo) then one of your heroes is dead! Seems harsh for a core game card. Oh well such is life and games.\n\n \n\nAlso, I realised half way through that I was playing wrong. At the beginning of a turn I have been activating character abilities, exhausting cards and then playing allies/attachments. I realised last night that's the wrong way around. Whoopsie.\n\n \n\nLesson learnt: Don't rely on a single card being drawn. Stupid mistake. I had 5 spirit cards in hand at the end with no use. Also, I think Aragorn may be best with another Leadership character for extra early resource. I'm thinking of running dual Leadership/Spirit next Anduin adventure. Eowyn for obvious reasons.\n\n \n\nTo the River! :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nEdited June 12, 2015 by Red Die Guy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1657584","commentId":1657584,"userName":"Ecthelion III","timestamp":1434114454,"content":"Direct damage (such as Hummerhorns) is not reduced by defense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1657658","commentId":1657658,"userName":"PocketWraith","timestamp":1434119905,"content":"Yeah, the only way to have all your heroes survive engaging the Hummerhorns is if one of them has more than 5 hit points - so hero Beorn (From the first Hobbit box) or hit points boosted by attachments (Citadel Plate, Boots from Erebor, Ring Mail, Hardy Leadership, Elven Mail, Ent Draught).\n\nOh, or if you have a way of cancelling some or all of the damage that also works - Frodo could engage the Hummerhorns and just take 5 threat instead.\n\n \n\nAnd relying on a specific card being drawn can work out alright, but if you want it to be reliable you want to have 3 copies of that card and decent card draw (plus possibly mulligan for it). With Celebrian's Stone being a x1 in the Core Set... that's not going to work out so well without some decent way of digging it out of your deck.\n\nEdited June 12, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1657885","commentId":1657885,"userName":"DukeWellington","timestamp":1434128294,"content":"Another way to survive hummerhorns is to have Frodo as a hero. He solves a lot of problems by soaking damage, if you can take the threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1658063","commentId":1658063,"userName":"TwiceBorn","timestamp":1434136663,"content":"You can also destroy the hummerhorns before they engage, using Quick Strike/Dunhere, Core Gandalf's direct damage ability, etc. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1658283","commentId":1658283,"userName":"alexbobspoons","timestamp":1434150395,"content":"Hummerhorns is a nasty one.\n\nGlad you had a good time, sounds like fun. For me, the excitement of the raft ride with double encounter cards being drawn is tense, whether to selectively engage one or all out quest to the end.\n\nIn later packs, song-cards give you ability to use other cards and then theres a minstrel who can fetch a song, so 3 songs and 3 minstrels in your deck means good chance of getting your sphere-icon quickly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWhen are you thinking about trying the terror/fear/excitement/thrill of shadow cards? They truly add awesome depth even though increase difficulty :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nOn Anduin, i once had the first drawn encounter as the second hill troll, man that smashed me. I started at about 28 threat so only had two turns before two trolls engaged at speed!\n\nFor when you can play cards, actions etc theres a great sequence diagram at the back of the rules :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEnjoyed reading your post thanks!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1660050","commentId":1660050,"userName":"Red Die Guy","timestamp":1434363933,"content":"Thanks for the replies people. Much appreciated! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nIts nice to see that there are indeed quite a few ways to deal with hummerhorns (and other nasty cards). Not sure what I could do with core box other than Dunhere and Gandalf but I'll find a way.\n\n \n\nI think I am going to try Dol Guldur first with my current easy level just for fun and then start anew from Mirkwood with shadow cards. For which I will definitely be taking Spirit deck of some kind! Try and mitigate nasty effects :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\n \n\nAlex, which packs have useful songs in? Its Fathers Day Sunday and its already been let slip that I'm getting an Adventure Pack (such a great family lol!).\n\n \n\nWhen I saw that two trolls were in the encounter deck I prayed that I didn't draw the second one. I would have been utterly crushed if I had!\n\nDid you manage to beat the quest on that occasion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1660649","commentId":1660649,"userName":"TwiceBorn","timestamp":1434396592,"content":"Song of Kings (neutral card that grants attached hero a Leadership icon) -- The Hunt for Gollum\n\n \n\nSong of Wisdom (same as above, but grants a Lore icon) -- Conflict at the Carrock\n\n \n\nSong of Travel (same as above, Spirit icon) -- The Hills of Emyn Muil\n\n \n\nSong of Battle (same as above, Tactics icon) -- The Dead Marshes\n\n \n\nThere are other songs in the game, but those are probably the ones you will benefit most in light of your current stage in the game.\n\n \n\nAnd FYI, you can search cards/sets on this site (which is now owned by FFG)… http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]\n\n \n\nHave fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1660664","commentId":1660664,"userName":"alexbobspoons","timestamp":1434397337,"content":"I see the song card has been answered :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] as to surviving the two trolls if memory serves they bashed me to bits!!!\n\nHowever, later on with deck tweaking, i did take two trols at once during conflict at the carrock :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175304-newbie-looking-to-play-with-my-wife/?do=findComment&comment=1660797","commentId":1660797,"userName":"CJMatos","timestamp":1434404949,"content":"> .....\n> \n>  \n> \n> And FYI, you can search cards/sets on this site (which is now owned by FFG)… http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]\n> \n>  \n> \n> Have fun!\n\n \n\nCan also search in here [http://hallofbeorn.com/Cards/Search]"}]}