{"url":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/","title":"Battle of Five Armies 2 questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1610524","commentId":1610524,"userName":"midwestborn86","timestamp":1431017292,"content":"Heedless of order forces you to pick a new quest if possible otherwise Doom 3. If this card is revealed at setup I'm assuming it's Doom 3 as you do not select a new quest until before resources and card draw in the resource phase. Is this correct?\n\n \n\nAlso Bolg grants surge to the first goblin revealed each round. If a goblin is revealed at setup this technically isn't a round yet so the surge would happen during the 1st and every subsequent round with a goblin revealed correct? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1610875","commentId":1610875,"userName":"TwiceBorn","timestamp":1431026488,"content":"1) Correct.\n\n \n\n2) From the FAQ:\n\n \n\n(1.19) Card Effects during Setup\n\n“When Revealed” effects are resolved if the cards are revealed during setup. A player can trigger responses during setup, following the normal game rules. Players cannot take Actions during setup. \n\n“When Revealed” effects that last “until the end of the phase” will last until the end of the first resource phase. Effects that last “until the end of the round”, will last until the end of the first round.\n\n \n\nSo a goblin revealed during set-up will trigger Bolg's surge effect. I don't think that ruling is particularly logical since, as you pointed out, set-up occurs before the first round officially begins (and I played it that way the first few times, until I noticed the FAQ entry). But it is what it is...\n\n \n\nI've been playing The Hobbit saga \"progression style\" 2-handed, and have yet to beat The Battle of Five Armies… Bolg's surge effect makes it extremely difficult. Haven't given up, though...\n\n \n\nGood luck!\n\nEdited May 7, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1611236","commentId":1611236,"userName":"midwestborn86","timestamp":1431043626,"content":"> 1)Effects that last “until the end of the round”, will last until the end of the first round.[/size]\n> \n> So a goblin revealed during set-up will trigger Bolg's surge effect. I don't think that ruling is particularly logical since, as you pointed out, set-up occurs before the first round officially begins (and I played it that way the first few times, until I noticed the FAQ entry). But it is what it is...\n> \n> I've been playing The Hobbit saga \"progression style\" 2-handed, and have yet to beat The Battle of Five Armies… Bolg's surge effect makes it extremely difficult. Haven't given up, though...\n\nMe either. This quest is a pain. Lonely mountain was good though. If he surges during setup he won't surge again the first round right?\n\nEdited May 8, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1611346","commentId":1611346,"userName":"PsychoRocka","timestamp":1431050265,"content":"So if this does trigger during setup it cannot then trigger during the quest phase that turn as it is the FIRST goblin revealed each ROUND (not phase that would just be insanity) so at least it is only one or the other and not both."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1611390","commentId":1611390,"userName":"GrandSpleen","timestamp":1431053413,"content":"Yeah, and this is pretty much always the way it plays out in 3-4 player games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1611513","commentId":1611513,"userName":"TwiceBorn","timestamp":1431063644,"content":"> So if this does trigger during setup it cannot then trigger during the quest phase that turn as it is the FIRST goblin revealed each ROUND (not phase that would just be insanity) so at least it is only one or the other and not both.\n\n \n\nVery good point. Looks like I've been making it unnecessarily hard on myself by having Bolg trigger during set-up and first round… but now that you gentlemen have brought the matter to my attention, yes, I agree that Bolg's effect would only trigger during set-up or first round, and not both.\n\n \n\nHopefully that'll make it a tiny bit easier!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1619210","commentId":1619210,"userName":"midwestborn86","timestamp":1431542047,"content":"Finally beat it once (dual handed) and it was a solid win though this quest always feels shaky at the beginning. I got lucky and did a 1st and 2nd turn \"Expecting Mischief\" combined with Thalin which did 3 damage to the first goblin the first 2 rounds killing them before their surge keyword that they gained takes effect (correct? I know the damage is before surge but they are still considered to gain the keyword I believe)\n\n \n\nEnded with the Eagle discarding a bodyguard and Sneak Attack Gandalf + To Me O Kinsfolk Orcslayer (5 damage) downing the other bodyguard and one of my Dwarf Heroes quick-striking Bolg with a bunch of Unseen Strike (which is great on Bolg by the way with 50 threat) and Kazaad Kazaad. Don't know how many times this is gonna work out like that though haha can't expect to have that perfect hand every game. Sneak Attack, To me, Gandalf, Orcslayer in discard, eagle out, weapons and treasures on gloin, damage buffs, and quick strike.\n\nEdited May 13, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175562-battle-of-five-armies-2-questions/?do=findComment&comment=1619600","commentId":1619600,"userName":"Mndela","timestamp":1431557389,"content":"Yes, good plays. Seems all correct, also the Expecting Mischief + Thalin avoiding a surge in an enemy with 3hp.\n\nCongrats"}]}