{"url":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/","title":"Treachery of Rhudaur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612057","commentId":1612057,"userName":"divinityofnumber","timestamp":1431097828,"content":"mec42-clamshell.png [https://images-cdn.fantasyflightgames.com/filer_public/dc/91/dc916c28-758b-4599-b843-f8a9069223e5/mec42-clamshell.png]\n\n \n\nmec42-fan.png [https://images-cdn.fantasyflightgames.com/filer_public/a7/67/a76723e5-9a90-4755-b301-b3c8776aa17b/mec42-fan.png]\n\n \n\nsecrets-of-rhudaur-1b.png [https://images-cdn.fantasyflightgames.com/filer_public/7c/30/7c305849-c7e8-4427-8d5e-bed64bb26b79/secrets-of-rhudaur-1b.png]\n\nquiet-the-spirits.png [https://images-cdn.fantasyflightgames.com/filer_public/28/c8/28c8d431-4f50-45a8-a37e-4f299c48e1ef/quiet-the-spirits.png]\n\n \n\nerestor.png [https://images-cdn.fantasyflightgames.com/filer_public/32/00/320034c3-a0fe-4150-886e-d1d3abee94a7/erestor.png]\n\n \n\nelven-spear.png [https://images-cdn.fantasyflightgames.com/filer_public/94/f4/94f43359-887b-4c64-91dc-39263aa9adaa/elven-spear.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612076","commentId":1612076,"userName":"Fingolfin Fate","timestamp":1431098516,"content":"I was just asking for more weapons (among other things) in my own thread (on saga expectations) and here we have one. Both the Spear and Erestor are great. Plus the new Silvan ally that would fit very well in both The Galadhrim deck (Celeborn, Galadriel, Haldir) and whichever deck that has the two above-mentioned cards. Love the Elves, very excited about the pack (and the whole cycle)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612082","commentId":1612082,"userName":"Fingolfin Fate","timestamp":1431098784,"content":"An interesting Leadership card, Reinforcements. Whilst we can only guess what it does, there comes a new mono-sphere card of the like of Thicket of Spears from Tactics and Shadow Gave Way from Spirit. It is funny to see it took some four years for the designers to decide that each sphere needs a card like that. At least this is what I am guessing and the Lore equivalent is on its way: either this cycle or next.\n\nAs for the guesses, I hope it brings allies from your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612084","commentId":1612084,"userName":"Teamjimby","timestamp":1431098903,"content":"Erestor is crazy.  I'm curious to see how he plays.  I'm a little worried that he'll be like Gandalf in that it totally changes how the game is played.\n\n \n\nThe spear is nice and a 1 cost Silvan ally (that doesn't get easily discarded) has a lot of value."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612087","commentId":1612087,"userName":"Mndela","timestamp":1431099009,"content":"Pffffffff, i'm getting crazy! Muuuuaaahahahaha\n\n \n\nElven Spear: The other side of Protector of Lorien, curious.\n\n \n\nThe craziness: Erestor open the door to a 100 cards decks. If you got 1 copy of each card of the game, generally with 0 or 1 cost. Yeah, good, very good! Sure you will play tones of card of your mega-deck, and fast, very fast!. And 1 spirit resource pool for when you get dwarven tomb or stand fight, to get the card you want in your discard (amazing), and of course Test of Will (no problem with his last faq if your deck has 100 cards or more ^^).\n\n \n\nPD: as always, congrats for the awesome artwork\n\nEdited May 8, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612112","commentId":1612112,"userName":"Fingolfin Fate","timestamp":1431099592,"content":"^That is true. Up to now, I never considered having more that 50 cards in a deck. Erestor does really open that option. Of course I am saying this without experience and 50 still maybe the best way to go if you find the right deck but it is definitely a great step from the designers to even trigger this thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612123","commentId":1612123,"userName":"Mndela","timestamp":1431099970,"content":"Also, Erestor is very good in monosphere lore with Scroll of Isildur. You can collect a lot of events in discard pile ready for play by the attached Scroll. (And Hammerstroke to get the lost Scrolls)\n\n \n\nTo manipulation discard pile was property of spirit sphere (Emery, Zigil, Stand Fight, Dwarven Tomb, Will of the West), but anyway, welcome lore Erestor! -Maybe Erestor is more powerful with bisphere lore-spirit than monolore-\n\nEdited May 8, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612133","commentId":1612133,"userName":"Fingolfin Fate","timestamp":1431100295,"content":"^You mean Hammersmith.\n\nAnd yes, this is true. Though they will probably have cards in other spheres (like the Weaver, Spirit, or Spear, Tactics) that go well with the whole strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612157","commentId":1612157,"userName":"Olorin93","timestamp":1431101065,"content":"This is pretty much exactly what I've been wanting for my support Noldor. Erestor and the spear look fantastic and I can't wait for the scenario! Obvious combo with Protector of Lorien."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612160","commentId":1612160,"userName":"17th Knight","timestamp":1431101149,"content":"So best heroes to play with Erestor for maximum jank:\n\n          \n\nErestor + Gandalf + Grima = Playing any sphere you want, and doing so cheaply while always having access to the top card of your deck\n\n \n\nErestor + Gandalf + Galadriel = Playing any sphere you want, having easier access to spirit and lore, AND you get to draw extra cards, and reduce threat, and with cheap allies you can have them all quest the turn they come out, and you can control what Gandalf can play by controlling the top card of your deck.\n\n \n\nErestor + Spirit-Theoden = Cheap flood-the-field Rohan deck. Add Galadriel for card draw and threat reduction. Add Eowyn for maximum questing craziness.  \n\n \n\nErestor + Celeborn + Galadriel =  Not as much jank as with Gandalf but now flooding with Silvan allies who don't exhaust when they come into play. No access to tactics, though. \n\n \n\nErestor + Celeborn + Gandalf = Silvan deck with access to all spheres, and top card of the deck, no inherent card draw or threat reduction, but you get access to tactics, including the Noldor and Silvan allies\n\n \n\nErestor + Bombur + Oin/Thorin/Ori = Same as starting with 3 Dwarves, you'll rapidly get access to dwarf characters, which gives you one of the following: access to Tactics (Oin) ; More resources (Thorin) ; Even more card draw (Ori)\n\n \n\n \n\nI feel like playing spirit is almost essential as they have the best recursion in the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612165","commentId":1612165,"userName":"Gizlivadi","timestamp":1431101332,"content":"This is indeed a mixed bag for me. And here's why (rant): First, story-wise this is getting strange. I was reading and looking at the map at the same time in the beggining and it seems like we're returning to the Weather Hills/Rivendell region again, It kinda looks like they wrote themselves into a corner, and we got stuck in basically where we've been in Black Riders and Lost Realm, except for the Mount Gram quest which I really look forward to. I was originally hoping we would go to Lake Evendim, Annúminas, Carn Dum, places like that. And what we got so far is the wilderness of Eriador, again, Mount Gram which is really the most redeeming one, Ettenmoors which while not explored before to depth (still did to some extent in Black Riders) is still kind of the same wilderness, and now we're going again to a place very similar to one in LR with the same boss. However I am really looking forward to seeing where they're actually gong with these. \n\n \n\nAs for the quest, I never liked Time at all, but I do appreciate that they're not just ditching the mechanics they've come up with, so that gives me hope for side quests. The good thing is that I suppose the encounter cards won't interact with Time at all and i'ts just gonna be a counter. That's what I hope. Otherwise, the quest looks amazing. It feels like Nin-in-eilph done right to me, plus cool flip over objectives, and undead are never unwelcomed. Really cool.\n\n \n\nAs for the cards, that leadership event will haunt me until the pack comes out. Really the card I'm most looking forward in the cycle, apart from the Veteran of Osgiliath. Anything that works great with mono-leadership is great, especially Gondor. And it looks like that event with fetch allies or something like that, which may be really amazing if it is like the other 3 cost events of that \"cycle\". The Silvan Weaver is interesting. I abosolutely loved the Silvans and this looks like a very nice addition to take back events and discarded attachments (I assume you take the top card of the discard pile into your hand). \n\n \n\nThe Noldor archetype... Personally it dissapoints me that the hero wasn't Arwen... I was really hoping for Spirit Arwen. I knew at least that the victory display mechanic wasn't going to be the Noldor mechanic. Their actual mechanic of discarding cards indeed strange though, I think you will need to run Erestor with a Spirit hero just for Will of the West, which is kinda restrictive, but with that said, Erestor looks like a pretty good hero, though probably NOT with Elrond if you're running Vilya. The spear is also really good, but the art feels a bit to movie-like. In any case I can imagine using Erestor, Legolas and Glorfindel, and mostly 0,1 and at most 2 cost cards (and only a few select ones, Asfaloth comes to mind), that should work nicely. OR, as Mndela said already, a Highlander kinds variant could be an option.\n\nEdited May 8, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612191","commentId":1612191,"userName":"John Constantine","timestamp":1431102006,"content":"Erestor just totally blown my mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612193","commentId":1612193,"userName":"monkeyrama","timestamp":1431102055,"content":"Interesting new hero, hard to tell how much of a change he makes, but certainly a fresh idea. Certainly makes cheaper cards the key, and he still only gives you 4 per turn in total without other card draw. \n\n \n\nI'm so behind on the game that I only just discovered how much fun Halbarad is, so the idea of more heroes to try out is sickening in a way! Not even tried the last Lost Realm quest or any the Treason of Saruman!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612194","commentId":1612194,"userName":"Fingolfin Fate","timestamp":1431102082,"content":"I wouldn't say Erestor goes well with Galadriel, or the entire Silvan synergy. Not even event responses like A Test of Will. That is all good, I think. Very innovative. I will probably not add more card draw into the deck, and yes, you probably only want 0-2 cost cards. The hardest may be to properly manage the very first round as you will be getting 10 cards, and only have three resources to play them. Might be surely worth it to mulligan for the 0-costs like Elven Spear or Protector of Lórien. As for the article-mentioned two Noldor allies from the Dwarrodelf cycle, I am still not sure. Erestor certainly gives them more value but they are not very strong anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612216","commentId":1612216,"userName":"Gizlivadi","timestamp":1431102482,"content":"I think the one that doesn't exhaust to attack is very good. But I don't see you you will even be able to play them if you're discarding your hand every round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612218","commentId":1612218,"userName":"Teamjimby","timestamp":1431102524,"content":"I doubt the Silvan ally returns the top card to your hand.  My guess is that it shuffles the top card into your deck.  Otherwise her plus Tree People would be broken and you could loop it every turn.\n\n \n\nI also think we still might get an Arwen hero this cycle.  I'm holding out hope.  Ideally she'll be 8 threat or less and can work in a secrecy deck to unlock Elrond's council.  I'm surprised Erestor has such high threat.  Seems like he should only have 1 attack and 1 defense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612223","commentId":1612223,"userName":"monkeyrama","timestamp":1431102789,"content":"Yeah, the limits to Erestor are much more tricky to work with (which is good!) since Test of Will can come and go without anything useful coming up to block etc. I know you can pull it back out with other cards, but it's still a big change."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612225","commentId":1612225,"userName":"17th Knight","timestamp":1431102808,"content":"> I think the one that doesn't exhaust to attack is very good. But I don't see you you will even be able to play them if you're discarding your hand every round.\n\n \n\nWell, they only cost two. Grima + a Tactics hero OR Grima + Elrond and you can play one every turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612231","commentId":1612231,"userName":"Fingolfin Fate","timestamp":1431102948,"content":"> I think the one that doesn't exhaust to attack is very good. But I don't see you you will even be able to play them if you're discarding your hand every round.\n\nYes, pretty much. Unless you have two Tactics heroes, which would seem strange with Erestor, or some quick resource acceleration, which I can't think of, the only way to get Trollshaw Scout (that is the attacker) is to save a resource on a round previous to which you draw him. And I agree, the attacker seems much better than the Watcher of Bruinen (including the art design)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612240","commentId":1612240,"userName":"Gizlivadi","timestamp":1431103138,"content":"You are right Teamjimby just looked at COTR's fb page, it is broken with Tree People. \n\n \n\nThe problem with Grima + tactics hero or Elrond is that you need Spirit for recursion, unless you only play 0-1 cost cards, in which case Grima won't be much use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612243","commentId":1612243,"userName":"Fingolfin Fate","timestamp":1431103304,"content":"> I doubt the Silvan ally returns the top card to your hand.  My guess is that it shuffles the top card into your deck.  Otherwise her plus Tree People would be broken and you could loop it every turn.\n> \n>  \n> \n> I also think we still might get an Arwen hero this cycle.  I'm holding out hope.  Ideally she'll be 8 threat or less and can work in a secrecy deck to unlock Elrond's council.  I'm surprised Erestor has such high threat.  Seems like he should only have 1 attack and 1 defense.\n\nI think you are right, Galadhrim Weaver probably shuffles the card back to your deck, otherwise it would indeed prove too strong with the Silvan returning ally events. The space there would suggest the first word on the second line is \"shuffle\" more likely than \"add\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612256","commentId":1612256,"userName":"Gizlivadi","timestamp":1431103936,"content":"Personally the only way I could really like Erestor, or rather see him as part of a new powerful archetype, is taht this was just one half of the cake, and we got another spirit hero that worked with him that let you take a card from you discard pile into your hand. Maybe Círdan or Arwen? We're certainly not getting both with Erestor now confirmed but either of those could be it. It would certaily be powerful, especially with Silvans as said above, BUT those are important and powerful characters, and I don't think the Silvan deck would change Galadriel.\n\nEdited May 8, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612268","commentId":1612268,"userName":"blinky","timestamp":1431104423,"content":">  \n> \n> > I doubt the Silvan ally returns the top card to your hand.  My guess is that it shuffles the top card into your deck.  Otherwise her plus Tree People would be broken and you could loop it every turn.\n> > \n> >  \n> > \n> > I also think we still might get an Arwen hero this cycle.  I'm holding out hope.  Ideally she'll be 8 threat or less and can work in a secrecy deck to unlock Elrond's council.  I'm surprised Erestor has such high threat.  Seems like he should only have 1 attack and 1 defense.\n> \n> I think you are right, Galadhrim Weaver probably shuffles the card back to your deck, otherwise it would indeed prove too strong with the Silvan returning ally events. The space there would suggest the first word on the second line is \"shuffle\" more likely than \"add\".\n> \n>  \n\n \n\nYeah, I don't think they would have used the word \"into\" if they were telling you to add a card to your hand, the phrase tends to be \"shuffle x into y\" or \"add x to y\". "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612269","commentId":1612269,"userName":"monkeyrama","timestamp":1431104438,"content":"I do like the fact that Erestor encourages a play style that uses Protector of Lorien and the new Spear to boost one heroes powers every turn. Would he work on his own, secrecy style? Put in buckets of songs/secrecy cards, the Leaf Broach, Protector of Lorien to discard cards if they're not going to get played, and try to burn through quickly. Erestor and Glorfindel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612288","commentId":1612288,"userName":"Teamjimby","timestamp":1431105213,"content":"Erestor in an outlands deck = gg.  Who cares if they get discarded when you have men of the west?  Card draw has always been their biggest weakness and their low cost works well.  Erestor, Hirluin, and Sam would probably be best since that opens up Steward on turn 1 and you can play Bill for free to use with a Very Good Tale.  Also maybe Aragorn for Sword that was Broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612298","commentId":1612298,"userName":"Glaurung","timestamp":1431105538,"content":"Erestor is cool! New deck building options is upon us!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612328","commentId":1612328,"userName":"Noccus","timestamp":1431106661,"content":"I have not, and probably will not make up my mind about Erestor until I've used him a couple of times.\n\nHe's just one of those heroes with that kind of ability that you will eighter love or hate.\n\nAs his ability is not a response, you are forced to trigger the effect every turn yes?\n\nThe 1st combo partner that popped into my head and I did not see mentioned yet is Beregond.\n\nHe has a 2 cost reduction or weapons & armor. You can load him full of cheap stuff for free every turn if you put enough of it in your deck.\n\nAnd he will work well of course with SoG. But that's just too easy.\n\nEdited May 8, 2015 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612412","commentId":1612412,"userName":"GrandSpleen","timestamp":1431110451,"content":"I swore out loud when I saw Erestor just now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612481","commentId":1612481,"userName":"gandalfDK","timestamp":1431113818,"content":"w00t"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612498","commentId":1612498,"userName":"John Constantine","timestamp":1431114507,"content":"Don't want to appear to be sore or something, but I'm kinda sad that Erestor has no \"profession\" trait, like Noble, Warrior, Scout, etc. Who was he in the books? Why they leave him without a prof trait?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612503","commentId":1612503,"userName":"tricil","timestamp":1431114740,"content":"The crazy thing actually is that with Erestor you will start the first round with 10 cards in your hand. That's 20% of a standard sized deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612551","commentId":1612551,"userName":"Emilius","timestamp":1431117386,"content":"Yes, but usually you have only 3 resources in total in the first round  and then the cards are all discarded"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612571","commentId":1612571,"userName":"John Constantine","timestamp":1431118221,"content":"I would call them most useless 10 cards you'll ever have at once... unless there is some discard pile meta incoming.\n\nEdited May 8, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612593","commentId":1612593,"userName":"GrandSpleen","timestamp":1431119169,"content":"> I would call them most useless 10 cards you'll ever have at once... unless there is some discard pile meta incoming.\n\n \n\nYes there is:\n\n \n\n\"\"To represent the inner strength and resolve of a fading people, these new Noldorcards grow in power as cards are discarded from your hand. Some of them have powerful effects that require you to discard cards from your hand as a cost. Others can only be played while they are in your discard pile, requiring you to first discard them, and giving you an avenue with which to trigger other discard effects. Many of these effects breathe new life into older cards such as the Trollshaw Scout [https://images-cdn.fantasyflightgames.com/filer_public/02/8a/028a3476-129d-4f3f-bf47-ee2b4ea2ae44/trollshaw-scout.png] (Foundations of Stone, 104) and Watcher of the Bruinen [https://images-cdn.fantasyflightgames.com/filer_public/99/a1/99a1f0d0-29e7-4592-90e8-26cb826f05a8/watcher-of-the-bruinen.png] (The Watcher in the Water, 56).\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612601","commentId":1612601,"userName":"Olorin93","timestamp":1431119657,"content":"> Don't want to appear to be sore or something, but I'm kinda sad that Erestor has no \"profession\" trait, like Noble, Warrior, Scout, etc. Who was he in the books? Why they leave him without a prof trait?\n\nI would've liked to see another trait as well, but we don't know very much about him from the books. It could be \"Counsellor\", but that would just be for flavour as I doubt they'd expand on a trait like that (would be cool if they did, though)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1612611","commentId":1612611,"userName":"tricil","timestamp":1431120320,"content":"Well, starting with 10 cards can be super useful if you are running a combo heavy deck with lots of cheap attachments (LoV, Gondorian Fire, Nenya, Blood of Numenor, etc.). 3 resources would actually be enough to get all of them into play immediately. Add Legacy of Numenor and you could also get Steward of Gondor into play round 1 with a relatively good probability (assuming 3 copies each, of course, since you will discard unnecessary copies anyway...)\n\n \n\nEdit: The chances to start with a specific (3x) card in the starting hand are 57% and 66% with 7 and 10 cards, respectively (including 6 cards before mulligan, if necessary). The chances to start with a 2-card combo are 20% and 30%, respectively. Well, okay, the probabilities are not as high as I initially thought they would be... :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\n \n\nEdit2: Now that I did the maths, I guess that his draw/discard ability really is not all that great. Even if there were several new discard related action cards, you would need to draw them first and this can be pretty random (<50% chance per round). In light of this, I agree with Gizlivadi in that we can probably expect another hero that provides more regular interaction with the discard pile. With cards like Stand and Fight and Dwarfen Tomb, Spirit seems to be the right sphere for that.\n\nEdited May 9, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613085","commentId":1613085,"userName":"Olorin93","timestamp":1431160933,"content":"Does anyone else think there should be a card that allows you to play Noldor allies cheaper? (Like O Lorien, Heir of Valandil etc.) We have 12 Noldor allies out so far, ranging from 2-5 in cost with an average cost of 2.75. In multi-sphere decks it may be difficult to gather enough resources to play cards every round. On the other hand, it might be a good strategy to discard cards for effects and save up resources certain rounds, and then put cards into play when you get the ones you want.\n\n \n\nIn comparison, there are 16 Silvan allies so far, so I'm holding out for more unspoiled Noldor characters. Again, I like the mechanic, and I'm sure we'll see it developed more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613109","commentId":1613109,"userName":"John Constantine","timestamp":1431163787,"content":"> Edit2: Now that I did the maths, I guess that his draw/discard ability really is not all that great. Even if there were several new discard related action cards, you would need to draw them first and this can be pretty random (<50% chance per round). In light of this, I agree with Gizlivadi in that we can probably expect another hero that provides more regular interaction with the discard pile. With cards like Stand and Fight and Dwarfen Tomb, Spirit seems to be the right sphere for that.\n\nIt was said that there will be actions (and prolly responses) that trigger from the discard pile. Like Yithians from the Call of Cthulhu LCG.\n\n \n\ninterstellar-migration-tkatg.jpg [http://www.cardgamedb.com/forums/uploads/coc/interstellar-migration-tkatg.jpg]\n\nscholar-from-yith-tkatg.jpg [http://www.cardgamedb.com/forums/uploads/coc/scholar-from-yith-tkatg.jpg]\n\nstudying-the-void-tkatg.jpg [http://www.cardgamedb.com/forums/uploads/coc/studying-the-void-tkatg.jpg]\n\nyithian-scout-tkatg.jpg [http://www.cardgamedb.com/forums/uploads/coc/yithian-scout-tkatg.jpg]\n\nEdited May 9, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613112","commentId":1613112,"userName":"Mazarbul","timestamp":1431164239,"content":"So with Erestor you play what you can, paying with your hard earned resources and discard the rest at the end of the round.\n\nHmm I think I might want to have Eowyn around, and trying to attach Protector of Lorien, Herugrim and Unexpected Courage to her. She may then either quest for up to 8 or attack for up to 9 or do both with slightly less bonuses.\n\nAnd I really like the Idea of being able to actually play some of those discarded cards from the discard pile later on..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613221","commentId":1613221,"userName":"JTG81","timestamp":1431175619,"content":"Erestor with three copies of will of the West will be the basis for a very powerful deck. I'm super excited for this new hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613252","commentId":1613252,"userName":"Bullroarer Took","timestamp":1431178044,"content":"Those Yithian cards were errata'd into the void. We've got some pretty clever deck builders in this universe too and the designers are going to have to be very careful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613257","commentId":1613257,"userName":"Bullroarer Took","timestamp":1431178592,"content":"Not sure what I think about Erestor yet really. I expected Noldor to have a player deck interaction since that's what we've seen so far. Remember Light of Valinor though: Erestor might get a \"made for him\" attachment with an effect that counteracts his drawback:\n\nFancy Title\n\nAttachment 1\n\nPlay only on a Noldor hero\n\nExhaust Fancy Title to cancel any effect requiring one or more cards to be discarded from his hand.\n\nOf course, that makes Bilbo's threat even more of a joke."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613282","commentId":1613282,"userName":"soullos","timestamp":1431181091,"content":"> Does anyone else think there should be a card that allows you to play Noldor allies cheaper? (Like O Lorien, Heir of Valandil etc.)\n\n \n\nI would hope so. It would be hard to play everything considering your hand is gone at the end of the round. Maybe there would be an attachment that allows you to reduce the cost to play the next Noldor ally by one for each card you discard from your hand? Or discard pile manipulation might be a thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613302","commentId":1613302,"userName":"GrandSpleen","timestamp":1431182667,"content":"Well, we're going to get up to some discard pile shenanigans with Erestor, that's for sure.  I'll bet we get a card that makes it cheaper to play cards from the discard pile, or at least certain types of cards.\n\n \n\nThe worst thing would be if that card were a hero, because it more or less would lock in two of your hero choices if you ever wanted to use Erestor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613370","commentId":1613370,"userName":"PsychoRocka","timestamp":1431187584,"content":"Yeah I really like this new mechanic for Noldor but agree it needs some way to play certain cards from the discard pile to be truly viable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613378","commentId":1613378,"userName":"Teamjimby","timestamp":1431188422,"content":"I've been thinking about Erestor and Will of the West.  The problem is that you could draw all your copies of Will of the West in the beginning when they aren't very useful.  Of course you could include Dwarven Tombs, but now you have 6 cards in your deck for the sole purpose of recursion.\n\n \n\nBut consider a situation where you don't have any extra card draw and the encounter deck doesn't screw with your deck.  You get 10 cards on the first round and 4 cards each round after that.  So you don't run out of cards until the start of the 12th turn.  This would be an issue playing solo and maybe 2 player, but how many 3 or 4 player games last more than 11 rounds?  Not to mentions cards like Galadhrim Weaver that could shuffle cards back in and buy you more time.  I'm beginning to think the Will of the Wests just aren't worth it.  Maybe it would be worthwhile if you have 2 spirit heroes and you can play Map of Earnil to pull it back whenever you need it.  What do you guys think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613390","commentId":1613390,"userName":"tricil","timestamp":1431189287,"content":"Teamjimby, this is basically what I meant in my post on probabilities. The chances of getting the 1 or 2 events that you would want in a specific round are so low that a strategy built around them will never work out consistently. Without good cards that can directly be played from the discard pile--or a hero that gives you consist access to it--the only reliable strategy with Erestor seems to be using plenty of cheap and redundant cards, so that you will always have at least something useful and also be able to pay for it.\n\n \n\nEdit: I am not saying that this is necessarily bad but there might be wrong expectations as to how Erestor will play out in event-centric decks. In contrast, I still think that Erestor could be pretty good in decks that are build around cheap attachment combos--mainly because you usually want them as soon as possible but you do not need them in a specific round.\n\nEdited May 9, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613401","commentId":1613401,"userName":"Olorin93","timestamp":1431189906,"content":">  \n> \n> > Does anyone else think there should be a card that allows you to play Noldor allies cheaper? (Like O Lorien, Heir of Valandil etc.)\n> \n>  \n> \n> I would hope so. It would be hard to play everything considering your hand is gone at the end of the round. Maybe there would be an attachment that allows you to reduce the cost to play the next Noldor ally by one for each card you discard from your hand? Or discard pile manipulation might be a thing.\n> \n>  \n\nYes, I thought so too. A 1-cost attachment that let's you discard X cards to lower the cost of the next Noldor ally you play from your hand this round by X (possibly to a minimum of 1, as with O Lorien). Or the same thing, but with allies already gone to the discard pile. That might be even better with this mechanic, actually!\n\n \n\nAlso, I'm pretty certain but to make sure: you have to specifically discard one card to trigger an action, right? So I couldn't put Protector of Lorien on e.g. Erestor and then discard one single card to buff both him and my friend's Eowyn? I'm guessing it's one card for each effect. So considering you only really hold on to 4 cards every round (unless you have Bilbo or Daeron's Runes), it won't be insane. For instance, with 4 cards, you could buff Glorfindel to 4 WP, Elladan to 5 ATK and then have Trollshaw Scout attack once. But, as we've already said, let's hope we get more synergy with the discard pile etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613407","commentId":1613407,"userName":"JTG81","timestamp":1431190317,"content":"> Teamjimby, this is basically what I meant in my post on probabilities. The chances of getting the 1 or 2 card types that you would want in a specific round are so low that a strategy built around them will never work out consistently. Without good cards that can directly be played from the discard pile--or a hero that gives you consist access to it--the only reliable strategy with Erestor seems to be using plenty of cheap and redundant cards, so that you will always have at least something useful and also be able to pay for it.\n\n \n\nErestor is a very similar Hero to a Netrunner ID MaxX who is right now considered one of the best ID's in the game. Her ability as is Erestors is a self milling ability and requires her to play lots of recursion (9-12 cards). I would probably add card draw to the deck and would want my Will of the West to recycle key events like A test of Will, Hasty stroke, Feint etc"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613416","commentId":1613416,"userName":"tricil","timestamp":1431190912,"content":"JTG, if you had 12 recursion cards in your deck, this would of course be a completely different story (actually, the chances of drawing one of them each round would be >67% with a 50-card deck). Most of them are not for free though, so the next question would be whether all these cards would be worth their cost in resources and deck space."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613429","commentId":1613429,"userName":"JTG81","timestamp":1431192121,"content":"Here is the compilation of all the recursion in LotR sorted by sphere\n\n \n\nLeadership-Ally-Orophin\n\n                   Event-Men of the west\n\n                            -Second Breakfast\n\n                   Attachment-Tome of Atanator\n\n \n\nLore-Ally-Erebor Hammersmith\n\n         Attachment-Scroll of Isildur\n\n \n\nSpirit-Event-Will of the west\n\n                   -Stand and Fight\n\n                   -Dwarven Tomb\n\n          Attachment-Map of Earnil\n\n \n\nTactics-Attachment-Book of Eldacar\n\n \n\nEdit:I don't have either Treason of Sauruman or the Lost Relm so there could be others\n\nEdited May 9, 2015 by JTG81"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613434","commentId":1613434,"userName":"JTG81","timestamp":1431192708,"content":"> JTG, if you had 12 recursion cards in your deck, this would of course be a completely different story (actually, the chances of drawing one of them each round would be >67% with a 50-card deck). Most of them are not for free though, so the next question would be whether all these cards would be worth their cost in resources and deck space.\n\n \n\nIf you are going to use Erestor I believe that you will need to play some of these cards thankfully they are already good cards to begin with that people were playing prior to the spoiling of Erestor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613529","commentId":1613529,"userName":"monkeyrama","timestamp":1431203722,"content":"So who wants to take Erestor to Dead Man's Dike? Both the encounter deck and Erestor eating through that pile...  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613643","commentId":1613643,"userName":"PsychoRocka","timestamp":1431213841,"content":"Who wants to take him to isengard and lose instantly when they discard their hand on stage 3?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1613862","commentId":1613862,"userName":"danpoage","timestamp":1431236490,"content":"I'm just going to leave this here:\n\nhttps://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/ [https://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614010","commentId":1614010,"userName":"Olorin93","timestamp":1431255255,"content":"Great article, Dan! Got me even more excited about the archetype. I'm really hoping for a new elf Tactics hero - I'm big on theme and would love to run straight Noldor in a deck like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614113","commentId":1614113,"userName":"Bullroarer Took","timestamp":1431266118,"content":"Btw, even with unlimited cards, Watch of Bruinen and Trollshaw Scout aren't very good against today's quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614268","commentId":1614268,"userName":"JTG81","timestamp":1431277547,"content":"> I'm just going to leave this here:\n> \n> https://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/ [https://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/]\n\n \n\nCool article and I can totally see where you are going with the deck but I wonder if adding so many one off cards is going to ruin the consistency of seeing the power cards. How has the deck faired in testing against scenarios? Would it be reasonable for me to cut some situational cards like treasure hunter, spare hood and cloak etc to add more copies of the power cards like Gondorian Shield, light of valinor?; with Eowyn's ability I can just pitch them for will power or attack with spear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614276","commentId":1614276,"userName":"John Constantine","timestamp":1431278039,"content":"While Watcher is indeed not that good as he will survive 1-2 attacks at best, Trollshaw Scout can be pretty decent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614827","commentId":1614827,"userName":"danpoage","timestamp":1431321994,"content":">  \n> \n> > I'm just going to leave this here:\n> > \n> > https://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/ [https://hallofbeorn.wordpress.com/2015/05/09/deck-revenge-of-the-nerds/]\n> \n>  \n> \n> Cool article and I can totally see where you are going with the deck but I wonder if adding so many one off cards is going to ruin the consistency of seeing the power cards. How has the deck faired in testing against scenarios? Would it be reasonable for me to cut some situational cards like treasure hunter, spare hood and cloak etc to add more copies of the power cards like Gondorian Shield, light of valinor?; with Eowyn's ability I can just pitch them for will power or attack with spear.\n> \n>  \n\nTo be honest, the consistency is still relatively good - thanks to the insane amount of card draw (Daeron's Runes and Deep Knowledge, in addition to the four cards per round from Erestor). Like many of my recent decks, it fairs well against some scenarios (particularly older ones) and struggles against many of the newer ones. I don't recommend that you try it against Deadmen's Dike, that's for sure :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nTo answer your question, you can absolutely remove some of the more situational cards like Expert Treasure-hunter and Healing Herbs in favor of extra copies of Gondorian Shield and Light of Valinor. The main reason that I even included them was to have 25 0-cost cards, to prove the theory behind this deck. As I mentioned in the article, is still see this concept as an experiment, especially since we don't even know what else will be released in this cycle which will no doubt offer improvements to the strategy. I look forward to seeing how this archetype evolves and what kinds of decks other players devise.\n\nEdited May 12, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1614900","commentId":1614900,"userName":"Fingolfin Fate","timestamp":1431329802,"content":"Judged by the preview article, we will get the whole set of cards for the Noldor strategy. I expect to see at least three more of the likes of the Spear, but probably more like 6+, most of which might not be unique. So expect Erestor decks to get really good by the pack 4 or 6 of the cycle. Even now I can see him with Glorfindel and Leagolas doing really well, if you can defend. Of the events, I think Feint is the most consistent one to use here. The chance of having at least one non-immune enemy to use it against per round is quite high. And the fact you can recycle it with Galadhrim Weaver makes it that much more fit.\n\nI am not sure about having Will of the West three times though. Normally, you get 10 cards with Erestor round 1. Then if you get 4 more per round, with no extra draw (which I don't think is necessary with Erestor, maybe except the Runes), you have 10 more rounds to draw all your cards. Well, most games do not last more than that, especially with 2-players, which seems to be the norm. I think one copy of Will of the West may suffice.\n\nThinking a bit more about it, with the line-up mentioned above, Glorfindel can become a decent defender. Give him Light of Valinor and Protector of Lórien and he can block the minor enemies with relative ease, and Legolas can finish them off: with the Spear or Rivendell Blade. The bigger enemies you try to Feint and kill with both Legolas and Glorfindel. In this strategy, Erestor can just quest and draw cards, but he is also quite flexible. He can become a quester and defender if you draw Miruvor and A Burning Brand. Miruvor itself seems to be a nice card here, as you can keep putting it back on top of the deck, once your Spirit resources become available. Well, just renting here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1615216","commentId":1615216,"userName":"Ecthelion III","timestamp":1431350721,"content":"I looked back at the preview article for Wastes of Eriador, and it looks like we'll be receiving cards for the Noldor strategy in that pack, but in the Spirit sphere.\n\n \n\nTHE LOST REALM SPOILER ALERT Looking at the art on the front of the pack, I'd bet that the symbol on the floor and the skeletons are just like what the heroes saw at Amon Forn in the story text of The Weather Hills.  The plot thickens... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  END THE LOST REALM SPOILER ALERT\n\nEdited May 11, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1615280","commentId":1615280,"userName":"John Constantine","timestamp":1431353588,"content":"By the way, the quest <3\n\nMe loves me some undeads!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1789858","commentId":1789858,"userName":"Nickpes","timestamp":1442032299,"content":"Changed status and it is on the boat , I guess it will be released early next month ? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1790250","commentId":1790250,"userName":"Mndela","timestamp":1442059528,"content":"giphy.gif [https://media.giphy.com/media/Tld8USHlpopYA/giphy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/175659-treachery-of-rhudaur/?do=findComment&comment=1795250","commentId":1795250,"userName":"Bullroarer Took","timestamp":1442270831,"content":"Looks like it's \"Now Shipping\"? Seems soon.\n\n \n\nEdit: :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png] !\n\nEdited September 14, 2015 by Bullroarer Took"}]}