{"url":"https://community.fantasyflightgames.com/topic/176055-an-old-card-a-new-combo/","title":"An Old Card A New Combo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/176055-an-old-card-a-new-combo/?do=findComment&comment=1616461","commentId":1616461,"userName":"Fingolfin Fate","timestamp":1431415451,"content":"At least I think it is rather good, if the text is what it seems. Remember Galadhrim Weaver from the recent spoiler of Treachery of Rhudaur. Well, it was agreed that it takes the top card of your discard pile and shuffles it into your deck. Certainly something you need a lot of in the Erestor decks. Well, I was searching through the card collection to discover a card I hardly ever used: Children of the Sea. It already has some use in Silvan decks but since its prime bonus is to add willpower and Silvan are already so great with willpower, I have almost always dropped it instantly. Now, I was trying to put up an Erestor deck, making proxy of him, Elven Spear and Galadhrim Weaver. I find that Children of the Sea should be great for the Weaver. She cannot attack or defend so basically the only think you want her for is questing, plus the nice ability that triggers as she enters play. With the event she will quest for 3 and come back later for you as you race through your deck swiftly with Erestor's ability.\n\n \n\nWhat say you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176055-an-old-card-a-new-combo/?do=findComment&comment=1616566","commentId":1616566,"userName":"gandalfDK","timestamp":1431425772,"content":"I say\n\n \n\nLet that card fight for you and let it regain its honour.\n\n \n\n \n\n \n\n \n\n \n\nAragorn: \"Fight for us, and regain your honor. What say you?\"\n\nEdited May 12, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176055-an-old-card-a-new-combo/?do=findComment&comment=1616580","commentId":1616580,"userName":"Fingolfin Fate","timestamp":1431426733,"content":"Also, and I know this is a bit silly since it's not certain the Weaver does what I said above (how I hate the partially spoilt player cards, they are better than nothing but agonizing too), Stand and Fight seems perfect for it. You lose your Weaver somehow, most likely on round 1 when you can play just a single Spirit card usually, then put it into play with Stand and Fight and shuffle the event back into your deck because of the ally's response. Quite neat anytime you lose the Weaver.\n\nHas anyone been trying Erestor as well? I know Beorn's Hall has a deck list. I have finally decided to use Tactics Boromir, Erestor and Spirit Glorfindel, and the deck plays already quite strongly. Elven Spear is cool for Glorfindel in that deck. And in coop, there are usually other good candidates, like Haldir of Lórien. It struggles solo a little but it is still alright even on its own. And it will get loads better, I am sure.\n\nEdited May 12, 2015 by Fingolfin Fate"}]}