{"url":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/","title":"Eagles of the Misty Mountain and eliminated player","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=1623246","commentId":1623246,"userName":"sappidus","timestamp":1431751779,"content":"I had a situation in two-handed solo earlier where one of my \"players\" was eliminated via hero death. That player had two eagles on the table, and the live player had an Eagles of the Misty Mountains out.\n\n \n\nRecall: EoMM's Response text is \"After another Eagle character leaves play, you may attach that card facedown to Eagles of the Misty Mountains.\"\n\n \n\nSo can those two eagles from the eliminated player be attached to the EoMM (since they are \"leaving play\"?), or do all cards of an eliminated player automatically cease interacting with the game immediately?\n\n \n\n(Consider https://www.boardgamegeek.com/article/7608788#7608788 [https://www.boardgamegeek.com/article/7608788#7608788)] )\n\n \n\nSimilarly (...or is it...), do all the heroes/allies from an eliminated player trigger the Horn of Gondor for an active player? I've seen a couple of old threads about this precise question, but I wasn't sure if it had ever been officially answered.\n\nEdited May 16, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=1623270","commentId":1623270,"userName":"GrandSpleen","timestamp":1431754221,"content":"Well, Nate ruled in that thread that you linked:\n\n \n\n\"A card \"leaves play\" any time it moves from an in-play state to an out of play state (hand, deck, discard pile, removed from game). (\"Enters play\" play is moving from any of these states into the game.)\"\n\n \n\nIn the core set manual, it says this about player elimination:\n\n \n\n\"When a player is eliminated, his hand, all of the cards he controls, and his deck are placed in their owners’ discard pile\"\n\n \n\nSo all of those cards leave play... Eagles of the Misty Mountain should be able to take any eagles leaving play as a result, and I see no reason why you shouldn't trigger Horn of Gondor as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428383","commentId":2428383,"userName":"sappidus","timestamp":1474672046,"content":"Just to point out: Horn of Gondor has been errata'ed since this question, so that part no longer applies (the eliminated player's characters aren't \"destroyed\"). Re: Eagles of the Misty Mountains, the ruling here...\n\nhttps://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?p=2426083 [https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?p=2426083]\n\n...would seem to indicate that the eliminated player's Eagles are removed from the game immediately and thus cannot be attached to EoMM.\n\nThis also jibes with a separate question I once asked of Caleb: can you Stand and Fight allies from an eliminated player's discard pile? The answer is no -- said allies have been removed from the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428521","commentId":2428521,"userName":"Kakita Shiro","timestamp":1474680724,"content":"Someone ought to say something to Some Sort. He had a deck on Ringsdb recycling Stand and Fight and suicide deck's discard pile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428565","commentId":2428565,"userName":"PocketWraith","timestamp":1474686214,"content":"> Someone ought to say something to Some Sort. He had a deck on Ringsdb recycling Stand and Fight and suicide deck's discard pile.\n\nI'm pretty sure that was why sappidus asked the question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428569","commentId":2428569,"userName":"sappidus","timestamp":1474686821,"content":"> Someone ought to say something to Some Sort. He had a deck on Ringsdb recycling Stand and Fight and suicide deck's discard pile.\n\nCovered: if you look on the comments for that deck, you'll see I left the bad news for the deck a few weeks ago."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428739","commentId":2428739,"userName":"NathanH","timestamp":1474707629,"content":"Since the game rules explicitly state that an eliminated player's cards go straight to their owner's discard pile, and nothing in the FAQ contradicts this, I'm not sure where Caleb got this ruling from."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176665-eagles-of-the-misty-mountain-and-eliminated-player/?do=findComment&comment=2428862","commentId":2428862,"userName":"sappidus","timestamp":1474723774,"content":"I should be more precise: the precise ruling on Stand and Fight was as follows...\n\n> Great question. The answer is no, because you cannot search the discard pile of a player who is not a part of the game. Once a player is eliminated from the game, he is no longer part of it.\n\nI suppose based on that alone, the EoMM is still an open question. However, taking the ruling in the other thread as gospel -- \"...all of the cards under that player's control are immediately removed from the game when he is eliminated\" -- resolves it as above.\n\n(Sorry to split the discussion between two threads...)"}]}