{"url":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/","title":"Treason Of Saurman Scenario The Uruk-Hai Captive Rule","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1623680","commentId":1623680,"userName":"ShuffleTheDeck","timestamp":1431794261,"content":"The rule is unclear in this scenario if the \"captive\" heroes generate influence to an influence pool for use by their owner. It is not worded like the \"prisoner\" is in the core box set scenario Escape from Dol Guldur, which fully described the restrictions. The captives are still considered in play and nothing says that their influence would not be generated or unusable by the owner. Nor have I found anything in the FAQ or in this forum that I could uncover.\n\nSo, in playing the scenario... I used the captives influence pool to play cards which felt like the hobbits were still working against the Urik-Hai as in the book. They were unable to do anything else... But could be a target of the Burden - Overcome by Grief... Nothing says it would not be feasible.\n\nDoes anyone have another interpretation on how this should be played? I cannot believe the designers left this so open ended. Their running list of FAQ's grows ever longer as they obviously overlook describing fundamental aspects all the time. I wish they would bring in playtesters who are not such fanboys of the product to accurately polish up the text before printing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1623848","commentId":1623848,"userName":"GrandSpleen","timestamp":1431805475,"content":"It's a legitimate question but you don't need to indict the design process just yet.  The answer is before you:\n\n \n\nTo Isengard! [http://hallofbeorn.com/Cards/Details/To-Isengard-ToS] states:\n\n \n\n\"Treat each Captive's text box as blank. Captives are in play but are not under any player's control. If there are no Captives in play, the players lose the game. Forced: At the end of the refresh phase, increase the pursuit value by 1. Then, if the pursuit value is 30 or greater, the players lose the game.\"\n\n \n\nYou may not pay for cards using a hero that you do not control.  Search your heart.  You know it to be true.\n\n \n\nAs for whether or not they actually gain resources, that's less clear.  As you say, I can see nothing that specifically suggests they would not.  The only thing that even comes close is in the core manual, it says that a player adds resources to \"each of his heroes'\" resource pools.  \"His\" might suggest \"controlled by him\" (much as \"you\" as a pronoun stands for \"the defending player\" in a shadow effect, or the revealing player on a card with Peril).\n\n \n\nIf they do generate resources, you can steal their resources with a card like Parting Gifts [http://hallofbeorn.com/Cards/Details/Parting-Gifts-AJtR] or ... actually I think that's the only one.  And they'd need to be Leadership to make it work.  But you could give the hero a Song of Kings!  Why not?  Fun times.\n\n \n\nIt looks like you can attach Overcome by Grief to them, though. That one says \"attach to a hero,\" no mention of control.  Since our captured Hobbits (or bears, or whatever) retain their Hero card type, they are fair targets.  Woo!  \n\nEdited May 16, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1623972","commentId":1623972,"userName":"ShuffleTheDeck","timestamp":1431814087,"content":"It's poorly described for a primary facet of the expansion; hence, my dissatisfaction with their work.\n\nIt would seem the captives' pools would be like not having the Ring Bearer, so you cannot use their influence. It doesn't say you can't manipulate it. Which I was doing via the Leadership sphere somewhat..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1624136","commentId":1624136,"userName":"GrandSpleen","timestamp":1431825712,"content":"I'm interested in whether or not these guys should be getting resources-- I'll send in a question through the official channel.\n\n \n\nI'm betting they will say 'no,' but I'm curious to hear the rationale."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1624170","commentId":1624170,"userName":"ShuffleTheDeck","timestamp":1431828519,"content":"They established a similar facet in the core game's third scenario with the prisoner. Then here they create a new term \"captive.\" I am a former CCG game designer and something like this drives me nuts. It's such poor oversight on their part if they say it's exactly the same, especially when the prisoner says they don't collect influence on the Quest card. What's the difference then???\n\nHence my comment about the game's robust FAQ archive...\n\nAnd for some reason on this expansion they decided to reset the cards with Victory Points type in a box with a nearly hidden format. Completely changing the design mid-stream for some reason as if it was a problem on all the numerous previous releases??? Uhm why?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1624174","commentId":1624174,"userName":"GrandSpleen","timestamp":1431828679,"content":"I agree about the new victory point graphic, it doesn't pop out on most cards and is too easy to overlook"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1624358","commentId":1624358,"userName":"DukeWellington","timestamp":1431849600,"content":"Well, the term is resources, not influence so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1624437","commentId":1624437,"userName":"gandalfDK","timestamp":1431857126,"content":"Well, technically the term is resources, but those resources do not represent gold but influence. Interchangeble thus."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1626745","commentId":1626745,"userName":"GrandSpleen","timestamp":1431994974,"content":"And a response today:\n\n \n\n\"The captive heroes do not generate resources. I’m really glad you’re enjoying the quest!\n\nCheers,\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1626804","commentId":1626804,"userName":"PsychoRocka","timestamp":1431996984,"content":"Yeah I feel like this was a really obvious one. You can't really use the captives for anything, thats the whole point of the quest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1627293","commentId":1627293,"userName":"gandalfDK","timestamp":1432026316,"content":"Caleb is always glad when we enjoy the quests.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1627445","commentId":1627445,"userName":"Lecitadin","timestamp":1432039635,"content":"It's the same starting set up as Escape from Dol Guldur (the all-time favorite quest of solo players), except that here you don't get the captive hero back during the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628290","commentId":1628290,"userName":"Ecthelion III","timestamp":1432070868,"content":"> It's the same starting set up as Escape from Dol Guldur (the all-time favorite quest of solo players), except that here you don't get the captive hero back during the quest.\n\nFellowship Aragorn evens it out though. He rocks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628329","commentId":1628329,"userName":"ShuffleTheDeck","timestamp":1432072583,"content":"Once again LotR LCG fails to adhere to anything based on the forgone established rules/cards. (Hey, Forest Snare is too good, let's write on every card it is not effected by player's cards going forward?) Nowhere in the rules does it say a hero in play does not generate resources. Based on the fact that the Ring Bearer/Aragorn gain resources when not controlled, it would be the only premise to date that others not controlled also gain resources. Design stated In the core game's Dol Guldur \"Prisoners\" do not gain resources. Yet, nowhere does it say \"Captives\" intuitively do not gain resources.\n\nFYI Caleb... Not enjoying your LAME after thoughts. I am still going to enjoy running roughshod on this with Parting Gifts like Saruman, as a designer you clearly need to learn how to better test and write copy rules. Just something else to put into the ever expanding FAQ of this spiraling out of control game. (Yet again reminders of Decipher's Star Wars & Star Trek long gone CCGs.)\n\nDisappointed with their reply... More with us enjoying it!!! Last product I support for them..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628344","commentId":1628344,"userName":"GrandSpleen","timestamp":1432073247,"content":"By all means be disappointed, but the every time 'designer's critique shoppe' routine isn't helpful to anybody.\n\nEdited May 19, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628358","commentId":1628358,"userName":"ShuffleTheDeck","timestamp":1432073731,"content":"Typical fan boy response... Eat what they dish you.\n\nThis forum is the lamest for a game I have ever see as it has not helped make the game better. Criticism is a way to add insight that was not apparent. It's not to be taken as ad hominem... But we're enjoying it!?! Typical reason Netrunner has blown this game away in sales."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628376","commentId":1628376,"userName":"GrandSpleen","timestamp":1432074586,"content":"No, you miss the point.  It's your method of criticism that needs revision.  People don't respond the way you want them to when you come at them with bald negativity.  It's basic psychology, man.  People gotta save face, and in so doing they will reject your argument whether it has merit or not.\n\n \n\nFor example, earlier in this thread I could have said \"you idiot, it's clearly written that you do not control the Hobbits on the Objective card, which surely you would have read carefully before playing the scenario.  Have you such a flimsy grasp on the core mechanics of the game that you thought you could spend any resources that they might be generating?\"\n\n \n\nBut that would have started a flame war, and you would probably have insisted that you were right or something.  \n\n \n\nInstead, I quoted the card text and came out you a touch of humor, giving an awful misquoted Star Wars reference.  I didn't insult you, so you didn't have to save face (although you tried to anyway, \"poorly described facet,\" you said), and you dropped the point immediately.  Score me!  At that point, the thread was done, and it only continued because I choose to make it continue: I was wondering about the resource generation thing.  \n\n \n\nSee, the wise critic can manipulate others as I did you.  If you have enough emotion behind your response that it requires multiple punctuation marks, you're probably in the wrong frame of mind to be giving it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628415","commentId":1628415,"userName":"ShuffleTheDeck","timestamp":1432076872,"content":"You've done a marvelous job dear 'Spleen, do accept my apologies for raising your dander!?! Enjoy the game ... Unhindered by any cristicism going forth!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628459","commentId":1628459,"userName":"PsychoRocka","timestamp":1432079080,"content":"If you are quite finished having your temper tantrum.\n\nThe Ring Bearer/Fellowship Aragorn are always under one players control (the first player) so not sure what you are referring to exactly as they are always controlled by a player. \nIt is however stated that the captives are not controlled by any player. If no one controls them they do not get resources during the resource phase and nothing else specifically mentions that they collect resources so why exactly would they?\n\nAnd like Grandspleen said even if they WERE generating resources why would you be able to use them if you do not control the captives? \n\n \n\nCaleb is awesome and so is anyone else who is or was involved in making this game. Many people play it and although there are rules queries quite often it is in no way spiralling out of control or not well designed. It is a complex game with several variations of play so in depth rules discussion is always going to take place. If you think you can do better then go and do so!\n\nIt seems like you have a rather tenuous grasp on the rules as it is so for you to rag on the game developers so hard is ridiculous, the answer was always in front of you, you do not control the heroes so regardless of whether they collect resources or not you cannot use said resources to play cards you control. \n\nAlso it isn't influence it is resources, stop calling it influence it just makes it even more obvious you have no idea what you are talking about. \n\nFinally if you are really going to stop playing the game because you were wrong about a ruling and can't handle it thats just sad. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628606","commentId":1628606,"userName":"Ecthelion III","timestamp":1432087265,"content":"I don't understand what makes you think each hero always collects 1 resource each round. The rules don't say that. The rules say at the beginning of the resource phase, each player gives a resource to each of his heroes. You don't control the captive hero, just as much as you don't control an enemy or location. Therefore, you can't place resource tokens on the captive hero, just as much as you can't place resource tokens on an enemy or location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1628743","commentId":1628743,"userName":"DukeWellington","timestamp":1432097051,"content":"As I pointed out, dude wants his problems with the game to be extra appreciated because he used to design ccgs (wowzy wow wow), but he called it influence instead of resouces. Just saying.\n\nI agree that criticism gives opportunity for improvement, but not acting like an arrogant jack ass is also helpful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1629026","commentId":1629026,"userName":"Mndela","timestamp":1432123792,"content":"There are some criticism that just shows the stupidity of some. Sometimes after i read some suggestion, i think 'poor designers if they have to follow this idea, the game will ruin in only few time'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1629174","commentId":1629174,"userName":"gandalfDK","timestamp":1432132503,"content":".\n\nEdited May 20, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1629185","commentId":1629185,"userName":"gandalfDK","timestamp":1432132743,"content":"> Disappointed with their reply... More with us enjoying it!!! Last product I support for them..\n\n \n\n \n\n\"Gollum: \"What does it eats? Is it tasty?\"\n\n \n\n[Gollum chokes on the Elven bread.]\n\n \n\nGollum: \"Aggh! It tries to chokes us!\n\nWe can't eats Hobbit food! We must starve!\"\n\n \n\n \n\nSam: \"Well starve then, and good riddance!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/176723-treason-of-saurman-scenario-the-uruk-hai-captive-rule/?do=findComment&comment=1632384","commentId":1632384,"userName":"Dain Ironfoot","timestamp":1432306123,"content":"man, i loved this thread if for nothing else than the sheer audacity of it. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 22, 2015 by Dain Ironfoot"}]}