{"url":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/","title":"Is there any action windows between declaring attackers and resolving an attack?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1625702","commentId":1625702,"userName":"John Constantine","timestamp":1431949447,"content":"The title. For example, is it possible to first declare a dwarf as an attacker, and then to increase his attack by Khazad! Khazad! before the attack resolves?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1625773","commentId":1625773,"userName":"SauronTheGreat","timestamp":1431955136,"content":"if memory serves, than yes.  But If I were you, I would check the back of the rule book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1625799","commentId":1625799,"userName":"Chris51261","timestamp":1431956654,"content":"Yep."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1627091","commentId":1627091,"userName":"TwiceBorn","timestamp":1432011867,"content":"In this case, nevermind the Turn Sequence chart at the back of the rule book, it is incomplete. \n\n \n\nThe answer to your question, Constantine, is on p. 20 of the rule book:\n\n \n\n\"To resolve an attack against an enemy, a player follows these 3 steps, in order. Players may play event cards and take actions at the end of each step.\"\n\n \n\nThe 3 steps are: 1. Declare target of attack, and declare attackers. 2. Determine attack strength. 3. Determine combat damage.\n\n \n\nSo yes, you could play Khazad! Khazad! at the end of step 1 of the Attacking Enemies \"sub-phase.\" \n\n \n\nYou might also want to review the text in the rule book for the Questing and Combat/Resolving Enemy Attacks phases, as the main text specifies action windows in those phases that are NOT listed in the Turn Sequence chart at the back of the book.\n\nEdited May 19, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635041","commentId":1635041,"userName":"Mndela","timestamp":1432549349,"content":"I'm thinking.... in 2 players mode. The second player has 1 enemy engaged, the first player has the wesfolder tactics rohan ally. When combat phase starts,  i'm thinking that you can't avoid the attack of that enemy using the ability of Wesfolder, because the attack has begun. Isn't?\n\nEdited May 25, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635140","commentId":1635140,"userName":"GrandSpleen","timestamp":1432561719,"content":"correct, he'll have to attack somebody.\n\n \n\nIf you use the Outrider's ability before the attack begins, he'll end up attacking the player with the Outrider\n\n \n\nIf you use the ability after the attack has already begun, he will engage the player with the Outrider but continue to resolve his attack against the other player"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635506","commentId":1635506,"userName":"DukeWellington","timestamp":1432594482,"content":"I understand and I think I completely agree, but does player order make a difference? So, let's say the 1st player has the outrider and the second player has an enemy engaged. After the first player resolves his attacks, can he then pull the enemy over and avoid an attack?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635670","commentId":1635670,"userName":"GrandSpleen","timestamp":1432609250,"content":"I think that would work-- player 1 finishes all his attacks, then it is player 2's turn to do enemy attackers.  Player 1 now pulls the enemy over, and that should avoid the attack..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635764","commentId":1635764,"userName":"DukeWellington","timestamp":1432621814,"content":"There you go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1635875","commentId":1635875,"userName":"Mndela","timestamp":1432635631,"content":"I think there is no action window to trigger Westfolder, just when combat step of first player finish and start the combat step of 2nd player.\n\nIt only would work, for example, if 2nd player had 2 enemies; then, while first enemy's attack has started, while, you can bring the second enemy by westfolder, but if 2nd player only has 1 enemy, Wesfolder can't use his ability without 'feinting' the attack of the enemy. The reason is: that attack has started yet\n\nEdited May 26, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1636433","commentId":1636433,"userName":"GrandSpleen","timestamp":1432660053,"content":"Guess it's a question of when player 1's turn 'ends.'  After he has finished with his final defense, it is now player 2's turn to choose an enemy and resolve its attack.  \n\n \n\nNow I won't reference the Kaybee timing document-- it's helpful, but not official and with its extra 'yellow' color scheme I think it does some guessing and makes some assumptions.\n\n \n\nAs for what we have in the core set manual, there is some conflict.  The clearest language is 'players may play event cards and take actions at the end of each step.'  Going by this, player 1 has the opportunity to use the Outrider's response after finishing his last attack.  If he does so, it's still his turn to resolve attacks, and the newly engaged enemy will now have to attack him.  There is no chance to do so during player 2's turn-- because the first thing player 2 does is to select an enemy and begin the attack.  Player 1 couldn't steal the enemy away at that point (and prevent the attack) because actions can only be taken \"at the end of each step.\"\n\n \n\nOn the other hand, the phase progression page at the end of the core set manual suggests that players may take actions 'generally,' which could be taken to mean you could say 'now it is player 2's turn to resolve attacks, but I'll use this Outrider's action before he does any.\"  \n\n \n\nThe latter interpretation is looser... so now that I've looked more closely at it, I favor the first one (Outrider can't prevent the attack), because the phase structure is more strict and therefore easier to understand when 'fringe' cases like this come up.\n\n \n\nAll that assumes that player 2 is engaged with only 1 enemy.  Of course, if player 2 has 2 or more enemies, there is no problem in preventing one of their attacks by using the Outrider (plenty of clear action windows to do so)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1637055","commentId":1637055,"userName":"Mndela","timestamp":1432679266,"content":"By the other side, Feint is also an action, and you can avoid the attack of the enemy even if you are engaged with only 1 enemy. So must be an action window before the attack starts. Isnt?\n\nEdited May 26, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1637111","commentId":1637111,"userName":"GrandSpleen","timestamp":1432681721,"content":"Well, there is an action window after shadow cards have been dealt.  \n\n \n\nBut there really could be some other example which messes up this idea, so much minutiae ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1637547","commentId":1637547,"userName":"JanB","timestamp":1432709929,"content":"@Mndela: There is an action window before an enemy is chosen as an attacker. \n\na) The action window after dealing shadow cards - GrandSpleen mentioned\n\nb) The action window after an enemy has attacked (after 6.4) - before the next enemy of the same player or the first enemy of the next player will attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1644890","commentId":1644890,"userName":"GrandSpleen","timestamp":1433196155,"content":"Relevant ruling on a parallel topic in this thread here [https://community.fantasyflightgames.com/index.php?/topic/178758-no-enemies-combat-phase-steps/] may suggest player 1 can use the Outrider to avoid an attack even if it is player 2's only engaged enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=1645520","commentId":1645520,"userName":"Mndela","timestamp":1433251406,"content":"Good to know. Thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/?do=findComment&comment=2639473","commentId":2639473,"userName":"JanB","timestamp":1487056563,"content":"Because no one asks Caleb .. i did it:\n\n> Quote\n> \n> Dear Caleb,\n> thank you for your latest answer to my questions. After playing with tactic-Aragorn and some stuff which let me engage enemies during their attacks some questions came up i hope that you can help and answer them. First .. Combat Phase .. the enemies will attack first in their \"Resolving Enemy Attacks\"-Step. In the rule it is described that the players could do action after each of the four steps. Is their an action window before an enemy attack which is not the same action window after Determine Combat Damage? There are 3 threads in your forum which discuss about this \"potenial\" action window.\n\n \n\n> Quote\n> \n> Hi Jan,\n> There is no mystery action window hidden in the combat phase. There is an action window after shadow cards are dealt, and then the first enemy attacks. Once the first enemy attacks, the only action windows are the ones that follow each step of resolving those attacks.\n> Cheers,\n> Caleb"}]}