{"url":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/","title":"Action Window between End of Combat and Readying","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1625831","commentId":1625831,"userName":"Teamjimby","timestamp":1431958346,"content":"I played a game last night where we had Watchful Eyes attached to Denethor, and the idea was suggested to use Denethor's action after the \"end of the combat phase\" but before characters ready.  Does such an action window exist?  I thought no, but everyone else said yes.  My thinking is that readying happens in the refresh phase before you can take any actions (otherwise Peace and Thought would be OP), but they suggested there is a \"phaseless\" action window between the end of combat and beginning of refresh.\n\n \n\nWatchful-Eyes.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Watchful-Eyes.png]Denethor.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Denethor.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1625880","commentId":1625880,"userName":"PocketWraith","timestamp":1431959878,"content":"You were correct. There is no such thing as a 'phaseless' action window, you are always in one of the phases. After combat you move onto refresh, raise threat, pass first player token and ready characters before any actions can be taken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1625958","commentId":1625958,"userName":"DukeWellington","timestamp":1431962182,"content":"Nobody said there was a phaseless action window. What was said is that there is generally an action window before and after each step. The question is, is there an action window after the step in which the effect of watchful eyes resolves but before the refresh phase. Denethor is different than Peace and Thought because his ability is just an action while Peace and Thought must be used in Refresh.\n\nSo, to clarify, the actual question is, is there an action window-in the same phase-after the resolution of a trigger that says \"at the end of\" that phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626009","commentId":1626009,"userName":"Teamjimby","timestamp":1431963996,"content":"Yes, that's probably better wording of the question.  My opinion is that \"end of phase\" is not itself a step and therefore doesn't have an action window following it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626096","commentId":1626096,"userName":"PocketWraith","timestamp":1431966806,"content":"Yeah, if something happens at the end of a phase, then nothing else happens after it in that phase (except for other things which also happen at the end of the phase, in which case of course first player chooses the sequence), otherwise it's not the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626112","commentId":1626112,"userName":"GrandSpleen","timestamp":1431967377,"content":"I was going to say the same thing as Teamjimby-- the end of a phase is not a \"step.\"  To say that there is an action window here because there generally is one \"before and after each step\" is too loose an interpretation, in my opinion, and unsupported by text.\n\n \n\nIf you go by the green & red chart at the end of the core set manual, you've got 'player actions' at the end of the combat phase, then a red 'no action' step at the beginning of Refresh.  To get that extra action window into that chart, you've got to insert a whole unwritten \"end of phase\" step AND a green \"action window\" (which would be what-- refresh phase?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626227","commentId":1626227,"userName":"blackhathedgehog","timestamp":1431972131,"content":">  \n> \n> Yeah, if something happens at the end of a phase, then nothing else happens after it in that phase (except for other things which also happen at the end of the phase, in which case of course first player chooses the sequence), otherwise it's not the end of the phase.\n> \n>  \n\n \n\nThat's not entirely true: you can respond to things that occur at the \"end of the phase/round\" (eg, Gandalf leaves play at the end of the round, you respond with Horn of Gondor).\n\n \n\nResponses act as an \"interrupt\" or an \"instant\", but they are still \"things that happen after the beginning-of-the-end of the phase/round\".\n\n \n\nThe true \"end of phase\" is not defined as \"nothing else happens after it in this phase, except other end-of-turn effects\". It's defined as \"the players choose to make no additional Action printed on player cards or framework actions such as attacking\". Since players have already opted-out of making actions, they can't change their mind.\n\n \n\n>  \n> \n> To say that there is an action window here because there generally is one \"before and after each step\" is too loose an interpretation, in my opinion, and unsupported by text.\n> \n>  \n\n \n\nIf you want to be truly pedantic with this (awfully) written rulebook, you can interpret it such that players don't even have an action window in the Refresh Phase. This is what it says:\n\n \n\nPhase 7: Refresh\n\n \n\nDuring the refresh phase, all exhausted cards ready, each player increases his threat by 1, and the first player passes the first player token to the next player clockwise on his left. That player becomes the new first player. Play then proceeds to the resource phase of the new round.\n\n \n\nThe implication here is that those things happen immediately after another \"during\" the refresh phase. There are two sets of verbs here that are unclear:\n\n  1. What is \"during\" the refresh phase. Is that at the player's whim? Or does it really mean \"at the start of the refresh phase\"? Or does it mean \"immediately after the start of the refresh phase?\"\n\n  2. \"Play then proceeds to the resource phase of the new round\". That directly conflicts with the \"Turn Sequence\" diagram, which indeed has a green window after passing the token, as there is a \"direct omission\" of the ability for players to play cards here, since the phase \"then\" implies an immediate succession (the same as Caleb's \"to\" ruling).\n\n \n\nWe're going to address #2 first. Clearly, the game intends players to have an action window \"sometime\" during the Refresh phase, or there wouldn't be all these player cards with Refresh actions printed on them. As noted earlier in this thread, players get actions before and after \"steps\".  Since there must be a player action \"somewhere\" in the refresh phase, one of the following must be true:\n\n  1. There is a player window immediately after the \"start of the phase/round\" (you may play PLaT here)\n\n  2. There is a player window immediately before the \"end of the phase/round\" EXCEPT in the Resource phase (\"play then proceeds...\"). (no valid window for ANY refresh actions)\n\n  3. At least one of 4 \"framework events\" must be defined as a step. You could consider all 4 as one large \"step\" similar to the Staging step. Alternatively, you could consider each one an individual step. If only 1 of the 4 \"framework events\" is defined as a step, the rulebook offers us no guidance.\n\n \n\nWhat is \"during\" the refresh phase? To occur in the refresh phase, it must occur after the start, but before the end. The literal interpretation is: All 3 of these framework events must occur during the refresh phase in order for the refresh phase to be considered complete. That's all. It doesn't even mandate that the 3 framework events occur in a specific order, or must occur one after the other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626267","commentId":1626267,"userName":"Teamjimby","timestamp":1431973877,"content":"You're thinking too hard about this.  Just follow the sequence on page 31. \n\n \n\nI believe your 3rd option would be true.  There are the 3 steps, but you can't take actions until after the 3rd step.\n\n \n\nDuring the refresh phase includes the beginning and the end.  You just can't take actions at the beginning or end.\n\nEdited May 18, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626273","commentId":1626273,"userName":"blackhathedgehog","timestamp":1431974117,"content":">  \n> \n> I think you are forgetting about page 31 in the rulebook.  It clearly shows refresh, threat increase, pass the first player marker, then player actions.\n> \n>  \n\n \n\nPage 31 conflicts with Page 22. Rule 31 is a \"reference\" and has multiple other issues in addition (eg, it misrepresents how Shadow cards actually work while making additional attacks). It also makes obvious omissions such as neglecting to include the proper name of substeps.\n\n \n\n--\n\n \n\nOne thing i do want to add to this, as a caveat, is that i understand the \"intentions\" of Caleb, and i do play it the way \"Word of God\" says i should - but there are still a plurality of inconsistencies and contradictions with the rulebook, FAQ, and Caleb's individual rulings which piss me off (don't get me started on shadow cards for immediate attacks...).\n\nEdited May 18, 2015 by blackhathedgehog"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1626838","commentId":1626838,"userName":"DukeWellington","timestamp":1431998745,"content":"I think blackhathedgehog makes a lot of points that can'take just be dismissed. I consider the pg. 31 chart part of the official rules rather than just a reference because otherwise a lot of things would be really bizarre. The rules say that \"generally\" players can take actions before and after \"steps\". There is no exhaustive list of steps, nor any clear catalog of what steps do and do not have action windows. That is why the chart is so important. It is the best we have to that. However, sometimes responses or triggers (like those that force extra attacks or immediate attacks) create additional action windows. It's very odd. Also, nobody has really responded to my other rule question (in another thread) about how questing successfully is divided into two steps. First you determine that you quest successfully, then you resolve triggers from that. THEN you calculate and physically place progress. Is there an action window between those steps? I don't know.\n\nAll that is to say that it is entirely plausible to imagine a circumstance in which there is an action window after the \"end of the phase\". For instance, if a card said, \"at the end of the combat phase this card attacks the first player\". There is no card like that, but there could be, right? If so, then you can have actions after the end of a phase, in the phase. Getting back to the original question, there is probably not one in that case, but it is not crystal clear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1627095","commentId":1627095,"userName":"Chris51261","timestamp":1432012169,"content":"The chart on page 31 is far from the best we've got. This is the one I like to refer to:\n\nhttp://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf [http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1627106","commentId":1627106,"userName":"DukeWellington","timestamp":1432013106,"content":"I am not clear on the difference between green and yellow on the chart. Anyway, according to that chart, which is not official, I would say there is an action window at 6.4 after \"end of combat\" triggers but before refresh phase. That is the rationale that Teamjimby was referring to in the original question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1627116","commentId":1627116,"userName":"Ecthelion III","timestamp":1432014018,"content":"Everything that happens after the \"end of the combat phase\" has to be in the refresh phase.\n\nThere is no action window at the beginning of the refresh phase, so the only action window after combat is the one after readying & threat raising."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177005-action-window-between-end-of-combat-and-readying/?do=findComment&comment=1627547","commentId":1627547,"userName":"Teamjimby","timestamp":1432044133,"content":"Right, it doesn't make sense to have an action window during the combat phase but after the end of the combat phase.  Otherwise by definition it wouldn't be the end of combat phase.  Then the chart shows us there are no action windows during refresh until after readying."}]}