{"url":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/","title":"Speculation: Hero selection (campaign mode) for The Land of Shadow","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630059","commentId":1630059,"userName":"ricedwlit","timestamp":1432169063,"content":"I can't help but wonder as to how they are going to manage hero selection (in campaign mode) when The Land of Shadow comes out.  At a minimum I expect that you can't use Aragorn, Saruman, or Grima in any of your decks. But will they go further and say you cannot use any hero that was used for The Treason of Saruman?  Stands to reason that they cannot be helping out Frodo while also rescuing captives, defending Helm's deep, and confronting Saruman.\n\n \nLet the speculation begin!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630104","commentId":1630104,"userName":"Authraw","timestamp":1432170464,"content":"I've been wondering this too. I can't think of a good way to reconcile the game mechanics with the story, unless they only let you use one hero for the first quest (and that's quite limiting)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630171","commentId":1630171,"userName":"PsychoRocka","timestamp":1432174444,"content":"The Heroes used to escape from the Shire and the Nazgul are the same heroes we have used to defend Helms Deep.\n\nIn reality Aragorn, Gimli and Legolas were present at Helms Deep. None of them helped the hobbits escape the Shire. Also none of these heroes were present for the destruction of Isengard, only Merry and Pippin were.\n\nBased off this I'm pretty sure that we will be able to use the same decks and heroes. \n\nIf they actually stop us from using the heroes we have used from the start of the campaign all the way up until this point I will be devastated. I don't want to use other heroes or decks I want to use the badass decks and heroes I have used for the entire campaign thus far and earned all my boons for. The whole point is to be able to recreate your own version of the events using whomever you choose and playing out certain things differently (Balrog never appears in Moria and Gandalf does not sacrifice himself for example).\n\n \n\nI think it would be pretty silly for them to do this now after not doing it between Road Darkens and Treason of Saruman. Besides anyone who wants to do this can on their own so it would be silly to make it compulsory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630177","commentId":1630177,"userName":"GrandSpleen","timestamp":1432174607,"content":"Yeah I doubt they will place any real restrictions on it.  I doubt they will even restrict you from using Saruman or Grima, that was box-specific.  I think it's going to be the most difficult to reconcile thematically, especially in a 4-player game..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630239","commentId":1630239,"userName":"ricedwlit","timestamp":1432177719,"content":"Just to toss out an observation: up until the Breaking of the Fellowship, the storyline in the books only follows Frodo's point of view.  While we are free to mix and match precisely who is with Frodo, the saga story so far has been \"those heroes who are with Frodo\". Starting with the Treason of Saruman we see now have a split focus: those heroes who are with Aragorn vs. those who go with Frodo to Mordor. Any hero who was present at the breaking of the Fellowship could have gone with Aragorn (with the exception of the Ring Bearer), and so that's the option Caleb and team gave us.  There's nothing preventing the designers from saying \"By the way, you can't have the same hero choose to follow both Aragorn and Frodo at the same time\". \n\n \n\nFor the records my speculations are\n\n * we can change heroes in The Land of Shadow without any threat penalty.\n * we won't be allowed to use Aragorn \n\n \n\nFor my part, I did chose to drop Sam from my team of heroes (and take the threat penalty) just in case they did something really restrictive (and for thematics reasons as well). \n\n \n\n[edit: fix spelling]\n\nEdited May 21, 2015 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177361-speculation-hero-selection-campaign-mode-for-the-land-of-shadow/?do=findComment&comment=1630628","commentId":1630628,"userName":"Gorthaur25","timestamp":1432207125,"content":"I have been wondering if this saga expansion is an opportunity for them to resurrect the secrecy mechanic. If you are punished for having a high starting threat you won't want to take expensive combat focused heroes you are more likely to use leading the armies of the free peoples.\n\nEdited May 21, 2015 by Gorthaur25"}]}