{"url":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/","title":"Yet another Palantir thread","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631448","commentId":1631448,"userName":"GrandSpleen","timestamp":1432241277,"content":"The neutral Palantir card [http://hallofbeorn.com/Cards/Details/Palantir-AoO] remains a controversial card.  If you're not familiar with it: it's a planning action, attach to a noble hero, exhaust the hero and name a card type.  Look at the top 3 cards of the encounter deck.  For each of the cards that matches your named type, draw 1 card.  For each that does not match, raise your threat by 2.\n\n \n\nSo it's a hybrid scry/draw engine with a big risk.  I post this thread now because there is ongoing discussion in another thread [https://community.fantasyflightgames.com/index.php?/topic/177347-magic-and-artifice/] about the Palantir and I would like for it to continue without totally derailing the other discussion.\n\n \n\nRecent comments:  \n\n \n\n> I've tried to use the palantir but it's just not very good...    While I do like the idea of a deep scry on the encounter deck,  the cost is so high it's essentially unpayable.  The whole point of the palantir is that it's supposed to be tempting.   As it stands,  it's just not.  And I'm not just talking about the threat increase either.   I'm also talking about the fact that you have to exhaust a hero to use it,  and this can only be done in the planning phase.    It's those two things together that kill this card for me.   If it was just an action and exhaust (not planning action), it might be playable.   Or you know,  not needing to exhaust your hero would be even better.  For so iconic an item to be so poor of a player card is sort of tragic,  I think we need a new Palantir.\n> \n> With that being said,   I am currently happy with the level of magic in the game.   There are some spells, some artifacts, but not too many.   I think that is about right for tolkien.  Tolkien is about how ordinary people can do extraordinary things, and sometimes it's the actions of those who are humblest of all that are the most critical.  Adding more wizardry would somewhat lessen that, I think.\n> \n>  \n\n \n \n\n> Try using it with Boromir.\n> \n>  \n> \n>  \n\n \n\n> um,  no.   Because frankly, palantir in a Boromir deck is asking to die.\n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631456","commentId":1631456,"userName":"GrandSpleen","timestamp":1432241535,"content":"Personally I love the Palantir.  It's such a niche card, and as such it only makes it into my decks if I specifically deckbuild for it (a common criticism).  But that fits with my style of play very much.  After I'm up to date playing through the most recent quests, I almost always lapse back into this pattern:  find an interesting card, build a deck specifically to support it.  See if it's viable, especially if it's obviously not a 'power card' (Small Target, Forth Eolingas!).  The Palantir is a card I've had great fun with.\n\n \n\nIt's beautiful in solo if you get it working, but it does take some setup: preferrably some repeatably readying effect on the hero (Denethor+Palantir+Steward of Gondor+Heir of Mardil is super good and a big win thematically).  Boromir is another awesome candidate, and certainly is not \"asking to die\" -- definitely have to build for threat reduction, but that is becoming more and more trivial.  Put in some low-threat heroes, add Secret Vigil, Gandalf+Sneak Attack, etc.  Great card in solo or 2-player games in my opinion, beyond that it starts to lose its shine, but the card draw in a Neutral card can be fantastic as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631459","commentId":1631459,"userName":"Gizlivadi","timestamp":1432241576,"content":"Not much I can say other than what I said in the other thread. Flavorful card, but thematically generic and not solo viable. Not for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631471","commentId":1631471,"userName":"John Constantine","timestamp":1432241893,"content":"It's a card that requires very specific build for it, that's why it's so underused and underrated. In right hands it can shine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631498","commentId":1631498,"userName":"Edvando","timestamp":1432242896,"content":"> It's a card that requires very specific build for it, that's why it's so underused and underrated. In right hands it can shine.\n\n \n\nBasically my thoughts. It is a good card that need a specialized deck. Don't work outside that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631504","commentId":1631504,"userName":"chuckles","timestamp":1432243113,"content":"I have never used it. Granted when it came out I was a solo player (one deck only). But i'm still very unlikely to use it. I don't generally like cards like this, which are so inconsistent/random whether they help or hinder you. (Or requires so many other cards to make it work that your entire deck plays very inconsistent until (or IF) you get the cards you need). - Still conceptually and thematically is a good idea... just not for my way of playing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631510","commentId":1631510,"userName":"Glowwyrm","timestamp":1432243272,"content":"Check out this deck from Tales from the Cards:\nhttps://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/ [https://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/]\n\nHe takes down Nightmare Into Ithilien with it.\nhttps://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004 [https://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004]\n\nIt shines in the right deck, and I think it's even better solo than it is in multiplayer.  And Boromir is a great target for it because he's easy to ready and you're already packing loads of threat reduction.  Fun card both in gameplay and thematically.  I love really different cards that open up new deck builds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631543","commentId":1631543,"userName":"PocketWraith","timestamp":1432245366,"content":"> Check out this deck from Tales from the Cards:\n> \n> https://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/ [https://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/]\n> \n> He takes down Nightmare Into Ithilien with it.\n> \n> https://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004 [https://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004]\n> \n> It shines in the right deck, and I think it's even better solo than it is in multiplayer.  And Boromir is a great target for it because he's easy to ready and you're already packing loads of threat reduction.  Fun card both in gameplay and thematically.  I love really different cards that open up new deck builds.\n\nYou're mistaken. He used that deck to beat Nightmare Hills of Emy Muil:\n\nhttps://talesfromthecards.wordpress.com/2015/03/27/video-palantir-vs-nightmare-hills-of-emyn-muil/ [https://talesfromthecards.wordpress.com/2015/03/27/video-palantir-vs-nightmare-hills-of-emyn-muil/]\n\nWhich is a somewhat less challenging scenario. I'd certainly be impressed to see a Palantir deck that could beat Nightmare Into Ithilien - I'm sure it's possible, and I suppose the Nightmare version has taken out Watcher in the Wood so your threat may not be as much of a huge concern..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631555","commentId":1631555,"userName":"GrandSpleen","timestamp":1432245810,"content":"In a scenario with sufficient Underground or Mountain locations, it also combines well with Every My Heart Rises on a Noble Dwarf (Gimli/Thorin/Gloin), better on Gimli or Gloin as they are less likely to be needed for questing.  And it allows you to satisfy your favorite \"What if the Dwarves had a palantir?\" fantasies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631726","commentId":1631726,"userName":"awp832","timestamp":1432255895,"content":"Palantir+Boromir is troubling because Boromir decks already probably have sneak attack, gandalf, etc, and their treat raises pretty high anyway.   Beyond that the combo you're referring to just takes too much to set up.   Probably you want 3x palantir, 3x galdalf, 2x sneak attack, 2x steward of gondor, 2-3x Heir of Mardil, 3x Secret Vigil to make this any kind of playable.  So,  that's 15-16 cards.  About 1/3 of your whole deck that you've committed to being able to play with the Palantir.  \n\n \n\nThe other main issue with Palantir in general is that getting card draw is easier in other places (Deep Knowledge for example, is going to probably let you draw more cards for less threat, and you don't have to exhaust a hero to do it).  and as for the second, more interesting part -the encounter deck scrying;   that is more or less meaningless unless you can do something about it.  There aren't a lot of great options.  The expensive Out of the Wild might be your best bet,  there is the also expensive Ithilien Lookout as well.  But other than that,  not too many options.  Even with Out of the Wild,  it's probably easier just to try to either trust your luck that you'll hit something nasty, or again, use Hannermarth, Denethor, etc. instead of Palantir.\n \n\nAs I said on the other thread,  the entire point of the Palantir is that it's supposed to be very tempting for me to use it.   It's not.   Forcing me to make an entire deck around maybe possibly being able to gain some tangible advantage of this card isn't tempting, and it doesn't do justice to the item.\n\n \nEdited May 22, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631762","commentId":1631762,"userName":"GrandSpleen","timestamp":1432258037,"content":"> the encounter deck scrying;   that is more or less meaningless unless you can do something about it.  \n\n \n\nNo way!  Knowledge is power.  Especially in solo: you can plan out exactly how you need to commit manpower, no wasted resources and maximum efficiency.  Scry of any kind will do that, but when it helps you draw cards as well, gravy!\n\n \n\nCertainly I agree that there are other cards that do the palantir's job, but variety is so important for my long-term enjoyment of the game.  Aren't you sick of Daeron's Runes yet?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631768","commentId":1631768,"userName":"awp832","timestamp":1432258970,"content":"if i played solo, i would just use Hannermarth to scry.   And no,  I still run Daeron's Runes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631845","commentId":1631845,"userName":"Gizlivadi","timestamp":1432265150,"content":"I would hardly consider Palantir comparable or a replacement for Daeron's Runes. The runes don't require a noble hero to exhaust in the first phase of the game, or almost certainly (unless you're really really lucky) raise your threat by at least 2 for potentially drawing a couple cards. If I wanted to replace Daeron's Runes I would use Deep Knowledge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631867","commentId":1631867,"userName":"Glowwyrm","timestamp":1432266155,"content":">  \n> \n> > Check out this deck from Tales from the Cards:\n> > \n> > https://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/ [https://talesfromthecards.wordpress.com/2015/03/10/deck-spotlight-galadriel-gets-a-palantir/]\n> > \n> > He takes down Nightmare Into Ithilien with it.\n> > \n> > https://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004 [https://talesfromthecards.wordpress.com/2015/04/02/video-nightmare-into-ithilien/#more-4004]\n> > \n> > It shines in the right deck, and I think it's even better solo than it is in multiplayer.  And Boromir is a great target for it because he's easy to ready and you're already packing loads of threat reduction.  Fun card both in gameplay and thematically.  I love really different cards that open up new deck builds.\n> \n> You're mistaken. He used that deck to beat Nightmare Hills of Emy Muil:\n> \n> https://talesfromthecards.wordpress.com/2015/03/27/video-palantir-vs-nightmare-hills-of-emyn-muil/ [https://talesfromthecards.wordpress.com/2015/03/27/video-palantir-vs-nightmare-hills-of-emyn-muil/]\n> \n> Which is a somewhat less challenging scenario. I'd certainly be impressed to see a Palantir deck that could beat Nightmare Into Ithilien - I'm sure it's possible, and I suppose the Nightmare version has taken out Watcher in the Wood so your threat may not be as much of a huge concern...\n> \n>  \n\nOops!  you're right, I linked to the wrong video.  The point still stands on how effective it can be in the right deck.  You have so many good threat reduction options now that you can build a viable deck around spirit shenanigans and the scrying ability.  You know how much to quest for, when enemies are coming, what all your shadows will be, etc and the card draw is a bit of a bonus.  I get that it's not for everyone, but it's definitely useable.  And, since we got a saga palantir, I wouldn't be shocked to see another version sometime."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631897","commentId":1631897,"userName":"Fingolfin Fate","timestamp":1432269705,"content":"It is not very strong yet but it may become stronger with the new scrying options, I hope. I like it thematically. Denethor with Steward and Heir is a great combo, of course, but it doesn't really need Palantír to make it better: mechanically. I used to have Shadow of the Past and Watchful Peace in the deck to make this work better. And yes, when you get it going, you can get to two-to-three cards right per round. But to get it going usually takes time. And who's doing your questing and fighting meanwhile? It is difficult. You would almost need this one deck for Palantír and another to do other stuff, but then again in 2-player games, the power of the Palantír goes slightly less (although it outshines Denethor in scrying at least).\n\nWell, I am glad some have had fun with it. I believe it. I did, up to a point. The deck from the Tales seems iffy to me but I didn't read the description. I would certainly prefer Denethor, maybe with Boromir and Imrahil but that's 30 and no Spirit. If you're lucky for Sneaky Gandalf, however, I think you can make it pass a quest or two. If the Galadhrim play on the other side of the table, you can beat them all (but that's the Galadhrim)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631937","commentId":1631937,"userName":"DukeWellington","timestamp":1432273686,"content":"That deck list from Tales from the Cards is great. I too love the Palantir. As a card draw engine, you guys just haven't played with it. It draws between 1 and 2 cards EVERY ROUND. That is not only amazing, it is flat out one of the best card draw engines in the game.\n\nAlso, scrying is inherently valuable on a ton of levels. Many times you can use Palantir to anticipate shadow cards, or future activations, which increases card draw and reduces cost.\n\nAnother underapreciated card is hero Dwalin. He is only good in orc heavy quests, obviously, so people don't like him. He can't fit into a \"one deck to rule them all\" Well, personally, I prefer cards and heroes like that. Anyway, Dwalin and Palantir go great together! Once he gets the dwaven axe and rohan warhorse your theat drops like secrecy. I built a Dwalin, Frodo, Boromir deck with Palantir that owned Seventh Level nightmare. Granted, that quest is pretty easy, but the point is it was FUN! You guys do know the point is to have fun right? Then I tried the deck against Morgul Vale (which is like ALL orcs) and it beat it! And that quest is no joke. I played some more and I admit I actually got pretty lucky, but still one of my most satisfying wins ever. Nothing you Palantir haters can say will ever take that away from me. I tried looking up my deck list to post but I couldn't find it. That was a while ago, but I will try to put it together again :-)\n\nEdited May 22, 2015 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1631952","commentId":1631952,"userName":"John Constantine","timestamp":1432274822,"content":"Also, that's just occured to me. Palantir + Valour."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632083","commentId":1632083,"userName":"Mndela","timestamp":1432289309,"content":"I have just built a new deck for solo. In fact, it is my first palantir deck, and runs pretty good: monolore --> Aragor - Bilbo - Grima\n\n \n\nI attach Palantir on Bilbo (giving to me 1 extra card each round by his own ability), Aragorn is for reset the high threat, and Gríma is for use his ability each round.\n\n \n\nAllies: a lot of ents (quickbeam, Wandering Etn, Treebeard..., Master of Lore, Gildor, Dori, Mirkwood Pioneer, Isengard Messenger -of course-, Ithilien Tracker, Hena, Dori, Warden.\n\nAttachtments: Keys of Orthanc -sure-, Ranger Bow, Ranger Spikes (you know when use by palantir scrying)... and Palantir ^^\n\nEvents: Deep Knowledge -before reseting by Aragorn, why not, and boosting wp of Messengers-, Rumour from the Earth -friend of Palantir-, Expecting Mischief -you know when use it-, Entmoot -10ent cards in deck-, Noiseless Movement -when you need some time to build the army-, Shadow of the Past -very good here for Palantir and another reasons-.\n\n \n\nThis deck has good synergies: Hena, Rumour, SahdowPast + Palantir; Master of Lore (you know which round you can exhaust him by the scrying effects) + Grima + Keys of Orthanc...are a lot of extra resources; you have also a lot of extra cards (Bilbo, Entmoot, Deep Knowledge...and Palantir)..., the relationship resources-drawings is equilibrate finally.\n\nIn few rounds you will have a lot of decent-notbad allies helping to you and making a good game.\n\n \n\nThe only bad thing: i think it is not for multiplayer (it would raise a lot the threat of the friends). Maybe if other player get Desperate Alliance, this deck could include Elrond's Message to pass to the friend the reseting-Aragorn\n\nEdited May 22, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632092","commentId":1632092,"userName":"Fingolfin Fate","timestamp":1432290084,"content":"Rohan Warhorse on Dwalin sounds like a combo one would not like to depend on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632104","commentId":1632104,"userName":"monkeyrama","timestamp":1432291308,"content":"QUOTE\n\nI attach Palantir on Bilbo (giving to me 1 extra card each round by his own ability), Aragorn is for reset the high threat, and Gríma is for use his ability each round.\n\nQUOTE\n\n \n\nAlthough, Bilbo isn't noble, and sadly nor is Lore Aragorn or Grima. in some ways that's one of the reasons I find the Palantir a problem.\n\nEdited May 22, 2015 by monkeyrama"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632125","commentId":1632125,"userName":"John Constantine","timestamp":1432292881,"content":"Which reminds me of one little thing - do you think they did right when stripped Loragorn from his nobility? There is some thematic sense, I guess, but how would hiding your identity cancel the fact your noble descent?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632132","commentId":1632132,"userName":"monkeyrama","timestamp":1432293525,"content":"Heh, that's quite a problem you've found there - is nobility something that is inherent, or needs to perceived to be acknowledged? If the latter, then Aragorn hiding it does matter (in any case, I quite liked that for some versions of Aragorn he is in a different guise than the others). It also maybe is a design feature to limit his interactions with certain cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632171","commentId":1632171,"userName":"awp832","timestamp":1432296745,"content":"> That deck list from Tales from the Cards is great. I too love the Palantir. As a card draw engine, you guys just haven't played with it. It draws between 1 and 2 cards EVERY ROUND. That is not only amazing, it is flat out one of the best card draw engines in the game.\n> \n> Another underapreciated card is hero Dwalin. He is only good in orc heavy quests, obviously, so people don't like him. He can't fit into a \"one deck to rule them all\" Well, personally, I prefer cards and heroes like that. Anyway, Dwalin and Palantir go great together! Once he gets the dwaven axe and rohan warhorse your theat drops like secrecy. \n\nAs card draw goes,  Berevor draws 2 cards per turn for an exhaust and doesn't increase your threat.  Galadriel draws 1 per turn for an exhaust and lowers your threat.   \n\nAs for Dwalin,  he can't have a Rohan Warhorse, unless I guess you have him with Nor am I a Stranger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632190","commentId":1632190,"userName":"John Constantine","timestamp":1432298002,"content":"It's not only about the card draw. The knowledge of what's coming from the encounter deck is most valuable one you can get. It reduces your risk factor to 0 because you know everything and can plan accordingly with extreme precision. And it comes with potential card draw...\n\nEdited May 22, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177538-yet-another-palantir-thread/?do=findComment&comment=1632301","commentId":1632301,"userName":"GrandSpleen","timestamp":1432302347,"content":"I think the whole point is that it's a cool card and very unique.  We all know there are other cards that do the Palantir's job more efficiently, but not with the same flair, not two jobs at once, and not as a neutral card!\n\nEdited May 22, 2015 by GrandSpleen"}]}