{"url":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/","title":"Player card hopes/predictions for the upcoming cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1634271","commentId":1634271,"userName":"PsychoRocka","timestamp":1432466779,"content":"What are your hope and/or predictions for the player cards in the upcoming cycle?\n\nWe know that we will be getting a handful of cards that support the new Noldor mechanic of discarding cards. We also know about Valour, Spirit Merry and more support for the Dunedain trait (or at least more Dunedain characters in general) and some more player side quests.\n\nWhat specifically are you hoping we get from these new cards?\n\n \n\nWith the Noldor mechanic I am hoping for a card (or two) that have useful effects from discarding a card that can be used just a few times over the course of a game and still be useful/powerful. Elven Spear looks great but needs multiple cards consistently discarded from your hand so fits perfectly with a deck fully embracing the new Noldor Mechanic, such as one running the new Erestor hero but weak. What I want are a few cards that can be run in decks that want to utilize the mechanic of discarding cards to clear your hand of extra copies of uniques or dead cards (not very useful for the current quest or even just your current situation or do not have all necessary requirements to play such as feigned voices without a silvan ally in play) but do not want to fully embrace this mechanic.\nCards of this nature would need to be well balanced or they could be too powerful but if done right I think could be pretty neat. Discarding a card as an additional cost to a fairly powerful card that doesn't cost much resources could be a good way to do this.\n\nThe new mechanic as a whole looks pretty fantastic though and it would also be cool to see discard effects that utilize player card costs in the effect.\n\nFor example a spirit noldor hero that has something like \"Action: Discard a card from your hand to give this hero +X willpower until the end of the phase where X is the discarded cards cost (limit once per turn)\". This might be a little too good but is just an example.\n\n\n \n\nValour seems really cool and its great to see some love for decks that have higher starting threat or utilize threat to gain power (Doomed, Boromir, Palantir etc). I think that we will get some really neat cards with this mechanic and I am absolutely itching to see what the tactics event \"Hold your Ground!\" does! I have mentioned before how much I love that they are not only doing the valour mechanic but also doing similar cards that have \"when your threat is X or higher\" like Veteran of Osgiliath to go with Valour. Not really hoping for anything in particular with the valour keyword but I think we will see some great things. Any ideas or predictions?\n\n \n\nSpirit Merry is awesome for the opposite side of affairs and might be the key new piece to many secrecy decks and builds. Such a fantastic hero and I hope we see a few more like him.\n\n \n\nI do hope we get a few more Dunedain cards that focus on engaging enemies and tie the trait together a little more as it is not really too fantastic for Solo play as some have noticed and is not as fleshed out as it needs to be to be as powerful as other existing strategies and traits. This is to be expected as it has only recently been introduced and has very few cards and even fewer that actually focus on engagement so I am sort of stating the obvious. Nonetheless is will be very cool to see what other Dunedain cards we get and how they combo with the existing ones.\n\nFinally and potentially one of the more exciting type of new cards we will be getting is more player side quests. The lore one is pretty fantastic and allows you to remove an upcoming nasty encounter card, re order the remaining ones that you looked at (which I think will actually be very powerful in practise) and combos with other cards like Keen as Lances or The Door is Closed. The tactics side quest I think is less fantastic. Yes it can discard multiple enemies in play, yes it can discard very nasty foes instantly and yes it even has the battle keyword so is easy to clear for combat heavy decks. I think however it will take some very good timing to be useful. For example if you already have the nasty foes you want to discard in play you need to play Delay the Enemy and clear it that turn or the next to get rid of those foes before they make more nasty attacks you are trying to avoid to begin with. If you are not able to clear it fast enough the enemies may have already done their damage or you may have mustered the attack strength to kill them anyway making the side quest useless or far less useful discarding weaker foes that came out after you played it. Then again even just taking out a few smaller foes can be useful and can give you breathing room to defeat nastier ones and avoid getting overwhelmed. If you already have the firepower to defeat enemies fairly quickly however this might not be worth the delaying of progress on the encounter quest card.\nI do think it will be a very useful card but not quite as powerful as the lore or neutral one.\nThe only way to find out however is waiting for it to come out and trying it out.\n\nThe neutral side quest we already have has already proved its power to me in the games it has appeared since including it in my decks and is absolutely amazing and allows ANY and ALL decks to run that little bit more smoothly. Being able to get whatever card you need for the current situation (healing, direct damage, cancellation, location management, a feint) or whatever card you need to complete a specific combo is just fantastic. I seriously cannot love this card more. The only downside is lack of progress on the encounter quest stage for a turn or two but for so many encounters this is inconsequential, meaningless or even downright beneficial (Helms Deep!). Only quests with time effects or side quest hate make Gather Information less useful but even then it can still be fantastic and may get you the cards you need to push through and stop future nasty time effects going off.\n\nI really hope that the leadership and spirit side quests are really creative and powerful especially as cards you can only have 1 copy of in your deck.\n \n\nWhat are your thoughts, predictions or desires? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 24, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1634364","commentId":1634364,"userName":"Olorin93","timestamp":1432477885,"content":"I'm not making a secret of being excited about the Noldor. I too hope for more content that supports the discard mechanic, and especially ways to draw more cards. As it stands now, even with Erestor, I feel that if the strategy revolves around discarding, you need more than 4 cards per turn to keep up with bonuses and abilities of other factions (like bonuses for the silvan, who are continously buffed, affect play when they return to your hand and keep heroes ready or bring cards back from your discard pile). But all this remains to be seen - I'm sure Caleb and Matt have plenty of tricks up their sleeve.\n\n \n\nSide quests are also really interesting, and so far they're thematic and well executed. I feel like this cycle is really filling in some gaps in the gameplay. And Spirit Merry is awesome - can't wait!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1634381","commentId":1634381,"userName":"PocketWraith","timestamp":1432478904,"content":"I'm hoping for the appearance of Cirdan the Shipwright and Narya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1634418","commentId":1634418,"userName":"Stokesbook","timestamp":1432482767,"content":"I think a card, or maybe even better a Noldor hero (Arwen/Cirdan), with something like \"Response: After a card enters play, search the top X cards (maybe even the whole deck?) and add all the cards with the same title to your hand\" might be really good for this type of Noldor discard mechanic, by letting you grab some copies of unique cards that are already in play as discard fodder.  \n\n \n\nNot limiting it to when the cards controller plays a card would also let people find a ditch their unique cards that another player already has in play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1634458","commentId":1634458,"userName":"Gizlivadi","timestamp":1432486404,"content":"Leadership side quest could be something like\n\n \n\nCall for Aid, cost 0, 6 quest points, Response: After this stage is defeated, search your deck for any one ally and put it into play under your control.\n\n \n\nBasically meant to grab an expensive or unique ally... Hope we get more unique leadership allies this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653174","commentId":1653174,"userName":"chuckles","timestamp":1433810489,"content":"I don't have any predictions for in the following cycle.\n\n \n\nThe Dunedain play style in interesting, will probably wait and see what some of the smarter deck builders do with them. As I don't currently have a view on how to manage lots of enemy engagements for bonuses versus getting overrun.\n\n \n\nValour is something that i'm really looking forward to playing around with... Treebeard, Gandalf and Elrond could start in you in valour... lol (could make for short games, one way or the other)\n\n \n\nThings that I would like:\n\n1) Some new mutli-sphere/resource matching options outside of songs and events; realized that the main reason why I have included Elrond in so many of my decks, is not vilya or his stats but because he can pay for any sphere's allies from the get go... (and as a defender for the Elven tribes)\n\n2) Allies for the rest of the fellowship.... wish to be able to run a viable fellowship only solo deck... And see how many of them I can get into play before completing a given quest. (Okay not so not likely with this cycle.. still dreaming of when I can)\n\n3) A little bit more card love for solo players using a single deck that miss out on the Co-Op deck synergies would be good... imagine harder to balance.\n\n4) New Heroes like: Thranduil, Gildor, Radagast... Really like Silvan and looking forward to Noldor... and would like to have some more Elven options for two handed Elven decks without including Elrond, Legolas or S'Glorfindel... who are rather overused, by me, now.  \n\n5) New hero versions of: Faramir, Glimi, Elladan & Elrohir (that could mix and match with current Elladan & Elrohir would be a cool)\n\n6) Some Noldor warriors that don't chew though cards to stay in play would be nice :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n7) A Noldor version of resource acceleration or resource discounting; perhaps, if here are enough 'play from discard' pile/'return from discard to your hand' Noldor actions/cards there could be an attachment that offers a resource or a discount off the next Noldor Ally/Card.\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653270","commentId":1653270,"userName":"PsychoRocka","timestamp":1433817589,"content":"So much of what you have listed are things I also want. In response to your points:\n1) More resource matching would be nice and I couldn't agree more re Elrond. His ability to pay for allies of any sphere is very very powerful and often his most used or most useful ability. I never use Vilya as I just don't like it and I use him primarily as a quester so his stats are not overly important to me either. His ability to pay for allies of any sphere and his boost to healing are both fantastic and often undervalued abilities. \n\n2) We do really need this to be a thing at some point so people can run decks with the entire fellowship with a little more ease or options. You actually can do this at the moment playing two handed (Grandspleen's Saga Player Decks include the entire fellowship if I remember correctly)  but it would be nice to just have a few more ally versions so that you have a little more choice as to who in the fellowship you will have as a hero and who you will use the ally version of. I for one really want an ally version of Aragorn. \n\n3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n\n4) Ever since the new Erestor hero was spoiled I am almost certain we will get a hero version of Gildor this cycle as well. Another nice alternative to Spiritfindel would be nice so hopefully Gildor is in the spirit sphere. Another offensive based Noldor hero (in any sphere) would actually be really nice as well as at the moment as far as Elvish Heroes go the only Noldor heroes with 3 attack are Elladan and Glorfindel (both versions) and neither version of Glorfindel has an offensive based ability. Compare this to the Silvans who have Legolas and Haldir (both have fantastic offensive abilities) and also Celeborn who only has 2 attack but gives all Silvan allies +1 attack the turn they enter play. I really hope that of Thranduil and Gildor one is an awesome spirit hero that helps Elvish decks in general and can be a good replacement for Spiritfindel in many decks and that the other is combat based. I use two handed Elven decks and must agree it would be nice to have more options and not necessarily having to include spiritfindel and having an alternative to Galadriel to replace him with would be even nicer. Elrond is just too goddamn good with his various abilities so to be honest I doubt there will ever be a hero that replaces him in two handed Elven decks. \n\nI actually don't run Legolas as a hero in my Elven decks and instead use the ally version. Haldir can fulfil a similar role these days. I also really want Cirdan, Anborn and Hamfast heroes  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n5) Honestly I think almost everyone wants some new versions of Elladan and Elrohir at this point! Its funny I really do too but am probably very unlikely to actually use the new versions over the current ones as they are the backbone of my decks. I could see the possibility of removing Elladan if the new version of him is good enough but never Elrohir hes just too goddamn good in his current form. I do still want new versions just as bad as anyone else. Ally or Hero would be nice but Hero would be nicer. \nFaramir we are almost guaranteed to get in the next Saga pack and new versions of Imrahil, Eomer, Eowyn and even maybe Elrond would be nice in addition to the ones you listed. \n\n6) Oh man there is a slot in my decks just waiting for a nice offensive Noldor ally. The Silvans have Rumil, Orophin, Haldir (ally), Legolas (ally), Silverlode Archers, Mirkwood Runners AND Galadhon Archers and all Noldors have is those stupid Trollshaw Scouts which are next to useless and will only be good in Erestor decks that focus on discard. \n\n7) Some resource generation/discount for Noldor would be really nice. I would personally prefer generation rather than discount and perhaps something of this sort of nature:\n\n1 cost tactics attachment.\n\n\"Attach to a Noldor Hero. After attached hero participates in an attack that destroys an enemy you may add one resource to any other hero that participated in that attack. Limit once per turn\". \n\nAlthough it can potentially generate a resource each turn you must have at least one other hero joining with the attached hero, must destroy an enemy (not just damage it) and can only put the resource on another hero not the attached one. \n\nNot the greatest design but something I thought of on the spot. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653323","commentId":1653323,"userName":"Ecthelion III","timestamp":1433821144,"content":"> 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n\nI'd have to disagree with you there. Nate designed this game to be a solo game:\n\nhttp://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653347","commentId":1653347,"userName":"chuckles","timestamp":1433823651,"content":">  \n> \n> > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> \n> I'd have to disagree with you there. Nate designed this game to be a solo game:\n> \n> http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n> \n>  \n\n \n\nI haven't gone to the link, at work,... but that is really interesting... when I first started playing there seemed to be a few murmurings about the lack of love for Co-Op/synergies ...since then till now it certainly feels, to me at least, like the game has swung the other way... Co-Op focus is probably better for the life of the game... just not quite as fun if you don't have Co-Op buddies... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653403","commentId":1653403,"userName":"PsychoRocka","timestamp":1433830152,"content":">  \n> \n> > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> \n> I'd have to disagree with you there. Nate designed this game to be a solo game:\n> \n> http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n> \n>  \n\nTrue the box says 1-4 players and the solo variant is an official one but the vast majority of player and encounter cards lean towards multiplayer and almost everyone agrees that the \"sweet spot\" for the game is two players/decks.\n\nRanged and Sentinel (except for in quests like Journey to Rhosgobel) do more or less nothing in solo play and the encounter deck is unable to chain/combo together encounter cards like it is able to in 2,3 or 4 player. I personally feel like the solo variant was mainly included just so that the game could indeed be considered a game you can play on your own but really the game works best when playing with two or more players/decks. \n\nI personally play \"solo\" myself but play two handed rather than with one deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653404","commentId":1653404,"userName":"PsychoRocka","timestamp":1433830204,"content":">  \n> \n> >  \n> > \n> > > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> > \n> > I'd have to disagree with you there. Nate designed this game to be a solo game:\n> > \n> > http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n> > \n> >  \n> \n>  \n> \n> I haven't gone to the link, at work,... but that is really interesting... when I first started playing there seemed to be a few murmurings about the lack of love for Co-Op/synergies ...since then till now it certainly feels, to me at least, like the game has swung the other way... Co-Op focus is probably better for the life of the game... just not quite as fun if you don't have Co-Op buddies... \n> \n>  \n\nunless you are happy to play two handed in which case it matters not at all =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653486","commentId":1653486,"userName":"chuckles","timestamp":1433838210,"content":"lol at the trollshaw scouts... I did manage to use them to okay effect in heirs battle quests as 2 cost 2 'quest points' :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAn Aragorn ally would be mint too... imagine he would join the growing list allies, especially with attachments, that outshine a number of heroes, such as Hobbit Gandalf & Legolas... also I hope that he gets another attachment that gives a tactics resource match too (nice to be able to collect the whole set ;P)\n\n \n\nGlidor would really cool, interesting, if they left Glidor's stats the same as to which sphere... the 3 will power totally makes sense in Spirit... the 3 defense... not so much... how about in leadership? (Because of course, Noldor heroes always match their heroes stat strengths to the sphere they are in)  \n\n \n\nI really like all the ranged attacking options that the Silvan's have... including being able to equip two different types of bows to non heroes... though not so good with there bounce back style :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nAn attachable Noldor resource generator, powered by killing things would be awesome!\n\nEdited June 9, 2015 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653504","commentId":1653504,"userName":"chuckles","timestamp":1433840433,"content":"Okay so I was thinking a bit more about what I wanted, specifically... as a replacement for S'Glorfindel... basically a 3 willpower Spirit Hero that costs 6 and has 3 hit points... they can have 0 attack and defense... not really fussed what ability they have but being a ranger or a scout would be cool - actually maybe their ability could be each other player gets -1 to their starting threat (or -1 start threat to any other players scout trait-ed heroes), its the ironic part of my brain at work - in light of my solo vs Co-Op love comments. I don't think this is likely so it certainly isn't predication! Nor do I have a character in mind... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653551","commentId":1653551,"userName":"Fingolfin Fate","timestamp":1433845233,"content":"Low threat cost hero(es) would be nice. Spirit fits the role. It has done and it still should, though I think Lore would be nice. I think 1/1/1+3 Lore hero of 6 threat cost is not a bad idea. 3/0/0+3 Spirit hero of the 6 threat cost just as well.\n\n \n\nThe upcoming Merry fits the role of a very low threat cost quester quite nicely though. By the way, where is the new pack? I know this question comes up every now and then, especially before the first pack of a new cycle, but it has been six weeks since the Wastes got on boat and yet no sign of it off it.\n\n \n\nps: I want more of the Noldor mechanic, the Erestor strategy is already very intriguing to me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653568","commentId":1653568,"userName":"PsychoRocka","timestamp":1433846766,"content":"I've been hopefully waiting for Wastes of Eriador to be updated to \"shipping now\" for a week or so now but the wait continues it seems =("},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653621","commentId":1653621,"userName":"Fingolfin Fate","timestamp":1433851245,"content":"I also always hope that whenever there's a long break between the releases, it will speed up the subsequent distribution (but those hopes ring hardly ever true). Still, Wastes out this week? Would be nice… we still have like five or six totally unspoiled cards to see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653863","commentId":1653863,"userName":"PocketWraith","timestamp":1433864613,"content":"I've seen it mentioned that for the last cycle they spoiled all six adventure packs before releasing the first, so I'm not expecting Wastes of Eriador to turn up until the sixth pack gets a spoiler article.\n\n \n\n> > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> \n> I'd have to disagree with you there. Nate designed this game to be a solo game:\n> \n> http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n\nHe originally conceived the idea for a solo LCG, but that doesn't mean he actually developed LotR as a solo game once he'd been told it should be playable co-op as well.\n\nI'm personally not so keen on the idea of getting more solo-specific cards simply because for the most part solo play is already easier than multiplayer and solo players don't need any additional help in that regard. Besides which, I suspect a little thought could probably come up with a few cards which work a bit better solo than multiplayer even though they weren't specifically designed that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653884","commentId":1653884,"userName":"Bullroarer Took","timestamp":1433865231,"content":"> I've been hopefully waiting for Wastes of Eriador to be updated to \"shipping now\" for a week or so now but the wait continues it seems =(\n\nFantasy Flight uses only slow boats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1653977","commentId":1653977,"userName":"Ecthelion III","timestamp":1433869100,"content":"> I've seen it mentioned that for the last cycle they spoiled all six adventure packs before releasing the first, so I'm not expecting Wastes of Eriador to turn up until the sixth pack gets a spoiler article.\n> \n>  \n> \n> > > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> > \n> > I'd have to disagree with you there. Nate designed this game to be a solo game:\n> > \n> > http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n> \n> He originally conceived the idea for a solo LCG, but that doesn't mean he actually developed LotR as a solo game once he'd been told it should be playable co-op as well.\n> \n> I'm personally not so keen on the idea of getting more solo-specific cards simply because for the most part solo play is already easier than multiplayer and solo players don't need any additional help in that regard. Besides which, I suspect a little thought could probably come up with a few cards which work a bit better solo than multiplayer even though they weren't specifically designed that way.\n\n \n\nI don't want cards that work any better in solo than in multiplayer, I just want cards that are actually playable solo. *cough*Dunedain*cough*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1654033","commentId":1654033,"userName":"blackhathedgehog","timestamp":1433871795,"content":">  \n> \n> > I've seen it mentioned that for the last cycle they spoiled all six adventure packs before releasing the first, so I'm not expecting Wastes of Eriador to turn up until the sixth pack gets a spoiler article.\n> > \n> >  \n> > \n> > > > 3) This is probably the only point I don't agree completely with as at its heart the game is designed for 2 or more players. A couple of cards that are better in Solo but can also be used in multiplayer with certain decks or play styles and still be effective would be nice for the solo players however and considering we have recently gotten a handful of cards that are designed specifically for multiplayer this would balance things out a little for solo players and give them some love. \n> > > \n> > > I'd have to disagree with you there. Nate designed this game to be a solo game:\n> > > \n> > > http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/ [http://cardboardoftherings.com/2015/04/01/episode-77-morgul-hoover/]\n> > \n> > He originally conceived the idea for a solo LCG, but that doesn't mean he actually developed LotR as a solo game once he'd been told it should be playable co-op as well.\n> > \n> > I'm personally not so keen on the idea of getting more solo-specific cards simply because for the most part solo play is already easier than multiplayer and solo players don't need any additional help in that regard. Besides which, I suspect a little thought could probably come up with a few cards which work a bit better solo than multiplayer even though they weren't specifically designed that way.\n> \n>  \n> \n> I don't want cards that work any better in solo than in multiplayer, I just want cards that are actually playable solo. *cough*Dunedain*cough*\n> \n>  \n\n \n\nJust because \"Word of God\" said that a game was designed for solo play doesn't mean that it is superior played solo versus multiplayer. Nor does it mean that that non-solo cards are blasphemous.\n\n \n\nGod can be wrong: what if he claimed Core Gandalf was supposed to be a coaster? Would you suddenly stop playing him?\n\n \n\nNot to mention, i find it rather hard that his true intention was for the Core Set to be played wholly one player with how difficult Escape from Dul Guldor is with only the core set cards + 1 player + randomly selecting a hero as a prisoner instead of the common \"house rule\" of choosing a prisoner."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1654550","commentId":1654550,"userName":"Ecthelion III","timestamp":1433903593,"content":"> God can be wrong: what if he claimed Core Gandalf was supposed to be a coaster? Would you suddenly stop playing him?\n\nI don't include Core Gandalf in any of my decks anymore. I'll create a new thread [https://community.fantasyflightgames.com/index.php?/topic/179857-core-gandalf-essential-or-not/] to keep this thread on track, but as for me, I don't think he's that niche.\n\n \n\nP.S. Sorry if I'm sounding \"solo supremacist\". I'm just interpreting the interview the way I interpret it. I enjoy playing multi as much as I enjoy playing solo, but since I don't have many people to play with, I play solo lots more, so I'm really disappointed if there is a whole new deck type that's impractical in solo.\n\nEdited June 10, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1654565","commentId":1654565,"userName":"PsychoRocka","timestamp":1433904559,"content":"You don't sound solo supremacist at all. You play both solo and multiplayer and enjoy both =) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1654704","commentId":1654704,"userName":"Olorin93","timestamp":1433918464,"content":"As far as elves go, I hope Matt and Caleb try to find ways to make old Noldor characters more playable. For instance, I love Rivendell Minstrel and her ability, but she rarely makes it into decks as I find her a bit overpriced when I can get 2WP and more health for fewer resources elsewhere.\n\n \n\nedit: Master of the Forge is another good one - I would love to play him for the theme, and it can be really useful to fetch attachments from your deck, but I often find myself in situations where I simply need willpower or combat capabilities, and he doesn't. Compare that to Galadhrim Minstrel, who has very similar stats and ability but gains +1WP from Celeborn and doesn't exhaust to quest with Galadriel. I'm also bothered by 1-health allies that are easily killed by Archery or treachery effects. A hero or some kind of attachments for beefing up Noldor allies in general or making them more afforable would be great. We already have O Lorien and Heir of Valandil, so I hope they keep going with something similar. Maybe, as both others and I have said earlier, make cost reduction part of the discard mechanic.\n\n \n\nIt would also be really cool to see a hero or ally that interacts with the side quest mechanic, maybe both player and encounter kinds.\n\nEdited June 10, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1655636","commentId":1655636,"userName":"Ecthelion III","timestamp":1433972195,"content":"> It would also be really cool to see a hero or ally that interacts with the side quest mechanic, maybe both player and encounter kinds.\n\nI'm hoping the Dunedain hero from Battle of Carn Dum has a side-quest related effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1655662","commentId":1655662,"userName":"Olorin93","timestamp":1433973230,"content":"It would be interesting to even see a hero with \"X\" stats, similar to Iarion. Not sure they'll go down that route, though. This cycle is thrilling - there is so much we still don't know, particularly about heroes and allies. But I only beat Intruders in Chetwood yesterday, so I've still got work to do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1655728","commentId":1655728,"userName":"Bullroarer Took","timestamp":1433976531,"content":">  \n> \n> > It would also be really cool to see a hero or ally that interacts with the side quest mechanic, maybe both player and encounter kinds.\n> \n> I'm hoping the Dunedain hero from Battle of Carn Dum has a side-quest related effect.\n> \n>  \n\nI do not because I think that we won't see many more side quests after we leave the north."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1655997","commentId":1655997,"userName":"Fingolfin Fate","timestamp":1433997822,"content":"> As far as elves go, I hope Matt and Caleb try to find ways to make old Noldor characters more playable. For instance, I love Rivendell Minstrel and her ability, but she rarely makes it into decks as I find her a bit overpriced when I can get 2WP and more health for fewer resources elsewhere.\n> \n>  \n> \n> edit: Master of the Forge is another good one - I would love to play him for the theme, and it can be really useful to fetch attachments from your deck, but I often find myself in situations where I simply need willpower or combat capabilities, and he doesn't. Compare that to Galadhrim Minstrel, who has very similar stats and ability but gains +1WP from Celeborn and doesn't exhaust to quest with Galadriel. I'm also bothered by 1-health allies that are easily killed by Archery or treachery effects. A hero or some kind of attachments for beefing up Noldor allies in general or making them more afforable would be great. We already have O Lorien and Heir of Valandil, so I hope they keep going with something similar. Maybe, as both others and I have said earlier, make cost reduction part of the discard mechanic.\n> \n>  \n> \n> It would also be really cool to see a hero or ally that interacts with the side quest mechanic, maybe both player and encounter kinds.\n\nHave you tried to proxy Erestor. I made this deck with him, Tactics Boromir and Spirit Glorfindel, and it is one of the most enjoyable decks I have ever made -- already. And I am sure it will get a ton better with more cards like Protector of Lórien, Elven Spear or Galadhrim Weaver."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1656133","commentId":1656133,"userName":"Olorin93","timestamp":1434010381,"content":"i haven't proxied yet, no. I did proxy Galadriel and her attachments soon after she was spoiled last year, but now I like to savour the anticipation as it were."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1656264","commentId":1656264,"userName":"Fingolfin Fate","timestamp":1434025965,"content":"I see your point. I sort of wish I had that willpower, haha. But my point (or guess) remains. I feel the Noldor \"discard\" mechanic will be very powerful. I wonder if the Spirit card that is only playable from the discard pile is the Lay of Lúthien (the art of which was spoiled during the Wastes of Eriador article)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1656802","commentId":1656802,"userName":"Olorin93","timestamp":1434048895,"content":"I spoke too soon... caved in and put an Erestor proxy in an Elrond/Spirfindel deck today. The draw and discard mechanic is really powerful. I got Protector of Lorien in my opening hand and put it on Elrond, played Arwen and then Asfaloth soon afterwards. That was pretty much all I had time for, as this deck ploughed through Passage Through Mirkwood with ease. Sure it's the easiest scenario out there, but it's still good for testing new decks on a basic level. I finished in 5 rounds with final threat 21, no damage on any heroes or allies. I dealt with three enemies on the way, but got Beorn's Path and didn't have to face the Spawn. I'll give a more difficult scenario a go tomorrow, perhaps. I hope for some mechanic that allows us to play cards from the discard pile (hold on, haven't they even confirmed this?) so all those discarded cards see some more use. Didn't include Will of the West, but I see its use in a deck like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1657243","commentId":1657243,"userName":"Fingolfin Fate","timestamp":1434077115,"content":"Yes, they did confirm it. I was referring to it as Lay of Lúthien but when I checked the preview article again (for Wastes of Eriador) I saw that it is in fact called Tale of Tinúviel. It doesn't even say this will be a card that can only be played from the discard pile but it is my guess. And there may be more than one.\n\n \n\nThe line-up of Elrond, Erestor, Glorfindel is a thematic win. I will be interested to hear how it does. Tactics Boromir and Spirit Glorfindel are very good with Erestor. I especially like to play Protector of Lórien on Boromir and Elven Spear on Glorfindel on round 1. With 10 cards in hand, it happens more often than not. And since you mentioned Master of the Forge, he is perfect in the deck with like 26 attachments out of the fifty cards. I can even play him round 1 with Miruvor. And once he is in play he almost certainly fetches you an attachment per round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1657703","commentId":1657703,"userName":"Gizlivadi","timestamp":1434121831,"content":"Is anyone else starving for a new article today?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1660135","commentId":1660135,"userName":"Olorin93","timestamp":1434372377,"content":"Do you think a new one is coming? It wasn't too long ago we got the Carn Dûm article - but I can't wait for The Wastes of Eriador. It's been \"on the boat\" for quite some time now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1660918","commentId":1660918,"userName":"PsychoRocka","timestamp":1434411080,"content":"About two months now it has been on the boat... Really hoping we get it soon and the cycle kicks off. Getting antsy for new content."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1661017","commentId":1661017,"userName":"Gizlivadi","timestamp":1434417995,"content":"Keeping up with FFG's weird tradition we'll probably see our final pack announcement before we get the first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/177851-player-card-hopespredictions-for-the-upcoming-cycle/?do=findComment&comment=1661244","commentId":1661244,"userName":"Fingolfin Fate","timestamp":1434435822,"content":"This is indeed the famine time of the LotR lcg. Each year the same for the past five. The first pack of the cycle is outrageously delayed. They only manage one cycle a year (for which my wallet is grateful) even though it is just a (monthly) pack of six plus a deluxe. Also, the first adventure keeps pushing further into the year. Two years ago I remember it was early May -- even after the delay, last year mid June, this year who knows..."}]}