{"url":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/","title":"No enemies - combat phase steps?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1641920","commentId":1641920,"userName":"Chris51261","timestamp":1432964827,"content":"So I know I've been asking a bunch of weird questions lately, but hopefully I can get some insight on this one. Do the steps of the combat phase still happen in the same order if there are no enemies engaged with a player? I only ask because I'm playing through some of the Dwarrowdelf quests where you have the Cave Torch, and I'm wondering if I can activate it in the action window that occurs after enemies have all attacked, but before my characters have. Any thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642026","commentId":1642026,"userName":"Teamjimby","timestamp":1432983101,"content":"I don't see why you wouldn't be able to do that.  There would certainly be an action window after engagement checks but before combat, so I suspect you could accomplish the same goal by using that action window if you aren't 100% sure about the combat phase steps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642338","commentId":1642338,"userName":"Chris51261","timestamp":1433014172,"content":"Yeah, I figured the combat phase itself still happened, I was wondering if I had to give the enemies an opportunity to attack. Specifically Goblin Follower, who engages the last player. I guess my real question is: can I arbitrarily pick what part of the combat phase I'm activating my Cave Torch in?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642356","commentId":1642356,"userName":"GrandSpleen","timestamp":1433015885,"content":"I think this question overlaps heavily with the discussion that went on the other day [https://community.fantasyflightgames.com/index.php?/topic/176998-is-there-any-action-windows-between-declaring-attackers-and-resolving-an-attack/] about stealing away player 2's enemies after player 1 resolves attacks, but before player 2 resolves any of his.\n\n \n\nThe question is: in what action window are you exhausting the Cave Torch?  \n\n \n\nNormally you have the following action windows:\n\n \n\n1) after shadow cards are dealt, before resolving any attacks (here, 0 cards will be dealt, but the action window still presents itself)\n\n2) After each step of resolving each individual enemy's attack (these action windows will not exist if there are no enemies attacking)\n\n3) After each step of resolving each player's attacks (again, won't exist if there are no enemies attacking)\n\n4) Just before end of combat phase, there is an action window (this will still occur)\n\n \n\nIn the other thread that I linked, we were talking about whether you had an action window after (2) for player 1, but before (2) for player 2.  It seemed the consensus was no, you don't, or at least that's the direction I was leaning.  \n\n \n\nThis question seems to be parallel... except the question is: do you have an action window between (2) and (3).  There were no attacks being resolved, so the normal action windows that accompany resolution of an attack didn't happen.  Maybe the answer is no?  You could use the Torch before attacks, but then the Goblin Follower would have to attack.  You could use it at the end of the combat phase, but then you can't attack back.  But if there are no enemies, there doesn't seem to be a window in which you can use the Torch between 'defending' and 'attacking.'\n\nEdited May 30, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642386","commentId":1642386,"userName":"Chris51261","timestamp":1433017947,"content":"What about Westfold Outrider then? I remember in the article he was spoiled in it talking about \"using him after the enemies have attacked to engage an enemy and kill it with Eomer\" or something. Does that mean enemies had to have attacked for you to engage a completely different enemy? I guess I can see what you're saying though, those windows would only be available if enemies were there. I dunno. I sent a question to Caleb, we shall see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642387","commentId":1642387,"userName":"Chris51261","timestamp":1433018119,"content":"Also, I dunno if this chart is accepted as 100% correct, but looking here: http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf [http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf]\n\nwouldn't step 6.2.1.5 still be there regardless of enemies being there or not?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642390","commentId":1642390,"userName":"DukeWellington","timestamp":1433018484,"content":"It seems, even from our other discussion, that if you use an action window after 2, that the enemy would still attack because it is still technically during the enemy attack step. This may seem unclear unless you think about a 2 player game. Once player 1 resolves all enemy attacks there is an action window before it passes to player 2. If the Cave Torch is used right then and the enemy is somehow engaged by player 1, the enemy would still make an attack before play passes to player 2.\n\nIt seems pretty difficult, with less than 3 enemies engaged between two players, to pull off a Feint effect through timing manipulation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642398","commentId":1642398,"userName":"Teamjimby","timestamp":1433019415,"content":"> Yeah, I figured the combat phase itself still happened, I was wondering if I had to give the enemies an opportunity to attack. Specifically Goblin Follower, who engages the last player. I guess my real question is: can I arbitrarily pick what part of the combat phase I'm activating my Cave Torch in?\n\nGoblin Follower only engages the last player when revealed.  Cave torch adds them to the staging area without revealing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642403","commentId":1642403,"userName":"Chris51261","timestamp":1433019921,"content":"Lol... so it does.  :wacko: [//content.invisioncic.com/Mfantflight/emoticons/default_wacko.png] I guess my question could still apply to the Westfold Outrider situation. Can you discard him to engage an enemy during combat \"after enemy attacks,\" even if no enemies attacked that phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642494","commentId":1642494,"userName":"GrandSpleen","timestamp":1433026504,"content":"I dug up that article [https://www.fantasyflightgames.com/en/news/2013/11/8/ride-headlong-against-the-enemy/] and it says this about the Westfold Outrider:\n\n \n\n\"At first glance, players might wonder: why would I want to discard an ally to engage an enemy? But when you consider that you can trigger this action during the combat phase, after enemies have attacked, then it becomes a useful way to trigger Éomer’s attack boost and destroy that enemy. Or, you can trigger the Westfold Outrider’s ability during the quest phase to engage an enemy and remove its threat strength from the staging area, making it easier to quest successfully and place progress on the quest\"\n\n \n\nNot sure, honestly-- Caleb could have been thinking about a situation in which you are engaged with an enemy.  In that case, you can use the Outrider after you've declared an attack against another enemy (so you're clearly past the 'enemies attack' portion of the combat phase), and then you get around the additional enemy's attack without any trouble.\n\n \n\nBut still not sure: is there a 'general' action window between 'deal shadow cards' and 'end of combat phase?'  Or are any action windows granted as a result of the attack/defense resolution process?\n\n \n\nI hate this timing stuff..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1642537","commentId":1642537,"userName":"Chris51261","timestamp":1433031737,"content":"That last sentence pretty much sums it up buddy. Lol. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1644804","commentId":1644804,"userName":"Chris51261","timestamp":1433191352,"content":"Rules Question:\n> Hi! So I was playing Nightmare Foundations of Stone tonight and was wondering if an action I took was legal or not. If you aren't engaged with any enemies, does the combat phase still progress through the normal steps and actions windows that it would if you were engaged with enemies? My thought was: I would activate Cave Torch during the combat phase in the action window after all enemies have attacked. If an enemy popped up, Haldir would be able to kill it. Was this legal? Does the combat phase progress normally even without enemies attacking? Thank you, hope to hear your thoughts!\n\n \n\nHi Chris,\n\nClever solution. If there are no enemies in play, there is still a combat phase. As such, you could declare the “Resolving Enemy Attacks” portion complete after no enemies attack, and then use the Cave Torch during the “Attacking Enemies” portion of the phase.\nWell done!\nCheers,\nCaleb\n\n \n\nIncase anyone was left wondering what the official ruling on the combat phase action window thing was. =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1644884","commentId":1644884,"userName":"GrandSpleen","timestamp":1433196028,"content":"So I guess we're just overthinking all this combat phase action window stuff.  Since we have this ruling here, there seems to be no reason why we should be able to use the Westfold Outrider to take an engaged enemy away from player 2 and avoid that attack, even if it is the only enemy he is engaged with.\n\n \n\nIt's a green bar on the chart at the end of the book, so.. anything goes?\n\nEdited June 1, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1645163","commentId":1645163,"userName":"Chris51261","timestamp":1433217674,"content":"The chart in the back of the book always is a source of confusion for me. I think if an enemy engages you during the \"resolve enemy attacks\" step, doesn't it get an attack? It's like Murzag's effect I think. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1646073","commentId":1646073,"userName":"Ecthelion III","timestamp":1433272762,"content":"> The chart in the back of the book always is a source of confusion for me. I think if an enemy engages you during the \"resolve enemy attacks\" step, doesn't it get an attack? It's like Murzag's effect I think. \n\n \n\nWith Murzag, the extra encounter card comes out immediately after Murzag attacks, so you can't declare the 'resolve enemy attacks' step complete until after his Forced effect completely resolves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1646243","commentId":1646243,"userName":"GrandSpleen","timestamp":1433279841,"content":"And if you get an enemy as a result of a shadow effect, you have not yet finished resolving the current attack, so the 'enemy attacks' part is not yet done... the new enemy will get an attack as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1646597","commentId":1646597,"userName":"Chris51261","timestamp":1433304171,"content":"But what about when an enemy engages the next player and makes an attack? The fact that the first player already did his \"resolve attacks step\" doesn't mean that doesn't occur. Wouldn't this be a similar situation? An enemy with an attack to make engages a new player? Either way, I sent a question to Caleb. I gotta figure out this two player stuff... lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1647551","commentId":1647551,"userName":"Chris51261","timestamp":1433366551,"content":"If the first player finishes defending against the enemies engaged with him and then uses Westfold Outrider to engage one of the second players enemies, that enemy still attacks, correct? The fact that it's still the \"resolve enemy attacks\" step takes precedence over the fact that the first player was done with his portion of the step?\n\n \n\nHi Chris,\n\nWestfold Outrider’s ability can be used to prevent an enemy from attacking if used correctly. After the first player resolves each of his engaged enemy’s attacks and play passes to the next player, the first player can then discard a Westfold Outrider to engage an enemy engaged with another player. That enemy will not attack because the first player has already resolved his enemies attacks and the game has advanced to the next player’s attacks.\nCheers,\nCaleb\n\n \n\nDid not expect that one! Westfold Outrider just got a whole lot better for me, lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1647948","commentId":1647948,"userName":"JanB","timestamp":1433403977,"content":"I think you should ask Caleb again because it's not clear in which action window the first player discards the outrider here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1648172","commentId":1648172,"userName":"Chris51261","timestamp":1433426732,"content":"He explained exactly what he meant... elaborate on what you mean?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1648363","commentId":1648363,"userName":"DukeWellington","timestamp":1433434118,"content":"It's not clear because he says it is after play passes to the second player. There is no action window until after the enemy has started it's attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1648382","commentId":1648382,"userName":"Teamjimby","timestamp":1433435072,"content":"Based on the chart on page 31, there is an action window after anything highlighted in green.  First player resolving attacks is a separate step from the next player resolving attacks.  So I believe there is an action window after the first player's attacks but before the next player starts their attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1648392","commentId":1648392,"userName":"Chris51261","timestamp":1433435475,"content":"Either way, the question wasn't \"is there an action window there,\" it's if that occurs does the enemy make an attack. For simplicity sake, say player 2 has two enemies engaged with him, and player 1 uses Westfold Outrider to engage one while the other makes its attack. It's like another feint, I can hardly believe it. And yeah, you have an action window before all the attacks start. Take your pick looking at the chart you trust and it always shows that as a green \"do whatever\" bar before choosing an enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1649893","commentId":1649893,"userName":"Mndela","timestamp":1433529807,"content":"Feint is similar. You can trigger this action before enemy attacks, but if the attack has started you can't play feint. So there must be an action window before first enemy attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/178758-no-enemies-combat-phase-steps/?do=findComment&comment=1649953","commentId":1649953,"userName":"DukeWellington","timestamp":1433533688,"content":"After shadow cards..."}]}