{"url":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/","title":"Bored of my top tier deck, cannot win with any other","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648659","commentId":1648659,"userName":"Qaanaaq","timestamp":1433448885,"content":"So, as in the title, i seem to have a little problem. \n\nWhatever the quest seems to throw at me, I kind of can not move much unless I can quest a ton. \n\nI can trap everything in the  staing area with my ranger trap deck, I can churn allys with my Boromir, Imrahil, Beregond Gondor deck, I can get things going with my dwarf deck,\n\nbut unless I use my Eowyn Glorfindel (Spi) Dúnhere deck, I can rarely push it through. \n\n \n\nProblem is I am not too fascinated by all these staple cards and core set heros. I would love to not have to use them. I only have one core set, and  find it a terrible idea to have even more of these staple core set cards*. I would love to not beat the Isengard quests unless I use some new cards. Not the other way around. \n\nI have eveything up until Voice of Isengard, and although I am interested in the quests, I feel a bit of a \"deck fatigue\" And yet each time I try something new, I am stuck.\n\n \n\nSo, lets assume, that the problem is in me. What could I be doing wrong? \n\nThe quests sound so fascinating, great story, but why always Eowyn? Is it my deckbuilding thats faulty?\n\n \n\n \n\n \n\n*on a tangent with core sets - i think i would use the house rule: core set singles - one per deck, core set doubes two per deck.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648662","commentId":1648662,"userName":"Ecthelion III","timestamp":1433448975,"content":"What's your card pool? I could provide some suggestions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648728","commentId":1648728,"userName":"Teamjimby","timestamp":1433452276,"content":"I find this very interesting because I never thought of any deck with Dunhere as a top tier deck.  I thought you were going to say you are bored with Gandalf, Elrond, and Glorfindel.  I'm assuming you are playing solo, so if you play multiplayer my advice may not be as applicable. \n\n \n\nRanger trap decks just aren't there yet.  I would consider that a pretty low tier deck.  Boromir, Imrahil, and Beregond can be a fine deck in multiplayer, but the sentinel and global boosts aren't very useful solo and the deck lacks willpower.\n\n \n\nSo, I think the problem here is just that you haven't discovered the top tier decks yet.  There are a ton of suggestions on the forums here.  If you don't want to use other people's decks, you just need to experiment more.  Elrond is a really powerful hero and there are a lot of strong decks built around Aragorn.  Most of my strong solo decks revolve around Glorfindel, Pippin, and another low threat hero that lets me take advantage of secrecy.  There are a ton of options out there.  Don't let yourself get bored with the game because you haven't found good decks yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648756","commentId":1648756,"userName":"Qaanaaq","timestamp":1433453249,"content":"Ok, maybe I should put it another way. I am still unable to find a deck which would have a touch of theme, and not use spirit whilst also being effective.  I am somewhat frustrated by not being able to play without spirit cards. And Dunhere top tier, surely not, but, my Merry, Glorfindel Dunhere deck smoothdestroyed the Morgul Vale on my first try, which is THE kind of disappointing which I am talking about.\n\n \n\n \n\ne: but I just realised that I contradict myself, since, this win was enforced by precisely the new card Spear of the Mark :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\nEdited June 4, 2015 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648769","commentId":1648769,"userName":"chuckles","timestamp":1433453796,"content":"Why not trying out some of the decks in the \"Strategy and deck-building\" area? there are some very good decks to be found... and or check out some of the decks in numerous blogs... \n\n \n\nI often find reading the post/blog/play though inspires me to try different decks... or even revisit old ones. For example, my current two handed Silvan decks seem a little stale... so after reading a number of posts by new players i'm tempted to revisit the Mirkwood quests solo, using just core and Mirkwood cycle cards.\n\n \n\n(should have read new post before posting.... ignore second half of this post!) \n\nEdited June 4, 2015 by chuckles"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648790","commentId":1648790,"userName":"Teamjimby","timestamp":1433454565,"content":"Don't put too much weight on beating Morgul Vale with a Dunhere deck.  That deck is perfectly suited for Morgul Vale.  I had a similar experience with a secrecy deck that utilized ranger bows.\n\n \n\nSo if I understand correctly, you are looking for a top tier deck that is thematic and doesn't use spirit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648865","commentId":1648865,"userName":"PocketWraith","timestamp":1433458504,"content":"What I find strangest about the initial post is that you say you feel you have to stick to your top tier deck, you can't do as well with your other decks, and that includes Dwarves. If a Dwarf deck can't win a majority of scenarios, you probably went wrong somewhere in building it. Dwarves are just that good.\n\nNot being able to win without Spirit is more understandable. Spirit gives easy access to lots of willpower, and cancellation effects. It's definitely possible to do without though.\n\nThat being said, if you're playing solo your deck-building has to reflect that - for a deck to be solo viable generally it needs to be able to do everything competently so it doesn't necessarily work so well if you're really trying to follow a theme (like rangers/traps or Gondor) because that specific theme may well make you good at one or two things, but not all things. They'd probably work better in multiplayer. For solo play, some themes will work, but others will struggle.\n\n \n\nAny particular themes you'd want to base decks around? So we can try and come up with suggestions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648873","commentId":1648873,"userName":"Gizlivadi","timestamp":1433458931,"content":"So you can't win Cair Andros with a leadership tactics ally mustering deck but you can with mono-spirit? What is your secret?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648934","commentId":1648934,"userName":"Glowwyrm","timestamp":1433463487,"content":"I understand boredom with the all-powerful blue sphere and the staples of the game.  That's one of the reasons that two-handed appeals to me, because I can diversify my decks a lot more.  That being said, there's lots of good decks to be built that are thematic and can beat hard scenarios without relying on Spirit and the staples.\n\n1. Hobbits!  Merry, Sam and Pippin are a great thematic combo, easy to build different decks around them, and you can win without Spirit. \n2. Grima-Loragorn plus another hero is a little less thematic, but you can build strong solo decks around them and the doomed mechanic. \n3. Leadership Gondor decks (Leadermir, Aragorn, Denethor) are good too when you can muster and buff a lot of allies quickly.  If you need a lot of willpower at the start (like with the VoI quests) this is not the best deck.\n4. Thorin-Ori-Bombur (or Balin) really strong deck without Spirit\n5. Celeborn-Haldir-Legolas: not quite as good as the Silvan deck with Galadriel, but you can still win with it.\n6. Loragorn (any two heroes)-Hobbit Gandalf deck: a deck that just gets better and better with the toys for Gandalf\n\nAnd Tales from the Cards and Hall of Beorn have lots of great deck ideas that you can use as a basis for your decks.  Hope this helps!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648939","commentId":1648939,"userName":"Gizlivadi","timestamp":1433463802,"content":"> I understand boredom with the all-powerful blue sphere and the staples of the game.  That's one of the reasons that two-handed appeals to me, because I can diversify my decks a lot more.  That being said, there's lots of good decks to be built that are thematic and can beat hard scenarios without relying on Spirit and the staples.\n> \n> 1. Hobbits!  Merry, Sam and Pippin are a great thematic combo, easy to build different decks around them, and you can win without Spirit. \n> \n> 2. Grima-Loragorn plus another hero is a little less thematic, but you can build strong solo decks around them and the doomed mechanic. \n> \n> 3. Leadership Gondor decks (Leadermir, Aragorn, Denethor) are good too when you can muster and buff a lot of allies quickly.  If you need a lot of willpower at the start (like with the VoI quests) this is not the best deck.\n> \n> 4. Thorin-Ori-Bombur (or Balin) really strong deck without Spirit\n> \n> 5. Celeborn-Haldir-Legolas: not quite as good as the Silvan deck with Galadriel, but you can still win with it.\n> \n> 6. Loragorn (any two heroes)-Hobbit Gandalf deck: a deck that just gets better and better with the toys for Gandalf\n> \n> And Tales from the Cards and Hall of Beorn have lots of great deck ideas that you can use as a basis for your decks.  Hope this helps!\n\n \n\n \n\nGood suggestions, but for Leadership Gondor decks I'd recommend going mono-leadership. That's one of my favorite decks, it's highly thematic and also really really powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1648944","commentId":1648944,"userName":"Glowwyrm","timestamp":1433464097,"content":">  \n> \n> > I understand boredom with the all-powerful blue sphere and the staples of the game.  That's one of the reasons that two-handed appeals to me, because I can diversify my decks a lot more.  That being said, there's lots of good decks to be built that are thematic and can beat hard scenarios without relying on Spirit and the staples.\n> > \n> > 1. Hobbits!  Merry, Sam and Pippin are a great thematic combo, easy to build different decks around them, and you can win without Spirit. \n> > \n> > 2. Grima-Loragorn plus another hero is a little less thematic, but you can build strong solo decks around them and the doomed mechanic. \n> > \n> > 3. Leadership Gondor decks (Leadermir, Aragorn, Denethor) are good too when you can muster and buff a lot of allies quickly.  If you need a lot of willpower at the start (like with the VoI quests) this is not the best deck.\n> > \n> > 4. Thorin-Ori-Bombur (or Balin) really strong deck without Spirit\n> > \n> > 5. Celeborn-Haldir-Legolas: not quite as good as the Silvan deck with Galadriel, but you can still win with it.\n> > \n> > 6. Loragorn (any two heroes)-Hobbit Gandalf deck: a deck that just gets better and better with the toys for Gandalf\n> > \n> > And Tales from the Cards and Hall of Beorn have lots of great deck ideas that you can use as a basis for your decks.  Hope this helps!\n> \n>  \n> \n>  \n> \n> Good suggestions, but for Leadership Gondor decks I'd recommend going mono-leadership. That's one of my favorite decks, it's highly thematic and also really really powerful.\n> \n>  \n\nAgreed.  Mono-leadership Gondor is really good, but when I'm playing thematically and solo, it's hard to pass on Denethor.\n\nAlso, once you purchase Galadriel, you'll have some very different ways of using Spirit without relying on the old staples of Glorfindel and Eowyn.  She's really good, really powerful, and really different to play with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649022","commentId":1649022,"userName":"Gizlivadi","timestamp":1433469898,"content":"The thing about mono leadership is that is gives you access to Strength of Arms, White Tower Watchman, Tome, and other cards that really speed up your game inmensely. With cards like Sword that was Broken, Visionary Leadership, Galadriel, plus the ally mustering cards, that deck becomes a questing and combat powerhouse very early on. I like not caring about resource matches or even resource scarcity, and when you can play Steward, Galadriel and STWB turn 1 it's just amazing. Now, does the deck work for all scenarios? Hell no, especially not against ally hate, and it sure isn't better than outlands, but man is it enjoyable to try to build your huge army, even if you fail. And even in quests such as Shadow of the Past where hide tests become impossible to pass in the second stage, I don't even care, I have so many allies that I can take 2 nazgul attacks with little problem. The deck is that cool.\n\n \n\nThe good thing of adding lore is mainly card draw, which leadership normally lacks (that's why I use Balin and KUTM), but if I went lore-leadership, I'd go all the way and play Steward on Denethor and a bunch of rangers. That would be pretty fun, not to mention thematic.\n\nEdited June 5, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649074","commentId":1649074,"userName":"Seastan","timestamp":1433473755,"content":"> The thing about mono leadership is that is gives you access to Strength of Arms, White Tower Watchman, Tome, and other cards that really speed up your game inmensely. With cards like Sword that was Broken, Visionary Leadership, Galadriel, plus the ally mustering cards, that deck becomes a questing and combat powerhouse very early on. I like not caring about resource matches or even resource scarcity, and when you can play Steward, Galadriel and STWB turn 1 it's just amazing. Now, does the deck work for all scenarios? Hell no, especially not against ally hate, and it sure isn't better than outlands, but man is it enjoyable to try to build your huge army, even if you fail. And even in quests such as Shadow of the Past where hide tests become impossible to pass in the second stage, I don't even care, I have so many allies that I can take 2 nazgul attacks with little problem. The deck is that cool.\n> \n>  \n> \n> The good thing of adding lore is mainly card draw, which leadership normally lacks (that's why I use Balin and KUTM), but if I went lore-leadership, I'd go all the way and play Steward on Denethor and a bunch of rangers. That would be pretty fun, not to mention thematic.\n\n \n\nI want to second everything here. I too play a mono-leadership deck with Aragorn/Boromir/Balin with King Under the Mountain for card draw. The one thing that I want to add is Faramir. Your army of Gondor allies are already all at +2 willpower (Sword that was Broken and Visionary Leadership), with Faramir they all jump up to +3. Play Ever Vigilant for 1 resource, use Faramir again, and now they're all at +4. Use your Tome of Atanatar to play it again and now they're all at +5. Play Strength of Arms for 2 resources and ready all your allies, and use Faramir again. Well, now you just quested for 90 with a full board of allies ready for combat, and the other players are wondering why you even brought them along.\n\n \n\nAnyone who still believes that Spirit is the king of willpower hasn't played a deck like this.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649084","commentId":1649084,"userName":"Glaurung","timestamp":1433474789,"content":"All that tricks what you talking about mostly work in Normal mode. Try Nightmare where is real game begin! And of course solo or cooo is also big different. Add more players and things become nuch more dangerous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649099","commentId":1649099,"userName":"Gizlivadi","timestamp":1433476122,"content":"Solo normal mode is enough for me, thanks. Although I really like nightmare cards for the theme and art."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649142","commentId":1649142,"userName":"Glowwyrm","timestamp":1433479710,"content":"Totally agree about the mono-leadership Gondor decks.  Lots of fun to play and very powerful.  Tome of Atanatar is one of the most underrated cards in the game.  You can do ridiculous things with that card in a mono-Leadership deck.  Just so the thread doesn't get too derailed, I was trying to suggest some thematic hero lineups that would be successful in standard mode, per the original poster's request.  And completely agree with Glaurung about nightmare mode.  The challenge, theme and mechanics of the nightmare quests are the best things this game has to offer.\n\nBack to the topic:\nImrahil, Eomer, Eowyn (still includes Eowyn but thematic and fun)\nLegolas, Gimli and Aragorn (just kidding)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649240","commentId":1649240,"userName":"Flrbb","timestamp":1433490813,"content":"Imho, when playing solo (somehow I assume Qaanaaq does this) you'll need some initial questing power to get not stuck early on. So spirit is the first way to go. At first glance I totaly understand Qaanaaq's problems. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Anyhow, when playing solo your deck will need questing power (or methods to circumvent location lock, or whatsoever)\n\nIt looks like you've gotten (mostly) into single colour deck builds. Most thematic builds uses at least two colours. As far as my experience goes, two coloured decks are more effective than three coloured decks, even with a good thematics backgound. Ok, maybe a silvan deck is a exeption (and Outlands ofc).\n\nAbove my post there are allready a bunch of very good suggestions to go. I'd like to take another aproach (probably mostly for myself) but maybe it helps you, too.\n\nSo, if you want to stick to a theme; I postulate at least two heroes should share that trait. First, lets see which (major) player traits are already in game.\n\nDunedain\n\nDwarf\n\nGondor\n\nHobbit\n\nNoble (imho, not realy a theme. maybe I am wrong??)\n\nNoldor\n\nOutlands (just one hero, but.. well) besides, if I am not wrong Prince Imrahil is originally also an outland\n\nRanger (not realy a theme)\n\nRohan\n\nScout (?)\n\nSilvan\n\nWarrior (not realy a theme)\n\nworth mentioning:\n\nEnt (just one hero but powerfull, also enough allies)\n\nEagle (missing heroes, but good thematic)\n\nLets see which of that above fractions are dominated by blue colour:\n\nRohan\n\nNoldor (not really, but powerful blue cards do have that trait)\n\nOutlands (even just the three swordsmen are powerful in any deck, but I woulnd count outlands as dominated by blue)\n\nSilvan (powerful blue cards here, but will work without blue)\n\nAfter crawling through the fractions I'd say only Rohan gets unplayable without blue coloured cards.\n\nSo lets just strike out some thematic traits which cannot (easyly) build up questing power:\n\nEagle\n\nWarrior\n\nDunedain (?)\n\nBut worth mentioning: Legolas (adds two tokens to the quest) and certain green cards which help location locks, e.g. Asfaloth. So even red and/or green decks have access to quest.\n\nIn the end there are enough fractions left.. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649586","commentId":1649586,"userName":"Qaanaaq","timestamp":1433515261,"content":"Thanks guys n girls for the inspiration, i will immerse myself into some deckbuilding!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649792","commentId":1649792,"userName":"danpoage","timestamp":1433525585,"content":"Here is a deck without any Spirit that performs quite well against most quests:\n \n\nHeroes:\n\nBoromir (TDM)\n\nBalin (TH:OtD)\n\nSam Gamgee (TBR)\n\n \n\nAllies: 22\n\nErrand-rider (HoN) x3\n\nVassal of the Windlord (TDM) x3\n\nWeather Hills Watchman (TLR) x3\n\nWinged Guardian (THfG) x3\n\nGaladriel (TRD) x1\n\nFaramir (Core) x3\n\nEagles of the Misty Mountain (THfG) x3\n\nGandalf (Core) x3\n\n \n\nAttachments: 21\n\nDunedain Mark (THfG) x2\n\nDunedain Warning (CatC) x3\n\nCaptain of Gondor (TAC) x1\n\nGondorian Shield (TSF) x3\n\nSecret Vigil (TLR) x3\n\nKing Under the Mountain (TH:OtD) x3\n\nSteward of Gondor (Core) x3\n\nSupport of the Eagles (RtM) x3\n\n \n\nEvents: 6\n\nThe Eagles Are Coming! (THfG) x3\n\nSneak Attack (Core) x3\n\n \n\nSide Quests: 1\nGather Information (TLR) x1\n\nEdited June 5, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649950","commentId":1649950,"userName":"DukeWellington","timestamp":1433533525,"content":"Sweet deck. I have seen more Balin love recently. I guess shadow effects are getting worse and without healing Balin has an advantage over Erkenbrand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179370-bored-of-my-top-tier-deck-cannot-win-with-any-other/?do=findComment&comment=1649965","commentId":1649965,"userName":"Gizlivadi","timestamp":1433534431,"content":"A 2 quester in leadership with shadow cancelation and access to King under the mountain, and at a reasonable threat of 9 is really good. Erkenbrand would be interesting in a mono-leadership deck, I mean I really like the character, but to me he isn't cutting it right now. I'd like to use him with tactics, maybe with tactics Aragorn. Give him Steward and Gondorian shield, maybe even a couple Warnings to combo with the Watchman and he could be a dedicated defender. I think that if he had been tactics he would have been more accepted in practice, but since leadership is my favorite sphere I'm glad to have him there. You could also add Sam or Halbarad into the mix (not to mention Sword that was Broken and Dúnedain allies and stuff). Could be a good deck, at least for normal mode.\n\n \n\nI'm really curious about the Ranger of Cardolan which is coming next pack, looks like a response effect when you engage an enemy, could eventually become a staple, especially at 4 cost and neutral. Hoping he's good.  Also I'm really curious about the other leadership hero we'll get in Battle of Carn Dum... I'm hoping she (I'm assuming, could even be a he, but leadership lacks female heroes) will have low threat. All in all I hope the new cycle benefits Dúnedain for solo.\n\nEdited June 5, 2015 by Gizlivadi"}]}