{"url":"https://community.fantasyflightgames.com/topic/179485-dungeons-deep-and-caverns-dim-rules/","title":"Dungeons Deep and Caverns Dim Rules","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/179485-dungeons-deep-and-caverns-dim-rules/?do=findComment&comment=1649462","commentId":1649462,"userName":"cmabr002","timestamp":1433509937,"content":"Stage 1B\n\n \n\n> Players cannot advance to stage 3A unless both 1B and 2B are complete. Forced: Reveal 1 additional encounter card per player during the staging step.\n> \n>  \n\n \n\nStage 2B\n \n\n>  \n> \n> Players cannot advance to stage 3A unless both 1B and 2B are complete. Progress tokens cannot be added to, or removed from, this quest except by answering riddles. Cards in the riddle area are immune to player card effects and cannot leave the riddle area except by quest effects.\n> \n>  \n\n \n\nStage 1B has more than enough quest points on it to advance.  Stage 2B is one short.  This was a two-handed game so we are revealing 4 total encounter cards due to stage 1B.  After the second card had been revealed, a riddle was answered successfully, thus placing the final required progress token on stage 2B.  After advancing to stage 3B, is it necessary to reveal the two additional cards or since stage 1B is no longer in play, does it Forced effect no longer apply.  I am unsure if the additional cards you reveal are set at the beginning of the staging step or if it is possible for it to change based on card effects leaving (or entering play).\n\n \n\nEdit: To clarify, I am wondering if we still have to reveal the 2 additional cards from the encouner deck from stage 1B's Forced effect in addition to the 1 per player we will have to reveal due to the When Revealed effect on Stage 3B.\n\nEdited June 5, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179485-dungeons-deep-and-caverns-dim-rules/?do=findComment&comment=1649495","commentId":1649495,"userName":"GrandSpleen","timestamp":1433511823,"content":"I'm not sure-- this has been asked before, but I haven't seen an official explanation.\n\n \n\nIt's a Forced effect, so if it goes out of play before it would trigger, then we're OK.  But it doesn't give a clear trigger, instead saying \"during the staging step.\"  So what triggers it? Beginning staging?  Or finishing your original 2 card reveals?\n\n \n\nThere's a bit in the FAQ about player elimination during staging, and it states that the number of cards to be revealed is determined at the beginning of the staging step.  That could apply here as well.  However, in this situation we're talking about card text which can leave play so I'm not 100% certain.  In the past I have played it the harder of the two interpretations, leading to just a boatload of cards getting revealed during that stage 1/2 to stage 3 transition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179485-dungeons-deep-and-caverns-dim-rules/?do=findComment&comment=1649707","commentId":1649707,"userName":"Ecthelion III","timestamp":1433521337,"content":"The number of cards to reveal during staging is always determined before the first card is revealed.\n\nThis was clarified in the FAQ when someone asked: do you reveal 2 cards if one of the two players is eliminated during the first card's staging, which GrandSpleen referred to.\n\nSo, you would have to reveal 6 cards in total: 4 from stage 1 and 2 from stage 3.\n\nEdited June 5, 2015 by Ecthelion III"}]}