{"url":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/","title":"You can play solo?!?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1651642","commentId":1651642,"userName":"chipset35","timestamp":1433708839,"content":"I was surprised to see that FFG card games can be played solo, and that there was even quest logs.\n\nCan anyone tell me how much fun solo is?\n\nI have no one to play with.\n\n;("},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1651646","commentId":1651646,"userName":"Chris51261","timestamp":1433709110,"content":"You can! It's very fun, and it kind of allows you to play around with different deck types because you're only worrying about one deck. Another option is to play two player by yourself, which works really very well. I've only ever played with two people like once or twice, but I've been playing two handed solo for a while and it's very fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1652259","commentId":1652259,"userName":"chipset35","timestamp":1433772335,"content":"Have you tried playing solo with FFGs other LCGs?\n\nHow do they work out solo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1652288","commentId":1652288,"userName":"Chris51261","timestamp":1433773727,"content":"I don't think any of the other LCGs are solo, but I'm not positive. The only other solo FFG game I can think of is Elder Sign, which I also enjoyed, but it isn't nearly as expansive as this game. This is without a doubt the best solo card game I've ever played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1652829","commentId":1652829,"userName":"CJMatos","timestamp":1433794620,"content":"No other LCGs from FFG are soloable.... they are competitive games... LotR is the only one non-competitive"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1652995","commentId":1652995,"userName":"Lecitadin","timestamp":1433800976,"content":"Yep, I play LOTR 100 % solo, and it's the best solo experience, hands down for me, and the replay value is... almost eternal!\n\nMy other best solo card games are Legendary Encounters (the Alien game) and Legendary Marvel. \n\nBut what makes LOTR unique is, for me, the questing aspect of the game and how different the quests mechanics are (and the art, that is awesome 99 % of the time).\n\nYou also have to remember this : LOTR can sometimes be difficult and frustrating, but so rewarding when you finally beat that unbeatable quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1652999","commentId":1652999,"userName":"Lecitadin","timestamp":1433801102,"content":"> Have you tried playing solo with FFGs other LCGs?\n> \n> How do they work out solo?\n\n \n\nThere's a guy who posted a few Youtube videos where he plays the unofficial solo variant of the FFG Star Wars game, and it seems cool, but still a bit clunky, since that game is made for 2 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1653125","commentId":1653125,"userName":"chuckles","timestamp":1433806945,"content":"Yes LoTR is a very good solo game\n\n \n\nPersonally... I found it more fun playing solo (with a single deck) for the in initial cycles... subsequently I think the game is more fun to play with two decks (even for solo) for the later cycles... either way the game works well for solo play. \n\n \n\n."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1653763","commentId":1653763,"userName":"chipset35","timestamp":1433859649,"content":"I think I might just order the FFG LOTR LCG today then.\n\nYou all sold me on it!\n\n:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1654250","commentId":1654250,"userName":"chuckles","timestamp":1433882189,"content":"> I think I might just order the FFG LOTR LCG today then.\n> \n> You all sold me on it!\n> \n> :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nGood Plan... by the way... there are a number of terrific blogs & podcasts that are great for new and old players...  https://hallofbeorn.wordpress.com/ [https://hallofbeorn.wordpress.com/] is one of them... and half way down the right hand side many more are listed... probably not all. A number of members have their blog links in their signatures... \n\n \n\nAlso there are plenty of friendly folks here that are happy to answer questions, offer advice....\n\n \n\nHope you have fun playing!\n\n \n\nPs (The learning curve and difficulty level can be a very challenging... and its quite normal to lose a lot of games)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1654309","commentId":1654309,"userName":"alexbobspoons","timestamp":1433884893,"content":"Wirh the core, 2 out of the 3 adventures are very difficult, but things ease off as you get into expansions and increased card pool. Dont be put off by the large number of losses :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1654574","commentId":1654574,"userName":"Ecthelion III","timestamp":1433905206,"content":"TalesFromTheCards.wordpress.com is an amazing blog. This article is a must read:\n\nhttps://talesfromthecards.wordpress.com/2013/01/03/5-things-i-wish-i-wouldve-known-when-i-started-playing-lotr-lcg/ [https://talesfromthecards.wordpress.com/2013/01/03/5-things-i-wish-i-wouldve-known-when-i-started-playing-lotr-lcg/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1654710","commentId":1654710,"userName":"soulred","timestamp":1433918943,"content":"I play exclusively solo and I really enjoy it! As its been said before though, the game can be tricky early on, so don't get frustrated if you have trouble winning. The later 2 quests in the core set are quite difficult with the limited pool of player cards you'll have and even the very first quest can be tricky when you're still learning, Still, the game is a lot of fun and you do get a genuine feeling of accomplishment when you win a tough scenario for the first time. There's also an optional 'easy mode' which tones down the difficulty a bit by removing some of the more punishing cards from the encounter deck.\n\n \n\nHope you enjoy the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1655487","commentId":1655487,"userName":"Lecitadin","timestamp":1433966885,"content":">  \n> \n> There's also an optional 'easy mode' which tones down the difficulty a bit by removing some of the more punishing cards from the encounter deck.\n\n \n\nYep, I forgot to mention easy mode; that's how I started after getting crushed in normal mode too many times, and it was a blast! \n\nBut don't play basic mode (that allows you to not give shadow cards to ennemies) : shadow cards often gets rid of nasty cards, you don't want to end up with 7 or 8 treachery cards into the encounter deck!\n\n \n\nCheers!\n\nEdited June 10, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1655544","commentId":1655544,"userName":"alexbobspoons","timestamp":1433968552,"content":"PS:\n\nI play fully solo all the time and fully love it!!\n\nIm a newbie and so far have played through the core and first 6 expansion packs.\n\nSolo from my aspect is fantastic, and when I get to the point I need the functions of dual players, I will play two-handed :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEnjoy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1668680","commentId":1668680,"userName":"jnicol","timestamp":1435016381,"content":"I predominantly play board games solo, and LoTR LCG is my favourite game. It is very enjoyable solo, and from reading the forums here and at BGG I get the impression that the game really hits the sweet spot for solo gamers. The replay value is very high, even with only the core set, and of course the LCG format means that the game experience continues to grow.\n\nYou can choose to play solo with a single player deck, or you can control two players, which is how many solo players prefer to play the game. Playing \"two fisted\" gives you more card play options and is a lot of fun. I recommend starting out playing one deck, then try a two handed game to see if it suits you.\n\nThe three quests included in the core set range from quite hard to extremely hard, so don't be discouraged if you lose your first few games. My hot tip: play your first game using the pre-built Leadership deck that comes in the box. It is the most balanced deck and you should win against the Passage Through Mirkwood quest within a few games. Don't start by playing the pre-built Tactics deck: it is not balanced enough to win on its own.\n\nAfter you've tried all the mono-sphere decks a few times you can try constructing a deck from multiple spheres. If you struggle with deck building then Beorn's Path is a fantastic introduction to the topic: https://hallofbeorn.wordpress.com/beorns-path/ [https://hallofbeorn.wordpress.com/beorns-path/]\n\nHave fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1694643","commentId":1694643,"userName":"me1034","timestamp":1437086183,"content":"I wish FFG would make an official solo mode for the Star Wars LCG.  LotR is so good to play solo, they should create a mode for Star Wars that does the same. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1908810","commentId":1908810,"userName":"gatharion","timestamp":1448562268,"content":"I'm playing a solo game right now! (Just took a break to see if there was a ruling about something.)\n\n \n\nI like the game a lot both solo and multiplayer.\n\n \n\n> I wish FFG would make an official solo mode for the Star Wars LCG.  LotR is so good to play solo, they should create a mode for Star Wars that does the same. \n\n \n\nThey did initially. Accordingly the first draft of the Star Wars LCG was almost an exact reskinning of the LotR LCG. I guess ultimately they decided they needed to do something more unique and did a complete redesign."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179653-you-can-play-solo/?do=findComment&comment=1909158","commentId":1909158,"userName":"Lecitadin","timestamp":1448585017,"content":"I hope they never release an official solo version for the Star Wars LCG... It would be too expen$ive for me (I play pure solo always actual cards, not with OCTGN)!"}]}