{"url":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/","title":"Core Gandalf - Essential or Not?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654560","commentId":1654560,"userName":"Ecthelion III","timestamp":1433904355,"content":"Do you still use Core Gandalf in your decks? Do you think he's still as niche as he was back in the day?\n\n \n\nMy opinion is no. There are better options for threat reduction, card draw, direct damage, and allies with solid stats that are much cheaper. The exception is in The Black Riders/The Road Darkens, where the Fellowship resources aren't really good for anything except keeping Gildor in play if you happen to draw him.\n\n \n\nWhat are your opinions?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654564","commentId":1654564,"userName":"GrandSpleen","timestamp":1433904464,"content":"I use him a lot less often these days.  5 resources for a 1-turn ally remains a steep cost.  That said, he probably makes it into 50% of my decks.  And any Leadership deck I make still gets max copies of Sneak Attack + Gandalf, I admit..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654596","commentId":1654596,"userName":"chuckles","timestamp":1433906763,"content":"Seldom think about adding ally Gandalf when i'm playing around with a new decks. If I have leadership hero(es) I might... but he hasn't made the cut recently... honesty forget there even is an ally Gandalf, (more than often than I remember at least)... I blame the single sphere filters ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654605","commentId":1654605,"userName":"Bullroarer Took","timestamp":1433907250,"content":"Not. If I'm playing Leadership with access to Sneak Attack then sure, but it really depends on the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654641","commentId":1654641,"userName":"Teamjimby","timestamp":1433909016,"content":"I use him in most leadership decks, but almost never in any other deck.  I might include him in a deck with Elf Stone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654649","commentId":1654649,"userName":"Fingolfin Fate","timestamp":1433909831,"content":"I use him in one of my decks only. Boromir, Imrahil, Beregond. With Sneak Attack, of course. I haven't had him in a deck without Sneak Attack since the core-set times, maybe. Well, shortly with Galadriel as she made him special too, but Silvan can do very well without him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654665","commentId":1654665,"userName":"Glowwyrm","timestamp":1433911405,"content":"I try to avoid playing him if I can help it, but he is still an easy way to bring threat reduction and card draw to a Tactics deck that needs it.  With Legolas and Secret Vigil being out now, though, I think that I'll use him even less. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654693","commentId":1654693,"userName":"leptokurt","timestamp":1433915754,"content":"He's still worth the money. Usually a deck is not able to cover all six aspects of core Gandalf (WP, ATT, DEF, dard draw, threat reduction plus damage), so when I'm in dire need Gandalf can help me to overcome an immediate threat or just to help me clearing the staging area.\n\n \n\nBut it's true, nowadays you can play without him, and often the other ally version is better fitting (I don't count the hero version which I try to ignore as best as possible). Still, I do include him more often or not, as he's kind of a life ensurance and it's good to know that he is sitting there in your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654707","commentId":1654707,"userName":"Olorin93","timestamp":1433918655,"content":"He was even more essential early in the game, but his versatility still helps him hit the table pretty much every time I play. Everyone in my play group still runs him for different purposes. I usually play support and need help with assigning extra damage, combat decks may need card draw or threat reduction etc. All his abilities are good, and I doubt he will see less play this cycle with the new discard mechanic - all kinds of card draw is valuable, but even more so now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654746","commentId":1654746,"userName":"Fingolfin Fate","timestamp":1433922924,"content":"Oh, I think there's no doubt he is still good. Even for the full cost, he is worth every resource. To get him out cheaper (and the ways have now moved far beyond Sneak Attack of the core set), it gets even better. For me it is only the question of repetition vs versatility.\n\nEdited June 10, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654801","commentId":1654801,"userName":"DukeWellington","timestamp":1433929681,"content":"Is this just about core Gandalf? Because ohuh Gandalf is amazing. I like to go mono blue with tons of threat reduction and rely on ally Gandalf heavily. He is like twice as good as core Gandalf. I think ore Gandalf is only worth it with sneak attack or with Galadriel so he can be used to quest and combat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1654827","commentId":1654827,"userName":"alexbobspoons","timestamp":1433932301,"content":"Speaking as a newbie (and thus a bit against the thread theme) he still remains for me an essential in every deck.\n\nI have played through to the end of Mirkwood cycle, and often he has been desperately needed to reduce threat with my limited card pool (I understand as the pool grows this will lessen).\n\nGaladrims Greetings alone, and only in Spirit isnt enough threat drop in some scenarios with the starting card pool. Gandalfs other abilities are good and helpful, but not essential as other cards provide these well, but its nice to have them.\n\nI have even spent the resources many times to use him with Born Aloft just to get threat down.\n\n \n\nMy thoughts are that he was a good idea at core stage to be an all-round substitute for some card aspects not yet released, so that the game still works, yet as other cards have been released, his initial purpose is thus then less needed. Making the starting card pool without any holes might have been difficult to manage, too large or too difficult for a newbie to deck build around without experience. He is a core-starter helping card.\n\n \n\nThe threat raise in solo-play on Return to Mirkwood I would never never have managed without him.\n\n \n\nI can imagine a time though as my pool grows that I will play my first deck without him. That will be an occasion, knowing he isnt in there somewhere. Not drawing/using him happens a lot, but knowing he will not arrive at all, scary times :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1655165","commentId":1655165,"userName":"Fingolfin Fate","timestamp":1433952755,"content":"> Is this just about core Gandalf? Because ohuh Gandalf is amazing. I like to go mono blue with tons of threat reduction and rely on ally Gandalf heavily. He is like twice as good as core Gandalf. I think ore Gandalf is only worth it with sneak attack or with Galadriel so he can be used to quest and combat.\n\nI have always found the Hobbit saga Gandalf super powerful. But just as so many others, I have never used it very often. And less so since the hero came along. But I totally see the power and possibilities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1655774","commentId":1655774,"userName":"awp832","timestamp":1433980726,"content":"the insane frequency in which we see Gandalf (Hero) decks seem to indicate that Core Gandalf (ally) is pretty much unnecessary.  Even without Gandalf (hero) in the mix, I hardly ever include him in any deck except for leadership.   Leadership just has the goods to make Gandalf work well.   Not only sneak attack, but Steward of Gondor and Ever Vigilant also make Gandalf much easier to play, and ultimately more worth it.  \n\nEdited June 10, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1655873","commentId":1655873,"userName":"divinityofnumber","timestamp":1433989071,"content":"I have been playing since day one, and I still use Core Gandalf quite a bit. He has great utility. For some reason I find myself including 2x Core Gandalf and 1x Hobbit Saga Gandalf in a few decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1655986","commentId":1655986,"userName":"Fingolfin Fate","timestamp":1433997005,"content":"> the insane frequency in which we see Gandalf (Hero) decks seem to indicate that Core Gandalf (ally) is pretty much unnecessary.  Even without Gandalf (hero) in the mix, I hardly ever include him in any deck except for leadership.   Leadership just has the goods to make Gandalf work well.   Not only sneak attack, but Steward of Gondor and Ever Vigilant also make Gandalf much easier to play, and ultimately more worth it.  \n\nYes. I totally agree with this. I have always been a bit shocked when I saw the ffg deck-lists from the Second Breakfast articles that had core Gandalf in a deck of Spirit and Tactics with no resource acceleration. I know it can be a utility there, too, but I would rather have something to play right away. Leadership is indeed the sphere for the core Gandalf to have: the icon is the Gandalf rune after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1658591","commentId":1658591,"userName":"Eryx_UK","timestamp":1434195774,"content":"I use him just as much as I did in the beginning and always include three in a deck (I play 99% solo so...)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1659883","commentId":1659883,"userName":"divinityofnumber","timestamp":1434341931,"content":"My number one rule for multiplayer is that none of us are using Hero Gandalf. It could just be my playgroup, but Core Gandalf has such nice utility that the opportunity cost of one person running the Hero version is not worth it. I build decks with Hero Gandalf for solo all of the time, but I never consider bringing him to a multiplayer game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1660010","commentId":1660010,"userName":"Mndela","timestamp":1434360407,"content":"I have seen a lot of bad plays with Gandalf. When a player pays 5 resources and he has a not little number of cards in his hand. When it happens, usually players lose the game.\n\nGandalf is good only for 2 purposes:\n\n1. With sneak, of course, no need more comments\n\n2. When you don't have nothing else to play. In fact, it is the most thematic way to play him, when people needs Gandalf and he finally comes. For example, when you don't have cards to spend your resources, and you are getting a lot of useless resources, then you play Gandalf and draw 3 cards. Other use, when you have secrecy cards and your threat is over 20-25, and you can't decrease that threat by other way. And finally, when there is a nasty enemy that you don't have any other way to kill him, only with Gandalf.\n\n...definitively, only as the last solution, is the decent way to spend 5 resources for playing Gandalf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1660045","commentId":1660045,"userName":"leptokurt","timestamp":1434363586,"content":"> I have seen a lot of bad plays with Gandalf. When a player pays 5 resources and he has a not little number of cards in his hand. When it happens, usually players lose the game.\n> \n> Gandalf is good only for 2 purposes:\n> \n> 1. With sneak, of course, no need more comments\n> \n> 2. When you don't have nothing else to play. In fact, it is the most thematic way to play him, when people needs Gandalf and he finally comes. For example, when you don't have cards to spend your resources, and you are getting a lot of useless resources, then you play Gandalf and draw 3 cards. Other use, when you have secrecy cards and your threat is over 20-25, and you can't decrease that threat by other way. And finally, when there is a nasty enemy that you don't have any other way to kill him, only with Gandalf.\n> \n> ...definitively, only as the last solution, is the decent way to spend 5 resources for playing Gandalf\n\n \n\nSee, and that's why Gandalf still shines (and add situations like: I need these 4 WP immediatly to overcome a location lock etc..). He's a life ensurance against all possible threats of the encounter deck. The knowledge that you have something in your hand that can counter even worst case scenarios allow you to plan your next steps more freely.\n\n \n\nIf your plan works: fine!\n\n \n\nIf it doesn't: Gandalf time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179857-core-gandalf-essential-or-not/?do=findComment&comment=1660620","commentId":1660620,"userName":"HeavyKaragh","timestamp":1434395736,"content":"I use him a lot, but not always. I only find him essential in monosphere decks, playing solo.\n\nEdited June 15, 2015 by karagh"}]}