{"url":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/","title":"Solo is so much easier… and more boring","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1654754","commentId":1654754,"userName":"Fingolfin Fate","timestamp":1433923911,"content":"I was alternating solo and coop play in the beginning of the game's existence. Gradually I began to favour 2-player games (with an occasional 3- or 4-player). However, at the time of the core set, solo seemed at least as hard as coop, often harder. Lately I have almost ceased to play solo. Yet, I still do, usually when I build a new deck and want to test it on its own. And having played some of the recent quests in the 2-player mode, I was almost shocked (though I had anticipated it) how much easier the game is solo. Of course, you cannot take any deck against any quest, but the general mechanic, and the trickery of the solo play, is just far less dangerous.\n\n \n\nAlso, not only from the difficulty and unpredictability point of view, I find the cooperative mode far more interesting. Not least because you can take unusual decks that would hardly be competitive on their own.\n\n \n\nA question. I have not recently played much 3- and 4-player games. Are they much harder that 2-player? I know some quests, especially those with many surge cards, tend run out of the rails easily."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1654768","commentId":1654768,"userName":"Khamul The Easterling","timestamp":1433925325,"content":"2 player I think is the sweetspot for this game. However, I usually play solo because I can only get together with my gaming friend so often...and I do think solo is quite fun to though. I tried two handed a handfull of times before but I never really liked it...I didnt like controlling 2 players...it just felt wierd.\n\nAnyways, I only have so many 4 player games under my belt but I feel like the difficulty really depends on the quest in 3-4 player. I am 0-5 against Assualt on Osgiliath in 3-4 player. It turns from an easy quest in solo to a monster with 3-4 players. Me and my buddies all had our most powerfull decks that we used against Assualt on Osgiliath and we went 0-5... that quest is really cool with multiplayer and very very hard! Also, to catch an orc is extremely hard multi. But generally, I think most quests are fairly easier with 3-4 players...save a handfull.\n\nCool topic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1654798","commentId":1654798,"userName":"DukeWellington","timestamp":1433929436,"content":"Solo is also fun because the games are much shorter and easier to keep track of. Sometimes multiplayer gets to be too much and you start to lose interest.\n\nThat being said, I have only had a little experiance, compared with solo, but 4 player games are easily my favorite. They are incredibly fun, especially if you create synergy between the decks. There are cards like the ravenhill scout (I think that's the name) that suddenly become really good. I played with a four player team that set up a Hama combo with Dunedain Cache and hand upon the bow so he could mow down enemies off the top of the deck. It was a lot of fun and really only possible in 4 player (I tried with fewer players but there are just too many combo pieces that have to come together). I also built a mono blue ultra secrecy deck with songs of erendil to soak up everyone else's threat so they could go crazy with Frodo, Boromir, and ohuh Gandalf. That was fun too. Four player kicks butt, but some quests are totally insane, Osgiliath (already mentioned) and nightmare shadow and flame. The games can take a very long time, especially considering the deck building prep work, so you have to have a hardcore crowd, but it is satisfying to say the least."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1654938","commentId":1654938,"userName":"jjenks476","timestamp":1433941836,"content":"About 6 months I went into 2 handed because I found solo to be getting too boring and easy. Drawing 2 encounter cards every turn gives the encounter deck more combos and sets up the theme of the quest. For example, when I play NM PiP solo a lot of times the scroll bouncing and enemy maneuvering with the scroll never shows up, because with only 1 card a turn, I can usually deal with it before the next staging step. 2 cards ensure that their is some interaction between encounter cards.\n\nUnfortunately I only have 1 friend in the are who plays so I have never played 3 or 4 player.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655038","commentId":1655038,"userName":"Teamjimby","timestamp":1433946617,"content":"I agree with DukeWellington.  Solo can be fun if you just want a quick game, but multiplayer allows you to make crazy decks and creates a much more memorable experience.  I've made decks with absolutely no quest power or no combat and they can be very effective.  But it absolutely gets harder with more players.  There are so many treacheries like \"Each player adds an enemy\" or Archery X or even cards that remove time counters can be brutal.\n\n \n\nIn a 4 player game of Druadan Forest you are lucky to survive more than 2 rounds.  Turn 1 you could get one treachery that removes everyone's resources, then another one that removes all heroes from the quest unless they pay a resource.  Well, I guess we're questing for zero this turn and everyone raises their threat by 20.  Eleanor and Northern Trackers are pretty much mandatory in 4 player.\n\n \n\nSo you might be stuck playing quests from the first two cycles unless you really coordinate your decks.  But it's still a ton of fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655071","commentId":1655071,"userName":"Chris51261","timestamp":1433948029,"content":"True for some quests, untrue for others. I will agree the game seems to be balanced the best for 2 players, but putting a blanket statement over every quest claiming solo is super easy isn't accurate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655130","commentId":1655130,"userName":"Teamjimby","timestamp":1433951287,"content":"Of course there are exceptions, particularly in the earlier quests. But I'd be hard pressed to find any quest since Heirs of Numenor that is easier with 4 players than 1.  Of course the difficulty in 4 player depends a lot on how much you coordinate your decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655136","commentId":1655136,"userName":"Gizlivadi","timestamp":1433951704,"content":"The Three Trials is very difficult solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655163","commentId":1655163,"userName":"Fingolfin Fate","timestamp":1433952630,"content":"Of course there are exceptions but they really seem to be dwindling. I remember when Massing at Osgiliath came out, it might have been the very first quest that was clearly easier in solo mode. Now, I think Return to Mirkwood may be the last one where solo is the hardest option -- but my experience is sometimes limited as I haven't played some of the quests enough (in certain modes, especially solo) as I said above.\n\n \n\nScrying is one strategy that can very often undo a quest in solo mode. Denethor and Henamarth can just tell you all you need to know, which takes away a lot of suspense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655185","commentId":1655185,"userName":"Chris51261","timestamp":1433953312,"content":"Comparing 1 players to 4 isn't really fair. Find me a quest that's harder with 2 than 4. Just about every quest is harder with 4. But since Heirs? How about The Steward's Fear? Every engagement punishing enemy happens to you, it's a scenario that makes you do everything at once. I mean it's all subject to opinion, and each way to play has its pros and cons, but I would argue you could find a quest or two per cycle that is harder solo then it is with 2 players.\n\nEdited June 10, 2015 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655194","commentId":1655194,"userName":"Teamjimby","timestamp":1433953831,"content":"Three Trials is pretty tough solo, I'll give you that.  But it's still easier with 2 than 4.\n\n \n\nSteward's Fear has a few cards that are brutal in 4 player.  A treachery that does 1 damage to each non-unique character and another one that adds one location per player to the staging area.  Sure, you can choose who engages which enemy, but you still get the same number of enemies per player.\n\n \n\nThe point is, while there are a few quests that are difficult solo or 2 player, they are all beatable.  Meanwhile, some quests are completely unplayable with 4 players and you are lucky to last 2 turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655224","commentId":1655224,"userName":"DukeWellington","timestamp":1433955544,"content":"Morgul Vale is also more difficult solo. Multiplayer is a lot easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655274","commentId":1655274,"userName":"Teamjimby","timestamp":1433957560,"content":"Interesting, I would completely disagree about Morgul Vale.  I've always found Morgul Vale easy solo as long as you can stay below Murzag's engagement.  There is no time threat at all, so you can just build up for several turns and then take down the captains the same turn you engage them.\n\n \n\nVirtually every treachery in that quest is an \"each player\" treachery, so it gets exponentially harder with more players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655324","commentId":1655324,"userName":"Chris51261","timestamp":1433959765,"content":"Yeah, I would agree with you that 4 player is the hardest, it makes everything way more random. But look at quests that are \"unbeatable,\" and you can't find one that is while playing two player. That's all I meant really, it's the most balanced for two player. The other caveat is when you're playing with more players you have more cards available too, so you can focus on doing something very well, which is always fun when deckbuilding. The most options exist for 2 player deck building for the same reasons, it just balances the best. I don't find solo boring though, but that could just be my preference. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655571","commentId":1655571,"userName":"GrandSpleen","timestamp":1433969939,"content":">   There is no time threat at all, \n\n \n\nDoesn't Morgul Vale have a built in 'time threat' with that \"To The Tower\" card or somesuch?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655583","commentId":1655583,"userName":"Teamjimby","timestamp":1433970195,"content":">  \n> \n> >   There is no time threat at all, \n> \n>  \n> \n> Doesn't Morgul Vale have a built in 'time threat' with that \"To The Tower\" card or somesuch?\n> \n>  \n\nYeah, but in solo it never comes close to being a threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655629","commentId":1655629,"userName":"Ecthelion III","timestamp":1433971976,"content":"> True for some quests, untrue for others. I will agree the game seems to be balanced the best for 2 players, but putting a blanket statement over every quest claiming solo is super easy isn't accurate.\n\nNightmare Knife in the Dark solo..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655729","commentId":1655729,"userName":"Bullroarer Took","timestamp":1433976591,"content":">  \n> \n> >  \n> > \n> > >   There is no time threat at all, \n> > \n> >  \n> > \n> > Doesn't Morgul Vale have a built in 'time threat' with that \"To The Tower\" card or somesuch?\n> > \n> >  \n> \n> Yeah, but in solo it never comes close to being a threat.\n> \n>  \n\nDepends on your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1655734","commentId":1655734,"userName":"PocketWraith","timestamp":1433976851,"content":"> Doesn't Morgul Vale have a built in 'time threat' with that \"To The Tower\" card or somesuch?\n\nNot really, because To The Tower doesn't progress over time, only by encounter card effects, so it's not that big an issue if you're playing solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1657391","commentId":1657391,"userName":"Courchevel","timestamp":1434092983,"content":"Solo : easy and boring especially if deck built against a specific quest - coop solo is missing one huge aspect of the game as is soluo (solo playing two decks)\n\nDuo (two) : nice and normally a bit more easy than 3 players - best mode for deck building synergies\n\nTrio (three) : nice and pretty difficult - best way to play the game imho\n\nQuatro (four) : very difficult and long and boring waiting for your turn sometimes - multiple tricks difficult to follow, misplay can occur frequently on new quests\n\nMy 0.02€"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1658021","commentId":1658021,"userName":"Mndela","timestamp":1434134284,"content":"Solo: boring, i don't like\n\nDuo: - two handed: the best way to test and build decks before play in 'oficial' games\n\n         - two players: good if nobody else is ready to play\n\nThree: interesting\n\nFour: epic ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1658463","commentId":1658463,"userName":"Seastan","timestamp":1434171801,"content":"I would agree that 3-4 players tends to be more challenging than 1-2 players, but I think that' s a result of the fact that if you are playing with 3-4 players you probably haven't tuned all your decks to synergize perfectly with each other and with the quest. With 9-12 heroes on the board it is much easier to put together combos that trivialize most quests, but people just don't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1658723","commentId":1658723,"userName":"Fingolfin Fate","timestamp":1434209947,"content":"> I would agree that 3-4 players tends to be more challenging than 1-2 players, but I think that' s a result of the fact that if you are playing with 3-4 players you probably haven't tuned all your decks to synergize perfectly with each other and with the quest. With 9-12 heroes on the board it is much easier to put together combos that trivialize most quests, but people just don't.\n\nI can definitely see this is the case. With twelve heroes, each of the four decks can focus on a single main area (and have everything else within the fifty cards as a nice bonus). I am sure the encounter deck will be going off crazy in many of the recent quests, and especially the Tests of Wills will run out quickly unless at least two players possess three copies in their decks, but still, I have a feeling four decks might handle a lot.\n\nSince I posted the topic, I have experienced many three-player games, and those games (even recent quests) were usually slightly easier than two-player coops. But I have built all three decks to work together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1659454","commentId":1659454,"userName":"SauronTheGreat","timestamp":1434299848,"content":"I mostly play this game solo because there aren't many people who play it in my area, in fact, I think I was the one who introduced it to all those who know of it.  But anyway, I have two brothers who will play with me, but there not as into it as I am so we only play occasionally.  so I play single mostly but think that the game goes up in challenge with 3-4 players.  I also enjoy the chat that goes around with 3-4 players as opposed to single.  anyway, like solo well enough but would like to play more multiplayer. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1659554","commentId":1659554,"userName":"Mndela","timestamp":1434309420,"content":"> I mostly play this game solo because there aren't many people who play it in my area, in fact, I think I was the one who introduced it to all those who know of it.  But anyway, I have two brothers who will play with me, but there not as into it as I am so we only play occasionally.  so I play single mostly but think that the game goes up in challenge with 3-4 players.  I also enjoy the chat that goes around with 3-4 players as opposed to single.  anyway, like solo well enough but would like to play more multiplayer. \n\n \n\nHave you tried octgn? there are some people ready for playing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1660208","commentId":1660208,"userName":"SauronTheGreat","timestamp":1434376604,"content":"this is something I have seriously thought about.  maybe I will do that\n\nthx"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1672287","commentId":1672287,"userName":"Eu8L1ch","timestamp":1435267281,"content":"From what I've experienced, playing a lot in all various modes, solo is more subject to luck since it makes a big difference whether the truly bad cards show up earlier or later.\n\nIn addition to this, being successful at it requires a deck to be very well-balanced, and that's not an easy task. Also, a lot of quests have setups that are much harder for solo (for example Morgul Vale; also killing Hill Troll is much harder for a deck that has to both quest and combat, compared to when you can have a deck to do all the fighting).\n\n \n\nIn multiplayer most of the treacheries are worse, but having extra players means you can cancel the worst ones much more consistently.\n\nIn addition to this I noticed 3-4 player games tend to played with more specialised decks that are usually brought considering the kind of quest you're playing against (at least, in my group on OCTGN we play it this way: for example, in a 3 player game, if we know a quest is heavy on combat we'll get 2 full-blown combat decks instead of one plus support, in addition to a questing deck ofc).\n\nI'm not sure how tuning your deck for quests should be considered in relation to influencing difficulty, but I tend to restrain myself on that as much as possible. Using quest-specific decks makes games feel hollow to me, having exploited a specific loophole instead of trying my best with more generic principles of deckbuilding. However there are some quests for which you just have to do it, and that's good, I'm saying that as a general guidline.\n\nAnyway, I think when playing MP you're much more in control of your fate, so that if you have good decks you'll win more consistently than when playing solo, in which even a very good deck will lose a significant part of the games.\n\n \n\n \n\nBottom line, I don't think I agree solo is easier, but I might have to agree it is more boring, even if for me it has its own appeal. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 25, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1672507","commentId":1672507,"userName":"Trialus","timestamp":1435288725,"content":"Just to be a voice of dissent...\n\n \n\nAs far as difficulty goes....I think the relative difficulty of solo vs multiplayer is pretty quest dependent, but can certainly see there being more chances for the encounter deck to combo in a multiplayer game.  However, I'd counter that solo requires much more considered deck construction to be able to cover all of the necessary bases (questing, defending, attacking).\n\n \n\nMore to the point for my own enjoyment though is that, while I enjoy playing in multiplayer games, I have found that I really prefer the solo experience.  Playing multiplayer does provide a higher number of combos that can be set up and really lets the encounter deck do some work.  However, it is also more prone to end up as a strict puzzle solving/math problem.  I came to the game looking to scratch a little bit of a role playing itch rather than a card game itch...I really like the theme and story and the way the mechanics reflect those aspects.  Playing solo allows me the time to really read the story/flavor bits, and really think about how the mechanics of an individual scenario reflect those.  I might put on some music from the movies and really try to immerse myself in a scenario.  I find that harder to do in a multiplayer game.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1673143","commentId":1673143,"userName":"Lecitadin","timestamp":1435345053,"content":"Solo is boring? Try Journey down the Anduin Nightmare solo! In fact, a lot of nightmare decks are brutal when played solo. I even red somewhere that Steward's Fear nightmare solo is almost impossible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1673268","commentId":1673268,"userName":"alexbobspoons","timestamp":1435357551,"content":"Duplicate post sorry\n\nEdited June 26, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1673272","commentId":1673272,"userName":"alexbobspoons","timestamp":1435357751,"content":"> I really like the theme and story and the way the mechanics reflect those aspects.  Playing solo allows me the time to really read the story/flavor bits, and really think about how the mechanics of an individual scenario reflect those.  I might put on some music from the movies and really try to immerse myself in a scenario.\n\nAwesome things you said there!!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1676764","commentId":1676764,"userName":"Fingolfin Fate","timestamp":1435676349,"content":"> Solo is boring? Try Journey down the Anduin Nightmare solo! In fact, a lot of nightmare decks are brutal when played solo. I even red somewhere that Steward's Fear nightmare solo is almost impossible.\n\nI did not mean boring equaling easy. And I said more boring meaning less fun. And I, having played all the released material up to this point, am totally standing behind those claims. Which doesn't mean others have different views, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1676918","commentId":1676918,"userName":"Eu8L1ch","timestamp":1435683125,"content":" @Fingolfin\n\n \n\nBut are you still convinced that Solo is much easier, as the title of this thread reads? Or was that just supposed to relate to the latest quests, as your opening post seems to suggest?\n\nIn all honesty I think, if anything, Solo is much harder. However I think (and on this probably I can say I agree with OP) the designer made a very good job with balancing the solo/multiplayer difficulty ratio with the latest quests, so they're relatively easier Solo.\n\n \n\nAlso, for me it is more boring in that you have limited deck building possibilities, if you want to have a reasonably high chance of success. Multiplayer makes many cards (much more) useful and allows for more specialised decks. However, the experience of playing Solo is, for me, very thrilling, I think one only needs to be willing to let the deckbuilding issue stay aside.\n\nMultiplayer has its own joys, as playing with other human beings adds a whole layer of entertainment, so in the end I prefer multiplayer because playing Solo after some time feels repetitive; however this is not to mean that Solo is boring in an absolute way.\n\nBTW, my favorite player mode is 2 Players, as I think it is the most enjoyable and balanced: no strange combos, no must-cancel treacheries but still a very very good array of deckbuilding possibilities, and human interaction: that's the winning combination for me.\n\nEdited June 30, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1676941","commentId":1676941,"userName":"Lecitadin","timestamp":1435683942,"content":"Once and for all, there are a few of us who don't have access to other players (for various reasons), so YES solo is a viable way to enjoy this game, and NO it does not require other human beings to be fun and a real experience!  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1676981","commentId":1676981,"userName":"Eu8L1ch","timestamp":1435685051,"content":">  YES solo is a viable way to enjoy this game, and NO it does not require other human beings to be fun and a real experience!  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nI don't think anyone here would object to what you said (at the very least, I agree with you ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] ), it seemed to me this was more of a discussion about a matter of preference. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1676982","commentId":1676982,"userName":"Fingolfin Fate","timestamp":1435685069,"content":">  @Fingolfin\n> \n>  \n> \n> But are you still convinced that Solo is much easier, as the title of this thread reads? Or was that just supposed to relate to the latest quests, as your opening post seems to suggest?\n> \n> In all honesty I think, if anything, Solo is much harder. However I think (and on this probably I can say I agree with OP) the designer made a very good job with balancing the solo/multiplayer difficulty ratio with the latest quests, so they're relatively easier Solo.\n> \n>  \n\n \n\nI am the OP here, haha, and yes, I am totally convinced solo has become much easier. I would say the vast majority of the quests of the last two cycles at least, and the LotR saga, is much more difficult coop. It is way less problematic to tame the encounter deck when it only reveals one card per staging, because it cannot combo very much, or surprise, and any form of scrying becomes super powerful.\n\nEdited June 30, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1680159","commentId":1680159,"userName":"Mich the One","timestamp":1435933044,"content":"This game is the best because it combines two fantastic things: Tolkien and solo boardgaming.\n\n \n\nWhen I read Tolkien or play games, I do it mostly to escape other people :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n \n\nAnd also what Trlaius said - when you are alone you can immerse yourself in the theme of the game, spend some time looking at the art, build some narrative in your head. For me with more players it is more a \"game\" than a Tolkien thingy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1680207","commentId":1680207,"userName":"Lecitadin","timestamp":1435935517,"content":"Yep, for me, LOTR LCG is the best solo experience, even if it's not perfect (or maybe too easy... or too difficult sometimes)! And solo boardgames are rare, and good solo games are even harder to find. \n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/179875-solo-is-so-much-easier%E2%80%A6-and-more-boring/?do=findComment&comment=1680212","commentId":1680212,"userName":"Eu8L1ch","timestamp":1435935952,"content":"> When I read Tolkien or play games, I do it mostly to escape other people :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nEven if it's not the same for me, I couldn't resist liking your post because of this! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n \n\n \n\nAnyway, if anyone of you solo-gamers ever wants to try playing multiplayer, just know there is a wonderful thing called OCTGN :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nIn particular, if you are in the EU timezone look for me/and or my gaming group, we play almost every evening."}]}