{"url":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/","title":"Desperate Alliance and &quot;Once per phase&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1662998","commentId":1662998,"userName":"Seastan","timestamp":1434555897,"content":"Desperate Alliance reads:\n\n \n\n>  \n> \n> Action: Choose a hero you control. Until the end of the phase, give control of that hero and all resources in that hero's resource pool to another player. (Limit 1 per phase.)\n\n \n\n \n\nFAQ 1.51 reads:\n\n \n\n>  \n> \n> When a card with a triggered effect has a limit on the number of times that effect can be triggered (i.e. “Once per round,” “Limit 3 times per phase,” etc.), the limit is specific to that card. However, if a card has a limit of “once per game,” that limitation is specific to the player who triggered it.\n\n \n\nSo what is the limitation on DA preventing me from doing then? The way I understand the FAQ, I can still play three copies of the card if I have them all in my hand. So I guess it is preventing me from doing something like playing DA, getting it back with Dwarven Tomb, then playing it again?\n\n \n\nThis further complicates things. What if I play DA, then Will of the West, then draw and pick up a DA? Is it the same card? I dunno...  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1663036","commentId":1663036,"userName":"Teamjimby","timestamp":1434557211,"content":"Good question.  I feel like the spirit of the card is to not allow you to give away multiple heroes, but the FAQ would say otherwise.  For comparison, Tree People says \"You can only play 1 copy of The Tree People each phase.\" and Tighten our Belts says \"Only 1 copy of Tighten Our Belts can be played by the players each round.\"  So the fact that Desperate Alliance is worded differently would make me think you can play multiple copies. \n\n \n\nI suspect that was not the intent and they just cleaned up their wording on events after Desperate Alliance was printed.  Either way I don't think you can Dwarven tomb it for multiple plays.  If you somehow manage to Will of the West and draw it again all in the same phase, IMO you have earned the right to play it again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1663225","commentId":1663225,"userName":"DukeWellington","timestamp":1434564538,"content":"I would say that it is poorly worded but that it means you can only trigger the effect once per phase, period. So, it would apply to the player, not the card. As a side note, I think if you play a card and then retrieve the card with Dwarven tomb it is now a new card. I don't think it matters that it is the same physical paper. That's just my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1663916","commentId":1663916,"userName":"alogos","timestamp":1434618350,"content":"The faq is refering to card that are in play and can trigger effects, not event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1664213","commentId":1664213,"userName":"Seastan","timestamp":1434641301,"content":"> Desperate Alliance (DA): 1. The card gives a limitation of once per phase, and by FAQ 1.51, this seems to apply only to the copy of the card and not the player. a) So if I have multiple DA in my hand can I give away multiple heroes?\n> \n> b) Can more than one player play a separate copy of DA in a phase?\n> \n> c) If I get back DA from the discard with Dwarven Tomb can I play it again or is it still the same card?\n> \n> d) If I play Will of the West and happen to draw DA again in the same phase, can I play it? I cannot be sure if it's the same card unless it's my only copy...\n\n \n\n> The “limit once per phase” on Desperate Alliance should be treated as “limit 1 Desperate Alliance per phase.” That limit is for all players so that only 1 copy of the event can be played by a player group in a phase.\n> \n> Cheers,\n> \n> Caleb\n\nEdited June 18, 2015 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1680224","commentId":1680224,"userName":"Eu8L1ch","timestamp":1435936629,"content":"Now I have one doubt: from the answer it looks like the \"limit once per phase\" doesn't refer to the copy of the card but to the card itself, i.e. the limitation applies to all cards with the same title. Do you think it is correct?\n\nIf so, would it prevent you from, for example, triggering Protector of Lorien 3+3 times if you had two copies of the card in play, or Gondorian Fire / Blood of Numenor twice?\n\n \n\n \n\nWhat alogos said:\n\n \n\n\"The faq is refering to card that are in play and can trigger effects, not event.\"\n\n \n\nwould go against what I have said, so maybe I'm wrong. Anyway, I don't remember seeing any distinction made between events and allies/attachments in the FAQ.\n\nMay very well be I'm wrong though, just asking for confirmation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1680248","commentId":1680248,"userName":"GrandSpleen","timestamp":1435938582,"content":"It looks to me like Caleb's answer was meant to clarify the intent for Desperate Alliance.  Treat it like an errata for that card, so that it reads more like Tighten Our Belts (\"only one copy of XXX can be played each round\")\n\n \n\nI don't think that was intended to apply to all \"limit X per phase\" on all cards with that text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1683330","commentId":1683330,"userName":"Jban","timestamp":1436220723,"content":"> It looks to me like Caleb's answer was meant to clarify the intent for Desperate Alliance.  Treat it like an errata for that card, so that it reads more like Tighten Our Belts (\"only one copy of XXX can be played each round\")\n> \n>  \n\n \n\n\"only one copy of XXX can be played each phase\" I guess.\n\n \n\nFurther, I guess we should consider this for all \"Limit X per phase\" event cards. So also for Heavy Stroke. I don't see any difference on Desperate Alliance and Heavy Stroke regarding rules.\n\nEdited July 6, 2015 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?do=findComment&comment=1683634","commentId":1683634,"userName":"Seastan","timestamp":1436239019,"content":">  \n> \n> > It looks to me like Caleb's answer was meant to clarify the intent for Desperate Alliance.  Treat it like an errata for that card, so that it reads more like Tighten Our Belts (\"only one copy of XXX can be played each round\")\n> > \n> >  \n> \n>  \n> \n> \"only one copy of XXX can be played each phase\" I guess.\n> \n>  \n> \n> Further, I guess we should consider this for all \"Limit X per phase\" event cards. So also for Heavy Stroke. I don't see any difference on Desperate Alliance and Heavy Stroke regarding rules.\n> \n>  \n\n \n\nNeither do I, but i think Caleb's response was directed to just Desperate Alliance. I think we should ask to get some more clarity on these limits as a whole in the faq, perhaps for for every combination of limit X times per (phase/round/game) on (ally/attachment/event), as it seems like the rules vary for each one."}]}