{"url":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/","title":"where to go next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663538","commentId":1663538,"userName":"spchawk237","timestamp":1434579180,"content":"I have core set, all of 1st cycle, kazad-dum. I have the black riders coming in the mail. I was just wondering if it would be better to finish kazad-dum cycle or go the route of continuing the saga expansions. It will be a couple weeks before I get anything new but figured Id ask what everyone thinks before then. Thanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663552","commentId":1663552,"userName":"Gizlivadi","timestamp":1434579596,"content":"I would personally go with Dwarrowdelf before the sagas. The Dwarrowdelf cycle has some of the best player cards in the game (and the quests are not too shabby) and I would dare say that most of the saga quests were made with those cards in mind. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663576","commentId":1663576,"userName":"SauronTheGreat","timestamp":1434582109,"content":"I would also go Dwarrowdelf.  Remember that the road darkens and the treason of Isengard were made at the same time as the ring makers cycle so therefore, your card bank will get crushed by the other sagas.   The hobbits, on the other hand, would be perfect.  you would get dwarves, which to this day are some of the strongest cards. \nI have been thinking on the same lines as you about expansion and this is a perfect place to ask.\nI have through Stewards fear (sans foundation and watchers and I do have 2 core) and saga through black riders along with the first two GenCon.  I am going to get what I don't have in dwarrowdelf soon I think, but I don't know what to do afterwards.  After checking through the player cards of the rest of the heirs of Numenor Cycle I am less than impressed.  They suck.  But I have heard that the quests are good.  I also love the saga Idea and plan on getting all of them as they come out, but I don't know when I'll have the money to do so.  Where should I go next?\nThx\nSauron the Great"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663622","commentId":1663622,"userName":"Ecthelion III","timestamp":1434585405,"content":"Road Darkens (second saga box) is my favorite box in the game. I would get that one asap. However, the third saga box has some pretty brutal quests so I would recommend getting Dwarrowdelf before that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663666","commentId":1663666,"userName":"Khamul The Easterling","timestamp":1434589019,"content":"Honestly, the Hobbit Saga isn't that good...the quests are weak and the player cards are mainly just dwarf centered. I rarely find myself using almost anything from the hobbit saga these days. Anyway, the Dwarrowdelf is quite good so Id go for that next! And then the rest of the Lord of the Rings Sagas. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180562-where-to-go-next/?do=findComment&comment=1663816","commentId":1663816,"userName":"spchawk237","timestamp":1434604058,"content":"Thanks for all the feedback. I'll probably go Dwarrowdelf first. Then get next saga. I'm really excited to play with the hobbit cards. Might even log into lotro tomorrow while I wait just to visit the shire lol."}]}