{"url":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/","title":"End of Refresh Phase vs End of Round","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1663040","commentId":1663040,"userName":"Seastan","timestamp":1434557419,"content":"Do effects that trigger at the end of the phase, if played during the refresh phase, occur simultaneously with end of round effects, thus allowing the player to determine the order of their resolution?\n\n \n\n1. Could I use Sneak Attack + Gandalf during the refresh phase and choose to discard Gandalf at the end of the round rather than return him to my hand at the end of the phase?\n\n \n\nWhat about when player order is a factor?\n\n2. Could I pass Erestor hero (discard your hand at the end of the round) to another player using Desperate Alliance (Give control of a hero to another player until the end of the phase), then resolve the end of round effect of Erestor to discard that player's hand before I get him back? Who makes that choice, since Erestor is now under another player's control? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1663066","commentId":1663066,"userName":"GrandSpleen","timestamp":1434558189,"content":"Although I don't think it's supported by text, I treat the end of the round as occurring discretely after the end of the refresh phase.  The way I see it, if you're resolving \"end of refresh phase\" effects, the round is not yet over-- the round is over when all phases are done and there are no more effects left to resolve.  So I'd play that 1) a Gandalf entering play via Sneak Attack during the refresh phase would return to your hand, no choice, and 2) Erestor+Desperate Alliance couldn't be used to discard another player's hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1663095","commentId":1663095,"userName":"Seastan","timestamp":1434559033,"content":"> Although I don't think it's supported by text, I treat the end of the round as occurring discretely after the end of the refresh phase.  The way I see it, if you're resolving \"end of refresh phase\" effects, the round is not yet over-- the round is over when all phases are done and there are no more effects left to resolve.  So I'd play that 1) a Gandalf entering play via Sneak Attack during the refresh phase would return to your hand, no choice, and 2) Erestor+Desperate Alliance couldn't be used to discard another player's hand.\n\n \n\nI agree that's a sensible answer, but I think sensible arguments can be made either way. For example, a day consists of 24 hours. I would expect things that happen at the end of every hour and at the end of day to occur simultaneously at midnight. Saying that the day is not over until you finish doing things that are to be done at the end of the hour doesn't make much sense.\n\n \n\nI was just wondering if any ruling has been made regarding this. If not, I can just send an email."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1663694","commentId":1663694,"userName":"ricedwlit","timestamp":1434590994,"content":"To my knowledge no ruling has been mind, so sending in a question to FFG sounds like a good idea.\n\n \n\nFor my part, I agree with GrandSpleen's analysis - end of round items can only trigger after all phases in the round have been completed.  You only need to worry about timing when two separate items both state \"At the end of round\" and for cases such as that we can follow the guideline in the FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1663914","commentId":1663914,"userName":"alogos","timestamp":1434618266,"content":"If I remember correctly, I have an answer from Caleb that say end of the round and end of the refresh phase is the same thing.\n\n \n\nEDIT: I always post so I can click on my sign :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] found http://sdajce.forumactif.org/t2461-question-gandalf-i-et-perte-de-son-texte-imprime-reponse-officielle [http://sdajce.forumactif.org/t2461-question-gandalf-i-et-perte-de-son-texte-imprime-reponse-officielle]but it's in french ^^\n\nEdited June 18, 2015 by alogos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1664077","commentId":1664077,"userName":"GrandSpleen","timestamp":1434636084,"content":"I couldn't read the French part alogos, but the quote from Caleb at the bottom is in English and doesn't mention the refresh phase-- apparently it was in answer to a question of whether Gandalf could remain in play if his text box is blanked by The Nine Abroad, which expires at the end of the round (Gandalf would have to leave play).   Did I miss something else?\n\n \n\nedit: hmm, I see now by looking at your FAQ that you were asking about OHaUH Gandalf, but Caleb's answer doesn't even mention raising your threat as an option.  Maybe he answered about Core Gandalf by mistake?\n\nEdited June 18, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1664096","commentId":1664096,"userName":"alogos","timestamp":1434636801,"content":"The exact question was :\n\n> In the turn we reveal The Nine are Abroad \"Treat the text box of each character in play as blank (except for Traits) until the end of the round\" and we had play Gandalf II (The Hobbit), do we still have to pay for him or discard him at the end of the round ? The trick is that you answered a very similar question I sent you but the text of Gandalf II is not the same as all other cards. Instead of \"at the end of the round\" it reads \"at the end of the refresh phase\". Some players consider it is different than the end of the round so they don't have to pay for Gandalf II.\n> \n>  \n\n \n\nSo... maybe he answered for Gandalf I, but I insisted on the difference end of the round/phase and Gandalf II. I'm quite sure he understood that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1664215","commentId":1664215,"userName":"Seastan","timestamp":1434641380,"content":"> End of Refresh Phase vs. End of Round.\n> \n> Do effects that trigger at the end of the phase, if played during the refresh phase, occur simultaneously with end of round effects, thus allowing the player to determine the order of their resolution?\n> \n> a) Could I use Sneak Attack + Gandalf during the refresh phase and choose to discard Gandalf at the end of the round rather than return him to my hand at the end of the phase?\n> \n> b) Could I pass the upcoming Erestor hero to another player using Desperate Alliance, then resolve the end of round effect of Erestor to discard that player's hand before I get him back? Who makes that choice, since Erestor is now under another player's control?\n\n \n\n> The end of the round comes after the end of the refresh phase. Everything that triggers at the end of the refresh phase triggers before the end of the round. The end of the round and the beginning of the round can be thought of like book ends to the game round and each phase therein.\n> \n> Cheers,\n> \n> Caleb\n\nEdited June 18, 2015 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1664255","commentId":1664255,"userName":"alogos","timestamp":1434643522,"content":"That's... well... ok."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180523-end-of-refresh-phase-vs-end-of-round/?do=findComment&comment=1664265","commentId":1664265,"userName":"GrandSpleen","timestamp":1434644105,"content":"I think he skimmed your other question alogos =)"}]}