{"url":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/","title":"How do sideboards work in organized play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/?do=findComment&comment=1666552","commentId":1666552,"userName":"gsman","timestamp":1434864110,"content":"So I just got the core set and the first 3 shadows of mirkwood expansions. Everything I'm seeing mentions sideboards but I can't find an explanation anywhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/?do=findComment&comment=1667988","commentId":1667988,"userName":"alogos","timestamp":1434987740,"content":"> Everything I'm seeing mentions sideboards but I can't find an explanation anywhere.\n\n \n\n\"Everything\" where?\n\n \n\nIf you're talking about Race Against the Shadow, the only time it is written is for heroes. It says you can basically switch all your heroes from all the possible heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/?do=findComment&comment=1668129","commentId":1668129,"userName":"gsman","timestamp":1434993354,"content":"Everything being every deck list I've seen online and most discussions keep bringing up \"excluding sideboard\", but maybe I'm just looking for sideboard after playing several other card games"},{"commentUrl":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/?do=findComment&comment=1668205","commentId":1668205,"userName":"Ecthelion III","timestamp":1434996345,"content":"A sideboard is the group of cards that aren't part of the deck, but if they are needed in a certain quest you swap them out for cards in the deck.\n\nA good example of a sideboard card is Miner of the Iron Hills. A lot of quests don't have condition attachments, so you don't use Miner of the Iron Hills in those, but when you do you swap him out for cards in the deck.\n\nIt isn't mandatory, it's just something deck-makers do to avoid annoying people going, \"Oh, this deck doesn't have any Condition attachment removal; it must be terrible...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/180828-how-do-sideboards-work-in-organized-play/?do=findComment&comment=1668383","commentId":1668383,"userName":"GrandSpleen","timestamp":1435002258,"content":"The other concern is that you might bring unique cards in your deck that other players are using.  So it's useful to bring some backup cards (your \"sideboard\") that you can swap into your deck when you know someone else is going to be using a unique that is in your deck."}]}