{"url":"https://community.fantasyflightgames.com/topic/180927-your-saga-campaign-so-far-and-any-highlights/","title":"Your Saga Campaign so far and any Highlights","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/180927-your-saga-campaign-so-far-and-any-highlights/?do=findComment&comment=1667750","commentId":1667750,"userName":"PsychoRocka","timestamp":1434977187,"content":"Just started a new campaign and am almost back up to date.\nThought I would share my new results and highlights of my games and encourage you to do the same. I know this topic already exists but this time I elaborated a little more on each quest and how I went against it as well as how many attempts it took to beat. I'm very interested to hear more detailed descriptions of how others have fared as well and any tricks or awesome moments you have experienced.\n \nTWO HANDED CAMPAIGN\n \nWarriors of Eriador: Sam, Elladan and Elrohir\n28 Starting Threat\n \nElven Finesse: Elrond, Glorfindel (S) and Haldir\n27 Starting Threat\n \nQUEST 1 - A Shadow Of The Past\nScore of 61\nCampaign Pool Choices:\nBoons: Gildor Inglorian (shuffled into encounter deck)\nBurdens: The Ring Draws Them (shuffled into encounter deck)\nHighlights/Notes:\n-Beat it on the second attempt as first attempt I had a nasty failed hide attempt result in a dead hero during the first turn (all the Elven Finesse heroes were exhausted so the attack was undefended).\n-Played both copies of Gather Information during stage 1 and was able to gather two needed cards for each deck.\n-Gildor Inglorian objective ally appeared fairly early on and was very helpful.\n-Was able to travel to Buckleberry Ferry immediately upon arriving at stage 3 as I was able to quickly clear one location in staging with Asfaloth, cleared a second with Stage 3's effect that places progress on a location after succeeding at the hide test you take upon arriving at stage 3 due to a Black Rider being added to staging and only the Ferry was left in play. Failed the hide 3 test you must take to travel there but was easily able to fend off the Nazgul in play.\n \nQUEST 1.1 - The Old Forest\nScore of 81\nCampaign Pool Choices:\nBoons: Old Bogey-Stories earned by placing 12 damage tokens on Old Man Willow (attached to a hero during setup)\nHighlights/Notes:\n-Beat on the first attempt. Was actually easier than most games against this quest as I didn't have many nasty treacheries appear.\n-Both decks were close to threating out by the end due to Old Man Willow's nasty threat raising effect while attacking but I was able to both quest to victory and get 12 damage tokens on him before threating out.\n-Gildor Inglorian objective ally showed up again mid game and was immensely helpful.\n \nQUEST 1.2 - Fog on the Barrow Downs\nScore of 58\nCampaign Pool Choices:\nBoons: Ho, Tom Bombadil! (added to the first players hand during setup)\nHighlights/Notes:\n-Beat on the first attempt.\n-Each deck explored a Great Barrow. One appeared during staging and then the second was added to staging from the effect on Standing Stones. Normally more than one barrow can spell disaster for my decks but all the changes to my decks since I last played this quest really payed off and I was able to easily explore 2 great barrows without worrying too much about losing. One trick was to keep allies in your hand for late game so that when a whole handful get discarded when you get trapped in a Great Barrow you can replace a few of them.\n-I did not have Sentinel set up on Elrohir till late game and when one is in a great barrow the two decks are alone anyway so instead used Gildor (lore ally) with a Cloak of Lorien attached late game as the main defender for the Elven Finesse deck and he was amazing at this.\n-Each deck got out of the great barrow it was in within 2 turns.\n \nQUEST 2 - A Knife In The Dark\nScore of 74\nCampaign Pool Choices:\nBoons: Valiant Warrior (attached to Haldir during setup), Noble Hero (attached to Sam during setup)\nHighlights/Notes:\n-Beat on the first attempt.\n-Haldir smashed Bill Ferny's face in over a few turns and The Prancing Pony allowed The Warriors of Eriador deck to get Legolas (ally) out for free.\n-Managed to cancel or take the other option on every card that tries to shuffle a Nazgul into the encounter deck. Also did not let the effect on Midgewater trigger once and so only had to fight the Witch King and the two Riders of Mordor.\n-Easily killed the two Riders and explored Weathertop. Then killed the Witch King over two turns to gain victory.\n-Mid game Elrond ended up with a copy of Black Breath on him but at that point I had enough questing and combat power out so this was fairly unimportant.\n-Gildor Inglorian objective ally appeared but I had used Frodo's resources to help play Gandalf that turn so could not pay a resource at end of turn to keep him in play.\n \nQUEST 3 - Flight to the Ford\nScore of 58\nCampaign Pool Choices:\nBurdens: Panicked! (shuffled into encounter deck)\nHighlights/Notes:\n-Beat on the first attempt.\n-This one was a cake walk and I beat it quickly and effectively. Only took the one burden as well. Ring Bearers life was 9 when I beat the quest (beat it on the sixth turn and also had a treachery remove one life)\n-First turn I killed one Fell Rider and left the other on one hitpoint thanks to Sneak Attack Gandalf during the combat phase. Killed the second with a Quick Strike from Elladan with Dagger of Westernesse attached (played first turn) during planning on the second turn to stop it from engaging the other deck. Having both Riders out of the way it was easy to then advance to Stage 2.\n-Used the Ford of Bruinen to discard the Witchking from play. Then destroyed a second Ringwraith and quested to victory the following turn.\n \nQUEST 4 - The Ring Goes South\nScore of 81\nCampaign Pool Choices:\nBoons: Glamdring, Anduril and Sting (shuffled into player decks during setup)\nHighlights/Notes:\n-Beat on the first attempt.\n-Avoided Lust for the Ring by raising each decks threat by 5.\n-The effect on stage 1 allowed me to put Legolas (ally) into play for free (Exact same card as the free ally I got out in A Knife in the Dark from The Prancing Pony) and add Lembas to the Elven Finesse deck's hand. I discarded Feigned Voices and shuffled a Hasty Stroke back into the Elven Finesse deck.\n-Avoided many extra damage tokens being put on locations by either killing enemies in staging with Haldir or before they could attack (Warg that places damage on the active location when it attacks) with Haldir.\n-Already had the Warg Chieftain in play when I got to Stage 3 and was easily able to kill him and the rest of his pack.\n-Eventually had two Fast Hitches, Sting, Dagger of Westernesse, Dunedain Mark and Noble Hero attached to Sam and turned him into an absolute killing machine. One on turn he helped kill two enemies attacking both with 6 attack strength (his boost, mark, daggers boost and sting) and on another turn he did the same but with only 4 attack strength. He was also questing for 5 each turn. This combined with Elladan with a dagger of his own and Haldir with Valiant Warrior, Glamdring, Dunedain Mark AND a Rivendell Blade meant ANYTHING that came at me died the same turn and my decks were performing at more or less full potential combat wise.\nLots of card draw and starting with Sting and Glamdring in hand made this possible and I got lucky drawing almost every weapon and attack buff in the Warriors of Eriador.\n*Did not use Mithril Shirt and will not be including it in my decks for following Saga quests as I find it more or less useful and a dead card.\n \nQUEST 5 - Journey in the Dark\nScore of 76\nCampaign Pool Choices:\nBurdens: Overcome by Grief (added to staging during setup) and Pursued by the Enemy (shuffled into encounter deck)\nHighlights/Notes:\n-Beat on the second attempt. Conceded during the first game as I knew I could not escape before the Balrog appeared and that is my goal for this quest.\n-Somehow managed to beat this quest and avoid the Balrog on the second attempt. I guess I have gotten very good at this particular challenge. Had to use Ho, Tom Bombadil again however to do so and also like the other two times I have managed this had only a single counter left on Doom, Doom, Doom. Did not draw any copies of Test of Will though and got fairly lucky with treacheries. I did have alot of archery and treachery damage trigger however and a second turn Warden of Healing was hard at work throughout the entire game healing both decks characters.\n-Asfaloth clearing a Darkened Stairway during planning on first turn and it not being replaced by another location is key to my strategy as is saving enemies during stage 1 to kill when you arrive at stage 2 so that you are able to kill 6 enemies much faster and advance to stage 3 in time.\n-Both other times I beat this quest whilst avoiding the Balrog I had a first turn Sneak Attack and Gandalf but this time I managed it with out these cards first turn.\n*Only two burdens taken as I managed to finish the quest before the last counter on Doom, Doom, Doom was removed so the Balrog never entered play.\n*Ho, Tom Bombadil removed from the campaign pool to cancel \"Fool of a Took\" to help avoid The Balrog and escape Moria before it appeared.\n \nQUEST 6 - Breaking of the Fellowship\nScore of 68\nCampaign Pool Choices:\nBurdens: Ill Fate\nHighlights/Notes:\n-Beat on the second attempt. Lost the first due to too much archery damage and getting stuck on Stage 1 too long.\n-Chose the Stage Orc Hunting for The Warriors of Eriador deck and the stage The Seat of Amon Hen for the Elven Finesse deck.\n-Managed to explore seat of seeing and remove a burden which was exactly what I wanted to achieve in this quest.\n-Elrond had Fallen Into Evil attached but it was removed by a power of orthanc, a copy of ranger spikes already in play kept him in staging until Fallen Into Evil could be removed\n*Explored Seat of Seeing and was able to remove Overcome by Grief from the campaign pool.\n*Sam and Haldir chosen as the Captives\n \nQUEST 7 - The Uruk Hai\nScore of 63\nCampaign Pool Choices:\nBoons: Intimidation (attached to Haldir during setup), Forewarned (attached to Elrohir during setup)\nHighlights/Notes:\n-Beat on the second attempt\n-Had trouble with this one and it was an uphill battle until the end.\n-Managed to kill both Ugluk and  (only one damage was done to Haldir and then I slew X)\n-The pursuit value was 24 when I won, just one under the requirement to get the boons. It was at 26 at one point but killing a handful of enemies allowed me to lower it back down to 24.\n*Haldir and Halbarad were the captives for this quest. \n \nQUEST 8 - Helms Deep\nScore of 77\nCampaign Pool Choices:\nHighlights/Notes:\n-Somehow beat it first attempt.. got insanely lucky and pulled off some crazy stuff but used up the Three Golden Hairs boon as well.\n-Purely used Fellowship Aragorn and his resources to quest and constantly ready other heroes, namely Haldir or Sam to make extra attacks and kill extra foes each turn.\n-Early game Warden of Healing and travelling to The Hornburg location on multiple occasions minimizing archery kept archery damage far lower than I've encountered before in this quest.\n-Turned Haldir into an absolute killing machine and had valiant warrior, intimidation, dunedain mark, rivendell blade and unexpected courage attached to him by mid game. I was also using Fellowship Aragorn's ability to ready him on certain turns allowing him to dispatch 3 enemies in one combat phase on two occasions as well as countless others.\n-Samwise had Noble Hero, Sting and Anduril attached towards the end and was questing for 6 and then occasionally attacking for 4 or 5 (no fast hitch so he only made attacks early game from his own effect readying him after questing or late game when Aragorn was able to ready him on occasion)\n-Elrohir became an absolute beast defender with Elven Mail, Cloak of Lorien, Gondorian Shield, Steward of Gondor and Forewarning attached and was able to defend for both decks with ease late game. Early and mid game I did not have Steward of Gondor but saved resources on him when I could and this along with Feint and Feigned Voices as well as Haldir sniping an enemy almost every turn was just enough until I got Steward out. His Defense was always very high due to having the Deeping Wall as the active location on two occasions as well as Gondorian Shield from turn one and the other attachments following over the course of the game. Also Forewarning is insanely good and is my 3rd favorite boon so far behind Anduril and Sting.\n-Managed to cancel one Devilry of Saruman and had the other appear towards the end of a turn (after the combat phase due to a stage effect) rendering its main effect useless!\n-Advanced from Stage 3 (with no progress on it!) straight to Stage 5 avoiding Stage 4 altogether\n-Managed to beat it without a single Gandalf ally card drawn or used!\n-Asfaloth trick (which I earned from recent podcasts) to clear certain locations towards the end of a round avoiding their nasty effects from doing anything was extremely useful\n-Managed to use two feigned voices on the same Naith Guide as well as two feints stopping many enemy attacks over the course of the game.\n-With INSANE luck managed to cancel the only copy of Night Without End that appeared during the game with the only copy of Test of Will I drew all game. During planning that round I played Henamarth and used him to look at the top encounter card and revealed Night Without End leading me to save a resource on Glorfindel for Test of Will instead of playing Arwen as well. Had I not checked I may well not have saved a resource for Test of Will and may very well have lost had I not been able to cancel the treachery.\n-Towards the mid/end of the game with 6 tokens (not positive but almost sure it was at this point) on Defense of Helms Deep I decided that threat was just getting way too high for both decks and I had very few cards in both decks hands. This as well as knowing I would soon advance to Stage 5 (if I did not threat out or lose in another way, loss of a hero for example) and would not be able to reduce threat for the last few turns on Stage 5 made me decide to use Three Golden Hairs. Both decks reduced threat by 3 and I drew Sneak Attack, Gimli and Steward of Gondor for the Warriors of Eregion and Arwen, Galhadrims Greeting and Hasty Stroke for Elven Finesse. Greeting, hasty stroke and Sneak attack were useless but Gimli and Arwen were both extremely handy providing some last extra points of willpower for the last 2 rounds before getting to Stage 5 and Steward allowed Elrohir to defend all attacks during the last three rounds.\n-Killed the last three enemies on Stage 5 the turn after arriving there and ended the game with the decks on 45 and 44 threat\n*Avoided earning any copies of Poisoned Counsels by starting on Stage 2A\n \n\nQUEST 9 - Road to Isengard\n\nScore of 74\n\nCampaign Pool Choices:\n\nBoons: Palantir of Orthanc (attached to Fellowship Aragorn)\n\nHighlights/Notes:\n\n-Beat it on the second attempt only because I conceded the first attempt after it took 3 turns instead of 2 to get all ents and then 5 cards were revealed instead of 3 due to two surge effects on enemies (Two Isengard Orcs, not surge but I revealed two extra cards instead of discarding). This was a rough start and I decided I could do better and on the second attempt did so and only took 2 turns to get 2 ents under each decks control and only 2 encounter cards revealed from the stage effect.\n\n-Beat stage 5 on the third turn I was there, travelled to Orthanc immediately upon arrival and did 11 damage to Saruman thanks to Haldir (valiant warrior and used up black arrow), Glorfindel and Fellowship Aragorn (readying himself to join in the attack). I then quested out of Orthanc the next turn and then on the last turn quested with a whopping 38 to instant victory (20 progress placed on Stage 3B) with 7 damage still on Saruman (had four removed from his two staff attacks over the two resource phases that occurred whilst at Stage 3)\n\n-Both decks had 4 cards in hand at the end specifically to avoid Sarumans Voice and earn the Palantir.\nHad any effects forced me to discard any cards in the last turn I would have earned Sarumans Voice as well.\n\n \n\n \n\nCampaign Pool:\n\nBoons: Noble Hero on Sam, Valiant Warrior on Haldir, Sting, Anduril, Glamdring, Phial of Galadriel, Old Bogie Tales, Intimidation on Haldir, Forewarning on Elrohir, Palantir of Orthanc\n*Used Ho, Tom Bombadil to escape Moria before the Balrog appeared\n*Three Golden Hairs used during Helms Deep\nBurdens: The Ring Draws Them, Panicked, Pursued by the Enemy, Ill Fate\n*removed overcome by grief from the campaign pool via Seat of Seeing\nEdited June 28, 2015 by PsychoRocka"}]}