{"url":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/","title":"New Second Breakfast article","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670649","commentId":1670649,"userName":"Gizlivadi","timestamp":1435161926,"content":"https://www.fantasyflightgames.com/en/news/2015/6/24/second-breakfast-at-the-edge-of-angmar/ [https://www.fantasyflightgames.com/en/news/2015/6/24/second-breakfast-at-the-edge-of-angmar/]\n\n \n\nAt last! What did you think? I personally love this idea of the day/night mechanic, very evocative, I kinda wish this had been part of the core rules of the game. The enemies look fun too. Also, kudos to the designers for starting a Second Breakfast series with all the scenarios of the cycle, I'm looking forward to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670658","commentId":1670658,"userName":"Qaanaaq","timestamp":1435162520,"content":"Wonderful thematic mechanic. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670661","commentId":1670661,"userName":"Glowwyrm","timestamp":1435162788,"content":"Yep.  Love the creativity they're showing in the designs.  Sounds like a fun scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670671","commentId":1670671,"userName":"Teamjimby","timestamp":1435163300,"content":"Loving the day/night.  That is my favorite part of Stone of Erech, so I'm glad to see it returning.  It's a slightly different implementation (alternating versus getting progressively worse), but this could still be very cool.  Maybe during the day you are more likely to spend that last spirit resource during planning instead of saving it for a Test of Will.  I like how it works with the Blood Thirsty Warg where if you see him during the day you can wait, but you know he will attack at night."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670679","commentId":1670679,"userName":"Gizlivadi","timestamp":1435163570,"content":"The fact that the enemies are wolves and thus pretty much ruled by whether it is day or night is a thematic home run.\n\n \n\nTeamjimby, the Nightfall objetctive says that while it is night, encounter card effects cannot be canceled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670722","commentId":1670722,"userName":"Teamjimby","timestamp":1435165871,"content":"> Teamjimby, the Nightfall objetctive says that while it is night, encounter card effects cannot be canceled.\n\nI had forgotten that the objective was partially spoiled before.  Progress also can't be made on the quest during the night.  Now I'm even more excited, because these kind of effects are awesome.  It really changes the flow of a normal game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1670947","commentId":1670947,"userName":"Olorin93","timestamp":1435175289,"content":"This sounds really great! I'm excited to experience the Day/Night mechanic. Also looking forward to more info on Mount Gram already - the hero in it hasn't been spoiled, for one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1671046","commentId":1671046,"userName":"gandalfDK","timestamp":1435179079,"content":"Sounds very cool! Weather remains a big thing in Tolkien, but this Day/Night is even more a thing, how awesome!\n\nWhen Frodo et al travelled with Strider, the pace of their travel was xetermined by the same thing, Weather Top being a good example. Light or at least Daybreak always seems to be a eucatastrophic moment in Tolkiens works. Everytime evil gets beaten essentially, it becomes Day/the Darkness fades!\n\nCool mechanic with the Enemies, really like a pack of Wolves is hunting you. In our world, these creatures hunt in similair ways. Sadly we don't have Wargs.\n\nLooking forward to the next articles, a pleasent surprise!\n\nThematic homeruns all the way, looking forward to Mount Gram!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1671484","commentId":1671484,"userName":"PsychoRocka","timestamp":1435214559,"content":"Great article and amazing art on both the objective cards and the various warg enemies. Great read and I do love that they are going to do a \"second breakfast\" article for each AP explaining the mechanics and lore behind each quest but I feel like they should have released this a fair while back... instead of right after we know Wastes of Eriador is finally shipping after a massive delay and are desperate for spoilers for it. They easily could have included just a single player card (even from another AP doesn't even need to be from Wastes of Eriador) to sate us and give us something new to discuss before the pack is released/revealed. They could have included a deck list, more exciting encounter cards, anything more than just several paragraphs about wargs and the day/night mechanic (without even actually showing us the two objective cards, Daybreak and Nightfall) would have been nice. Especially since the mechanic was already more or less spoiled.... \n\n \n\nGiving us a very brief explanation of the quest a week out from release after it being on the boat forever just seems like a massive cop out to me personally. I think we all would have preferred new nightmare decks being announced, news for the last AP (which last time I believe came out before we even had the first AP) of Angmar Awakened or pretty much anything other than an article that really when you get right down to it does not tell us anything new or exciting other than what they based the art off (badlands) and two very unexciting warg enemies (the third we had already seen). All the rest of the information they give us we already have in one way or another (all the day/night mechanics except for the fact you alternate between them each turn were spoiled when the pack was first announced).\n\n \n\nNow this being said I am quite excited for the article for Mount Gram and the lore and mechanics behind it as they haven't really shown us much at all for that one and this mountain jail sounds incredibly epic. I just hope that it doesn't come out RIGHT before Mount Gram is released...  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited June 25, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1671528","commentId":1671528,"userName":"tricil","timestamp":1435219349,"content":"I think the timing and content of this preview article is just perfect. It's a nice little teaser with some impressive art, nothing more and nothing less. I am sure that other announcements will follow regardless, so I disagree with any complaints. Keep up the second breakfasts and release them anytime you want! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1671865","commentId":1671865,"userName":"Authraw","timestamp":1435245196,"content":"Does anybody else feel like the \"prison break\" reference was a tip of the hat to Cardboard of the Rings?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181104-new-second-breakfast-article/?do=findComment&comment=1672725","commentId":1672725,"userName":"Glaurung","timestamp":1435320498,"content":"Yes that mechanic are really good! Very thematic and now you must really prepare for the night time. Some really cool new features in that cycle!"}]}