{"url":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/","title":"Armour and wounds","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/?do=findComment&comment=1674120","commentId":1674120,"userName":"alexbobspoons","timestamp":1435481024,"content":"Im fairly sure that if a hero has citadel plate plus say seven wounds, if they then lose-attachments then the plate goes, the wounds remain (because the card text doesnt say the wounds are attached to it) and thus then the hero has seven wounds and dies.\n\nHowever, thematically i see the reason the plate adds wounds is because a sword strike that would cause a deep gash in an arm (a wound) instead damages the armour and its the armour that absorbs the wound, thus if the armour is discarded the wound would go with it.\n\nThematically it seems a bit of a shame the card text doesnt say wounds can be attributed and attached to the citadel plate rather than the character (which would then call into doubt if they would add to gimlis card effect because \"he\" wouldnt have the wounds).\n\nAny thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/?do=findComment&comment=1674305","commentId":1674305,"userName":"Seastan","timestamp":1435503327,"content":"It's an interesting thematic point that you make. Can a healer heal wounds that were attributed to the plate? Thematically, I guess not. I think it would add too much bookkeeping, and it was just simplified to add hit points for the sake of gameplay. I guess I think of the plate absorbing part of the impact of each hit, so it takes more hits to bring my hero down. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/?do=findComment&comment=1674570","commentId":1674570,"userName":"alexbobspoons","timestamp":1435522718,"content":"Yes good point.\n\nThe mechanics of this game work so well thematically that its nice to tie up loose ends sometimes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/?do=findComment&comment=1675020","commentId":1675020,"userName":"jnicol","timestamp":1435578720,"content":"I think you are correct that when Citadel Plate is removed any damage beyond the hero's HP remains on the hero and immediately kills them. Which makes Citidel Plate quite dangerous unless you have another attachment on the hero which you can remove when a instructed to do so.\n\nThematically Citadel Plate should boost defence, since that's what armour does. But without all that extra damage we'd miss out on Gimili's battle rage, so theme be damned!\n\nEdited June 29, 2015 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181343-armour-and-wounds/?do=findComment&comment=1675570","commentId":1675570,"userName":"alexbobspoons","timestamp":1435602212,"content":"> I think you are correct that when Citadel Plate is removed any damage beyond the hero's HP remains on the hero and immediately kills them. Which makes Citidel Plate quite dangerous unless you have another attachment on the hero which you can remove when a instructed to do so.\n> \n> Thematically Citadel Plate should boost defence, since that's what armour does. But without all that extra damage we'd miss out on Gimili's battle rage, so theme be damned!\n\nYup pretty much agree there.\n\nAlso just to add for thematics, ive never considered that citadel plate gives EVERY piece of a \"full set\" of armour, thus thematically having two on a character (restricted) still makes sence. Eg Card one give breastplate and groin whereas card two gives arms and legs.\n\nEdited June 29, 2015 by alexbobspoons"}]}