{"url":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/","title":"My wife and I played this game for the first time!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1674261","commentId":1674261,"userName":"chipset35","timestamp":1435500161,"content":"Last night my wive and I played the first quest in the LOTRs: TCG.\n\nShe is new to all things gaming, and  I had never played a FFG game before.\n\nSince we were learning we took it slow, and it is amazing how much fun we had after just 2 turns.\n\n \n\nHere is what happened:\n\n \n\nI played Gimli, Legolas, and Thalin; while she played, Eowyn, Dunhere, and Eleanor.\n\nWe started with the first quest; \"Passage thru Mirkwood\", where you have to bring an urgent message to Galadriel.\n\n \n\nOn the first turn, the quest makes you place the \"Forest Road\" card and a Spider in the staging area.\n\nThus, as we traveled down the road,  and encountered the Spider, both Legolas and Eowyn engaged and easily killed it.\n\nHowever, both Legolas and Eowun were slightly injured (91 HP).\n\nAs a result, we successfully explored that road and made quest progress.\n\n \n\nThen, we came to a \"Fork in the Road\", where upon we were assaulted by Dol Guldor Orcs.\n\nMy wife committed Dunhere and I committed Thalin, and his Ally a Rohan Horse Archer.\n\nUnfortunately, The Necromancer has a far reach and did some damage to all of us, which prompted my wife to not engage Dunhere.\n\nAs a result, the burden fell upon Thalin and his Ally the Rohan Horse Archer.\n\nBut sadly, the Necromancer extended his reach yet again and did more damage killing the Rohan Horse Archer and further injuring Dunhere and Thalin.\n\nUpon fighting the Dol Guldor Orcs, Thalin was unable to kill them by himself, and was further injured.\n\n \n\nHence, both Thalin and Dunhere are at half health, the Orcs are down 3/4 health, and had my wife committed Dunhere to fight the Orcshe would have died, so she made the right decision as just those two Necromancer Reach's hurt him alone and without the attacks of the Orcs.\n\n \n\nSo at this point, we are still at the Fork in the Road, with half of the Dol Guldor Orcs blocking our passage, but will finish the quest hopefully tonight when we continue playing.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1674613","commentId":1674613,"userName":"Narsil0420","timestamp":1435526402,"content":"Welcome to an awesome game! Co-Op really appeals to the ladies, it's one of the few games my wife plays with me.\n\n...or did before we had a kid..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1674642","commentId":1674642,"userName":"jnicol","timestamp":1435528183,"content":"It sounds like you are having a blast playing your first game! There is no way I could convince my missus to play LoTR LCG with me, but I've got my 5yo son in training to become my playing partner!\n\nThe rules for this game are somewhat fiddly and reading through your play through notes I notice a couple of rules you may have overlooked:\n\n- The Old Forest Road and Forest Spider are placed in the staging area during setup, but you still need to reveal 1 card per player from the encounter deck during Step 2 of the first round's Quest Phase. For a long time I mistakenly assumed that the setup encounter cards replaced this first encounter card draw, and it sounds like you might have made the same mistake?\n\n- Were Legolas and Eowyn injured by the Forest Spider in the same turn? An enemy can only attack one character, so during combat you would have declared one character as a defender and that character would have taken all damage from the spider's attack. You are then free to attack the spider with any characters that are not exhausted from questing or defending. (As a side note, Eowyn's 4 willpower and weak combat stats means that she's best used for questing rather than fighting).\n\nBefore I played my first game I watched a YouTube video of someone playing a game, which helped me get the turn sequence straight. I've been playing for about 6 weeks now and I still make mistakes though!\n\nLet us know how the rest of the quest plays out :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 29, 2015 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1676600","commentId":1676600,"userName":"chipset35","timestamp":1435668327,"content":"> It sounds like you are having a blast playing your first game! There is no way I could convince my missus to play LoTR LCG with me, but I've got my 5yo son in training to become my playing partner!\n> \n> The rules for this game are somewhat fiddly and reading through your play through notes I notice a couple of rules you may have overlooked:\n> \n> - The Old Forest Road and Forest Spider are placed in the staging area during setup, but you still need to reveal 1 card per player from the encounter deck during Step 2 of the first round's Quest Phase. For a long time I mistakenly assumed that the setup encounter cards replaced this first encounter card draw, and it sounds like you might have made the same mistake?\n> \n> - Were Legolas and Eowyn injured by the Forest Spider in the same turn? An enemy can only attack one character, so during combat you would have declared one character as a defender and that character would have taken all damage from the spider's attack. You are then free to attack the spider with any characters that are not exhausted from questing or defending. (As a side note, Eowyn's 4 willpower and weak combat stats means that she's best used for questing rather than fighting).\n> \n> Before I played my first game I watched a YouTube video of someone playing a game, which helped me get the turn sequence straight. I've been playing for about 6 weeks now and I still make mistakes though!\n> \n> Let us know how the rest of the quest plays out :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYou are 100% correct.\n\nWe finished the game Sunday and I realized all the mistakes me made on Saturday.\n\nThen after we finished Sunday, we reviewed all the mistakes we made then as well.\n\nIt is a learning process, but we sure had a ton of fun while learning it.\n\nOne thing I am not clear on is how do you determine who the enemy attacks.\n\nI keep reading the rulebook, but it makes no sense what they are saying about it.\n\nCan you explain how that works to me?\n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1676665","commentId":1676665,"userName":"jnicol","timestamp":1435671360,"content":"It is indeed a learning process! It takes quite a few plays before the turn sequence becomes automatic.\n\nI'm quite a new player so I'm sure someone can do a better job of explaining combat but I'll give it a shot.\n\n1. Optionally engage an enemy. Each player can choose to engage 1 enemy, regardless of its engagement cost.\n\n2. Engagement checks. The rule book has an example of how engagement checks work in a multi player game, but the gist of it is that any enemies with a engagement cost lower than or equal to a player's threat level will engage the player. Players take turns making engagement checks and engaging one enemy at a time, starting with the enemy that has the highest engagement cost, until all the eligible enemies are engaged with a player. If an enemy has a higher engagement cost than every player's threat level it stays in the staging area. Note that an enemy engages one player only, not all the players.\n\n3. Declare defenders. During the combat phase each player can declare 1 character to defend against each enemy they are engaged with. That is the character the enemy will attack. The character will be exhausted from defending, so if you want to attack the same enemy you will need to use a different character as an attacker. Note that defending is optional, but if you do not declare a defender then the attack is undefended and the full damage must be taken by a hero.\n\nHopefully that makes it s little clearer how to determine which player an enemy engages, and which character it attacks.\n\nEdited June 30, 2015 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1677751","commentId":1677751,"userName":"alexbobspoons","timestamp":1435744311,"content":"Yes if you take an attack undefended its straight damage to a hero, not an ally, so can be brutal, so its nice to exhaust a character as a defender against the attack, but then as that character is exhausted you usually need a different character to carry out your retaliation attack on the enemy in the same turn.\n\nGlad you are having fun"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1678250","commentId":1678250,"userName":"chipset35","timestamp":1435777354,"content":"> 2. Engagement checks. The rule book has an example of how engagement checks work in a multi player game, but the gist of it is that any enemies with a engagement cost lower than or equal to a player's threat level will engage the player. Players take turns making engagement checks and engaging one enemy at a time, starting with the enemy that has the highest engagement cost, until all the eligible enemies are engaged with a player. If an enemy has a higher engagement cost than every player's threat level it stays in the staging area. Note that an enemy engages one player only, not all the players.\n> \n>  \n\nThat is where I am confused.....the game starts with player Threat Levels in the 20s, on the dials with Saurons eye.\n\nWe only add and dont take away to that, so the enemy will always be less than that as they are single digits''''\n\nEdited July 1, 2015 by chipset35"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1678378","commentId":1678378,"userName":"PocketWraith","timestamp":1435784646,"content":"> That is where I am confused.....the game starts with player Threat Levels in the 20s, on the dials with Saurons eye.\n> \n> We only add and dont take away to that, so the enemy will always be less than that as they are single digits''''\n\nIt seems like possibly you're confusing the enemy's threat with their engagement cost.\n\nTake for example the Hummerhorns [http://hallofbeorn.com/Cards/Details/Hummerhorns-Core]. Their threat is 1, but this is usually only relevant to questing past them in the staging area, as you compare your willpower to the threat of the encounter cards. However their engagement cost is 40, so you're not forced to engage them until you reach 40 threat (and it's generally a good idea not to since the forced effect usually amounts to killing a hero).\n\nEdited July 1, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1678426","commentId":1678426,"userName":"divinityofnumber","timestamp":1435788703,"content":"> Yes if you take an attack undefended its straight damage to a hero, not an ally, so can be brutal, so its nice to exhaust a character as a defender against the attack, but then as that character is exhausted you usually need a different character to carry out your retaliation attack on the enemy in the same turn.\n> \n> Glad you are having fun\n\n \n\n\"Undefended\" attacks can be even more dangerous also due to many shadow cards increasing the attack strength of enemies. This makes it difficult to determine exactly how much damage one of your heroes will be taking. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1679370","commentId":1679370,"userName":"alexbobspoons","timestamp":1435863002,"content":"Above yes very very good point!!\n\n \n\nAlso something to add: I see from your avatar you like 40K Terminators (Space Hulk?), well I have been a fan of Games Workshop products for about 30 years from 1st edition 40K and 3rd Ed Fantasy. I have to say, while Space Hulk is one of the best boardgames ever, I fully think that LOTR LCG is better!!!\n\n \n\nOnce you get a handle on the scope of how many different quests there are, its just awesome.\n\n \n\nGetting used to the rules and the difficulty of 2/3 core set quests is pretty hard but once around that, gosh it opens up amazingly.\n\n \n\nEnjoy enjoy enjoy!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181361-my-wife-and-i-played-this-game-for-the-first-time/?do=findComment&comment=1679391","commentId":1679391,"userName":"chipset35","timestamp":1435864056,"content":"Thanks for all your help!"}]}