{"url":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/","title":"What do you think Thranduil will be like?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675579","commentId":1675579,"userName":"legolas18","timestamp":1435602489,"content":"I'm really surprised we haven't gotten him yet. Personally, I think he'll either be Tactics or Leadership... But what do I know. It would be cool to see him have some ability to go along with Legolas. Then we could have Father and Son themed decks! Legolas and Thranduil... Denethor and Faramir and Boromir... Gloin and Gimli... Theoden and Eomer... Bilbo and Frodo (even though technically he's his nephew)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675639","commentId":1675639,"userName":"GrandSpleen","timestamp":1435604508,"content":">  Theoden and Eomer...\n\n \n\nAlso uncle/nephew (Theodred was Theoden's son)\n\n \n\nI'd like to see Thranduil in the Leadership sphere and interact with the Silvan trait in some way.  Maybe with Silvan heroes.  I like Silvans a whole lot, but there is no compelling reason to bring Silvan heroes along when you play them (other than Celeborn of course), as all their power comes from the allies and their events."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675643","commentId":1675643,"userName":"Fingolfin Fate","timestamp":1435604640,"content":"I think at least one variant of him is bound to be Leadership. It just goes well with the king. Before Celeborn I had thought Thranduil would give Silvan boost. Now, it would make little sense. Maybe he could give a single character bonus (by choice), or reward for destroying enemies just like his son. I feel he will have \"only\" 2 willpower because Legolas has 1, 3 attack, maybe 2 defense, probably 4 hp. 11 threat cost seems about right for such a Leadership icon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675650","commentId":1675650,"userName":"Gizlivadi","timestamp":1435604804,"content":"He would be a failed hero if he was leadership and worked with silvans. How could he ever replace Celeborn? I think he'll either be a non-trait-specific hero, or, if he works with silvans, he should be lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675651","commentId":1675651,"userName":"Fingolfin Fate","timestamp":1435604840,"content":"You posted just as I was typing. Yes, Silvan hero boost would make sense, too. I was thinking something like:\n\n \n\nQuest Response: After Thranduil commits to a quest, choose a Noldor or Silvan hero committed to the quest; that hero gets +1 willpower.\n\nCombat Response: After Thranduil is declared as an attacker, choose a Noldor or Silvan hero participating in this attack; that hero gets +1 attack.\n\nEdited June 29, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675657","commentId":1675657,"userName":"GrandSpleen","timestamp":1435605013,"content":"There's nothing preventing you from putting both Celeborn and another leadership Silvan into your deck (who said anything about replace?), but I see your point.  Silvan tends toward tri-sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675679","commentId":1675679,"userName":"Gizlivadi","timestamp":1435605667,"content":"As an exclusively solo player, running 2 leadership heroes in a thematic silvan deck would be dumb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675690","commentId":1675690,"userName":"Narsil0420","timestamp":1435606051,"content":"Something defensive might be appropriate. The hobbit movies especially played on how reclusive and xenophobic he is. He is kind of like Denethor in some ways and it would make sense to see him as a defense focused hero. Maybe he has an ability to reduce damage to silvans or boost defense. I would say deal damage to himself to boost defense but Treebeard already stole that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675771","commentId":1675771,"userName":"Teamjimby","timestamp":1435609120,"content":"Even for non-solo players, there aren't enough leadship silvan cards to justify two leadship heroes.  I agree that Lore would be best if he has Silvan synergy.  Celeborn is great, but pretty much only in Silvan decks.  I'd like to see a Thranduil that is more versatile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1675813","commentId":1675813,"userName":"player1922162","timestamp":1435610166,"content":"Thranduil Spirit 3w 3a 3d 4h threat 13\n\nForced: Pay one resource for any action Thranduil takes, Thranduil then readies automatically. (Limit 3 times per turn)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676109","commentId":1676109,"userName":"Authraw","timestamp":1435626669,"content":"How about this:\n\nThranduil (Lore) 2W 2A 3D 4HP 11T\n\nAction: If there is currently no active location, choose a Silvan ally in play. Return that ally to its owner's hand to immediately travel to any non-unique location in the staging area. (Limit once per phase)\n\nEdited June 30, 2015 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676150","commentId":1676150,"userName":"PsychoRocka","timestamp":1435628727,"content":"Pretty surprised we haven't already gotten him as well. Quite strange he does not appear as a hero during the Hobbit Saga Boxes but then again the game was early and all focus was on dwarves for those boxes. Plus the hobbit saga quests are just terrible in general. \n\n \n\nI think he will be spirit or tactics. He did fight in the Battle of Dagorlad with his father Oropher and if I remember correctly from the Atlas of Middle Earth (which I was recently reading) he and his fathers forces (Amdir's too) pushed far ahead and were cut off and faced terrible odds. His father was slain and after the war he inherited leadership of his Fathers Kingdom. The fact he survived after his father fell and their forces were cut off and surrounded means he must be a fairly excellent Warrior. Just being a part of the War of the last Alliance is a fairly big deal too. I've loved Thranduil's character ever since I read up on his history.\n\nHe lost his father and many of his kin (perhaps more than any other Elven force) during the War of the Last Alliance and is forever scarred emotionally by this. Hence his reluctance to involve his people in others affairs. Hence his hidden kingdom and its over the top security and secrecy. Ultimately however during the War of the Ring he holds off Sauron during the Battle of the Trees and is victorious doing his part for Middle Earth and the free peoples. \n\n \n\nAn ability that SOMEHOW (how this would be done is beyond me) reflects the fact that he is so reluctant to get involved in others affairs and is so strongly protective of his own people and land would be awesome. Perhaps something that raises each other players threat by 1 to provide a strong ability to the player controlling him?\n\nSomething else that would be really cool (perhaps overpowered however) is a Noldor or Silvan Hero that has something along the lines of: \"All Silvan and Noldor Characters gain Ranged\" as their ability and decent stats. Powerful yes but as the only ability on a hero some might even argue this as not that powerful as its useless in Solo and as powerful as it could be in multiplayer the hero still does not have any other abilities so it could be balanced enough to work. Not sure if this would fit well on Thranduil though.... \n\n \n\nOh! Also a similar ability to tactics Merry but defensive instead might be cool:\n\"Whenever Thranduil exhausts to defend an attack deal one damage to him to ready a Noldor or Silvan character you control (Limit once per round)\" or \"After Thranduil exhausts to defend an attack and does not take damage you may ready a Noldor or Silvan character you control (Limit once per round)\" \n\n \n\nI think we will see him in this cycle for sure. I really feel like he is the last main character we don't have a player card for.\n\nYes we don't have Cirdan yet but he isn't really that prominent in Lord of the Rings or the Hobbit whereas Thranduil is big time. \n\nWe have Arwen in ally form, Bombadil in objective ally form, even Quickbeam!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676262","commentId":1676262,"userName":"legolas18","timestamp":1435638349,"content":"Oh foolish me. How could I forget about Theodred. Thank you for catching my mistake sir!\n\nI don't think he will be Spirit. Or Lore. He doesn't seem that type of person. I think Tactics, since he was very tactically minded, what with all his defensive decisions and stuff. I imagine him with stats kinda like 1/2/3/4, and then some ability to either boost hit points or defense of Silvans."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676467","commentId":1676467,"userName":"Fingolfin Fate","timestamp":1435657001,"content":"Excellent review, Psychorocka. The Atlas of Middle-earth is one of the few publications on the subject matter I am yet to read. It is hard to get in my country, I might just have to order it from abroad. I would like Thranduil to have a combat ability for sure. I know my suggestion above is pretty bleak. And it is true not all the kings and leaders end up being in Leadership (Théoden, Denethor, even Elrond), and we should see more variations on the major characters anyway.\n\n \n\nThranduil is really long-overdue. I really thought we would see him in the Return to Mirkwood, a long, long time ago. Then there was another chance in the Hobbit saga. And pretty much any time since in the cycles. Him and Círdan, and Tom Bombadil with Goldberry, the last major characters yet to appear as player cards, I feel. But for some reason, I think Thranduil might have to wait another cycle yet. We will see Erestor and I believe Círdan too this cycle. Then it might be enough from the Elven department (there is Merry, one or two Dúnedain, and they usually throw a more distant hero into the mix as well)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676523","commentId":1676523,"userName":"PsychoRocka","timestamp":1435662468,"content":"Could not recommend the Atlas enough. The pages on the various battles throughout the three ages and how they played out are just amazing as is the rest of the book really. I actually hadn't seen your suggestion properly or had skipped over it somehow. As simple as it is I like that he would be able to provide both the small willpower boost and small combat boost each turn with readying. That extra point of attack (or willpower too really) could be a game changer early game. Simple but cool idea. What you are saying does make sense and we may only get Cirdan this cycle indeed but I have to say I hope you are wrong :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nI wonder what other heroes we will get this cycle.... any additional dunedain heroes need to be FFG created as we do not have any others that are named in the books (during the era the game is set during at least). There actually aren't really that many characters we haven't seen yet so we might see more new versions of existing heroes other than just Merry this cycle.\n\nIf we do see other new versions of existing heroes who would you like to see new versions of? (minus Elladan and Elrohir as I feel many already want to see new versions of them this cycle or next and it has been discussed before)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676541","commentId":1676541,"userName":"Mndela","timestamp":1435664288,"content":"A very thematic action effect of Thranduil card could be the spirit Pippin text, but without his bug. Something like:\n\n \n\nAction: Each player raise his threat by 3. Then, until the end of the phase, enemies do not engagement checks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676586","commentId":1676586,"userName":"Fingolfin Fate","timestamp":1435667468,"content":"As for the heroes in this cycle, after Merry in pack 1, they did mention (if I remember correctly) that we are getting a Lore hero in pack 2. I think that one might be Círdan. And he will be the center stone for the scrying decks. Then, in pack 3 we are getting a defensive Tactics hero. Well, he may well be Thranduil but I still think not. Then again, Gondor and Rohan characters have been the case of late. Perhaps Gamling? Then we get Erestor in pack 4. Then a Dúnedain Leadership hero in pack 5. And then the big finale? Not Lore, since there will be two already. Leadership and Tactics will have one plus the deluxe, so I think it will be a Spirit hero. And now I want to say Noldor because the cards they mention with the discard mechanic, they are Noldor-themed and often Spirit (see Wastes of Eriador preview). Hmm, but that could really fit Círdan even better? And Gildor could be the Lore hero in pack 2, the ally version works with the player deck, so it could be the hero does with the encounter. Too much speculation, I know, but what is there to do when boats and lorries are snails."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1676590","commentId":1676590,"userName":"Fingolfin Fate","timestamp":1435667739,"content":"> Could not recommend the Atlas enough. The pages on the various battles throughout the three ages and how they played out are just amazing as is the rest of the book really. I actually hadn't seen your suggestion properly or had skipped over it somehow. As simple as it is I like that he would be able to provide both the small willpower boost and small combat boost each turn with readying. That extra point of attack (or willpower too really) could be a game changer early game. Simple but cool idea.\n\nThanks for the compliment. I find the fan-ideas for heroes (or cards in general) often too bombast. And there have been such cards in the game from the start but I like the more subtle approach. I also enjoy cards that help to strengthen theme -- not only factions but spheres or traits in general. We need to see more cards focusing on Warrior, Ranger, Scout and Noble. There are some already but I want more. And then some more.\n\nEdited June 30, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181453-what-do-you-think-thranduil-will-be-like/?do=findComment&comment=1677108","commentId":1677108,"userName":"DukeWellington","timestamp":1435690822,"content":"I think there should be a thematic link with Legolas, so maybe he can help Silvans put threat on quest from combat.\n\nEdited June 30, 2015 by DukeWellington"}]}