{"url":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/","title":"Dominating Archetypes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1676971","commentId":1676971,"userName":"Eu8L1ch","timestamp":1435684778,"content":"Lately, I've been wondering about which archetypes of decks are the strongest, and dedicated myself to trying my best with most of them.\n\n \n\nSo my question is: what deck archetypes do you think are the strongest?\n\n \n\nIt's not necessary to rank them, but rather to enumerate those that are really set aside, because of their power level, from the vast majority of the other decks/archetypes.\n\n \n\n \n\nThe contenders I've analysed/considered so far:\n\n \n\n- Dwarves (any)\n\n \n\n- Hama+Events (MP)\n\n \n\n- Elrond+Vilya (Solo?)\n\n \n\n- Outlands (Solo?)\n\n \n\n- Doomed (+LoreAragorn) (Solo?)\n\n \n\n- Gandalf Hero (Solo)\n\n \n\n- Silvans (Any?)\n\n \n\n- TacticsAragorn+Merry (MP)\n\n \n\n- Boromir+GondorianFire/BloodofNumenor (Solo?)\n\n \n\n- RangedSilvans(Haldir/Legolas)+Weapons+Events (MP)\n\n \n\n \n\n \n\nAm I missing anything? What would you add? Is there anything that makes you think one is stronger than another, or one of those is not worthy of inclusion?\n\n \n\n \n\nQuick notes:\n\n \n\n- Merging these archetypes is fair game, if the resulting deck is stronger; for example, Doomed Outlands.\n\n \n\n- I have a feeling most of these refer to Solo play (with a few exceptions); for example, I am reasonably certain Gandalf decks are much better while playing solitaire than in multiplayer. On the other hand, Tactagorn+Merry is clearly much better in 3-4 P games.\n\n \n\n \n\n \n\n \n\n \n\nThanks to anyone who would reply!\n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\n \n\nEdited to add new archetypes.\n\nEdited July 2, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1676987","commentId":1676987,"userName":"Fingolfin Fate","timestamp":1435685425,"content":"For me, Silvan is the most powerful deck in coop, which I prefer. Glorfindel, Elrond, Gandalf, so the Vilya Gandalf combo, is the most powerful in solo.\n\n \n\nI dislike playing Dwarves and Outlands but they are obviously both very strong. For Outlands you have more options, in a way, I mean choosing the heroes. You can go mono-Leadership with Tome of Atanatar and Lord of Morthond, or you can (again) have Glorfindel and Elrond.\n\n \n\nI know here the players tend to differ a lot but I am among those who do not find the Tactics Merry and Aragorn very powerful. Those decks tend to very little, I find.\n\n \n\nLore Aragorn is another matter, with Doomed (Gríma, Denethor, scrying deck is very good) or Tactics Boromir.\n\n \n\nOh, and Háma mono-Tactics is super powerful in coop. Almost to a point it makes the encounter deck look stupid -- especially on the more combatant quests. Add Mablung and Beorn, for instance, and the dreadful Helm's Deep is suddenly almost a given (the other deck just needs to quest and maybe cancel a treachery or two).\n\nEdited June 30, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677005","commentId":1677005,"userName":"chrsjxn","timestamp":1435686506,"content":"Doomed LoreAgorn + Outlands honestly feels like an exploit. You basically get to draw your whole deck, generate a ton of resources in exchange for threat in the combat/refresh phase, and then start the game over with a ton of strong allies in play. It doesn't always work, but when it does, it's absurd."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677094","commentId":1677094,"userName":"DukeWellington","timestamp":1435690379,"content":"I think all the major power deck styles are so strong that it really doesn't even matter which is more strong,especially since it depends on what quest you are up against. Dwarves are insanely powerful, with erabor battle master they can one shot bosses like smaug in lake of fire. Hama/Gandalf with perpetual feint is so good it feels like cheating. There is a Boromir/Galadriel deck that uses gondorian fire and blood of numenor to use a gigantic Boromir to crush everything. That deck hardly ever loses. There are many variations on the green \"draw your entire deck\" style. There are just a lot of power decks and they are all crazy powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677110","commentId":1677110,"userName":"Eu8L1ch","timestamp":1435690912,"content":"> I think all the major power deck styles are so strong that it really doesn't even matter which is more strong,especially since it depends on what quest you are up against. Dwarves are insanely powerful, with erabor battle master they can one shot bosses like smaug in lake of fire. Hama/Gandalf with perpetual feint is so good it feels like cheating. There is a Boromir/Galadriel deck that uses gondorian fire and blood of numenor to use a gigantic Boromir to crush everything. That deck hardly ever loses. There are many variations on the green \"draw your entire deck\" style. There are just a lot of power decks and they are all crazy powerful.\n\n \n\nWould you mind trying to recall those who are not in the above list I made? Would be very helpful!\n\n \n\nFor example, do you think Boromir+Blood/Gondorian qualifies? Also which kind of \"draw your entire decks\" you mean - what they plan to achieve? Song/Love of Tales decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677155","commentId":1677155,"userName":"DukeWellington","timestamp":1435692691,"content":"I would just say Boromir decks in general are an archtype. There are tons. The problem with remembering the ones you forgot is that there are so many. It helps that you are talking about archtype instead of decks, but once you allow for hybrids (which you should) then it is brutal to compile an exhaustive list. I'm not just saying that as a cop out, I'very tried it.\n\nYes, the song/love of tales green decks are another power deck type. They can abuse ravens and blades of gondolin for progress outside of quest phase for quick victory, ignoring most of the quest deck, only good against some quests.\n\nIf you expand to multiplayer then Gondor team decks can be powerful. There are team decks that abuse the twins (elladan, Elrohir). There are tactics aragorn/Hama decks that suck in all the enemies and use spears to kill everything. There are Haldir decks in multiplayer that basically kill everything. See what I'm saying?\n\nBasically, there are tribal decks (silvan, dwarf, outland, etc.) And hero decks (loragon, boromir, gandalf, hama) and combo decks (doomed, love of tales) and there are hybrids, but they can all be teched up to dominate whatever quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677236","commentId":1677236,"userName":"Fingolfin Fate","timestamp":1435696296,"content":"Well said above.\n\n \n\nSpirit Glorfindel and Tactics Boromir themselves make up for a very strong archetype. Their spheres match each other perfectly, and Glorfindel threat cost with Boromir's ability. Just the threat cost plus Elrond's Counsel will make Boromir more brave."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677409","commentId":1677409,"userName":"Eu8L1ch","timestamp":1435705658,"content":"@Duke\n\n \n\nIt looks like, to me, some of those decks/archetypes you mentioned above are very strong (Love of Tales, since it works only for selected quests) but not outstanding to the point of really dominating; some of the others instead are not archetypes but just heroes, since I don't think in general Heroes are archetypes on their own.\n\nFor example, why I don't think Boromir is an archetype whereas Gandalf is: because Gandalf brings you answers to all aspects of the game, by allowing you to play the strongest/most useful cards from all spheres, thus helping both with combat and questing; he can accelerate your resources with steward, bring you attacking power with flame of anor, card draw with expert treasure-hunter and so on. This qualifies for being an archetype, since most Gandalf decks will look the same (ofc it's not enough to have Gandalf in a deck to make it a Gandalf deck).\n\nBoromir is very powerful, but only helps with combat and this only in Solo play, since in multi (esp 3/4) ranged and sentinel are going to be an issue: it can be solved, but this is to say I don't think that Boromir is a (dominating) archetype on his own, while I think Boromir surely is a very powerful Hero.\n\nThis is my point of view - in particular, I didn't forget to put Boromir, I don't think he was to be put in - but I appreciate you shared your views.\n\nFor example, Boromir and Glorfindel is something I haven't tried yet (mainly because I have another kind of Boromir deck that works very well, with doomed cards and Loragorn), so that's already been helpful since I'm going to try that next, seeing as you consider it worthy of being compared with very powerful decks like dwarves or outlands (thanks Fingolfin as well).\n\n \n\n\"There are team decks that abuse the twins (elladan, Elrohir).\"\n\n \n\nDo you know of Twins decks that could be considered dominating? They don't seem too popular in my group (which is made by players with a lot of experience, so I tend to consider their judgments carefully), and I couldn't come up with anything very powerful involving them. Not saying a good deck cannot be made with them, it's just that I think they're not close to the power level of the other decks; might be there's something I'm missing ofc.\n\n \n\n \n\n\"There are Haldir decks in multiplayer that basically kill everything.\"\n\n \n\nAre you talking about ranged Silvan(Legolas, Haldir)+weapons+events+foehammer archetype? I didn't list it in since it's good mostly for 3-4p, and even then they're better than their rivals but not as good as Dwarves are compared to other decks. Anyway, they would surely qualify for being the best attacking archetype in 3/4p. Or had you a different kind of deck in mind?\n\n \n\n \n\n \n\n \n\n\"Basically, there are tribal decks (silvan, dwarf, outland, etc.) And hero decks (loragon, boromir, gandalf, hama) and combo decks (doomed, love of tales) and there are hybrids, but they can all be teched up to dominate whatever quest.\"\n\n \n\nI mostly agree, anyway my goal was precisely to isolate those tribes, heroes and combos that were so good to be considered clearly above all else - those who find their way in the kind of deck(s) you're bringing when you're playing Nightmare, if you want to put it this way. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nFor example, Gondor is good but hardly as good as Dwarves; Rohan is worse than both (until now, however).\n\nOr think about Eomer/Imra leaves-play decks: they are good but nowhere nearly as good as the most powerful archetypes.\n\nEdited June 30, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677659","commentId":1677659,"userName":"Fingolfin Fate","timestamp":1435733276,"content":"Just a few more thoughts on the Glorfindel-Boromir pairing. It is really quite fun. I think in general the best way to go is with a Lore hero. Lore gives you Asfaloth, Daeron's Runes, Peace, and Thought (Boromir being a great target), or A Burning Brand (which is not always necessary). Aragorn seems natural, but as I posted in the strategy section, I have had great fun using the proxy of Erestor (with Elven Spear, etc.). Then, there is a good case for Galadriel -- I myself haven't tried her because she tends to stick with Celeborn (for many reasons, apparently)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677680","commentId":1677680,"userName":"PsychoRocka","timestamp":1435735526,"content":"Disagree re the Twins. They are powerhouses in the decks I use which have beaten every quest to date except Lake Town and a few nightmare packs (mainly ones that split players apart).\n\n \n\nAll you need is steward, some defence boosts and sentinel and Elrohir can take on the vast majority (if not completely) of defensive duties for all players and can even come out swinging (helping with attacks) at the end. With Elrohir taking on this role other players/decks are able to quest and attack far more efficiently and freely as they do not need to save characters for defense. Elladan is definitely a lot less powerful or useful but can pull off some neat stuff himself.  \n\nMaybe not top tier like Gandalf, Elrond, Glorfindel or Outlands or Boromir, Galadriel, Eowyn but still very powerful in a good deck. Definitely far better in two player or more as they are really not anywhere near as good in solo. \n\nEdited July 1, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677692","commentId":1677692,"userName":"Fingolfin Fate","timestamp":1435736546,"content":"I always wanted to like the Twins. And I do, to an extent. The problem for me is even though I am mostly playing coop, I never make two decks that can only play with each other (for whatever reason), instead I have several decks ready, and pick two (or more) for the group to play. So when I had the brothers, they were always in one deck -- which is of course totally alright, just a little bit of limitation. I think Elven Mail has been made for Elrohir, and I have a feeling we will get some Noldor support in this cycle that will help the twins more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677781","commentId":1677781,"userName":"DukeWellington","timestamp":1435748195,"content":"If you include Gandalf because he helps in all facets of the game then Boromir definitely fits that criteria. He solves a ton of exhaust type treachery effects or quest effects. I guess his questing is a weakness, but he just destroys everything else. I guess I don't understand your point about a hero not being an archtype. If you build a deck all around Loragon with broken sword, that sounds like an archtype.\n\nIn multiplayer it takes very little effort to turn the twins into total powerhouse heroes. It is much more difficult in solo, but on a team you can find all the pieces quickly.\n\nAlso, Gondor is not so good solo, but in multiplayer they can make teams that rival dwarves. An individual deck, no, but a team. I think you have yet to discover just how powerful gondorian flame and blood of numenor really are.\n\nThere are many ways to make Haldir awesome. Once he is decked out enemies just die before combat even starts.\n\nNow maybe you can say that dwarves are the best, but those decks are often a little slower. When you have two decks that both totally destroy a quest, it is tough to say which is better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677881","commentId":1677881,"userName":"Fingolfin Fate","timestamp":1435757220,"content":"Again, I agree with most of the above. Especially about Gondor coop, my favourite. And Haldir the hunter support deck -- he almost gets too good though, so now I just have him with Celeborn and Galadriel in a Silvan theme deck, though his ability does not shine so much in there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677926","commentId":1677926,"userName":"Seastan","timestamp":1435759133,"content":"> Boromir is very powerful, but only helps with combat and this only in Solo play, since in multi (esp 3/4) ranged and sentinel are going to be an issue: it can be solved, but this is to say I don't think that Boromir is a (dominating) archetype on his own, while I think Boromir surely is a very powerful Hero.\n> \n> This is my point of view - in particular, I didn't forget to put Boromir, I don't think he was to be put in - but I appreciate you shared your views.\n\n \n\nI think you've seen this already because you've mentioned it to me before, but I refer you to the deck I posted here: https://community.fantasyflightgames.com/topic/175783-one-deck-to-rule-them-all-nightmare-edition/ [https://community.fantasyflightgames.com/topic/175783-one-deck-to-rule-them-all-nightmare-edition/]\n\n \n\nI think that if a deck can complete every nightmare quest, 80% of them without a loss, then it's archetype should be considered powerful, no? \n\n \n\nMost of the ones on your list can't match the power of a Boromir deck, in my opinion. The amount of people arguing in favour of Boromir here is a testament to that, and many people in the thread I linked pointed to different versions of the deck that had already been posted. It doesn't take anything more than including Arwen in your deck to make it viable for multiplayer. I used it a couple days ago paired with somebody's secrecy deck and we pulled off a win in Carrock Nightmare after advancing to stage 2 on the first turn without breaking a sweat.\n\n \n> my goal was precisely to isolate those tribes, heroes and combos that were so good to be considered clearly above all else - those who find their way in the kind of deck(s) you're bringing when you're playing Nightmare, if you want to put it this way.\n\n \n\nIf a Boromir deck does not qualify, then you might need to make clearer criteria for making your list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1677949","commentId":1677949,"userName":"Fingolfin Fate","timestamp":1435760630,"content":"I can (again) second that. I am a bit biased because Boromir is one of my heart characters from the books but I think I can objectively say Tactics Boromir's decks are pure power. I even think Leadership Boromir is a very strong hero, I feel many player underestimate the importance of the attacking bonus: you know, from round 2 or 3, he easily gives you 3+ extra attack, and the fact the bonus is spread can be beneficial against an enemy swarm as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1678892","commentId":1678892,"userName":"Eu8L1ch","timestamp":1435837368,"content":"> I think you have yet to discover just how powerful gondorian flame and blood of numenor really are.\n> \n>  \n\n \n\nNot really, I even posted a Boromir deck in the strategy section making use of Gondorian Fire (see below).\n\nGondorian Fire+Blood of Numenor+Steward is crazy, but it requires three spheres and it has no backup plan for the first two attachments: if you don't draw them you're left without solutions. So you also need massive card draw (Lore), and it may still happen you won't draw them, at least in the early game.\n\nAnyway, I took note of what you said, and again thanks for your replies, since to me the objective of this thread - hopefully helpful for other people as well - was mostly to know what other people thought to be really powerful, so that I can experiment with it myself.\n\n \n\n \n\n\"Now maybe you can say that dwarves are the best, but those decks are often a little slower. When you have two decks that both totally destroy a quest, it is tough to say which is better.\"\n\n \n\nThat's an interesting point. Anyway, I think it's rarely the case two decks can be considered equal after many attempts on difficult quests. There will surely be losses on both sides, and one can learn from those.\n\nSo maybe if you think two decks are tied for being considered crushingly powerful playing them 3x/5x (the more the better ofc) on 5 very hard quests, with different features, might help to determine which one works best.\n\nIt's not always the case one can say one deck is clearly better than another, but at least from such a testing run you would get a better feel of where the relative weaknesses/strengths lie.\n\nAs for Gondorian/Dwarves, I think there are very good reasons to consider the latter clearly superior (consistency of global boost - Dain, card draw - Legacy of Durin, quality of allies are the main ones).\n\n \n\n \n\n@Seastan\n\n \n\n>  \n> \n> I think you've seen this already because you've mentioned it to me before, but I refer you to the deck I posted here: https://community.fantasyflightgames.com/topic/175783-one-deck-to-rule-them-all-nightmare-edition/ [https://community.fantasyflightgames.com/topic/175783-one-deck-to-rule-them-all-nightmare-edition/]\n> \n>  \n> \n> I think that if a deck can complete every nightmare quest, 80% of them without a loss, then it's archetype should be considered powerful, no? \n> \n>  \n\n \n\n \n\nYes, you're right, I've seen it. I think you also played once a slightly different version in Fog on the Barrow Downs, on OCTGN.\n\nHowever, I think that kind of deck, while being powerful in certain situations, has some shortcomings that prevent it from being as strong as most of the decks I listed above.\n\n \n\nConflict at the Carrock basically asks for Boromir+GondorianFire, same as Three Trials, Shadow and Flame and Battle of Lake Town (the last two not Boromir, just Gondorian Fire). Basically, in every quest featuring boss-like enemies Gondorian Fire is a winner, since in that kind of quest you have time to prepare but need a huge effort in the end; many quests though don't meet these criteria, and for those the effectiveness of this combo will be relatively small (i.e. you could have achieved the same result with different cards, possibly with a smaller effort). So I don't doubt what you're saying, I just think it tells more about the quality of the deck how it fares in quests less suited to its strengths.\n\nAnyway, since you claim at least an 80% win rate on every NM quest, I'll surely give your deck a try very soon. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n \n\n \n\n\"If a Boromir deck does not qualify, then you might need to make clearer criteria for making your list.\"\n\n \n\nFair enough:\n\nFor something to constitute an archetype, it has to provide the general startegy of a deck.\n\nThat strategy needs to regard all aspects of the game [mainly Questing and Combat], if that is a solo deck; or needs to focus on the part of the game the deck is aiming to dominate, if that is a multiplayer deck [ and I might add in this case, it has to keep into account how the missing parts could be filled out (for example, if you play Steward in a Twins deck it means the deck doing the questing will probably have to be Monospirit, so you probably cannot ask them to put in their deck Dunedain Cache)].\n\n \n\nSo an archetype just containing Boromir isn't a proper archetype since, as noted above, you could build tons of Boromir decks.\n\nBoromir+GondorianFire/BloodofNumenor however is an archetype, since you know you're probably running tri-sphere for Steward (or you want some means of splashing in Steward, but then you need good card draw to make it consistent) and Spirit, most likely Glorfindel for low threat; so this means you're going to use Glorfindel + Spirit allies to quest as well.\n\nSo, starting from Boro+GF/BoN you basically can build only two kind of decks: those including Glorfindel and those including Loragorn (the two might overlap of course).\n\nThe above is a Solo archetype.\n\nMultiplayer would need some different considerations: you probably can't count on Steward, you need Ranged and Sentinel. Of course, the duty of getting the needed attachments out can be split between the decks in play, but you're basically asking the other guys to weaken their decks in order for you to do your job properly; while sometimes it can pay off, in general people are not too keen on doing so.\n\n \n\nA final example: my Doomed Numenoreans deck [https://community.fantasyflightgames.com/topic/135386-doomed-numenoreans-solo-multi-3-sphere-aggro-deck/] [https://community.fantasyflightgames.com/topic/135386-doomed-numenoreans-solo-multi-3-sphere-aggro-deck/%5D](Solo deck, or 2P if paired with Monospirit) has Boromir in it, and it has Gondorian Fire too but I would not call it a Boromir+GF deck: it relies on Boromir to repel the initial onslaught and Gondorian Fire for the big kills but what makes it really work, in my eyes, are the Doomed cards coupled with Lore Aragorn, providing early game resources and card draw. Bottom line, if it were for me that deck would fall into the Doomed+Loragorn archetype. A good argument could be made that without Boromir the deck won't do nearly as good, so I guess a different categorisation could work.\n\nIn the end, what matters the most is that we can understand each other.\n\n \n\n \n\n \n\n \n\nI'm going to add ranged silvans to the dominating archetypes for Multi and Boromir+GF/BoN for Solo, ok?\n\nOther suggestions?\n\nFeel free to post your own lists, if you feel like to.\n\nEdited July 2, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1678912","commentId":1678912,"userName":"Fingolfin Fate","timestamp":1435839109,"content":"I am convinced Tactgics's Boromir decks don't require Gondorian Fire or Blood of Númenor to shine. I see them more as bonuses. What Boromir is best at is solving all sorts of problems, especially defence. His 2 defence strength and 5 hit points are a very good start, then you have Gondorian Shield, this single attachment will make Boromir a wonderful defender, but the list goes on and on, Captain of Gondor (both defence and attack), the above mentioned two, the signals, Arwen, Gondorian Discipline as a safety cushion, the new Honour Guard.\n\nLore is the sphere to combo with Boromir, well Lore Aragorn or Spirit Glorfindel really. Lore gives you the card draw: the future Erestor, Runes, Peace, and Thought (really made for Boromir), and if there's no Strider, then Spirit reduces your threat. I would say Leadership is the worst sphere for Tactics Boromir, and you can get the Steward without a Leadership hero (though I don't usually like to take that route).\n\nEdited July 2, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1678950","commentId":1678950,"userName":"Jban","timestamp":1435841201,"content":"- Dwarves (any)\n\n \n\nI guess there is no doubt that Dwarves belong to the strongest factions within the game.\n\n \n\n- Hama+Events (MP)\n\n \n\nHama + events is not that dominating in my point of view. Several reasons for it \n\n \n\n1. in solo and (3+)4-player games you will fall short on several points for me to be considered dominating. Solo ==> Wp will fail,   (3+)4-player games ==> You won't be able to engage sufficient enemies for the mechanic to dominate, since leaving 2 enemies to the other players isn't really dominating. Sure Hammer stroke might help, but you need 3 resources for thicket already and draw is limited.\n\n \n\n2. You need 1 specific card. With draw very limited in mono-tactics (just Foe-Hammer) you need to start with the card basically which is only the case in 57% of your games. So unless you restart a game when this fails, I don't see how this tactic would dominate.\n\n \n\n- Elrond+Vilya (Solo?)\n\n \n\nI guess the last argument (for Hama) also holds for this kind of deck. You basically need Vilya in your start hand. However, the luck dependence in this kind of deck is way less than in the Hama case since you can pair him with Gandalf (Word of command + 63% you start with the card instead of 57%) or/and Galadriel (Mirror of Galadriel + extra draw). Next to that, Vilya is probably the only card I really dislike which might influence my idea on the archetype.\n\n \n\n- Outlands (Solo?)\n\n \n\nOutlands are for me just like dwarves clearly among the strongest archetypes. My Outlands deck s running the Ranger of Ithilien for some ranged support to the other players, which seems to be sufficient when I turned him into an Outland.\n\n \n\n- Doomed (+LoreAragorn) (Solo?)\n\n \n\nClearly for solo games, in multiplayer perhaps also but only if the current Doomed Loragorn deck I'm running is legal.\n\n \n\n- Gandalf Hero (Solo)\n\n \n\nYes for solo, overavarage for 2p, no for 3/4p. Though I must admit, Shadowfax helps a lot in 3/4p games.\n\n \n\n- Silvans (Any?)\n\n \n\nSilvans in my point of view are too fragile for 3/4p games. In solo/2p they are probably among the stronger archetypes.\n\n \n\n- TacticsAragorn+Merry (MP)\n\n \n\nYes, but only for 3/4p.\n\n \n\n- Boromir+GondorianFire/BloodofNumenor (Solo?)\n\n \n\nI guess Boromir isn't that convincing anymore in 3/4p games. He lacks ranged which definitely hurts next to that also for this kind of deck it is just about finding that specific card (Gondorian Fire) which is a massive downside for me.\n\n \n\n- RangedSilvans(Haldir/Legolas)+Weapons+Events (MP)\n\n \n\nProbably also one of the best kind of combat focused decks. With Haldir and Legolas you can choose from so many good weapons, so getting one of them is no problem early game. Next to that I think the only downside for it is that you cannot play it solo, but aside from that a very good archetype. \n\n \n\n \n\n- What am I missing?\n\nThere are clearly some overwhelming combat decks mentioned already but focusing willpower I lack the general Leadership booster deck. I don't know any real name for it (maybe A Broken Sword). But when you run on a mixture of Faramir, A Broken Sword and some 3rd general boost effect which can be Dain, Celeborn, Visionary,.... You are pretty likely to commit loads of 4+ wp characters to the quest. Especially since Faramir and a Broken sword don't limit to factions ,you can pick any ally you like to do the job. \n\n \n\nRecently I tried some fancy Dúnedain archetype which surprised me enormously, I don't know if it is able to be considered dominating. But that question for me still remains open.\n\n \n\nThat's it.\n\nEdited July 2, 2015 by Jban"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1679302","commentId":1679302,"userName":"joezim007","timestamp":1435859717,"content":"> My Outlands deck s running the Ranger of Ithilien for some ranged support to the other players, which seems to be sufficient when I turned him into an Outland.\n\nRanger of Ithilien? Do you mean Ithilien Archer? Ranger of Ithilien is an objective and doesn't have Ranged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1679340","commentId":1679340,"userName":"Jban","timestamp":1435861143,"content":"Yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1679974","commentId":1679974,"userName":"DukeWellington","timestamp":1435920140,"content":"I love how Elrond/Vilya is less risky than Hama because you can pair with Gandalf or Galdriel. Ummmm, can't you pair Hama with Gandalf or Galadriel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1680045","commentId":1680045,"userName":"joezim007","timestamp":1435927530,"content":"> I love how Elrond/Vilya is less risky than Hama because you can pair with Gandalf or Galdriel. Ummmm, can't you pair Hama with Gandalf or Galadriel?\n\nYou definitely can, but if you don't at least have 2 Tactics heroes, you won't be able to afford any of the Tactics events that are worth building this deck around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1680091","commentId":1680091,"userName":"PocketWraith","timestamp":1435929951,"content":"> I love how Elrond/Vilya is less risky than Hama because you can pair with Gandalf or Galdriel. Ummmm, can't you pair Hama with Gandalf or Galadriel?\n\nI personally feel a general rule of thumb is that any deck which relies on specific cards works better with Galadriel.\n\n \n\n> You definitely can, but if you don't at least have 2 Tactics heroes, you won't be able to afford any of the Tactics events that are worth building this deck around.\n\nReally? And what events are those then? Because I always thought it was just a matter of recycling Feint over and over.\n\n(Also Gandalf can count as Tactics playing from the top of the deck)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1811170","commentId":1811170,"userName":"NZEngineer","timestamp":1442893830,"content":">  \n> \n> > I love how Elrond/Vilya is less risky than Hama because you can pair with Gandalf or Galdriel. Ummmm, can't you pair Hama with Gandalf or Galadriel?\n> \n> I personally feel a general rule of thumb is that any deck which relies on specific cards works better with Galadriel.\n> \n>  \n> \n> > You definitely can, but if you don't at least have 2 Tactics heroes, you won't be able to afford any of the Tactics events that are worth building this deck around.\n> \n> Really? And what events are those then? Because I always thought it was just a matter of recycling Feint over and over.\n> \n> (Also Gandalf can count as Tactics playing from the top of the deck)\n> \n>  \n\n \n\nMulligan if no Fient or thicket of spears, hardly ever get none of them both times.\n\n \n\nThicket of spears over and over again works as well, often play it with a blue secrecy questing deck.\n\nFoe-hammer goes in there for card draw to get your cards, + quick strike can work the same as feint.\n\nLast night I got Rohan warhorse on for attacking twice, brought back Foe-hammer then feint.\n\nMerry to untap and recycle again...\n\nTomes for recycling.\n\n \n\nMakes enemies look silly, only had to defend once last night in the whole two player game and that was a chumpy wolf thing. (2nd quest in The Voice of Isengard)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1813667","commentId":1813667,"userName":"C2K","timestamp":1442983972,"content":">  \n> \n> - Doomed (+LoreAragorn) (Solo?)\n> \n>  \n\n \n\n \n\nI think you can categorize this as solo only, because unless everyone else at the table is willing to build around your deck, a Doom deck is unfriendly in a multiplayer game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1813788","commentId":1813788,"userName":"Eu8L1ch","timestamp":1442992477,"content":"Actually there are some tricks that make it viable in MP.. It just asks to be abused, really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1813799","commentId":1813799,"userName":"John Constantine","timestamp":1442993732,"content":"> Actually there are some tricks that make it viable in MP.. It just asks to be abused, really.\n\nCare to share them? Desperate Alliance + Loragorn? Happy Meal + Galadrim's Greeting? Balancing out threat with Took and Song of Earendil?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1813910","commentId":1813910,"userName":"C2K","timestamp":1443001756,"content":"I never said it was impossible, but the players at the table would be playing the game in reaction to your deck, not to their own accord. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181540-dominating-archetypes/?do=findComment&comment=1814031","commentId":1814031,"userName":"Eu8L1ch","timestamp":1443007594,"content":"@John Constantine\n\nSince the first deck I've seen doing this is not mine I don't feel like I can share anything about it because it could go against its creator's wish.\n\nHowever, I've built one deck myself who exploits the same concept, even if it does it in a different way.\n\nMy deck relies on Advanced Warning to neutralize the engagement problem and Desperate Alliance + Dwarven Tomb + Song of Earendil to deal with threating out; I can post the decklist if you're interested into it.\n\n \n\n \n\n@C2K\n\n \n\nNo, those decks are built so that your fellow players will not suffer any negative consequences from that, they will only reap the benefits.\n\nOf course if you want to do that you need a deck completely dedicated to supporting the other players, but it's well worth it if it works.\n\nEdited September 23, 2015 by Eu8L1ch"}]}