{"url":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/","title":"Reaction Series (Wastes of Eriador)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677196","commentId":1677196,"userName":"Fingolfin Fate","timestamp":1435694015,"content":"I have decided to start my own series. And rather than doing it on a blog site, I shall do it here. I will post my immediate reactions to each new release, with updated content once the actual experience sets in.\n\n \n\nWastes of Eriador\n\n \n\nQuest/Encounter Cards\n\n \n\nNothing yet.\n\n \n\nHero\n\n \n\nMerry\n\n \n\nInitial thoughts: This must be good. A perfect fit for a Hobbit secrecy deck.\n\nExperience: It is. In a majority of quests, Merry can single-handedly keep you in the secrecy, especially in coop games.\n\n \n\nPlayer Cards\n\n \n\nIngold\n\n \n\nInitial thoughts: As many Gondor-theme cards, especially in Leadership, this ally does not scream power. But a copy should be justifiable in just about every Gondor deck. Well, in mid-to-end-game, Gondorian decks should have enough resources to make this guy a valuable quester, add Visionary Leadership and/or Faramir, and he will truly shine. In the crucial early hours, however, it is another story.\n\nSecond thoughts: I think it is important enough to say that saga makes this guy even better, every time you are the first player, Ingold has a chance for a bonus willpower. I was recently thinking of an attachment that could \"upgrade\" an ally into a hero status during the game, wouldn't that be fun (Ingold or not)?\n\n \n\nRallying Cry\n\n \n\nInitial thoughts: Obviously made for the chump blocker decks, Gondor or Rohan, as the art suggests. The response can be quite good when you have many resources and the core Gandalf. The Valour action needs some timing but it can be decisive.\n\n \n\nHonour Guard\n\n \n\nInitial thoughts: A welcome new way to cancel damage for Tactics.\n\nExperience: I have been playing this guy since the first preview. It has not always been as good as I had hoped but the safety cushion helps to approach certain difficult situations more boldly.\n\n \n\nRaven-winged Helm\n\n \n\nInitial thoughts: Quite powerful, especially if it is not restricted. It makes Beregornd even stronger, since he is one of the few legitimate targets, and it plays for free on him (without taking one of the restricted spots which usually go to the Shield and Spear). Honour Guard is obviously better as a safety against a sudden direct damage dealt to chump blockers or characters in general.\n\n \n\nCurious Brandybuck\n\n \n\nInitial thoughts: I am in general very fond of cheap allies. This Hobbit seems like a good chump or a decent one-round quester. Of course, one could find ways to help him stay longer, the question is if it be worth it.\n\n \n\nHobbit Pony\n\n \n\nInitial thoughts: Unfortunately, this seems not very good, although it combos with Merry perfectly. Well, I am already contradicting myself. A hard call but I wish the card did a bit more.\n\nSecond thoughts: As suggested below, quest control (and avoiding some exhaustion-punishing treacheries) can be very important, so this is an obvious merit. One probably shouldn't be asking for more for the cost of 0. Similar to Late Adventurer or Don't Be Hasty (which has a far superior art than the other event), only for Hobbits but repeatable, and more easy to fetch.\n\n \n\nEast Road Ranger\n\n \n\nInitial thoughts: Obviously, he might not be very good in a non-side quest deck.\n\n \n\nScout Ahead\n\n \n\nInitial thoughts: I think this card will be one of the centre-stones to the scrying decks, although it seems quite powerful on its own.\n\nSecond thoughts: Whilst I still find this card superb, I am a bit afraid about using side quests. Many recent quests require no lingering about, and the full quest phase devoted to another quest may not always be a good idea. Still, the rewards here seem far greater than on all other spoiled player side quests. And there are some quests where an extra round spent on a given stage is even beneficial (when you're afraid to quest too much).\n\n \n\nRanger of Cardolan\n\n \n\nInitial thoughts: The good thing about this ally is that his stats are good enough, so that you can take the response more as a safety utility. And it is a very good one at that. The fact the card is shuffled into the deck will of course hurt more often than not.\n\nEdited July 1, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677219","commentId":1677219,"userName":"Fingolfin Fate","timestamp":1435695264,"content":"I almost forgot to say, please, feel free to post your own reactions: initial and the updated ones later. It may be fun to see how our views change with times (and games)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677256","commentId":1677256,"userName":"Gizlivadi","timestamp":1435697318,"content":"Totally did not see the side quest part in the Ranger. She's much worse now. Bummer. \n\n \n\nI don't think you have evaluated Ingold fairly. In a deck that previously relied mostly on heroes and tiny fragile allies to quest, this is a very welcome addition I wish I had back when playing Into Ithilien. I really like this ally. for 3 cost in leadership a potential 5 or 6 willpower is insane, not because it is a lot of willpower, which leadership can already muster, but because it is in a single ally with 3 hitpoints. He survives Blocking Wargs which can be huge when he's buffed up to 5 and then 6 with Faramir, all the while your Envoys die. I would have been fine with a 2 hitpoint 2 wp ally to be honest, but if having Galadriel for a turn is already really useful for a quest push, imagine having a permanent ability-less Galadriel with the Gondor trait, that's just great. And the art is pretty cool. He reminds me of all those really secondary characters of Gondor that get mentioned once, like Iorlas, Targon, Hirgon... Ally and hero versions of them would be great, especially Hirgon and the Red Arrow. And we need Bergil still!\n\nEdited June 30, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677276","commentId":1677276,"userName":"Fingolfin Fate","timestamp":1435698116,"content":"This is why I thought such series could be fun. I was having second thoughts about Ingold already as I was typing. And I tried to sum those up actually. I am excited about Igold. I have a soft spot for Gondor. I do still think, however, he is not a very good early card. Of course, not even Gandalf may be in most of the games, so that is not such a big deal. I am eager to try him out.\n\n \n\nBy the way, since we discussed this in another thread, and since you mentioned Denethor elsewhere, in just about every other game I tend to put Denethor ally to a good use. I still hate that such an iconic character doesn't have at least some minor positive ability (like fetching a title attachment upon entering play) but in a deck that either chump-blocks or uses Beregond, Denethor usually doesn't lose more than 1 willpower. It will be interesting to run both him and Ingold and see who does better over the length of time.\n\n \n\nOh, and definitely, the more Gondor, the better.\n\nEdited June 30, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677342","commentId":1677342,"userName":"Bullroarer Took","timestamp":1435701053,"content":"Hobbit Pony is a free repeatable Late Adventurer for Hobbits. It's gold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677359","commentId":1677359,"userName":"Teamjimby","timestamp":1435702430,"content":"> Hobbit Pony is a free repeatable Late Adventurer for Hobbits. It's gold.\n\nI think it's bronze (not quite gold) for a Merry deck, particularly if you don't also have Fast Hitch.  But otherwise I can't see using it much.  Maybe if you have tactics Merry or Frodo and you're not sure if you'll need them for combat.  Most of the time Hobbits quest every round because they don't offer much for combat.\n\n \n\nI guess there is some value for situations where you don't want to make too much progress.  This would give you more flexibility (similar to Nenya).  Also it's a pony, so that's fun.\n\nEdited June 30, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677373","commentId":1677373,"userName":"DukeWellington","timestamp":1435703464,"content":"The reason the pony works for spirit merry is because you want to keep him ready for ability, but if no enemy is staged you can quest with him. It is cheaper than fast hitch, can be fetched with horse breeder and is in color. Generally low stats mean no ready effects on Hobbits so I am inclined to agree with Teamjimby, but I think a mono blue merry deck could include 1 copy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677377","commentId":1677377,"userName":"Fingolfin Fate","timestamp":1435703661,"content":"I think I will always have at least 1 copy of Hobbit Pony in a Hobbit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677418","commentId":1677418,"userName":"Ranger of the Force","timestamp":1435706389,"content":"Ok, I'll have a go:\n\nMerry: I like that he can stabilize threat for secrecy decks, buying you time in order to get your resourcefuls and other secrecy necessities going.\n\ningold: I love playing mono leadership Gondor, so this guy will be a great addition. He's better late game, so I'd start out with maybe one copy to see how he does.\n\nRallying Cry: Another great addition to mono leadership Gondor I think. Bits expensive, but if you use it with Squire of the Citadel, the cost gets knocked down to one.\n\nHomour Guard: Given all the direct damage shadow effects we are getting more of, I think this guy is going to be a staple when using tactics defenders like Boromir or Berigond.\n\nCurious Brandybuck: I like free allies that quest, even if it's just for a little while. I don't think you need resource match for him either.\n\nHobbit Pony: if Merry is one of the center pieces of your deck, I think you run him.\n\nEast Road Ranger: Too expensive outside of mono lore (or using Heir of Valendil) and too situational if side quests go away after this cycle. It might see play in a dedicated scrying deck for multiplayer along with Scout Ahead.\n\nRanger of Cardolan: I really like this guy, cheap ally in a pinch that has some heft. I also like him thematically. Shuffled back into the deck is a drawback, but it won't stop me from playing him.\n\nScout Ahead: I really like this solo and multiplayer. Allows you to know what will be coming and you get to take the nastiest card out to boot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677498","commentId":1677498,"userName":"PsychoRocka","timestamp":1435713824,"content":"> Totally did not see the side quest part in the Ranger. She's much worse now. Bummer. \n> \n>  \n> \n> I don't think you have evaluated Ingold fairly. In a deck that previously relied mostly on heroes and tiny fragile allies to quest, this is a very welcome addition I wish I had back when playing Into Ithilien. I really like this ally. for 3 cost in leadership a potential 5 or 6 willpower is insane, not because it is a lot of willpower, which leadership can already muster, but because it is in a single ally with 3 hitpoints. He survives Blocking Wargs which can be huge when he's buffed up to 5 and then 6 with Faramir, all the while your Envoys die. I would have been fine with a 2 hitpoint 2 wp ally to be honest, but if having Galadriel for a turn is already really useful for a quest push, imagine having a permanent ability-less Galadriel with the Gondor trait, that's just great. And the art is pretty cool. He reminds me of all those really secondary characters of Gondor that get mentioned once, like Iorlas, Targon, Hirgon... Ally and hero versions of them would be great, especially Hirgon and the Red Arrow. And we need Bergil still!\n\nwait how would he have 5 or 6 willpower? It is only heroes YOU control or are you referring to a boost from StwB and ally Faramir to put him from 3 to 5 and then visionary leadership or whatever card it is to give him another +1?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677506","commentId":1677506,"userName":"Gizlivadi","timestamp":1435714574,"content":"Yes, precisely. mid to late game you have 3 wp from the heroes, 2 from the two attachments, and then 1 from Faramir if needed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677544","commentId":1677544,"userName":"soullos","timestamp":1435719435,"content":"Ranger of Cardolan is nice since he typically comes into play before archery, so he can soak a few points before he bounces at the end of the round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677558","commentId":1677558,"userName":"Glowwyrm","timestamp":1435721778,"content":"Three uses for Hobbit Pony not yet mentioned:\n\n1. It's also nice with Fatty, who can throw in his awesome 1 wp to the quest if no enemies are revealed ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n2. It can help the squishy Hobbits avoid direct damage treacheries (Necromancer's Reach, We Cannot Get Out, Blocking Wargs)\n\n3.  You can control your questing by sending just the right amount of willpower after cards are revealed, something that can be very important in recent quests (Sudden Assault, for example)\nIt's a niche card, something to run with Spirit Hobbits and give you a few more tricks up your sleeve, but not really worth throwing in otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677646","commentId":1677646,"userName":"Fingolfin Fate","timestamp":1435732046,"content":"> Yes, precisely. mid to late game you have 3 wp from the heroes, 2 from the two attachments, and then 1 from Faramir if needed. \n\nAnd in the saga, he will often get 1 extra, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677647","commentId":1677647,"userName":"midwestborn86","timestamp":1435732046,"content":"In case you were wondering the missing card on cardgamedb is a (SPOILER ALERT) 2 cost tactic attachment. It is an armor and item called 'Raven-Winged Helm'. It is a limit one per hero and the hero must be a sentinel. It essentially does what the honor guard does. The response effect it has allows it to exhaust to cancel one point of damage dealt to attached hero.\n\nBetween this and an honor guard that is two points of mitigation per round not including defence. It is a good player counter for direct damage as well. Also Erkenbrand may now be able to cancel a shadow effect for free as it doesn't specify a damage source. This must be ffg's player answer or equalizer to enemies getting toughness.\n\nEdited July 1, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677649","commentId":1677649,"userName":"Fingolfin Fate","timestamp":1435732380,"content":"I was thanks. I will update."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677654","commentId":1677654,"userName":"Fingolfin Fate","timestamp":1435732934,"content":"Updated with new content for Raven-winged Helm and Ingold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677657","commentId":1677657,"userName":"midwestborn86","timestamp":1435733102,"content":"Cool, and yes not restricted just a limit one"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677665","commentId":1677665,"userName":"Fingolfin Fate","timestamp":1435734046,"content":"Thanks again mr Midwestborn.\n\n(Now updated with the Pony, too)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677668","commentId":1677668,"userName":"PsychoRocka","timestamp":1435734360,"content":"My reactions are going to be pretty severe, I think too many player cards in this pack are underpowered or coasters....\n \n \nMerry\nInitial thoughts: awesome hero, definitely the best card of the pack. Breathes new life into secrecy, hobbit decks and gives an awesome replacement option for spirit Glorfindel and whats more unlike Glorfindel he will reduce your threat not raise it! \nNot a fan of the art at all (at least it ties in with \n \nIngold\nInitial thoughts: Meh. Even at 3 willpower he isn't that spectacular as his other stats are mediocre. If hes good at one single thing (questing) it would at least be nice for him to be reliable doing so. He can even have 0 will if you have to use all your resources to get badly needed cards out. With global boosts he gets better but hey who doesn't? I guess as just a x1 or x2 of ally in Gondor decks he might be decent but doesn't really bring much to the table other than hitpoints to soak archery and some extra points of willpower. For a unique character seems very lackluster. \n \nRallying Cry\nInitial thoughts: Awesome card. Fantastic for Imrahil or Eomer decks as you can bring back the weenies you let die to ready/boost Imrahil or Eomer. Also anytime a treachery wipes several allies out in one go this can counter the effect and put them all back in your hand. Even just as a single use with the valour effect it is fantastic to save someone who is key to your strategy like Arwen. Another neat trick is using this on Eomund. Let him die or be discarded, ready all rohan characters then return him to your hand and use him again next round. \n \nHonour Guard\nInitial thoughts: We've known about this guy for a while. He's pretty **** cool and very useful when running Beorn Hero. Can replace healing in a deck without lore. Somewhat niche but a fantastic card with awesome art and a great ability. \n \nCurious Brandybuck\nInitial thoughts: horrible... not even expanding on this card. The worst part is that you can't avoid his response so even if you pay the 2 cost for him instead of getting to play him for free you will STILL lose him to the bottom of your deck. In my honest opinion this card is a coaster unless playing a highly thematic hobbit deck or something. \n \nHobbit Pony\nInitial thoughts: Horrible. Great for the new Merry hero but does next to nothing (other than the effect of late adventurer) for every other hobbit hero except Fatty who sucks anyway. Should be called Merry's Pony  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n \nEast Road Ranger\nInitial thoughts: Hmmmmm this one I am hopeful about and think it depends what the leadership and spirit side quests actually do and how powerful they are that will define how useful this ally is. If the player side quests are auto include in a lot of decks then this guy might actually serve quite an important purpose in those decks allowing you to quest through your player side quests far more easily and safely \n \nScout Ahead\nInitial thoughts: One of the key cards to scrying decks as others have mentioned but honestly even in decks that do not feature other cards with scrying I think it will be a very useful card. Getting to search for the one encounter card that is most damaging to your particular play style, deck or even just your current situation in the quest and putting it in the victory display and then putting the rest back in the order you want could potentially win you the game. You can remove the nastiest card, put the weakest shadow effects on top to make combat safe, ensure during staging only locations will come out and so much more.\nGoing to be including this in my decks for sure even if just to see how it runs and how effective it really is.  \n \nRanger of Cardolan\nInitial thoughts: Dissapointed with this ally to be honest. Was hoping he would have a much cooler effect however the effect he has does fit in perfectly with the dunedain mechanic and is insane in a deck using Mablung as the resource you gain from engaging the enemy can pay for the Ranger so even without any resources you will be able to play him if you are using Mablung. He's pretty **** good for 4 as well as he has the same stats as ally Haldir but without Ranged or Sentinel but is neutral not lore so easier to play. I dont know I think I was just expecting something else, something different. \nAlso worth noting is that he can be used in any deck and only his response requires you to control a dunedain hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677671","commentId":1677671,"userName":"PsychoRocka","timestamp":1435734467,"content":"> Cool, and yes not restricted just a limit one\n\nThis makes so much difference!!!! Definitely the power card of the pack IMO. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677678","commentId":1677678,"userName":"tricil","timestamp":1435735198,"content":"I secretly think that Merry is the power card here but some tactics will definitely benefit a lot from Honour Guard and Raven-winged Helm. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677683","commentId":1677683,"userName":"Fingolfin Fate","timestamp":1435735837,"content":"Thanks for playing, PsychoRocka. I am also excited about Rallying Cry, I hope I can use it well. Just mind, the Valour part is an action, so you have to plan it ahead.\n\n \n\nAnd yes, I am so happy Tactics is getting damage-cancelation. It is their thing now, and it seems fit (just as Lore does healing and Spirit retrieval).\n\nEdited July 1, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677693","commentId":1677693,"userName":"PsychoRocka","timestamp":1435736674,"content":"Ah did not notice that. Yeah so really its only good if you are going to chump block or discard allies yourself (like the eagles that discard after an attack etc) as you can't use it after a nasty treachery wipes your board. \n\nCan only be used like this if you know something is coming with Henamarth or Palantir or whatever. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677696","commentId":1677696,"userName":"PsychoRocka","timestamp":1435736722,"content":"> I secretly think that Merry is the power card here but some tactics will definitely benefit a lot from Honour Guard and Raven-winged Helm. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYou are right. I should have specified I meant other than the hero. \n\nMerry is amazing and I really hope we see more low threat cost heroes with low stats but awesome abilities. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677774","commentId":1677774,"userName":"DukeWellington","timestamp":1435747052,"content":"> 1. It's also nice with Fatty, who can throw in his awesome 1 wp to the quest if no enemies are revealed ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nBwahahahaha!\n\nI didn't even consider rally with allies that are discarded automatically! That makes the card a lot better! There are the eagles, the noldor guys, the outrider, the honor guard with valour, Beorn! You could use helm! Helm! Ride to ruin or the silvan abilities. Maybe even Damrod. Just saying..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1677775","commentId":1677775,"userName":"Fingolfin Fate","timestamp":1435747327,"content":"And you know there are allies that want to leave play just to enter again: hello Silvan. My idea is to have a Valour deck (mono or mostly Leadership) on one side and Silvan deck on the other. At the right moment you play Rallying Cry to block with the likes of Galadhrim Minstrel, Naith Guide or Galadriel's Handmaiden, only to have them enter all the stronger next round.\n\n \n\nBy the way, would anyone care scanning and posting the Helm? It would be much welcomed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1678040","commentId":1678040,"userName":"PocketWraith","timestamp":1435765615,"content":"Beorn with Rallying Cry is a confusing one because Rallying Cry says return it to its owner's hand \"instead of placing it in the discard pile\", and Beorn is shuffled into your deck rather than discarded. But he does leave play. So I don't know if that would work or not.\n\n \n\nThe Raven-Winged Helm also sounds cool, but I'm less enthusiastic because the one instance where I really want to cancel damage is hero Beorn and he can't have attachments unless I manage to temporarily blank his text box.\n\nAlso I don't think the Helm would work with Erkenbrand as suggested above, because I think there was a ruling at some point that effects like Erkenbrand and Treebeard don't work unless they actually take the damage. If you cancel the damage, you have not paid the cost of their ability and it doesn't work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1678062","commentId":1678062,"userName":"joezim007","timestamp":1435766300,"content":"> And you know there are allies that want to leave play just to enter again: hello Silvan. My idea is to have a Valour deck (mono or mostly Leadership) on one side and Silvan deck on the other. At the right moment you play Rallying Cry to block with the likes of Galadhrim Minstrel, Naith Guide or Galadriel's Handmaiden, only to have them enter all the stronger next round.\n> \n>  \n> \n> By the way, would anyone care scanning and posting the Helm? It would be much welcomed.\n\n \n\nTrue, but Silvan tends to have plenty of ways to pull allies back into your hand anyway.\n\n \n\n> Beorn with Rallying Cry is a confusing one because Rallying Cry says return it to its owner's hand \"instead of placing it in the discard pile\", and Beorn is shuffled into your deck rather than discarded. But he does leave play. So I don't know if that would work or not.\n> \n>  \n> \n> The Raven-Winged Helm also sounds cool, but I'm less enthusiastic because the one instance where I really want to cancel damage is hero Beorn and he can't have attachments unless I manage to temporarily blank his text box.\n> \n> Also I don't think the Helm would work with Erkenbrand as suggested above, because I think there was a ruling at some point that effects like Erkenbrand and Treebeard don't work unless they actually take the damage. If you cancel the damage, you have not paid the cost of their ability and it doesn't work.\n\n \n\nWith Rallying Cry, I would assume that it only applies to cards that are being discarded, though that might be a good question to send up to Caleb. I think you may also be right about the Helm on Erkenbrand, but it would still help with anyone wearing The Day's Rising, which is great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1678073","commentId":1678073,"userName":"Fingolfin Fate","timestamp":1435766895,"content":"Yes, Silvan are usually fine but still, it is not a bad utility to have. The card certainly grows greatly in power with more players as it works around the table.\n\n \n\nI would say Beorn is not returned to hand because he wouldn't be discarded in the first place.\n\n \n\nAs for Beorn, Honour Guard works for him even if the Helm does not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/?do=findComment&comment=1678076","commentId":1678076,"userName":"Fingolfin Fate","timestamp":1435767058,"content":"> Ah did not notice that. Yeah so really its only good if you are going to chump block or discard allies yourself (like the eagles that discard after an attack etc) as you can't use it after a nasty treachery wipes your board. \n> \n> Can only be used like this if you know something is coming with Henamarth or Palantir or whatever. \n\nYes, it still can. And there have been many instances when I knew (usually thanks to Henamarth, Denethor or Risk Some Light) that I would be losing allies due to a treachery I couldn't cancel."}]}