{"url":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/","title":"Wastes of Eriador Spoilers on CardGame DB","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677129","commentId":1677129,"userName":"Ranger of the Force","timestamp":1435691895,"content":"Was doing some deckbuilding and found all the cards in the deck builder over there. Enjoy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677145","commentId":1677145,"userName":"tricil","timestamp":1435692411,"content":"Good job! Here is a direct link for everyone: http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/angmar-awakened-cycle/the-wastes-of-eriador/ [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/angmar-awakened-cycle/the-wastes-of-eriador/]\n\n \n\nEdit: Previously unspoiled player cards in short:\n\n * A horse for Merry to make sure he can always contribute in the questing phase\n\n * Two allies that can be put into play outside the planning phase\n\n   (one of them being the partly spoiled Ranger of Carolyn from the preview article)\n\n * Two further allies, mainly for questing\n\n \n\nOverall, there are 5 allies in total (including the previously spoiled Honour Guard), one side quest, one event and one attachment. Somewhat of an unusual distribution but looks promising overall.\n\nEdited June 30, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677149","commentId":1677149,"userName":"Ranger of the Force","timestamp":1435692524,"content":"Thanks for posting the link. I got too excited and forgot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677164","commentId":1677164,"userName":"Fingolfin Fate","timestamp":1435692892,"content":"I think the second Tactics card is missing. There are only 8 player cards instead of 9."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677169","commentId":1677169,"userName":"Ranger of the Force","timestamp":1435693116,"content":"Are you counting Merry? I have 9 on my screen counting him and the side quest, but no second tactics card.\n\nEdited June 30, 2015 by Ranger of the Force"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677184","commentId":1677184,"userName":"Ranger of the Force","timestamp":1435693595,"content":"The Hobbit Pony doesn't make sense to me. It would seem to go with Merry, but Merry would be exhausted to lower threat if an enemy showed up, and you have to exhaust the hero and pony to commit to the quest. At first glance I don't find this to be terribly useful, am I missing something?\n\nEdit: nvm, you keep him ready in case of an enemy, if no enemy shows up, you exhaust him and the pony to add his quest. I got it\n\nEdited June 30, 2015 by Ranger of the Force"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677187","commentId":1677187,"userName":"ossderossmane","timestamp":1435693664,"content":"Indeed, the Ranger of Cardolan is number 10, with only 9 cards shown.\n\n \n\nLots of interesting cards, definitely. The Hobbit Pony is clearly designed for Merry, letting you see the encounter card before deciding wether you commit or not. Should also work nicely with Spirit Frodo or any other \"dual use\" hobbit.\n\nCurious Brandybuck is interesting, though probably not staple material. I'm sure there will be some creative uses, playing an ally for free is always interesting. Ingold could be quite strong in the right deck, also good for the sagas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677197","commentId":1677197,"userName":"tricil","timestamp":1435694051,"content":"If I had to bet, my money would be on a Dunedain weapon for the missing Tactic cards. But then again, we could also see something like that later in the cycle. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677202","commentId":1677202,"userName":"Gizlivadi","timestamp":1435694208,"content":"Mostly amazing cards. My favorite of the bunch is Ingold because he works great in Gondor decks, even if he's unique, having a strong questing ally (Denethor ally usually fails because all heroes end up taking some damage in monoleadership), and with a good pool of hitpoints is really good. Imagine having Sword and Visionary Leadership in play, that's 5(!!!) willpower in a single, resilient ally. And next with Veteran of Osgiliath, Gondor will not depend so much on weenies, which is great. My second favorite is the pony, which could eventually replace Fast Hitch in a Hobbit deck. Fast Hitch is still way much better since it can ready a hero (usually tactics Merry) during combat, but mostly it is used for readying after questing, so this is really a good bonus for spirit hobbits. The Ranger of Cardolan which I really anticipated is good, but not great. More of an emergency button since it'll probably take a while to see him again if he's shuffled. I thought th ability would be essentially to put him into play for one phase, since you'll only use one action with him anyway. But maybe that would be too powerful. The rest of the unspoiled player cards are just there for me. I think the East Road Ranger is really good though, since lore lacked a good quester. The 2 attack is just gravy, but that makes the card versatile.\n\n \n\nEdit: just saw the side quest part in the ranger ally. Pretty marginal now.\n\nEdited June 30, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677209","commentId":1677209,"userName":"Fingolfin Fate","timestamp":1435694489,"content":"> Are you counting Merry? I have 9 on my screen counting him and the side quest, but no second tactics card.\n\nThere should be a hero and nine player cards. So I think indeed the second Tactics card is missing. An attachment would be nice, we haven't got many of those here. How I want another weapon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677211","commentId":1677211,"userName":"Ranger of the Force","timestamp":1435694699,"content":"Ok. Yeah a Dunedain weapon with bonuses based on enemy engagement would bet prediction, text-wise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677220","commentId":1677220,"userName":"Zalrus9","timestamp":1435695325,"content":"I'm loving the ranger of Cardolan! The stats are fairly average, but you can reduce the cost with attachments (or through brute resources, because you are probably using leadership) Also, in a pinch, you can just get a blocker/ attacker for a round! This is awesome! I also like that he's not unique! \n\n \n\nOhh... Can't wait for the pack to get on Amazon Prime..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677240","commentId":1677240,"userName":"Teamjimby","timestamp":1435696438,"content":"Hmm.  I'm super excited about Merry and Honour Guard could be fun, but they're old news. \n\n * I can't think of any situation where I would use Curious Brandybuck, but maybe there is a new meta developing. \n * East Road Ranger is pretty underwhelming unless you are playing against a quest with a lot of side quests.  But more Dunedain allies is always good. \n * I like Hobbit Pony, but it's so marginal that I doubt I'll ever use more than 1 copy in a deck.  Maybe it's useful in certain quests where you don't want to have exhausted characters during staging.  Otherwise it's pretty rare (outside of either Merry) that you would not quest with a Hobbit.  Just doesn't seem worth a card slot. \n * Ingold might be my favorite non-Merry card.  Very thematic and it's a more reliable way to get early questing from a Gondor deck.  I also like that it rewards having resources on multiple heroes.  Everything else to date has just been stacking resources on Boromir.\n * Rallying Cry seems too expensive.  The valour action in a late game scenario could be strong, but I doubt I'll ever use it.\n * Ranger of Cardolan has nice stats for a neutral ally.  Ranged or Sentinel would have been nice though.  The ability is interesting.  Kind of like a feint.  Also, he doesn't discard until the end of the round, so he could be useful in a Gandalf-esque way to trigger a Very Good Tale.\n * Scout Ahead is so good in a solo game.  You can rearrange the next 4 cards, which makes long term planning much easier.  Could still be fun in multiplayer.  I like the idea of a deck dedicated exclusively to neutering the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677261","commentId":1677261,"userName":"Bullroarer Took","timestamp":1435697452,"content":"What a great pack for player cards. Really curious about the second Tactics card now. Was it an oversight or is the card just so awesome? Or maybe they gave it to one of the blogs to spoil...\n\nI'm really hoping for a version of Anduril that will work nicely with Tactigorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677268","commentId":1677268,"userName":"Gizlivadi","timestamp":1435697783,"content":"Indeed, I too want unique weapons as player cards. Andúril, Sting, Glamdring, Orcrist all need to be player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677288","commentId":1677288,"userName":"Fingolfin Fate","timestamp":1435698441,"content":"Same here. I am afraid though that those that became boons will not become player cards. Lembas did but it is not unique. I hope to see a Gondor or Dúnedain weapon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677300","commentId":1677300,"userName":"GrandSpleen","timestamp":1435699161,"content":"To the Eyrie [http://hallofbeorn.com/Cards/Details/To-the-Eyrie-AJtR] is a card that never sees the light of day, but Rallying Cry just stomps it into complete oblivion.  Eclipses it in cost and utility.  Only reason ever to use TtE is if you've got more tactics than leadership resources.  But nobody used it anyway, so no big deal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677306","commentId":1677306,"userName":"Noccus","timestamp":1435699504,"content":"Fine set of player cards in this one.\n\n \n\nI really like what they did there with the ranger of cardolan.\n\nHe's like a mini-gandalf with a build in sneak attack, with him going into your deck instead of your hand. Cool beans.\n\n \n\nThe new Merry hero & hobbit pony will see alot of action, I'm sure.\n\n \n\nStill have to make up my mind about east road traveler. Will do that that the end of the cycle when all the side quests are known.\n\n \n\nCurious Brandybuck is just that....curious. But I like the card for what it does: a free 2wp boost for a round or two, or a chump blocker for any player at the table."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677308","commentId":1677308,"userName":"DukeWellington","timestamp":1435699576,"content":"Question about hobbit card. Since you just put him into play, you don't need resource match, correct? So he can be put into every deck. Correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677323","commentId":1677323,"userName":"DukeWellington","timestamp":1435699910,"content":"Hobbit pony seems like a dedicated Merry support card. The ranger seems great for chump blocking, as you can soak some damage for cheap, and if he survives then he basically heals himself as part of leaving play, with horn of Gondor he is essentially free. Rally cry in a chump block heavy valour deck could be great against combat heavy quests. Imagine a dwarf deck using rally to return allies to hand to play again and trigger legacy of durin again, etc. Other than the side quest Dunedain, this looks like a heavy hitting set of cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677333","commentId":1677333,"userName":"Bullroarer Took","timestamp":1435700686,"content":"You do need a resource match for Curious Brandybuck I believe even though you aren't paying for him. There have been precedents. If you have him in a deck with some northern trackers and Asfaloth etc, where you can control the staging locations without removing the active location, he can stay on the table and just add willpower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677356","commentId":1677356,"userName":"Teamjimby","timestamp":1435702141,"content":"> You do need a resource match for Curious Brandybuck I believe even though you aren't paying for him. There have been precedents. If you have him in a deck with some northern trackers and Asfaloth etc, where you can control the staging locations without removing the active location, he can stay on the table and just add willpower.\n\nIs there precedence for a card like Curious Brandybuck?  This is different than a 0 cost card because you are putting it into play (instead of playing it).  I think it's more akin to Elrond and Vilya, which does not require a resource match.\n\n \n\nIf so, the card becomes slightly more interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677364","commentId":1677364,"userName":"Ranger of the Force","timestamp":1435702938,"content":"Resource match is not needed for Sneak Attack, Herald of Anorian, or A very good tale either which would function similarly. You may be on to something. I wonder if the difference though is that these types of cards require resource match to trigger the put into play mechanic and get non-resource match cards in play, in this case you have one less step as you are putting the card into play itself.\n\nEdited June 30, 2015 by Ranger of the Force"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677372","commentId":1677372,"userName":"Fingolfin Fate","timestamp":1435703460,"content":"Surely, you do not need resource match for Curious Brandybuck. As I said in my post, I find him quite good -- at the moment.\n\n \n\nOn a side note, there was a missed opportunity not to trait Tooks and Brandybucks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677381","commentId":1677381,"userName":"Mndela","timestamp":1435703708,"content":"Hobbit Pony is not unique. So you can keep ready all your attached hobbit heroes (in a hobbit deck, of course), waiting for Necromancers, for example, After the encounter cards are revealed, you commit all your heroes, for example Frodo, Merry and Pippin. Depening of the new encounter cards also.\n\nAwesome card for hobbit decks.\n\n \n\nPD: and it is a mount. Breeder is nice!!!\n\nPD2: Fast hitch + Pony + Merry... you can get all you want ^^\n\nEdited June 30, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677391","commentId":1677391,"userName":"John Constantine","timestamp":1435704429,"content":"> On a side note, there was a missed opportunity not to trait Tooks and Brandybucks.\n\nNo, there was not.\n\nEdited June 30, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677486","commentId":1677486,"userName":"PsychoRocka","timestamp":1435713018,"content":"Wait so is there a missing tactics card as well or not?\n\n \n\nI have to be blunt and honest.... these player cards are awful... a handful of them are very very very specific to one hero or one deck type, some are decent but then some of them are just trash...\n\nHonour Guard (who is only useful in certain decks), Rallying Cry, Merry and Scout Ahead are all great but were all already spoiled. I feel like the other player cards in this pack are really really average and some (Curious Brandybuck) are next to useless... I personally am disappointed by the player cards. The only ones I have any interest in are the Sidequest and potentially the lore ally \n\n \n\nLucky the quest itself looks awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677495","commentId":1677495,"userName":"PocketWraith","timestamp":1435713611,"content":"> some (Curious Brandybuck) are next to useless...\n\n2 willpower for free is next to useless?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677527","commentId":1677527,"userName":"GrandSpleen","timestamp":1435717003,"content":">  \n> \n> > You do need a resource match for Curious Brandybuck I believe even though you aren't paying for him. There have been precedents. If you have him in a deck with some northern trackers and Asfaloth etc, where you can control the staging locations without removing the active location, he can stay on the table and just add willpower.\n> \n> Is there precedence for a card like Curious Brandybuck?  This is different than a 0 cost card because you are putting it into play (instead of playing it).  I think it's more akin to Elrond and Vilya, which does not require a resource match.\n> \n>  \n> \n> If so, the card becomes slightly more interesting.\n> \n>  \n\n \n\n \n\nIt's like Emery, but Emery has a built-in discard mechanic if you're bringing the wrong spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677530","commentId":1677530,"userName":"Teamjimby","timestamp":1435717211,"content":"> I have to be blunt and honest.... these player cards are awful...\n\nI think I agree, other than Merry.  Everything else is very situational.  That's not necessarily a bad thing because we don't need power creep with universally good cards.  But even these situational cards seem average in the right situation and very marginal in all other situations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677532","commentId":1677532,"userName":"GrandSpleen","timestamp":1435717736,"content":"I'm happy to see that many players are thrilled by these cards, but I have to admit that nothing really got me excited that hadn't already been spoiled (I like that Honour Guard!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677543","commentId":1677543,"userName":"PsychoRocka","timestamp":1435719212,"content":">  \n> \n> > some (Curious Brandybuck) are next to useless...\n> \n> 2 willpower for free is next to useless?\n> \n>  \n\nHonestly I'd rather pay one resource for Courage Awakened or Spirit Bofur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677587","commentId":1677587,"userName":"Epi Lepi","timestamp":1435724518,"content":"> Wait so is there a missing tactics card as well or not?\n> \n>  \n\n \n\nWe definitely are missing a tactics card, the card ID's jump from 4 to 6. Very strange."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677589","commentId":1677589,"userName":"PsychoRocka","timestamp":1435725162,"content":"We need to find out what this card is!!!! Maybe it is the power card of the pack. The rest (that we did not already have spoilers for) are either extremely situational or just not that good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677597","commentId":1677597,"userName":"Chris51261","timestamp":1435725590,"content":"The suspense is killing me! Someone spoil it, my pack was late! Lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677599","commentId":1677599,"userName":"Glowwyrm","timestamp":1435725916,"content":"I'm a lot more positive overall on the player cards because they are either fleshing out deck types I want to explore or starting new archetypes I find interesting (like the Lore side quest).\n\nThe best comp for Curious Brandybuck is Emery (as GrandSpleen noted), and I believe you need a resource match to play her using her action."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677608","commentId":1677608,"userName":"PocketWraith","timestamp":1435728174,"content":"> > > some (Curious Brandybuck) are next to useless...\n> > \n> > 2 willpower for free is next to useless?\n> \n> Honestly I'd rather pay one resource for Courage Awakened or Spirit Bofur.\n\nI'd rather play ally Elrond than Miner of the Iron Hills, but I wouldn't describe the Miner as 'next to useless' just because there's an alternative I consider to be better...\n\n \n\n> The best comp for Curious Brandybuck is Emery (as GrandSpleen noted), and I believe you need a resource match to play her using her action.\n\nOn the contrary, I'm certain you don't. Why would you?\n\nPeople have even included her in decks because of the idea of putting her into play in non-Spirit just to trigger Horn of Gondor/Eomer/Imrahil on demand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677614","commentId":1677614,"userName":"GrandSpleen","timestamp":1435728552,"content":"Yeah you shouldn't need a resource match to play Emery any more than you need one to play a Sneak Attacked ally or one put into play via Elf-stone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677623","commentId":1677623,"userName":"midwestborn86","timestamp":1435729398,"content":"Got it yesterday early for my birthday today (Kazoo Sounds) The missing card is my favorite in the set outside of Merry. SPOILER ALERT: it is a non-restricted tactics attachment called 'Raven-Winged Helm'. It is a 2 cost item and armor that you can attach to a sentinel hero (limit 1 per hero). It has a response effect that reads \"exhaust Raven-Winged Helm to cancel 1 point of damage just dealt to attached character\". Also if you pre-ordered you get the special limited edition with Viggo Mortensen signed art (he is a good artist) it adds \"valor combat action: exhaust this attachment to cancel all damage dealt to all heroes this round, remove all damage from heroes, search your deck for Gandalf, Elrond, Galadriel, and Saruman and put them into play, do not discard them until the end of the game, shuffle your deck. Then, if any of these characters were put into play destroy all enemies in play, count and discard the top half of the encounter deck adding all cards discarded to your victory display, and raise each player's threat to 48. This effect can only be triggered once by the players per game\"\n\nOk I'm just kidding about the second part, no special edition valor action but the first part is true. Between this and an honor guard that is two points of mitigation per round not including defence. It is a good player counter for direct damage as well. Also Erkenbrand may now be able to cancel a shadow effect for free as it doesn't specify a damage source. Enemies are getting toughness so we might as well get help. Cheers\n\nEdited July 1, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677639","commentId":1677639,"userName":"Fingolfin Fate","timestamp":1435731731,"content":">  \n> \n> > On a side note, there was a missed opportunity not to trait Tooks and Brandybucks.\n> \n> No, there was not.\n> \n>  \n\nHow insightful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677658","commentId":1677658,"userName":"John Constantine","timestamp":1435733155,"content":"> How insightful.\n\nIt's simple - spreading pointless traits is not a good thing. How many Dwarves we have compared to Hobbits? And are those Dwarves separated between, lets say, Blue Mountains, Iron Hills, Khazad-Dum, etc.? No. Want to know, why? Because that would be an absolute gameplay disaster, given the amount of cards we get per pack and the pace those cards are coming out. We would never explore any of those traits even halfway as we have explored general Dwarves by now. Same goes to Hobbits, but applies to them even stronger, as there will be far less Hobbits than Dwarves, so spreading them between different traits is even more pointless. Insightful enough?\n\n \n\n \n\nI can see how Curious Brandybuck will be a good addition to a fast drawing Lore deck. Or a deck with that new Erestor hero.\n\n \n\nI love East Road Ranger. She has decent stats for 3 resources, and she'll also quest the hell out of side quests, if needed. Cool.\n\n \n\nHobbit Pony. Well... I can see some use. Won't be much use for anybody else aside from Merry and Frodo. But still, better than something that won't be much use for anybody at all :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nIngold. Reminds me of something. Hm... \n\n \n\nbQHJ1TUozSg.jpg [https://pp.vk.me/c623128/v623128009/3f4c5/bQHJ1TUozSg.jpg]\n\n \n\nRegardless, with Visionary Leadership on Boromir he will be 4 WP, 2AT, 1DF and 3HP ally with a cost of 3. Decent addition, I might say.\n\n \n\nRanger of Caldoran. Another ally that is going to be extremely useful in a fast drawing Lore deck or in a deck with this new guy, Erestor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677661","commentId":1677661,"userName":"Fingolfin Fate","timestamp":1435733593,"content":"John, why the tone? I thought you meant it more as a jest, and so did I. But yes, I find arguments better than one-liners. The suggestion itself was meant partly as a jest, though as a Hobbit lover, I would still like it -- not so much for the mechanics but for theme. Has it offended you in some way?\n\n \n\nWhere does the card come for? A fan made, I am sure. And I am glad, for the art is dreadful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677664","commentId":1677664,"userName":"PsychoRocka","timestamp":1435733970,"content":">  \n> \n> > > > some (Curious Brandybuck) are next to useless...\n> > > \n> > > 2 willpower for free is next to useless?\n> > \n> > Honestly I'd rather pay one resource for Courage Awakened or Spirit Bofur.\n> \n> I'd rather play ally Elrond than Miner of the Iron Hills, but I wouldn't describe the Miner as 'next to useless' just because there's an alternative I consider to be better...\n\n \n\nTotally see your point but I still think this card is a coaster. \n\nMiner may be necessary if you are already using hero Elrond, or if you have only one lore hero and won't be able to use Elrond effectively. I get that Curious Brandybuck is free and does give a +2 willpower boost only for the turn (unless it dies that is then it did nothing but at least for free which is better than other allies at the very least :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ) or maybe a turn or two if there aren't many/any locations in play but the fact it goes on the bottom of your deck when it leaves play, not even shuffled back into your deck at least is for me the nail in the coffin for this card. It really shouldn't leave play if you paid the 2 spirit resources either as another 2 cost 2 willpower spirit ally would have been nice and could provide a thematic replacement to other similar allies in hobbit decks. If they consider this too cheap make it cost 3 and still go into play for free if you travel and leave play if the active location leaves play but only if you played it for free. No one will ever want to spend 2 spirit resources for him (over for example Escort from Edoras who for 2 spirit leaves play at the end of the round but provides TWICE the willpower) and the effect to put him into play is so easy to achieve (just travel to a location...) that I feel like his cost is completely redundant. It is more so there for effects like A Good Tale, Stand and Fight etc.\n\n \n\nAlso if you run any cards that help clear locations outside of the quest phase like Legolas, Blade of Gondolin etc the Brandybuck can potentially leave play before providing anything whatsoever so you wouldn't want to run it in a deck that uses Legolas, the spirit card that puts progress on the active location by exhausting a character or other similar cards. \n\nIdk I just personally don't see any value in this card that you cannot get out of other cards more reliably or permanently even if it is free and alternatives cost 1. I could never justify using up card slots in a deck for this ally and would always be able to find something else I'd include instead. Just not a fan. Don't like the art or name either.\n\nI am probably pretty biased though as I am not a big fan of hobbits in the game other than Sam. \n\n \n\nedit: just saw an above post and I guess one potential spot for this ally is in Erestor decks where you are going to lose your hand at the end of the round anyway so every card you can play for free or 0 cost helps. \n\nStill meh. \n\nEdited July 1, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677676","commentId":1677676,"userName":"John Constantine","timestamp":1435735112,"content":"> John, why the tone? I thought you meant it more as a jest, and so did I. But yes, I find arguments better than one-liners. The suggestion itself was meant partly as a jest, though as a Hobbit lover, I would still like it -- not so much for the mechanics but for theme. Has it offended you in some way?\n> \n>  \n> \n> Where does the card come for? A fan made, I am sure. And I am glad, for the art is dreadful.\n\nWhat tone? I merely provided you with the insight you requested. \n\n \n\nYes, the card is from a fanmade set. Can't see how the art is horrible, though, but to each his own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677687","commentId":1677687,"userName":"Fingolfin Fate","timestamp":1435736151,"content":"No, I didn't request anything from you.\n\n \n\nAnd of course, art is totally subjective but I tried to look at this piece three times now and had to scroll away quickly each time; it literally hurts the eyes. I hope whoever made this is not reading."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677699","commentId":1677699,"userName":"John Constantine","timestamp":1435737147,"content":"Well, it appeared to be implying it, but if it wasn't - too bad, it's already done. And I see no point in discussing it further. \n\n \n\nI don't think some random internet artist is browsing those unpopular LotR LCG forums. Or would take some random person's opinion close to heart - they're pretty used to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677766","commentId":1677766,"userName":"DukeWellington","timestamp":1435745954,"content":"I don't understand why you would want to spend 1 resource instead of 0 resources for 2 willpower. I could see Bofur being better because he could stay I'm play but courage awakening is a terrible card. In fact, if you wanted to argue that the new hobbit is bad just say \"he is like courage awakening, which nobody plays\". Anyway, I think he may have a role in a mono red deck with horn of gondor to provide rare questing help for free with resource gain. He is not a great card, but he is not terrible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677768","commentId":1677768,"userName":"DukeWellington","timestamp":1435746239,"content":"Also, I just want to say in general that there is too much hate. If a pack produces 3 playable cards it is an amazing pack, and Merry and the guard are almost guaranteed to be playable. Beyond that, you WANT the cards to be average so that there is as little power creep as possible. These cards are solid well themed and balanced cards. I don't think even one is an outright dud, except maybe the pony. There is no \"taking initiative\" crap. This is a good pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677771","commentId":1677771,"userName":"gandalfDK","timestamp":1435746483,"content":"Typed a long comment but pressed the wrong button.  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nConclusion was that there is a bit too much hate or better said, too many people want power creep. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nFairly optimistic, not really because of the power of the cards, but moreso to what they point ahead of us.\n\nFinally more generic, non-unique Hobbit allies to flesh out a real fullon Hobbit deck.\n\nAll  spoiled cards are great, Merry hero is good (!) imo.\n\nMore Dunedain allies is never a bad thing, although East Road is not so strong now, but needs more side-quests to be.\n\nIngold is great! Good to see some more love for the Gondor trait.\n\nHobbit Pony -> having people exhausted during staging is more often bad then good, strong card for weak Hobbits. (damage dealt for exhausted characters etc.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677772","commentId":1677772,"userName":"gandalfDK","timestamp":1435746519,"content":"Agree with Duke, except for his opinion on the pony.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677776","commentId":1677776,"userName":"Virani","timestamp":1435747897,"content":"So, are you able to play Ranger of Cardolan just by paying 4 resources, even if you don't control a Dunedain hero?\n\nAnd if so, will he still leave play at the end of the round? Or is this only triggered when the response is activated?  :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677777","commentId":1677777,"userName":"PsychoRocka","timestamp":1435747936,"content":"Fair enough\n\nhe is like courage awakening, which nobody plays :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nI do admit I've been a little overly critical of this new pack. I think more than anything its because the arguably best four cards in the pack were spoiled months ago. Still underwhelmed by the majority of the player cards in this pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677778","commentId":1677778,"userName":"PsychoRocka","timestamp":1435748082,"content":"You can play him for four with or without a dunedain hero and he will not leave play at the end of the round. You must control a Dunedain hero to use his response however.\n\nI think there is a typo on cardgamedb though as it has \"Play only if you control a Dúnedain hero\" but if you look at the actual card image this is not the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677783","commentId":1677783,"userName":"Virani","timestamp":1435748273,"content":"Yes, that was what made me wonder.\n\nA 2-2-2-3 neutral ally seems nice enough. Even though four cost is a little high, the fact it is not unique makes it very playable to me.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677797","commentId":1677797,"userName":"John Constantine","timestamp":1435749842,"content":"4 cost is a little high for 2/2/2/3 neutral ally? Lets see...\n\n \n\nAllies with the same exact amount of stats:\n\nGimli (cost 4, unique, leadership)\n\nHaldir of Lorien (cost 4, unique, lore)\n\nRanger of North (no cost, is shuffled into the encouner deck by event)\n\nWandering Ent (cost 2, lore, enters play exhausted)\n\n \n\nTo top it off, average stat distribution among 4 costed allies (excluding the one in question) is:\n\n1.3/2.1/1.6/3.0\n\n \n\nI think, it's pretty fair to say that cost 4 for a neutral 2/2/2/3 ally is an exact spot-on cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677805","commentId":1677805,"userName":"Virani","timestamp":1435751251,"content":"I didn't mean four cost is too high for Ranger of Cardolan.\n\nI think in general four cost is pretty high for any card, so I would rather not play too many high-cost cards. But for an high-cost card I think it is pretty good.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677878","commentId":1677878,"userName":"Fingolfin Fate","timestamp":1435757049,"content":"> Well, it appeared to be implying it, but if it wasn't - too bad, it's already done. And I see no point in discussing it further. \n> \n>  \n> \n> I don't think some random internet artist is browsing those unpopular LotR LCG forums. Or would take some random person's opinion close to heart - they're pretty used to it.\n\nSeems you know a lot about random internet artists. I had already expected you might have made the picture since you were defending it so fiercely. No wonder you keep browsing these forums despite being so unpopular in your eyes, mr Random."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677905","commentId":1677905,"userName":"John Constantine","timestamp":1435758193,"content":"What was this I don't even...  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n \n\nEdit: Oh, I get it. He thinks I've drawn that art. Oh well, might as well take that as a compliment. I wish I could draw at least half as good  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nEdited July 1, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677919","commentId":1677919,"userName":"Fingolfin Fate","timestamp":1435758896,"content":"No, I just kept kidding you. But you can keep it as a compliment.\n\n \n\n[edit] Also, you do not address the person you're having a conversation with \"he\". Judging from your vocabulary, you must already know that, so I'm guessing you're just trying hard to preserve your crusty ways.\n\nEdited July 1, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1677964","commentId":1677964,"userName":"Teamjimby","timestamp":1435761631,"content":"Alright guys, calm down.  Let's get back to the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678013","commentId":1678013,"userName":"Lecitadin","timestamp":1435764225,"content":"I really like the new Merry, combined with the pony. A lot of action advantage with Fast Hitch. Can't wait to buy this AP, I think the cards are, as a whole, better then the Lost Realm expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678036","commentId":1678036,"userName":"joezim007","timestamp":1435765502,"content":"> You can play him for four with or without a dunedain hero and he will not leave play at the end of the round. You must control a Dunedain hero to use his response however.\n> \n> I think there is a typo on cardgamedb though as it has \"Play only if you control a Dúnedain hero\" but if you look at the actual card image this is not the case.\n\n \n\nI guess that is dependent on whether the image is correct or if the text on the site is correct. The image may be old and not have updated text since they get their images straight from FFG and not card scans of the actual released cards.\n\n \n\n> a non-restricted tactics attachment called 'Raven-Winged Helm'. It is a 2 cost item and armor that you can attach to a sentinel hero (limit 1 per hero). It has a response effect that reads \"exhaust Raven-Winged Helm to cancel 1 point of damage just dealt to attached character\".\n\n \n\nI love it. It really does make the Erkenbrand + The Day's Rising combo far more effective. Now, if only he was noble so he could wear Heir of Mardil and ready from The Day's Rising's effect. Also, the fact that it isn't restricted makes it a welcome addition to practically any sentinel defender. I've often debated between using Citadel Plate and Spear of the Citadel on Beregond to go with his Gondorian Shield, but this will let me use the Spear without needing much, if any, healing to keep Beregond alive while still letting him be the one to take all the hits.\n\n \n\nIt's also another piece that can be added to my Uber Theoden concept where you load him up with everything possible to allow him to be great at everything:\n\n- Steward of Gondor\n\n- Heir of Mardil\n\n- Captain of Gondor\n\n- Gondorian Shield\n\n- The Day's Rising\n\n- Herugrim\n\n- All the readying you can find\n\n- and now Raven-Winged Helm\n\n \n\nWith Steward of Gondor and Heir of Mardil, you would also be able to effectively throw on Blood of Numenor, Gondorian Fire, and Visionary Leadership to make him super overkill. Any way you can add willpower will also boost his attack thanks to Herugrim, so Celebrian's Stone would also work well. For the sake of having the resources you need to play many of these cards, I would also throw Song of Kings on him. Additional options: Horn of Gondor and Rohan Warhorse, but then you'd need to replace the shield or Herugrim to free up the restricted slot; Dunedain attachments.\n\n \n\nThat's a LOT of setup, but with a well-designed deck (or splitting it into 2 decks to actually take more advantage of the sentinel keyword), it can find those pieces rather quickly nowadays, and very few of the pieces are \"necessary\"; they're just there to build him up more (e.g. SoG can trigger Heir of Mardil instead of The Day's Rising if need be). Definitely need the readying though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678050","commentId":1678050,"userName":"Teamjimby","timestamp":1435765924,"content":"Can you use Raven-Winged Helm with Erkenbrand's ability?  If I recall, \"Deal 1 damage to...\" means they need to actually take the damage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678057","commentId":1678057,"userName":"Gizlivadi","timestamp":1435766179,"content":"I think that was more related to the controversy with The Day's Rising, in that you can't gain the resource if you used his ability since he took damage. I don't see any reason for just Erkenbrand + Helm wouldn't work to cancel the shadow effect.\n\n \n\nIn another note, could someone post an image of the helm or the quote if any? I don't recall any reference to raven-winged helms in LOTR (as opposed to ASOIAF), only that the Fountain Guard in Minas Tirith wore helms with Gull-wings. Anybody here know the reference?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678078","commentId":1678078,"userName":"joezim007","timestamp":1435767085,"content":"> Can you use Raven-Winged Helm with Erkenbrand's ability?  If I recall, \"Deal 1 damage to...\" means they need to actually take the damage.\n\n \n\nYou're right. There have been other discussions about this idea with Treebeard too. If Erkenbrand doesn't actually take the damage (he wouldn't if it's cancelled), then he isn't fulfilling the cost of triggering the rest of the response. Just slipped my mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678090","commentId":1678090,"userName":"Gizlivadi","timestamp":1435767508,"content":"That's a bummer. So, mechanically it seems that the helm was specifically made for Beregond, but thematically it doesn't make sense. Here's a description of the attire of the Tower Guard of Minas Tirith (TGW):\n\n \n\n\"At the end of the Third Age, they were the only soldiers of Gondor entitled to wear the Livery of Elendil himself - a white tree in blossom, surmounted by a silver crown and stars, all embroidered on a field of black. They also bore heirlooms of Gondor's ancient wealth, tall helmets wrought out of mithril, with close-fitting cheek-guards and bearing the carved wings of sea-birds.\"\n\n \n\nThen why does it have raven wings? I know this is thematic nitpicking, but it seems like a very dumb thing to do from the designers. It's like having an Elven Shield card that worked best with a Rohan hero. Doesn't make sense.\n\n \n\nI summon the designers themselves to explain this aberration!\n\nEdited July 1, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678100","commentId":1678100,"userName":"Raven1015","timestamp":1435767833,"content":"It appears to come from this passage, where Pippin investigates one of the armories of Minas Tirith and dons some items. So the raven-winged helm is Pippin's funnily enough, but it does show that such helms could be found in Gondor.\n\n \n\n\"It was as he said; and Pippin soon found himself arrayed in strange garments, all of black and silver. He had a small hauberk, its rings forged of steel, maybe, yet black as jet; and a high-crowned helm with small raven-wings on either side, set with a silver star in the centre of the circlet.\"\n\nEdited July 1, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678102","commentId":1678102,"userName":"Gizlivadi","timestamp":1435768004,"content":"So it's actually Pippin's helm. That works for me. I still want a white-wing helm though at some point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678130","commentId":1678130,"userName":"Ranger of the Force","timestamp":1435768847,"content":"> I think that was more related to the controversy with The Day's Rising, in that you can't gain the resource if you used his ability since he took damage. I don't see any reason for just Erkenbrand + Helm wouldn't work to cancel the shadow effect.\n> \n>  \n> \n> In another note, could someone post an image of the helm or the quote if any? I don't recall any reference to raven-winged helms in LOTR (as opposed to ASOIAF), only that the Fountain Guard in Minas Tirith wore helms with Gull-wings. Anybody here know the reference?\n\nIt's about the 6th post down, the image is linked.\n\nhttp://boardgamegeek.com/thread/1394258/wastes-eriador-spoilers-are-cardgamedb [http://boardgamegeek.com/thread/1394258/wastes-eriador-spoilers-are-cardgamedb]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678151","commentId":1678151,"userName":"John Constantine","timestamp":1435770291,"content":">  \n> \n> > Can you use Raven-Winged Helm with Erkenbrand's ability?  If I recall, \"Deal 1 damage to...\" means they need to actually take the damage.\n> \n>  \n> \n> You're right. There have been other discussions about this idea with Treebeard too. If Erkenbrand doesn't actually take the damage (he wouldn't if it's cancelled), then he isn't fulfilling the cost of triggering the rest of the response. Just slipped my mind.\n> \n>  \n\nIs this for real? Would be the dumbest thing ever!\n\n \n\nJust to elaborate how it happens in my head:\n\n \n\nA shadow effect is triggered.\n\n \n\nErkenbrand triggers his ability, paying his health and canceling the effect at the same time, because it's the same printed effect.\n\n \n\nThen, Winged Helm is exhausted to cancel 1 point of damage issued to Erkenbrand. \n\nEdited July 1, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678168","commentId":1678168,"userName":"Teamjimby","timestamp":1435771747,"content":"Right, but I'm pretty sure cancelling the damage would prevent the cost from actually being paid.  It's kind of a weird ruling, but there is precedence.  There are a few rules threads about Treebeard's ability with song of mocking where it's determined that Treebeard would not get the bonus because you didn't actually deal damage to him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678172","commentId":1678172,"userName":"Gizlivadi","timestamp":1435772006,"content":"Yes, but Song of Mocking does not cancel the damage. It's preventing it from being placed in the first place. It has been established that you must deal the damage before cancelling it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678191","commentId":1678191,"userName":"Teamjimby","timestamp":1435773372,"content":"You know, in all of those threads I haven't seen an official response that really addresses the issue.  I'll send a question to Caleb to put this thing to rest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678234","commentId":1678234,"userName":"danpoage","timestamp":1435776355,"content":"The helm works fine with Erkenbrand. *Dealing* the damage is the cost of Erkenbrand's ability, the fact that a response is then triggered to cancel the damage that was dealt does not mean that the original cost of *dealing* was not paid. What happens to the damage after it is dealt is irrelevant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678244","commentId":1678244,"userName":"DukeWellington","timestamp":1435777049,"content":"Disagree. Damage cancelled is damage not dealt. Thus the price for the ability is never paid and thus the ability is not resolved.\n\nThe order is not: deal damage, cancel shadow, cancel damage\n\nThe order is: deal damage, cancel damage, do not cancel shadow"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678258","commentId":1678258,"userName":"danpoage","timestamp":1435778311,"content":"> Disagree. Damage cancelled is damage not dealt. Thus the price for the ability is never paid and thus the ability is not resolved.\n> \n> The order is not: deal damage, cancel shadow, cancel damage\n> \n> The order is: deal damage, cancel damage, do not cancel shadow\n\n \n\nThat is not how costs work in this game. Dealing the damage is a cost, if you paid the cost then you can cancel the shadow. The fact that a response is then triggered to cancel the damage does not mean that you did not pay the cost. We should wait for a response for Caleb, but I am positive that the Helm works with Erkenbrand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678261","commentId":1678261,"userName":"John Constantine","timestamp":1435778437,"content":"> Disagree. Damage cancelled is damage not dealt. Thus the price for the ability is never paid and thus the ability is not resolved.\n> \n> The order is not: deal damage, cancel shadow, cancel damage\n> \n> The order is: deal damage, cancel damage, do not cancel shadow\n\nI find that logic faulty.\n\n \n\nYou resolve the text entirely at once. You deal damage to cancel shadow. Then, helm reacts to that damage, canceling it. If there was no damage dealt as a cost - there would be nothing to cancel.\n\nEdited July 1, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678273","commentId":1678273,"userName":"Chris51261","timestamp":1435779299,"content":"I'm not really arguing one way or the other, but does Spirit Frodo kind of make it sound like \"dealing damage\" is the actually putting damage tokens on him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678280","commentId":1678280,"userName":"Gizlivadi","timestamp":1435779696,"content":"ffg_gondorian-discipline-eaad.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_gondorian-discipline-eaad.jpg]\n\n \n\nAs discussed when this card came out, cancelled damage is indeed dealt before it's cancelled, so i think Erkenbrand works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678282","commentId":1678282,"userName":"danpoage","timestamp":1435779753,"content":"Spirit Frodo's response is a replacement effect. *Instead of* placing damage tokens, you are raising your threat.\n\n \n\nHere is another example to highlight the timing of paying a cost. Say I have Landroval and an Eagles of the Misty Mountains in play. I take an undefended attack which kills a hero and respond with Landroval's ability. The cost of his response trigger is to return him to my hand, so I pay that and my hero immediately returns to play with 1 damage on him. I can then respond to Landroval leaving play with the Eagle of the Misty Mountain's response and *instead of* returning Landroval to my hand I would attach him face down to the Eagles of the Misty Mountains. The fact that Landroval did not end up in my hand does not mean that my hero was not saved. The cost was paid, the fact that another response (with a replacement effect) was triggered after the cost was paid is not relevant to the initial effect of Landroval's ability.\n\nEdited July 1, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678293","commentId":1678293,"userName":"midwestborn86","timestamp":1435780794,"content":">  \n> \n> As discussed when this card came out, cancelled damage is indeed dealt before it's cancelled, so i think Erkenbrand works.\n\nIn that case if a character has received damage enough to destroy it, is it destroyed before a helm, honor guard, or gondorian discipline would be able to respond? Or is the response before the damage tokens are physically placed on the card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678386","commentId":1678386,"userName":"danpoage","timestamp":1435785121,"content":"Yes, damage cancellation essentially intercepts the framework step of placing damage tokens on a character. This does not invalidate anything that happened before, including *dealing* the damage to pay the cost. It does alter effects that trigger after a character is damaged. For example, if you assign damage from an undefended attack from a Muck Adder (http://hallofbeorn.com/Cards/Details/Muck-Adder-CatC [http://hallofbeorn.com/Cards/Details/Muck-Adder-CatC]) to Beregond, you could respond with Gondorian Discipline and cancel the damage. Damage was assigned, but it was then cancelled. Therefore, Beregond was not damaged and does not need to be discarded.\n\n \n\nIf Erkenbrand has Steward of Gondor attached, you can use Gondorian Discipline to cancel the damage dealt to pay for his effect and this would not prevent his effect from working.\n\nEdited July 1, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678390","commentId":1678390,"userName":"PocketWraith","timestamp":1435785251,"content":"You guys may well be right - I forgot that the discussion re: Treebeard/Erkenbrand was to do with transferring the damage via Song of Mocking rather than cancelling it outright. That clearly doesn't work as the damage is never dealt, but it may well be that cancelling the damage does. I'd want to hear it from Caleb before declaring myself certain on this point though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678506","commentId":1678506,"userName":"divinityofnumber","timestamp":1435794109,"content":"Wow. I am excited for these cards. This looks to be a great AP. They don't seem overpowered, just mechanically interesting. Caleb and Matt are once again on point!    :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678568","commentId":1678568,"userName":"soullos","timestamp":1435799943,"content":"I agree that you can use the helm with Erkenbrand. The helm and other damage cancelling cards like Gondorian Discipline and Close Call specify \"Cancel X damage just dealt\". The damage has to be dealt (but before it is applied it seems) before you can satisfy the conditions of both responses of Erkenbrand's shadow cancellation and the helm's damage cancellation. Erkenbrand deals damage to himself getting rid of a shadow, and now the helm can be activated to cancel that damage just dealt. They synergize nicely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678680","commentId":1678680,"userName":"Bullroarer Took","timestamp":1435810013,"content":"They're responses. That's the way they work. I agree the timing structure is awkward, but it always has been in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1678926","commentId":1678926,"userName":"Distractionbeast","timestamp":1435839642,"content":"I'm excited about this set.  One thing I'm looking forward to now is more Hobbit heroes that will synergize with the pony.  I have a hard time believing they'd let such a mount sneak out if it only works well with this version of Merry.  And the helm is AWESOME.  It's an auto-include attachment for Beregond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679198","commentId":1679198,"userName":"crx3800","timestamp":1435854679,"content":"I understand the pony works well with the new Merry, but I can also see an entire party of hobbits all waiting to commit to the quest until after seeing the staging step. Even better, with a fast hitch as well, they could be knocked off the quest initially only to return with a hitch and a pony."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679224","commentId":1679224,"userName":"John Constantine","timestamp":1435856522,"content":"MEC39_7.jpg [http://www.cardgamedb.com/forums/uploads/lotr/MEC39_7.jpg] + nor-am-i-a-stranger-catc.jpg [http://www.cardgamedb.com/forums/uploads/lotr/nor-am-i-a-stranger-catc.jpg] +  MEC30_116.jpg [http://www.cardgamedb.com/forums/uploads/lotr/MEC30_116.jpg] = KICK SOME ASS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679252","commentId":1679252,"userName":"Teamjimby","timestamp":1435857413,"content":"That would be such a ridiculous combo that's not worth it at all... but it would be so worth it to make it happen.  Then throw in Forth Eorlingas, some Spears of the Mark and Fast Hitches, and watch your Hobbit wipe the staging area. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679256","commentId":1679256,"userName":"Teamjimby","timestamp":1435857536,"content":"The official answer is in.  You CANNOT use damage cancellation with Erkenbrand.\n\n \n\n> Hi Jim,\n> When a player uses a Response to cancel an effect, the result is that the canceled effect never resolves. For example, when a player uses A Test of Will to cancel the ‘when revealed’ effects of The Necromancer’s Reach, the players do not deal 1 damage to each character in play and then remove 1 damage from each character in play. Instead, no damage is dealt.\n> Similarly, if you use the Response effect on Raven-winged Helm to cancel the damage just dealt to Erkenbrand after triggering his Response effect, you do not place 1 damage on Erkenbrand and then remove it. Instead, the damage is not dealt at all. In which case, his cost has not been paid and you cannot resolve his effect.\n> Visually, it looks like this:\n> Damage is dealt by effect ——> Response effect cancels damage dealt ——> No damage is actually dealt\n> Cheers,\n> Caleb\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679291","commentId":1679291,"userName":"joezim007","timestamp":1435858919,"content":"That's what I thought. Otherwise cancelling Necromancer's Reach wouldn't save the characters who already died from receiving the damage because they would no longer be in play to remove the damage. Same with Frodo: you have to prevent the damage from ever hitting him if you want him to stay alive to be able to use his ability. The cancellation response makes it prevent the original effect from ever being fulfilled.\n\nEdited July 2, 2015 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679352","commentId":1679352,"userName":"Bullroarer Took","timestamp":1435861909,"content":"Awesome combo abovema bit ironic that it works best with tactics merry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679395","commentId":1679395,"userName":"John Constantine","timestamp":1435864169,"content":">  \n> \n> The official answer is in.  You CANNOT use damage cancellation with Erkenbrand.\n> \n>  \n> \n> > Hi Jim,\n> > \n> > When a player uses a Response to cancel an effect, the result is that the canceled effect never resolves. For example, when a player uses A Test of Will to cancel the ‘when revealed’ effects of The Necromancer’s Reach, the players do not deal 1 damage to each character in play and then remove 1 damage from each character in play. Instead, no damage is dealt.\n> > \n> > Similarly, if you use the Response effect on Raven-winged Helm to cancel the damage just dealt to Erkenbrand after triggering his Response effect, you do not place 1 damage on Erkenbrand and then remove it. Instead, the damage is not dealt at all. In which case, his cost has not been paid and you cannot resolve his effect.\n> > \n> > Visually, it looks like this:\n> > \n> > Damage is dealt by effect ——> Response effect cancels damage dealt ——> No damage is actually dealt\n> > \n> > Cheers,\n> > \n> > Caleb\n> \n>  \n\nEh, whatever, I will not follow this ridiculous ruling anyway. And I will not be surprised if it gets changed in the future, like that stuff with Forest Snare being attached to Nameless Thing as a part of it's effect and and actuallty taking effect (i.e. preventing it from attacking)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679407","commentId":1679407,"userName":"Fingolfin Fate","timestamp":1435864732,"content":"The ruling could not be more obvious. Of course the damage never happens, otherwise it would be (more or less) useless, and when something never happens, then it cannot be taken as a cost.\n\nEdited July 2, 2015 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679411","commentId":1679411,"userName":"Fingolfin Fate","timestamp":1435864895,"content":"I have had Charge of the Rohirrim in my Rohan decks since it came out. I so want the card to work. But it is one of the weakest ones, and it certainly doesn't justify the presence of Steed of the Mark. Nor am I a Stranger is a similar card, though there are more cards to combo with it, of course, and some of them might be justifiable: Astonishing Speed, Forth Éorlingas, even Éomund."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679425","commentId":1679425,"userName":"Gizlivadi","timestamp":1435865836,"content":"Wow that's a shame. I guess I won't be using Erkenbrand until we get something that actually works with him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679449","commentId":1679449,"userName":"John Constantine","timestamp":1435867254,"content":"> The ruling could not be more obvious. Of course the damage never happens, otherwise it would be (more or less) useless, and when something never happens, then it cannot be taken as a cost.\n\nYes, it could. There would be nothing for Helm to cancel if the cost wasn't paid. The point is - you paid the cost by issuing that damage, what happens to that damage now is a whole other topic. The whole reason the Helm is able to respond is because the cost have been paid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679487","commentId":1679487,"userName":"GrandSpleen","timestamp":1435869509,"content":"> Wow that's a shame. I guess I won't be using Erkenbrand until we get something that actually works with him.\n\n \n\nWe do!  It's called \"healing\" and it's very effective!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679523","commentId":1679523,"userName":"Teamjimby","timestamp":1435871690,"content":"I don't think it's an obvious ruling, but it's at least consistent with previous rulings.  It's like in Magic or many other CCG/LCGs where the card played last actually triggers first.  You never actually dealt the damage to Erkenbrand, so \"Deal 1 damage to Erkenbrand to...\" never happened and the cost was not paid.\n\n \n\nThat said, if you want to ignore the ruling nobody is going to stop you.\n\n \n\nAlso, Erkenbrand is still a beast as long as you have healing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679576","commentId":1679576,"userName":"Teamjimby","timestamp":1435874750,"content":"There's nothing new in it, but for anyone that's interested the Wastes of Eriador release article just posted:\n\n \n\nhttps://www.fantasyflightgames.com/en/news/2015/7/2/hunted-on-the-wastelands/ [https://www.fantasyflightgames.com/en/news/2015/7/2/hunted-on-the-wastelands/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679677","commentId":1679677,"userName":"soullos","timestamp":1435884218,"content":">  \n> \n> The official answer is in.  You CANNOT use damage cancellation with Erkenbrand.\n> \n>  \n> \n> > Hi Jim,\n> > \n> > When a player uses a Response to cancel an effect, the result is that the canceled effect never resolves. For example, when a player uses A Test of Will to cancel the ‘when revealed’ effects of The Necromancer’s Reach, the players do not deal 1 damage to each character in play and then remove 1 damage from each character in play. Instead, no damage is dealt.\n> > \n> > Similarly, if you use the Response effect on Raven-winged Helm to cancel the damage just dealt to Erkenbrand after triggering his Response effect, you do not place 1 damage on Erkenbrand and then remove it. Instead, the damage is not dealt at all. In which case, his cost has not been paid and you cannot resolve his effect.\n> > \n> > Visually, it looks like this:\n> > \n> > Damage is dealt by effect ——> Response effect cancels damage dealt ——> No damage is actually dealt\n> > \n> > Cheers,\n> > \n> > Caleb\n> > \n> >  \n> \n>  \n\nhmm... I guess that ruling makes sense. You cancel an effect, it will never apply (maybe we need a \"Stack\" like Magic has to avoid timing confusion?)\n\n \n\nIt's just the words \"damage just dealt\" that I have a problem with. The Test of Will/Necromancer's Reach example makes sense, no damage will be applied in this case. But damage cancellation cards all say \"cancel x damage just dealt\". You have to deal the damage first, which kind of contradicts the \"cancel\" effect. Almost seems like a funky, restrictive \"healing\" than actual damage prevention. Or does \"damage just dealt\" means it's damage assigned, but not officially applied just yet? Either way, it's convoluted... >_>\n\n \n\nMaybe they should errata these few cards to say \"Cancel x damage\". That's it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679686","commentId":1679686,"userName":"PsychoRocka","timestamp":1435885037,"content":"Bottom of the article is a bit silly. Brandybuck is not like a zero cost feint..... \n\nThe article itself states \"although you'd still suffer from any negative Shadow effects or from other effects that trigger when a character is destroyed\".\n\n \n\nFeint stops an enemy from attacking altogether (stopping any effects that trigger just from an attack being made, Murzag, Chieftain Uflak or the Wargs in The Ring Goes South that place damage on the active location when they attack for example), stops its shadow card from resolving (avoiding shadow effects) and allows you to not have to exhaust a defender for that attack. Using brandybuck as a chump blocker is the same as any other chump blocking in the game except the brandybuck can potentially come into play for free. It is not similar to a feint it is just a free chump blocker for a turn. They are pretty much saying that any chump block you perform is similar to feint.\n\n \n\nI disagree with this as you are sacrificing a character and can suffer all manner of nasty effects from any manner of cards like shadow cards that punish you for a character dying from the attack just made, an enemy or location in play that has a nasty effect that triggers when a character is destroyed from an attack or just in general, hell even some quest stages severely punish you for characters dying. In fact there are so many shadow effects these days that have something along the lines of \"if this attack destroys a character this enemy makes another attack\" or makes an attack against the next player or you must remove all progress from the current quest or have to put more counters on something that may make you lose if it gets too many that chump blocking is not really anywhere near as viable as it used to be. \n\n \n\nEssentially there is way too much chump block hate in recent and newer quests and far more varied and nastier shadow effects (and an ABUNDANCE that punish you for blocking with allies or if the defending character dies) to be able to say that chump blocking is like feint which completely stops and negates an enemy attack. I do get the similarity and comparison they are trying to make but disagree. Attack cancellation and chump blocking are two different things in this game that whilst both are ways to deal with enemy attacks they have very different outcomes, pros and cons. \n\nEdited July 3, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679900","commentId":1679900,"userName":"Fingolfin Fate","timestamp":1435910613,"content":">  \n> \n> > The ruling could not be more obvious. Of course the damage never happens, otherwise it would be (more or less) useless, and when something never happens, then it cannot be taken as a cost.\n> \n> Yes, it could. There would be nothing for Helm to cancel if the cost wasn't paid. The point is - you paid the cost by issuing that damage, what happens to that damage now is a whole other topic. The whole reason the Helm is able to respond is because the cost have been paid.\n> \n>  \n\nWell, I don't know if you people understand the word \"cancel\" well enough. If something is \"cancelled\" it is considered not to have happened. And of course, this has been explained -- in the game -- four years ago when Frodo came out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679905","commentId":1679905,"userName":"Fingolfin Fate","timestamp":1435911055,"content":"Yeah, Curious Brandybuck is \"just\" a free chump. But that is not altogether bad, is it? Of course, you can get a shadow that punishing destroying a character or that makes an additional attack. Sometimes you won't be able to avoid those anyway. And many quests have only a handful (and some even none) of those. Imagine a situation with Orc Vanguard from Assault on Osgiliath. The card is revealed and suddenly you cannot spend resources from Leadership, Spirit and Lore heroes. But you travel to a location, put the Brandybuck into play, engage the Vanguard and chump block it. It may be a day saver in such situations. And overall, a free chump is a very good chump, only Squire of the Citadel could be considered better cost-wise (and not always). And the cheap chumps usually do not do very much else, this Brandybuck is similar: he can do a tiny little bit -- though again 2 willpower for a turn (and it may turn out to be more with a location that lingers) is not altogether useless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679913","commentId":1679913,"userName":"Olorin93","timestamp":1435911723,"content":"Sorry, I haven't read through the whole thread - does the Brandybuck's \"Forced\" effect trigger even when he's still in a player's hand? It doesn't actually specify that he needs to be in play. This would make him a lot less useful; if I draw him and then a location is explored, do I have to put him into my deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679915","commentId":1679915,"userName":"John Constantine","timestamp":1435912005,"content":"> Sorry, I haven't read through the whole thread - does the Brandybuck's \"Forced\" effect trigger even when he's still in a player's hand?\n\nEffects like this are always work only while card is in play, unless stated otherwise.\n\n \n\nOn a side note, no one here seemed to read that part of my post, so I'll repeat:\n\n \n\nThis new Hobbit ally is obviously aimed for the new Erestor hero. Also, is going be pretty useful in a fast-drawing Lore deck, even without any other Spirit at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1679971","commentId":1679971,"userName":"DukeWellington","timestamp":1435919892,"content":"So about that Erkenbrand ruling... I don't want to say I told you so, but...\n\nJohn, yes the damage was issued, but, as is explained in the ruling, it does not resolve.\n\nThe reason that damage resolution must be part of the cost is specifically in the wording of the card when it says deal the damage \"to\" cancel the shadow effect. If it just said \"deal damage and cancel\" then the resolution of the damage would not be required for the effect.\n\nAlso, a response interrupts steps in a process, so it makes sense that the damage is cancelled before the rest of the process continues. It would make no sense to deal the damage, resolve the effect, and then go back and cancel the damage. You just cancel the damage right away when it happens.\n\nIt all makes sense to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680037","commentId":1680037,"userName":"John Constantine","timestamp":1435927039,"content":"That's good for you. It doesn't mean I must agree with you, I find my point of view as valid as yours. The designer being on your side is a flimsy advantage as those kind of rulings have been thwarted in the past (once again, shiny example: Nameless Things and Forest Snare), so I will just stick to my perception of things. You like yours - go ahead, no stopping ya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680206","commentId":1680206,"userName":"joezim007","timestamp":1435935442,"content":"If cancelling damage didn't interrupt and prevent the damage from ever being placed, then if the damage was enough to destroy the character, it would be discarded and thus be an ineligible target for the response to cancel the damage.\n\nThe only reason the cards say to cancel damage \"just dealt\" is because if it didn't it would be playable at any time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680273","commentId":1680273,"userName":"John Constantine","timestamp":1435940356,"content":"That's if the game model isn't smart about it (which it obiously isn't, hence the given situation). How about we stop beating the dead horse? I understand that your view on this matter differs from mine. I don't ask you to change your view based on mine, and the hell am I going to change mine. This discussion will lead nowhere. How about we just stop and discuss the actual topic of this thread?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680304","commentId":1680304,"userName":"Epi Lepi","timestamp":1435943661,"content":"If you use the Curious Brandybucks response you don't need a resource match right? It's not like playing a 0 cost card, at least in my opinion. What do you guys think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680307","commentId":1680307,"userName":"Olorin93","timestamp":1435943894,"content":"If it enters play as a result of a location being travelled to, you shouldn't need a resource match, no.\n\nEdited July 3, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680311","commentId":1680311,"userName":"Noccus","timestamp":1435944356,"content":"> > Wow that's a shame. I guess I won't be using Erkenbrand until we get something that actually works with him.\n> \n>  \n> \n> We do!  It's called \"healing\" and it's very effective!\n\n> Wow that's a shame. I guess I won't be using Erkenbrand until we get something that actually works with him.\n\nIndeed. With healing on the table he is a brick wall.\n\nErkenbrand has really proved his worth in my play group.\n\nWe actually value him above Beregond now.\n\nFancy that. You should give him a go. You won't be dissapointed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680315","commentId":1680315,"userName":"Gizlivadi","timestamp":1435944829,"content":"I really want to use him, but I don't know what heroes to combine him with to make a decent solo deck. \n\nEdited July 3, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680320","commentId":1680320,"userName":"GrandSpleen","timestamp":1435945080,"content":"> I really want to use him, but I don't know what heroes to combine him with to make a decent solo deck. \n\n \n\nI really like the new Theoden with Erkenbrand and Eowyn in a Rohan-theme deck.  I'll admit that I haven't tried it solo, but I think it would be able to do well.   Erkebrand defends, Theoden can attack with Herugrim (and quest too if you get some readying), Eowyn quests as well as she always does, as lots of quest-happy allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680348","commentId":1680348,"userName":"Gizlivadi","timestamp":1435946251,"content":"I still don't have my copy of Treason, but I really wanna try new Theoden, although I prefer the spirit-tactics deck with Eowyn and Eomer. But right now I want to make more general-purpose decks until I get my copy, and Erkenbrand doesn't really fit in any. He's not a hero you can exploit like Mablung or Hama or Caldara, he just defends pretty much. Clearly a multiplayer hero, IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680367","commentId":1680367,"userName":"Noccus","timestamp":1435947073,"content":"Well he does have sentinel, but that's about it.\n\nHis ability is equally useful for a solo player.\n\nMost decks have a dedicated defending hero, and Erkenbrand fits the bill.\n\nIf you use leadership, and need a defender, I'd pick Erkenbrand over any other in the game. Seriously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680371","commentId":1680371,"userName":"Chris51261","timestamp":1435947262,"content":"Honour Guard was doing some serious work in the decks I played against The Wastes last night. I'm not 100% sure there aren't cards you'd want to include before him, but when I had 3 up it was a marvelous safety blanket. Probably my favorite card of the whole pack, just for the versatility of it. He can even save those valuable yet wimpy allies from deal one damage to all characters treacheries! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680458","commentId":1680458,"userName":"Bullroarer Took","timestamp":1435952690,"content":"Just picked up my pack and my first reaction is hate.  I absolutely HATE the new plastic packaging.  You probably thought (as I did) that the new packaging would be the same as what we have been getting with the POD packs right?  Nope.  They're bigger.  Much bigger.  In every dimension.  Fantasy Flight, lose the plastic and go back to the cardboard even if you have to increase the selling price.  Please."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680471","commentId":1680471,"userName":"Bullroarer Took","timestamp":1435953542,"content":"We can add \"annoyance\" to my reactions.  No where in the massive packaging does it give the conditions required to meet Valour.  The pack does say that the Core Set and The Lost Realm are required, but it doesn't say you need an internet connection.\n\n \n\nI'm sure the adventure and cards inside are good to great from what I've seen so far.  It's a shame that Caleb and Matt's hard work are ruined this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680485","commentId":1680485,"userName":"noctum_carpe","timestamp":1435954451,"content":"> We can add \"annoyance\" to my reactions.  No where in the massive packaging does it give the conditions required to meet Valour.  The pack does say that the Core Set and The Lost Realm are required, but it doesn't say you need an internet connection.\n> \n>  \n> \n> I'm sure the adventure and cards inside are good to great from what I've seen so far.  It's a shame that Caleb and Matt's hard work are ruined this way.\n\nThreat 40+ is valour"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680489","commentId":1680489,"userName":"Chris51261","timestamp":1435955063,"content":"Huh? It says it on the back of the insert, Took. And as for the plastic packaging, say what you want about the aesthetics of it (which I couldn't care less about), it seemed to do a better job keeping the cards straight. I can't tell you how many of the old packs that came with all the cards having  a super annoying bend in them. \n\nEdited July 3, 2015 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680519","commentId":1680519,"userName":"Bullroarer Took","timestamp":1435958110,"content":"> Huh? It says it on the back of the insert, Took. And as for the plastic packaging, say what you want about the aesthetics of it (which I couldn't care less about), it seemed to do a better job keeping the cards straight. I can't tell you how many of the old packs that came with all the cards having  a super annoying bend in them. \n\nBelieve it or not, I didn't know the rules sheet was hidden in the folded over insert.  If you hadn't said something I probably would have never found it.  So my bad on that one, but I still abhor the plastic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680520","commentId":1680520,"userName":"Bullroarer Took","timestamp":1435958170,"content":">  \n> \n> > We can add \"annoyance\" to my reactions.  No where in the massive packaging does it give the conditions required to meet Valour.  The pack does say that the Core Set and The Lost Realm are required, but it doesn't say you need an internet connection.\n> > \n> >  \n> > \n> > I'm sure the adventure and cards inside are good to great from what I've seen so far.  It's a shame that Caleb and Matt's hard work are ruined this way.\n> \n> Threat 40+ is valour\n> \n>  \n\nI knew what the rule is, but since I hadn't found the rules sheet it annoyed me that it wasn't in the package."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680529","commentId":1680529,"userName":"Chris51261","timestamp":1435958893,"content":"Lol, you were so enraged fighting with the plastic you threw it across the room once you got the cards out.  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680649","commentId":1680649,"userName":"Epi Lepi","timestamp":1435968038,"content":"> I still don't have my copy of Treason, but I really wanna try new Theoden, although I prefer the spirit-tactics deck with Eowyn and Eomer. But right now I want to make more general-purpose decks until I get my copy, and Erkenbrand doesn't really fit in any. He's not a hero you can exploit like Mablung or Hama or Caldara, he just defends pretty much. Clearly a multiplayer hero, IMO.\n\nI feel bad for everyone who doesn't have friends to play this game with. The game is like a thousand times better multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680720","commentId":1680720,"userName":"Bullroarer Took","timestamp":1435974791,"content":"And now for some good news. Spirit Merry with his Pony is amazing. Flip a card of three threat or greater and you tap him to reduce the threat. One or less and you tap him as a Late Adventurer. Two is situational. Put Fast Hitch on him and it's like cheating on your taxes.\n\nI haven't tried the quest itself though. I wanted to try Spirit Merry, Lore Pippen and Treebeard against Saruman first, (Fail so far. That quest is hard.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680754","commentId":1680754,"userName":"Teamjimby","timestamp":1435979241,"content":"Yeah, I suppose Hobbit Pony would be nice in a solo game where the odds of revealing an enemy are low. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1680756","commentId":1680756,"userName":"PsychoRocka","timestamp":1435979627,"content":">  \n> \n> > I still don't have my copy of Treason, but I really wanna try new Theoden, although I prefer the spirit-tactics deck with Eowyn and Eomer. But right now I want to make more general-purpose decks until I get my copy, and Erkenbrand doesn't really fit in any. He's not a hero you can exploit like Mablung or Hama or Caldara, he just defends pretty much. Clearly a multiplayer hero, IMO.\n> \n> I feel bad for everyone who doesn't have friends to play this game with. The game is like a thousand times better multiplayer.\n> \n>  \n\nPlaying two handed solves this :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1681087","commentId":1681087,"userName":"Fingolfin Fate","timestamp":1436031042,"content":"I can second that. I prefer real 2-player, but I still prefer 2-handed to solo, almost exclusively. My friend from abroad was like this before, he wouldn't try 2-handed for some reason until he finally did, and never came back. I am not saying it is for everyone, but I see nothing wrong in trying it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1683485","commentId":1683485,"userName":"Boris_the_Dwarf","timestamp":1436228902,"content":"Hobbits just got crazy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1684849","commentId":1684849,"userName":"Ecthelion III","timestamp":1436321052,"content":"Raven-Winged Helm is a perfect Beregond toy, but not good at much else. It's free, non-restricted, and is the equivalent of a point of defense but can stop Cold from Angmar, Blocking Wargs/Biting Wind shadow, archery, et al as an added bonus.\n\n \n\nAs for Honor Guard, I think I might be one of the only ones who doesn't like it that much. Might as well buy a 1-cost chump blocker. The best use I can think of is, while in Valor, playing a Rallying Cry.\n\n \n\nMerry is a great Splorfindel substitute in decks that don't depend on his statline. Just swap out 3x Light of Valinor for 3x Hobbit Pony."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1684863","commentId":1684863,"userName":"Gizlivadi","timestamp":1436323674,"content":">  \n> \n> > I still don't have my copy of Treason, but I really wanna try new Theoden, although I prefer the spirit-tactics deck with Eowyn and Eomer. But right now I want to make more general-purpose decks until I get my copy, and Erkenbrand doesn't really fit in any. He's not a hero you can exploit like Mablung or Hama or Caldara, he just defends pretty much. Clearly a multiplayer hero, IMO.\n> \n> I feel bad for everyone who doesn't have friends to play this game with. The game is like a thousand times better multiplayer.\n> \n>  \n\n \n\nYou should be grateful, I have no one to play this with, and two handed just seems not only harder, which is not precisely my cup of tea, but also much more dense and complicated. The only reason I've been tempted to play two handed is to use cards that are not viable in a solo deck. There are sooo many options of heroes and other player cards that are rarely efficient in solo, but again, it seems like it's too much stuff to keep track of. In any case, in solo I still enjoy this game a lot! Probably because I come from a tcg background since I was like 6, so I still enjoy the mechanics. I do get to play Magic and another local tcg with people though.\n\nEdited July 8, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1684906","commentId":1684906,"userName":"joezim007","timestamp":1436326629,"content":"> Raven-Winged Helm is a perfect Beregond toy, but not good at much else. It's free, non-restricted, and is the equivalent of a point of defense but can stop Cold from Angmar, Blocking Wargs/Biting Wind shadow, archery, et al as an added bonus.\n> \n> As for Honor Guard, I think I might be one of the only ones who doesn't like it that much. Might as well buy a 1-cost chump blocker. The best use I can think of is, while in Valor, playing a Rallying Cry.\n> \n> Merry is a great Splorfindel substitute in decks that don't depend on his statline. Just swap out 3x Light of Valinor for 3x Hobbit Pony.\n\nIf Raven-Winged Helm is good, then why not Honor Guard? They tend to have the same effect except HG isn't limited to a single sentinel hero and can stack with multiple guards.\n\nAlso a chump blocker cannot help in situations with direct damage, with Hummerhorns being a great example of one such effect where you'd like to cancel all damage, or even a lump of archery damage funneled to a single character.\n\nFinally, Raven-Winged Helm is great on any sentinel hero (which can be anyone if you use Dunedain Signal) and combos amazingly with The Day's Rising.\n\nEdited July 8, 2015 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685023","commentId":1685023,"userName":"danpoage","timestamp":1436338239,"content":"Honour Guard and the Helm are both very useful cards. Now Tactics can handle archery and other direct damage on its own, without having to splash Lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685310","commentId":1685310,"userName":"joezim007","timestamp":1436362840,"content":"> Honour Guard and the Helm are both very useful cards. Now Tactics can handle archery and other direct damage on its own, without having to splash Lore.\n\nMy kids have been watching too much Thomas the Tank Engine lately. I saw \"very useful\" and pictured Sir Topham Hatt saying \"really useful engine\". *sigh*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685317","commentId":1685317,"userName":"gandalfDK","timestamp":1436363235,"content":"Honour Guard is great. Essentially healing for Tactics. This honourfull Guard makes above danpoage's Beorn somewhat viable again.\n\n \n\nRaven-Winged Helm is somewhat lackluster. Good for Beregond -> free, but paying two for 1 damage where I would rather spend 1 for Gondorian Shield and keep the other 1. (Feint lol)\n\n \n\nRallying Cry seems somewhat meh to me. Even its valour response thing is not that great. 0 cost would've been better. it's too cost deficient."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685341","commentId":1685341,"userName":"Distractionbeast","timestamp":1436364367,"content":"> Honour Guard is great. Essentially healing for Tactics. This honourfull Guard makes above danpoage's Beorn somewhat viable again.\n> \n>  \n> \n> Raven-Winged Helm is somewhat lackluster. Good for Beregond -> free, but paying two for 1 damage where I would rather spend 1 for Gondorian Shield and keep the other 1. (Feint lol)\n> \n>  \n> \n> Rallying Cry seems somewhat meh to me. Even its valour response thing is not that great. 0 cost would've been better. it's too cost deficient.\n\n \n\nRaven-Winged Helm is not mind-blowing, for sure, but I don't agree that it's lackluster.  Using Beregond as the example, in most cases, the shield is better, but it's not an either/or situation.  He can only have 1 shield, but the Helm gives him an extra defense against overflow damage or archery as Dan mentioned.  The ability to cancel non-attack damage is pretty significant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685495","commentId":1685495,"userName":"gandalfDK","timestamp":1436369608,"content":"Yeah sure, with Beregrod it's a nobrainer, because it's free as I said. With other heroes it is a either/or because resources influence your choice. Imo I find RWH have a really marginal influence. I would rather spend my deckspace to other things nowadays, like shield, then RWH.\n\nIt is quite the unfair comparison, but I deem even close call etc. better. Honour Guard.\n\nAnyway, it is good in what it does but for 2 resources there is some much else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685501","commentId":1685501,"userName":"Distractionbeast","timestamp":1436369905,"content":"> Yeah sure, with Beregrod it's a nobrainer, because it's free as I said. With other heroes it is a either/or because resources influence your choice. Imo I find RWH have a really marginal influence. I would rather spend my deckspace to other things nowadays, like shield, then RWH.\n> \n> It is quite the unfair comparison, but I deem even close call etc. better. Honour Guard.\n> \n> Anyway, it is good in what it does but for 2 resources there is some much else.\n\n \n\nThat's often the sign of good card design - when inclusion is debatable and situational.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n \n\nIf I'm reading Honour Guard correctly, it seems that it can't stack on the same damage source since it targets the first point of damage.  Any other opinions on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685536","commentId":1685536,"userName":"Noccus","timestamp":1436371198,"content":">  \n> \n> > Raven-Winged Helm is a perfect Beregond toy, but not good at much else. It's free, non-restricted, and is the equivalent of a point of defense but can stop Cold from Angmar, Blocking Wargs/Biting Wind shadow, archery, et al as an added bonus.\n> > \n> > As for Honor Guard, I think I might be one of the only ones who doesn't like it that much. Might as well buy a 1-cost chump blocker. The best use I can think of is, while in Valor, playing a Rallying Cry.\n> > \n> > Merry is a great Splorfindel substitute in decks that don't depend on his statline. Just swap out 3x Light of Valinor for 3x Hobbit Pony.\n> \n> If Raven-Winged Helm is good, then why not Honor Guard? They tend to have the same effect except HG isn't limited to a single sentinel hero and can stack with multiple guards.\n> \n> Also a chump blocker cannot help in situations with direct damage, with Hummerhorns being a great example of one such effect where you'd like to cancel all damage, or even a lump of archery damage funneled to a single character.\n> \n> Finally, Raven-Winged Helm is great on any sentinel hero (which can be anyone if you use Dunedain Signal) and combos amazingly with The Day's Rising.\n> \n>  \n> \n>  \n> \n> True. I would still slap Raven-winged helm on Erkenbrand, even if it doesn't work with his ability.\n> \n> He's main role is defending, with only means the helm will make him a stronger defender.\n> \n> And he will take damage sooner or later from high attack foes any way you look at it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685587","commentId":1685587,"userName":"John Constantine","timestamp":1436372827,"content":"> If I'm reading Honour Guard correctly, it seems that it can't stack on the same damage source since it targets the first point of damage.  Any other opinions on this?\n\nIt doesn't targets the first point of damage, I don't know where you got that idea form. It cancels one point of damage from all the damage that was just dealt to a character. If several Honour Guards triggered against the same damage source, each cancels the different point of damage, because the one that was canceled by the previous Guard is already canceled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685613","commentId":1685613,"userName":"Bullroarer Took","timestamp":1436373536,"content":"\"Exhaust Honour Guard to cancel 1 point of damage just dealt to a character.\"\n\n \n\nThere is a discrepancy between the text on the card and the text provided by cardgamedb next to the card.  We must go by the card text of course.  So multiple Honour Guards will work.\n\n \n\nI agree with those who say the helm is good on a few heroes, but very lackluster otherwise.  I included it in my deck to try it out and then realized that my plan of slapping it on Boromir via Arwen would not work, because Boromir would not have sentinel during the Planning phase.  And it's not good enough to jump through hoops for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1685937","commentId":1685937,"userName":"joezim007","timestamp":1436386526,"content":"It's sad that Beorn may be the best hero for the helm but it doesn't fit on his big bear head."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1687690","commentId":1687690,"userName":"danpoage","timestamp":1436504486,"content":"> It's sad that Beorn may be the best hero for the helm but it doesn't fit on his big bear head.\n\nOddly enough, in The Weather Hills and The Wastes of Eriador the foul weather gives Beorn the wiggle-room to don the helm. Assign one point of damage to him when Cold from Angmar [http://hallofbeorn.com/Cards/Details/Cold-from-Angmar-TLR] blows by and you are ready to go!\n\nI must say, I have been abusing the hell out of that card in these scenarios as it allows you to play attachments on Beorn, and keep certain itinerate wizards around for longer than usual. The fact that it leaves characters' traits and keywords but blanks everything else can definitely be used to your advantage. It's more than just some silly helmet in this case, though. I like to go for maximum absurdity and attach a Shield, Captain of Gondor and Support of the Eagles. Once you clear the active quest, none of his gear falls off. A bear that thinks he's human - there is *nothing* more ridiculous than that.\n\nEdited July 10, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1687694","commentId":1687694,"userName":"PocketWraith","timestamp":1436505684,"content":"> > It's sad that Beorn may be the best hero for the helm but it doesn't fit on his big bear head.\n> \n> Oddly enough, in The Weather Hills and The Wastes of Eriador the foul weather gives Beorn the wiggle-room to don the helm. Assign one point of damage to him when Cold from Angmar [http://hallofbeorn.com/Cards/Details/Cold-from-Angmar-TLR] blows by and you are ready to go!\n> \n> I must say, I have been abusing the hell out of that card in these scenarios as it allows you to play attachments on Beorn, and keep certain itinerate wizards around for longer than usual. The fact that it leaves characters' traits and keywords but blanks everything else can definitely be used to your advantage. It's more than just some silly helmet in this case, though. I like to go for maximum absurdity and attach a Shield, Captain of Gondor and Support of the Eagles. Once you clear the active quest, none of his gear falls off. A bear that thinks he's human - there is *nothing* more ridiculous than that.\n\nMost of the gear will stop working though, as soon as his immunity comes back. The helm would continue to work for the same reasons that Honour Guards work, but the Shield, Captain and Support would just turn into 5 resources worth of nothing.\n\n \n\nI did take Beorn against the Weather Hills with the intention of taking the opportunity to heal damage from him while Cold from Angmar was out, but that turned out to be unnecessary, as the Sheltered Valley can heal him much more efficiently by being explored as the active location. Taking a resource off the mission is obviously a significant cost, but it was totally worth it to heal 9 damage off the bear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1687885","commentId":1687885,"userName":"Chris51261","timestamp":1436526811,"content":"Cold from Angmar is kinda fun. It can be a pain, but it has some really fun side effects. I was playing with Boromir when it first popped up in Wastes and it put me in a tight spot, since he was doing a lot of defending, but when I put that point of damage on Gandalf and Glorfindel I felt like a genius. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 10, 2015 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688071","commentId":1688071,"userName":"Raven1015","timestamp":1436538290,"content":"Cold from Angmar is great for my OHaUH Gandalf deck. I keep the damage on until the end of the round so that I don't have to raise my threat to keep him, then heal it off with Self Preservation when I want his quest without exhausting text back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688147","commentId":1688147,"userName":"danpoage","timestamp":1436543211,"content":">  \n> \n> > > It's sad that Beorn may be the best hero for the helm but it doesn't fit on his big bear head.\n> > \n> > Oddly enough, in The Weather Hills and The Wastes of Eriador the foul weather gives Beorn the wiggle-room to don the helm. Assign one point of damage to him when Cold from Angmar [http://hallofbeorn.com/Cards/Details/Cold-from-Angmar-TLR] blows by and you are ready to go!\n> > \n> > I must say, I have been abusing the hell out of that card in these scenarios as it allows you to play attachments on Beorn, and keep certain itinerate wizards around for longer than usual. The fact that it leaves characters' traits and keywords but blanks everything else can definitely be used to your advantage. It's more than just some silly helmet in this case, though. I like to go for maximum absurdity and attach a Shield, Captain of Gondor and Support of the Eagles. Once you clear the active quest, none of his gear falls off. A bear that thinks he's human - there is *nothing* more ridiculous than that.\n> \n> Most of the gear will stop working though, as soon as his immunity comes back. The helm would continue to work for the same reasons that Honour Guards work, but the Shield, Captain and Support would just turn into 5 resources worth of nothing.\n> \n>  \n> \n> I did take Beorn against the Weather Hills with the intention of taking the opportunity to heal damage from him while Cold from Angmar was out, but that turned out to be unnecessary, as the Sheltered Valley can heal him much more efficiently by being explored as the active location. Taking a resource off the mission is obviously a significant cost, but it was totally worth it to heal 9 damage off the bear.\n> \n>  \n\nYeah *absurdity* was the operative word in that sentence - I'm not advocating this as some kind of grand strategy. In the game, as in life, I like having a bear in ridiculous garb, running around and pretending to be a man.\n\n \n\nWhen it comes to actual legitimate strategies, I will second what Ian said. Assigning a damage to either version of Gandalf with Cold From Angmar in play is pretty great.\n\nEdited July 10, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688192","commentId":1688192,"userName":"John Constantine","timestamp":1436545151,"content":"That's all seems fun, but I kinda dislike the fact that the encounter deck indirectly boosts player cards. Don't get me wrong, things that get stronger with damage or threat are awesome, but this... it sort of doesn't feels right to me. Like some sort of design oversight. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688324","commentId":1688324,"userName":"Raven1015","timestamp":1436552434,"content":"> That's all seems fun, but I kinda dislike the fact that the encounter deck indirectly boosts player cards. Don't get me wrong, things that get stronger with damage or threat are awesome, but this... it sort of doesn't feels right to me. Like some sort of design oversight. \n\n \n\nI see what you're saying, but I'm not sure it's a design oversight, so much as one of those things you just have to accept as a designer. If you want to blank character boxes, that will hurt 90+% of character cards, but will of course help that small group of heroes/allies with negative stuff in their text boxes. You can either avoid blanking character text boxes, accept that some cards will benefit, or create a ridiculously long (and eventually outdated) set of text excepting certain cards from the effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688350","commentId":1688350,"userName":"Chris51261","timestamp":1436553724,"content":"\"Damage from Cold from Angmar must be dealt to the character you least want it dealt to (you know the one).\" "},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688388","commentId":1688388,"userName":"John Constantine","timestamp":1436555606,"content":"> I see what you're saying, but I'm not sure it's a design oversight, so much as one of those things you just have to accept as a designer. If you want to blank character boxes, that will hurt 90+% of character cards, but will of course help that small group of heroes/allies with negative stuff in their text boxes. You can either avoid blanking character text boxes, accept that some cards will benefit, or create a ridiculously long (and eventually outdated) set of text excepting certain cards from the effect.\n\nYou see, it not that it helps bothers me, but how it helps. \n\n \n\nAbout ridiculously long set of text, here is a solution from the top of my head that could have been used here:\n\n \n\nForced Burden: After Glorfindel exhausts to commit to a quest, raise your threat by 1.\n\n \n\nBurden: Cannot have attachments. Immune to player card effects.\n\n \n\nWhen Revealed: Each player deals 1 damage to a hero he controls. Attach Cold from Angmar to the current quest. (Counts as a Condition attachment with the text: \"Treat each damaged character's printed text box as if it were blank, except for keywords, Traits and Burden effects.\")\n\nEdited July 10, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688604","commentId":1688604,"userName":"Ecthelion III","timestamp":1436567751,"content":"Edit: Never mind. I couldn't see the white text.\n\nEdited July 10, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688631","commentId":1688631,"userName":"Bullroarer Took","timestamp":1436570503,"content":"I didn't see it either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688681","commentId":1688681,"userName":"GrandSpleen","timestamp":1436574447,"content":">  \n> \n> When Revealed: Each player deals 1 damage to a hero he controls. Attach Cold from Angmar to the current quest. (Counts as a Condition attachment with the text: \"Treat each damaged character's printed text box as if it were blank, except for keywords, Traits and Burden effects.\")\n> \n>  \n\n \n\nReal world, though.  No time machine available to go back and slap \"Burden\" on every detrimental text box effect for player cards.  Gotta come up with something actually workable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1688899","commentId":1688899,"userName":"John Constantine","timestamp":1436596813,"content":"Yeah, I know. That's why I used the \"design oversight\" term. Designers didn't cared when they introduced stuff like Beorn hero. Not much that can be done now.\n\nEdited July 11, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1770034","commentId":1770034,"userName":"Nickpes","timestamp":1441220604,"content":"Just finished the Helms Deep quest on my LotR Saga Campaign ... seems offtopic in the first place but no\n\n \n\nOne of the horoes I had with me was Merry, I was using his tactic version from the beggining of my campaign. Since I wanted him also on the Road to Isengard, I did not change him but wanted also a Spirit hero for Rohan cards (other heroes are Gandalf who came back from the dead and Eomer, whom I will change on the next but anyway). I thought I could use Spirit Merry for the first time, never played him before. \n\n \n\nWell his ability was the single reason I won the quest. With my threat on 49 (while everything else was going ok. my deck was very nice on the table) -never thought to use his ability up till then- ,  an orc with threat 3 came out ... and while i was crying my defeat cause at the end of turn I would go to 50, there came a blast on my mind, I exhausted him and reduced my threat to 46. Next turn again another 3 threat enemy, an Uruk Hai came, reduced on 44, and next turn I won the quest !!!! His ability can be a real winner and I guess he will combine nicely with spirit Frodo to keep threat low after Frodo defending ... What a great hero indeed\n\nEdited September 2, 2015 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/181552-wastes-of-eriador-spoilers-on-cardgame-db/?do=findComment&comment=1777286","commentId":1777286,"userName":"midwestborn86","timestamp":1441489146,"content":"I think it's great encounter cards can benefit you. It opens up so many deck design strategies. Essentially every deck or set of decks of 50 you build are to tackle one puzzle. Each piece you include is in some way a counter to get an edge on the puzzle. Using Thalin in a quest with 1 HP enemies is no different than designing a strategy to control the encounter deck or making the encounter cards work for you. It's another way of negating or limiting the opposing puzzle as much as possible. Caleb and Matt talked at gen con how they want to game to keep expanding horizontally without too much vertical power creep. Mission accomplished. I think the most recent quests in this last cycle are some the best quests by far. They are challenging in the right way. Like a \"play true to you strategy and hope for the best with some bad luck possible\" instead of massive bombs of \"game over\" cards. This last Ettenmoors quest is one of my favorites ever. When I lose on that or the Eriador Wargs it's still fun. When I lost on Hobbit boxes, or to some extent Andros I just didn't want to play anymore.\n\n \n\nYet even if you don't want to tailor the deck build, every quest so far in the 5th cycle has been totally approachable with a classic power card deck. You can throw together 2 typical spirit questing and tactics locking decks that folks have been using since the first two cycles and approach all these new quests with hope of victory.\n\nEdited September 5, 2015 by midwestborn86"}]}