{"url":"https://community.fantasyflightgames.com/topic/181799-best-nm-quests/","title":"Best NM quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/181799-best-nm-quests/?do=findComment&comment=1680721","commentId":1680721,"userName":"jjenks476","timestamp":1435974889,"content":"Their have been a few threads on the best quests in the game, but none recently on Nightmare. NM has really reinvented the game for me, and I wanted to see which quests the community at large has most enjoyed.\n\nI want to divide the quests into 3 categories, Best Improvement, Best Thematic, Best Artwork.\n\n \n\nFor Best Improvement quests, I want to list the 5 quests that I feel were rather lackluster originally but got exponentially better with the NM version.\n\n \n\nJourney Down the Anduin: This is one of everybody's favorite quests but I was always annoyed with how easy the quest could be depending on the cards you drew, the NM definitely made the quest consistently difficult and forced you to cater to certain possibilities such as the 10 threat location and the return of the Hill Trolls.\n\nBest card: Gladden Marshlands\n\n \n\nHunt For Gollum: This quest is not incredibly difficult but it changed it from a laughably easy trudge through Mirkwood. Now I enjoy searching for Gollum and find myself always worried about those Hawks and Wolves calling to the Hunters, great addition to the quest.\n\nBest card:Hunting Warg\n\n \n\nThe Seventh Level: This is another fun quest but lacked real danger until the Goblin stacking came out in the NM version. I love how all the Goblins build off each other and you get overwhelmed by swarms of little meat eaters, finally some real tension.\n\nBest card: Orc Taskmaster\n\n \n\nEncounter at Amon Dun: I would play this quest frequently to test new decks and because I loved the theme, but it was a walk in the park. There was never real threat of losing, and those villagers didn't even seem to need our help. NM turned it into one of the most difficult quests in the game in my opinion. The villagers really get chopped apart like so much wood. Now it is an amazing quest\n\nbest card: Run for your Lives! \n\n \n\nFoundations of Stone: I always wanted to enjoy this quest, but the Nameless things were wimps...Until 2.0 that is where they become the demons we heard about in the book, monsters older and more frightening than the Balrog. I have yet to beat this one, but enjoy it every time.\n\nBest card: Primeval thing, scary difficult\n\n \n\nMost thematic\n\n \n\nThe Redhorn Gates: It's all snow and weather, the giants and Orcs look like they live on those mountains, the Blinding Blizzard and Snow effects work well mechanically.\n\nBest card: Snow Giant, pain in the butt, throwing stones and all\n\n \n\nConflict at the Carrock: you feel as if you have stumbled into a troll lair with no one particularly happy to see you. The 2 headed troll and the assortment of little ones all remind me of a dysfunctional family out for blood.\n\nBest card:Savage Hill troll, they like to gang up on you\n\n \n\nInto Ithilien: They stripped away everything but the Harad and Archery, and it really comes to life. You feel as if your in a dark forest, and going to be ambushed any second. Best card, Savage Fray, switches it from battle to siege or vice versa and makes you feel very nervous knowing this could come out.\n\n \n\nA Knife in the Dark: This quest was already top notch, but the new cards just make it so much more creepy. Those Nazgul are lurking around every corner!\n\nBest card: Menacing Wraith, adds a few more intense enemies\n\n \n\nMorgul Vale: The race is finally on, there is now a definite chance of the enemy escaping, and all the enemies keep pumping the Captains! \n\nBest card: Warrior of Nurn\n\n \n\nBest artwork:\n\n \n\nAssault on Osgiliath: The fight among the castle and fierceness of the enemy is captured very well.\n\nBest card: Haradrim Warrior\n\n \n\nShadow & Flame: All grim and fiery.\n\nBest card: Morgoth's Bidding, that guy is toast\n\n \n\nThe Dead Marshes: Dripping with mire and muck\n\nBest card: The Mere of Dead faces, creepy location\n\n \n\nShadow of the Past: Just perfect, love the Nazgul\n\nKhamul the Easterling, #1 favorite card for art\n\nEdited July 4, 2015 by jjenks476"}]}