{"url":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/","title":"Am I doing something wrong..?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690115","commentId":1690115,"userName":"Zerg","timestamp":1436731783,"content":"I just picked up the Core set from Amazon and played through the introductory scenario with a difficulty of 1.\n\n \n\nI played the Leadership deck, removed all \"difficult\" encounter cards (orange border in the circle thing) and started each Hero with 1 resource token.  2 rounds into the game, 2 Heros are dead and gone and the threat was at 40.\n\n \n\nIs the game really this hard?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690118","commentId":1690118,"userName":"John Constantine","timestamp":1436732137,"content":"Well, I'm not psychic, but theoretically it could have been grave unluck. I'm a bit curious how the stuff you described happened, though. Starting core Leadership threat is 29 + 2 for 2 rounds = 31. Where did that 9 threat came from? You didn't commit anyone to the quest? If so, how 2 of your heroes ended up dead on turn 2?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690130","commentId":1690130,"userName":"Zerg","timestamp":1436733299,"content":"I won't be able to provide specifics as everything is all packed up ready to return.  I thought it would be fun but it just felt like draw, exhaust, repeat with huge emphasis on hoping you pull good cards.  Now, I realize it is a deck building card game (duh!), so hindsight I probably shouldn't have pulled the trigger.\n\n \n\nI was really hoping the game would have provided more a feeling of exploration/questing in Middle Earth with some combat.  Instead, I felt constantly under threat with zero feeling of \"exploring\" Middle Earth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690136","commentId":1690136,"userName":"John Constantine","timestamp":1436733905,"content":"Well, wait for it, people will arrive to persuade you that you're wrong pretty soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690144","commentId":1690144,"userName":"Gizlivadi","timestamp":1436734616,"content":"Wow, so you only played 1 game and already decided to return it? That's pretty lame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690154","commentId":1690154,"userName":"Zerg","timestamp":1436735764,"content":"A quick look at the encounter/quest cards provides a pretty good idea that this game is entirely focused on being constantly under threat and less about exploring Middle Earth with questing.  To me, not all \"questing\" is combat focused - it could be seeing a new place, meeting new people and the social interactions around the characters.  I don't fault the game for any of it, it's just not for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690167","commentId":1690167,"userName":"joezim007","timestamp":1436736504,"content":"If that is what you are looking for then it definitely isn't the game for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690179","commentId":1690179,"userName":"Gizlivadi","timestamp":1436737217,"content":"I agree with Joezim, although I totally understand where you come from. This game does feel too combat-focused to me, I wish we could visit places like the Shire or Edoras or Lórien, but since every quest needs to have enemies, there's nothing to do over there. I strongly recommend you try Middle Earth CCG by Iron Crown Enterprises. Although discontinued, IMO that game had not only better theme than this one, but it actually let you visit some of the \"good\" places in order to gather allies, find items, information, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690219","commentId":1690219,"userName":"SauronTheGreat","timestamp":1436739490,"content":"I think you ought to give the game another chance.  the game is somewhat combat focused, but you do get some of what you were talking about.  the theme is also great in some quests.  I would go check out a video by glaurung or something if your having trouble cause you may not be playing it right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690234","commentId":1690234,"userName":"jnicol","timestamp":1436740738,"content":"I suspect you were playing one or more rules incorrectly for 2 heroes to be dead within 2 rounds, but in any case it sounds like the game isn't what you were expecting. Combat is certainly a big part of the game, and I don't think you'll find the type of character interactions that you're describing in the core set.\n\nStill, if you were playing the rules incorrectly then it could explain your quick defeat and your negative impression of the game. If you're willing to give it another shot then I suggest watching a playthrough video (I started with the \"watch it played\" YouTube channel). If it's still not clicking then post a turn-by-turn session report and there are plenty of experienced players here who will be happy to explain any mistakes you might have made."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690399","commentId":1690399,"userName":"Brian_66","timestamp":1436753806,"content":"Hang in there and don't give up. This game took a few tries for it to really sink in for me. I also watched a lot of YouTube videos to see how other players tackled these scenarios.\n\nAnyway, I too am a fairly new player and now absolutely love this game. I have been playing solo every quest for the past 10 months and have worked my way up to the Heirs of Numenor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690489","commentId":1690489,"userName":"Chris51261","timestamp":1436760644,"content":"Also since I haven't see anybody say it yet: stop playing with the preconstructed decks. Those are the absoloute worst. You picked probably the only one that even functions at all, but even then it's just awful. Throw together your own deck with two spheres, or look up a deck online that uses one core set, or even send me a message if you haven't returned the game and I'll make you one. I question why they even put the preconstructed decks in there, since it's basically \"every card of a certain sphere and Gandalf.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690862","commentId":1690862,"userName":"SauronTheGreat","timestamp":1436798949,"content":"yah!  didn't think of that!  Kudos to Chris!  a good percentage of the fun in this game is deck building.  thats were much of the lore and theme appear.  you can piece together a deck with a dwarf theme, an elf theme ect...  for example, the new saga quest, you can play with the fellowship.  If you get two buds, the three of you can have all 9 members."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1690981","commentId":1690981,"userName":"Raven1015","timestamp":1436805050,"content":"Honestly, I think the only non-digital experience that gives you the exploration/questing/character interaction experience you are describing is an RPG. The One Ring RPG is pretty fantastic if you have players to join in. A card game can only do so much in that respect. This game does place a heavy focus on combat and exploring \"bad\" locations only. But if that is not a total turn-off, there's a ton of theme to be had.\n\nEdited July 13, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1691171","commentId":1691171,"userName":"Ecthelion III","timestamp":1436814409,"content":"I agree with Raven. RPGs are the way to go for you; NPCs are a weak point in this game IMO.\n\n \n\nAlso, think of this game as a competitive card game, you vs. the encounter deck.\n\nEdited July 13, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1691231","commentId":1691231,"userName":"Lecitadin","timestamp":1436817049,"content":"We've all been there, especialy for solo playing. DON'T GIVE UP! This IS a very cool game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182375-am-i-doing-something-wrong/?do=findComment&comment=1691276","commentId":1691276,"userName":"JohnGarrison1870","timestamp":1436818614,"content":"> ...it just felt like draw, exhaust, repeat with huge emphasis on hoping you pull good cards....I felt constantly under threat with zero feeling of \"exploring\" Middle Earth.\n\n \n\nI felt as you did at first. Even with some deckbuilding, it just seemed like a mechanical grind with too much of an element of chance. After a dozen plays though, and reading blogs, etc., I started to appreciate all the varied subtleties.\n\n \n\nThe feeling of being under constant threat is indeed a prevalent theme in this game. And I understand how it didn't feel like you were exploring anything. I will say however that the introductory quests in the core set are not that great (especially the first one), and some of the adventure packs do a very excellent job of mixing things up. Also, many of them are not as straightforward combat hack-fests as the core set adventures are, although there is a fair amount of combat still I admit.\n\n \n\nAt first I didn't like the fact that you will lose more than you win, especially early on. The game only gets better and better with more plays though, at least for me, and although it's not everything I had originally hoped it would be I've discovered it contains many delightful things I never expected. Overall, what originally was a lark purchase that I thought would be a minor diversion is looking like it might become a lifestyle for me. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI believe if you give yourself more time to work into it (going gradual so as not to be overwhelmed), you may be surprised how it grows on you.\n\n \n\nBut on the other hand, it sounds like you were looking for a very specific experience, and I will be amongst the first to admit this game has many features which will simply turn off plenty of people."}]}