{"url":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/","title":"Haldir + Ranged Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/?do=findComment&comment=1689754","commentId":1689754,"userName":"Jban","timestamp":1436696028,"content":"Hi all,\n\n \n\nI'm once again confused by all Ranged things.\n\n \n\nQuestion 1: When you have Haldir and you use his combat action to attack into the staging area I know it is not a ranged attack, but if you use his combat action to attack an enemy engaged with another player. Is it considered to be a ranged attack or not? This is mainly of importance for the Rivendell Bow since an instakill of 7 or 8 might make the difference.\n\n \n\nQuestion 2: If you use Quick Strike with Bard as subject and he attacks an enemy engaged with another player, is it considered to be a ranged attack?\n\n \n\nMy first thoughts on these 2 question (which are identical I think) would be \"no\" for Question 1 and \"yes\" for Question 2. But since the questions seem identical to me, I guess the answer for both questions would be \"yes\".\n\n \n\nGreetings,\n\nJban\n\n \n\nPS: I know Hands Upon The Bow does not grant any Ranged benefits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/?do=findComment&comment=1689836","commentId":1689836,"userName":"PocketWraith","timestamp":1436709802,"content":"A ranged attack is defined as an attack on an enemy engaged with another player, so the answer is yes to both those questions.\n\nYou are correct however that attacking into the staging area does not qualify as a ranged attack, with the exception of the Great Yew Bow, as that specifically says on the card that it lets you make a ranged attack against the enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/?do=findComment&comment=1689860","commentId":1689860,"userName":"Seastan","timestamp":1436711579,"content":"From the FAQ\n\n>  \n> \n> Q: What counts as a “ranged” attack?\n> \n> A: A ranged attack is an attack made by a character with the ranged keyword against an enemy engaged with another player.\n\n \n\nSo unless there is a special ruling on these effects, I am in agreement with PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/?do=findComment&comment=1690580","commentId":1690580,"userName":"ppsantos","timestamp":1436776044,"content":"I hope FFG would also consider as \"ranged\" attack those attacks made against enemies which require \"ranged\" to be eligible to be attacked (even if the enemy is not engaged with another player or enemy still in the staging area).  For example,\n\n \n\n1.  attacks vs Goblin Archer (KD 32). - \"Characters with ranged are eligible to attack Goblin Archer while it is in the staging area\"\n\n2. attacks vs Black Forest Bats (SoM 71) - \"Only Eagle characters or characters with ranged can attack or defend against Black Forest Bats\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/182349-haldir-ranged-attack/?do=findComment&comment=1690797","commentId":1690797,"userName":"PocketWraith","timestamp":1436795356,"content":"You hope in vain, because the above FAQ entry is the only definition of a ranged attack we have. Hands Upon the Bow also requires Ranged to use it, but it doesn't count as a ranged attack because it doesn't fit that definition.\n\nYes, this is kind of dumb."}]}