{"url":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/","title":"State of the Game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691563","commentId":1691563,"userName":"TragicTheBlathering","timestamp":1436837137,"content":"So how is this game going?\n\n \n\nI have basically been out for a while. I have felt that there is so much content now, I couldn't ever play them all. So I sorta stopped.\n\n \n\nStill I keep an eye on it and was just wondering what you guys think of the game at the moment. I am only uptodate until the Shadow Cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691571","commentId":1691571,"userName":"Glaurung","timestamp":1436837680,"content":"Game is better and better with every cycle. The last cycle and new nightmare quests are amazing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691582","commentId":1691582,"userName":"Gizlivadi","timestamp":1436839002,"content":"Long story short, Caleb Grace and Matt Newman (Feonix) took over the design after the Against the Shadow cycle, and they seem to focus quest design on innovation and decision making rather than raw difficulty (although many of the new quests are the hardest the game has ever had). Player card wise, cards are a lot more balanced and they are more focused on expanding the synergies \"horizontally\", which means traits and abilities rely more on creative mechanics that encourage decision making and thought, each trait having distinct strengths and weaknesses rather than mindless global buffs like early Dwarves and Outlands. My personal opinion is that the game is better than ever.\n\nEdited July 14, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691584","commentId":1691584,"userName":"TragicTheBlathering","timestamp":1436839058,"content":"@Glaurung [https://community.fantasyflightgames.com/user/163228-glaurung/] - hey dude, cool to see you are still around!\n\n \n\nAre the quests worth playing in there vanilla state now, or should we still just wait for the nightmare packs?\n\n \n\nAlso I was kinda worried at how fast nightmare was coming out... do the current nightmares stack up to the player decks? It seams that the nightmare packs are coming out so fast there is no real time for the player decks to get a lot stronger.\n\n \n\n@Gizlivadi [https://community.fantasyflightgames.com/user/185970-gizlivadi/] - That is cool. I think that the more \"story telling\" quest are by far my favorite.\n\nEdited July 14, 2015 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691605","commentId":1691605,"userName":"PsychoRocka","timestamp":1436841039,"content":"Nightmare has definitely upped the ante and feels like a new level of difficulty. The last few Dwarrowdelf nightmare packs (foundations and shadow and flame) are crazy hard and so are most of the Against the Shadow and Heirs of Numenor nightmare packs. Considering that the earlier cycles are far easier than Against the Shadow this was inevitable.\n\nI personally actually hope that Nightmare quests for VOI and the ringmaker cycle are a little easier than the recent nightmare packs we've got. \n\n \n\nTotally agree with everything that Gizlivadi said, the game is better than ever. New quests are innovative and unique and player cards continue to be more nuanced and are powerful depending on game state rather than just a flat power level (cards that grow in power based on saving resources, being engaged with many enemies etc). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1691788","commentId":1691788,"userName":"DukeWellington","timestamp":1436862301,"content":"I would agree that the game is better than ever. In fact, I would say that the last two cycles have made the player cardpool vastly more interesting and flexible. The addition of Galadriel and the improvement of Rohan and Gondor have allowed for far greater variety of power decks or theme decks.\n\nOn the other hand, the last cycle did kind of go down hill in terms of quest quality. The story and setting for against the shadow was so amazing that the ring maker stuff seemed a bit of a let down, and time mechanics are annoying. I look forward to this next cycle a lot, however, and the Saga quests are always top notch. I think it is easier than ever to play the game for flavor and story rather than puzzle solving, which is great.\n\nAll in all, the game is significantly improved, which is saying a lot because I liked it a ton immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1692082","commentId":1692082,"userName":"DurinIII","timestamp":1436887231,"content":"Just saying hey to you guys! I too, like Tragic have been away for awhile. Still play at least one game solo every morning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1692664","commentId":1692664,"userName":"shoreless","timestamp":1436921551,"content":"It's all over. Should be canceled by the end of the cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182462-state-of-the-game/?do=findComment&comment=1692792","commentId":1692792,"userName":"Glaurung","timestamp":1436935465,"content":"Hey Tragic im always here since begin of lotr. Also I always check your channel for your videos, im big fan if your AH series!\n\nLotr is pretty cool now yes!\n\nIf you remember alk my complaint couple of years ago so designers fix it now. Game is cool you should try it specially nightmare for Khazad-Dum. Im sure you will love it!"}]}