{"url":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/","title":"I had a thought: Sword-thain","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690572","commentId":1690572,"userName":"Fingolfin Fate","timestamp":1436774379,"content":"Look what I wrote below amid the Second Thoughts for Ingold (near the top of the page).\n\n \n\nhttps://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/ [https://community.fantasyflightgames.com/topic/181558-reaction-series-wastes-of-eriador/]\n\n \n\nOf course, the designer had thought of it before, it just feels \"interesting\" to have an idea for a card, and then see it coming: less then a fortnight apart.\n\n \n\nBy the way, I had thought the attachment could be a bit cheaper but I think it is about right. If you play it early, or with a discount, the cost should pay off eventually. However, I do think you need a specific deck to make Sword-thain effective: just as those mentioned in the article or on the forum. Igold himself can get a little stronger with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690710","commentId":1690710,"userName":"joezim007","timestamp":1436789597,"content":"Yeah and I've seen something similar to sword thain discussed elsewhere on this forum as an idea but I kinda just brushed it off my shoulder because I thought the logistics of it would cause too many odd exceptions and I still do. There have already been so many questions asked about whether or not something works in relation to that card. I love the idea and the possibilities of opens up, but I'm not convinced that it has gotten all the links worked out. There may be quite a bit of FAQ dedicated to this card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690735","commentId":1690735,"userName":"Fingolfin Fate","timestamp":1436790851,"content":"Yeah, I wonder.\n\n \n\nRight now, I believe it will be sorted quickly, but I see where the concerns are coming from."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690736","commentId":1690736,"userName":"Distractionbeast","timestamp":1436790896,"content":"Does this new hero get a threat cost?  Is it zero?  Does the sphere of influence become a resource icon?  Is it a printed resource icon?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690745","commentId":1690745,"userName":"Fingolfin Fate","timestamp":1436791386,"content":"Yeah, the threat cost is a very good question. The card could have addressed it right away. The icon for sure, and yes, it is printed since it was printed on the ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690784","commentId":1690784,"userName":"John Constantine","timestamp":1436794414,"content":"> Does this new hero get a threat cost?  Is it zero?  Does the sphere of influence become a resource icon?  Is it a printed resource icon?\n\nBy default I would assume it's 0, they may rule his threat cost to be a regular cost though. But until ruled otherwise - it's zero.\n\nYes, it's clear from the article that turned ally is considered to have printed resource icon of his sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690978","commentId":1690978,"userName":"Raven1015","timestamp":1436804886,"content":"Yeah, probably safe to assume that it's zero. We can kind of treat it as an X case, an unknown variable, where the variable is not given a value, then it's zero. I realize that this is not exactly the same case, but I think the logic applies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690994","commentId":1690994,"userName":"joezim007","timestamp":1436805629,"content":"Yeah I think it's 0 as well. What happens when you give Sword Thain to an ally that was brought into play via Sneak Attack? Probably doesn't leave play, but these types of interactions aren't super clear and I forsee more of these popping up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1690995","commentId":1690995,"userName":"PocketWraith","timestamp":1436805631,"content":"Threat cost only matters at the start of the game anyway, unless you use The Fall of Gil-Galad.\n\n \n\n@^: On the contrary, I'm pretty sure they would still leave play., simply because it would be ridiculous if they didn't. And ridiculous things pretty much only happen in this game when they're negative for the players.\n\nEdited July 13, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1691020","commentId":1691020,"userName":"joezim007","timestamp":1436806748,"content":"> Threat cost only matters at the start of the game anyway, unless you use The Fall of Gil-Galad.\n> \n> @^: On the contrary, I'm pretty sure they would still leave play., simply because it would be ridiculous if they didn't. And ridiculous things pretty much only happen in this game when they're negative for the players.\n\nThreat cost also matters when encounter effects work based off threat cost. Also Sneak Attack specifies \"ally\" still needs to be in play and then bring \"ally\" back to hand.\n\nI'm wondering at what point after the character is discarded or destroyed it goes from hero back to ally. If something like Landroval works to resurrect him, it will definitely not be a hero anymore when it gets back, but that is still a decent-sized if. I think Landroval's ability would trigger from the hero being destroyed, but I don't think he'd be able to bring the character back, since it says \"put that hero back into play\" which means it would currently be out of play which means it is no longer a hero so I don't think it would qualify as \"that hero\" anymore.\n\nThis is all just speculation on my part at this point, but it shows the kinds of issues this card brings up. If it is a legit target at the beginning of the effect, will it always remain so throughout the rest of the effect despite changing card types in the middle?\n\nEdited July 13, 2015 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1692683","commentId":1692683,"userName":"Edvando","timestamp":1436923764,"content":">  \n> \n> > Threat cost only matters at the start of the game anyway, unless you use The Fall of Gil-Galad.\n> > \n> > @^: On the contrary, I'm pretty sure they would still leave play., simply because it would be ridiculous if they didn't. And ridiculous things pretty much only happen in this game when they're negative for the players.\n> \n> Threat cost also matters when encounter effects work based off threat cost. Also Sneak Attack specifies \"ally\" still needs to be in play and then bring \"ally\" back to hand.\n> \n> I'm wondering at what point after the character is discarded or destroyed it goes from hero back to ally. If something like Landroval works to resurrect him, it will definitely not be a hero anymore when it gets back, but that is still a decent-sized if. I think Landroval's ability would trigger from the hero being destroyed, but I don't think he'd be able to bring the character back, since it says \"put that hero back into play\" which means it would currently be out of play which means it is no longer a hero so I don't think it would qualify as \"that hero\" anymore.\n> \n> This is all just speculation on my part at this point, but it shows the kinds of issues this card brings up. If it is a legit target at the beginning of the effect, will it always remain so throughout the rest of the effect despite changing card types in the middle?\n> \n>  \n\n \n\nYeah, there is a lot of wierd cases with that card.\n\n \n\nThe thing is, it is fun. The designer are not playing safe. Thankfuly this is not a competitive game, because if we were that card would be a pain.\n\n \n\nIf the designer only play safe, we get a lot of boring and safe cards. I agree that if a fan came up with that idea, I would probable argue that card would have a lot of problems, and it has. Still, I like it exist.\n\n \n\nMy problem now it is too costly to be good, but game balance is not the topic here, i think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1692721","commentId":1692721,"userName":"Chris51261","timestamp":1436928247,"content":"I sent some questions to Caleb regarding this card. I forgot the sneak attack one though, which actually is kind of puzzling. I know for a fact Landroval doesn't work, because when the ally turned hero is destroyed, it immediately becomes an ally again, so it can't trigger Landroval's response. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1692736","commentId":1692736,"userName":"joezim007","timestamp":1436929089,"content":"Well let us know what you hear back from him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1692744","commentId":1692744,"userName":"Lecitadin","timestamp":1436929555,"content":"Doesn't seem too complicated for me : an ally becomes a Hero, collects ressources and get get targeted by cards specifically for heroes, like Unexpected Courage, fast Hitch, Resourceful, or can boost other heroes as well, like tactics Merry, etc. \n\n \n\nThe new hero/ally can also be targeted by Condition cards or damage, and so forth. I'm sure there will be amazing stuff to be done with this card! And cards like Tome of Atanatar become free to play with 4 heroes!!\n\n \n\nAnd when the hero/ally dies, as usual, the attachment is discarded and the ally, who is not a hero anymore.\n\nEdited July 15, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694548","commentId":1694548,"userName":"Chris51261","timestamp":1437080122,"content":"I just got an answer. Sneak attack allies do not return to your hand, as they're not an ally anymore. I'll post the official answer when I get home."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694733","commentId":1694733,"userName":"PsychoRocka","timestamp":1437093587,"content":"So you could sneak attack Gimli or Legolas ally during the planning phase and then play Sword Thain on them and they would then stay in play. Thats a pretty goddamn good combo!!!!! They already cost 4 so instead of 4 tactics/leadership resources to get a badass ally out you can pay 1 leadership resource and 4 neutral resources (1 more resource but 4 of the 5 are neutral) to get the same said badass ally out and turn them into a hero that then generates a resource of his own each turn as well as any other benefits (hero only attachments, events, readying etc). That is some insanely good value right there. \n\nEven more so with Beorn! 1 leadership and 4 neutral resources instead of 6 tactics resources (so actually cheaper!) to play him and turn him into a Hero.\n\n \n\nDid you ask about ally Beorn? Might not be the same ruling as Sneak Attack specifically states: \"At the end of the phase, if that ally is still in play, return it to your hand.\" \n\nNote it says if that ALLY is still in play and technically that ally is not still in play as it is now a hero whereas ally Beorn states: \"At the end of the phase in which you trigger this effect, shuffle Beorn back into your deck\".\n\nThe card simply refers to itself so I imagine the golden rule would kick in and although heroes cannot be shuffled into your deck/hand like Lost and Alone this would be superseded by the text on Beorn ally (now beorn hero!) and he would return back to your deck. \n\nEdited July 17, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694736","commentId":1694736,"userName":"Chris51261","timestamp":1437093800,"content":"I did. It's the golden rule. I can post that too when I get home and have access to my emails."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694749","commentId":1694749,"userName":"awp832","timestamp":1437095088,"content":"Sword Thane(any eligible lore ally) +Aragorn(lore) +Mirlonde?\n\nEdited July 17, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694826","commentId":1694826,"userName":"Chris51261","timestamp":1437105525,"content":"So here's all the questions I asked for those curious or wanting exact wording:\n\n \n\nHey Caleb, one more question about Sword-Thain: if you were to put an ally into play during your planning phase, and then play Sword-Thain on it, would it still return to your hand at the end of the phase, since Sneak Attack specifies \"if that ALLY is still in play return it to your hand?\"\n\n \n\nGreat question. If you use Sneak Attack to put an enemy into play, and then play Sword-thain on that ally, that ally would not be returned to your hand at the end of the phase because it would no longer be an ally.\nCheers,\nCaleb\n\n \n\nHello! So I was just reading on the forums about the newly spoiled Sword-Thain card, and a question came up about what happens when the ally become hero has card text that refers to returning them to a player's hand or deck, as heroes cannot do this. For example, is ally Beorn able to use his ability and not get shuffled back into the player's deck?\n\n \n\nThe Golden Rule for the game requires that a hero Beorn must be returned to your hand if you trigger his Action while Sword Thain attached. The text on the card still super-cedes the rules for the game.\n\nCheers,\nCaleb\n\n \n\nIn a similar vein, how does Landroval work with this new card? If it is placed on him, I wouldn't think he could activate his ability if he were destroyed, but if another ally with this attachment is destroyed, can Landroval save them? Or have they already lost the hero distinction and been rendered an invalid target?\n\n \n\nLandroval’s Response triggers “After a hero card is destroyed…” An ally with Sword-thain attached will lose the hero card type after it is destroyed and Sword-thain is discarded. That means at the moment Landroval can trigger his effect, the ally would no longer be a valid target.\n\n \n\nAlso Mirlonde's ability wouldn't do anything to the threat cost of the ally with Sword-Thain on it, since its threat cost is 0 and it cannot be lowered below that. Returning to starting threat with Aragorn would still be back to 18."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1694931","commentId":1694931,"userName":"Fingolfin Fate","timestamp":1437118705,"content":"I think the Mirlonde and Aragorn question was obvious -- once we established that the threat cost is 0.\n\n \n\nGood to hear about Sneak Attack. It gives it another good combo (and the Thain)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1695119","commentId":1695119,"userName":"Chris51261","timestamp":1437138839,"content":"Oh, full disclaimer, I did not ask that one to Caleb, there's just no doubt in my mind that's how it works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1695509","commentId":1695509,"userName":"Bullroarer Took","timestamp":1437157481,"content":"As I read the rules, during the planning phase players take turns playing out allies and attachments.  THEN there is an action window when events can be played. So strictly speaking I don't see how the Sneak Attack can be played before Sword Thain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1695531","commentId":1695531,"userName":"Chris51261","timestamp":1437158727,"content":"Nah, green windows mean before, during and after you're able to take actions. Events are only limited to those. If it worked how you described, you couldn't play Steward of Gondor, activate it, and then use those resources to pay for allies or attachments that turn, for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1695534","commentId":1695534,"userName":"Fingolfin Fate","timestamp":1437159002,"content":"Yes, this has been addressed already for the quest phase. People had originally thought there would be no time to commit the Sneaked ally to the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1695630","commentId":1695630,"userName":"Bullroarer Took","timestamp":1437163459,"content":"Of course... I need more sleep."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1698477","commentId":1698477,"userName":"gandalfDK","timestamp":1437430669,"content":"So Sneak Attack Gandalf would still get discarded at the end of the round?\n\nAnd Hobbit Gandalf still requires the two threat?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1698490","commentId":1698490,"userName":"PocketWraith","timestamp":1437431413,"content":"You can't attach Sword-Thain to Gandalf, as Sword-Thain attaches to a unique ally \"belonging to any sphere of influence,\" which Gandalf does not, being Neutral.\n\nBut if you could, then yes, those would apply, as the ally still keeps all their card text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1698526","commentId":1698526,"userName":"Chris51261","timestamp":1437433009,"content":"Basically if something seems too good to be true - it probably is. Always look for the Golden Rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1699565","commentId":1699565,"userName":"gandalfDK","timestamp":1437505876,"content":"Yeah, I knew, but I wanted to make sure I understood that the ally kept it's text.\n\n \n\nToo bad indeed. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1747309","commentId":1747309,"userName":"JanB","timestamp":1440150160,"content":"What about Verteidiger des Westens (Defender of the West) [http://deckbauer.telfador.net/card.html&id=5746] previously attached on an unique ally, which gets now Sword-Thain attached?\n\n \n\nI think Defender of the West will now have no effect, because its text targets an ally and not a hero. Other attachments a worded \"attached character\" ..\n\nEdited August 21, 2015 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1748662","commentId":1748662,"userName":"joezim007","timestamp":1440207419,"content":"Correct, Defender of the West would stop working because its ability specifies \"ally\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=1748684","commentId":1748684,"userName":"Authraw","timestamp":1440208589,"content":"Too bad! It would be fun to have a hero pass useful resources around the table. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052644","commentId":2052644,"userName":"Nickpes","timestamp":1455526519,"content":"If I play ally Elrond, then play on him Sword Thain ... does he still discard at the end of turn? Since ally Gandalf does not discard I guess he does not, but I just want to be sure"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052645","commentId":2052645,"userName":"Fingolfin Fate","timestamp":1455526667,"content":"No, I think both discard.\n\nThe other thing is with Sneak Attack. If you sneak an ally in play, and then you attach the Sword to him (so you basically have got to do it in planning, unless you use, say, Vilya), the ally-turn-hero no longer comes back to your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052652","commentId":2052652,"userName":"Nickpes","timestamp":1455527027,"content":"So in order for it to work on an ally that discards at the end of turn, the ally must be sneaked, not played from hand?\n\nEdited February 15, 2016 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052655","commentId":2052655,"userName":"Fingolfin Fate","timestamp":1455527258,"content":"Oh, sorry about the confusion. I just used the Sneak as an example of not returning the ally into your hand because he is no longer an ally. I believe the ones that discard: Galadriel, Elrond, Saruman, Gandalf (The White Council just doesn't like to linger about I guess), will discard no matter what."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052678","commentId":2052678,"userName":"John Constantine","timestamp":1455528772,"content":"I wish I could give Saruman a resource icon so I can Sword-thain him... :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nThat would be totally nuts by the way, as the thing he disabled would stay disabled until the end of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052679","commentId":2052679,"userName":"PocketWraith","timestamp":1455528852,"content":"Except you'd still have to discard him at the end of the round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052690","commentId":2052690,"userName":"John Constantine","timestamp":1455529557,"content":"Oh. Yeah. And that :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI officially request a character blanking attachment!\n\nEdited February 15, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2052728","commentId":2052728,"userName":"Fingolfin Fate","timestamp":1455534737,"content":"Well, some of the encounter cards blank them. It is usually awful when that happens, but sometimes it can actually help: Beorn (if the you have a healing event) or the above-mentioned White Council (because I think neither of them will get discarded at the end of the round as the effect of the encounter card also lasts till the end of the round)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2053153","commentId":2053153,"userName":"joezim007","timestamp":1455554103,"content":"> Oh. Yeah. And that :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n> \n> I officially request a character blanking attachment!\n\nOK but then you'll also lose the ability you want to keep."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2053298","commentId":2053298,"userName":"John Constantine","timestamp":1455558867,"content":"But then I get a hero of my dreams."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182402-i-had-a-thought-sword-thain/?do=findComment&comment=2053519","commentId":2053519,"userName":"joezim007","timestamp":1455565324,"content":"I guess the stats alone are worth keeping around, and of you're someone who thinks Saruman should be a hero, I can dig it."}]}