{"url":"https://community.fantasyflightgames.com/topic/182436-helms-deep/","title":"Helm&#039;s Deep","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182436-helms-deep/?do=findComment&comment=1691121","commentId":1691121,"userName":"mroni","timestamp":1436811674,"content":"Hi. I've got question about resolving \"forced\" effects from quest cards. Suppose that I \"stay\" in stage 1B. At the end of the round, I have \"forced\" effect to advance to stage 2A. After I resolve \"when revealed\" in 2A, I proceed to 2B. And my question is: Do I have to resolve \"forced\" effect of 2B in this round (still first round) or not? Thanks for your help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182436-helms-deep/?do=findComment&comment=1691177","commentId":1691177,"userName":"Ecthelion III","timestamp":1436814685,"content":"My opinion is no. All effects that trigger at the end of the round should trigger simultaneously.\n\nEdited July 13, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182436-helms-deep/?do=findComment&comment=1691283","commentId":1691283,"userName":"GrandSpleen","timestamp":1436818870,"content":"I don't think you have to resolve it.\n\n \n\nThere is a parallel question here [https://community.fantasyflightgames.com/topic/173980-forced-effect-on-helms-deep-stage-3b/?hl=helm%26%2339%3Bs] about the transition from stage 2 to 3, with an official ruling.  Stage 3 has the text \"After resolving the quest, if the encounter deck did not place at least 1 progress on this stage as the result of questing, the first player reveals 1 encounter card.\"  The official ruling was that you do not have to trigger the stage 3 forced effect when you arrive at stage 3 after quest resolution.   Stage 2 looks to be much the same.  The stage is revealed after the trigger has gone off, so when you reveal stage 2 it's too late (?) to trigger the forced effect. \n\n \n\nAlthough, just to make it more confusing, you CAN resolve a player card Response even if it was not in your hand when the triggering event occurred (you can play Foe-hammer after destroying an enemy and draw 3 cards, and if you draw another copy of Foe-hammer, you can play it immediately so long as you have another weapon to exhaust)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182436-helms-deep/?do=findComment&comment=1691851","commentId":1691851,"userName":"Veve7","timestamp":1436872276,"content":"I have an official answer from Caleb at this question:\n\n,,No. You should not trigger the end of round Forced effect on stage 2B unless you began the round at stage 2B.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/182436-helms-deep/?do=findComment&comment=1692530","commentId":1692530,"userName":"mroni","timestamp":1436910855,"content":"Thank you very much for your help."}]}