{"url":"https://community.fantasyflightgames.com/topic/182554-when-to-discard-for-baleful-shade/","title":"When to discard for Baleful Shade","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182554-when-to-discard-for-baleful-shade/?do=findComment&comment=1693034","commentId":1693034,"userName":"Grooveseeker","timestamp":1436967947,"content":"Hello All,\n\n \n\nPlaying Deadman's Dike in The Lost Realm.  Starting with a Baleful Shade already engaged.  It's Forced response is \"When Baleful Shade attacks, the defending player discards the top card of his deck.  If the discarded card is an ally, Baleful Shade gets +2 for this attack.\"  My question is, when exactly in sequence is this card discarded?  There is at least one other card that has a shadow effect instructing you to discard a card as well, so in the situation where a Baleful Shade has this card as a shadow card, one would discard 2 cards, but which one first?  Makes a big difference if only one of them is an ally card!\n\n \n\nI am kind of assuming that you discard Baleful Shade's card once you decide \"Okay, now the Baleful Shade is attacking\" and then you choose a defender and it would be before you even flip over the shadow card.  But I can also see an argument for discarding that card after the shadow card has been revealed, saying that the Shade isn't actually \"attacking\" until after the shadow effect (if any) resolves.  Thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182554-when-to-discard-for-baleful-shade/?do=findComment&comment=1693293","commentId":1693293,"userName":"Seastan","timestamp":1436978917,"content":"The steps of Combat are:\n\n1. Choose an enemy\n\n2. Declare a defender\n\n3. Resolve shadow effect\n\n4. Determine combat damage\n\n \n\nLooking through the faq I found this:\n\n \n\n> Dol Guldur Beastmster CORE 91 Should read: “Forced: When Dol Guldur Beastmaster attacks...” The additional shadow card is dealt when the Dol Guldur Beastmaster is chosen during step 1 of enemy attack resolution.\n\n \n\nSo \"When _____ attacks\" trigger after you choose an enemy, but before you choose a defender. So this could be useful if you want to determine whether to use a chump-blocker or not.\n\n \n\nAs an additional note, some cards use the wording \"After ______ attacks\". This is also covered in the faq:\n\n \n\n> Q: When do “after this enemy attacks” Forced effects like those on Chieftan Ufthak (CORE 90) and Wargs (CORE 85) resolve? A: These effects resolve immediately after step 4 of enemy attack resolution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182554-when-to-discard-for-baleful-shade/?do=findComment&comment=1693762","commentId":1693762,"userName":"Grooveseeker","timestamp":1437014529,"content":"Aha!  I wouldn't have hoped that you could discard the card and THEN declare a defender... That sure makes it easier to cope with.  But it makes sense, especially given the cited FAQ.  I had looked at that 4-step sequence and thought that the actual \"attack\" might occur at the \"determine combat damage\" step, but I see I was mistaken!  Thanks a bunch!"}]}