{"url":"https://community.fantasyflightgames.com/topic/182619-first-victory-w-question/","title":"First Victory w/ question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182619-first-victory-w-question/?do=findComment&comment=1693985","commentId":1693985,"userName":"Dsbessie","timestamp":1437046506,"content":"Hey guys I finally successfully finshed the Passage through Mirkwood quest, but I do have a question. When I got to the 3rd stage and randomly choose the Dont Leave the Path quest it says to search for the boss spawn card and add it to the staging area. My question is does it immediately engage right then on that round if my threat is high enough? That is how I played it but it made it close because I had commited so many to the quest to finish the stage before.\n\n \n\nThanks\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182619-first-victory-w-question/?do=findComment&comment=1694001","commentId":1694001,"userName":"divinityofnumber","timestamp":1437048109,"content":"Yes, if your threat is high enough, it will engage you. Combat comes after questing. So, if you quested enough to move to the next stage, the enemy is added when that new quest card enters play, and then you move on to combat, where that enemy will engage you, if your threat is high enough. \n\n \n\nThis dilemma is a really fun part of the game. Often, players will want to quest heavily, in order to progress to the next stage. But, you never know what will happen when you flip to the next quest card. If many of your heroes and allies are exhausted from questing, you can leave yourself very vulnerable if the next quest card adds enemies to the staging area. Plus, you don't know what will be revealed from the encounter deck! If you revel some enemies, AND the next quest card adds some enemies, you can be in a lot of trouble. \n\nEdited July 16, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182619-first-victory-w-question/?do=findComment&comment=1694921","commentId":1694921,"userName":"alexbobspoons","timestamp":1437117149,"content":"Well done on your first win!!\n\nA few quests have that type of dilemma where you need to quest through the stage but then too many exhausted for next stage, its fun to try and gauge it to \"almost\" clear the stage so that it lasts another turn and you can clear the stage then by exhausting fewer characters to quest...(but that also risks something big from adding another staging card from the encounter deck on that additional quest phase). So its a fun judgement call.\n\nAgain well done on the win.\n\nThe other two core set quests can be ridiculously hard with only core player cards so don't be disheartened with those :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}