{"url":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/","title":"Caldara and Prince Imrahil","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1694805","commentId":1694805,"userName":"bubblepopmei","timestamp":1437102917,"content":"Is this a combo with synergy? I'm brand new and theory crafting to select the right expansions but I want to include 2 women in my heroes. Caldara seems cool but then I read she is discarded. On the forums it sounds like I get her back. How does that work?\n\nIf you attack with Imrahil, discard Caldara to bring in allies to help, does Imrahil get to ready and then attack again?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1694811","commentId":1694811,"userName":"Teamjimby","timestamp":1437103766,"content":"That would theoretically work, but using Caldara with non-spirit heroes greatly reduces her utility.  You have to get her back by using Fortune or Fate, which costs 5 resources.  If you are using Imrahil and another spirit hero, Caldara can only bring back one ally which would cost at most 4 resources.  So there's no value there.  You should be able to ready Imrahil much more easily with other tactics like chump blocking, sneak attack, or westfold outriders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1694815","commentId":1694815,"userName":"bubblepopmei","timestamp":1437104382,"content":"I'm partial to using Caldara but not overly enamoured with the other spirit options. I'll have to play through the game a few times to learn what spheres I enjoy most and then find the corresponding ladies. \n\nIt is disappointing that in majority the core set women are spirit. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1694838","commentId":1694838,"userName":"Teamjimby","timestamp":1437106359,"content":"Yeah, there are plenty of spirit women.  Don't overlook Beravor and Mirlonde though.  Idraen can also be a beast in spirit, and of course Eowyn is still the best in the game when it comes to questing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1694855","commentId":1694855,"userName":"Chris51261","timestamp":1437109619,"content":"Luckily of the 7 female heroes we currently have, I'd say 6 of them are really very useful. I've never made a Caldara deck, for the reasons mentioned above basically. Hard to get value out of her. Galadriel is a newer hero who is really rather good, albeit a bit unconventional. Unfortunately your sphere selection is limited to Lore or Spirit, heavily favoring Spirit, as you pointed out. It's too bad there haven't been some ladies in Leadership and Tactics, but I suppose the source material gives them little to go on. For what it's worth, they do have a fair share of female allies, and extremely powerful ones at that, like Arwen and Imladris Stargazer.\n\nEdited July 17, 2015 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695218","commentId":1695218,"userName":"Raven1015","timestamp":1437143843,"content":"A Caldara deck with all-Spirit heroes can actually be pretty powerful. I was skeptical when she was first released and didn't see much value, considering Fortune or Fate costs 5 resources to bring Caldara back in exchange for putting 2 allies out for free. But once I started building decks with her, it's much better than it seems in theory. As far as heroes, Eowyn is the natural partner for Caldara, because you can use Eowyn's ability to get allies into your discard pile for Caldara to resurrect later. This gives you the 2 female heroes you want. From there, Spirit Glorfindel would probably be most people's choice, as he gives you attack power and willpower help at the same time, but there's other ways to go with it as well. You could even throw in Idraen instead of Glorfindel if you want an all-female squad, and she's a great combat piece too.\n\nEdited July 17, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695283","commentId":1695283,"userName":"Raven1015","timestamp":1437147331,"content":"I forgot to say that my Caldara decks have been built with the full card pool. Since you're just starting out, I would have to take a closer look at my decks and the relevant expansions to see how easy it would be to make such a deck viable with a more limited card pool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695373","commentId":1695373,"userName":"Gizlivadi","timestamp":1437151706,"content":"Hey Ian, a minor question, do you think that 3 copies of Fortune or Fate are absolutely essential to a Caldara deck in solo? I just have 2 core sets and I wanna try it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695382","commentId":1695382,"userName":"Teamjimby","timestamp":1437152160,"content":"I almost never use proxies, but I proxied a 3rd copy of Fortune or Fate when I tried out a Caldara deck and I'm glad I did.  IMO it's required for the deck.  Just drop in a copy of Light the Beacons and pretend it's Fortune or Fate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695434","commentId":1695434,"userName":"crx3800","timestamp":1437153760,"content":"Maps and Dwarven Tombs can get plenty of recycling to go get Fortune or Fate if you need it. You could play Merry or Frodo as one of your other Heroes so that you can use Good meal to make Fortune only cost 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695517","commentId":1695517,"userName":"Bullroarer Took","timestamp":1437157990,"content":"Tracker's Caldara deck can be bonkers, but I agree it really wants 3x F&F."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695530","commentId":1695530,"userName":"bubblepopmei","timestamp":1437158632,"content":"Is there a marketplace for singles?\n\nThis is all great info, thanks! I'm partial to Caldara, Eowyn, Idraen.\n\nCaldara power aside,is it essential to stock to one sphere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695554","commentId":1695554,"userName":"Raven1015","timestamp":1437159689,"content":"Others pretty much already said my answer, but yeah, I'd say 3 copies are essential, both to make sure it comes up early and to have multiple copies to play with. You can either proxy or use a Dwarven Tomb/Map to fetch and recycle the copies you have.\n\n \n\nAs for bubblepopmei's questions, there's not really a market for singles, although some people do sell some of the 1 copy Core Set cards on ebay. As for sticking to one sphere (a.k.a. mono-sphere), it's not necessary outside of specialty decks, and in fact it's more difficult to do so with a limited card pool.\n\nEdited July 17, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695564","commentId":1695564,"userName":"Mndela","timestamp":1437160051,"content":"> Hey Ian, a minor question, do you think that 3 copies of Fortune or Fate are absolutely essential to a Caldara deck in solo? I just have 2 core sets and I wanna try it out.\n\n \n\nThis deck is very very powerful, but so yes, you need  copies of FaF:\n\nhttp://susurrosdelbosqueviejo.blogspot.com.es/2014/06/las-emboscadas-de-caldara.html [http://susurrosdelbosqueviejo.blogspot.com.es/2014/06/las-emboscadas-de-caldara.html]\n\n \n\nPD: with the new sword-thain Caldara can be more powerful!\n\nPD: as Ian say, the power of Caldara is not about to get allies cheapier. The power of Caldara is to bring the allies you need in the moment you need. To reach it you need discard effects, like Eowyn, of course, Zigil, Emery, etc. Caldara with Himrahil? Well, could works, but the power of Caldara is more restricted (and i love Himrahil, however, my best deck includes him).\n\nEdited July 17, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695711","commentId":1695711,"userName":"PocketWraith","timestamp":1437166930,"content":"Caldara and Imrahil would be a decent combo, so long as you put them in separate decks in multiplayer. Unless we get a Spirit Imrahil at some point, but if that happens he'll have a different ability anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1695973","commentId":1695973,"userName":"Glaurung","timestamp":1437190265,"content":"Caldara deck is cool and fun to play. Check my youtube channel there is 2 session with Caldara deck against Nightmare Hunt for Gollum and Dead Marshes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696014","commentId":1696014,"userName":"bubblepopmei","timestamp":1437196150,"content":"Your videos are really useful, thanks Glaurung!\n\n \n\nCaldara does seem cool. I placed an order with my FLGS for Blood of Gondor, along with a few other adventure packs. It has been a challenge to find any product around my area. \n\n \n\nSo far I have Core x1, Heirs of Numenor, and Black Riders. Add to that assuming my FLGS supplier has Blood of Gondor, The Three Trials, Journey to Rhosgobel, Battle of Lake-town, and Hobbit: On the Doorstep, what can I scrum together for a Caldara deck? At this point I'm thinking Caldara, Eowyn, and Idraen. \n\n \n\nAlso - I read after I placed my order that these adventure packs require their corresponding saga expansion eg The Three Trials requires Voice of Isengard to play. Why is that? I assume I do not require the saga expansion in order to use Idraen as a hero, but are the player cards off limits or simply the encounter cards? Why at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696016","commentId":1696016,"userName":"bubblepopmei","timestamp":1437196227,"content":"Would you mind listing the Caldara deck card list you used in your YouTube videos?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696038","commentId":1696038,"userName":"Noccus","timestamp":1437201488,"content":"You can use the player cards in any scenario, that's not it.\n\nYou need the deluxe expansion that goes with the cycle to create the encounter deck needed to play the cycle's scenario's however. Because sets of encounter cards needed are included in the deluxe expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696094","commentId":1696094,"userName":"alexbobspoons","timestamp":1437211835,"content":"Firstly, I find Berevor awesome as a female hero. Her stats are all good and her card-draw can be outstanding for decks that rely on specific cards.\n\nSecondly, as Noccus says, the encounter decks are needed.\n\nBasically as an example, a deluxe-expansion (or core set) will inclue ancounter decks A,B,C,D,E and F.\n\nEach of the three scenarios in that set will use an encounter deck comprising some of those (say scenario 1 uses A,C and F)\n\nthen you purchase the first adventure-pack of the cycle and as well as player cards, it includes a new scenario plus encounter deck G. Its new scenario will then tell you to make up its encounter deck from (say) decks A,D and G.... G was included in this pack, but A and D were in the deluxe/core.\n\nSo for the scenario you do need its corresponding deluxe/core.\n\nIts basically a way to spread the same theme of cards throughout a cycle as the cycle tends to have an umbrella-theme, kind-of story arc. So if that story arc centres around say Mirkwood, then you arent buying duplicate locations with each expansion, you are just reusing the same ones. It makes for good deck variety and also does feel like the cards get well used rather than only being used for one scenario.\n\nWhile some would say it forces extra spending, which it does, I do feel you get a sense of moneys-worth from your deluxe/core when its cards keep cropping up throughout all the following six adventure-packs. It works well too in continuing the flavour and theme of the overall story-arc. So I think its a great mechanic (but sorry means more spending if you want to play the scenario from the AP.\n\nHero and player-cards useable regardless of scenario\n\nIts an awesome game, enjoy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 18, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696307","commentId":1696307,"userName":"Glaurung","timestamp":1437237552,"content":"> Would you mind listing the Caldara deck card list you used in your YouTube videos?\n\nTo be honest I dont really remember deck list…. You can see that deck in video and understand what cards are in. Is quite simple deck! Emely, fortune or Fate, Elrond council, resourceful, Gandalf (hobbit) treebeard are key kards. Other you can swap as you like"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182667-caldara-and-prince-imrahil/?do=findComment&comment=1696342","commentId":1696342,"userName":"Dwarf king Bronze beard","timestamp":1437241087,"content":"Yeah i think that Caldara decks are really fun and interesting.\n\n \n\nI made a two player deck that was built around Caldara and i think that they worked very well.\n\n \n\nDecks are in here:\n\n \n\n http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-decks/_/lord-of-the-rings-submitted-decks/the-lady-of-gondor-caldara-deck-1-r231 [http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-decks/_/lord-of-the-rings-submitted-decks/the-lady-of-gondor-caldara-deck-1-r231]\n\n \n\nhttp://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-decks/_/lord-of-the-rings-submitted-decks/the-lady-of-gondor-caldara-deck-2-r232 [http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-decks/_/lord-of-the-rings-submitted-decks/the-lady-of-gondor-caldara-deck-2-r232]\n\nEdited July 18, 2015 by Dwarf king Bronze beard"}]}