{"url":"https://community.fantasyflightgames.com/topic/182677-upcoming-saga-heroes/","title":"Upcoming Saga Heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182677-upcoming-saga-heroes/?do=findComment&comment=1694939","commentId":1694939,"userName":"pmdoug","timestamp":1437119451,"content":"It's a safe bet that the two heroes in The Land of Shadow will be Faramir and Anborn/Damrod. There just aren't many other candidates from that portion of the story.\n\n \n\nBut what heroes will be released in the last two saga boxes that will cover the events of Return of the King? Who are the options? If we assume that we'll get two heroes per saga box, and that the creators won't make alternates of core set heroes, then the choices are rather limited.\n\n \n\nIf they want to make alternates for non-core heroes, then they have several options: Imrahil, Halbarad, Hirluin, Erkenbrand, Elrohir, Elladan, Eomer, Beregond, Hama. \n\n \n\nBut if they want to make new heroes, they have few characters left to choose from: Gamling and Gwaihir are about the only ones I can imagine. \n\n \n\n \n\nThe Land of Shadow\nHero 1         Faramir\nHero 2         Damrod/Anborn\n \nRotK Part One (Paths of the Dead, Pelargir, Siege of Minas Tirith, Pelennor Fields)\n * Imrahil helps lead the defense of Minas Tirith, and charges onto Pelennor Fields. His hero card was released early in the game's history, and I can imagine him getting a Spirit or Tactics alternate. \n * Halbarad was released very recently, and I already love his ability. No call for a new version. \n * Hirluin could get a non-Outlands iteration, but I honestly don't think he'll be chosen before Imrahil. \n * Eomer leads the Rohirrim after Theoden's death, and becomes king. Like Imrahil, he shines in the final battles. He certainly deserves a new version more than most.\n * Beregond, Hama, and Erkenbrand are all involved in the battles, but I don't see them getting alternates before Imrahil and Eomer. \n * Elladan and Elrohir join Aragorn for the Paths of the Dead. They could get Spirit and Lore version, that have a similar mechanic to their current version. I honestly hope they don't bother with this, though. \n * Gamling is, to my mind, one of the last few notable characters that doesn't have a player card. He is by no means a crucial hero, but I think it would be fitting to introduce a new Rohan hero for Pelennor Fields.\n\nHero 1          Imrahil\n\nHero 2          Gamling\n\n \n \nRotK Part Two (Morannon, Cirith Ungol? The Shire? Will Frodo and Aragorn's stories converge?)\n \n * Imrahil and Eomer could also be heroes here. \n * Gwaihir and his eagles play a big part in the Battle of Morannon and in saving the hobbits. I realize that making a giant winged hero is asking for trouble, but they made Treebeard and Beorn work. And if players want to have Gwaihir get into a fist fight in The Leaping Fish, so be it. \n\nHero 1         Eomer\n\nHero 2         Gwaihir\n\n \n\n \n\nI'd still prefer Lore Gimli and Spirit Legolas over any of the above, but I imagine they'll be released outside the saga. What are your guesses for the upcoming heroes?\n\nEdited July 17, 2015 by pmdoug"}]}