{"url":"https://community.fantasyflightgames.com/topic/182658-personal-errata/","title":"Personal Errata","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694511","commentId":1694511,"userName":"Edvando","timestamp":1437078527,"content":"Hello fellow players!\n\n \n\nThere is something that I do for my personal play that I think that is maybe worthy sharing.\n\n \n\nThe idea is to make all cards playable and somewhat balanced. We all know that all cardgames have \"binder\" cards and it is impossible to have a perfect balanced game, where all cards are balanced. Sure, but we can make the gap between the good cards and the bad cards smaller. I already do that for some cards and, at least for me, make the game more fun to be able to play and use more cards.\n\n \n\nThe philosophy of my errata in this topic are:\n\n \n\n-Make the card playable, but not overpowered and must play in any deck that is capable of playing it. Remember that we can and will compare cards. Be careful when comparing cards from different spheres.\n\n-Change as little as possible so the errata is easier to remember, since I don´t plan to print the card with the modification.\n\n-Different spheres and different factions are good in different things. Anything that cost 3 or more need to be worthy of that cost, since they are hard to cast.\n\n-Try to consider the interaction between cards. EX: Sneak Attack is a OK card, but when combo with Gandalf, it turns into a powerhouse.\n\n \n\nWhat I want help for:\n\n \n\n-I will bring all cards that I think that deserve a re-balance to this topic. I will post my modification or suggestions.\n\n-I want people to comment about the change. Does the card feel balance when compared to the other cards? What is your suggestion? Any special insight about the card?\n\n-After consideration, I will modify my personal errata according to suggestion. In my errata, I will have the final say, in your errata, you can do whatever you want =D.\n\n-If i see good suggestions or after playtest, I can go back and change my errata, so nothing is written in stone.\n\n\n\nDISCLAIMER: This errata is for my personal use and to whoever want to use it. If you don´t like the idea, think this is a bad idea, or anything similar, feel free to complete ignore and not post here. This will not impact your table and the designers will not errata the game because of this topic. Please, no flaming, raging or passive aggressive here.\n\nEdited July 21, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694512","commentId":1694512,"userName":"Edvando","timestamp":1437078550,"content":"CORE SET REVISITED PERSONAL ERRATA V1.0\n\n============ HEROES\n\n\n\nARAGORN\nResponse: After Aragorn exhaust, spend 1 resource from his resource pool to ready him (limit once per turn).\n\nGlóin\n+1 def \n-1 wp\n\nThalin\n+1 wp\n-1 def\n\nEleanor\n+1 def\n\nGlorfindel \nAction: Heal 1 damage on any character. Then, you may pay 1  resources from Glorfindel's pool to heal 2 damage on any character (Limit once per turn).\n\nDenethor\nAction: Exhaust Denethor to look at the top X cards of the encounter deck. You may move one of those cards to the bottom of the deck. X is the number of players in the game (limit once per turn).\n\n\nNO ERRATA FOR\n\n\n\nThéodred\nGimli\nLegolas\nDúnhere\nÉowyn\nBeravor\n\n\n============ ALLIES\n\n\n\nBrok Ironfist\n-2 cost\n+1 def\n\nFaramir\n(limit once per turn)\n\n\nGuard of the Citadel\n+2 def\n\nLongbeard Orc Slayer\n-1 cost\nResponse: After Longbeard Orc Slayer enters play, deal 1 damage to each enemy in play.\n\nSilverlode Archer\n+1 wp\n+1 hp\n\nBeorn\n-1 cost\n\nLórien Guide\nResponse: After Lórien Guide commits to a quest, place 2 progress token on the active location.\n\n\nWandering Took\n-1 cost\n\nDaughter of the Nimrodel\n-1 cost\n+1 hp\n\nHenamarth Riversong\nAction: Look at the top X cards of the encounter deck. X is the number of players in the game (limit once per game).\n\nMiner of the Iron Hills\n+1 def\n\n\nGandalf\nResponse: After Gandalf enters play from your hand, (choose 1):\n\nHorseback Archer\n+1 atk\n\nVeteran Axehand\n+1 def\n\nNO ERRATA FOR\n\n\n\nNorthern Tracker\nSnowbourn Scout\nSon of Arnor\nErebor Hammersmith\nGléowine \nGondorian Spearman\n\n============ ATTACHMENTS\n\n\n\nCelebrían's Stone\nAttached hero gains +2 wp and the SPIRIT resource icon.\n\n\nSteward of Gondor\n-1 cost\nAttach to a hero. Attached hero gains the Gondor and Steward traits. Action: Exhaust Steward of Gondor to add 1 resources to attached hero's resource pool.\n\n\nBlade of Gondolin\nAttached hero gets +1 atk.\n\nCitadel Plate\n-1 cost\n\nDwarven Axe\nAttached hero gains +1 atk (+2 atk instead if attached hero is attacking a enemy engaged with you).\n\nPower in the Earth\nAttached location gets -2 thr.\n\nThe Favor of the Lady\nAttached hero gains +2 wp.\n\nUnexpected Courage\nUNIQUE\n\nDark Knowledge\nResponse: Exhaust Dark Knowledge to look at 1 shadow card that was just dealt to an enemy.\n\nNO ERRATA FOR\n\n\n\nHorn of Gondor\nForest Snare\nProtector of Lórien\n\n\n============ EVENTS\n\n\n\nCommon Cause\nAction: Exhaust 1 character you control to choose and ready a hero.\n\n\nEver Vigilant\nAction: Choose and ready 1 character card.\n\n\nFor Gondor!\n-1 cost\n\n\nGrim Resolve\n-1 cost\n\n\nBlade Mastery\nAction: Choose a character. Until the end of the phase, that character gains +3 atk  and +3 def.\n\n\nRain of Arrows\nAction: Exhaust a character you control with the ranged keyword. Deal 1 damage to each enemy.\n\n\nStand Together\nAction: Choose a player. That player may declare any number of eligible characters as defenders against each enemy attacking him this phase. If the chosen player block an attack with at least 2 characters, draw 1 card.\n\nSwift Strike\n-1 cost\n\n\nFortune or Fate\n-1 cost\n\n\nStrength of Will\nResponse: After you travel to a location, exhaust a SPIRIT character to place 5 progress tokens on that location.\n\n\nBeorn's Hospitality\n-2 cost\nAction: Choose a player. Heal all damage on each character controlled by that player.\n\n\nGandalf's Search\nAction: Look at the top 5 cards of any player's deck, add X of those cards to its owner's hand, and return the rest to the top of the deck in any order.\n\n\nLore of Imladris\n-1 cost\n\n\nLórien's Wealth\n-1 cost\n\n\nA Light in the Dark\n-1 cost\n\n\nNO ERRATA FOR\n\n\n\nSneak Attack \nValiant Sacrifice \nFeint \nQuick Strike \nThicket of Spears \nA Light in the Dark \nA Test of Will \nDwarven Tomb \nHasty Stroke\nStand and Fight \nThe Galadhrim's Greeting \nWill of the West \nRadagast's Cunning \nSecret Paths\n\nEdited July 21, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694514","commentId":1694514,"userName":"Edvando","timestamp":1437078557,"content":"Post reserved 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694515","commentId":1694515,"userName":"Edvando","timestamp":1437078563,"content":"Post reserved 3."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694545","commentId":1694545,"userName":"Edvando","timestamp":1437080038,"content":"> Ok, lets begin with the Core Box.\n> \n>  \n> \n> ============HEROES\n> \n> \n> ARAGORN\n> Response: After Aragorn exhaust, spend 1 resource from his resource pool to ready him (limit once per turn).\n> \n> Aragorn is perfectly playable, but in the modern card pool, he is outshined by most of the other heroes. He is the one of the most iconic characters in LOTR (after Gandalf)! I think that the new versions of him are much better for what they do. Leadership Aragorn only become REALLY awesome when attached to Sword That Was Broken. I think this is a good help for him and make him more viable in more decks. Also, for 12 threat, we need a really solid hero.\n> \n> \n> Glóin\n> +1def \n> -1wp\n> \n> I don´t know what do modify in this card to make it more playable. I thought about giving him +1def, but I would need to -1wp, so I´m not sure it would be a sufficient buff. He is very risky to pull of.\n> \n> \n> Théodred\n> +1WP \n> -1HP \n> \n> He is fine and I see him played a lot. I still feel really bad about committing 1wp, specially to recent quests where we are hit for a lot in the beginning of the quest. My personal errata and the way I play with him, I give him +1 wp, -1hp.\n> \n> \n> Thalin\n> +1wp\n> -1def\n> \n> Same as theodred.\n> \n> \n> Eleanor\n> +1def\n> \n> I don´t like to have heroes with 0 wp or 0 atk. This modification make her a unreliable defender, but that will not die to wind breeze. This will give her a virtual \"-1threat\", but thats ok.\n> \n> \n> Glorfindel \n> Action: Heal 1 damage on any character. Then, you may pay 1  resources from Glorfindel's pool to heal 2 damage on any character. (Limit once per round.)\n> \n> For 12 he need to have a powerhouse ability.\n> \n> \n> Denethor\n> \n> Not sure what to do with this guy. He is REALLY awesome in solo play, but he is lackluster in >2players. I´ve been playing with him a lot, since I like scrying, but I may tests it is better to take other heroes when playing 2+ players.\n\n \n\nFor history I will post it here. In my first 4 post I will post the final versions after modifications."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694576","commentId":1694576,"userName":"OMZA","timestamp":1437081515,"content":"The core set heroes become more playable in your version, that is true, for sure! Nice ideas!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694605","commentId":1694605,"userName":"GrandSpleen","timestamp":1437082852,"content":"Denethor could be scry X, where X is the number of players.  And if that is too powerful for a repeatable action with pretty minimal cost, you could make it a Quest action to limit its scope.  And still only allow the player to move 1 card.\n\nEdited July 16, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694612","commentId":1694612,"userName":"Edvando","timestamp":1437083665,"content":"EDIT: OPSSS!!! I´ve accidentally deleted my allies suggested errata. I´m posting it again below. I will have to rewrite it T_T\n\nEdited July 17, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694614","commentId":1694614,"userName":"Edvando","timestamp":1437083879,"content":"> Denethor could be scry X, where X is the number of players.  And if that is too powerful for a repeatable action with pretty minimal cost, you could make it a Quest action to limit its scope.  And still only allow the player to move 1 card.\n\n\nDenethor\nAction: Exhaust Denethor to look at the top X cards of the encounter deck. You may move one of those cards to the bottom of the deck. X is the number of players in the game (limit once per turn).\n\nLike this? What do you guys think?\n\nEdited July 16, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694658","commentId":1694658,"userName":"GrandSpleen","timestamp":1437087244,"content":"I would definitely play him a lot more if Denethor looked like that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAbout allies, I think Guard of the Citadel's main weakness is that we are drowning in 2-cost leadership allies, and several of them are Gondor allies to boot.  The Guard either needs a stat boost or an ability.  Allowing you to put 6 copies in would still leave him inferior to a card like Pelargir Ship Captain and Herald of Anorien (although the latter lacks in HP).  Since he's a Guard of the Citadel, something defensive would be an appropriate boost.  Spend 1 Leadership resource to give one hero +1 defense (limit once per phase) ?  Then he has some very neat Siege utility too.  But maybe that ability's too strong.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694661","commentId":1694661,"userName":"alexbobspoons","timestamp":1437087626,"content":"I havent played enough to comment but i will say really really interesting thread thanks!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694678","commentId":1694678,"userName":"Edvando","timestamp":1437088772,"content":"> I would definitely play him a lot more if Denethor looked like that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> About allies, I think Guard of the Citadel's main weakness is that we are drowning in 2-cost leadership allies, and several of them are Gondor allies to boot.  The Guard either needs a stat boost or an ability.  Allowing you to put 6 copies in would still leave him inferior to a card like Pelargir Ship Captain and Herald of Anorien (although the latter lacks in HP).  Since he's a Guard of the Citadel, something defensive would be an appropriate boost.  Spend 1 Leadership resource to give one hero +1 defense (limit once per phase) ?  Then he has some very neat Siege utility too.  But maybe that ability's too strong.  \n\n \n\nYour idea that Guard need a defensive ability is cool. The thing is that my errata tries to not change the card too much, you see? The idea is to buff the cards and not to rework cards.\n\n \n\nIs giving Guard of The Citadel +2def OK in your view?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694681","commentId":1694681,"userName":"Edvando","timestamp":1437088828,"content":"> I havent played enough to comment but i will say really really interesting thread thanks!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nYour vision can be usefull. As I understand, you still playing with the core set cards and a couple of APs. What cards do you think are bad and you dont use then?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694730","commentId":1694730,"userName":"Edvando","timestamp":1437093308,"content":"\nCelebrían's Stone\nAttached hero gains +2wp and the SPIRIT resource icon.\n\n\nIs one of the few artifacts in the middle earth. It is also Restricted, limiting the number of attachments the hero can carry. I think it deserve a little buff.\n\n\nSteward of Gondor\n-1 cost\nAttach to a hero. Attached hero gains the Gondor and Steward trait. Action: Exhaust Steward of Gondor to add 1 resources to attached hero's resource pool.\n\nThis card is the nightmare of my dreams. This card is the sole reason that a lot of cards are overcosted in leadership. The problem is that the leadership somewhat lose it appeal as the resource rich sphere if things cost more then they should, making the game a net zero effect.\n\n \nHey! I have more resources! Erhhh, hummm.... But things cost more, soooo yeah =/....\n \nAnother problem that arise is that a game where this is in my initial hand is very different then one where this is no where to be found. This card pay for itself first turn and begin netting 2 resources EVERY TURN! Insane! This card makes almost impossible to deliver new resource generating cards.\n \nMy suggestion is to make this a net 1 every round instead of 2 and giving the Steward Trait. This make it more in line with the new resource generation cards, but still generic enough be put in any deck that need more resources. Since I´m also rebalancing the cost of most cards, you wont have much problems without this card in play.\n \nEDIT: I'm also giving the Steward Trait so we can create some customs cards that target that trait, since it is entirely possible we wont see anything of the sort by the official designers.\n\n\nBlade of Gondolin\nAttached hero gets +1 atk.\n\nSimple, direct and useful generic restricted attachment.\n\n\nCitadel Plate\n-1 cost\n\nToo overcosted for something that will almost never see play. Even by costing 3, it would be hard to include in a non-gimli/non-beregond deck.\n\n\nDwarven Axe\nAttached hero gains +1atk. (+2 atk instead if attached hero is attacking a enemy engaged with you.)\n\nSimple +2 atk if not using to attack someone not engaged.\n\n\nPower in the Earth\nAttached location gets -2 thr.\n\nI fought about giving it -3 thr, but would make it overpowered, since you basicaly killing the location without needing to explore it for 1 cost.\n\n\nThe Favor of the Lady\nAttached hero gains +2wp.\n\nGeneric +2wp for 2 cost in spirit. Seems ok.\n\n\nUnexpected Courage\nUNIQUE\n\nThat is the best reading effect in the game. This card make it hard to balance other cards. Also, if you can attach 3 unexpected courages to the same or different heroes, it is not \"unexpected\" anymore. More like \"Common Courage\" =D. There was a game where I saw 5 unexpected courage in play!\n\n\nDark Knowledge\nExhaust Dark Knowledge to look at 1 shadow card that was just dealt to an enemy.\n\nThis article tell my thoughts https://talesfromthecards.wordpress.com/2013/02/18/card-spotlight-dark-knowledge/ [https://talesfromthecards.wordpress.com/2013/02/18/card-spotlight-dark-knowledge/]. This card is a coaster, but maybe with this modification it can be helpful in an full support deck, by letting you see one shadow every round from one enemy that is probable not engaged with you. For enemies engaged with you, you can use Burning Brand.\n\n\nSelf Preservation\n\nThis card see some light in an Treebeard deck, maybe also with Erkbrand. Anywhere else, it is a binder card. Anyone has sugestions about how to make it somewhat good in most decks, but not overpowered in Treebeard Lore hero decks? My idea was to have it cost 2. I havent played yet with Treebeard, maybe even there the card is not all that good, just playable. Anyone have insights about the tree deck?\nEdited July 17, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694766","commentId":1694766,"userName":"Edvando","timestamp":1437097168,"content":"I´ve accidentally deleted my allies errata. I'm re-posting it with some modification and some new thoughts. This is not the same as before.\n\n\nBrok Ironfist\n-2 cost\n+1def\n\nHe is not a good atacker, defender or quester plus his ability, make him overall a bad card. Even for 4, he is horrible compared with the new Ally Gimli. A little buff is deserved. Even then, maybe dont see the light of day.\n\n\nFaramir\n(limit once per turn)\n\n\nI´m buffing some cards, like Ever Vigilant. This errata keep Faramir from being insane.\n\n\nGuard of the Citadel\n+2 def\n\nVanilla card that is showed by other gondor 2 costed allies. Now he can at least Guard us against some trash mobs from the quest =D\n\n\nLongbeard Orc Slayer\n-1 cost\nResponse: After Longbeard Orc Slayer enters play, deal 1 damage to each enemy in play.\n\nOvercost as usual and trait specifc ability that even against orcs is not that useful. For 3 he is playable from hand and can be sneak attacked in a pinch for value if needed.\n\n\nSilverlode Archer\n+1wp\n+1hp\n\nEven in Silvan decks with Celeborn and Galadriel this guy barely see play, generaly even there he don´t get a spot. Maybe, and a huge maybe, this make him more viable.\n\n\nBeorn\n-1 cost\n\nThis make ally Beorn more feasable to be played. You can spend 1 resource and save 2 to have him played next turn. You can use that extra resource to play Feint, Quick Strike, maybe Vassal of the Windlord to save your bacon. For 6 he is only playable if you cheat him into play (Elf Stone, Good Tale, Vilya, Sneak Attack). Anywhere elso for 6 he dont see play.\n\n\nLórien Guide\nResponse: After Lórien Guide commits to a quest, place 2 progress token on the active location.\n\n\nMan, i would still not play this card even placing 2 progress tokens. What do you guys think?\n\n\nWandering Took\n-1 cost\n\nChump block for 1, or -3 and +3 threat for +1atk or chump. Tooks are not long lived =D\n\n\nDaughter of the Nimrodel\n-1 cost\n+1hp\n\n-1 cost is obvius. To have it compete with Warden of Healing, im giving her a little more survivability.\n\n\nHenamarth Riversong\nAction: Look at the top X cards of the encounter deck. X is the number of players in the game (limit once per game).\n\nOnce per game you can look at top X = players. Seems fine =D\n\n\nMiner of the Iron Hills\n+1def\n\n\nThis guy is not worthy to play if there is not condition in play. Maybe this can help a little bit. Not sure. \n\n\nGandalf\nAfter you play Gandalf from your hand\n\nNo more cheese sneak attack Gandalf!\n\n\nHorseback Archer\n+1atk\n\nAnything that cost 3 must pull it´s weight. This guy is a 3 atk ranged ally in tactic, sounds ok.\n\n\nVeteran Axehand\n+1def\n\nGeneric dude that is only good in Dain deck. Since most Dain decks now days dont play tatics, this give a little push. Also, i will nerf Dain, so he need help.\n\n\nNorthern Tracker\nSnowbourn Scout\nSon of Arnor\nErebor Hammersmith\nGléowine \nGondorian Spearman\n\nWhat do you guys think of these cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694831","commentId":1694831,"userName":"GrandSpleen","timestamp":1437105896,"content":"+1 defense for the Guard would set him apart from the other 2-cost Gondor leadership allies, but in the current meta HP are more valuable than defense on allies.  +1 HP would make him suddenly look more attractive"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694836","commentId":1694836,"userName":"Edvando","timestamp":1437106326,"content":"> +1 defense for the Guard would set him apart from the other 2-cost Gondor leadership allies, but in the current meta HP are more valuable than defense on allies.  +1 HP would make him suddenly look more attractive\n\n \n\nMy plan was to give him +2def, so in the end we have 2-cost, 1wp, 1atk, 2def, 2hp gondor ally. You want to give him the Erebor Hammersmith stats (+1def, +1hp)? Which is fine by me.\n\n \n\nOr did you mean only the +1hp?\n\n \n\nMaybe, to make him very unique we could give him +2hp. The problem is that maybe that is unthematic, since he is a dude in heavy armor.\n\nEdited July 17, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1694908","commentId":1694908,"userName":"alexbobspoons","timestamp":1437116049,"content":"> > I havent played enough to comment but i will say really really interesting thread thanks!! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> Your vision can be usefull. As I understand, you still playing with the core set cards and a couple of APs. What cards do you think are bad and you dont use then?\n\nDifficult to say as i dont much remember cards i avoid. I know i avoid brok ironfist due to his cost. Ealenor seems expensive compared to her use.\n\nDespite it being a respected card i have hardly used dwarvern tomb.\n\nblade of gondor (thats the knife yes) seems not as good as some other weapons.\n\nDwarvern axe is great...but at first glance the kazad dum axe seem just as good but cheaper.\n\nTheres a card in core with gandalf looking at books, i think its a scrying card, not used that (denethor scrying gets really well used though)\n\nAlways a shame to comit Theodred to quest with 1wp just to get a resource but i think that works well on him as its the judgement call if to quest or not with him. if he had more wp and less other stats then there wouldnt be a choice you would just quest him every turn.\n\nCant think of much else right now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1695018","commentId":1695018,"userName":"Eu8L1ch","timestamp":1437130113,"content":"This is an interesting idea, however I think I just gave up on that since new cards are released constantly: this means in the end I'm ok with letting a card taking dust due to the fact I already have many options, even if I would prefer if all cards were useful in a way.\n\n \n\nFor example, it hurts me to see Lore Glorfindel having such a lackluster ability (in the current meta), and would definetly consider upping it to 2 points of damage healed (even if your change makes him too powerful imo).\n\nHowever playing multiplayer means this would need to find the agreement of all the players I'm playing with, and that's far from granted. I think I could consider it for solo, if not for the fact that having the Spirit version is almost mandatory: everytime I try building a Glorf(L) deck and think about the other heroes my mind goes directly to Glorf(S) only to realise I cannot play the two together XD\n\n \n\nSo, the only thing I really care about is when I feel a card breaks the game: this for me is happening with Gandalf+Sneak Attack which is far too powerful of a combination: when I get it I get an advantage that feels unfair.\n\nFor solo, I usually rule that I cannot use his response unless I have played him from my hand.\n\nFor multiplayer, other people use SA+Gandalf so I find it harder to restrict myself; I usually play the combination in decks with a lot of card draw so that it's kind of part of my strategy, instead of being a random bonus.\n\n \n\nThe only other errata I use is restricting myself from using Tactics Aragorn in combination with Merry, for multiplayer.\n\n \n\n \n\nAnway, I'll keep an eye on this thread to see whether something that could appeal to me appears. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1695421","commentId":1695421,"userName":"Edvando","timestamp":1437153316,"content":"> Difficult to say as i dont much remember cards i avoid. I know i avoid brok ironfist due to his cost. Ealenor seems expensive compared to her use.\n> \n> Despite it being a respected card i have hardly used dwarvern tomb.\n> \n> blade of gondor (thats the knife yes) seems not as good as some other weapons.\n> \n> Dwarvern axe is great...but at first glance the kazad dum axe seem just as good but cheaper.\n> \n> Theres a card in core with gandalf looking at books, i think its a scrying card, not used that (denethor scrying gets really well used though)\n> \n> Always a shame to comit Theodred to quest with 1wp just to get a resource but i think that works well on him as its the judgement call if to quest or not with him. if he had more wp and less other stats then there wouldnt be a choice you would just quest him every turn.\n> \n> Cant think of much else right now :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nDwarven Tomb I play one copy with 3 Test of Will + 2 Hasty Stroke, so I can recur one of those cards that I want. Sometimes I have more spirit events, most of the time I recur Test of Will.\n\n \n\nBlade of Gondor, at least for me, only saw play in the core set. Even so, It was painful to not get the atk bonus against the troll, nazgul and wargs. Dwarven Axe also only saw play in core, with gimli. Even so, generaly it was not needed, since gimli alone is strong enough even damaged to kill almost anything.\n\n \n\nGandalf's Search (Gandalf reading a book) is mind boggling. I never ever even considered using it.\n\n \n\nThat is a good Theodred insight that I never thought of. I´m trying to remember, but I think I´ve maybe not quested with him once, and I play him a lot. Generally I play Celebrian Stone in any deck with him, since in my mind he is always questing, so he can give his resource to himself or some player that need it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1695459","commentId":1695459,"userName":"Edvando","timestamp":1437154714,"content":"> This is an interesting idea, however I think I just gave up on that since new cards are released constantly: this means in the end I'm ok with letting a card taking dust due to the fact I already have many options, even if I would prefer if all cards were useful in a way.\n> \n>  \n> \n> For example, it hurts me to see Lore Glorfindel having such a lackluster ability (in the current meta), and would definetly consider upping it to 2 points of damage healed (even if your change makes him too powerful imo).\n> \n> However playing multiplayer means this would need to find the agreement of all the players I'm playing with, and that's far from granted. I think I could consider it for solo, if not for the fact that having the Spirit version is almost mandatory: everytime I try building a Glorf(L) deck and think about the other heroes my mind goes directly to Glorf(S) only to realise I cannot play the two together XD\n> \n>  \n> \n> So, the only thing I really care about is when I feel a card breaks the game: this for me is happening with Gandalf+Sneak Attack which is far too powerful of a combination: when I get it I get an advantage that feels unfair.\n> \n> For solo, I usually rule that I cannot use his response unless I have played him from my hand.\n> \n> For multiplayer, other people use SA+Gandalf so I find it harder to restrict myself; I usually play the combination in decks with a lot of card draw so that it's kind of part of my strategy, instead of being a random bonus.\n> \n>  \n> \n> The only other errata I use is restricting myself from using Tactics Aragorn in combination with Merry, for multiplayer.\n> \n>  \n> \n>  \n> \n> Anyway, I'll keep an eye on this thread to see whether something that could appeal to me appears. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI felt the same as you about the new cards. But Ive just played Dwaredelf+Against the Shadow Two Handed with some errata and I had a real blast! That´s why I´m doing this, so other people can enjoy the same as I did. You don´t need to use all the suggestions, just use the one you feel are the best for you.\n\n \n\nGandalf+SA and Taragorn+Merry are also combos that I try to refrain of playing. GA+SA is worse, since it is very easy to simple include both.\n\n \n\nYeah, in multiplayer I have no illusions about people going with my errata and that is fine. But if someone likes it and wanna play, I´m here! Also, I can play with my brother. Maybe I can make a custom set for OCTGN or print the new cards on http://www.printerstudio.com/personalized/custom_playing_cards_blank_cards.html [http://www.printerstudio.com/personalized/custom_playing_cards_blank_cards.html]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1696197","commentId":1696197,"userName":"Eu8L1ch","timestamp":1437226500,"content":"Sure, I agree with you.\n\nSomething can surely be made to improve some older cards. I think that the cards from SoM in particular didn't age well, as a whole.\n\nAgain, I fully agree with you on SA+Gandalf, it just sounds too easy to do.\n\n \n\nFinally, there's a card that really strikes me as odd, since in my opinion it's very subpar BUT it was released in the Against the Shadow cycle: Steed of the Mark.\n\nI think the few advantages (being a Mount, so can be fetched via Horse-Breeder; having only 1 cost makes it a bit easier to splash) and the many disadvantages have been discussed thoroughly, and it strikes me as a very odd choice to make for a new card that's supposed to help two traits that admittedly lack some support (Gondor, Rohan), especially in the action advantage department. Making it an \"attached Hero does not exhaust to quest\" attachment would have been far from making it overpowered. Sure, LoV does the same but is unique, however Noldor/Silvan already have plenty of support for their heroes.\n\nSo my proposed errata is:\n\n \n\n \n\n \n\nSteed of the Mark\n\n \n\n\"Attach to a Gondor or Rohan hero.\n\nAttached hero does not exhaust to commit to the quest.\"\n\n \n\n \n\n \n\n \n\n \n\nP.S.\n\nI can see this game having a reboot at some point, as it has just happened to A Game of Thrones LCG; sooner or later, they will probably need to rethink existing cards,  especially those from the earlier sets.\n\nAnyway, not that I'm encouraging such a move now, it cost me a lot to buy the (almost) complete set of cards! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited July 18, 2015 by Eu8L1ch"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1696294","commentId":1696294,"userName":"Edvando","timestamp":1437236328,"content":"> Steed of the Mark\n> \n>  \n> \n> \"Attach to a Gondor or Rohan hero.\n> \n> Attached hero does not exhaust to commit to the quest.\"\n\n \n\nCool! Nice that we think the same way. In my earlier post I said that I played Dwdlf and AtS sagas two handed with errata. In AtS I used a Gondor deck and a Rohan deck. One of the errata I used was what you just sugested. I ran 2 copies of Steed of the Mark. When I got one, I would put in Spirit Theoden and the second copie went to Prince Imrahil."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1696302","commentId":1696302,"userName":"Ecthelion III","timestamp":1437237134,"content":">  \n> \n> > I would definitely play him a lot more if Denethor looked like that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> > \n> >  \n> > \n> > About allies, I think Guard of the Citadel's main weakness is that we are drowning in 2-cost leadership allies, and several of them are Gondor allies to boot.  The Guard either needs a stat boost or an ability.  Allowing you to put 6 copies in would still leave him inferior to a card like Pelargir Ship Captain and Herald of Anorien (although the latter lacks in HP).  Since he's a Guard of the Citadel, something defensive would be an appropriate boost.  Spend 1 Leadership resource to give one hero +1 defense (limit once per phase) ?  Then he has some very neat Siege utility too.  But maybe that ability's too strong.  \n> \n>  \n> \n> Your idea that Guard need a defensive ability is cool. The thing is that my errata tries to not change the card too much, you see? The idea is to buff the cards and not to rework cards.\n> \n>  \n> \n> Is giving Guard of The Citadel +2def OK in your view?\n> \n>  \n\nAllow you to put 6 copies in, give him 0 defense, and give him the text \"Guard of the Citadel gets +1 <def> for each copy of Guard of the Citadel in play.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1697646","commentId":1697646,"userName":"Edvando","timestamp":1437375012,"content":"> Allow you to put 6 copies in, give him 0 defense, and give him the text \"Guard of the Citadel gets +1 <def> for each copy of Guard of the Citadel in play.\"\n\n \n\nThat is a cool suggestion, but would be a rework of the card, which goes against the philosophy of the errata.\n\n \n\nAnyway, that would be a cool custom card! Some kind of unit that use Shield Wall formation!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1697675","commentId":1697675,"userName":"Edvando","timestamp":1437378700,"content":"Last part of the core set revisited personal errata.\n\n\n\nCommon Cause\nAction: Exhaust 1 character you control to choose and ready a hero.\n\n\nI´ve always tried to incorporate this in my deck, but it always keep stuck in my hand. 95% of the time all my heroes are busy working, so I almost never have the opportunity to use it when it would make a real difference. If I could exhaust a character instead of a hero, maybe I could see this card being more useful.\n\n\n\nEver Vigilant\nAction: Choose and ready 1 character card.\n\n\nThese 1 costed one-shot action advantage where never good enough to deserve a spot in the deck. Maybe with more flexibility, it could find a home. This card could only ready an Ally before this errata.\n\n\n\nFor Gondor!\n-1 cost\n\n\nI´ve put two copies in my gondor ally army deck. Never ever was used, even after more I´ve played five quests in the Against the Shadow Cycle with it. The funny thing is that AoS is very combat focused cycle. Maybe for 1 it could see table.\n\n\n\nGrim Resolve\n-1 cost\n\n\nToo expensive and situational card. I´ve had some mono leadership decks and Strength of Arms barely was able to do anything. This card also ready heroes, which Strength can´t. The problem is having 4 free resourses and the perfect situation. Also take note that I´ve nerfed Steward of Gondor, so we have less resources.\n\n\n\nBlade Mastery\nAction: Choose a character. Until the end of the phase, that character gains +3 atk  and +3 def.\n\n\nFor 1 cost I need a card that can compete with Feint, Quick Strike, Hands Upon the Bow, Tireless Hunters. I´ve turned this in a generic tactic 1-costed +3/+3 event.\n\n\n\nRain of Arrows\nAction: Exhaust a character you control with the ranged keyword. Deal 1 damage to each enemy.\n\n\nHoly guacamole, this card is bad. Even with this errata, maybe it won´t see play. Since I´m buffing a lot of direct damage cards (Most of then are bad), maybe this can receive a spot in that deck\n\n\n\nStand Together\nAction: Choose a player. That player may declare any number of eligible characters as defenders against each enemy attacking him this phase. If you block an attack with at least 2 characters, draw one card.\n\nNever even considered using this. The problem is that this card force you to use 2-3 guys and spend a card just to block one guy. I´m turning this card in a \"combat cantrip\". In MTG, cantrip are cards that have small effects for a small cost and let you draw a card.\n\n\n\nSwift Strike\n-1 cost\n\n\nThis card already has a restriction, you need to exhaust someone to defend. For 2, this card is too costly to be included, even in direct damage decks. For one, it is more reasonable.\n\n\n\nFortune or Fate\n-1 cost\n\n\nOnly deck that this card see play is in Caldara deck. Even there I would argue that it is not that powerful. Maybe with a little less it could do a little more.\n\n\n\nStrength of Will\nResponse: After you travel to a location, exhaust a SPIRIT character to place 5 progress tokens on that location.\n\n\nThis card has you spend one card, one action from a character to basically do nothing. Unless the location has some end of the turn effect and can be explored for 2, this card is useless. Since this card has restrictions and situational, I will aggressively buff this card. If nothing more, this card can help you quest faster.\n\n\n\nBeorn's Hospitality\n-2 cost\nAction: Choose a player. Heal all damage on each character controlled by that player.\n\n\nHeal is one of the smallest benefits of the game and should be costed a lot less then it is. I´m buffing the utility of this card by also healing allies and decreasing cost. Still not a priority in most decks. I thought about -3 cost, but for 2 it would be too strong.\n\n\n\nGandalf's Search\nAction: Look at the top 5 cards of any player's deck, add X of those cards to its owner's hand, and return the rest to the top of the deck in any order.\n\n\nOne of the worst cards of the game. Before you would look X and draw 1. Now you look 5 and draw X. Man, maybe this is now one of the best card draw of the game! \n\n\n\nLore of Imladris\n-1 cost\n\n\nPay 1, heal all damage from a character, no questions asked. Healing Herbs does the same, but cost -1 and force you to exhaust a lore hero, so they are somewhat equivalent. \n\n\n\nLórien's Wealth\n-1 cost\n\n\nPay 2, draw 4. Seems reasonable. This card compete with Peace and Thought (cost one less, draw one more, but has the cost of exhausting 2 heroes). Against Gandalf Search, this card is better if you can pay 2, but a lot of times you don´t have the luxury of 2 resources to spend (2 resources is 66% all the resources that you get on your turn!). If you are resource starve, Gandalf Search does a good enough job.\n\n\n\nA Light in the Dark\n-1 cost\n\n\nFor 1 cost, this card feel powerful. But if you compare with Feint, I would argue that Feint is a lot better, since it let you easily retaliate. This card work best if you are using some kind of Dúnhere/Haldir deck so you need to work a lot more to squeeze some utility from this card. In the end, i´m confident this card deserve a -1 cost.\n\n \n\n============================\n\n \n\nThese cards below didn´t get any errata. What do you guys think of then? Any of then should receive errata in your opinion?\n\n\n\nSneak Attack \nValiant Sacrifice \nFeint \nQuick Strike \nThicket of Spears \nA Light in the Dark \nA Test of Will \nDwarven Tomb \nHasty Stroke\nStand and Fight \nThe Galadhrim's Greeting \nWill of the West \nRadagast's Cunning \nSecret Paths\n\nEdited July 20, 2015 by Edvando"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1697694","commentId":1697694,"userName":"leptokurt","timestamp":1437381075,"content":"I think Theódred is still one of the most powewrful heroes, no need for an errata there.\n\n \n\n \n\nAs for the Citadel Guard, some ideas:\n\n \n\n\"Reduce the cost of Citadel Guard by X, where X is the numer of Citadel Guards in play\"\n\n \n\n-> fits with the Gondor theme\n\n \n\n \n\nor\n\n \n\n \n\n\"When you declare Citadel Guard as a defender, reduce the DEF of the attacker by 2\"\n\n \n\n-> the Citadel guartds are distracting the attacking enemy long enough so that the other forces can sneak up on them\n\nEdited July 20, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1697731","commentId":1697731,"userName":"Edvando","timestamp":1437386658,"content":"> I think Theódred is still one of the most powewrful heroes, no need for an errata there.\n> \n>  \n> \n>  \n> \n> As for the Citadel Guard, some ideas:\n> \n>  \n> \n> \"Reduce the cost of Citadel Guard by X, where X is the numer of Citadel Guards in play\"\n> \n>  \n> \n> -> fits with the Gondor theme\n> \n>  \n> \n>  \n> \n> or\n> \n>  \n> \n>  \n> \n> \"When you declare Citadel Guard as a defender, reduce the DEF of the attacker by 2\"\n> \n>  \n> \n> -> the Citadel guartds are distracting the attacking enemy long enough so that the other forces can sneak up on them\n\nYou are right about Theodred. I´ve removed his errata from the list.\n\nAbout Citadel Guard. Those suggestions are cool! Personally I really liked the -2 def. But as I said before, these are errata and not reworks. I´ve taken note about this suggestion and will add it to a future custom card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1697735","commentId":1697735,"userName":"Edvando","timestamp":1437386971,"content":"Ok people!!!!\n\nThe Version 1.0 of my personal errata is done. I´ve updated the page 1 with the full list of modifications.\n\nI´m still on the fence about some modifications, maybe some can be removed from the list (like Theodred) and some maybe added to the list (I´m pondering about Snowborn Scout). Also as new cards are released, I can revisit and see if any of my errata is not needed anymore.\n\nI´m still complete open to suggestions! If you state your reasoning I´m more inclined to like your suggestion. Also, I wanted more interactions with you guys, so I will try to bring more cards that I want opinions or give options so that we can balance which option is better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1703626","commentId":1703626,"userName":"Eu8L1ch","timestamp":1437821335,"content":"Another card I would consider for Errata is the Warden of Arnor attachment.\n\nPutting one progress on a location per round can be useful but it's very conditional: you need to pair it with other location control effects, might be useless in pretty often in 2P if no location is revealed, some locations from NM have very bad effects if you put progress on them but don't explore; finally, while one progress looks ok, you'll probably want to play this in a location-heavy quest, so it may very well be you'll put one progress on a location it's not convenient to explore from staging due to high QP (for example, revealing Eastern Bight first and  immediately after the Brown Lands).\n\nI think being a unique attachment, with some serious restrictions (just to give an idea, so far only 2 Heroes have the scout trait, Idraen and Haldir, and one of the two is not a feasible target) makes it a complete letdown for what it does.\n\n \n\nMy proposed change is as follows:\n\n \n\n \n\nWarden of Arnor\n\n \n\nAttach to a Scout hero.\n\nWhile attached hero is committed to the quest, Warden of Arnor gains: \"Response: after a location is revealed from the encounter deck, put one progress on it\".\n\nIn this way you could potentially put progress on 2-3 locations, also avoiding nasty effects such as those on \"A flooded ford\" or \"City remains\".\n\nOverpowered?\n\nI don't think so, as you would still need to meet the requirements, and also need other effects to actually gain some significant benefit from it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182658-personal-errata/?do=findComment&comment=1704367","commentId":1704367,"userName":"Edvando","timestamp":1437885618,"content":"> Another card I would consider for Errata is the Warden of Arnor attachment.\n> \n> Putting one progress on a location per round can be useful but it's very conditional: you need to pair it with other location control effects, might be useless in pretty often in 2P if no location is revealed, some locations from NM have very bad effects if you put progress on them but don't explore; finally, while one progress looks ok, you'll probably want to play this in a location-heavy quest, so it may very well be you'll put one progress on a location it's not convenient to explore from staging due to high QP (for example, revealing Eastern Bight first and  immediately after the Brown Lands).\n> \n> I think being a unique attachment, with some serious restrictions (just to give an idea, so far only 2 Heroes have the scout trait, Idraen and Haldir, and one of the two is not a feasible target) makes it a complete letdown for what it does.\n> \n>  \n> \n> My proposed change is as follows:\n> \n>  \n> \n>  \n> \n> Warden of Arnor\n> \n>  \n> \n> Attach to a Scout hero.\n> \n> While attached hero is committed to the quest, Warden of Arnor gains: \"Response: after a location is revealed from the encounter deck, put one progress on it\".\n> \n> In this way you could potentially put progress on 2-3 locations, also avoiding nasty effects such as those on \"A flooded ford\" or \"City remains\".\n> \n> Overpowered?\n> \n> I don't think so, as you would still need to meet the requirements, and also need other effects to actually gain some significant benefit from it.\n\n \n\nI´ve been including one or Warden of Arnor is all my spirit heavy decks and I always feel it underpeform. Maybe one to each is too much, dunno. I plan to buff most location control, since most of then suck (beside Northren Tracker and Asfaloth). I will go with your errata and I will playtest it to see."}]}