{"url":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/","title":"The Never Ending Path?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/?do=findComment&comment=1696066","commentId":1696066,"userName":"Ghost Dancer","timestamp":1437207051,"content":"OK, so I just played my first few games and, for the most part, I'm really enjoying it so far.\n\n \n\nHowever, I just played a solo game doing the \"Don't Leave the Path\" quest (the 3rd card of Passage Through Mirkwood), and Ungoliant's Spawn (the card I had to defeat) was the very last card in the deck and it was unfortunately drawn as a shadow card. I gave up at that point since (as I understand the rules) he would have been shuffled with the discards into a new encounter deck and I would have had to potentially go through the entire deck again.\n\n \n\nI just wanted to check I played correctly? If so it seems like a massive design flaw in this particular quest. I'm guessing there are other similar quests where you need to reveal a certain card and the same thing can occur. Please tell me I'm doing it wrong because this sort of thing can really suck the fun out of games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/?do=findComment&comment=1696086","commentId":1696086,"userName":"DukeWellington","timestamp":1437210588,"content":"When you advance to stage 3 it instructs each player to search the deck for a spider enemy. At that point you simply search for the Ungoliant spawn. Technically you didn't play wrong (as in you didn't break any rules) but you missed an easy fix."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/?do=findComment&comment=1696087","commentId":1696087,"userName":"leptokurt","timestamp":1437210591,"content":"\"Don't Leave the Path\" instructs you to search for 1 Spider card and add to add it to the staging area. This card should be Ungoliant's Spawn, of course, otherwise you're facing the problem you're mentioning here. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/?do=findComment&comment=1696093","commentId":1696093,"userName":"Ghost Dancer","timestamp":1437211549,"content":"Aaaaaaaahhhhhhhhhhh, yeah that's really obvious now you've told me lol. I searched until I found the first spider in the deck - should have read it more carefully. Thank you both :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 18, 2015 by Ghost Dancer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182750-the-never-ending-path/?do=findComment&comment=1696528","commentId":1696528,"userName":"Ecthelion III","timestamp":1437258646,"content":"And just so you know, there are no more quests in the game that require you to kill a certain enemy that isn't specifically brought out by a quest card effect."}]}