{"url":"https://community.fantasyflightgames.com/topic/182726-if-you-made-a-custom-scenario-and-really-messed-with-basic-game-properties/","title":"If you made a custom scenario and really messed with basic game properties...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182726-if-you-made-a-custom-scenario-and-really-messed-with-basic-game-properties/?do=findComment&comment=1695641","commentId":1695641,"userName":"Mikallo","timestamp":1437164053,"content":"With day and night, Erestor, Sword-Thain and some other really interesting meta-opening cards I figured I'd ask a hypothetical and see if anyone bit:\n\n \n\nIf you made a custom scenario and really messed with basic game properties how would you do it? \n\n \n\nScrew with the phase order?\n\n \n\nCombat first:\n\n \n\n1. Resource\n\n2. Planning\n\n3. Defending\n\n4. Attacking\n\n5. Questing\n\n6. Traveling\n\n7. Refresh\n\n \n\nPros: Would be different. Force players to survive a whole round on the last turn. Would feel different\n\nCons: Combat would be easier to plan out ahead of time - May need added treachery effects or things that allowed surprises.\n\n \n\nTake and Hold Scenario: Let's say you had to move allies to different locations and 'claim' them - Enemy reinforcements could spawn from a separate deck or as facedown guards, etc\n\n \n\n1. Resource\n\n2. Planning\n\n3. Travel\n\n4. Defending\n\n5. Attacking\n\n6. Questing\n\n7. Refresh\n\n \n\nMaybe allies could only fight or engage enemies at the locations, or blah blah, etc.\n\n \n\nTreasure deck? - Put attachments in a separate player deck. Whenever an enemy is defeated or a location cleared you may draw one for free\n\n \n\nMultiple encounter deck? - the 'main deck' and a 'goons deck.' Treacheries may require you to draw cards from teh goons deck or a location may spawn baddies until it's cleared etc.\n\n \n\nSeparate parties? I heard fog on the barrow downs could split people up. What about something like in a tactics RPG where the party was split but working towards a similar goal? One player or one hero from each hero fought/distracted enemies so the others could quest ahead. They'd be unable to help.\n\n \n\nI like the way things flow already, but I'm sure there's lots of fun ideas out there (like a mod to a video game). Anything too complicated would be annoying to learn. If the rules are too unique people could be turned off from constructing decks for a single scenario, as well.\n\n \n\nIt's fun to think about, though. I'm sure there's plenty of crazy ideas out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182726-if-you-made-a-custom-scenario-and-really-messed-with-basic-game-properties/?do=findComment&comment=1696517","commentId":1696517,"userName":"Ecthelion III","timestamp":1437257957,"content":"I made a custom quest once where the players could split up by traveling to different locations. For example, in a 4-player game, two players could travel to Location #1, while two other players could travel to Location #2, creating a second staging area and dealing cards into that staging area equal to Location #2's threat."}]}