{"url":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/","title":"Best Deck Types for Scoring in Quest Log","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1695613","commentId":1695613,"userName":"Isuckworse","timestamp":1437162808,"content":"I am returning to the LOTR LCG after a brief hiatus and am about halfway through the Heirs of Numenor cycle and am finding it difficult to get good scores like I did on previous quests with Dwarf decks (though I'm actually using an Elrond/Vilya and mono-Tactics deck instead of Dwarves currently because that worked well in Heirs).  I know a lot of players don't like to play for score, but if you do, what deck types are best to use for score in the Heirs of Numenor Cycle and beyond in later cycles?  Also, if you play for score, feel free to add me as a friend on the Quest Log.  It is always nice to see how other people are doing with quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1696044","commentId":1696044,"userName":"Seastan","timestamp":1437201983,"content":"I have been working with a mono-lore deck (discussed here https://community.fantasyflightgames.com/topic/180873-passage-through-mirkwood-challenge/ [https://community.fantasyflightgames.com/topic/180873-passage-through-mirkwood-challenge/]) that is specifically designed to get good scores, tuned to each quest. It's pretty boring though. Most of the time I prefer to play normally and forget about score.\n\n \n\nFeel free to add me on the log."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1696737","commentId":1696737,"userName":"Isuckworse","timestamp":1437283119,"content":"Thank you for showing me that topic thread and your deck sounds interesting to play.  I will definitely give it a shot!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1696790","commentId":1696790,"userName":"Fingolfin Fate","timestamp":1437291485,"content":"I like to count the score at the end: but only the original idea, without the number of rounds. I will never play one extra round just to get a better score.\n\n \n\nWhat I like, and I think what could be done more often is what they did with the last stage of Helm's Deep, players not being able to reduce threat. That would be most thematic in the finale of Journey Along the Anduin, for instance. Or in many other quests where the ending is just a fight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1698583","commentId":1698583,"userName":"Isuckworse","timestamp":1437435774,"content":"I think it is more fun to play for score without counting rounds too because using rounds for scoring makes it so certain decks are just better than others because they are faster, but since FFG has made the rules the way they are, I try to follow them.  It does make it frustrating or feel luck based when trying to speed through as fast you can and hitting a treachery or two which simply delays you and hurts your score.  \n\n \n\nThat is a great point.  It doesn't make much sense to be able to reduce your threat in a huge battle or after the enemy has spotted you.  I had never thought of it that way, but I think you're definitely right.  That is why this game can be great to play for theme too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182724-best-deck-types-for-scoring-in-quest-log/?do=findComment&comment=1698599","commentId":1698599,"userName":"DukeWellington","timestamp":1437436593,"content":"It's not too difficult to keep track of rounds. The problem with the old system is that if you play competitively then it encourages you to delay until you have 0 threat and your heroes are fully healed. That is lame. Basically, a deck is better if it is faster. The only other factor is winning percentage. Score and win percentage both together give the best measure of the best deck. I mostly don't play competitively, but when I do, that's how I do it."}]}