{"url":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/","title":"Throwing in Enemies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698341","commentId":1698341,"userName":"bubblepopmei","timestamp":1437424182,"content":"I've only played a few games so far but my roommates and I really enjoy the game. We are wondering when we are going to see some Nazgul. \n\n \n\nI have Core, Hobbit Doorstep, Heirs of Numenor, and Black Riders so I know we can run missions with the Nazgul in them but since we are lacking Khaz we cannot play the Durin's Bane or Watcher in the Water I have from the APs.\n\n \n\nDo any of you just toss in some cool enemies into any mission so you can bat around something fun or does that wreck the balance?\n\n \n\nDoes the Black Riders work with a non-ring bearer/non-hobbit deck? Put another way - do we have to build decks for the encounter or can we use whatever we wish to tackle those scenarios?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698354","commentId":1698354,"userName":"jnicol","timestamp":1437424706,"content":"> I've only played a few games so far but my roommates and I really enjoy the game. We are wondering when we are going to see some Nazgul. \n\nWithout spoiling too much, let me say that you don't have long to wait: there is a Nazgul in the core set.\n\nBut when it shows up you might not be so eager to see it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698359","commentId":1698359,"userName":"DukeWellington","timestamp":1437424912,"content":"Personally, I like to keep all encounter decks as they are designed because I like the flavor and story, etc. The game is hard enough. If you want more challenge you can go Nightmare. Including enemies from other scenarios would mess up the quest theme most of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698363","commentId":1698363,"userName":"Noccus","timestamp":1437425108,"content":"As this game is cooperative, you can make all the house rules you want and toss any card in any encounter deck you want.\n\nYour house, your rules.\n\nThat said, I will bet money on it that well over 90% of the players here would not do that and stricktly follow the rules on any quest.\n\nBut play however you like, it's a game and it's meant to be fun.\n\n \n\nOn the second aspect of your post there is no single answer.\n\nSome people love to build a deck to try and rule all quests.\n\nOthers love to create special decks for certain quests.\n\nAnd everything in between.\n\n \n\nBottom line: no rules but yours for both :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698364","commentId":1698364,"userName":"alexbobspoons","timestamp":1437425146,"content":"Most of the cost of research and development on packs goes into playtesting, so i think adventures as-is are best for me :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEach to their own though, your cards so you can mix if you like :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698376","commentId":1698376,"userName":"bubblepopmei","timestamp":1437425679,"content":"I defer to your collective judgement regarding maintaining the authenticity of the scenarios. \n\n \n\nHowever, as Noccus mentioned, my friends and I are certainly the sort to create our own decks creatively and then play those decks in the scenarios. This likely makes things harder than they should be, but it also makes the experience more fun for us. \n\n \n\nSo what will happen with Black Riders scenarios is I'll play a Caldara mono-spirit deck, my roommate will play a hobbit-less Lore deck, and my brother will play a tactics deck or something. Nobody will have a ring-bearer, unless that's a requirement of the scenario. \n\n \n\nI'm wondering if Black Riders (or other scenarios) will flounder because we are missing hobbits, or ring-bearers, or some other specific sub type or trait."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698483","commentId":1698483,"userName":"PocketWraith","timestamp":1437430840,"content":"You can play Black Riders with any decks you like, so long as you don't include Frodo as one of your normal heroes (which you can't since you don't have Conflict at the Carrock). The Ring-bearer is Fellowship Frodo, who comes in Black Riders, and you just add him in as well as whatever heroes you're each including in your decks as standard. It's just part of the setup for those quests.\n\nEdited July 20, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698613","commentId":1698613,"userName":"PsychoRocka","timestamp":1437437353,"content":"> Personally, I like to keep all encounter decks as they are designed because I like the flavor and story, etc. The game is hard enough. If you want more challenge you can go Nightmare. Including enemies from other scenarios would mess up the quest theme most of the time.\n\nQuest mechanics could potentially suffer too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698797","commentId":1698797,"userName":"bubblepopmei","timestamp":1437450861,"content":"I notice the core and heirs of Numenor sets include difficulty ratings for the scenarios. Black Riders doesn't. What rating would you give those scenarios?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1698960","commentId":1698960,"userName":"DukeWellington","timestamp":1437471508,"content":"First of all, the difficulty ratings are notoriously untrustworthy, so take them with a grain of salt. Some brutal quests are rated as easy (into ithilian) and some that are rated as difficult are actually easy (dead marshes).\n\nSecond, the Saga quests mainly do not have ratings because the difficulty changes depending on things like boons and burdens that are carried over from earlier quests. For the most part saga quests are easier because the focus is more on story and theme (but they are still hard). For instance, in the first fellowship box most of the enemies have high threat so that you can use hobbits more effectively. In short, I would rate them at about 5 or so, but that is my opinion, and others may find them more difficult, especially with smaller card pool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1699019","commentId":1699019,"userName":"Ghost Dancer","timestamp":1437479480,"content":"> Does the Black Riders work with a non-ring bearer/non-hobbit deck? Put another way - do we have to build decks for the encounter or can we use whatever we wish to tackle those scenarios?\n\n \n\nI'm also new to the game so don't know the answer to that. However, I can tell you my approach and the reasoning behind it. I plan on mainly getting the Saga expansions, and I will be making decks using as many cards from that expansion as is practical (working sequentially through them starting with Black Riders). My reason for this is one of theme - from what I've seen, the cards included in each box fit thematically with the quests (which are based on events from the books). \n\n \n\nI'm not normally too bothered about 'fluff' in games, but reading the quest narratives really adds to the whole experience of this game - it oozes theme, so not using at least some cards in an expansion to play those quests seems counter productive to me. That said, I'm still working through the Core Set and might find it too difficult to pursue this path as I progress, but it will sure be fun finding out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1699089","commentId":1699089,"userName":"bubblepopmei","timestamp":1437484250,"content":"Oh gosh I'm glad you mentioned Into Ithilien - we were planning on trying that tonight, our third quest. \n\n \n\nI'll snoop around the forums for a list of player-decided difficulty rankings for much of the quests. We have several more on the way - we have most of the APs for Heirs of Numenor, we have Core, Black Riders, Hobbit Doorstep, and we have Khaz-Adum on the way with some other APs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1699319","commentId":1699319,"userName":"Raven1015","timestamp":1437494130,"content":"I'd recommend the excellent LOTR LCG Quest Companion [http://lotr-lcg-quest-companion.com/] site, as it allows players to vote collectively on the difficulty rating for each scenario. Into Ithilien, for example, has a rating of 7 compared to the official difficulty of 4. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182903-throwing-in-enemies/?do=findComment&comment=1700182","commentId":1700182,"userName":"Edvando","timestamp":1437553132,"content":"> I've only played a few games so far but my roommates and I really enjoy the game. We are wondering when we are going to see some Nazgul. \n> \n>  \n> \n> I have Core, Hobbit Doorstep, Heirs of Numenor, and Black Riders so I know we can run missions with the Nazgul in them but since we are lacking Khaz we cannot play the Durin's Bane or Watcher in the Water I have from the APs.\n> \n>  \n> \n> Do any of you just toss in some cool enemies into any mission so you can bat around something fun or does that wreck the balance?\n> \n>  \n> \n> Does the Black Riders work with a non-ring bearer/non-hobbit deck? Put another way - do we have to build decks for the encounter or can we use whatever we wish to tackle those scenarios?\n\n \n\nI did throw in a some enemies sometimes, specially when I had fewer cards, just for fun. I remember putting in Anduin Trolls in Passage Through Mirkwood and The Hills of Emyn Muil. Now days I have so many quests that I don´t even need to throw in more enemies for replayability.\n\nEdited July 22, 2015 by Edvando"}]}