{"url":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/","title":"Second breakfast &quot;Prison Food&quot; article","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699368","commentId":1699368,"userName":"GrandSpleen","timestamp":1437496159,"content":"About the upcoming Mount Gram AP.\n\n \n\nArticle here [https://www.fantasyflightgames.com/en/news/2015/7/21/prison-food/].\n\n \n\nAlso a teaser about the Ettenmoors AP, which will include a \"5 hit point hero.\"\n\n \n\nunexpected-rescue-1a.png [https://images-cdn.fantasyflightgames.com/filer_public/96/af/96af133d-d340-4f1c-a8e9-abed0206e160/unexpected-rescue-1a.png]\n\nprison-cell.png [https://images-cdn.fantasyflightgames.com/filer_public/48/79/4879b8c9-78c8-4b20-8e63-1ca5a8ced213/prison-cell.png]dungeon-guard.png [https://images-cdn.fantasyflightgames.com/filer_public/f7/0c/f70ceb65-7e46-46f1-ae9a-b26f817cd555/dungeon-guard.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699375","commentId":1699375,"userName":"Raven1015","timestamp":1437496481,"content":"Best. Idea. Ever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699383","commentId":1699383,"userName":"GrandSpleen","timestamp":1437496793,"content":"It sounds really cool, but it does sound like it might be fodder for someone like Boromir.  And you might be able to take the scenario apart by making a deck that relies on events and attachments that are excluded from the capture mechanic.\n\n \n\nBut I'm certainly going to let it steal my allies away on the first go, wanna see how this plays!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699405","commentId":1699405,"userName":"Raven1015","timestamp":1437497529,"content":"Oh I agree that it certainly seems ripe for very specific planning and deck building, but it could be fun to try out a bunch of different starting heroes against it once you tire of the optimal ones. A Fatty prison break would be good wholesome fun.\n\nEdited July 21, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699420","commentId":1699420,"userName":"chrsjxn","timestamp":1437498224,"content":"Some heroes are clearly a lot better than others in this mode. I'm actually thinking Sam will be a great choice, since he has some willpower to quest early.\n\n \n\nAlso, if you make a deck with only 7 eligible cards for your draw deck, you'll guarantee that you have them all in hand on turn 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699433","commentId":1699433,"userName":"Trialus","timestamp":1437498529,"content":"Does seem like it could lend itself to being overcome by specific deck building, but also seems like one of the most thematic ideas I've heard....super excited to play this quest...stuck in a dungeon...rescuing players...searching for our gear...sound awesome!!   Hope some of these ideas see play in later quests as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699477","commentId":1699477,"userName":"Bullroarer Took","timestamp":1437500813,"content":"This sounds fantastic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699495","commentId":1699495,"userName":"Qaanaaq","timestamp":1437501667,"content":"Really neat direction to make tha game interesting in yet unexplored ways. Neat!\n\nEdited July 21, 2015 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699514","commentId":1699514,"userName":"DukeWellington","timestamp":1437503090,"content":"Since when is encouraging specific deck building a bad thing? The quest just sounds amazing. I have often wanted a POD quest that featured the skipped over section in the Hobbit when Bilbo finds a way to escape the palace of Thranduil. It is one of the best sections of the book, but extremely difficult to translate into a quest. This latest quest makes me think of that episode. I am excited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699546","commentId":1699546,"userName":"Trialus","timestamp":1437504879,"content":"> Since when is encouraging specific deck building a bad thing? The quest just sounds amazing. I have often wanted a POD quest that featured the skipped over section in the Hobbit when Bilbo finds a way to escape the palace of Thranduil. It is one of the best sections of the book, but extremely difficult to translate into a quest. This latest quest makes me think of that episode. I am excited.\n\n \n\n \n\nYou are right. ...And doing a quest to free Thorin and Co from Thranduil's Palace would be ridiculously fun. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699677","commentId":1699677,"userName":"PocketWraith","timestamp":1437511287,"content":"> Also, if you make a deck with only 7 eligible cards for your draw deck, you'll guarantee that you have them all in hand on turn 1.\n\nNot quite - look at the quest card, at the end of the other setup you draw a new starting hand of only 3 cards. You'd have to limit it to 4 eligible cards.\n\nOn the other hand, I do think including a very limited number of cards you can keep to make your remaining deck incredibly consistent may be a very effective deckbuilding strategy for this quest.\n\nReally looking forward to seeing how these mechanics play out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699820","commentId":1699820,"userName":"gandalfDK","timestamp":1437519550,"content":"Treebeard Gandalf deck. Just include three copies of UC and fill the rest with other stuff. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nSeriously though, getting 3 UC out has never been easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699834","commentId":1699834,"userName":"chrsjxn","timestamp":1437520839,"content":"> Not quite - look at the quest card, at the end of the other setup you draw a new starting hand of only 3 cards. You'd have to limit it to 4 eligible cards.\n> \n>  \n> \n>  \n> \n> On the other hand, I do think including a very limited number of cards you can keep to make your remaining deck incredibly consistent may be a very effective deckbuilding strategy for this quest.\n> \n> Really looking forward to seeing how these mechanics play out.\n> \n>  \n\n \n\nWhoops, didn't actually read the quest card. Just the summary.\n\n \n\nWhat would you bring? They mostly can't be attachments or allies, so most permanent boons are right out.\n\n \n\nMaybe Glorfindel + Light of Valinor and Test of Will x 3. (LoV is a condition, so it doesn't go in the attachment deck) Elrond's Counsel could also be a strong include, since you can play them for free as soon as you get another character.\n\n \n\nA Leadership dwarf + 3x Durin's Song. Tactics Merry + 3x Halfling Determination."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699924","commentId":1699924,"userName":"Teamjimby","timestamp":1437527782,"content":"After 3 years of being insulted and neglected, it's time for Taking Initiative to finally prove its worth!\n\nTaking-Initiative.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Redhorn-Gate/Taking-Initiative.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699973","commentId":1699973,"userName":"monkeyrama","timestamp":1437530474,"content":"This is a really cool sounding quest. Can't wait to try it out - looks like they've really thought of a good way to do a prison break without mimicking Dol Guldur too much. Excellent!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1699997","commentId":1699997,"userName":"Gizlivadi","timestamp":1437531972,"content":"A quest that restricts you to 1 hero and lets you rescue your stuff? That's new. I think that if done right this could easily become a classic. Or a total dud. Hoping for the former!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700051","commentId":1700051,"userName":"PsychoRocka","timestamp":1437539621,"content":"This quest looks epic! I just beat Wastes of Eriador and think it is an amazing new quest. This one looks like it will potentially be even better!! The single hero to start with is pretty gnarly!!! I love that your second hero is placed on the very top of your \"captured deck\" meaning you will see it very early on (so long as you are successful in freeing/saving them!) but your third is shuffled into your captured deck so could potentially not appear at all or at least a lot later in the quest! Reminds me of the treachery card lost and alone in the foundations of stone quest. \n\n \n\nJust for the sake of it here are some key attachments that do not have the item, artifact or mount trait and could potentially be very useful in this quest:\n\n-Steward of Gondor\n\n-Light of Valinor\n\n-Visionary Leadership\n\n-O Lorien\n\n-Wingfoot\n\n-Heir of Mardil\n\n-Captain of Gondor\n\n-The Days Rising\n\n-Unexpected Courage\n\n-Protector of Lorien\n\n-Dunedain Mark and Dunedain Warning\n\n-Fast Hitch\n\n-Ranger Spikes\n\n \n\nAlso due to the wording on Stage 1A am I right in saying that during your first turn your starting hero would have 3 resources (2 from the quest stage and 1 from your first resource phase) and you would have 4 cards in hand (3 from quest stage and 1 from your first resource phase)? This is not too shabby a setup for a single hero and considering you can rescue a hero for each player quite early on it seems like for the majority of the quest each player will have two heroes and if lucky will rescue their third at some point. It is also very interesting to note that the Angmar Orcs encounter set is the only one used other than the encounter set included in the scenario and whats more it seems like the Angmar Orcs set is only added to the encounter deck later in the quest (perhaps at stage 2 or even stage 3). I think this is to keep the power level of the encounter deck low while you only have one (maybe two) hero. This is backed up by how weak the two encounter cards spoiled are. The enemy has incredibly low stats (you could even take an undefended attack and then attack back and kill it with the one hero and no allies in play) and allows you to play one of the rescued cards for free. Similarly the location allows you to play one of the captured cards for free when you travel there and then once explored will put any other rescued cards in their owners hand.\n\nThis quest seems like it will have so much replay value and randomness as every game your capture deck will be shuffled differently and you will gain very different \"rewards\" so to speak in each game. The two heroes I plan to use as my initial heroes (two handed play) are Sam and Elrond. Elrond boosts healing, has high willpower and with Light of Valinor can quest and defend and Sam has action advantage built in, high willpower and with a fast hitch can also easily pull double duties. Tactics Boromir is obviously an ideal choice as well and would perhaps even make this quest trivial (at the start at least). \n\nWe don't really know how tough it will get towards the end however so perhaps he will only make freeing more characters and the early game much easier but will not be overly useful towards the end. \n\n \n\nLastly that five hit points hero sounds pretty exciting!! We only have a few existing heroes with 5 or more hitpoints and this new hero is the defensive tactics hero. A defender with 5 hitpoints could potentially be a very big deal!\n\nEdited July 22, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700058","commentId":1700058,"userName":"Fingolfin Fate","timestamp":1437540227,"content":"Oh, I was hoping for Gildor but now I wonder if he should be it. The five-hit-point guy sounds more like a Dúnedain, perhaps. But it should certainly be the one with the scrying mechanic, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700064","commentId":1700064,"userName":"Chris51261","timestamp":1437540769,"content":"Your second and third heroes wouldn't matter threat wise, would they? Unless there's some mechanic we haven't seen yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700072","commentId":1700072,"userName":"PsychoRocka","timestamp":1437541298,"content":"> Oh, I was hoping for Gildor but now I wonder if he should be it. The five-hit-point guy sounds more like a Dúnedain, perhaps. But it should certainly be the one with the scrying mechanic, right?\n\nThe Lore hero is in Mount Gram, the tactics defensive hero with 5 hitpoints is in across the ettenmoors."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700078","commentId":1700078,"userName":"Fingolfin Fate","timestamp":1437541982,"content":"Oh, thanks for that. I did not expect to get a teaser from the third pack in the article about the second pack. That makes sense: the defensive Tactics (probably Dwarf) will have five hp. All clear now. And it doesn't mean the scrying Lore hero shall not be Dúnedain: we may get two in the cycle (pack 2 & 5) but I still hope it is Gildor (though having three Noldor: here, Erestor and pack 6 is probably asking too much even though Dwarrodelf had 4)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700106","commentId":1700106,"userName":"PsychoRocka","timestamp":1437546607,"content":"There really aren't that many Noldor heroes yet and one is a second copy of Glorfindel so we might get three this cycle. I think you are right though and we will probably only get two; Erestor and someone else. I'm not sure that we will get that many more Dunedain heroes however as there are no more named characters left and Beravour and Idraen are already FFG creations.\n\nA different version of Halbarad further along in the game would be nice. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700165","commentId":1700165,"userName":"Fingolfin Fate","timestamp":1437552106,"content":"I think the Spirit in the last pack is a given, pretty much. I don't see it going anywhere else. Hobbits just got Spirit Merry; Gondor have two Spirit heroes whilst few Spirit cards; Dúnedain have Idraen (and also have only a few Spirit cards); Rohan just got Théoden (and have Éowyn and Dúnhere also). More importantly, the focus on the discard pile strategy will probably be Spirit/Lore-oriented, and Noldor-themed, so a Spirit Noldor hero to cap it up in the last pack must be true. It would also unlock Glorfindel in a way -- giving us another hero to benefit from Elrond's Counsel right away.\n\n \n\nAnd I agree, we still have a very few Noldor characters (and especially allies), partly because we never got a Noldor deluxe. And this is Eriador where both Lindon and Rivendell are (though strictly speaking they are beyond its borders, I believe), the two places where the Noldor dwell. I don't think we shall get a Noldor-deluxe, I can't see where it would take place. So yes, I totally hope for three Noldor heroes in this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700193","commentId":1700193,"userName":"John Constantine","timestamp":1437554308,"content":"It seems to me like a second attempt at Escape from Dol Guldur, now with some more experience and insight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700287","commentId":1700287,"userName":"PocketWraith","timestamp":1437564240,"content":"It seems to me like a bit of Dol Guldur, a bit of Foundations of Stone, and a bit of To Catch an Orc, all mixed together with some new ideas on top."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700346","commentId":1700346,"userName":"Glaurung","timestamp":1437569187,"content":"This cycle make me happy with every pack review! First pack wargs ans stuff looks so cool and next one with a capture mechanic looks also amazing! Really cool time for lotr now!\n\nAbout a hero…. We need Noldor! Maybe Cirdan?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700368","commentId":1700368,"userName":"Fingolfin Fate","timestamp":1437570762,"content":"Yes, both quests look interesting.\n\n \n\nCírdan would be cool. But I think he will be the Spirit hero in the last one: save the best for the end, I think. Arwen hero is also a possibility, but I would really prefer Gildor Inglorion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700393","commentId":1700393,"userName":"OMZA","timestamp":1437571796,"content":"I read Treebeard in prison? Ok, that would be interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700955","commentId":1700955,"userName":"Gizlivadi","timestamp":1437602462,"content":"If playing a Silvan deck, who would you choose a your starting hero? Celeborn has great stats and access to O Lórien, but Haldir is also very good since he can attack the staging area. It is actuallty a pretty tough choice, but I think I'd go with Celeborn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700971","commentId":1700971,"userName":"John Constantine","timestamp":1437603632,"content":"Celeborn is a no-brainer, he works with the Silvan allies, while Haldir doesn't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1700977","commentId":1700977,"userName":"GrandSpleen","timestamp":1437603990,"content":"You put your 2nd hero on top of your 'captured' deck right? Which means you'll see that guy come out pretty quickly.  With that in mind I would choose Haldir, as Celeborn will have no power until I get some of my captured guys out.  Then make the rest of your deck to make it very likely that you'll pull Wingfoot on turn 1, which you can play thanks to the extra resources, and you've got action advantage right out of the gate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701126","commentId":1701126,"userName":"Bullroarer Took","timestamp":1437614317,"content":"\"Old Bullroarer Took may have invented golf when he struck down Golfimbul, but Escape from Mount Gram is certainly no stroll across the greens.\"\n\nI'm not that old. Just sayin'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701231","commentId":1701231,"userName":"Fingolfin Fate","timestamp":1437625083,"content":"> If playing a Silvan deck, who would you choose a your starting hero? Celeborn has great stats and access to O Lórien, but Haldir is also very good since he can attack the staging area. It is actuallty a pretty tough choice, but I think I'd go with Celeborn.\n\nWhy not have both? But if only one, then indeed Celeborn is a must -- with Galadriel, of course."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701263","commentId":1701263,"userName":"Gizlivadi","timestamp":1437630145,"content":">  \n> \n> > If playing a Silvan deck, who would you choose a your starting hero? Celeborn has great stats and access to O Lórien, but Haldir is also very good since he can attack the staging area. It is actuallty a pretty tough choice, but I think I'd go with Celeborn.\n> \n> Why not have both? But if only one, then indeed Celeborn is a must -- with Galadriel, of course.\n> \n>  \n\n \n\nI was referring to the one hero you get to start with in this quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701403","commentId":1701403,"userName":"Fingolfin Fate","timestamp":1437646497,"content":"Oh, I thought it would otherwise be a pretty random question. Sorry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701441","commentId":1701441,"userName":"John Constantine","timestamp":1437649326,"content":"> \"Old Bullroarer Took may have invented golf when he struck down Golfimbul, but Escape from Mount Gram is certainly no stroll across the greens.\"\n> \n> I'm not that old. Just sayin'.\n\nA hint for Bullroarer Took hero perhaps?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701580","commentId":1701580,"userName":"PsychoRocka","timestamp":1437659044,"content":"He is long dead during the time this game takes place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701613","commentId":1701613,"userName":"John Constantine","timestamp":1437660742,"content":"> He is long dead during the time this game takes place.\n\nReally? You're talking about stuff like this in the game that features both Bard the Bowman and Brand Son of Bain as heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701736","commentId":1701736,"userName":"PocketWraith","timestamp":1437667159,"content":"Bard was released in a Hobbit box. At the time of The Hobbit, he was alive. Same goes for Thorin, Fili, Kili, and hero Beorn (no idea about ally Beorn). Bullroarer Took was dead long before The Hobbit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701748","commentId":1701748,"userName":"John Constantine","timestamp":1437667677,"content":"That's not the point. The point is there is no strict time frame for this game, where a man can meet his unborn fully grown grandson.\n\nEdited July 23, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701850","commentId":1701850,"userName":"PocketWraith","timestamp":1437672673,"content":"Except there is - or if you want to be pedantic, there are two. All the quests take place either during The Hobbit or during Lord of the Rings. Nothing outside those time frames has yet appeared in the game and we have no reason to believe any such thing ever will appear in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701952","commentId":1701952,"userName":"Chris51261","timestamp":1437678695,"content":"> That's not the point. The point is there is no strict time frame for this game, where a man can meet his unborn fully grown grandson.\n\nThat's a good point, and there are other examples of characters being present at seemingly impossible times, but I think many of the characters who should be cronologically dead are from Saga Expansions, and the adventure packs and deluxe expansions take place only pull characters who were alive during the 17 year period after Bilbo's 111th birthday party."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1701975","commentId":1701975,"userName":"Gizlivadi","timestamp":1437679352,"content":"I agree. The Hobbit sagas should be considered an exception in this case. We're not going to see out of time frame characters during the cycles I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1702104","commentId":1702104,"userName":"John Constantine","timestamp":1437685843,"content":"> Except there is - or if you want to be pedantic, there are two. All the quests take place either during The Hobbit or during Lord of the Rings. Nothing outside those time frames has yet appeared in the game and we have no reason to believe any such thing ever will appear in the game.\n\n...as we have no reason to believe they won't. It's all speculation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/182969-second-breakfast-prison-food-article/?do=findComment&comment=1702406","commentId":1702406,"userName":"PsychoRocka","timestamp":1437710760,"content":"The game takes place during a certain period... we are not going to get characters from outside that period UNLESS an expansion takes place during another time period (like the hobbit boxes). \n\nFirst age or second age one day would be fantastic. "}]}