{"url":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/","title":"GenCon 2015 Exclusive","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1702753","commentId":1702753,"userName":"bubblepopmei","timestamp":1437743900,"content":"I'm still very new to the game but I have a friend who is attending GenCon next week. He's willing to pick things up for me.\n\n \n\nIs there typically a GenCon exclusive for LotR LCG? Is it something purchased or a promo given from participating in an event?\n\nWhat has has the exclusive been in the past?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1702762","commentId":1702762,"userName":"John Constantine","timestamp":1437744536,"content":"There usually some PoD quest, but its not, in fact, \"exclusive\", it's just delyaed before the worldwide release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1703502","commentId":1703502,"userName":"Glaurung","timestamp":1437795657,"content":"Looks like there is ni info what kind of POD quest will be on GenCon this time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1703526","commentId":1703526,"userName":"Narsil0420","timestamp":1437799351,"content":"No word yet about what the scenario is. We'll let you guys know as soon as we can! First event is Thursday 7pm Indianapolis time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1703527","commentId":1703527,"userName":"GrandSpleen","timestamp":1437799355,"content":"On the recent CotR podcast, Matthew (one of the designers) said they are keeping it a surprise.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1703821","commentId":1703821,"userName":"Glaurung","timestamp":1437840262,"content":"That sound cool! Surprise that's probably what we need. Every time I thinking go GenCon… maybe next year I should make it. Sure I will go to Germany in march for Elrond Council event in march. And yes why not? GenCon next year!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1705918","commentId":1705918,"userName":"bubblepopmei","timestamp":1438027315,"content":"I have dispatched an agent to GenCon - aside from PoD quests, is there something to acquire from GenCon this year for LotR that isn't on shelves already?\n\n \n\nIn comparison, X-Wing players will likely acquire miniatures before they hit FLGS shelves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1705928","commentId":1705928,"userName":"Noccus","timestamp":1438027728,"content":"It's always a bit of a surprise really.\n\n \n\nThere will be the PoD and Mount Gram for sure.\n\nLast year there were 3 nightmare decks for sale there that hadn't hit stores yet.\n\nAnd the year before that it was a complete surprise that they had the 5th AP of the AtS cycle.\n\n \n\nSo they always do have something special.\n\nIt's a guess on what they will have in store for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1705954","commentId":1705954,"userName":"Teamjimby","timestamp":1438028511,"content":"I wouldn't be surprised if Land of Shadow is at Gencon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1706002","commentId":1706002,"userName":"Raven1015","timestamp":1438030416,"content":"Last year, myself and the other Grey Company gents built decks around the Fellowship expecting The Road Darkens to be there, and we were sorely disappointed. I have built some decks in expectation of Land of Shadow being there this year, so I guess I have not learned my lesson at all.\n\n \n\nIs \"building your decks before release is confirmed\" the LOTR LCG equivalent of counting your chickens before they hatch?\n\nEdited July 27, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183173-gencon-2015-exclusive/?do=findComment&comment=1706293","commentId":1706293,"userName":"Rob_Oz","timestamp":1438051879,"content":"As far as new LOTR product availability at GenCon, the sense I get is that FFG has little control over what new products they can make available at the Con.\n\n \n\nTwo years ago (2013), FFG sold the first Saga Expansion - The Black Riders and the 5th Adventure Pack from the Against the Shadow cycle (Assault on Osgiliath I think?) in the dealers hall. I was not at GenCon in 2013, but did manage to have a friend (thanks, Tanya!) pick up The Black Riders for me, which I dearly wanted. This was rather a big deal at that time because the community was very excited for the Saga Expansions. Furthermore, TBR didn't release to retail outlets until mid-late September, IIRC.\n\n \n\nI did attend GenCon last year (2014) and FFG had no new LOTR products to sell. This was sorely disappointing, as the release of The Black Riders at GenCon 2013 seemed to set a precedent for Saga boxes releasing at the Con. Thus I, and others such as Raven1015 were quite hopeful that The Road Darkens would be available in 2014. I spoke with an FFG employee who expressed similar disappointment. Despite last year's disappointment, I am watching careful to see if The Land of Shadow is released at the Con, as last week's preview hints at the possibility. Unfortunately, I won't be at GenCon this year again, but might be able to procure a copy of TLOS if it is there.\n\n \n\nAs far as the POD scenario, my understanding is that you can only get the POD if you've registered for the event. FFG does not sell it in their booth so far as I know. Outside of getting it through event participation your only only chance to get it right away would be to pay an arm and a leg to someone who did play in the event.\n\n \n\nI'm sure FFG wants to provide early release products at GenCon to fans of all their games as much as possible, but its quite likely that they can't do much to expedite the arrival of products still at the printer or still in shipping. For those attending, keep your fingers crossed, but history seems to show there are no guarantees.\n\nEdited July 28, 2015 by RobOz"}]}