{"url":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/","title":"Wording on Theoden (Spirit)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702585","commentId":1702585,"userName":"Flrbb","timestamp":1437728397,"content":"First of all, I am not an native english speaker. Anyhow, I wonder wether the text on Theoden (Spirit) is chosen wisely!\n\nThe card reads: \"Lower the cost of the first Rohan ally you play from your hand each round by 1.\"\n\nFrom games logic itself I'd interprete this as something like \"each round a rohan ally costs one less\". But to be honest from the wording itself it sounds to me like \"the first rohan (each game) which will be played gets its costs reduced by 1 for each round (that allready passed by)\". The latter would be imho stupid game mechanics, hard to track and also not much a value. So I really think it must be my first interpetation. No questions here.\n\nIs here any native speaker which can me enlighten on grammar and word order?!? This bugs my mind. My (miss-)understanding is basically because of the position of the phrase \"each round\" in that sentence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702596","commentId":1702596,"userName":"alogos","timestamp":1437729805,"content":"The first rohan ally you play from your hand * pause * each round, is reduced by 1.\n\nThe each round refere to \"the first rohan ally you play from your hand\", so each round, there is a new \"first\".\n\nWithout \"first\", you second interpretation could have been good, but \"each\" is different than \"for each\", \"each\" is a new occurence every time and not cumulative.\n\nI'm not native english either, but that's how I see it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702601","commentId":1702601,"userName":"DukeWellington","timestamp":1437730352,"content":"In order to communicate the second interpretation an English speaker would naturally use a prepositional phrase, as in, \"lower the first rohan you play by 1 for each round\". The \"for\" indicates the meaning you read into it. Without the \"for\" a native speaker understands that it is the first interpretation. The word order is also somewhat important, but secondary. If I said, \"lower the cost of the first rohan for each round by 1\" the order would be awkward or poetic, but the second meaning would still come across."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702647","commentId":1702647,"userName":"jnicol","timestamp":1437736522,"content":"\"Lower the cost of the first Rohan ally you play from your hand each round by 1\"\n\n \n\nAs a native English speaker I interpret this to mean that the cost of 1 ally is reduced by 1, for a duration of 1 round.\n\n \n\nBy swapping \"by 1\" and \"each round\" I can change the card text to match your interpretation that the first rohan ally played in the game has its cost reduced by 1 every round:\n\n \n\n\"Lower the cost of the first Rohan ally you play from your hand by 1 each round\"\n\n \n\nIt's a subtle change, but totally alters the meaning of the text.\n\n \n\nAnother way to explain your incorrect interpretation without changing the word order is by inserting a comma:\n\n \n\nCorrect: \"Lower the cost of the first Rohan ally you play from your hand each round, by 1\"\n\n \n\nIncorrect: \"Lower the cost of the first Rohan ally you play from your hand, each round by 1\"\n\n \n\nI can totally see how you might find the card's wording confusing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702696","commentId":1702696,"userName":"Flrbb","timestamp":1437740697,"content":"That comma \", by 1\" looks stupid, but even for me it clarifies things. But I guess that (even in a normally writen sentence) there does not belong one in, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183162-wording-on-theoden-spirit/?do=findComment&comment=1702713","commentId":1702713,"userName":"jnicol","timestamp":1437741800,"content":"Yeah, the text as it is written on the card is gramatically correct and does not require a comma.\n\nThe commas were just to demonstrate how the text's meaning changes when the components of the sentence are grouped differently."}]}