{"url":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/","title":"Travel Phase Suggestions for Caleb and Matt","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704254","commentId":1704254,"userName":"MikeTangoGolf","timestamp":1437873111,"content":"The LotR LCG would benefit from from more depth and available options during the travel phase. In particular, it would great to have travel phase options to prevent location lock and sneak past enemies. To that end, I suggest the following rough card concepts:\n\n \n\nOutrider Steed\n\nType: Attachment\n\nTrait: Mount\n\nAttach to a character. Restricted.\n\nTravel Action: Exhaust Outrider Steed and attached character to add X progress tokens to a location in staging area, where X equals attached character's [Willpower]. Trigger any printed travel effects on target location.\n\n(Concept: mount allows a character to ride out separately from the main questing party to explore distant locations. Would be very useful to prevent location lock, but does not negate any harmful travel effects.)\n\n \n\nRohirrim Scout\n\nType: Ally\n\nTraits: Rohan, Scout\n\nTravel Action: Exhaust Rohirrim Scout to add X progress tokens to a location in staging area, where X is Rohirrim Scout's [Willpower]. Trigger any travel effects on target location.\n\n(Concept: a versatile ally that can be used to quest, fight, or scout distant locations).\n\n \n\nElven Cloak\n\nType: Attachment\n\nTrait: Item\n\nAttach to a hero.\n\nTravel Action: Exhaust attached hero to place X progress tokens on a non-unique enemy in the staging area, where X is attached hero's [Willpower]. Then, if your threat is 20 or less and the number of progress tokens on the targeted enemy equals or exceeds its [threat], discard the enemy.\n\n(Concept: This would provide secrecy decks with an option for completely evading non-unique enemies, rather than just letting them pile up in the staging area.)\n\nEdited July 26, 2015 by Titanium"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704352","commentId":1704352,"userName":"GrandSpleen","timestamp":1437882966,"content":"I like the thrust of this, but at present you've got some Travel Actions that really would be acceptable during any other phase without changing your decision-making process.  How can we make something that figures uniquely into the Travel phase itself?\n \n\nWell, the only thing you really need to do in the travel phase is decide which, if any, location to travel to.  So the only thing you can play with is that decision itself.  With that in mind, you could have a card like this:\n \n\nExpert Scout\n\nLore, Attachment, Cost 2\n\nCondition.\n\nAttach to a Scout hero.\n\nResponse: After traveling to a location, if that location's printed Quest Points are equal to or higher than the printed Quest Points of any other location in play, place two progress on the traveled to location.\n\n \n\nThis would influence the decision-making process during the travel phase (get a benefit by traveling to he highest-quest-point location).\n\n \n\nThe travel phase also has this going for it: it happens immediately after quest resolution, and before you engage enemies.  Many times when you clear a quest stage, you get an effect that tosses enemies into play.  Now those enemies are either engaged with you or in the staging area.  So we could do something like this:\n\n \n\nMisdirection\n\nLore, Event, Cost 2\n\nResponse: After traveling to a location, choose an enemy in the staging area.  Attach that enemy as a face down attachment to another location in the staging area.  The chosen location gets +1 threat for each face down card attached to it.  When that location becomes the active location or is discarded, return any face down cards attached to it to the staging area, face up.\n\n \n\n(you've thrown the enemy off your tracks)  That one would need some polishing before it could be a real card, but you get the idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704355","commentId":1704355,"userName":"GrandSpleen","timestamp":1437883538,"content":"Or here's another, as a hero.  \n\n \n\n<unnamed hero>\n\nLore\n\n10 threat cost\n\n2 willpower\n\n2 attack\n\n2 defense\n\n4 HP\n\nDunedain.  Ranger.\n\nTravel Action: If there is no active location, discard one card to give <this hero> +1 attack and +1 defense until the end of the round.\n\n \n\n(dedicated Ranger whose combat skill is increased by determination when 'on track' for the quest)\n\nNote that you have to travel (or not travel) before you are allowed to take actions in the Travel Phase.\n\nEdited July 26, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704624","commentId":1704624,"userName":"MikeTangoGolf","timestamp":1437922911,"content":"Nice card concepts!\n\n \n\n> I like the thrust of this, but at present you've got some Travel Actions that really would be acceptable during any other phase without changing your decision-making process.  How can we make something that figures uniquely into the Travel phase itself?\n\n \n\nThe reason I used Travel Actions in these cards, rather than generic Actions, is the timing of the Travel Phase.  As you noted, any characters that will undertake travel actions must abstain from questing, and they won't be available for combat.  This incorporates both a need for planning AND an element of uncertainty.  Generic actions could be withheld until after combat, and would be much less interesting, simply a way to get some use out of previously unexhausted characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704702","commentId":1704702,"userName":"OMZA","timestamp":1437929712,"content":"Another, different option in order to have a rich and deep travel phase could be to introduce some sort of \"travel deck\" made of tracheries that can have an impact on the game, both favorable or detrimental for the players, as it was proposed in the article here:\n\nhttp://susurrosdelbosqueviejo.blogspot.com.es/2015/03/entre-la-aventura-y-el-orden-azar-y.html [http://susurrosdelbosqueviejo.blogspot.com.es/2015/03/entre-la-aventura-y-el-orden-azar-y.html]\n\nBtw, nice ideas in the player cards mentioned before in the topic!\n\nEdited July 26, 2015 by OMZA"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704857","commentId":1704857,"userName":"DukeWellington","timestamp":1437941423,"content":"I have always thought that there needs to be an ability to travel twice if the first location is cleared. Right now any effect that adds progress to the active location after you travel there is basically useless, but if you can travel twice, then maybe those kind of effects could have a place, especially preventing location lock in multiplayer games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704951","commentId":1704951,"userName":"soullos","timestamp":1437948928,"content":"hmm how about something more generic like a neutral event that allows you to, as a travel action, choose 2 locations to travel to instead of one till the end of the phase? Call it \"Divide and Conquer\" or something like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1704961","commentId":1704961,"userName":"GrandSpleen","timestamp":1437949544,"content":"You could make that an attachment and attach it to a hero.  With an effect like \"while <this card> is in play, players may select two locations to travel during the travel phase, and there may be two active locations.  Forced: after the active location is explored, discard this card from play.\"\n\n \n\n> Right now any effect that adds progress to the active location after you travel there is basically useless\n\n \n\nI agree that the existing options are weak, but I do use Asfaloth on the active location, and not infrequently.  Usually translates directly into more progress on the quest card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1705071","commentId":1705071,"userName":"Seastan","timestamp":1437960053,"content":"I like the idea of building upon a travel-archetype deck that Idraen has started. I think one of the easiest ways to make travel phases more interesting is to create more ways to get multiple active locations. There are many locations that do something special when they are active, and it would be fun to allow players to decide how to combo them together. So building upon some of the other ideas in this thread: \n\n \n\n<Hero>\n\nLore\n\nDunedain. Ranger. Scout.\n\n10 Cost\n\n3 Will\n\n2 Atk\n\n1 Def\n\n4 HP\n\nTravel Action: If there is only 1 active location, exhaust <Hero> to travel to a location in the staging area. (There are now 2 active locations.)\n\n \n\nThe idea here would to combo him with Wingfoot to make use of his willpower. He would also combo well with Idaen and Strength of Will, an underused card. The problem with SoW currently is (as pointed out above) that generally progress is not useful on a location just after travelling.\n\n \n\nNow to combat location lock in multiplayer games:\n\n \n\nScour the Hills\n\nLore, Event, Cost 4\n\nLower the cost to play Scour the Hills by 1 for each Scout hero you control.\n\nTravel Action: If there are less than X active locations, exhaust a character to travel to a location in the staging area. Each player may trigger this effect. X is the number of players in the game.\n\n \n\nIf you look at the list of scout allies they are all over the place. This is an attempt to tie them together:\n\n \n\nA Need of Knowledge \n\nLore, Attachment, Cost 2, Unique\n\nAttach to a Scout Hero. Planning Action: Exhaust A Need of Knowledge to reduce the cost of the next Scout ally you play this phase by 1 for each active location (to a minimum of 0).\n\n \n\nPerceive the Darkness\n\nSpirit, Attachment, Cost 2, Unique\n\nAttach to a Scout Hero. If there is more than 1 active location, Scout characters gain +1 Willpower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1705084","commentId":1705084,"userName":"Ecthelion III","timestamp":1437961426,"content":"> I like the idea of building upon a travel-archetype deck that Idraen has started. I think one of the easiest ways to make travel phases more interesting is to create more ways to get multiple active locations. There are many locations that do something special when they are active, and it would be fun to allow players to decide how to combo them together. So building upon some of the other ideas in this thread: \n> \n>  \n> \n> <Hero>\n> \n> Lore\n> \n> Dunedain. Ranger. Scout.\n> \n> 10 Cost\n> \n> 3 Will\n> \n> 2 Atk\n> \n> 1 Def\n> \n> 4 HP\n> \n> Travel Action: If there is only 1 active location, exhaust <Hero> to travel to a location in the staging area. (There are now 2 active locations.)\n> \n>  \n> \n> The idea here would to combo him with Wingfoot to make use of his willpower. He would also combo well with Idaen and Strength of Will, an underused card. The problem with SoW currently is (as pointed out above) that generally progress is not useful on a location just after travelling.\n> \n>  \n> \n> Now to combat location lock in multiplayer games:\n> \n>  \n> \n> Scour the Hills\n> \n> Lore, Event, Cost 4\n> \n> Lower the cost to play Scour the Hills by 1 for each Scout hero you control.\n> \n> Travel Action: If there are less than X active locations, exhaust a character to travel to a location in the staging area. Each player may trigger this effect. X is the number of players in the game.\n> \n>  \n> \n> If you look at the list of scout allies they are all over the place. This is an attempt to tie them together:\n> \n>  \n> \n> A Need of Knowledge \n> \n> Lore, Attachment, Cost 2, Unique\n> \n> Attach to a Scout Hero. Planning Action: Exhaust A Need of Knowledge to reduce the cost of the next Scout ally you play this phase by 1 for each active location (to a minimum of 0).\n> \n>  \n> \n> Perceive the Darkness\n> \n> Spirit, Attachment, Cost 2, Unique\n> \n> Attach to a Scout Hero. If there is more than 1 active location, Scout characters gain +1 Willpower.\n\nA Need of Knowledge should be only cost 1. There are forms of cost reduction (O Lorien, etc.) that cost less and are far less situational."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1705089","commentId":1705089,"userName":"GrandSpleen","timestamp":1437962194,"content":"Agreed, it's more like Heir of Valandil... easier to get a consistent discount, but limited to a discount of 2.\n\n \n\n \n\n...but then again Heir of Valandil costs 2 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 27, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183281-travel-phase-suggestions-for-caleb-and-matt/?do=findComment&comment=1705404","commentId":1705404,"userName":"Seastan","timestamp":1438003550,"content":"Heir of Valandil is what I had in mind with the card, hence the cost of two. But I also had in mind a 3-4 player game with the Scour the Hills card I posted, where the discount could be 3 or 4.\n\n \n\nAnd with the hero I posted it would be pretty easy to get a consistent 2 discount. I think that is too good to just cost 1."}]}