{"url":"https://community.fantasyflightgames.com/topic/183213-deck-question-going-forward-from-core/","title":"Deck question going forward from core.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183213-deck-question-going-forward-from-core/?do=findComment&comment=1703486","commentId":1703486,"userName":"Dsbessie","timestamp":1437794246,"content":"My son and I have been playing steadily for a couple weeks and really loving it. We have been using the decks from Beorns path from Beorns website. My son uses leadership/lore and I use the spirit/ tactics. My question is do you recommend this going forth we him adding new leadership lore and I the spirit tactic cards from expansions to make sure we cover all cards or is there a better strategy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183213-deck-question-going-forward-from-core/?do=findComment&comment=1703782","commentId":1703782,"userName":"JohnGarrison1870","timestamp":1437836623,"content":"Beorn's path is an excellent series and a great way to get comfortable with the game. If you're enjoying the process, then getting the expansions in order and continuing with Beorn would be great.\n\n \n\nBut if you've played a dozen or more times and are getting pretty familiar with how the game works, you might consider getting into the Saga expansions instead. These tend to be really packed with nice cards, great adventures, and lots of fun. They also contain recommended deck lists that can be built with just cards in the core set and the Saga box itself.\n\n \n\nAnother option is to get deluxe expansions and adventure packs out of order, based on the types of player cards you'd like to add and/or the adventures they hold. Check out the great New Player Buying guide from the Tales from the Cards blog: https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\n \n\nOr you could do a combination. Like try a saga box, and get the Hunt for Gollum to keep following Beorn's path, and maybe grab something else too like Kazad-Dum (if you have the budget).\n\n \n\nWhichever way you go, glad to have you aboard and enjoy!\n\nEdited July 25, 2015 by JohnGarrison1870"}]}