{"url":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/","title":"Quest story arcs throughout cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1705305","commentId":1705305,"userName":"Ghost Dancer","timestamp":1437994791,"content":"Just got my first two adventure packs (Carrock & Dead Marshes) - difficult to get hold of these early ones (in the UK at least) without paying stupid amounts for them.\n\n \n\nDo the stories in each quest continue between packs? i.e. form a larger story arc? I'm just wondering if I should wait until I can find the Hunt for Gollum before I start the Conflict at Carrock quest?\n\n \n\nI mainly bought the packs for the player cards - primarily the songs and a few others, but I'm now liking the idea of being able to make an eagle deck or a half decent Rohan deck. As a result I'm now planning on buying the rest of the cycle, hence my question - will I really lose any of the story if I do the out of sequence?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1705332","commentId":1705332,"userName":"PocketWraith","timestamp":1437997985,"content":"In theory each adventure pack is a continuation of the story from the previous one, yes. But in practice, a lot of them are just \"After you did that thing in the last quest, now you came here to do this thing in this quest.\" In the case you bring up that's basically it - you were hunting for Gollum, but then you decided to stop around the Carrock and help with this troll problem they're having.\n\nThe story focus becomes more once you reach the Against the Shadow and Ring-Maker cycles (and presumably Angmar Awakened as well, but of course we're only one pack into that one so far), so you might be more bothered about buying in order at that point.\n\nAlso, if you're really interested in reading the story bits, you can find all the rulesheets online [https://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/] and if you really want to fit in the little snippets from the quest cards as well, then obviously Hall of Beorn has them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1705339","commentId":1705339,"userName":"Ghost Dancer","timestamp":1437998435,"content":"OK cool, sounds like I won't really be missing out then, thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1706257","commentId":1706257,"userName":"PsychoRocka","timestamp":1438049383,"content":"I've been thinking of compiling the whole \"story\" so far into one big wall of text just to see what it is like. Would be pretty interesting! The first few cycles will of course be very vague and short but it will really get going around the start of Against the Shadow. Would anyone else have any interest in seeing the entire \"narrative\" start to finish as one piece of text or would this be a complete waste of time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1706301","commentId":1706301,"userName":"Ecthelion III","timestamp":1438052632,"content":"> I've been thinking of compiling the whole \"story\" so far into one big wall of text just to see what it is like. Would be pretty interesting! The first few cycles will of course be very vague and short but it will really get going around the start of Against the Shadow. Would anyone else have any interest in seeing the entire \"narrative\" start to finish as one piece of text or would this be a complete waste of time?\n\nI would love this. Great idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1707068","commentId":1707068,"userName":"alexbobspoons","timestamp":1438104319,"content":"Although this may come across as advertising, which it kinda isnt as I have no affiliation to these places, but my main areas of getting LOTR cards in the uk are either: (all googleable)\n\nchaoscards\n\nGameslore\n\nIGUK\n\nAmazon uk\n\n \n\nA few of which do seem to have MIrkwood cycle packs in stock at the moment, though no Hunt For Gollum just yet.\n\nGameslore do seem to be the one who restock more often and if you email them they can get some stock in from their suppliers sometimes if the distributor still has some in-hand. Also chaoscards is often cheapest with their free postage above £20, though if buying a lot, Gameslores discounts kick in.\n\n \n\nSo there are good places to buy in uk and stocks do seem to refill ok.\n\n \n\nHope that helps\n\n \n\nEDIT: Just checked FFG's \"upcoming\" products page and the whole Mirkwood cycle is currently \"at the printers\" for a reprint, so thats good for collecting when they filter through, at least you know more copies are on the way (pretty cool they are reprinting the very first cycle too as thats commitment to keeping the game going).\n\nSo dont pay over the odds :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 28, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1707851","commentId":1707851,"userName":"Ghost Dancer","timestamp":1438150349,"content":"Cheers. Chaos Cards has long been my preferred online retailer of choice (although I do frequently buy from my FLGS too). I'm slowly building up my Shadows of Mirkwood expansions (3 so far) as and when I see them for decent prices.\n\n \n\nI was chatting to the guy at Chaos (friendly chap) and there is no more stock at the distributors ATM, so will have to wait for reprint to get Gollum I think (I refuse to pay over the odds for it).\n\n \n\nWIll check out Gameslore though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183349-quest-story-arcs-throughout-cycle/?do=findComment&comment=1708592","commentId":1708592,"userName":"Ghost Dancer","timestamp":1438193929,"content":"Although we are veering off-topic a bit (but hey, its my thread so that's OK), just wanted to share this.\n\n \n\nI just ordered Hunt for Gollum and Return to Mirkwood from the States (Miniatures Market) - its pretty crazy that even though the postage is almost as much as the packs, its still cheaper than the 2 packs I bought recently in my own country! (which were the cheapest I could find) Couldn't add anything else to the order without risking customs charges though, but got the main ones :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nOn the downside, I have gone over my monthly budget (oops) but thought it best to grab them whilst they are available. "}]}