{"url":"https://community.fantasyflightgames.com/topic/183397-hunt-for-gollum-questions/","title":"Hunt for Gollum Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183397-hunt-for-gollum-questions/?do=findComment&comment=1706148","commentId":1706148,"userName":"Dsbessie","timestamp":1438037717,"content":"My son just got this expansion and we have a few questions.\n\n \n\n1. I assume when the hunters card says +2 for all clue cards in play thats any clue cards in the staging area, defended, undefended, or already claimed by a hero?\n\n \n\n2. When you draw a clue card and then another card to defend it and its a treachery is it just unguarded then?\n\n \n\n3. So any damage at all to the hero with the clue card returns the clue to the encounter deck?\n\n \n\n4. Finally, in stage 3b if I have a clue I can commit to the quest, but my son cannot. Can he still gain a clue on that stage and then start committing to the quest or do you need it when the stage starts? Also does this also mean that if I am the only one with a clue and take damage which removes my clue that we would be forced back to stage 2b?\n\n \n\nThanks for any help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183397-hunt-for-gollum-questions/?do=findComment&comment=1706160","commentId":1706160,"userName":"Chris51261","timestamp":1438038538,"content":"1. Yes, just any clue card that is on the board currently. \n\n2. The treachery resolves, and then the clue is free of encounters (unguarded). \n\n3. Right, so ideally you'd want to attach them to a hero who isn't involved in combat often. Also note you can place all of the clues on one hero or spread them out as you see fit. \n\n4. Yes, he can gain one while you are on stage 3B and then could commit characters to the quest. If you only controlled one clue and lost it, you have to reset the quest deck to 2B. \n\n \n\nHope that helps, enjoy the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183397-hunt-for-gollum-questions/?do=findComment&comment=1706189","commentId":1706189,"userName":"Dsbessie","timestamp":1438041558,"content":"Thank you for the fast reply. We are enjoying it very much, even the horrible loses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183397-hunt-for-gollum-questions/?do=findComment&comment=1707055","commentId":1707055,"userName":"alexbobspoons","timestamp":1438103839,"content":"Its a great quest for working out your tactics on how to handle the clues and the Mordor Agents. The card draw on this can really change it too.\n\n \n\nI myself found this a really fun quest.\n\nHave fun"}]}