{"url":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/","title":"Mount Gram spoilers are up on CardGameDB!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705733","commentId":1705733,"userName":"Raven1015","timestamp":1438019159,"content":"Just as the topic says, the cards from Escape from Mount Gram are up!\n\n \n\nhttp://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/angmar-awakened-cycle/escape-from-mount-gram/ [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/angmar-awakened-cycle/escape-from-mount-gram/]\n\n \n\nHere's our new hero:\n\n \n\nffg_MEC40_28.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC40_28.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705749","commentId":1705749,"userName":"Gizlivadi","timestamp":1438019575,"content":"I'm glad to see the new hero works with the victory display. With Leave No Trace and all the other goodies she might be quite good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705759","commentId":1705759,"userName":"Qaanaaq","timestamp":1438020065,"content":"Amazing cards. Beatiful art on the hero. All the cards seem like situational yet very powerful. Game creators, really good job!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705760","commentId":1705760,"userName":"Nickpes","timestamp":1438020250,"content":"I really like the ent cards and the spirit quest card.\n\nI am not familiar with locations and enemies in victory display, but it seems to make the silvan hero very strong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705777","commentId":1705777,"userName":"Gizlivadi","timestamp":1438020613,"content":"I like that the hero is low threat, maybe she could work in a secrecy deck with Glorfindel and Pippin that uses Out of the Wild plus all the other victory display things. You can even use Distant Stars to boost her willpower. I think that with all the new things plus many of the old ones you could really build a good deck.\n\n \n\nThe ent cards are great. Do they even need more support at this point? We'll probably get a couple more cards for them (the healing ent and maybe another unique ally) but I hope there's not too much. Other traits need more support IMO.\n\n \n\nI like the two leadership cards. Glad to see that we now have the Veteran so the Gondor deck is even more of a thing. Descendants of Kings seems powerful, but I don't know how it will work in practice. I hope we get more Dunedain support and especially allies this cycle.\n\nEdited July 27, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705786","commentId":1705786,"userName":"Noccus","timestamp":1438020881,"content":"Love the ent cards. So good.\n\nWe might see a tactics ent hero this cycle. Maybe.\n\nThe spirit side quest is very plain.\n\nIt's good, yes, but just very straight forward imo.\n\nI have to make up my mind on the new hero after I've tried her though.\n\nI do like the idea, but I not too sure on how stable her abilily will be.\n\nSeems like it can be useful in some quests, but there is only 1 way to find out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705794","commentId":1705794,"userName":"John Constantine","timestamp":1438021259,"content":"I have mixed feeling about this pack. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705801","commentId":1705801,"userName":"Bullroarer Took","timestamp":1438021902,"content":"Flavor Fail?  Wasn't it the Noldor who were supposed to manipulate the victory display?  If so, why is Tauriel Rossiel sylvan?\n\n \n\nSome good cards though and I like Rossiel otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705831","commentId":1705831,"userName":"Nickpes","timestamp":1438023776,"content":"> The ent cards are great. Do they even need more support at this point? We'll probably get a couple more cards for them (the healing ent and maybe another unique ally) but I hope there's not too much. Other traits need more support IMO.\n\n \n\nYou mean Wellinghall Custodian right?\n\n \n\nIndeed they are already too strong, there are other traits that need more support ... Noldor allies to start with  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705835","commentId":1705835,"userName":"Fingolfin Fate","timestamp":1438023866,"content":"No, Noldor have the Erestor discard thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705838","commentId":1705838,"userName":"Fingolfin Fate","timestamp":1438023974,"content":"I love the Ents but I wouldn't say they are too strong. Have you guys had full Ent-on power decks built? Or will you now? I like how the Tactics event can help hero Treebeard. And yes, we need a Tactics hero Ent but I do not think so. The next one will be Dori, most likely and then there will be no more Tactics heroes this cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705846","commentId":1705846,"userName":"Nickpes","timestamp":1438024422,"content":"I played the Road to Isengard with a full Ent deck, it was quite good and seemed strong. Won on first attempt I think\n\n \n\nAlso tried the old forest and again it was doing well, though I lost cause I made some bad choises "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705863","commentId":1705863,"userName":"Bullroarer Took","timestamp":1438025334,"content":"Have we seen an effect like Leave No Trace for enemies to help enable Rossiel?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705912","commentId":1705912,"userName":"bubblepopmei","timestamp":1438027220,"content":"Caldara thanks you for the Elven Jeweler."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705915","commentId":1705915,"userName":"Noccus","timestamp":1438027261,"content":"> Have we seen an effect like Leave No Trace for enemies to help enable Rossiel?\n\n \n\nout of the wild & scout ahead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705916","commentId":1705916,"userName":"Bullroarer Took","timestamp":1438027298,"content":"Distant Stars just nuked Gladden Marshlands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705943","commentId":1705943,"userName":"Noccus","timestamp":1438028193,"content":"> Distant Stars just nuked Gladden Marshlands.\n\n \n\nOh yes, this card will be very strong vs the right NM decks; especially in combination with Thror's map, to counter those nasty travel effects.\n\n \n\nI was thinking on using it against aJtR: discard a location to fish out forest grove.\n\nThen when it's explored you can use leave no trace and boost Rossiel :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 27, 2015 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705950","commentId":1705950,"userName":"Teamjimby","timestamp":1438028425,"content":"I'm excited about these cards.  I was already interested in a victory display deck, but now Rossiel makes that more interesting.  I'm just glad she has relatively low threat. \n\n \n\nThe rest of the cards seem well balanced.  I think all of them could be strong in certain situations.  Ents get a big boost.  I wonder what the best hero combination would be for ents.  I had been using Treebeard, Elrond, and Mirlonde, but now there is a lot more tactics.  Now I might go Hobbit-y with Merry, Pippin, and probably Elrond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1705982","commentId":1705982,"userName":"Olorin93","timestamp":1438029677,"content":"I love this pack. Rossiel is going to become a favourite for sure - I need a solid quester/defender in my support deck. Deciding between hers and Erestor's mechanic will be difficult if I don't want to scrap cornerstones like Elrond. Great cards overall, really looking forward to this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706123","commentId":1706123,"userName":"Pharmboys2013","timestamp":1438035426,"content":"I think by the time this cycle is finished Rossiel is going to be considered a very strong hero.  Her proficiency is obviously tied to how much you're utilizing the victory display mechanic, but you've got to think beside leave no trace and out of the wild we will at least get another event that puts an enemy in the display after defeating it and probably another card or two that further complement the archetype like keen as lances.\n\n \n\nI'm pleasantly surprised they went in this direction for a hero as well, when we the victory display mechanic was originally revealed in the preview articles I was kind of underwhelmed.  It seemed fairly meticulous for only marginal and circumstantial benefits.  Having a hero who can have a 4 statline in WP or DEF now based of that is huge, especially for lore.  That low threat cost is just icing on the cake especially considering they didnt give her any threat cost penalty for what her stats have the potential to be.  Only weakness for her is that it can just take some time and some good draws for her to really hit her stride and as we all know this game is oftentimes decided within the 1st few turns.  Another weakness is that the bonus is trait specific but on paper I dont think that will be a big deal. I feel there is generally an average of 2 or 3 trait types among enemies or locations in a quest.\n\n \n\nExcited to give her a go, will probably pick up at GenCon this week.  Hopefully can play it with some of you there :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706130","commentId":1706130,"userName":"Gizlivadi","timestamp":1438036184,"content":">  we will at least get another event that puts an enemy in the display after defeating it \n> \n>  \n> \n>  \n\n \n\nCitation needed?\n\n \n\nAnywho, I agree, and we can expect at least 2 more Lore victory display events, one is The Door is Closed which will be in pack #4 and the other will be in Across the Ettemoors since Matt gave it as one of the options to be spoiled. I hope you are right and that it will be an enemy version of Leave No Trace. That would round up the strategy pretty nicely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706143","commentId":1706143,"userName":"tricil","timestamp":1438037547,"content":"I guess the option Matt mentioned is \"None Return\" from the preview article and it indeed looks like (edit: is) an enemy version of Leave No Trace:\n\n \n\nmec41-none-return.png [https://images-cdn.fantasyflightgames.com/filer_public/43/b0/43b0f793-4477-40fe-9076-034edc0dfa03/mec41-none-return.png]\n\nEdited July 30, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706145","commentId":1706145,"userName":"Gizlivadi","timestamp":1438037674,"content":"Judging by that name and art I think we can be pretty sure of it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706175","commentId":1706175,"userName":"joezim007","timestamp":1438039847,"content":"Assuming they continue with the victory display mechanics, I don't think there is a single dud in this pack.\n\n \n\nI love how the Treebeard hero can use his ability with Boomed and trumpeted to ready himself and give himself obscene amounts of attack!\n\n \n\nI think the least interesting cards are Distant Stars and Elven Jeweler. DS is cool but exhausting the Ranger/Scout character could be a steep cost depending on the situation, and you may have to wait a while for the optimal location setup, assuming there is one with that quest. There's nothing wrong with Elven Jeweler, but once you get her into play she offers relatively minor contributions with her numbers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706176","commentId":1706176,"userName":"jjenks476","timestamp":1438039847,"content":"Tactagorn + Straight shot can destroy that Ruthless Hill Troll easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706180","commentId":1706180,"userName":"PsychoRocka","timestamp":1438040540,"content":"Ah yes of course, not sure how someone didn't clue into that earlier! Good job guys. \n\nFor a 1 cost I imagine it does exactly the same thing as leave no trace but is instead \"after an non-unique enemy is destroyed\" instead of \"after a non-unique location is explored\". This makes Keen as Lances far more useful and Rossiel as well.\n\nReally cool hero design and potential to be very powerful in the right deck. Just take note of what enemies and locations you add to the victory display (make sure you remove ones that have the same trait as many other encounter cards in the current quest) and she could quite regularly have both her willpower and defense boost in the same turn. Low starting threat and a nice trait (wish it was noldor though) are also bonuses. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706196","commentId":1706196,"userName":"PsychoRocka","timestamp":1438042488,"content":"I think this pack is WAY WAY better than Wastes of Eriador player card wise. Only Elven Jeweller is a bit of a dud and even then she is potentially very good in an Erestor deck. The victory display cards we now know tie into this newly spoiled hero and we have (more or less) figured out that none return is also part of this mechanic so it is actually potentially quite strong now. \n\nDistant Stars whilst not overly exciting will be as some have said totally awesome in certain nightmare scenarios.\n\nDescendants of Kings seems like it could potentially be amazing. Defend attacks with all your dunedain characters then before the enemy killing begins ready each one you defended with!!! You could also quest with them all then when enemies engage you (during staging or during combat) you can ready them via this ready to defend/attack. I think in Dunedain engagement decks this card will very quickly be an auto include. Can allow you to utilize the attack and defense of allies like Northern Tracker and Warden of Annuminas who are normally used primarily to quest as well!\n\nThe two ent tactics cards are just bonkers.... bonkers I say. That defender is probably one of the best defensive allies we have now. Yes he is exhausted first turn but has sentinel, 3 hitpoints and 2 defense or 5 if you take a point of damage. Wellinghall Custodian can then heal this point of damage but not before it is used to activate Boomed and Trumpeted! This ally also boosts Booming Ent's attack! Ents are just getting awesome and I think now can be quite **** powerful. Fantastic willpower, defensive and offensive output just the slow start which a hero like Leadership Faramir can somewhat mitigate. \n\nBoomed and Trumpeted on its own is insane, 1 cost for a readying effect and +3 attack???? Yes the ent has to take damage first but hey what fairly new scenario doesnt have some archery or weather damage you can just plop on an ent to trigger this effect? Ents are a force to be reckoned with now!\n\nThe veteran of Osgiliath has already been discussed to death as it was spoiled so long ago but is also a fantastic new card and breathes new life into Gondor decks. \n\nFinally the spirit side quest? Simple as hell but AMAZING! 5 threat reduction for every player? Yes please!! This is going straight in my decks tonight!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706205","commentId":1706205,"userName":"Chris51261","timestamp":1438042969,"content":"Elven jeweler arrived just in time to help me with Nightmare Voice of Isengard! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706235","commentId":1706235,"userName":"PsychoRocka","timestamp":1438046379,"content":"Now where is the news article so I can proxy the spirit side quest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706251","commentId":1706251,"userName":"Ranger of the Force","timestamp":1438048388,"content":"So who would we pair Rossiel with? One round she could be a quester, another a defender, sometimes is the cards fall right, both with readying. I don't see her fitting into more than a supplemental role given her abilities are not constant and there might be rounds where none of them trigger, so how could we round this out?\n\nEdited July 28, 2015 by Ranger of the Force"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706252","commentId":1706252,"userName":"Teamjimby","timestamp":1438048654,"content":"> So who would we pair Rossiel with? One round she could be a quester, another a defender, sometimes is the cards fall right, both with readying. I don't see her fitting into more than a supplemental role given her abilities are not constant and there might be rounds where none of them trigger, so how could we round this out?\n\nAssuming you want to take advantage of out of the wild, you'll probably want to pair her with Merry or Glorfindel.  I'd probably go lore for the 3rd hero.  Either Pippin, Mirlonde, or Bifur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706253","commentId":1706253,"userName":"soullos","timestamp":1438048775,"content":"With Curious Brandybuck and now Elven Jeweler we have two spirit allies with alternate methods to put them into play (and it's usable out of sphere more reliably than Emery). Is this a new trend for Spirit?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706255","commentId":1706255,"userName":"Edvando","timestamp":1438049281,"content":"I think 8 make her very hard to secrecy with. If you start with Glor+Hobbit you have 8+6+5=19 threat. If you quest with Glor, you already out of secrecy. If you go two hobbits, you have 20 threat first round.\n\n \n\nSo, you probable have to go spirit merry if you are really serious about keeping your secrecy alive. Out of the wild is almost useless if you are out of secrecy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706265","commentId":1706265,"userName":"GrandSpleen","timestamp":1438049753,"content":"Well Mirlonde, Rossiel, Pippin is 8+8+6 -3 for 19 threat in mono-lore, so there's another option if you're trying to pull off Secrecy. But without Spirit you'll have a hard time.  In many quests you only have 1 enemy trait to worry about, so one Out of the Wild would set up Rossiel as a great defender for the whole game.  Look for it in your opening hand and you don't even need to stay in Secrecy.\n\n \n\nWith this setup you've got 2 silvans who can take advantage of Silvan Tracker. Pair it with a Celeborn deck to round out the Silvan part of the equation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706279","commentId":1706279,"userName":"PsychoRocka","timestamp":1438050611,"content":"Distant Stars only requires a character not a hero! Definitely makes it a lot stronger especially for 0 cost. \n\n \n\nAnother good lineup for the new hero could be Galadriel, Glorfindel, Rossiel. Play one Elronds Counsel and Galadriel's ability can then keep you in secrecy at 19 threat (barring doomed etc). Glorfindel quests and Rossiel defends (and quests if possible via unexpected courage or whatever) and then Glorfindel plus allies attack. Mirror would help you fetch Out of the Wild or whatever card you need to set up (none return) Rossiel and then the extra card draw would help you to further manipulate the victory display/encounter deck via Scout Ahead, Leave no Trace etc. Would also keep Keen as Lances and The Door is closed very thematic in such a deck (Galadriel is on the art for both). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706289","commentId":1706289,"userName":"Bullroarer Took","timestamp":1438051442,"content":"Why is the jeweler... A jeweler? Not seeing the connection.\n\nSo glad that Spirit gets another ability in flash."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706401","commentId":1706401,"userName":"Ecthelion III","timestamp":1438061660,"content":"Well, now we know where the \"floating leaves\" art is..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706412","commentId":1706412,"userName":"pmdoug","timestamp":1438063224,"content":"Treebeard + Ent Draught + Boomed and Trumpeted = a ready hero that can battle-quest for 11\n\n \n\nI really want to do this for Peril in Pelargir. Treebeard just freaks out and destroys the Leaping Fish. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706475","commentId":1706475,"userName":"OMZA","timestamp":1438069771,"content":"I was hoping to see Círdan, Galdor or some other renown characters, but... Rossiel??\n\nShe could be named Arwen and also be appropriate in terms of theme, isn't it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706533","commentId":1706533,"userName":"Olorin93","timestamp":1438079491,"content":"I have been hoping for Cirdan as well, but he could be the unspoiled Spirit hero or he could show up in pretty much any cycle like Elrond and Glorfindel. I do find it hard to believe they wouldn't complete the set with all three Elven rings and their bearers.\n\nI'm curious about Elven Jeweler. if the discard mechanic is the equivalent of O Lorien and Heir of Valandil, I'm also hoping we'll see a universal Noldor stat boost soon. And some more recursion or something that lets us play cards from the discard pile. (Feels like I've asked this before, but has the latter been confirmed?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706594","commentId":1706594,"userName":"PsychoRocka","timestamp":1438084329,"content":"What if we got Narya and it could be attached to either Gandalf OR Cirdan giving a different effect depending on the user?\n\nAlso a nice ability for Gandalf (slightly overpowered though!) from Narya could be \"While Gandalf is committed to the quest other questing heroes get +1 willpower. While Gandalf is making an attack other heroes participating in this attack get +1 attack.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706626","commentId":1706626,"userName":"Mazarbul","timestamp":1438086996,"content":"> I'm curious about Elven Jeweler. if the discard mechanic is the equivalent of O Lorien and Heir of Valandil, I'm also hoping we'll see a universal Noldor stat boost soon. And some more recursion or something that lets us play cards from the discard pile. (Feels like I've asked this before, but has the latter been confirmed?)\n\nFrom the preview of The Battle of Carn Dûm: \"Spirit players gain a Noldor-themed card that plays only from the discard pile.\"\n\nBtw, Elven Jeweler is great in a Caldara deck. :-)\n\nEdited July 28, 2015 by Mazarbul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706751","commentId":1706751,"userName":"Olorin93","timestamp":1438092964,"content":"Thought so, thanks for finding it. And sorry, but why is the Jeweler good with Caldara?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706763","commentId":1706763,"userName":"GrandSpleen","timestamp":1438093203,"content":"She lets you discard cards, and Caldara needs to have the right cards in the discard pile to work properly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706813","commentId":1706813,"userName":"Thanatopsis","timestamp":1438095509,"content":"> She lets you discard cards, and Caldara needs to have the right cards in the discard pile to work properly.\n\n \n\nI takes a lot of luck, but the Jeweler enables a first turn Caldara sacrifice. It takes a lot of luck, but if the right allies are in your hand you can discard them to play the jeweler and discard Caldara to put them into play. Heck, you could then play Fortune and Fate the next round.\n\n \n\nI know, it takes the perfect draw, but this sort of on demand option has not been available until now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706868","commentId":1706868,"userName":"JTG81","timestamp":1438097215,"content":"I'm not so sure about the Victory Display mechanics. Here are my reservations: One-By thinning the encounter deck of Locations and Enemies you are more likely to hit Treacheries which are usually the worst cards. Two-It is going to take some time to start to benefit from the effects of Victory Display manipulation as you won't see your effects until after the first shuffle which at that point may be too late. Three-You will have to devote significant deck slots to these Victory Display cards in order to see them early and will be cutting cards that are more universally useful and can help you out right away. I'm not writing it off completely and am willing to play test it but I remain skeptical."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706887","commentId":1706887,"userName":"John Constantine","timestamp":1438097711,"content":"The main downside of this Victory Display stuff is that it will be probably unplayable in solo or with 2 players, but will be extremely good with 3-4 players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706951","commentId":1706951,"userName":"Gizlivadi","timestamp":1438099845,"content":"I sure as hell hope they make this playable in solo, or else... I'm gonna rant about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1706960","commentId":1706960,"userName":"Teamjimby","timestamp":1438100197,"content":"Yeah, I think the victory display stuff will work best in 3-4 player, because thinning the encounter deck becomes more useful when you go through it multiple times.  Also, in multiplayer you can have everyone run 3 copies of Keen As Lances and they will feed off of each other. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1707041","commentId":1707041,"userName":"Fingolfin Fate","timestamp":1438103480,"content":"Valid points. However, scrying is by far most effective solo, and I think the Victory display thing should benefit from scrying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1707069","commentId":1707069,"userName":"Teamjimby","timestamp":1438104329,"content":"Yeah, it might benefit from scrying, although I think scrying will be best for a trap deck.  That will be much more effective solo or 2 player than 3-4 player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1707160","commentId":1707160,"userName":"Ecthelion III","timestamp":1438108160,"content":"I can't believe I'm saying this, but... they need more cards like The End Comes that shuffle the discard pile into the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1707657","commentId":1707657,"userName":"PsychoRocka","timestamp":1438131629,"content":"Where is the release article so we can start ordering our copies......?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1710997","commentId":1710997,"userName":"Mazarbul","timestamp":1438333972,"content":"> Where is the release article so we can start ordering our copies......?\n\nThey just posted an article. :-)\n\nAnd confirming the text for the card None Return.\n\nmec41-none-return.png [https://images-cdn.fantasyflightgames.com/filer_public/43/b0/43b0f793-4477-40fe-9076-034edc0dfa03/mec41-none-return.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1715508","commentId":1715508,"userName":"Bullroarer Took","timestamp":1438483194,"content":"Okay, onto the quest. Spoilers ahead.\n\nI played my already sleeved up Spirifindel, Loragorn, Boromir deck and chose Boromir to be the escaped prisoner. I did get some pretty good draws, but it was pretty much a cakewalk for that deck with Boromir. I do think that it could be a tough quest, but Boromir is its cryptonite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1715580","commentId":1715580,"userName":"Rob_Oz","timestamp":1438486968,"content":"Played it with my hobbit deck and had little difficulty. I've enjoyed the scenario but I doubt Mount Gram will be fun for those people who are interested in maximum challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1715592","commentId":1715592,"userName":"Ecthelion III","timestamp":1438487635,"content":"How do you do it with Boromir? He can't quest worth a flying flip!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1715679","commentId":1715679,"userName":"Bullroarer Took","timestamp":1438492420,"content":"Again, maybe I got lucky with the draws, but Boromir is great at killing and I saw a few enemies early on that enabled me to bulk him up and to rescue a second hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716049","commentId":1716049,"userName":"Glaurung","timestamp":1438523960,"content":"Hey guys we play this game for long time. . We know how to build up a decks so all that new standard quest most of the time will be peace of cake for us… just need wait for Nmode….\n\nAnd that fact I dont like to be honest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716383","commentId":1716383,"userName":"pmdoug","timestamp":1438543054,"content":"> Hey guys we play this game for long time. . We know how to build up a decks so all that new standard quest most of the time will be peace of cake for us… just need wait for Nmode….\n> \n> And that fact I dont like to be honest\n\n \n\nThat's why odd, under powered, or heavily thematic decks can be so fun! Of course it's rewarding to beat the encounter deck, but much more so when you use interesting strategies and niche cards. \n\n \n\nThere's always the option to throw Boromir, Glorfindel, or Dain at a problem, but you can just as easily ignore such cards if you want to challenge yourself. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716485","commentId":1716485,"userName":"Bullroarer Took","timestamp":1438548142,"content":"Playing theme is fun and I always play theme for the saga quests, but I like to play power decks too.  The quest is rated a five for what it's worth which is not usually too hard.  Honestly if I were to hand build a deck to beat this quest it wouldn't be too far off what I've been using somewhat by coincidence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716494","commentId":1716494,"userName":"John Constantine","timestamp":1438548553,"content":"Low diff quests in new cycles need to exist. It lowers the entry point and enables people to, lets say, buy core + new cycle main box + a few APs and actually be able to beat something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716539","commentId":1716539,"userName":"Rob_Oz","timestamp":1438550688,"content":"Yeah, I agree completely about the importance of low-difficulty quests. They are important for newer players with smaller card pools, and in my opinion often fun to play even with large card pools. Mount Gram, Trouble in Tharbad and Encounter at Amon Din all are fairly easy (ok, need to play Mount Gram a few more times but seems to be on the easier side) but all utilize unique quest mechanics that make the scenarios interesting to play. Moreover, I personally enjoy the ability to run a deck through a scenario and win without a lot of deck-building and/or power deck-building; not every scenario needs to be a grind. And for those who may differ, there's always Nightmare versions available."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716696","commentId":1716696,"userName":"DukeWellington","timestamp":1438560118,"content":"I am a borderline power gamer and I personally love easy quests. My particular reason is because easy quests usually have a far greater replay value. Difficult quests are usually difficult because they require a certain type of emphasis (like lots of Healing or card dump for small hand size). Once you \"solve the puzzle\" there is really nothing else to play for. Easy quests can be defeated by many different strategies and deck types, so after you win you still have a lot to explore. In addition, it is fun to win with 0 threat, or on turn 1. Easy quests are a lot of fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716855","commentId":1716855,"userName":"Glaurung","timestamp":1438569408,"content":"Yes guys I agree with you. We need some easy quest to build up some experimental decks and have fun. Sure!\n\nI just only wonna get Nmode straight away along with a standard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716950","commentId":1716950,"userName":"Raven1015","timestamp":1438574554,"content":"I think it's definitely a bit tougher in 4 player, which is how we played it at Gen Con, as the chances of hitting on the wrong cards to mess you up are greater. One of us for example was using Boromir as their starting hero, but kept drawing nothing but locations, which is a recipe for disaster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1716953","commentId":1716953,"userName":"Pharmboys2013","timestamp":1438574681,"content":"> Yes guys I agree with you. We need some easy quest to build up some experimental decks and have fun. Sure!\n> \n> I just only wonna get Nmode straight away along with a standard\n\n \n\nthat would be ideal but at the very least it seems like the nightmare production cycle has really kicked into high gear over the last year or so; having the voice of isengard decks just released...i still feel like that expansion isnt that old (although it has been like  year n a half...but it doesnt feel like it!)  \n\nI caught up on obtaining a lot of the nightmare sets I was missing this weekend at GenCon but still feel intimidated taking them on...its a lot of quests to try...in that same vein i'm sure its a lot of work on Caleb and Matt to A) work on current cycle B) work on saga expansions C) work on nightmare quests D) provide relatively consistent article updates E) everything else they have to do.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717021","commentId":1717021,"userName":"Zalrus9","timestamp":1438576457,"content":"I finally beat the quest using a modified deck that was in the release article. At first, I thought it was hard, but that was because I didn't read the rules for building the capture deck right, and was stuck with two heroes for the whole of the game. But it's not bad! I like the feeling of slowly getting your stuff back, and then building up for a big finish. Hope all of the cycle's quests have the cool feeling as these ones! \n\n \n\nAs to harder quests, I do prefer easier quests in that what I really don't like are \"instant death unless you have test of will\" cards, which are often what makes quests hard (although helm's deep was hard regardless). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717098","commentId":1717098,"userName":"Fingolfin Fate","timestamp":1438580482,"content":"> Yes guys I agree with you. We need some easy quest to build up some experimental decks and have fun. Sure!\n> \n> I just only wonna get Nmode straight away along with a standard\n\nThis is what I hate most about their distribution. Why not build the Nightmare mode into the standard version just as well as the Easy mode. I know this way they allow themselves more time to see new things but it is really expensive for someone who buys every pack. I don't think it had to be that different. I would think that taking away five or six cards from a standard 30+ card quest and replacing them with five or six tough nuts would be totally sufficient, maybe with a different quest stage, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717126","commentId":1717126,"userName":"John Constantine","timestamp":1438583949,"content":"First of all, it would take away their profit. Second, it's too late building in nightmare mode into the core products. Third, it would increase the design time of new expansions which is already long as it is.\n\nEdited August 3, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717132","commentId":1717132,"userName":"Fingolfin Fate","timestamp":1438584472,"content":"Profit? Maybe, though if the original product costs more? I am not really seeing into it, obviously, I don't know what the sales of the PoD is, etc.\n\nToo late? Of course not. They change things all the time, they have added the easy mode after about two years or so, have you not been around?\n\nIncrease design time? Of course not. They have light-age of time to come up with a few cards. The number does not even have to be greater. You just make another circle around the set number to indicate what is a nightmare card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717171","commentId":1717171,"userName":"soullos","timestamp":1438588781,"content":"Just played the quest just now. It was great. And while it wasn't too hard, it was a lot of fun busting out your dudes and grabbing your gear to make a run for it at the end. I used a modified Gandalf Ally [https://talesfromthecards.wordpress.com/2015/07/10/deck-spotlight-i-am-no-ally/] deck using Spirit Merry instead of Spirit Glorfy, and it was cool to free Gandalf, Treebeard, my heroes and more to victory! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717176","commentId":1717176,"userName":"John Constantine","timestamp":1438589092,"content":"Not just maybe - for certain. Increasing the value of base product decreases sales for people who are doubtful even with current prices. PoD enables a good price for base product + additional side profit from those who want to expand their gameplay with the new difficulty.\n\n \n\nThey changed nothing. You're speaking of introducing a whole new bunch of encounter cards into every existing set. What they did was released a buklet with a list of cards to remove for the easy mode, and added a golden ring to some of the existing encounter cards. The number of cards in the set remains the same, production value remains the same, final product price remains the same. Have you not been around? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nOh man, that last paragraph indicates how actually poor is your knowledge of the game design process. If it's so easy to just design a bunch of nigthmare cards and throw them at printer - I think you should apply to the FFG as a lead LCG designer, they need someone as productive as you.\n\nEdited August 3, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717235","commentId":1717235,"userName":"Fingolfin Fate","timestamp":1438593129,"content":"It is a sign of a very naive mind that claims to know something for certain, especially when it is not within the area of expertise. I certainly did not do anything of the kind, I said I wasn't sure. Maybe you should apply if you think so highly of your knowledge, but I think you might find too few of the same opinion.\n\n \n\nSome people might just stop buying the product if it won't bring enough difficulty to them. They will not want to invest into double packs -- with doubtful result. Some of the nightmare were not a great success, a few not even that much more difficult.\n\n \n\nYes, they did change for the easy mode -- in the very similar (if not the exact) way I would like them to change for the nightmare mode.\n\n \n\nFunny, just the other day I saw you bashing someone for being negative, whilst in fact almost every post of yours is peppered with either negativity or scorn toward others. A sign of a very troubled soul."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717348","commentId":1717348,"userName":"John Constantine","timestamp":1438602564,"content":"It's not the matter of you agreeing with me or not, it's a simple matter of economics. \n\n \n\nBy the time people might stop buying the product if it won't bring them enough difficulty they will be so invested in the game that FFG wouldn't care less if they continue or not. It's the first and entry experience that matters and decides wheter the person continues to invest into the game. And that experience should be as accessible as possible. \n\n \n\nSo, you want a hard mode that has nothing to do with the new cards? Simple, remove any weak cards from the encounter deck, skip your first resource phase and BAM - you got the hard mode out of the box. You don't need to wait for FFG's official document to do that.\n\n \n\nFunny how you percieve me not agreeing with you as something negative or scornful. That's where a sign of a very troubled soul indeed. And the most sad fact about all of it is that I myself would enjoy if all the boxes contained all the nightmare stuff by default as soon as they are released. I just got enough wits to understand why they don't.\n\nEdited August 3, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717367","commentId":1717367,"userName":"Olorin93","timestamp":1438603871,"content":"If this were a larger website and fanbase I would tell myself life's too short to acknowledge squabbles like these, but seriously - both of you, get a grip on yourselves. I have no idea what you think you're going to achieve with your insults and inferences. A healthy community revolves around the ability to keep a civilized tone even if you feel provoked.\n\n \n\nFor the record, I am excited about Ettenmoors as I haven't proxied None Return and I'm curious about the new Tactics hero. Also, my 4-player group may eventually use easy mode to get through AtS and Ringmaker, as we live far apart and only play once every other month on average. Everyone is excited about the Angmar scenarios, but, when some don't have time to keep up with the cycles, the road to the newest pack becomes pretty long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717478","commentId":1717478,"userName":"tricil","timestamp":1438608819,"content":"I fully agree with Olorin.\n\n \n\nRe Nightmare decks: I personally find it great that the designers in general try not only to increase the difficulty of a quest but also to expand the theme and narrative as well as to address potential loopholes and other problems that players identify over time. I doubt that this would be possible to the same extent if Nightmare decks were released at the same time as the quests themselves.\n\nEdited August 3, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717513","commentId":1717513,"userName":"John Constantine","timestamp":1438609959,"content":"Which makes me wonder how exactly LotR LCG quests are tested... No, I'm really curious. Do they have a special depratment for that? Or they simply play a lot themselves? Or something else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717585","commentId":1717585,"userName":"tricil","timestamp":1438612646,"content":"Probably a combination of all of the above. Just read the rule sheets and you will find the list of playtesters for each box.\n\n \n\nEdit: Regarding players' feedback, a particular good example in my opinion is Heirs of Numenor, where they specifically addressed how (most) people handled Alcaron's scroll and Celador. This is not a random guess from my side but something that got explicitly mentioned in the release article: \n\n \n\n  https://www.fantasyflightgames.com/en/news/2014/10/31/the-border-war-grows-darker/ [https://www.fantasyflightgames.com/en/news/2014/10/31/the-border-war-grows-darker/]\n\nEdited August 3, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717828","commentId":1717828,"userName":"Glaurung","timestamp":1438619801,"content":"This is very unique game… from begin ffg egen planed some tournaments but then they decide to abandon that udea.\n\nThen difficulty number of the quest no make sense as well…\n\nThen Nmode was invented. I like nmode. To be honest if there is no Nmode I already stop to play this game long time ago…."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717838","commentId":1717838,"userName":"Glaurung","timestamp":1438620113,"content":"Anyway you can image I buy new lotr product and put in on shelf to wait for Nmode.\n\nI still not even play Road Darkens and Treason of Saruman. Waiting for Nightmare cards\n\nSo I really like this game to have a patient like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717877","commentId":1717877,"userName":"Teamjimby","timestamp":1438621198,"content":"> Which makes me wonder how exactly LotR LCG quests are tested... No, I'm really curious. Do they have a special depratment for that? Or they simply play a lot themselves? Or something else?\n\nI'm sure the designers play it a bunch, but I think they also have a team of playtesters to at least test the near-final version.  It may be a combination of FFG employees and volunteer experienced players from the public."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717900","commentId":1717900,"userName":"Rob_Oz","timestamp":1438621742,"content":"> Just played the quest just now. It was great. And while it wasn't too hard, it was a lot of fun busting out your dudes and grabbing your gear to make a run for it at the end. I used a modified Gandalf Ally [https://talesfromthecards.wordpress.com/2015/07/10/deck-spotlight-i-am-no-ally/] deck using Spirit Merry instead of Spirit Glorfy, and it was cool to free Gandalf, Treebeard, my heroes and more to victory! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nThis was my experience also. I played it with Sam as my starting hero and it wasn't too bad. I really had fun freeing my heros/allies/attachments with the Capture/Rescue mechanic. I enjoyed using Sam + Resourceful + Parting Gifts as a means to load up resources on my freed heros. Rescuing ally Treebeard was fun too, as he often arrived at a point where he wasn't needed right away. He was then available to help on the next turn. And I didn't have to summon him into play at a cost of 4. (This was true for other expensive allies, too).\n\n \n\nI also enjoyed how the quest made a distinction between Skill attachments and Item/Artifact attachments. This meant that I could play cards such as Fast Hitch if I had the resource match and resources to do it. With a pretty small deck it didn't take long to find Fast Hitch and other Skill attachments.\n\n \n\nI did give the quest a quick try with another deck and didn't fare too well, as my heros in that deck didn't have 3+ Willpower (Well, Galadriel does, but I didn't want her as my starting hero, heh). Without the willpower, I found myself location-locked pretty quickly which meant it was unlikely I was going to rescue anything else. That meant game over.\n\nEdited August 3, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1717983","commentId":1717983,"userName":"tricil","timestamp":1438623905,"content":"Thanks RobOz and others for initial impressions of the quest! It sounds like a simple but effective way to increase difficulty would be to select a starting hero at random. Maybe it would be a bit boring from a hero selection perspective as there just are not that many suitable ones, but I would be curious to hear what other people think about it. Has anyone tried that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1718178","commentId":1718178,"userName":"Teamjimby","timestamp":1438630121,"content":"I played it last night 4 player and we won fairly easily.  The biggest influence on our success was the 3 cards that are captured by your first prison cell, because you are guaranteed to get one of those 3 cards on the first turn.  I lucked out and snagged the Treebeard ally, so between him and Elrond (with eventually 3 resourcefuls) I was able to muster an army of ents.  Another guy was fortunate enough to get his 2nd hero from his original prison cell.  Meanwhile, a 3rd guy only got a Defender of Rammas and he was quickly location locked because once a 2nd location appeared he had no chance to make progress.  He just had to stall for time until everyone else finished their own stage 2B."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719204","commentId":1719204,"userName":"PsychoRocka","timestamp":1438680195,"content":"Hey so I don't have the quest yet... but it seems as though each player is more or less guaranteed to put a second hero into play during the travel phase of the first turn.\n\nDuring setup you create your captured deck and place one of your two captured heroes on the top of your captured deck.\n\nEach player advances to a different stage 2 and you then reveal a copy of Prison Cell and add it to your staging area (capturing an additional two cards underneath it).\n\nThis means each players initial copy of Prison Cell has their second hero and two other cards captured underneath it. Because when you travel to Prison Cell you get to put one of the captured cards underneath it into play free of cost does this not mean each player can travel to prison cell during the first travel phase and get a second hero into play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719215","commentId":1719215,"userName":"tricil","timestamp":1438681424,"content":"Stage 2 actually has Capture 7 itself, so I guess that resolves first. In other words, your second hero will be rescued by placing progress on Stage 2 but you might get lucky and your third hero will be \"in\" the prison cell.\n\nEdited August 4, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719220","commentId":1719220,"userName":"PsychoRocka","timestamp":1438681792,"content":"Ah! I thought I may have missed something!! Thank you :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719316","commentId":1719316,"userName":"PsychoRocka","timestamp":1438690130,"content":"Or you could quest successfully during the first quest phase (for example with Elrond and playing ranger spikes first turn and having an enemy revealed) and reveal a few captured cards from underneath stage 2A and get lucky and get your second hero first turn.. hmm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719460","commentId":1719460,"userName":"Teamjimby","timestamp":1438695729,"content":"It's possible to get both heroes on the first turn.  One hero is guaranteed to be under the quest card, but the last hero could be anywhere, including the quest card or your prison cell.  Even beyond Ranger Spikes, if you just get a treachery you could rescue multiple cards from the quest.  Then you're guaranteed one from the prison cell, so you could be looking at 4-5 captured cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719507","commentId":1719507,"userName":"MrMac10","timestamp":1438697908,"content":"Now that's where I'm slightly confused, when you're placing captured cards under a \"captive\" card, specifically that quest card, would you build it one card at a time from your captured deck? Or just take a stack of (7 in this case) cards and put them under? that's the difference between getting him back on your first progress counter as opposed to your last before progressing\n\nEdit: nvm, I forgot that your second captured hero could really be anywhere, so a first turn rescue of one is actually not that unlikely\n\nEdited August 4, 2015 by MrMac10"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1719515","commentId":1719515,"userName":"Raven1015","timestamp":1438698218,"content":"> Now that's where I'm slightly confused, when you're placing captured cards under a \"captive\" card, specifically that quest card, would you build it one card at a time from your captured deck? Or just take a stack of (7 in this case) cards and put them under? that's the difference between getting him back on your first progress counter as opposed to your last before progressing\n\n \n\nI don't remember off-hand what the rules say, but I do remember that the quest stage itself instructs you to rescue cards from underneath it \"at random\", so the order in that specific case doesn't necessarily matter. This is an easy part of the text to miss."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1720195","commentId":1720195,"userName":"Ecthelion III","timestamp":1438718930,"content":"If you start with Treebeard, draw Self-Preservation and play it first-turn, then stage a treachery, you can clear your quest stage first-turn and get all 7 cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1720263","commentId":1720263,"userName":"Bullroarer Took","timestamp":1438721638,"content":"And get dog piled by stage 3..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1720478","commentId":1720478,"userName":"Ecthelion III","timestamp":1438730176,"content":"> And get dog piled by stage 3...\n\nI've only played it mutiplayer so far, so you can just join someone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1720712","commentId":1720712,"userName":"Rob_Oz","timestamp":1438744726,"content":"Hoping the following helps:\n\n \n\nThe Mount Gram rules are on the FFG website now. Here's the specific instructions regarding hero setup with regard to the capture deck:\n\n \n\nAfter preparing his or her captured deck, each player chooses\nonly 1 hero to be his or her starting hero. Then, each player\nrandomly sets aside 1 of his or her other heroes, facedown.\nShuffle any remaining heroes into their owner’s captured decks,\nthen place each facedown set aside hero on top of its owner’s\ncaptured deck.\n\n \n\nSo you start with 1 hero in play, 1 hero shuffled into your Capture deck, and 1 hero stacked on the top of your Capture deck. Stage 2 instructs you to Capture 7, so the hero on top of your Capture deck will be captured by Stage 2B along with 6 other cards, including possibly your third hero. Stage 2 (can't remember if its 2A or B) also instructs you to reveal one Prison Cell, add it to the staging area and add 2 additional capture cards under the Prison Cell. This means that including the Prison Cell's base Capture 1, your first Prison Cell will start off with 3 captured cards under it. After you travel to any Prison Cell you are allowed to look at all cards under that Prison Cell, choose 1 and play it for free. Stage 2B also says that whenever progress points would be placed on the quest instead rescue that many captured cards. In my experience (played the scenario about 5 times solo so far) you will typically rescue 1-3 cards by putting progress on Stage 2B and then put one card into play for free by traveling to the set-up Prison Cell. This creates a decent chance of rescuing either the hero on top of your deck (which is in the Stage 2 Capture 7 group),  the third hero that was randomly shuffled into the Capture deck during set-up, or both. It's also pretty fun to play a big ally (Treebeard, Beorn, Boromir, etc) through the free card gained by traveling to the first Prison Cell and getting to choose from a set of three cards.\n\n \n\nAfter you've rescued all 7 of the cards captured under stage 2B you immediately proceed to stage 3.\n\n \n\nYour set-up hero has to be a high Willpower hero (3+) in my experience or you will get location/enemy locked by threat and never rescue another card from that point on. Boosting the Willpower of your starting hero would also work, but you would need a way to repeat or sustain this boost, otherwise you'll get locked out by threat in the staging area again (Eowyn makes for a pretty good starting hero). Ok, there are other ways you could place progress on locations or the quest, but it seems to me the safest method is with a hero with decent Willpower.\n\n \n\nRegarding the Capture X mechanic, here are the rules from the rules insert:\n\n \n\nWhen an encounter card or quest card with the capture\nX keyword enters play, before resolving that card’s “when\nrevealed” effects, each player takes the top X cards of his or\nher captured deck and captures them by placing them facedown\nunderneath that card.\n\n \n\nIn reading these rules it does occur to me that they are a bit vague as to how multiple captured cards are arranged. Are they randomly arranged under the card with capture, or are they placed under the capture card in the order they are drawn from the capture deck? \n\nEdited August 5, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1721257","commentId":1721257,"userName":"Ecthelion III","timestamp":1438784291,"content":"> Hoping the following helps:\n> \n>  \n> \n> The Mount Gram rules are on the FFG website now. Here's the specific instructions regarding hero setup with regard to the capture deck:\n> \n>  \n> \n> After preparing his or her captured deck, each player chooses\n> \n> only 1 hero to be his or her starting hero. Then, each player\n> \n> randomly sets aside 1 of his or her other heroes, facedown.\n> \n> Shuffle any remaining heroes into their owner’s captured decks,\n> \n> then place each facedown set aside hero on top of its owner’s\n> \n> captured deck.\n> \n>  \n> \n> So you start with 1 hero in play, 1 hero shuffled into your Capture deck, and 1 hero stacked on the top of your Capture deck. Stage 2 instructs you to Capture 7, so the hero on top of your Capture deck will be captured by Stage 2B along with 6 other cards, including possibly your third hero. Stage 2 (can't remember if its 2A or B) also instructs you to reveal one Prison Cell, add it to the staging area and add 2 additional capture cards under the Prison Cell. This means that including the Prison Cell's base Capture 1, your first Prison Cell will start off with 3 captured cards under it. After you travel to any Prison Cell you are allowed to look at all cards under that Prison Cell, choose 1 and play it for free. Stage 2B also says that whenever progress points would be placed on the quest instead rescue that many captured cards. In my experience (played the scenario about 5 times solo so far) you will typically rescue 1-3 cards by putting progress on Stage 2B and then put one card into play for free by traveling to the set-up Prison Cell. This creates a decent chance of rescuing either the hero on top of your deck (which is in the Stage 2 Capture 7 group),  the third hero that was randomly shuffled into the Capture deck during set-up, or both. It's also pretty fun to play a big ally (Treebeard, Beorn, Boromir, etc) through the free card gained by traveling to the first Prison Cell and getting to choose from a set of three cards.\n> \n>  \n> \n> After you've rescued all 7 of the cards captured under stage 2B you immediately proceed to stage 3.\n> \n>  \n> \n> Your set-up hero has to be a high Willpower hero (3+) in my experience or you will get location/enemy locked by threat and never rescue another card from that point on. Boosting the Willpower of your starting hero would also work, but you would need a way to repeat or sustain this boost, otherwise you'll get locked out by threat in the staging area again (Eowyn makes for a pretty good starting hero). Ok, there are other ways you could place progress on locations or the quest, but it seems to me the safest method is with a hero with decent Willpower.\n> \n>  \n> \n> Regarding the Capture X mechanic, here are the rules from the rules insert:\n> \n>  \n> \n> When an encounter card or quest card with the capture\n> \n> X keyword enters play, before resolving that card’s “when\n> \n> revealed” effects, each player takes the top X cards of his or\n> \n> her captured deck and captures them by placing them facedown\n> \n> underneath that card.\n> \n>  \n> \n> In reading these rules it does occur to me that they are a bit vague as to how multiple captured cards are arranged. Are they randomly arranged under the card with capture, or are they placed under the capture card in the order they are drawn from the capture deck?\n\nIt doesn't matter how they are arranged. Stage 2 instructs you to randomly rescue cards, and in all other instances you rescue all cards simultaneously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1722016","commentId":1722016,"userName":"PocketWraith","timestamp":1438807692,"content":"The one issue I have is that multiple players can end up with cards captured under the same card - so if multiple people include the same vcard in their respective decks, how do you know whose it is when you rescue it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1722024","commentId":1722024,"userName":"Raven1015","timestamp":1438808091,"content":"That can be a tricky one. If players are using different sleeves, then it makes things easy. If not, you could have each stack of captured cards pointing towards the players they belong to. You just have to be careful about not messing up this orientation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1722180","commentId":1722180,"userName":"Pharmboys2013","timestamp":1438814246,"content":"Random side note regarding the quest.  I adore that they included some custom backstory for Rossiel, that was such a great trend they initiated with Idraen and I hope they continue to do it and realize how much more impactful it can make the experience when playing with those heroes.  Was a pleasure to read and imagine.\n\n \n\n(sorry if this was covered in a previous page or in another topic....theres like 5 threads a piece on mount gram and land of shadow at the top of the forums and its hard to keep up)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725201","commentId":1725201,"userName":"Mich the One","timestamp":1438962252,"content":"Am I the only one who is not a fan of Rossiel? I mostly mean in terms of theme.\n\n \n\nI acknowledge the trend of putting FFG-invented characters into the game.  I understand this achieves two things: (i) spreads the pool of canon characters so that designers do not \"run out\" too soon, (ii) balances the male to female ratio. Well, okay. I learned to live with that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n \n\nBut still, what is up with Rossiel? She just feels out of place, more like from... Warcraft perhaps? The skimpy leathery garments, magic glowy whisps dancing around her, etc. Anyway, it is a nice piece of art, a depiction of a physically beautiful character, just IMHO somehow a breach of climate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725211","commentId":1725211,"userName":"John Constantine","timestamp":1438962534,"content":"I'm not a fan too. But I'm not a fan for other reason. And the reason is: \"Ither play me exclusively with the new \"add a card to the victory display\" thingies or don't play me at all\". I'm not saying it's bad, I'm just not a fan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725226","commentId":1725226,"userName":"Mich the One","timestamp":1438962814,"content":"> I'm not a fan too. But I'm not a fan for other reason. And the reason is: \"Ither play me exclusively with the new \"add a card to the victory display\" thingies or don't play me at all\". I'm not saying it's bad, I'm just not a fan.\n\n \n\nyeah, that too.\n\nThese victory display shenanigans, it is just a fad :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725277","commentId":1725277,"userName":"Gizlivadi","timestamp":1438964055,"content":"In quests like the Three Trials she's gonna be really interesting. Otherwise, I hope we get some more vistory display stuff to make her good hero in general, not just in some quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725309","commentId":1725309,"userName":"John Constantine","timestamp":1438964840,"content":"There is already plenty of stuff spoiled that would be good with her. Like that event that cancels a card that has a copy of it in the victory display, those two events which add locations explored and enemies defeated to the victory display. Throw in this neutral Keen As Lances event. It's just like Outlands with less blunt power, but with that \"just take every card of that type and add it to your deck to make magic happen\" element still intact."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725362","commentId":1725362,"userName":"PocketWraith","timestamp":1438966434,"content":"> But still, what is up with Rossiel? She just feels out of place, more like from... Warcraft perhaps? The skimpy leathery garments, magic glowy whisps dancing around her, etc.\n\nBy what crazy standard is Rossiel dressed in 'skimpy leather garments'?\n\nAs to the glowy wisps:\n\n \n\n\"Did you not say that you wished to see Elf-magic?\"\n\n–Galadriel, The Fellowship of the Ring\n\n \n\nIt's right there on the card. Things like that may be found in Lorien.\n\n \n\nI'll grant that if you don't want to play around with the victory display stuff she's basically worthless to you, but the idea that her art somehow makes her unthematic makes no sense to me at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725367","commentId":1725367,"userName":"Gizlivadi","timestamp":1438966566,"content":"To be fair I can't recall any mention of wisps or supernatural lights in Middle Earth, apart form the corpse-candles in the Dead Marshes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725631","commentId":1725631,"userName":"DukeWellington","timestamp":1438974040,"content":"I think anytime a card is introduced which attempts to provide synergy you can complain that the game designers are just building decks for you, but ultimately those complaints don't pan out because deck builders always figure out something that doesn't fit the mold. Personally, I really like the victory display theme and there needed to be a hero to tie the theme together. It is better as an invented hero IMO.\n\nAs for her being off theme, basically anything original will be off theme. It is not as bad as the sand worms from Dune tunneling their way into the NM Emyn Muil quest. I do wonder about the green skin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725658","commentId":1725658,"userName":"bubblepopmei","timestamp":1438974660,"content":"> To be fair I can't recall any mention of wisps or supernatural lights in Middle Earth, apart form the corpse-candles in the Dead Marshes.\n\n \n\nWelllllllll Frodo sees Arwen/Glorfindel as s/he 'really is' which is basically a glowing mechagodzilla of classiness. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725661","commentId":1725661,"userName":"John Constantine","timestamp":1438974709,"content":"I am not complaining, I'm totally fine with a hero like that being released. I'm just saying why I'm personally not a fan of that hero. But I'm going to argue here with you, because there is extent to when designers build decks for you and when they don't. And Rossiel is a good example of situaiton when they do, because she is lore, she only synergizes with victory display, and all the victory display stuff is in lore (little is neutral) and most of it comes out in the same cycle as her, and you'll want that stuff in your deck for her to be effective. Thanks goodness this stuff can be effective without her, but with her at your disposal it will literally shine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725686","commentId":1725686,"userName":"entMoot","timestamp":1438975112,"content":"Rossiel's bonuses kick in for enemies/locations that have victory points, as well. There are several quests like Hills of Emyn Muil, Conflict at the Carrock (especially NM), Fog on the Barrow Downs, etc.. where relevant traits end up in the Victory Display pretty regularly.\n\n \n\nFor quests like those, you don't even need the other new player cards to power her up.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725705","commentId":1725705,"userName":"John Constantine","timestamp":1438975573,"content":"You don't need, but you would like to, to maximize her capacity and speed up the process."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725774","commentId":1725774,"userName":"danpoage","timestamp":1438977089,"content":"I can think of at least one deck that will include her without victory display shenanigans. She is a low-threat cost Lore hero with the Silvan trait and 2 willpower. For that matter, her 2 defense means that she could wield A Burning Brand. The Silvan Trackers in that archetype will ensure that any damage she takes will be healed without trouble. All of these things seem useful to me. She is by no means a marquee hero, nor should she be. As Caleb mentioned in our Gen Con interview, the FFG-created heroes *should* fall into the support role. It would not make sense for them to outshine the iconic characters from the stories. As someone who likes to experiment with different and sometimes unorthodox decks, I always like seeing low-cost heroes with useful traits. She adds to the flexibility of overall hero and deck building pools. An 8-cost hero is allowed to just slot into a deck for sphere and trait and allow the other heroes to pull most of the weight, it is the nature of the 6-8 threat cost range. The idea that every hero has to somehow be the end-all and be-all in every deck strikes me as unnecessarily narrow.\n\n \n\nAs for the art, that is completely a subjective discussion. I will say that the land of Middle-earth was filled with a bounty of magical elements so it feels appropriate for Elves to have a magical appearance. One perspective on the art could be that it represents the way that Hobbits might perceive a beautiful elf, upon first meeting one. In any case, to each their own. There is plenty of hero card art that I would re-examine before I would ever criticize this particular card.\n\nEdited August 7, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725815","commentId":1725815,"userName":"Raven1015","timestamp":1438978147,"content":"I get what Mich the One is saying about the depiction seeming to \"not fit\" in some way. I think the reason is because we really don't know much of anything about the Silvan of Lorien, especially the female Silvan of Lorien, and anything new might seem strange at first glance. The big thing is that magic in Tolkien is usually not directly depicted, like we see with the \"wisps\" in Rossiel's art, but I like that it gives a certain feel to the character and the card. It's possible that such things could be seen in a place like Lorien. I also think the art continues to avoid the overly sexualized female art that plagues other fantasy artwork, which is a good thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725841","commentId":1725841,"userName":"Gizlivadi","timestamp":1438978817,"content":"Just to be clear, I do like Rossiel and the victory display mechanic. Once I get the respective packs I will try it in solo, what heroes do you recommend using? I think that in solo the secrecy theme might not cut it since in order to get Rossiel's bonuses you actually have to kill enemies and explore location, which in a slow-burn secrecy deck without Tactics might be problematic. I was thinking of Treebeard and Glorfindel. What do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1725849","commentId":1725849,"userName":"John Constantine","timestamp":1438979001,"content":"I might sound like a power gamer here (which I'm not), but if I wanted a low threat Lore defender, I would go for Denethor, who can scry if there is nothing to defend. But that's not the point, technicly, even the Spirit Pippin can be of somewhat use outside of the full hobbit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726503","commentId":1726503,"userName":"Noccus","timestamp":1439018038,"content":"I share Mich his misgivings about the art.\n\nIt's a pretty picture sure, but with that greenish skin and pollen floating around her she could pass for a ent-wife.\n\nIt just doesn't feel very middle-earthy to me too.\n\nNot a big deal, true, but what's wrong with discussing a new hero?\n\nMechanic & art alike.\n\nI like her mechanic on paper, but I will withhold judgement until I've played he a couple of times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726504","commentId":1726504,"userName":"Edvando","timestamp":1439018136,"content":"I think that Rossiel character, cloths, etc are ok. The flying lights around her. Ouch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726506","commentId":1726506,"userName":"John Constantine","timestamp":1439018226,"content":"Could those lights be something natural? Like insects?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726507","commentId":1726507,"userName":"PsychoRocka","timestamp":1439018254,"content":"Only the green skin bothers me. Her backstory is pretty awesome I must say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726508","commentId":1726508,"userName":"Noccus","timestamp":1439018353,"content":"> Could those lights be something natural? Like insects?\n\nOh that's a plausible one.\n\nI'm seeing fireflies from now on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726510","commentId":1726510,"userName":"Edvando","timestamp":1439018448,"content":"I think the green skin is just the light reflecting on her skin. I don´t have the AP yet, does the background say anything about that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726512","commentId":1726512,"userName":"PsychoRocka","timestamp":1439018619,"content":"https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png [https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png]\n\n \n\nI don't know... her skin seems a bit too green to simply be a reflection of the light. Her story references her red hair but nothing about her skin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726522","commentId":1726522,"userName":"Noccus","timestamp":1439019390,"content":"Agreed. The green is just overdone.\n\nIs there something about a orcish grand mother or something in that back story? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited August 8, 2015 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726526","commentId":1726526,"userName":"Mazarbul","timestamp":1439019594,"content":"I have been playing around with Rossiel along with Out of the wild, Leave no trace, None return, The door is closed, Scout ahead and Keen as lances. And I must say it's been a blast! I played mono Lore solo using Rossiel, Beravor and Aragorn, along with ally Treebeard and his ent army, A good harvest/Steward of Gondor and Henamarth for scrying.\n\nLately I am considering testning a solo Deck with Rossiel, Galadriel (have Lore icon with Nenya) and Spirit Merry.\n\nI really enjoy all the different playstyles of this game! Had great fun with Caldara, and looking forward to new Erestor.\n\n/Maz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726543","commentId":1726543,"userName":"John Constantine","timestamp":1439022707,"content":"Well, just as I said. He just threw in all those victory display cards and BAM! - it was a blast :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726583","commentId":1726583,"userName":"Mazarbul","timestamp":1439027069,"content":"The blast is playing a completely different playstyle than the usual \"heavy defender, heavy attacker\" game. And no, it's a far more rewarding way of playing this game than Outlands..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726601","commentId":1726601,"userName":"John Constantine","timestamp":1439029051,"content":"And, again, you missed my point. And the point was: they give you just a whole bundle of stuff which you put into the deck all together as a no-brainer. Just like Outlands. Just like you did."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726621","commentId":1726621,"userName":"banania","timestamp":1439030530,"content":"> Am I the only one who is not a fan of Rossiel? I mostly mean in terms of theme.\n\nNope. Not a fan too. And that comes from someone who is actually kind of a fanboy about everything Matt and Caleb have done with this game, that has never felt as thematic since they're in charge.\n\nBut I really don't get the Victory Display mechanic, in terms of theme... so Rossiel all the more.\n\nThat being said, the hero review by Ian at Tales From the Cards softened a bit my opinion. Also, I've not yet read her backstory, so I might understand the theme of \"elvish magic\" behind it. But for now, it feels too \"mechanical\" for me. Hope actually playing her will change my mind!\n\nI like the art though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726681","commentId":1726681,"userName":"Mndela","timestamp":1439036700,"content":"She may be from Legendary Marvel [https://boardgamegeek.com/boardgame/129437/legendary-marvel-deck-building-game]card game? ^^ May the daughter of The Incredible Hulk? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited August 8, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726846","commentId":1726846,"userName":"Ecthelion III","timestamp":1439049992,"content":"The thing about Outlands is you can pretty much just fill a deck up with Outlands cards and resource generation/card draw for your Outlands cards. With the victory display, there are 13 cards (3x Leave No Trace, 3x The Door is Closed! 3x None Return, 3x Keen as Lances, 1x Scout Ahead) that will go in your deck, as well as Rossiel, but you can put 37+ other cards in to make all kinds of variations. There's the secrecy Rossiel deck, the Ent Rossiel deck, the Eagle Rossiel deck, the Silvan Rossiel deck, and so on and so forth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726854","commentId":1726854,"userName":"John Constantine","timestamp":1439050250,"content":"Which doesn't changes the core - Rossiel and that victory display stuff. I can do a lot of different Outlands variations too, you know. I can even create a viable Outlands deck without Hirluin himself, for the sake of the argument."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726900","commentId":1726900,"userName":"Gizlivadi","timestamp":1439053291,"content":"Well, that's how Caleb and Matt are handling the game, so get used to it I say. Even before them what they've been doing is just building archetypes around certain cards or groups of cards. Some archetypes are more flexible, some aren't. The silvan deck has a definite core, as probably will the Dúnedain deck as well. Leadership Gondor has core cards, Outlands, Dwarves, allies leave play, Eagles, the list goes on. Even in decks that are more general-purpose and mix and match different races there's still some kind of core. In a Tactics Boromir deck you'll probably want to include Gondorian Shield, Secret Vigil, Quick Strike, etc or in an Lore deck you'll want Daeron's Runes for example. Mono-leadership Gondor pretty much builds itself, as well as Eagles. In the end the power level of heroes and its combinations amount to certain archetypes to be built upon them, either with core cards for the spheres or for its traits, but whereas in the past these archetypes were built over time with some cards thrown here or there for them, now Caleb and Matt just cut to the chase and give all the minimum necessary pieces for an archetype right away, which I really like. But even you proved you can flexibilize with an Outlands deck, and you can include Galadriel's Handmaiden in a non-Silvan deck. The same goes for Rossiel. Yes there are some must include cards for her but not only that is the case for almost every other deck in this game, but you can also make different variations of it. My personal plan is to make a more aggresive deck around her, just get her to 4/1/4 as quickly as possible and then smash face.\n\n \n\nIn short, my point is, criticizing Rossiel because there are core cards that you \"just throw together\" in a deck with her is really unfair, as that is the case with almost any archetype in this game. \n\nEdited August 8, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726920","commentId":1726920,"userName":"John Constantine","timestamp":1439054931,"content":"I'm already used to it. Doesn't mean I must like it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726931","commentId":1726931,"userName":"Nickpes","timestamp":1439055458,"content":"> https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png [https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png]\n> \n>  \n> \n> I don't know... her skin seems a bit too green to simply be a reflection of the light. Her story references her red hair but nothing about her skin.\n\n \n\nMaybe the fact she is Silvan, thus wood elf propably, made her behave like a chameleon or something "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726942","commentId":1726942,"userName":"Lecitadin","timestamp":1439056356,"content":"JJ Abrams directed the artwork, those lights are flare effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1726979","commentId":1726979,"userName":"Mazarbul","timestamp":1439058448,"content":"> The thing about Outlands is you can pretty much just fill a deck up with Outlands cards and resource generation/card draw for your Outlands cards. With the victory display, there are 13 cards (3x Leave No Trace, 3x The Door is Closed! 3x None Return, 3x Keen as Lances, 1x Scout Ahead) that will go in your deck, as well as Rossiel, but you can put 37+ other cards in to make all kinds of variations. There's the secrecy Rossiel deck, the Ent Rossiel deck, the Eagle Rossiel deck, the Silvan Rossiel deck, and so on and so forth.\n\nIndeed. And some people like it, some don't. Don't like it? Then don't play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727033","commentId":1727033,"userName":"John Constantine","timestamp":1439063233,"content":"I won't. All I did is expressed my opinion on the forums which are designed to express people's opinions. I even specificly noted that doesn't mean it's bad, it's just I don't enjoy it, yet I still got attacked with wall of proving me wrong text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727046","commentId":1727046,"userName":"Gizlivadi","timestamp":1439063881,"content":"> yet I still got attacked with wall of proving me wrong text.\n\n \n\n \n\nAssuming you are referring to my post, you are of course entitled to your own opinion, as we all are. I replied with the wall because I think your opinion is unwarranted. In hindsight, I was a bit confused at the moment and could have replied with a much shorter text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727079","commentId":1727079,"userName":"gandalfDK","timestamp":1439065816,"content":"Man, where did these forums go to?\n\n \n\nFrom my point of view John was just pointing out that the victory display strategy is developed in a way that you can just put all cards saying \"x\" together and you've got a deck. \n\nWell, in this way I would agree, but it requires a bit more nuance if you ask me.\n\n \n\nI don't see a reason to fire an army of Orcs on someone with world like : \"don't like it, don't play it.\" \"that's the way how things go\". That's quite the fallacy and you know it. If Caleb and Matt would say such things, the game would have died long ago.\n\n \n\nPlease just keep things polite and constructive. John is entitled to voice his OPINION on the victorydisplaything and Rossiel as is anyone else.\n\n \n\nAnyway, Rossiel is indeed tied to the victorydisplay but as my favorite Ecthelion, namely the Third, pointed out, there is a lot of room left for cards. \n\n \n\n“Well, I am going back into the open air, to see what the wind and sky are doing!” "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727270","commentId":1727270,"userName":"PocketWraith","timestamp":1439076793,"content":"> https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png [https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png]\n> \n>  \n> \n> I don't know... her skin seems a bit too green to simply be a reflection of the light. Her story references her red hair but nothing about her skin.\n\nNope, I'm looking at that and thinking it's clearly an effect of the lighting.\n\n \n\n> I don't see a reason to fire an army of Orcs on someone with world like : \"don't like it, don't play it.\" \"that's the way how things go\". That's quite the fallacy and you know it. If Caleb and Matt would say such things, the game would have died long ago.\n\nActually Caleb said pretty much exactly that in the GenCon Grey Company interview, talking about Outlands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727362","commentId":1727362,"userName":"joezim007","timestamp":1439083122,"content":"Yes, not every card can cater to every player, so there will always be cards people don't like and the format of this game allows us to say \"don't like it, don't play it\" without screwing ourselves over."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727440","commentId":1727440,"userName":"PsychoRocka","timestamp":1439089356,"content":">  \n> \n> > https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png [https://images-cdn.fantasyflightgames.com/filer_public/3d/8b/3d8bbc3c-aabf-41f4-8d17-e196e376253d/mec40-rossiel.png]\n> > \n> >  \n> > \n> > I don't know... her skin seems a bit too green to simply be a reflection of the light. Her story references her red hair but nothing about her skin.\n> \n> Nope, I'm looking at that and thinking it's clearly an effect of the lighting.\n> \n>  \n> \n> > I don't see a reason to fire an army of Orcs on someone with world like : \"don't like it, don't play it.\" \"that's the way how things go\". That's quite the fallacy and you know it. If Caleb and Matt would say such things, the game would have died long ago.\n> \n> Actually Caleb said pretty much exactly that in the GenCon Grey Company interview, talking about Outlands.\n> \n>  \n\nYeah its really not the lighting.....\n\nSee where the light is hitting her shoulder and it is actually making the green lighter and there is actually a bit of a cream/white colour going on as well whereas on her chest and neck where the light is not reflected and is blocked by her head and hair it is completely green and all one shade. The only spots where she is not just completely green are her brow and shoulder both of which are bathed in light giving those spots a look of white/cream mixed in with the green. All the parts of her that do not have light shining on them are completely green. No idea how you don't see that. Just look at her neck...\n\nEdited August 9, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727448","commentId":1727448,"userName":"Gizlivadi","timestamp":1439089951,"content":"To me her skin color is most definately just a play with hues gone slightly wrong. You can tell the artist didn't actually want to make her skin green, but he wanted to give the whole image an \"atmospheric\" color filter of the very same color as the background, kinda like the sepia tone in movies and such, and it went a bit overboard. Digital artists do these types of hue balancing and desaturation all the time, and I don't particularly like it. They love to desaturate or mute the colors so that everything looks grimdark and grey-ish (it's happening a lot in movies as well, just look at DoS in Erebor compared to Moria), and they think that it makes it more serious. But it's dumb. I much prefer more colorful pieces.\n\n \n\nEdit: To be fair, that's a trend that, despite there still being many examples, is dying down more and more in this game. Recently both player and encounter artwork are much more colorful and I love it.\n\nEdited August 9, 2015 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727551","commentId":1727551,"userName":"GrandSpleen","timestamp":1439099927,"content":"Had my first experience with this quest tonight, 2-player.  We had a good time and won on the first attempt, but it had its moments of suspense.  \n\n \n\nWe brought Silvan decks, which was what I already had put together.  This probably increased the challenge level of the scenario, as our decks contained a bunch of events that were useless without allies.\n\n \n\nElrond and Celeborn were the starting heroes.  I thought the Celeborn side would do better, as this was a Leadership/Spirit deck and had all the questing power.  It didn't turn out that way though, and this deck stalled out and began to raise its threat against a growing staging area.  The Elrond deck steadily built power, rescued Beregond on turn 1, and swooped in to save the Celeborn deck from destruction at just the right moment.  \n\n \n\nWe both discarded heroes as captured cards (Haldir to a turn 1 reveal of Stop the Executioners! side quest that was not completed, and Galadriel to the Interrogation treachery).  Still, we managed to pull through.  Fun times. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727896","commentId":1727896,"userName":"Glaurung","timestamp":1439135459,"content":"Play once.. Quite funny but extremely easy…. Boring…. No way for me to play it again until nightmare cards come out"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1727998","commentId":1727998,"userName":"DukeWellington","timestamp":1439140589,"content":"I have an idea Glaurung. On your signature, just after \"Wizard is never late...\" you can add, \"I'm waiting for NM because normal mode is too boring.\" That way you don't have to type it out in every comment. It will save you a lot of time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1732428","commentId":1732428,"userName":"leptokurt","timestamp":1439377788,"content":"Oooooooh, I wuv Rossiel! :wub: [//content.invisioncic.com/Mfantflight/emoticons/default_wub.png]\n\n \n\nLove to play her, love that finally they designed a scenario that goes along with the new hero's abilities. Rossiel offer some interesting new ways to build decks which is why I wouldn't compare her to Outlands. Might be interesting to combo her with some tactic heroes, as she could handle the main problems of tactics al by herself. Another option would be a secrecy deck with Mirlonde and her.\n\n \n\n \n\nNot sure about the new Ent cards, IMO the Ent trait was already OP way before they released these cards, but now these trees should stomp every scenario with their might feets. Is it a bird? Is it a plane? Nooooo, it's Ent super power!\n\nEdited August 12, 2015 by leptokurt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1732431","commentId":1732431,"userName":"leptokurt","timestamp":1439377900,"content":"> Play once.. Quite funny but extremely easy…. Boring…. No way for me to play it again until nightmare cards come out\n\nFunny... but boring? :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1733944","commentId":1733944,"userName":"Olorin93","timestamp":1439443749,"content":"Do you think we'll see a player card that adds Treacheries to the VD as well? Thinning out the encounter deck of locations and enemies will bring back Treacheries more often, and When Revealed effects are usually what causes headaches for my group."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1733994","commentId":1733994,"userName":"John Constantine","timestamp":1439448776,"content":"Doesn't Out of Wild do that already?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1734003","commentId":1734003,"userName":"PsychoRocka","timestamp":1439449485,"content":"Yeah technically Scout Ahead and Out of the Wild can both do that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1734173","commentId":1734173,"userName":"Olorin93","timestamp":1439466323,"content":"Sure, Scout Ahead is a good option but unique. I would like to see a third 1-cost lore event to complete the set. Out of the Wild is barely worth it out of Secrecy, I think. But maybe Secrecy is the preferred play style with scrying anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1734182","commentId":1734182,"userName":"joezim007","timestamp":1439467096,"content":"Yeah, a 2 cost Lore event that cancels a \"when revealed\" effect on an encounter card and adds that card to the victory display. That would be pretty sweet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735213","commentId":1735213,"userName":"Gizlivadi","timestamp":1439510092,"content":"I'd be fine with an event that added itself and a just resolved treachery to the victory display. After all, cancelling is what The Door is Closed is for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735252","commentId":1735252,"userName":"PsychoRocka","timestamp":1439512716,"content":"Have to agree with Gizlivadi. Being able to cancel a when revealed effect AND add the card to the victory display is far too powerful for 2 resources, especially in lore. This would be just as good as Test of Will arguably better a lot of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735472","commentId":1735472,"userName":"Olorin93","timestamp":1439528720,"content":"With treacheries and surges getting seemingly more common and newer encounter decks thinner, I really wouldn't mind more ways of reliably cancelling effects. There are only so many ways to recycle the same Test of Will. I think giving us options for that outside of Spirit would be fun for a change - there are still core set staple cards that I wish I could find some alternative to but never manage to build without."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735613","commentId":1735613,"userName":"banania","timestamp":1439538523,"content":"And I don't think the designers will favor outright Treachery cancellation in another sphere than spirit.\n\n \n\nWe know that in the Treachery of Rhudaur we'll get a \" Lore event that can cancel the effects of any encounter card of which you have a copy in the victory display\". I believe that the card is \"The Door is Closed\" of which we had a glimpse in The Wastes of Eriador / Angmar Awakened announcement news.\n\n \n\nSo we'll have to put a Treachery in the victory display (for now with Out of the Wild or Scout Ahead) and then we'll be able to cancel it. What's pretty amazing with that card is that it cancel the effects of any encounter card, and that means: no Doomed, no Surge, no When revealed effects, on Enemies, Locations (both won't be too hard to put in the Victory Display) or Treacheries. Just ignore completely the card, and all that for 1 Lore ressource, as it seems you don't even replace the encounter card by another.\n\n \n\nIt requires a bit of setup, but hell, not that much, and you still get to use the card on regular basis, because it does not say \"worth no victory points\". Put that in your Lore deck and say bye to that second Hill Troll in Journey along the Anduin.\n\n \n\n\"The Door is Closed\" is better than the One-Ring.\n\n \n\nMEC40-44fan.png [https://www.fantasyflightgames.com/media/ffg_content/lotr-lcg/angmar-awakened/mec39-the-wastes-of-eriador/MEC40-44fan.png]\n\nEdited August 14, 2015 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735633","commentId":1735633,"userName":"John Constantine","timestamp":1439540282,"content":"I think, they won't put outright treachery cancellation in nor spirit neither lore again. Just imagine a deck with 1 spirit and 2 lore heroes, with 3 copies of test of will and 3 copies of that 2 cost card that cancels a treachery and adds it. There should be a catch.\n\nEdited August 14, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735663","commentId":1735663,"userName":"Olorin93","timestamp":1439542547,"content":"Maybe Doomed? Or drawing another encounter card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735708","commentId":1735708,"userName":"Nickpes","timestamp":1439547248,"content":"Ah, just saw a card named after Tinuviels tale, where is it supposed to be? On Treachury of Rhudaur? It will be an autoinlude even without a spirit hero, just for the name :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] , love Beren and Luthien"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735789","commentId":1735789,"userName":"banania","timestamp":1439553021,"content":"> Ah, just saw a card named after Tinuviels tale, where is it supposed to be? On Treachury of Rhudaur? It will be an autoinlude even without a spirit hero, just for the name :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] , love Beren and Luthien\n\n \n\nFrom https://www.fantasyflightgames.com/en/news/2015/7/10/the-dread-realm/ [https://www.fantasyflightgames.com/en/news/2015/7/10/the-dread-realm/]\n\n\"a Spirit Song that recalls the lay of Beren and Lúthien to encourage stronger alliances between the region's Dúnedain and Noldor.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735812","commentId":1735812,"userName":"John Constantine","timestamp":1439553892,"content":"I wonder how will it work... boost stats significantly if you control both Noldor and Dunedain hero? Exhaust a Noldor to put Dunedain into play from your hand? If you control Noldor, search for Dundedain, or if you control Dunedain - search for Noldor?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1735938","commentId":1735938,"userName":"monkeyrama","timestamp":1439558927,"content":"It could be like the one for Gondor and Rohan, although I'm not sure what benefits you would get from adding the traits together for a phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1736019","commentId":1736019,"userName":"John Constantine","timestamp":1439562146,"content":"Choose a Noldor and a Dunedain character you control. Noldor character gets +1 Willpower for each Dunedain character you control, and Dunedain character gets +1 Defense for each Noldor character you control  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1736219","commentId":1736219,"userName":"monkeyrama","timestamp":1439569733,"content":"Perhaps to fit into the archetype of Noldor there might be some kind of discard pile manipulation?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1736763","commentId":1736763,"userName":"joezim007","timestamp":1439600973,"content":"> I think, they won't put outright treachery cancellation in nor spirit neither lore again. Just imagine a deck with 1 spirit and 2 lore heroes, with 3 copies of test of will and 3 copies of that 2 cost card that cancels a treachery and adds it. There should be a catch.\n\nIf we didn't get The Door is Closed, I think my card would be fine. Making it 2 cost would provide a pretty steep cost compared to A Test of Will and if it puts itself in the victory display, then you can't play a copy more than once. But it's a mute point with The Door is Closed being released."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1736998","commentId":1736998,"userName":"PsychoRocka","timestamp":1439620776,"content":"Finally got my hands on Escape from Mount Gram!\n\nHave played two games so far. Won both but had immense fun both games.\n\nProbably one of my favorite quests purely due to how unique and different it is to anything else we've gotten so far.\n\nIt actually reminded me a little of the first age custom card Lone Outlaw or whatever its called that gives bonus stats and resources to a hero if it is the only hero you control (the fact you start with one hero that has extra starting resources).\n\nI smashed the quest pretty **** hard both times. The first time both decks (two handed) smashed stage 2 on their own at the same time and joined up at stage 3 and the second game the leadership/tactics deck was struggling and had to be rescued by the lore/spirit deck. During the first game I got an early game side quest Stop the Executioners and managed to clear it with one time counter left getting me a hero in the process! I also cleared Orc Ambush later on, managed to kill Gornakh pretty quickly and finished with every hero but one (Haldir got left behind...). The second game I only had to clear Orc Ambush and avoided the Executioners side quest. Gornakh got smashed in the face when he engaged the first player (tactics/leadership deck) whilst it was still declaring attacks against enemies (and killed a guard rescuing two player cards) and so readied Samwise and boosted him to 4 attack (had already been boosted by an optional engagement and had dunedain mark equipped) allowing Sam and Elladan (with dagger of westernesse attached) to attack him for 9 putting 6 damage on him. The following turn I feinted him and killed him before other enemies stopping him from making any extra attacks (killing the other enemies would rescue cards). Managed to pull off some other nifty combos and strategies throughout both games as well. I feel like this quest forces you to play so differently that you can get some great alternative uses out of cards you usually use for a single purpose. Due to a lack of many defensive and offensive heroes for the first half of each game (and second half to a lesser extent) many allies see plenty of combat and so strong allies like Gimli, Northern Trackers and Ents are amazing in this quest as they are good at both defending and attacking. Derndingle Warriors and a decked out Elrond (Arwen buff, Shield, Cloak of Lorien and two copies of Lembas) took on defensive roles during the second game when Elrohir was never rescued and left behind in Mount Gram. This was very fun and very different from how I usually defend attacks while playing other quests. Turns out all my backup defenders do a very good job without Elrohir around.\n\nFor the first game I had Elrond and Sam as my starting heroes. The second game I used Glorfindel (spirit) and Sam instead as I wanted to be able to play Test of Will from the get go (light of valinor too) and Elronds Counsel once I get an ally out for that deck. I got light of valinor and unexpected courage in my opening hand second game and put them both straight on Glorfindel. I then rescued Asfaloth and played him for free from the starting copy of Prison Cell and was just set. I rescued Elrond the following turn and that deck just smashed the quests face in very quickly and joined the other deck (which was struggling a little) within another turn or two. By the end of both games despite not rescuing every hero I had a small army of allies out (far more than I have at the end of most other quests) due to so many rescued cards being drawn (MASSIVE card draw in this quest due to this, had hands of like 15 to 20 cards for both decks at various points) and a large force of Ents, Rangers and Elves just annihilated everything in sight. Honestly I think I must have staged a FULL BLOWN prison riot and escape and rescued almost every captive in that stupid mountain jail. How the orcs managed to imprison so many Ents in underground prison cells (how would they fit..?) sure beats me :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nA few things I have noticed is that all the cards with capture can actually be hugely beneficial if they are weak or you have a strong board state and can easily explore/defeat them the turn they appear as you will draw several cards when you do so and sometimes get to play a card for free (the orc guard enemy and prison cell). Similarly as daunting as the Stop the Executioners sidequest is 5 rescued cards is a lot and can easily net you a hero (did in one of my two games) if you beat it.\n\nAsfaloth is a BEAST in this quest and can turn any copies of patrol room that are revealed during staging into \"exhaust Asfaloth for each player to draw two cards straight from his capture deck\"  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Getting him out early can also help you clear the first copy of prison cell quickly to get those captured cards into your hand faster. Test of Will and Feint were both epic in this quest as I was easily able to draw multiple copies of each in both games considering my decks were so small without allies and items, mounts etc. Honestly the hardest parts of the quest are Gornakh who can be an absolute beast and make several attacks each turn if you are rescuing multiple cards and the very first few rounds (I guess this is true of pretty much every quest though but this one takes it to the extreme with just one starting hero). If you get some nasty high threat encounter cards on the first turn or two and do not get a good free card from Prison Cell you can be in for some mighty trouble. I found that playing two handed meant that as long as one deck did well everything would be fine as it would join the other deck and help it rescue a second hero (from stage 2). The worst cards are definitely Feeble and Weary (which I managed to cancel every time but once during both games) which can shut down your entire questing power late game (although first or second turn this is a great card as you just put one point of damage on your starting hero if it is even exhausted and face no threat in staging other than prison cell) and captives of Gornakh which can be devastating early game if you only have a single strong ally out who is really helping with questing (but next to harmless when you have an army of allies out at quest 3). Even these can be easily countered, ignored or are only devastating during specific parts of the quest however and overall I think it is a pretty easy quest. Also I don't think you necessarily need to deck build for it, I just used my two power decks I always use and gave it an absolute beating: https://community.fantasyflightgames.com/topic/104951-two-handed-decks/?p=1727695 [https://community.fantasyflightgames.com/topic/104951-two-handed-decks/?p=1727695]\n\nI can only imagine what nightmare will be like for this quest... 3 or 4 threat encounter cards that can wreck you in the first few turns, enemies that can recapture heroes under them, maybe even another prisoner inadvertently freed from the prison who is not a member of your party or even a free person of middle earth and instead some very nasty beast of some kind the Orcs cannot tame so must keep prisoner as well. Perhaps even orc enemies that go into your captured deck and jump out and attack when you rescue other cards at the same time they are \"rescued\"/revealed.\n\n \n\nOverall a very unique, very fun quest that although not very hard is not the easiest quest in the game (would still say Encounter at Amon Din, Dead Marshes, Trouble in Tharbad and maybe others are easier) and still makes you think about your decisions and game play very carefully in order to win. Loving this cycle so far, cannot wait for Across the Ettenmoors!\n\n(not in quest log yet so just for my own purposes, game one score: 53, game two score: 40)\n\nEdited August 15, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1737106","commentId":1737106,"userName":"ossderossmane","timestamp":1439631521,"content":"How do you guys play this? Whe making the captive deck, the hero goes on top. Then, you capture the first seven cards from the deck under the first quest stage. Is the hero the first card rescued (as it would be if you took the first 7 from the deck and put them under the quest card as one stack) or the last card (as it is if you transfer each card individually? Maybe it's a language issue, but this is kind of unclear to me, and obviously a big difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1737109","commentId":1737109,"userName":"PsychoRocka","timestamp":1439631968,"content":"Doesn't really matter as Stage 2B instructs you to rescue cards from underneath it at RANDOM so the order you put them underneath doesn't matter. Similarly all other cards with capture give you all the cards underneath at once (except for when it lets you play one for free as well in which case you still see them all so order doesn't matter) so again it doesn't matter what order they are in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1737302","commentId":1737302,"userName":"ossderossmane","timestamp":1439650219,"content":"Ah thanks, must have missed that..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1788128","commentId":1788128,"userName":"Nickpes","timestamp":1441983115,"content":"At last played this today, tried it two times, both solo with a pure dunedain deck (well I had Hennemarth also in, the only non thematic ally) with lots of traps, scout or ranger cards etc. Heroes were Halbarad, Aragorn (Lore) and Beravor\n\n \n\n \n\nWon both of them, the first one much easier than the second (but lost Beravor on the first one). Had a lot of fun, I like the capture thing and how the plot goes. Traps and cards like Forest patrol and Ravens of the Mountain were of much help, impressed me since I had never used them before, I might change my mind on them.  :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]   . I always was chosing Halbarad to start with cause he can quest ready when engaged, very usefull early on. Ranger of Cardolain is a very strong ally and when I had sword that was broken on Aragorn then questing was very fast with Halbarad and a couple of his copies in game. \n\n \n\nI like more and more the Dunedains. They misse attachments that will boost them especially against strong enemies, but with their traps and events thay can do a lot of stuff, I though they would be a bit weak but have managed to win each quest of this cycle with them\n\n \n\nHave two questions though, \n\n \n\n- Aragorns refresh ability reduces threat to the starting threat of ALL heroes, not the one with whom I started the game, right ? (thus in my game, it turns my threat back to 32 and not 10). I guess this is the right way but I just want to be sure. \n\n \n\n- If I attach a Forest Snare on Jailor Gornakh, what happens after I rescue cards? Does his force action make him to attack or he cannot cause he has forest snare on him? I was not sure thus I did not try this\n\nEdited September 11, 2015 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1788366","commentId":1788366,"userName":"PocketWraith","timestamp":1441988685,"content":"> Have two questions though, \n> \n> \n> \n>  \n> \n> - Aragorns refresh ability reduces threat to the starting threat of ALL heroes, not the one with whom I started the game, right ? (thus in my game, it turns my threat back to 32 and not 10). I guess this is the right way but I just want to be sure. \n> \n>  \n> \n> - If I attach a Forest Snare on Jailor Gornakh, what happens after I rescue cards? Does his force action make him to attack or he cannot cause he has forest snare on him? I was not sure thus I did not try this.\n\nYes, you reset to 32. Technically you set your starting threat as normal before resolving the text of the first quest card, which is what sets your threat equal to the threat cost of the one hero you control. Your starting threat is thus still that usual, original starting threat, not the one you changed it to according to the quest card.\n\n \n\nAn enemy with a Forest Snare attached cannot attack. That effect encompasses any attacks, not just the normal combat phase attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1788414","commentId":1788414,"userName":"Nickpes","timestamp":1441989586,"content":"Thanks, I thought so on both occations but wanted to be sure "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1789330","commentId":1789330,"userName":"Ranger of the Force","timestamp":1442012746,"content":"> At last played this today, tried it two times, both solo with a pure dunedain deck (well I had Hennemarth also in, the only non thematic ally) with lots of traps, scout or ranger cards etc. Heroes were Halbarad, Aragorn (Lore) and Beravor\n> \n>  \n> \n>  \n> \n> Won both of them, the first one much easier than the second (but lost Beravor on the first one). Had a lot of fun, I like the capture thing and how the plot goes. Traps and cards like Forest patrol and Ravens of the Mountain were of much help, impressed me since I had never used them before, I might change my mind on them.  :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]   . I always was chosing Halbarad to start with cause he can quest ready when engaged, very usefull early on. Ranger of Cardolain is a very strong ally and when I had sword that was broken on Aragorn then questing was very fast with Halbarad and a couple of his copies in game. \n> \n>  \n> \n> I like more and more the Dunedains. They misse attachments that will boost them especially against strong enemies, but with their traps and events thay can do a lot of stuff, I though they would be a bit weak but have managed to win each quest of this cycle with them\n> \n>  \n> \n> Have two questions though, \n> \n>  \n> \n> - Aragorns refresh ability reduces threat to the starting threat of ALL heroes, not the one with whom I started the game, right ? (thus in my game, it turns my threat back to 32 and not 10). I guess this is the right way but I just want to be sure. \n> \n>  \n> \n> - If I attach a Forest Snare on Jailor Gornakh, what happens after I rescue cards? Does his force action make him to attack or he cannot cause he has forest snare on him? I was not sure thus I did not try this\n\nEach time you have mentioned this deck on the boards the more curious I am. Would you mind posting the deck list here or in the decks section?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1789555","commentId":1789555,"userName":"Nickpes","timestamp":1442019616,"content":"It is not always exactly the same, but more or less ...\n\nAragorn (Lore)\n\nBeravor\n\nHalbarad\n\nAllies (15)\n\n2 x Dunedain Watcher\n\n2 x East road Ranger\n\n1 x Henamarth Riversong\n\n3 x Ranger of Cardolan\n\n2 x Sarn Ford Sentry\n\n3 x Weather Hills Watchman\n\n2 x Warden of Healing (or you can use Athelas instead)\n\nAttachments (26)\n\n3 x A Burning Brand\n\n2 x Dunedain Mark\n\n3 x Dunedain Warning\n\n2 x Forest Snare\n\n2 x Poisoned Stakes\n\n3 x Ranger Spikes\n\n2 x Resourcefull ( or you can use Heir of Valandil)\n\n2 x Self Preservation\n\n2 x Steward of Gondor\n\n3 x Sword that was broken\n\n2 x Wingfoot\n\nEvents (9)\n\n2 x Forest Patrol\n\n2 x Ravens of the Mountains\n\n2 x Take no Notice\n\n3 x Tighten our Belts\n\nBut as i said there are orher cards i may use like Expert Trackers\n\nI am sure that it cannot stand heavy enemy quests, but the general idea is to have Sword the was broken on opening hand. Since you place it on Aragorn you can quest strong. Steward of Gondor goes on him too. Henamarth or Ravens of the Mountains help ready a hero with wingfoot and if you have resources you can change Dunedain Warning between heroes according to your needs. Burning brand is also important to save from shadow effects. I use Self Preservation cause since there are not many defencing possibilities there will be damage on heroes most of the time and healing is important. Always try to have enemy engaged to use Halbarads ability who also gets the Dunedain Mark attachment to attack\n\nAny thoughts?\n\nEdited September 12, 2015 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1790294","commentId":1790294,"userName":"Ranger of the Force","timestamp":1442061496,"content":"Thanks for posting the deck.\n\nJust a few observations. I haven't played it yet, but I am not sure you would need the Dunedain Watchers with the Burning Brands. Perhaps you could replace the Watchers with Son of Arnors, which would combo well with the Forest Snares, which I think I'd add another copy and replace the Resourcefuls with Heir of Valandils to get that combo going as well.\n\nI built something similar, but had Leadership Aragorn instead. It didn't reform all that well against Wastes of Eriador, but I thought the concept held promise, but perhaps yours is better.\n\nEdited September 12, 2015 by Ranger of the Force"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1790336","commentId":1790336,"userName":"Nickpes","timestamp":1442064377,"content":"In wastes of Eriador indeed i had Son of Arnor instead of dunedain watcher. It is just that if you need also Halbarad to defend then burning brand won't do the job.\n\nHeir of Valandil works only with allies, but yes it is also usefull, i have it as an option.\n\nLore Aragorn helps with threat reduction, thats why i prefer him"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1790478","commentId":1790478,"userName":"Ranger of the Force","timestamp":1442070206,"content":"That all makes sense. At some point I will give this a try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1790877","commentId":1790877,"userName":"leptokurt","timestamp":1442086088,"content":"> It is not always exactly the same, but more or less ...\n> \n> Aragorn (Lore)\n> \n> Beravor\n> \n> Halbarad\n> \n> Allies (15)\n> \n> 2 x Dunedain Watcher\n> \n> 2 x East road Ranger\n> \n> 1 x Henamarth Riversong\n> \n> 3 x Ranger of Cardolan\n> \n> 2 x Sarn Ford Sentry\n> \n> 3 x Weather Hills Watchman\n> \n> 2 x Warden of Healing (or you can use Athelas instead)\n> \n> Attachments (26)\n> \n> 3 x A Burning Brand\n> \n> 2 x Dunedain Mark\n> \n> 3 x Dunedain Warning\n> \n> 2 x Forest Snare\n> \n> 2 x Poisoned Stakes\n> \n> 3 x Ranger Spikes\n> \n> 2 x Resourcefull ( or you can use Heir of Valandil)\n> \n> 2 x Self Preservation\n> \n> 2 x Steward of Gondor\n> \n> 3 x Sword that was broken\n> \n> 2 x Wingfoot\n> \n> Events (9)\n> \n> 2 x Forest Patrol\n> \n> 2 x Ravens of the Mountains\n> \n> 2 x Take no Notice\n> \n> 3 x Tighten our Belts\n> \n> But as i said there are orher cards i may use like Expert Trackers\n> \n> I am sure that it cannot stand heavy enemy quests, but the general idea is to have Sword the was broken on opening hand. Since you place it on Aragorn you can quest strong. Steward of Gondor goes on him too. Henamarth or Ravens of the Mountains help ready a hero with wingfoot and if you have resources you can change Dunedain Warning between heroes according to your needs. Burning brand is also important to save from shadow effects. I use Self Preservation cause since there are not many defencing possibilities there will be damage on heroes most of the time and healing is important. Always try to have enemy engaged to use Halbarads ability who also gets the Dunedain Mark attachment to attack\n> \n> Any thoughts?\n\nI had a similar deck (same heroes) which worked pretty well against the TLR quests. I had Sneak/Gandalf , Faramir (you can get him quite easily once you have StwB on Aragorn) and I didn't use traps (beside Forest Trap, that is). I also had the side quests in my deck and used Aragorn as my main defender together with BB and Dunedain Warning. And I had Rumour from the earth to combo with Wingfoot.\n\n \n\nWhy didn't you include Descendant of Kings? That's an awesome card!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183372-mount-gram-spoilers-are-up-on-cardgamedb/?do=findComment&comment=1791189","commentId":1791189,"userName":"Nickpes","timestamp":1442094744,"content":"Indeed it seems good, but i have mount gram less than a week and havenot tried that card yet"}]}