{"url":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/","title":"Escape from Mount Gram tiny encounter deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/?do=findComment&comment=1705050","commentId":1705050,"userName":"Ecthelion III","timestamp":1437958327,"content":"I had a thought. The spoiled quest card 1A of Escape from Mount Gram instructs you to set aside the Angmar Orcs encounter set, which is the only secondary encounter set included, meaning the deck will only be made up of cards from the Escape from Mount Gram encounter set. This encounter set has 26 cards. Two of these 26 (Southern Gate and Jailor Gornakh) are set aside at the beginning of the quest. Thus, the encounter deck has only 24 cards in it at the beginning of the quest. That’s tiny!\n\n \n\nI know many people were complaining about the small encounter deck of The Nin-in-Eilph. What are your thoughts on this one?\n\nEdited July 27, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/?do=findComment&comment=1705105","commentId":1705105,"userName":"PsychoRocka","timestamp":1437963811,"content":"I actually had a game of Nin-in-Eilph the other night and had a really good time. Its a punishing quest but one I actually really enjoy in spite of its difficulty and small encounter deck. I actually lost on stage 4 after the Ancient Marsh Dweller decimated and killed two heroes and I was left with just a few attack points less than I needed to take it out that round of combat. The following turn one deck threated out and the other had nowhere near enough offense to take out the marsh dweller on its own. Will have to give it another go soon! Was doing so **** well till the marsh dweller appeared the second time too, got through stage 2 AND 3 without the marshland shifting (change of which copy of stage 2 or 3 you are on) once by exploring two copies of Hidden Eyot early on and smashing through stage 2 and then having quite built up forces ready to blast through stage 3. \n\nANYWAY back to the topic and the point I'm trying to make.\n\nA small encounter deck does not necessarily mean a bad quest. I feel like Nin-in-Eilph more or less makes up for the small encounter deck by having the various different stages for both stage 2 and 3 and the different effects these stages can have. Similarly I believe the whole capture mechanic and fact you start with SUCH a different player deck (most of it removed and set aside as your capture deck) and only one hero will make this new quest awesome even with a small encounter deck. \n\nI imagine that after you advance to the second (perhaps third but I doubt it) stage or perhaps simply after rescuing your second hero or a certain amount of player cards the Angmar Orcs encounter set is shuffled into the encounter deck so it will only be the early part of the quest that only features 24 cards. Also with only one hero (potentially two), no ability to play allies and muster willpower without first rescuing them from encounter cards with the capture keyword and only events and non-item mount or artifact attachments in your starting deck I think they really need the quest to be very tame at the start allowing you to stand a chance even with just one hero. If Angmar Orcs was in the encounter deck to begin with I think there would be many bad starts you would not be able to come back from. For example if you had Orc Ambush (side quest) appear within the first turn or two while you still have one hero I think you would be completely screwed. The Marauder and Captain with their 3 threat would also be quite hard to deal with willpower wise on the first few turns. I suppose you do have a very low starting threat however so would not need to engage such foes unless you wanted to so perhaps this is not quite as bad as I am imagining but I think you get the point I am trying to make.\n\nLastly it will definitely have a few more cards than Nin-in-Eilph once the Angmar Orcs encounter set is added to the encounter deck. Nin-in-Eilph is only 22 base cards and 7 in the weary travellers encounter set so a total of 29. Escape from Mount Gram has 24 base cards and 9 cards in the angmar orcs encounter set so a total of 33 which is a total of four more encounter cards in the encounter deck. Definitely not many more but this does make a difference. I think this, the fact there will be so much going on in regards to the capture mechanic and the fact you start with just one hero will stop the small encounter deck from being an issue and will keep the quest from being one with little replay value. I think the opposite in fact and because even with the same decks you can choose a different starting hero each time and will also have very different captured cards getting rescued each game this quest is sure to be one with plenty of replay value. We will only know when we get our hands on it however! Very good topic though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/?do=findComment&comment=1705166","commentId":1705166,"userName":"Ecthelion III","timestamp":1437969846,"content":"I'm not as worried about it being a bad quest as I am worried about it being one with little replay value. The single hero mechanic will help a lot though, you're right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/?do=findComment&comment=1705236","commentId":1705236,"userName":"tricil","timestamp":1437985132,"content":"Sounds like the perfect quest for Ranger Summons. Come and rescue us!  :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183331-escape-from-mount-gram-tiny-encounter-deck/?do=findComment&comment=1705436","commentId":1705436,"userName":"Ecthelion III","timestamp":1438005245,"content":"> Sounds like the perfect quest for Ranger Summons. Come and rescue us!  :-)\n\nAlso a perfect quest for the new Lore victory display mechanic. Plus, most of those cards are events, which aren't captured."}]}