{"url":"https://community.fantasyflightgames.com/topic/183461-contradicting-rulings-between-caleb-and-caleb/","title":"Contradicting rulings between Caleb and Caleb","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183461-contradicting-rulings-between-caleb-and-caleb/?do=findComment&comment=1707001","commentId":1707001,"userName":"Ecthelion III","timestamp":1438101602,"content":"The question is whether or not a player is eliminated after his last hero is shuffled into his deck by Lost and Alone.\n\n \n\nHere (http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page__st__20#entry11400 [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page__st__20#entry11400]) it says:\n\n \n\nQ: Is a hero shuffled into deck by Lost and Alone considered to be \"dead\" for scoring purposes, or for the purpose of eliminating a player if that is his last hero?\n\nA: A hero shuffled back into the deck is not dead unless the effect that shuffled him in the deck says he is dead. If that was your last hero in play, however, you would be eliminated from the game at that time.\n\n \n\n \n\nI personally asked Caleb a while back, and he quoted FAQ. He said:\n\n \n\nQ: The core rulebook states that a player is eliminated from the game \"if all of his heroes are killed, if his threat level reaches 50, or if a card effect forces his elimination\" (pg. 22). The card \"Lost and Alone\" (Dwarrowdelf 124) from the Foundations of Stone pack requires you to shuffle a hero into your deck. If this is your last remaining hero, would you be eliminated? I think so, but the hero was not killed by enemies. If I'm wrong and you're not eliminated, you could potentially take every attack undefended and not have to deal any damage (and break the game). So do you lose the game if all of your heroes \"leave play\", or just when they're all \"killed\".\n\n \n\nA: From our FAQ: “If your last hero gets shuffled into your deck you are not eliminated from the game; heroes are not considered to be killed unless they are in your discard pile. You will continue playing until you either draw the hero, are eliminated through other means, or the game ends.” You are correct that you could take attacks undefended and suffer no damage, but you are also restricted to the cards you have in play because you have no resources to spend and no resource match to even play 0 cost cards.\n\n \n\nWhich one is right?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183461-contradicting-rulings-between-caleb-and-caleb/?do=findComment&comment=1707038","commentId":1707038,"userName":"Teamjimby","timestamp":1438103212,"content":"One is from a 2012 forum post and the other is from the current FAQ.  The FAQ takes precedence, although that is a very interesting ruling.  Get a few of the Dunedain allies in play, get your last hero shuffled into the deck, then engage as many enemies as possible taking them all undefended."}]}