{"url":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/","title":"The Narrative for this game so far (STORY SPOILERS!)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1706436","commentId":1706436,"userName":"PsychoRocka","timestamp":1438065996,"content":"I decided to compile the entire narrative so far into one piece of text. I will have headings for each part of the narrative to show which quest the text comes from for reference. I will be doing this a cycle at a time so it may take a few days and will be incomplete for a little while so bear with me!\n\nAlso I will NOT be including quotes from the various books that are used as flavour text on quest stages (example stage 1B from passage through mirkwood) as they are not part of the games narrative and rather quotes from the existing narratives this game is based upon. \n\n \n\n \n\n          LORD OF THE RINGS LIVING CARD GAME NARRATIVE SO FAR:\n\n \n\n                                                 CORE SET + MIRKWOOD\n\n \n\nShadows of Mirkwood\n\nMirkwood has long been a dangerous place, and recently one of King Thranduil’s patrols has uncovered disconcerting signs of a gathering menace in the vicinity of Dol Guldur. A party of heroes, controlled by the players, has been assembled to carry a message through Mirkwood, down the Anduin, and eventually to Lórien, to warn Lady Galadriel of the imminent danger.\n\n \n\nYou are traveling through Mirkwood forest, carrying an urgent message from King Thanduil to the Lady Galadriel of Lorien. As you move along the dark trail, the spiders gather around you...\n\n \n\nAs you move through Mirkwood, hounded by spiders, the forest path forks before you...\n\n \n\nUnsure of what lies ahead but spurred by the urgency of your message, you choose a path and proceed... \n\n \n\nThe trail winds into one of the darkest, most tangled parts of the forest...\n\nYou sense that a foul, dark prescence is hunting you, and you move quickly in an attempt to avoid its evil. \n\n \n\nYou attempt to follow a secret, hidden trail to avoid the enemy.\n                                                                    -OR-\n\nThe shadows grow darker, and you realise that a foul presence is aiming to draw you from the path. You must defeat it to pass this way.\n\n \n\nJourney along the Anduin\n\nHaving survived the dangers of Mirkwood Forest, the heroes continue their journey along the banks of the Anduin river, toward Lórien, with dire news of a gathering threat in Southern Mirkwood.\n\n \n\nEmerging from Mirkwood Forest with an urgent message for Lady Galadriel, you must now make your way south along the Anduin River in order to reach the forest of Lorien. As you leave the forest behind, you notice that you are being pursued , and thus quicken your pace....\n\n \n\nAs you approach the location of a small raft stashed on the riverbank, a fearsome Hill Troll emerges from behind a grouping of rocks, and attacks! \n\n \n\nAfter defeating the Hill Troll, you are able to board the raft and embark upon a river voyage. As you depart, your enemies pursue, harassing the small vessel as you attempt to navigate the river...\n\n \n\nAs your enemies harass the raft, it is difficult to maintain balance and effectively fight them off.\n\n \n\nThe ongoing harassment from your enemies has forced your raft to the shore, and you must now confront their ambush head on. If you survive this attack, the path to the Golden Wood should be open before you....\n\n \n\nEscape from Dol Guldur\n\nWhile exploring in the vicinity of Dol Guldur at Lady Galadriel's request, one of the heroes' companions is captured by the Necromancer's forces, and is now awaiting interrogation in a dungeon beneath the hill. Knowing their friend's time is short, the heroes decide to attempt a desperate rescue.\n\n \n\nThe Lady Galadriel of Lorien has asked you to investigate the area in the vicinity of Dol Guldur. While doing so, one of your allies was ambushed by Orcs, captured, and is now held in a dungeon cell...\n\n \n\nFinding a hidden entrance to the dungeons of Dol Guldur at last, you attempt to make your way through the caverns beneath the hill, searching for your imprisoned friend. The denizens of this labyrinth stand in your way, while the jailors protect the prisoner. \n\nFollowing a thread of sunlight, you discover a cavern opening, leading out through the side of the hill. Stationed outside the cave-mouth, however, is a large group of orcs \n \n\nThe Hunt for Gollum\n\nAt the request of Gandalf, the heroes are searching for Gollum in the Anduin Valley between the Misty Mountains and Mirkwood forest. Rumours have suggested that Gollum is in this area, and the heroes are looking for clues that might put them on the elusive creature's trail. \n\n \n\nGandalf has requested your assistance in the search for the elusive creature known as Gollum. Your search begins in the Anduin Valley between Mirkwood Forest and the Misty Mountains. \n\nYou make your way along the banks of the Anduin River, a likely place for Gollum to find food. \n\n \n\nRumors have led you to the eaves of Mirkwood Forest, where the Woodmen whisper of a new terror in the night...\n\n \n\nConflict at the Carrock\n\nWhile searching for Gollum along the banks of the Anduin, the heroes hear rumours of a group of Trolls that have come to the Carrock, bringing chaos and strife to the valley. The Beornings, led by Grimbeorn the Old, are known as the peacekeepers in the area, so the heroes set out to find Grimbeorn and assist him in driving the intrusive Trolls back to the mountains from which they came. \n\n \n\nWhile searching for Gollum in the Anduin Valley, you receive word that a group of Trolls have come to the Carrock.\n\n \n\nAs this area is is under the watch of the Beornings, you seek out their leader, Grimbeorn the Old, and discover he has already set out in a rage. You follow, hoping to find him before he confronts the trolls.\n\n \n\nYou approach the Carrock, and find that the Trolls have been watching you from the top of the rocky river landmark. \n\n \n\nAs you approach, the trolls close in and attack! \n\n \n\nA Journey to Rhosgobel\n\nWhile travelling in the Anduin Valley, the heroes come across a fallen Eagle, dreadfully wounded from a recent battle with Goblins, and on the verge of death. Given their location, the heroes attempt to transport the Eagle to Rhosgobel, on the edge of Mirkwood, in the hope that the wizard Radagast can save the Eagle’s life.\n \nAfter a fierce conflict with a group of Trolls, you come across a fallen Eagle, grievously wounded and on the verge of death...\n \nThe Eagles wounds cannot be tended in the wilderness, so you attempt to bring the creature to Rhosgobel, where the wisdom of Radagast the Brown may be its only hope.\n \nThe Eagle's health has grown worse, but you have at last arrived at Rhosgobel, where Radagast examines the bird. He then asks you to head out into the wilderness to find the healing plant, Athelas. Meantime, any healing lore or supplies your party has it its disposal could be used to assist in comforting the Eagle until you return.\n \nFeeling that time is running out on Wilyador's life, you gather the Athelas you have found and head back to Rhosgobel. You arrive at night, wondering if you have found enough of the herb...\n \nThe Hills of Emyn Muil\nPursuing Gollum to the south, the heroes were led to the hills of Emyn Muil, but there the leads grew cold. Somewhere in this region, Gollum is hiding, and the heroes must explore carefully to regain the trail and resume pursuit.\n \nThe hunt for Gollum has led you to the South, and you are now approaching Rauros Falls and the nearby hills of Emyn Muil...\n \nYou are certain that Gollum has fled into this area, and you must explore until you find the fresh trail. \n \nThe Dead Marshes \nAfter regaining his trail in the hills of Emyn Muil, the heroes have tracked Gollum to The Dead Marshes, into which he has fled in a last ditch effort to avoid pursuit. Feeling that the hunt is coming to a close, the heroes enter the treacherous marshlands, ready to capture the creature alive.\n \nYou have followed Gollum's trail for days, and are now closing in fast pursuit. In a last ditch effort to escape you, the creature has fled to The Dead Marshes.\n \nAfter a tiring pursuit through the treacherous marshland, you have cornered Gollum, and move in for the capture.\n \nReturn to Mirkwood\nAfter cornering and capturing Gollum in The Dead Marshes, the heroes must now escort the creature north, through Mirkwood forest, so that he can be held and interrogated at King Thranduil’s palace. The journey will not be easy, however: Mirkwood is always a dangerous place, the Dark Lord’s forces are eager to take Gollum for their own purposes...and Gollum himself is eager to escape.\n \nHaving captured Gollum, you must now escort him through Mirkwood Forest for interrogation at Thranduil's Palace.\n \nMirkwood is always a dangerous place, but it is even worse with Gollum. Between the outbursts, tantrums, and the flying provisions, you are not afforded a moment's peace.\n \nAs soon as he thinks that no one is watching, Gollum attempts to slip his bonds and escape.\n \nHaving thwarted Gollum's escape attempt, you tighten his rope and push on through Mirkwood, to Thranduil's palace.\n \nAs you make the final push to Thranduil's Palace, your enemies make a desperate attempt to ambush your party, and seize Gollum for themselves.\nEdited August 8, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1706451","commentId":1706451,"userName":"PsychoRocka","timestamp":1438067133,"content":"KHAZAD-DUM + DWARROWDELF CYCLE\n\n \n\nInto the Pit\nThe heroes enter the mines of Moria at the behest of the White Council, carrying an important message to Balin. Balin recently led a group of Dwarves back into Moria to establish a colony in the ancient halls of his ancestors. He has not been heard from in some time. \n \nYou have been sent by the White Council to Moria, to deliver a message to Balin and his Dwarven colony. No one has heard from him in a while.\n \nThe doors of the East-gate hang crooked on their henges. The darkness inside the doorway is still and impenetrable, shutting out the last beams of a sinking sun.\n \nThe skeletons of Dwarves and Orcs lie undisturbed, but you have discovered no recent sign of the Dwarven colony. The sound of scampering feet travels to your ears, and you move in that direction to investigate. There is a patrol of Goblins, marching in a loose formation through the shadows.\n \nYou have captured a member of the patrol, and press the wounded Goblin for information about the Dwarves. It gives a nasty laugh, and with a mouthful of blood spits out \"Balin can be found in the chamber of records!\". It can say no more. \n \nThe Chamber of Records is is on the Seventh Level of Moria. The way up is treacherous, and you are accompanied by a sense of unease and vague dread. \n \nThe Seventh Level\nBased on information from a dying Goblin, the heroes have made their way to the Seventh Level of Moria, still searching for any signs of Balin’s colony. The Seventh Level holds the Chamber of Records, and it is there that the Goblin said they would find Balin. An ancient tome also seems to hold clues as to the where-abouts of the colony.\n \nYou are investigating the Seventh Level of Moria, searching for the Chamber of Records and any sign of Balin's colony. In the heavy twilight of a hall, a bulky tome is discovered in the grip of a Dwarf skeleton. You carefully take possesion of the book. Perhaps it will give you some answers...\n \nThe Dwarven runes of the book appear to hold a detailed record of the fledgling colony. But there is some Elvish script at the end which seems out of place...\n\n \n\nYou have discovered the Chamber. Before you lies the resting place of Balin, last Lord of Moria. The final portion of the book tells the grim tale - Balin was slain in the Dimrill Dale, and the Dwarves were then trapped in the mines. It seems as if there are no survivors. You stand silently by his tomb, but cannot tarry. Orc war cries and horns sound close. You leave the cumbersome book as a testament to the Dwarves' valor, and prepare to fight your way out, lest Balin's fate becomes your own...\n\n \n\nFlight from Moria \n\nBalin’s colony ended in death and darkness. After paying their respects at his tomb, the heroes fought their way out of the Goblin infested Seventh Level and made their way down toward the gate. But exiting Moria will not be easy, for a shadowy form masses at the end of the hall, and fear and terror go before it. The heroes must escape Moria before it is too late.\n \nYou have discovered the fate of the Dwarven Colony, and seek to leave Moria. But exiting may not be as simple as entering... \n \nAs you leave the Seventh Level, the air grows thick and drums begin to roll from the deeps. A man-shape shadow, yet greater, masses at the end of the hall, and begins to head straight for you. \n \nAs the presence draws near, doubt and fear surround you like a vast shadow. You must find daylight, you must escape from the Black Pit...\n \nThe Redhorn Pass\nArwen wishes to visit her father Elrond, and Celeborn has bid the heroes to escort her over the Misty Mountains and safely to Rivendell. But the season grows late, and a sudden chill has descended on the three peaks that guard the Redhorn pass.\n \nCeleborn has bid you escort Arwen to visit her father in Rivendell. Your journey takes you through the Redhorn Gate...\n \nProgress slows as you meet the fury of the mountains. Sudden snows fall heavy around you, and a bitter wind howls down from the peaks. You uncover a shallow depression in the snow, filled with frozen remains. Some of them bear strange markings, as if they had been burned with flame. How many other doomed souls lie beneath the quickly rising drifts?\n \nThe mountain peaks are almost in reach, but the swirling snows make it difficult to see, and your strength begins to drain away with the daunting final push to the pinnacle. \n \nRoad to Rivendell\nThe heroes continue their journey northward to Rivendell, escorting Arwen to visit her father Elrond. But the road is long, and Orcs ambush the party along the way. With enemies hounding the heroes’ steps, the weather drives the party ever closer to the looming mountains, and the dangers they hold.\n \nYour party has braved the snows of the pass, but now must travel North along the Misty Mountains for league upon league as you escort Arwen to her father's house. \n \nThis is a wild and perilous country, and it is dangerous to follow the roads. The mountains rise up on the right, impassively watching your slow trek among their foothills.\n\nHeavy rain drives you to seek shelter among the caves of the mountains. They are dry, and the fire you start seeps into your bones and restores your spirit. Your eyes are heavy when teh soft clatter of falling pebbles reaches your ears. Perhaps you are not alone.\n \nOrcs and other creatures have hounded you since fighting your way free of the orc outpost. Soon you will reach the safety of Rivendell's borders, but supplies have dwindled and you are dead weary from sleepless nights of keeping watch, as dark forms shadow your camp.\n \nThe Watcher in the Water\n\nElrond is disturbed by the report of Arwen's journey to Rivendell. He has requested that the heroes discover the source of the increased Orc activity along the Misty Mountains. This mission has led the party South to Moria, but the Doors of Durin are blocked by a deep, dark lake. As the heroes make their way around its waters, an ancient evil stirs from within its depths. A desperate battle begins, and the heroes must drive the creature away or find safety in the mines.\n\n \nElrond has asked you to scout the Mines of Moria on your return to Lorien, hoping to discover if it is the source of increased Orc activity along the Misty Mountains.\n \nYour approach is blocked by a dark lake that slumbers beneath the face of the cliff. You must search for a way around the water.\n \nThe Doors of Durin are blocked by an ancient spell. You must figure out a way into the mines before the Seething bog and its Watcher consumes you all.\n \nThe Long Dark\nThe Mines of Moria are a dark labyrinth of narrow tunnels and wide passages, natural caves and impressive caverns of Dwarven workmanship. The heroes must make their way eastward, discovering what they can about the Orcs, and perhaps even meeting up with Balin for more information. But it is easy to get lost in the darkness...\n \nYour party is scouting the Mines of Moria, searching for signs of Orcs. Dark tunnels and twisting passages spread out in all directions, a labyrinthine maze that you could wander in forever if you take the wrong path.\n\n \n\nTime carries no weight in the darkness, and the hours creep by with no end in sight. The number of Orcs in the mines increase as you head toward the East-gate, but there appears to be little real organization within their ranks. You press onward!\n\n \n\nFoundations of Stone\n\nThe walls are weeping water, and the air grows damp. A low rumble sounds from above, accompanied by the sound of rushing water. There are underground waterways in Moria that lead to deep darkness, and who knows what else...\n\n \n\nYour journey has led to a decrepit portion of the mines, untouched by Dwarven pick for many a year. The air grows thick with moisture, and the walls almost appear to be weeping.\n\n \n\nA low rumble sounds from below. There are a variety of underground waterways in Moria, but they should not be disturbed.\n\n \n\nSmall rivers cut their way across your path. Some are not much more than a trickle, and recent looking too. Another rumble shakes the walls, this time it seems to be above you.\n\n \n\nWith a groan the ground crumbles under your feet, the entire section of the tunnel giving way to a deep darkness and the rush of water. There is a feeling of weightlessness, followed by the icy wet clutches of an underground river.\n\n \n\nThe shaft shoots upwards, the glimmering lines of mithril illuminating your way out of the depths of the mountain. The makeshift ladder is narrow, but you cannot linger in the realm of those things of darkness, who gnaw at the roots of the world.\n\n \n\nShadow and Flame\n\nThe heroes have escaped from the darkness below the mines, and find themselves in the Third Deep, near the East-gate. But as Orcs begin to swarm, a foe more terrible towers before them. Durin's Bane has risen from the depths, to stalk the halls of the Dwarves once more...\n\n \n\nAs you reach the eastern realm of Darrowdelf the craftsmanship of the Dwarves is proudly displayed. But the sound of drums sound in the deep, and it appears that these halls are infested with Orcs.\n\n \n\nA crack like lightning sounds before you, and a creature of shadow and flame blocks your way. It is an ancient demon of Morgoth, and its presence explains the massing in Moria.\n\n \n\nThe fire-demon is Durin's Bane, doom of the Dwarves and the new Lord of Moria. It cannot be destroyed by mere strength of arms. You must find another way to deal with this Balrog as it relentlessly attacks, sword and whip weaving a deadly pattern of flame.\n\n \n\nThere is a crumbling pile of boulders on the edge of a teetering cliff, and it gives you a sudden idea. There are chasms and pits along the path you are traveling, and perhaps a well-timed rockslide could send the Balrog down into the depths below...\n\nEdited August 8, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1706452","commentId":1706452,"userName":"PsychoRocka","timestamp":1438067148,"content":"HEIRS OF NUMENOR + AGAINST THE SHADOW CYCLE\n\n \n\nPeril in Pelargir\n\nThe shadow of Sauron has risen with increasing violence against the kingdom of Gondor. Our heroes have travelled southeast by ship from the Grey Havens at the request of the White Council, ready to aid the descendants of Númenor in their defense against the forces of Mordor. Upon reaching the port of Pelargir, they are greeted by Lord Alcaron, a nobleman from the city of Minas Tirith. Lord Alcaron has urgent information for Faramir, but he is frightened that the Enemy is after him. He asks the heroes to deliver a scroll to Faramir. The heroes agree when a band of ruffians appear, intent on intercepting the message...\n\n \n\nThe White Council has sent you by ship to Gondor to help fight the threat of Mordor. Upon arrival in the port city of Pelargir, you are greeted by Lord Alcaron who takes you to The Leaping Fish where you can speak privately.\n\n \n\nInside the tavern, Lord Alcaron looks nervously toward the door as he hands you a scroll bearing the seal of Gondor. He asks that you deliver it to Faramir in Ithilen, but the brigands who just entered look intent on taking it from you.\n\n \n\nDuring the fight in the tavern, one of your adversaries managed to grab Alcaron's Scroll and flee outside. You chase the thief into the street where you are surrounded by a gang of his fellow brigands. You must fight your way through the mob and recover the scroll!\n\n \n\nYou've recovered the scroll but are still outnumbered by your determined foes. Lord Alcaron shouts for you to escape and deliver the scroll before he flees to summon the city guard. If you can get to your ship, you can escape the clutches of these desperate thugs...\n\n \n\nInto Ithilien\n\nHaving reached the eaves of Ithilien, our heroes enter the green woodlands in search of Faramir, seeking to deliver to him the scroll of Lord Alcaron. There they are met by Celador,  a ranger of Gondor, who informs the heroes that Faramir has taken his men to Cair Andros in anticipation of an assault against the island fortress. Celador offers to bring the heroes to Cair Andros by secret paths–after the rangers ambush a company of Southrons marching north on the Ithilien road. Grateful for Celador’s offer and unable to stand by while his men do battle, our heroes volunteer to fight alongside his rangers..\n\n \n\nYou've arrived in Ithilien with a sealed message for Faramir, only to learn that he has gone north to defend Cair Andros from massing enemy forces.\n\n \n\nFaramir has left a company of rangers in Ithilien, tasked on ambushing Southrons as the march toward Cair Andros. Their captain, Celador, offers to lead you to Cair Andros after the approaching enemy is destroyed...\n\n \n\nThe Southron army was larger and better prepared than the rangers anticipated, and now your dwindling company is painfully overmatched. Your only option is a disciplined withdrawl to Cair Andros, before being overwhelmed by the enemy reinforcements hurrying up the road to join the fight.\n\n                  -OR-\n\nHaving helped his rangers scatter the first wave of Haradrim invaders, Celador leads you north along a hidden trail that runs through Ithilien. But more Southrons are marching up the forest road. Now it is a foot race to reach Cair Andros before the enemy...\n\n \n\nThe island fortress of Cair Andros rises from the middle of the Anduin. From a distance all is quiet, but as you near the island and night approaches a raucous cry is heard on the wind. The horns of Mordor sound in response. The enemy is moving on Cair Andros, and the assault will soon begin. You must reach it before all hope is lost.\n\n \n\nThe Siege of Cair Andros\n\nThe island fortress of Cair Andros guards Gondor’s northernmost causeways over the Anduin. Our heroes\nreach the causeway and enter the fortress as skirmishers appear on the eastern shore. They find Faramir in the Citadel, and deliver to him the scroll of Lord Alcaron. Drums are heard, and horns, and the tramping of many feet. An army of Orcs and Southrons prepare a three-pronged assault, and the heroes gird themselves for battle. For if Cair Andros falls, the doom of Gondor is nigh...\n\n \n\nThe island fortress of Cair Andros, which guards Gondor's northernmost causeways over the river Anduin, is under siege! Battering rams rumble up the eastern causeway and rafts filled with Orcs float across the river toward the lightly defended northern banks.\n\n \n\nThe assault is relentless, and the defenders grow weary. The tide is slowly but surely turning against you...\n\n \n\nAs smoke and rending cries fill the air, rafts of Orcs beach their crafts all along the northern banks. You must reach the shore and drive them back into the river before a solid foothold can be established.\n\n -AVOIDED IF YOU CLEAR THE BANKS-\n\n \n\nWith a crashing boom the eastern gate shatters. A ram has broken through, and the pressing host of Orcs pour into the courtyard beyond. Engage them in hand-to-hand combat and secure the gate!\n\n-AVOIDED IF YOU CLEAR THE APPROACH-\n\n \n\nOrc scramblers have infiltrated the island and climbed over the walls. They fought to the western gate, and the gate fell. Now a new host of enemies that were lying in wait are breaching the Citadel itself!\n\n-AVOIDED IF YOU CLEAR THE CITADEL-\n\n \n\nThe defenders of Cair Andros have survived brunt upon brunt of the enemy's assault, but the outcome of the battle hangs on the edge of a knife. One last heroic effort is required to save the fortress and win the victory...\n\n \n\nThe Stewards Fear\n\nThe heroes arrive in Minas Tirith with news of victory at Cair Andros and a message for Lord Alcaron from\n\nFaramir. Upon arriving at the city, they learn that Lord Alcaron is traveling on important business north\nin Anórien. Even so, the heroes are soon furtively summoned to the White Tower by none other than\nDenethor, the Steward of Gondor himself. Word has come to Denethor of the heroes’ bravery in the defense of Cair Andros, and he’s learned the heroes have the confidence of Lord Alcaron. In Denethor’s mind, such trusted new arrivals are perfectly suited for a special task of a clandestine nature. In the privacy of the Steward’s inner chambers, Denethor asks the heroes a delicate favor. He fears that a conspiracy has taken root within the walls of Minas Tirith: a cabal under Mordor’s bidding that seeks to usurp the stewardship and deliver Gondor to Sauron. He asks that the heroes discover the truth of this matter... \n \nEven as foes mass from without, the Steward of Minas Tirith fears there are enemies within. You have been asked to investigate the possibility of a conspiracy within the White City...\n \nYou begin your investigation at The Fourth Star, a popular tavern...\n \nYou have uncovered crucial information about the dissident plot, and even gleaned hints of the conspirator's secretive leader. Clues have led you to a cavern deep in the heart of Mount Mindolluin. As you descend into the ancient rock, you begin to suspect the clues that led you here may have been misleading... that you may have been lured away from the city streets for a purpose.\n \nYou have unmasked the conspiracy and its champion is upon you. The wheels of treachery are in motion, and only a heroic effort can stop the cabal's plan in time...\n \nWith the champion of the cabal destroyed and the conspiracy seemingly vanquished, Denethor's relief was palpable and his reward substantial. Yet, as the White City resettled into tentative content, a quiet unease remained with you. Subtle clues had not been reconciled, and certain witnesses were no longer to be found. Despite the undeniable power of its defeated champion, the ambition of the conspiracy had seemed greater still.\nDuring the weeks that followed, you probed quietly for additional answers. Little by little, you made progress until you suddenly found yourselves near the heart of the darkness. Like a viper trapped in its nest, coiled and venomous, the hidden mastermind, who indeed had survived, launched a desperate strike on our heroes. But as so many foes before them, the assassins from Harad were unsuccessful.\nWith his champion defeated, his best killers dead, and his identity on the cusp of being unveiled, the secretive servant of Mordor chose instead to escape the city with his few remaining retainers.\nUpon learning that his shadowy nemesis still drew breath, Denethor urged the heroes to take up the pursuit. And so your hunt began, equipped with fast horses and the seal of the Steward. Unfortunately, the secretive villain had a substantial lead. and you found yourself following his shrewd course for near a fortnight.\nLeading north and then westward along the foothills of the mountains, the enemy's trail has taken you to the edge of the Drúadan Forest, a wild place with a reputation for danger...\n \nThe Druadan Forest \nThe heroes have unmasked a dangerous conspiracy within the walls of Minas Tirith, but the nameless mastermind of the cabal managed to escape the city before his true identity was revealed. At the request of Denethor, the heroes have pursued the clever villain and his henchmen northward. The conspirators’ trail has lead them north beyond the Rammas Echor, and then west to the doorstep of the Drúadan Forest, an ancient land with a hostile reputation. Now our heroes move to track their quarry among its ancient trees and strange stones... \n \nThe leader of the underworld cabal from Minas Tirith has fled with his remaining henchmen. You have followed his trail to The Drúadan Forest, hoping to bring the nameless villain to justice.\n \nThe Drúadan Forest is a wild and dangerous place. It is said that Woses, reclusive forest dwellers, still reside among the trees. You wonder if your quarry has considered the dangers of this course.\n \nAs you move deeper into the forest, the wilderness quickly swallows all trace of civilization. Pushing through a dense patch of undergrowth, you came upon a dark and tangled grove. The scent of death strikes you.\n \nIn the grove, the fleeing traitors lie slain, pierced by poisoned arrows. As you search the pain-wracked corpses for the body of their leader, the ominous echo of drums begins to sound among the trees. You desperately begin to retrace your steps from the woods, lest the fate of the traitors becomes your own.\n \nYou sense that the edge of the forest must be near at hand, but Woses are master huntsmen and a band of them block your path. your situation seems hopeless: there are simply too many of them. As they begin their attack, you realize your only hope of survival is to convince the Pukel-men that you are not their enemy.\n \nThe small rough hands of Drû-buri-Drû gently touch yours in friendship. His eyes are sad for those lost in the needless skirmish.\n\"Drû-buri-Drû shall remember that not all Tall Men would be enemies,\" he rumble, his voice bringing to mind roots in old earth and stones in deep rivers. \"Drû-buri-Drû shall tell Ghân-buri-Ghân that there are some Tall Men who would touch the Wild Men in ways other than steel.\"\nThe small man gives you a final look of appraisal and then barks a command to his kin. The Woses begin to blend into the silent obscurity of the forest. Drû-buri-Drû moves to follow, but turns a last time before the forest absorbs his prescence.\n\"There is a bad smell in the air,\" he observes as his face tilts to glance at the eastern sky. \"Môr-sari-Môr says there are bad years coming for both Tall Men and Wild Men.\" He raises his hand in farewell and then he is gone. You find yourselves alone with the grey rocks and the ancient canopy of the Drúadan once more. Muffled in the distance, you hear the voice of Drû-buri-Drû faintly lift above the forest murmur, \"May you stand against the Shadow.\"\nRelieved and tired, you emerge from the forest. You are glad to be alive, and satisfied to have seen the end of the conspirators. With the Drúadan behind you, you make your return eastward and southward to Minas Tirith.\nOn the morning of the second day, you wake to multiple columns of smoke trailing into the eastern sky. Farmsteads and towns of Anórien are burning. Evil has come to the lands north of the Rammas Echor, and its people will be in need of help...\n \nEncounter at Amon Din\nHaving escaped from the Drúadan Forest and witnessed the demise of the conspirators by the arrows of the Woses, the heroes have begun their journey back to Minas Tirith. In the morning of the second day, they awoke to a grim sight. Dozens of columns of smoke were rising across the hilly farmlands of Anórien. It seems death had crossed the Anduin after all. As our heroes warily approached the nearest of the fires, they came upon two farmers hiding in the hedges. The frightened bondsmen told of roving bands of orcs scouring the countryside, bringing destruction to the defenseless herdsman and farmers of the surrounding lands. They told of a particularly cruel group that assaulted the nearby village during the night. They feared the villagers were dead. Approaching the village, the heroes saw signs that the citizens may not have been completely helpless. Several orc bodies lay crumpled in the streets, and a crude barricade of horse carts and earth-covered hay bales protected the town’s inner square. Only the buildings on the outskirts of the town seemed to be sacked and burning. As the heroes approached the barricade, the villagers eyed them suspiciously, their expressions wavering between mistrust and hope of assistance. Smoke lay in a thick haze in the streets, reddening eyes and shortening tempers. What appeared to be a nobleman and his escort of guardsmen were helping the villagers with the defenses and in caring for the wounded and burned. They seemed haggard and tired from the night’s fighting. As the heroes approached, the sooty and weary nobleman squinted through the acrid haze at the newcomers, his hand moving to his sword. Then, as a faint gust of wind cleared the air for a moment, the nobleman broke into a wide grin of recognition. It was non other than Lord Alcaron. “Out of the west comes hope unasked for,” he called. “May I be the first to say that you are well met indeed!” After a brief greeting, Lord Alcaron grimly told the heroes of the plight into which they had fallen, and how he had been sent northward about a month ago on the realm’s business. Denethor had deemed it wise, in case Cair Andros should fall, to raise the levy of Anórien and prepare for the evacuation of the northlands to the safer side of the Rammas Echor. Upon receiving news of the victory at Cair Andros, Alcaron disbanded the levy, and for the past week or so has been seeing to the Stewards’ business in the region. “Alas” he grimaced, “even as the the victory of Cair Andros held back the tide of Mordor, the defeat must have left a substantial number of the enemy trapped on the western side of the river.” Alcaron sighed, “One would think those vile creatures would seek to return to their master by any means possible.” “No such luck. Instead they’ve come west to punish the local countryside, burning and murdering where they go”. Alcaron went on to tell of how the roads of Anórien had quickly become far too dangerous for traveling. Even with an armed escort, Alcaron was forced to seek the tenuous security of the present village. “A large group of the enemy has descended on the lands surrounding the Amon Dîn,” he continued, gesturing at the great hill that dominated the northern skyline. “They’re led by a particularly nasty captain who calls himself Ghulat.” He spat out the ugly name and pointed at the barricades. “We barely held them here last night. I don’t think they were expecting any resistance.” “The enemy will not make that mistake again.” Alcaron wearily glanced at a group of tired villagers leaning against a nearby wagon, armed with harvesting scythes and hayforks. “I didn’t like our chances of surviving another night.” He turned to the heroes, a wide smile breaking across his sooty face. “Now that you’re here, I find cause for hope. Maybe we’ll save this village yet. What do you say?”\n \nEmerging from the Druadan Forest with news of the conspirators' demise, you begin your journey to Minas Tirith. As you wake the following day, you see dark plumes of smoke rising across the lands of Anórien.\n \nIn a smoldering village near Amon Dîn, you find none other than a tired Lord Alcaron. Pleased to see you, he requests your assistance in protecting the village.\n \nThe orcs pillaging Anórien are remnants of the army defeated at Cair Andros. Stranded on the western bank of the Anduin, They are now punishing the local population. One of the roving bands is led by a cunning orc captain by the name of Ghulat. You must stop Ghulat and his orcs, or many innocents will die...\n \nGhulat is dead and the village is safe. In the death and ruin, a stoic Alcaron reminds you of how much worse a punishment these lands would have suffered should Cair Andros have fallen. Even as the villagers bury their dead and begin repairs, the wives bring out their best foods and tablecloths to celebrate the village's survival, and to give thanks to their saviors. As you feast, the distant fires seem much diminished. You hope this is a sign that local populations elsewhere are also managing to overcome the marauding bands.\nLord Alcaron proves a pleasurable companion on the return road to Minas Tirith. He beams of pride in the countryside, extolling the history of Anórien and of how the ancient walls of the Rammas Echor were built by Denethor's father, Ecthelion the Second. Alcaron points to where great efforts are underway to repair the old defenses. \"Gondor will never fall,\" he exclaims, \"not as long as its people live their lives in defiance.\" He avoids looking east, the flicker of doubt in his eyes betraying the bravado of his words.\nAs the towers of Minas Tirith rise into prominent view under the white peak of Mount Mindolluin, a group of riders carrying the banners of Gondor come upon you on the road. As they approach, you see they are soldiers of Gondor in full plate, their faces serious and intent upon their task.\nThe captain of the company approaches, nodding respectfully as he recognises Lord Alcaron. \"The Steward is calling the Pelennor to arms\" the captain says. \"With the enemy repelled at Cair Andros, Lord Boromir takes advantage of their disarray and we move to retake Osgiliath.\" He gestures east. \"I am to send all able swords to join Lord Boromir's forces.\"\nAs the soldiers continue north, Alcaron shrugs. \"I guess the feather beds and sweet wines of Minas Tirith must wait a few days more.\" He turns his horse to take an eastern roadway. \"Lord Boromir is not one to be kept waiting.\" He stops a moment and looks questioningly at you, patting the pommel of his sword. \"Able swords? I do hope we can ride together for a few hours more, friends of Gondor.\"\nYou glance east, where the black peaks of the Mountains of Shadow are crowned in a sullen haze of grey could. It seems Gondor has not finished with you...\n \nAssault on Osgiliath \n\nAfter saving the villagers near Amon Dîn, the heroes have joined with Lord Alcaron to assist Lord Boromir’s forces in retaking Osgiliath. At the army encampment, you are thrilled to again meet Lord Faramir, and you are introduced to his brother Boromir, eldest son of Denethor and renowned hero of Gondor. Nestled on both sides of the Anduin lies old Osgiliath, a crossroads city bridging the great river. In the long war against Mordor, control of Osgiliath has been a critical piece. One that Boromir means to reclaim. As the sun breaks over the Mountains of Shadow, beating at the still river fog, the great horn of Gondor sounds from Boromir’s lips. As its sound fades into the morning, the men of Gondor cry out as one. They cry for battle and the ruin of foes, their swords lifted to the sky. Come death and come honor, the newest battle for Osgiliath begins...\n\n \n\nYou have returned to Minas Tirith just in time to join the army of Gondor as it marches to Osgiliath. An army of orcs and southrons have garrisoned the ancient city, but Lord Boromir means to retake it. Eager to strike a blow against Mordor, you will see the city retaken or die in the attempt... \n\n \n\nThe battle finally comes to an end.\n\nFor a while there is silence. There is no clanging of weapons, no thuds of arrows, no screams of pain. Just silence, breathing, and exhausted stares. The bodies of men and orcs litter the streets and waterways of Osgiliath, carrion debris scattered by a hard wind.\n\nYou pry your fingers from weapons sticky with blood, shoulders aching from forgotten strokes.\n\nThen the Horn of Gondor breaks the silence in triumph. The banner of the Stewards is unwrapped from the top of the white river bridge. The primal cry of victory that follows begins with Boromir, his sword held high in the air. The cry grows, until you inexorably join it. The sound of it, the exhilaration of it, vibrate the marble pillars around you. It is the sound of victory, older than the city, older than the river that runs through it.\n\nA claw of the enemy has been cut and it has retracted. He was repelled at Cair Andros, and His hold on Osgiliath has been broken. In the eyes of the men around you, you see the light of Númenor awoken. Gondor's first sons, Faramir and Boromir, and Boromir especially, are worshipped by the men like scions of old returned. It is a great day.\n\nThat night, Lord Alcaron and Lord Faramir find you in the merry glow of the campfires. Alcaron is exhilarated and enthusiastic, Faramir reserved. \"We won't stop here, \" Lord Alcaron exclaims and points eastward into the darkness. \"Tomorrow we follow them; we hunt them.\" He smiles and clenches his fist. \"We don't stop until their black bones break on the mountains.\"\n\nFaramir sits down by your fire, looking weary. \"Our lord Alcaron has convinced my brother we should pursue the enemy into Ithilien\" he says calmly. He reaches for a stray stick and starts to rummage absently in the fire, his eyes distant. \"We leave at first light.\"\n\n\"Ithilien will be ours again!\" Alcaron doesn't let Faramir's solemn demeanor reduce his spirit. \"We'll be at Sauron's doorstep, rather than he on ours.\" Faramir glances at the excited nobleman, visibly uncomfortable with the Enemy's name spoken so casually. Alcaron doesn't seem to notice. \"We'll hold the southern road. We'll bleed him!\" He grabs Faramir's shoulder. \"And whom better to take and hold that realm than the one who knows it best?\" Alcaron smiles at Faramir, hoping to recruit his enthusiasm. Faramir doesn't bite.\n\n\"This goes against my advices,\" Faramir says, \"but my brother wills it, so I go.\" He tosses the stick into the flames and rises, eyes still on the fire. \"Gondor owes you a great deal, friends of Gandalf,\" he says, his eyes meeting yours. \"I cannot ask you for more than what you've already given.\" For the first time this evening, his lips turn to a faint smile. \"But I would be honoured of your company once more, should you grant it.\" Faramir nods as he leaves. \"I ride at early dawn.\" He steps beyond the light of your fire and you soon lose sight of him in the labyrinth of campfires and surround Osgiliath this night.\n\nLord Alcaron claps his hands once and stands , his smile wide. \"I ride with Faramir and his rangers tomorrow!\" He pats each of you on the shoulders and follows Faramir, his request unsaid.\n\nIt wasn't a difficult decision. You soon find yourselves in the darkness before dawn assembling with Faramir's men at the eastern edge of the city. As the first band of light grows above the Mountains of Shadow, Alcaron notices you. He grins and winks an enthusiastic welcome. Moments later the column of rangers begins to move, Faramir at its head. Once again, you are heading east into darkness and danger...\n\n \n\nThe Blood of Gondor\n\nIn a great victory for Gondor, the city of Osgiliath has been retaken and the river Anduin is once more under the Steward’s control. Alongside the Lords Boromir, Faramir, and Alcaron, the heroes fought bravely to recapture the ancient city. With the defeated forces of orcs and evil men retreating eastward, Lord Alcaron had urged Boromir to pursue the scattered enemy. “Don’t let a single one of them return to foul the Pelennor again!” Alcaron pleaded. “We should hunt them. Pursue them until their black bones break on the mountains.” Flush with the confidence of victory and swayed by the nobleman’s passion, Boromir agreed and asked his brother to take on this endeavor with his rangers. Faramir reluctantly consented. By the request of Faramir, our heroes joined the incursion. The morning after the fall of Osgiliath, the company of rangers began their foray into the autumnal forests of Ithilien. In the days that followed, the rangers managed to track and destroy a number of enemy mobs. Their carcasses were left to the elements: skeletal warnings to those of Mordor who would cross Ithilien again. It was late afternoon on the third day before the company came to the old crossroads near the foothills of the mountains. Faramir walked at the head of the column, our heroes and Lord Alcaron close at heel. As they came to the crossroads, Faramir crossed to the old statue that stood sentinel over the silent junction facing west. Alcaron moved to follow, but Faramir waived him back. The stone figure, which must have been an impressive sight to those traveling the roads long ago, depicted a king of old seated on a throne. The years had softened its features, moss and lichen growing in its crevices and cracks. Rude scrawls and rough carvings had been made by hostile hands, defiling its stonework. The head of the statue had been knocked off, replaced with a crudely hewn stone. A coarse drawing of a grinning face with a single eye had been painted in red on the stone. The crowned head of the old king that lay to the side was curiously unmarked. It seemed the grass was greener where the head had fallen. As Faramir reached the statue, he gently touched the stone as if greeting an old friend. He then knelt by the fallen face and sat for a moment. He rose slowly, carefully eying the road and surrounding terrain. No enemy had been seen since the evening before, a fact that troubled him. Above, grey clouds pressed close, and a light rain had begun to fall. In the late afternoon light, the forest seemed to have lost its color; ashen and sullen it seemed to watch their every movement in the exposed space. Then a look of decision crossed Faramir’s face, and he thoughtfully returned to the company. “We’ve taken this folly far enough,” he said. “There is an unkind change in the forest.” He paused a moment, glancing into the trees. “The lands so near to the Morgul Valley have been under His sway for too long. It’s unsafe to proceed.” Alcaron moved to protest, but Faramir would not abide. “My brother will have to be satisfied with the work done so far. We return to Osgiliath.” As the company turned westward for their return journey, the silence of the forest broke in the blast of a distant horn. The sound rose and fell like some wounded brass bird. A chilling drone that promised nothing good. Suddenly, the woods all around the rangers came alive with the rushing black shapes and cruel blades of the enemy. An imposing robed figure led them, and the charging orcs gave him a wide berth. Though his face was mostly hidden by the cowl of his dark-grey robes, the man emanated terrible intent. This was no ordinary ambush. Lord Alcaron screamed a brave challenge as he drew his sword. Faramir and his hard-eyed rangers simply pulled their blades in a steely whisper and waited for the onslaught to come. The fight joined like a thunderclap..\n\n \n\nAfter the assault on Osgiliath, Lord Alcaron urges Boromir to pursue the retreating enemy. Boromir agrees and gives permission to Faramir and his rangers. Grateful for you valiant efforts in Gondor's defense, Faramir invites you to join the hunt...\n\n \n\nYou've pursued the enemy all the way to the Crossroads when a wicked horn blares in the distance. Within minutes, a host of orcs swarms out of the trees from all sides, led by a foreboding robed figure...\n\n \n\nFaramir and Lord Alcaron have been captured! Through the throng of warriors, you see their bloodied torn forms rushed eastward by a band of Uruks. You must move quickly to prevent the unthinkable! If there is to be any hope of rescuing your friends, you must fight your way out of the ambush.\n\n \n\nEven as your bodies shake from exertion, you cannot rest. The victory at Cair Andros. The victory at Osgiliath. Should a son of the Steward be taken by Sauron, then Gondor's joy of such achievements would turn to ash in its mouth.\n\nNight falls over Ithilien as you follow the tracks of the Uruk that took Faramir and Alcaron. You run where possible, and hurry when not. Your eyes constantly move from the ground to the darkness ahead, hoping to catch a glimpse of your quarry.\n\nAs you near the dread valley of Morgul, the vegetation is increasingly dead or corrupted. The faint smell of decay lies upon the lands, growing stronger with each step eastward. Soon the moon appears above the Mountains of Shadow, bathing the landscape in a soulless light. Though the illumination gives you no comfort, you are thankful for its help as you follow the signs of the Uruk. Of all your dangerous errands, of any defiance to Mordor that you may have shown in the past, this is a task you must not fail!\n\nThe dying vegetation vegetation slowly gives way to flinty rock and hardened dirt. The signs of the Uruk captors grow fresher, and you sense they are close. You run alongside the tepid, foul-smelling stream of Morgulduin that comes out of the Morgul Vale itself, its stony banks receding eastward into the deepening shadows. As you proceed, you begin to feel the presence of Mordor before you, like a physical weight that taxes you to stop and flee. Tendrils of despair begin to grip your hearts as you remember the stories of this palce. Yet still you move on, ceaselessly, inexorably. Ahead, you can feel the baleful presence of Minas Morgul, the Tower of Sorcery.\n\n \n\nThe Morgul Vale\n\nWhile pursuing the scattered enemy forces into Ithilien, Faramir's company of rangers are ambushed by orcs near the old crossroads. During the ensuring fight, both Lord Faramir and Lord Alcaron are captured. At the thought of Denethor's son in Sauron's torture chambers, the heroes begin a desperate pursuit. Following frantic hours of tracking, they find themselves at the mouth of the dread Morgul Valley. As the Dead City comes into distant view, they have come upon their quarry at last. Seeing their pursuers close behind, the breathless Uruk are visibly frustrated. They growl angrily as they halt to confer. A hooded figure in their midst, undoubtedly their leader, calmly directs the vexed orcs. He reminds our heroes of the Morgul sorcerer who led the ambush back at the crossroads. Even while that malefactor lies dead on the forest floor, they don't relish the thought of facing another of his kind. The truth is worse. Much worse. The robed figure decisively gestures at the distant tower, his demeanor brooking no debate. The tallest of the Uruk submissively throws a man-sized bundle over his shoulders. Grunting for two of its kind to follow, the Uruk starts a brisk pace eastward. The robed figure is clearly not about to risk his trophy on the doorstep of Mordor. As the breakout group moves down the ancient cobblestone road, the remaining Uruk turn to face the approaching heroes. As they enter earshot, the robed figure casually claps his hands and starts to laugh. The sound is hauntingly familiar. “You’re incurable!” he exclaims. “Why won’t you just die!” He raises his arms in mock frustration as the Uruk pull free their weapons in a rusty cacophony. Their eyes glow with bloodlust. “Fortunately, you are entirely too late” the robed figure continues. He casually gestures back at the tall Uruk pacing eastward toward the ghastly city. The bundled shape of a prisoner bobs on its ironclad back. “Sauron shall have His prize.” A cloud washes away from the moon as the robed man pulls back his hood “Nothing can stop that now.” A sickening heartache roils the heroes. Time seems to stand still as the depth of the betrayal hits them. The sickening corpse-light of Minas Morgul seems brighter. The waters of the Morgulduin gurgle in cruel amusement. “It should be natural, that one as old as I should have mastered patience,” says Lord Alcaron, whose real name is Ulchor. “Yet your persistence has tested me. Congratulations!” He continues, lowering his arms dramatically. “My master wanted both the brothers, butit seems I’ll deliver only the younger.” The traitor shrugs, “still, something tells me the younger is the greater prize.” Alcaron takes a moment to study the faces of his former friends. His smile seems to brighten at the horror he sees there. “Of course, I mean to deliver him your heads as\n\nwell. As a consolation.” The traitor nods to the largest of the Uruk. “I’m pleased to introduce my trusted servant Murzag.” As the traitor speaks he nods to the beasts. Murzag and his companions\nbegin to move forward, licking their blades in anticipation. “I hope you’ll find his company eviscerating.” As the Uruk charge the heroes, Alcaron casually turns and begins to walk toward Minas Morgul. His laughter echoes against the valley walls where unwholesome white flowers seem to drink the sound.\n \nLord Alcaron and Faramir have been captured by forces from Minas Morgul. You pursue their captors eastward into the dreaded vale.\n \nYou are betrayed! Lord Alcaron has revealed himself as in league with the Enemy. A large Uruk, Murzag, has been left in charge of finishing you off while Faramir is rushed ahead to the Dead City.\n \nYou've defeated Murzag and his kin. There is no time for rest as you follow Faramir depper into the vale. Soon you find the traitor Alcaron blocking the road, a grimace of anger on his formerly handsome face. \"By the the thousand thorn-drakes of Morgai, you do temp my patience!\" he sneers.\n \nAlcaron utters an ancient word, and a ghastly shriek rises from Minas Morgul. Something cold and terrible has awoken. Something that is aware of your presence. A short distance ahread, the Uruk carrying Faramir pauses, intimidated by the carrion cry from the city. There may still be time. But first you must deal with the traitor...\n \nYou've delivered justice to the traitor Alcaron. You rush forward to help Lord Faramir, who is still struggling with his captors. Then another shrill cry emanates from the city. It pierces your ears and chills your heart. With a dull clangor; the gates of Minas Morgul open. Mounted on a great black horse, a Nazgûl rides forth to claim Sauron's prize.\n\nBeyond hope, you have beaten back the black rider and his minions. Yet, such a victory has bought you mere moments. As if stirred in anger, the corpse-light of Minas Morgul pulsates slowly and ominously before you, like a funeral shroud in a warm wind. The undulating light reflects in the soulless white flowers that soundlessly seem to cry for your acquiescence in death. \nThe scream of the Nazgul tears into the night air once more. A haunting ensemble of shrill flutes begins to play from behind the city's bone-white wall. As the doors of the city open once more, something finally breaks inside you and terror takes hold. Dragging the barely sentient Faramir, you desperately flee westward as fast as your exhausted legs will take you. You never dare look back at Minas Morgul and the sepulchral procession spilling from its gates.\nIn the years that followed, you would remember little of the flight westward. It is a dim blur of barren mountainsides, rotten leaves, of the nocturnal forest and the haunting face of the distant moon above. When you now glance upon the full moon, you cannot help remembering the dread glow of Minas Morgul, and you shiver.\nAs the morning broke, a group of the surviving rangers found you slumped by the statue at the crossroads. They were not sure who was in worse condition, the wounded and beaten Faramir or his pale rescuers, unblinking and cold from horror and exertion.\nYou glance back from the saddle, Minas Tirith recedes into the distance and the Tower of Ecthelion, gleaming red in the sunset, seems to wave a final farewell.\nYou remember it all. The bear-hugs and gratitude from Boromir at Osgiliath. The careful ministrations in the Houses of Healing as your bodies mended and your minds forgot. The grand celebration in the court of Denethor, filled with flowers, smiles, and deep red wine. You remember the Steward pledging the friendship of the White city. You remember words, and handshakes, and music. You recall the parting with Faramir, the endless gratitude in his eyes the most precious reward of them all.\nThen your eyes invariably move eastward, and your hearts sink as you remember what you've been trying to forget. The ambush. The brooding watchfulness of Minas Morgul. The cold terror of the Ringwraith. The treason of a friend.\nYou turn back and spur the horses on, toward the sunset, toward the Gap of Rohan. You feel comforted with Gondor at your back. By its strong, willful, and unyielding resistance to the shadow. You sense that you'll see its green fields and white towers once more.\nUntil that day, other adventures lie ahead.\n \nEXTRA MATERIAL\nLord Alcaron/Ulchor\n \nUlchor sat in the common room of the Leaping Fish, waiting for the pawns of his scheme to arrive. He smiled politely at the human cattle as they milled in and out of the tavern, subtly raising their glasses, tipping their hats, or mouthing a quiet \"g'day, M'lord.\" He had never liked the sea, and he found the pungent smell of fish and seaweed that clung to the walls of Pelargir revolting. He would not be sad to leave this place or its pathetic salty people.\n \nLife in Gondor had been painfully long. Too long. Thankfully it was soon ending.\n \nUlchor struggled to imagine the limits of his master's cunning. Sauron was patient as the night, delicately weaving His plans into the fabric of the west, planting black seeds that would long lie dormant, biding their time to bloom.\n \nUlchor sipped at his wine, remembering.\n \nAfter word reached Barad-Dur that a second son had been born to Denethor, Sauron had begun to hatch a plan. A plan which, decades later, would find Ulchor in this cesspool of rotten boats and briny smells that the Gondorian fools called a city.\n \nHe'd been summoned and he had not idled. Without delay, Ulchor left his blood-wives and thralls at his stronghold on the shores of Nurnen. He hated the salty air of the place anyway. Besides, when Sauron summoned, one did not linger. There were few left of Ulchor's kind, and the Dark Lord greatly valued their services. Unlike the Yrch, Ulchor's kin was competent, intelligent and truly cruel. They were a people cunning beyond normal reckon, and in their veins they carried the wisdom and long life of Westernesse. Some in the West called them \"Black Numenorians,\" but few truly knew their powers, nor the depths of their hatred toward Elendil's heirs.\n \nIt had been more than sixteen years since the small holdfast in Anorien had been ravaged by a sortie of Orcs. Every bondsman in its surrounding area, every servant, the entire noble family, had been brutally murdered.\n \nExcept, when help finally arrived, they found the nobleman's son still alive. Miraculously, he was saved by hiding in the keep's stone culverts, and so had avoided both the burning and the notice of the orcs. When the found him, the young man was near death, famished, smoke-crazy, and out of his mind with grief and horror. But the boy had survived and so did his line. The holdfast was rebuilt in time, and new farmers were invite to till the unfortunate land. The son became Lord, and the Lord became strong. He garnered influence across the region, and became respected in the courts of the Steward.\n \nFools, thought Ulchor. The boy's bones were buried under heavy boulders in the stream behind the stone hall. Not a soul had been left alive to doubt the story of the traumatized young survivor. When distant relations had arrived to help in the rebuilding, they had embraced him as their own. Some of the wives had actually commented on how he had taken after his father or how he had his mother's eyes. The sorcery that had given youth to his features had been very effective. \n \nAnd so had he. Ulchor took another drink as emphasis. He relished the thoughts of the days to come. When the remnants of the West would be cast into the same hated sea that drowned the homeland of his ancestors.\n \nSoon, the emissaries of the White Council would sail into Pelargir's harbor. And because of his ingenuity and misdirection, they would come to trust him. He would fool them just as he had fooled everyone else, and with the credibility of his name, they would help him get closer to his prey than ever before.\n \nHe would have claimed the older brother already. Lord Boromir was competent and strong, but he was boastful, stubborn and quick to action. No, it was the younger brother who was difficult, with his clever eyes and sad smiles. Sauron wanted them brought before him, but Sauron did not know them as he did. Ulchor, who the cattle called Alcaron, would ensure the truly dangerous of Denethor's sons would not slip his patient net.\n \nAnd when he struck, Gondor would find itself without its mightiest sons.\n\n \nEdited August 13, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1706453","commentId":1706453,"userName":"PsychoRocka","timestamp":1438067160,"content":"VOICE OF ISENGARD + THE RING MAKER CYCLE\n \nThe Fords of Isen\nThe heroes came upon the dead rider as the afternoon darkened and the rain threatened to turn to ice. They found him facedown on the old road where he lay still and broken among the yellowing grasses. Life had been hacked from his body with axes, nearly destroying the sigil of Rohan on his hauberk. Not far from him lay the remains of his horse, a proud Mearas slain by black-fletched arrows in its graceful neck. As they dismounted to prepare a simple cairn for the body, a gust of western wind suddenly carried the familiar clangor of steel and screams. The dead man’s killers had found new victims. Rain and aching bodies momentarily forgotten, the heroes remounted and urged their horses to speed. As they cleared the crest of a long bracken hill, the landscape opened up to reveal the Gap of Rohan. Below them, fed by fall rains, the river Isen crawled south like a bloated serpent. The road descended the west-facing hill and led directly into the river where a ford bubbled and frothed among smoothworn rocks. Today, blood and steel mingled with the waters. A small band of mounted Rohan warriors, knights of King Théoden’s household, were trapped at the center of the ford. From both sides of the river, scores of Wild Men from Dunland were attacking. Many of the Dunlendings brandished leather shields emblazoned with the crude sigil of an angry boar. Water rushing at the knees of their mounts, the knights were trying to protect an emissary in their midst. The nobleman was riding a grey mare and wore a black cloak. He flinched as the green shields of his protectors broke the deadly flight of the Wild Men’s arrows. Already, arrows had claimed two of the knights, their bloodied detritus floating among the boulders. The Wild Men, tired of having their arrows deflected, began to charge. A few were already engaged in melee with the riders, but many were just now beginning to wade into the icy water with their shields raised as protection from the swords of the mounted knights. The bellowing of the attackers grew louder. The heroes didn’t hesitate before they charged down the hill. The men of Rohan were friends, and what help could be given, the heroes would give.\n \nRiding north to the Gap of Rohan, you come upon a battle at the Fords of Isen. A Small number of Rohirrim have taken a defensive position, on the islet in the river's center where a large force of wild Dunlending assails them. You must move swifty lest the river run red with blood of Rohan...\n \nAfter driving the Wild Men back from the islet, you are surprised to find king Théoden's personal advisor, Gríma Wormtongue, among the men defending the fords. He tells you that he was on his way to Isengard when he was caught in the attack. Before he can say more of his errand, the Dunlendings redouble their assault. \"Save me!\" Gríma cries as he shrinks behind you. The life of the king's counselor is in your hands...\n \nThe Dunlendings' assault is relentless and your arms grow weary. \"Take me to Isengard!\" Gríma pleads, but you will not abandon the defense. You will either break the will of the enemy, or give your life in a heroic last stand...\n \nAs the body of the largest Dunlending fell into the river, the Wild Men finally gave up the attack. They’d thought victory to be at hand, but a group of steel-willed strangers had appeared on the eastern ridge and brought relief to the hated men of Rohan. Denied of their prize, the remaining Wild Men retreated into the rocky highlands northwest of the ford. Their blue-painted faces screamed in fury back at the victors, their axes banging and pointing to the boar sigils on their shields with promises of revenge. The remaining Rohirrim knights, exhausted but pleased at their renewed lease on life, greeted the heroes with bright smiles. The senior among them was about to speak when the dark-clad emissary kneed his mare forward. He was a young man with pale skin and inky circles under his grey eyes. Thinning wet hair matted his scalp in forlorn streaks and his black cloak clung to his body like dead skin. “Help unlooked for is help most obliged!” The emissary’s flat voice was one of accustomed authority, but its treble betrayed the terror he’d suffered during the attack. He shot a frosty look at the knight who’d been about to speak. “It seems Threol’s lack of vigilance did not doom us after all,” said the emissary. The senior knight whom the heroes guessed to be Threol cringed at the rebuke, smile forgotten. The emissary returned his dark glance to the heroes, evaluating them. “I am Gríma, son of Gálmód, loyal advisor to Théoden King.” Gríma pointed northwards where the valley of Isengard lay wreathed in rain and mist. In its midst, the spire of Orthanc emerged like a black nail hammered through a grey blanket.“I travel with a message to the White Wizard.” As Gríma spoke, he noticed that the river’s current had pushed the corpses of two Dunlending warriors into the shallower waters of the nearby bank. He shuddered. “We must be on our way.” Threol cleared his throat and spoke for the first time, his gratitude to the heroes outweighing his deference to Gríma. “The King surely will reward you for the bravery shown to us today.” “Of course, of course.” Gríma composed himself and eyed Threol with irritation. He circled his horse to study what remained of his escort. The councillor seemed as uncomfortable among the warriors as he did with the dead Dunlendings floating nearby. Gríma raised his pale face to the wind to study the hills, calculating the odds of another attack. After an uncomfortable moment, Gríma turned his horse to face the heroes again. “We would be…honored if you would come with us to Isengard,” he said. “Your protection would be appreciated.” “As would your company.” Threol found his smile again. “Saruman is a gracious host,” Threol continued, stealing a glance at Gríma with ill-hidden dislike. Threol was clearly embarrassed by the emissary’s self-serving behavior. “Warm food and dry beds must have appeal in this cursed weather, yes? Besides, I should dearly like to share a drink with those that saved our lives here today.” Almost imperceptibly, Gríma inclined his head in agreement but said nothing. The heroes accepted, and the group headed northwards into the low clouds, into the Wizard’s Vale. Into Isengard, home of Saruman the White.\n \nTo Catch an Orc\nSaruman received Gríma and his escort at the steps of Orthanc. The strange black tower rose coldly from the midst of Isengard’s luscious gardens. It’s ebon walls seemed out of place among the greenery of the vale and stood in stark contrast to Saruman’s brilliant white robes. Saruman, somehow, had already known about the affair at the ford. He lavished praise on the heroes for their rescue, and reassured Threol. “The Dunlendings have grown daring of late, dear Captain.” The wizard spoke with a silky voice. It was a voice that enthralled, a voice that rung wiser than the wind, and its faint lilt was as encouraging as dawn itself. “Such an attack surely could not have been imagined until this ambush.” The wizard’s servants took the company’s packs and horses, and Saruman led them up the steps into Orthanc’s great front hall. The walls were made of the same glassy black substance as the tower itself, generously hung with white tapestries and lit by delicate sconces. Fires from several braziers warmed the hall yet seemed to give off no smoke. “The clans have never forgotten their old feud with the people of Eorl,” Saruman continued, his voice reverberating in the great hall. “The clans fight amongst each other, and they all fight Rohan.” He spoke with sadness and regret “It is a shame such bravery and strength is wasted, when the days now darken in the east.” Saruman glanced sideways at the heroes, keen intelligence in his gaze. “I hope one day to convince the clans to unite their efforts.” Saruman smiled, and none felt untouched by it. “For the cause of our greater good.” On their fourth day in Isengard, Saruman asked the heroes to dine with him. Neither Gríma nor the Rohirrim were invited. They ate in the wizard’s elaborate private study. A great balcony adjoined the room, overlooking the great cobblestone courtyard that laid before Orthanc’s front doors. A late harvest moon shone through the balcony, white and wreathed in a ghostly halo. The food and wine was splendid, rivaling even that of Denethor’s table. Saruman ate little, preferring to talk and ask questions while sipping wine. “I sense you are under the favor and employ of my dear friend Gandalf the Grey,” he said after concluding a bout of questions on Gondor and the disposition of Ithilien. “You must know that we seek the same end, Gandalf and I,” Saruman continued, pleased with his guests’ comfort and attentive ears. “While Gandalf wanders, while he turns the rocks and douses small fires, I confine myself here.” The heroes nodded in appreciation as the wizard gestured proudly around his study. He sighed gently. “Here alone I study matters of the deepest significance. Of old things. Of such lessons as would help us face the rising shadow in the east.” “While Gandalf’s ways differ from my own, there is one thing we share in equal measure.” He smiled. “The need to retain brave allies––those of stout heart to face danger and hardship in our cause.” He toasted the heroes, and all seemed right with the world. “To that end, my friends, I ask you for your assistance, which I dearly hope you will choose to grant.” He steepled his hands, as if emphasizing what was to be said. He looked at each hero in kind, taking their silence as interest to learn more. “You already know the Orc threat has been growing in the mountains,” he continued. “In Gundabad, in Moria, near the high passes. Like the Wild Men, the servants of the enemy grow ever more aggressive.” He took a sip of wine, and his voice grew more intense. “In fact, one such band threatens the peace of this very valley.” “I am uncertain of the band’s numbers, but I know they are led by a particularly large and gruesome specimen of their kind––a chieftain who goes by the name of ‘Mugash.’” Saruman pursed his lips as if the word was bitter. The heroes rose and spoke at once, proclaiming their willingness to destroy the Orc. Saruman waved them to their seats once more. “I am afraid it is more complicated than that,” the wizard sighed. “This chieftain, this ‘Mugash,’ has knowledge of his kin’s desires, of their movements, of their plans, and, most importantly, how they are receiving word from the east.” Saruman lowered his voice to a near whisper. “The task I request of you, is not to kill this specific Orc,” he curled his fingers to form a cage as he asked the impossible, “but to capture him.” \n \nSaruman has tasked you with a dangerous mission: journey up the Misty Mountains' southern peack in search of the Orc, Mugash, and capture him alive.\n \nMugash and his Orcs have been raiding the surrounding coutryside from their hidden lair in Methedras, and carrying loot and captives back into the mountains. It's time to put an end to this menace...\n \nOrcs prowl the mountainside on the lookout for intruders. A single horn-call from one of the sentries would have every Orc in Methedras scurrying out of their holes to fight. You must move carefully to avoid detection while you search for their captain...\n \nYou've found Mugash, but the Orc captain won't be taken without a fight! He howls and rages against you with the ferocity of a cornered animal. All the commotion is sure to draw more Orcs to the fray, yet you must subdue the huge Uruk before you can retreat down the mountain...\n \nIn hindsight, trapping Mugash was the easy part. Transporting the Orc back to Isengard was a problem unlike any the heroes had ever faced. At first, they were pursued by angry remnants of Mugash’s band, often forced to halt and seek defensive ground. Yet worse than the pursuit was the journey itself. While fall storms ravaged the lowlands, early winter had come to the mountains. Gales of sleet made the path treacherous, and the wind willfully bit into every inch of exposed skin. Shallow ravines and steep rivulets, dry for most of the year, now gushed with ice-laden water. The nights froze, and every morning the stony slopes were coated in jagged ice. They’d pried a staff beneath Mugash’s arms and bound his hands before him with thick rope. His legs had been forcefully bent and then tied together over another staff placed in the hollow of his knees. In this way, the heroes could drag the Orc or carry him by both poles when necessary. On the first day of the return journey to Isengard, upon realizing his entrapment, Mugash had roared and yelled continually, spitting anger and snapping his fangs at his captors. His curses echoed in the mountainsides and encouraged the pursuers. After a day of listening to his screaming, the heroes had finally stuffed a piece of an old surcoat into the Orc’s fanged mouth. Using strips of leather, they tied the cloth so tight behind his head they heard his skull groan at the pressure. At first, the gag seemed only to make Mugash angrier. It took another full day to traveling before he settled down somewhat, his breathing whistling angrily from frozen nostrils, eyes glaring at his captors with unvarnished bile. After three days, the pursuit finally stopped, but the weather turned for the worse. The winds howled along the cliff sides, and a mordant never-ending sleet left their faces raw and blistered. There was little forage on the trail, and the heroes walked on slim rations. They dared not feed Mugash. Undoubtedly, he’d begin screaming again, and even if the pursuit had ceased, they didn’t want to chance its renewal. As the heroes drew nearer to Isengard, Mugash became ill. His eyes, which were once alive with hate, became puffy and closed in feverish sleep. His nose leaked a blue-green sludge, and his breathing was reduced to a thin whistle. His dark skin had turned ashen grey, except where his limbs were pressed around the staves. There, it had bruised into a blackish purple. Mugash no longer struggled or grunted, and his weight seemed to have deadened. That night, the heroes were troubled. They’d finally begun their decent into the lower passes and the weather had turned milder, but their prisoner seemed likely to die before reaching Isengard. Reluctantly, they loosened Mugash’s bonds to improve his circulation. They removed the gag and forced hot wine and a paste of bonemeal into his foul mouth. The beast was burning with fever, so they placed him farthest from the fire near aboulder that blocked the worst of the wind. His breathing was so slight it could barely be perceived. That night was the coldest of the journey, but the weather was clearing. A few stars could be seen in gaps between moving clouds and the sleet had paused. After choosing a sentry, the heroes huddled down near the fire and for the first time in their lives, they drifted off to sleep hoping that an Orc would not die. Hours later, as the cloud-streaked moon dropped behind the south summit, the sentry thought he heard the scurrying of wolves down the mountainside. He rose to briefly investigate, but the darkness held nothing and he returned to the embers of the fire. As he settled, he no longer heard the Orc’s breathing, and so guessed the captive must have finally died. With a sigh, he rose again to investigate. In the shadows of the nearby boulder, where he expected to see Mugash’s corpse, he instead saw scraps of cloth and rope. The two staves lay nearby; Mugash must have cunningly and quietly slid them inch by inch away from his body by pressing them against the boulder. Mugash was not dead. Mugash had escaped.\n \nInto Fangorn\nMugash was free and running. The sickness lingered in his body, but he savored its malevolent presence. Because of it, his tormentors had thought him near death and loosened his bonds. The fools had even fed him. Mugash’s arms and legs stung. His joints were swollen and throbbing where the ropes had tied him to the poles. His limbs had been useless the first few miles of his escape, and he’d crawled like a worm down the mountainside, pushing himself forward with shoulders and hips. The great Orc had laughed at the pain. His way, the way of the Uruk, was not one of stealth and silence, but last night on the mountainside, stealth and silence had been his closest friends. He flexed his hands. Through the pain he felt strength returning. He had outwitted the hated bright-eyed humans, and now he was free. But the humans, the bùbosh skai, were hunting him. He could hear their pursuing feet in the pass above him. He spat, tasting the stale rag that had been jammed in his mouth for days. When revenge came, he would feed hot coals to his former captors. As Mugash thought of his imprisonment, a blood rage almost took him, but he resisted the urge to turn and fight. He knew the skill of these particular skalug, and fighting them now would be foolish. Mugash was no fool. He’d become chieftain of the southern tribes through more than strength and violence. Vengeance would wait. He’d fight another night. How Mugash wished it was night! The sun had risen, and its vile sharpness was like a blade in his eyes. Even so, the great Orc forged on. He’d always prided himself on his resistance to the white eye. Though it hurt him, unlike most of his tribesmen––he endured its viscous glare,. Even so, the bright path was hard to see and the pain was another tax on his punished body. He’d thought of escaping back along the mountain path, but the ice would have slowed him further. Instead, he hobbled east, down the mountainside and eastward, into the damned rising white eye. Into the lower lands. Into the trees. As the forest shadows shielded him from the sun, he grunted with relief. The southern forest, with its dense canopy of ancient trees, made for an almost-subterranean world, twilit in greens, browns, and blacks. He would have preferred a dark tunnel or cave, but this was not a bad place. The great Uruk took a ragged breath and renewed energy came to him. He soon disappeared into the shadows of the primordial forest. It would be impossible for the bùbosh skalug to find him there. Mugash soon learned he was wrong. This forest was, after all, a bad place. Not far behind, the heroes followed in close pursuit. They’d caught the monster once, and were determined to do it again. Yet even the strongest determination could not stop them from hesitating when they realized that Mugash had ventured into the old forest of Fangorn, a place with a dark and dangerous reputation. As they entered Fangorn, the air hummed with a subtle song of branch and leaf, and the tune was unkind. They’d come to a place forgotten by the world and abandoned by time. One that wished to remain so. The trees and stone watched, as they always had. A humid wind whispered in the branches, and old memories stirred in bark and root. Sleeping things woke from sour dreams. Things that hated disturbance. Hated the smell of change and steel and fire that clung to the intruders.\n \nYou've captured the Orc captain, Mugash, in the mountains above Isengard. But as you make your way down Methedras, your captive escaped and flees east into Fangorn.\n \nYou pursue Mugash into the ancient forest to find that the trees themselves seems to be attacking him. Without thinking, you hack at the tree branches to rescue your captive. That is when you first sense your own peril...\n \nYou've rescued Mugash from the trees, but you sense the forest itself seethes with anger toward you. The thankless Orc struggles against you and the tree branches grasp at you. It's going to be a hard fight to get out of Fangorn with your captive...\n \nMugash has disappeared deeper into the woods. As you continue to search for him, the trees close in around you and you can feel their roots and limbs shaking with anger. Their branches rattle like a raging temptest, but without any wind. You're beginning to regret the decision to enter Fangorn. You need to find Mugash and get out... (ONLY IF YOU ADVANCE TO STAGE 3 AT ANY POINT)\n \nAs the trees gave way to the boulder-strewn grasslands of the mountainside, their spirits revived. The heroes had awoken the anger of ancient things with rotten hearts. They’d fought the crushing power of old roots and strangling branches and they’d barely escaped alive. Now those horrors were behind them. The great Orc, Mugash, was their prisoner once more, and after another two days of traveling, they finally descended on the winding path that led into the Wizards Vale from the north. Orthanc greeted them coolly among the welcoming colors of the vale’s vegetation. Saruman was grateful for their help in capturing the Orc, and his rewards were generous. The heroes spent the winter in Isengard, recovering from their ordeals in the mountains and forest. Yet, as the season passed, the heroes saw less and less of the wizard. He was often closeted with work in his chambers, and they sensed a growing frustration in him, as if the results were not to his liking. Upon seeing the telltale sign of summer birds returning north in the high skies, the heroes felt their northward journey must resume. Over a rare dinner with the wizard in his high study, they told him of their plans to depart the following morning. Saruman seemed displeased. “My work is unfinished, my friends,” he began as a servant refilled his goblet. The wizard sipped at the wine and continued. “The Enemy is wise, and he remembers such secrets of old that even the Elves have forgotten. “It is of great consequence that we learn the depths of the Enemy’s measure and mind,” Saruman continued. “It is with knowledge of the past, and in the powerful weapons of yore, that I perceive our greatest chance.” He took another sip, considering his next words. “Did others not defeat Sauron and his master before? Should we not seek the old powers of Beren, of Gondolin, of Númenor?” The wizard leaned forward. A hungry, eager, light was in his eyes. “Of Isildur?” The heroes gleaned the flaw in Saruman’s speech. If Sauron had truly been defeated, then how could he have returned to power? It seemed to them that weapons of the past had merely held the shadow at bay. They didn’t voice their doubts, however, for the wisdom in Saruman’s voice quickly dulled all qualms. Saruman continued his lecture. “I believe a long-lost place, one thought destroyed by the enemy, may have been uncovered in the hills of Hollin. It was among those hills that the great Elven city of Ost-in-Edhil stood, and it was there Celebrimbor and his apprentices forged legendary artifacts of good, unmatched in the world today.” Saruman’s back had straightened and he seemed to glance into the past, as if he saw the forge fires of the long-dead Elven masters. His voice became deeper and his bearing mightier. The heroes felt, rather than saw, the secret light of the Istari pulsing from him, like heat from a searing oven. “Is it not incumbent upon us to seek the tools and weapons of a better age?” It was not a question he expected the heroes to answer. After a few moments, his reverie seemed to recede and, his gaze returning to the dinner table. “Word has come to me from the north. A Dwarf by the name of Nalir claims to have found a hidden Elven forge near Hollin.” Saruman paused, as if hoping for a reaction from the heroes. When none came, he seemed slightly irritated. “Nalir is waiting in Tharbad and desires to sell the forge’s whereabouts for a substantial sum of gold.” Saruman’s intonation made it clear he valued the precious metal no more than the crumbs on his plate. “I believe this may be nothing less than the forge of Celebrimbor himself.” He folded his hands. “And it may prove a vital link to past strengths.” The wizard now looked at each of the heroes in turn. “I know you wish to return to Rivendell,” he said. “I admire your dedication to Gandalf’s trifling endeavors. Yet I need your skills in exploring this place and procuring what it may contain.” The heroes shuffled uncomfortably in the seats. Their absence from the north had been long, and the grey wizard’s need was keenly on their minds. As Saruman caught their hesitation, the enticement of his words seemed to magnify. “My friends, I ask you most kindly. Travel to Tharbad for me and procure the forge’s location from this Dwarf. Then reconnoiter the forge and recover its contents for me. Do this, and you may rejoin Gandalf with my blessing and eternal friendship.” Saruman’s shadow seemed to grow as he spoke, and the room felt suddenly small. “It is of greater importance than I can ask you to understand.” There was a moment of tense indecision, then the heroes, one by one, gave their nods. As the reluctance ebbed, Saruman relaxed. He smiled sweetly, greeting their acquiescence with a statesman’s grace. “I knew you would not turn from duty,” Saruman said. His words seemed to stroke them as a master’s hand would his faithful dog. “With luck, your quest may help plant the seeds of a better age.” It seemed their work for Isengard was not yet finished. \n \nThe Dunland Trap \nIn the circle of Isengard, the heroes were preparing themselves for the journey to Tharbad. The leader of the White Council, Saruman, had tasked them with an important quest: to find the hidden forge of Celebrimbor, the master Elf-smith who forged Rings of Power in the Second Age. The Wizard believed that knowledge of Celebrimbor’s secret forge could be learned from a Dwarf who they were to meet in Tharbad. The heroes were tightening their belts and shouldering their bags when Saruman descended the stairs of Orthanc to wish them farewell. “This gold should be sufficient to convince the Dwarf, Nalir, to sell you his map,” the Wizard said as he handed a heavy purse to the heroes. “Guard it well. For the location of Celebrimbor’s forge is a prize beyond worth, and we dare not let the servants of the Enemy find it in our stead.” The heroes added the gold to the bag of valuables that they had recovered from the Orcs of Methedras, then Saruman bid the heroes hasten and returned to his tower. The heroes themselves mounted their steeds and rode south from the ring of Isengard until they reached the Old South Road that would lead them to Tharbad where Nalir could be found. The road ran west and north through the hill country of Dunland and they rode until sunset. As the red sun burned low in the distance, the heroes gathered around a fire to keep warm and ease the weariness in their limbs. But just as sleep began to close their eyes, they were startled wide open by the sound of war cries from all around. A host of bearded Dunlendings was swarming down the hills towards them with weapons drawn...\n \nYou are following the Old South Road from Isengard to Tharbad on an errand for Saruman when you are attacked by Wild Men of Dunland.\n \nAlready weary from a full day of travel, you struggle to hold off the ferocious Dunlending attack. You must rally your companions and drive back the enemy, or you will be defeated.\n \nYou've driven back the attackers, but some of them seized your bags during the fight and took them as they fled. Inside one of those bags is the gold that Saruman gave you for your quest, so you pursue the thieves deeper into Dunland.\n \nIn your zeal to recover the gold, you have been led into an ambush.\n \nThe Dunlendings are more clever than you thought: using your gear as bait, they have lured you into a deep ravine where you are surrounded. A large warrior wearing a boar mantle strides forward and signals the attack. With no hope of escape, your only option is to fight...\n \nWounded, exhausted, and surrounded by Dunlending spears, you brace yourself for defeat. But at the last moment, the leader of the Wild Men lifts his hand to halt the attack. “Wait!” he commands, his eyes focused on the baggage spilled on the ground. The large Dunlending bends down to lift a totemic amulet from the ground. As he holds it up to inspect it more closely, you recognize it as one of the artifacts that you recovered from the Orc’s lair in Methedras.\n“Where did you find this? Tell me!” the large war-chief demands, a mix of rage and wonder on his face. His composure becomes more thoughtful as he listens to the tale of your errand upon Methedras and your battle with the Orc, Mugash. He turns the amulet in his hand while he listens as if considering what to do. Then, with obvious reluctance, he gestures for the other Wild Men to lower their spears. “You are our prisoners now,” the fierce leader growls. With a jerk of his bearded head, he speaks a command to the other Dunlendings, and the heroes are bound and marched to the Wild Men’s village.\nUpon your arrival, the warriors escorting you are greeted by savage cheers from the other Dunlendings. Lifting a hand for quiet, the war-chief addresses his people. “The straw-heads took our land,” he says with disdain, “but the Boar Clan will reclaim what is ours!” Then, lifting the amulet in his hand, he adds, “As we have reclaimed this!”\nA quiet falls on the crowd and you can see looks of amazement on their faces. “This amulet belongs to the Boar Clan,” says the war-chief in a loud voice. Turning to face you, he continues, “As do you, and everything you carry.”\nAt his command, the other Dunlendings begin pawing through your belongings, until a shout of discovery catches the warchief’s attention. One of his warriors hands him a small bag. “A rich bounty you have brought us,” he remarks, holding Saruman’s purse in his hands. To the your dismay, he turns it over, spilling a rain of precious golden coins onto the ground.\nAs the Dunlending women begin lighting bonfires for a victory feast, the Wildmen leader approaches you and speaks quietly, “Tonight, my people celebrate our victory.” He still holds the mysterious amulet in his hands, as if it were very precious to him. “Tomorrow, we will deal with you.”\n \nThe Three Trials\nThe heroes were bound hand and foot inside a wood lodge of the Dunlendings. Outside they could hear the warriors of the Boar Clan celebrating their victory, when a large Dunlending entered. It was the leader of the war-party that assaulted them, and the same Wild Man who ordered them taken prisoner. He approached the heroes until he stood towering over them.\nThe war-chief stared intently at the heroes, holding the totemic amulet taken from their baggage. “I am Turch, chieftain of the Boar Clan. Every ten years, an amulet like this is given to a youth of great promise,” he began. “The gift marks the height of his manhood and signals his worthiness to undertake the three trials.”\nHis eyes grew distant, and for a moment sadness washed over his stern face. Then, with a deep breath he hardened his face and continued, “This amulet was given to my son.” At that moment, an elder Dunlending man wearing ritual boarskins and the bones of his totem animal entered. “You would reveal our secrets to these strangers?” He asked in a sharp voice, indicating the heroes with a sweep of his arm. “They are not Boars!” The chief glared at the druid, “I am the chief of this tribe! I will speak what I like.”\nThe old man fell silent and bowed his head. When the chief returned his attention to the heroes, he held up the amulet in his weathered hand and resumed his story, “Whoever succeeds at these trials will recover the Antlered Crown and unite our people. My son journeyed into the forest near the mountains to attempt the trials several years ago. He never returned.” The chief’s eyes were haunted when he met the heroes’ gaze. “No other youth showed such promise, and none of his peers dared to take his place. To my shame, the Boar Clan has no champions to undertake the trials when the moon grows full this night.”\nOnce again, the old man interrupted, shaking his fist towards the chief. “These strangers wear the trappings of our enemies! We dare not trust them!” The chief held up a hand to silence the wise man and kept his\ngaze on the heroes. “I see now that my son was slain by the Orcs you encountered,” he said. “It is good that Saruman sent you to deal with them.” Then, scratching his beard thoughtfully, he spoke to himself, “The friendship of Isengard in addition to the Antlered Crown would force the other clans to recognize the leadership of the Boar Clan.” \nHe seemed to ponder that idea a moment. Then, turning his attention back to the heroes, he spoke to them, “You avenged my son by dealing with the Orcs that killed him, and you fought well when we ambushed you. I believe that my son’s spirit is with you.”\nThe chief looked down at the amulet one last time before reaching forward to offer it to the heroes. “If you remain here, my people will demand your death. Instead, it is my wish that you take the trials in my son’s place and retrieve the Antlered Crown. If you do this, you will be spared and free to continue the Wizard’s errand.”\nBefore the heroes could reply, the old druid pounded his staff on the ground and shook it violently. “You cannot do this! They are not Boars! They cannot undertake the trials!”\n“Consult the bones,” ordered the chief as he rose to his feet and towered over the old man. “Let the Boar spirit decide.”\nThe old druid reached inside his boarskins and reluctantly brought out a small purse. He opened the pouch to let the small bones inside it spill onto the ground, then he bent to his knees and lowered his face to inspect them closely.\nAfter a tense minute of silence, the old man grunted, and rising slowly to his feet he spoke slowly, “The strangers may undertake the trials.”\n“The bones have spoken,” spoke the chief. “It is decided then: You will undertake the trials to recover the Antlered Crown for the Boar Clan. Success will grant you and your master our friendship. Failure will grant you death.”\n \nAt the edge of a cursed forest, the Boar Shaman explains that you must undertake three trials in order to recover the Antlered Crown, or face death. Each trial will test your worthiness. Guardian spirits watch over three sacred swords, protecting them from the undeserving.\n \nThree ancient barrows mark the locations for the trials, each the resting place of a different guardian spirit. The Boar Clan waits at the forest's edge for any sign of your victory... or your death. Your only option is to press onward, heading towards the site of one of the three trials...\n \nA rotting corpse guards the inner chamber of this barrow, holding in its grasp a worn sword that looks like one of the keys the Boar Shaman described to you. When you reach for the key, the guardian springs to life and attacks you!\n \nA huge barrow towers before you, cold mist enveloping the entrance. The key is somewhere inside, but a heavy chill fills you with dread and unease...\n \nYou have found the barrow where the trial should take place, but the key cannot be found. You are sure the key's guardian is watching you... Where is the key?\n \nYou have finally completed the trials and recovered each key. None have made it this far before. You hasten to the hallowed circle in the center of the forest. All that's left is to insert the hilts of these swords into the marked stone the shaman described, and the Antlered Crown will be yours. As you advance, a thick fog gathers around you and growing dread tugs at your mind.\n \nOut of the fog, the angry guardian spirits emerge once more, determined to stop you from retrieving the crown. You desperately rush to the circle while fending them off.\n \nUpon your return to the village of the Boars, you present the Antlered Crown to their chieftain, who accepts it with a wide grin. “You have done well,” he says holding his prize high to the wild cheers of his clan.\nAfter ordering a celebration, chief Turch explains the significance of the Antlered Crown to you, “This crown belonged to our king when we ruled the rich lands east of the river Isen. When the straw-heads drove us into these hills, our king died. We might have yet recovered our lands, but his three sons squabbled over who was best suited to lead and the argument divided us into three clans: Boar, Wolf, and Raven.”\n“Their fight nearly drove us to war with each other, but a wise shaman took the Antlered Crown and hid it in the woods where you found it and placed a curse on it. He told the three brothers that the one who was brave enough to retrieve the crown would be the one to lead our people, but none were successful. The spirits that guarded it were too strong.”\nThen with a surprisingly friendly smile and a clap on your back, the chief continues, “Yet where others failed, you have succeeded. And now the other clans must accept the rule of the Boar.”\nAt the celebration feast, chief Turch makes you honored members of the Boar Clan and returns your possessions to you. Last of all he returns Saruman’s gold. As he hands you the purse, he holds your hand and says, “We are grateful to you and your master for your aid. We will make sure that you reach Tharbad safely to continue the Wizard’s quest.”\n\n \n\nTrouble in Tharbad\n\nLooking at Tharbad, the heroes were dubious. The river town was little more than a haven of freelancers and highwaymen, filled with dilapidated buildings amongst ruined and crumbling causeways. As soon as they entered the ancient city, they inquired with several townsfolk to discover where they might find Nalir.\nIn due time, the heroes were pointed in the direction of a patched and ramshackle tavern, The Empty Mug. Once inside, the heroes found the Dwarf they sought sitting alone with a tankard of ale. His appearance did little to inspire confidence in the heroes, but there was a glint in his eyes when they spoke of the map that\nrevealed a cunning mind at work.\n“Aye, I have the map you seek,” he said, wiping the ale from his mouth. “However…” he continued slowly, “I sold it to a man earlier today, name of Bellach. A shady looking character, he was. Not the sort of man to take ‘no’ for an answer. But he offered a fair price, even if he was foul about it. I’m to meet him here at sundown to make the exchange... Unless you can offer a better price?” Nalir punctuated his question with a sly grin.\nThe heroes were eager to purchase the map, and Nalir used it to his advantage. It took all the gold from Saruman’s purse to convince the Dwarf to sell the map to them, but in the end a deal was struck. “Done!” exclaimed Nalir, clapping his hands together. “A nice bit of business! Now let’s finish it quick before that Bellach returns. I’d like to be far from here before he finds out I’ve sold the map to you. I don’t imagine he’ll take the news kindly.”\nWith that, Nalir stood up from his seat and moved his chair aside to get at the floorboard it had been sitting on. He lifted the board and took a rolled parchment from underneath. “Here’s the map I drew. It shows the way to the hidden chamber in Ost-in-Edhil,” he spoke with obvious pride. “Lucky to find it, I was. Elves are\nright clever about hiding things they don’t want found. Another Dwarf might’ve walked right over it without ever knowing it was there. I daresay you’d never find it on your own! But now that you’ve got Nalir’s map, you don’t have to worry about that...”\nHe was just about to hand his map to the heroes when there was a shout from the doorway. A tall man in a dark cloak stood there. He had a cruel scar across his face and his right hand was on his sword hilt. Several more sinister-looking men stood behind him.\n“Bellach!” exclaimed the Dwarf.\n“Is that the map you sold to me?” demanded the man in the doorway pointing at the parchment Nalir was about to give the heroes. There was murder in Bellach’s eyes. “You have made a foolish mistake,” he snarled, then put his fingers to his lips and made a loud, shrill whistle. To the heroes’ dismay, it was answered by the unmistakeable sound of Orc shouts from outside the tavern.\n“Kill them!” Bellach shouted to his followers as he drew his own sword. “In the name of Mordor! Bring me the map!”\nNalir wasted no time fleeing for the back door as Bellach’s men rushed inside. A roar of shouts and clanging steel filled the little tavern. Just as Nalir reached the door, it was thrown open from the outside by a large Orc. The Orc seized the map that was in Nalir’s hand, but the Dwarf’s grip was strong. After a brief struggle, there was a loud ripping sound as the map was torn in two.\n“You fool!” snarled Bellach at the Orc with half a map in its hand.\nIn that brief moment of distraction, the heroes saw their chance. Grabbing Nalir, they shoved past the bewildered Orc and sped down the alleyway behind the tavern, the sound of pursuit close behind... \n \nYour meeting with Nalir is interrupted by a host of Orcs led by a man, Bellach. In the ensuing chaos, you manage to escape with the Dwarf but the Orcs pursue. Outnumbered, you must throw the Orcs off your trail if you hope to escape...\n \nYou've eluded the Orcs and you make haste for the river crossing. If you can get across, perhaps you can escape. But, Bellach has cleverly set a patrol at the ford, and you are quickly spotted. You make a dash for the river...\n \nYou can still hear the sound of shouts mixed with Orc cries coming from Tharbad when you reach the eastern side of the river Greyflood. You may have thrown off your pursuit for the moment, but it’s clear that Bellach and his minions have not given up the search.\n“Well now,” chuckles Nalir, dusting himself off, “that was a close one!” But his laughter dies in his throat when he sees the bemused look in your eyes. His expression becomes indignant and he raises his voice, “How was I supposed to know he was from Mordor? He looked Gondorian to me! It’s not my fault he tore the map!”\nAt that moment, an Orc shouts close to where you crossed the river. “They’ve found our tracks,” whispers Nalir nervously. “It won’t take them long to fi gure which way we’ve gone. With the map destroyed, I’m the only one who can find the hidden chamber, and Bellach knows it. He won’t stop looking for me so easy.”\nBellach will no doubt set a watch upon the road. You’re sure to be discovered if you go that way, but you still need to reach Hollin. As you consider your options, it seems the the only course open to you is to enter the vast marshland of the Nîn-in-Eilph which lies close at hand. If you can find your way through to the eastern side, you should come out near to the ruins of Ost-in-Edhil and the completion of your quest.\nNalir frowns as you explain your plan to him. “Yonder marshlands?” exclaims the Dwarf. “There’s no path through those fens. They’ve been undisturbed for ages. Nobody goes in there. I’m grateful to you for helping me out, but no amount of gold is enough to convince me to go wading through miles of stinking water.”\nJust then, there’s a loud splash followed by Orc cursing. The Orcs are making the crossing and getting closer.\n“On the other hand,” begins Nalir nervously, looking in the direction of the noise, “Orcs are more like to kill me than water. And besides, I owe you for rescuing me back there. So perhaps it’s best if I accompany you to Hollin...”\nWith that, you lead the Dwarf into the tall reeds of the Nîn-in-Eilph.\n \nNin-in-Eilph\nWith Bellach’s Orcs scouring the country around Tharbad looking for the Dwarf, Nalir, the heroes had chosen to flee with him into the Nîn-in-Eilph, a vast swampland that had been undisturbed for ages. By taking this path the heroes hoped they would throw the Orcs off their trail and come to Hollin on the other side. But after wandering for a day through the pathless marsh, the heroes were growing tired and Nalir’s complaints were getting louder.\n“I told you this was a bad idea,” Nalir grumbled as he struggled through the marsh and sank to his chest. “I don’t like to get closer to water than the riverbank. Dwarves don’t swim, you see.” Despite the roguish Dwarf’s protests, the heroes trudged on. The mission they had undertaken for Saruman to find Celebrimbor’s forge was important, and all the more urgent now that the Enemy was searching for it too. Nalir, however, cared little for Saruman and less about his mission. He had only agreed to make the crossing with the heroes for fear of the Orcs, but there was something about the swamp that made him more afraid. As they slogged through the endless marsh, they began to hear noises like gentle splashes.\nA foul smell overtook the heroes and a sense of dread stopped them where they stood knee-deep in the swamp. Unconsciously, they drew their weapons and faced outward to see the murky water rippling toward them.\nNalir thought he saw a long dark shape snake its way across the surface. “There’s something out there,” muttered the Dwarf. The heroes strained their eyes but could see nothing through the fog that had settled over the swamp. “We can’t stay here,” said Nalir, trying to stay near the center of the group. “We’ve got to find a way out.” The heroes knew he was right. Whatever dangers lurked in the Nîn-in-Eilph, the heroes would have to brave them in order to reach the other side...\n \nYou've entered the vast marshlands of the Nin-in-Eilph with Nalir in order to escape Bellach and his Orcs. Now, you must cross the swamp in order to reach Hollin on the other side.\n \nNo traveller has entered the Nîn-in-Eilph for an age and there is no path through the shifting marshland. You must find your own way across the treacherous bog.\n \nAs you trudge through endless swamp, you begin to wonder if you will ever reach the other side.\n \nLost as you are, your presence in the marsh has not gone unnoticed. An ancient and foul swamp creature stalks your company...\n \n\nDepending which version/s of Stage 3 you end up at:\n\nDespite the size of the creatures hunting you, the swamp itself is your worst enemy. The ground sinks down beneath you and the mud pulls the boots off your feet. Every step forward is a struggle...\n\n-OR-\n\nAs if the swamp itself was not bad enough, its foul denizens swarm around you, their serpentine forms slithering through the murky water that rises to your waist...\n\n-OR-\n\nAfter wandering aimlessly for so long, harried by foul creatues, your resolve begins to waver and your companions collapse from exhaustion. If you cannot find a way across, the swamp will erase all evidence of your passage... \n\n \n\nBeyond all hope, you have reached the edge of the swamp! You can see the gentle rise of the hills in the distance, but the huge marsh-dweller that has pursued your company now lies between you and dry land.\n\n \n\nThe fight amongst the fens is no easy feat: the swamp made for uncertain footing at best, and the creatures attacking you take ruthless advantage of the environment. Your battle cries echo strangely amongst the fens, and even the most practiced swordsman finds his blows robbed of momentum and grace by the muddy silt beneath your feet. However, your courage and skill carry the day, and you emerge triumphantly on the eastern end of the marsh. The strange denizens of the Nîn-in-Eilph withdraw back into the swamp and you shamble away in a pell-mell retreat.\n\nYou climb a low hill before stopping to rest. As you bind your wounds, Nalir pulls off his boots to pour the water out. “Just what I deserve for trying to take a shortcut through that cursed swamp,” he mutters angrily. Then, reluctantly he nods to you, “I owe you my gratitude again. I’d have never survived to make it this far without your help.”\n\nNalir stands up and looks around then points south and smiles. “Well, we only need to follow the River Glanduin there the rest of the way to the ruins of Ost-in-Edhil. Once there, I can show you the hidden door that I discovered.”\n\nOnce rested, you follow the Dwarf along the shore of the Glanduin. For days you walk through the land of Hollin, a pleasant but unpopulated region. “Long ago, this place was known as Eregion. A mighty realm of Elves, it was,” Nalir explains as he walks. “The city of Ost-in-Edhil was their capital, until the armies of Mordor burned it to the ground and all the Elves either fled or died.”\n\n“But that was an age ago,” sighs Nalir. “We won’t find naught there now but crumbled buildings and...” The Dwarf’s words trail off as you crest a hill to see the the ruins of Ost-in-Edhil spread out below you. Among the toppled stones and cracked roads of the ancient Elven city you can discern the skulking figures of Orcs prowling about and the tall figure of a man giving orders.\n\nBellach has arrived ahead of you.\n\n \n\n \n\nCelebrimbors Secret\n\nOrcs were crawling over every stone and into every hole in the ruins of Ost-in-Edhil when the heroes arrived at the edge of the valley. From their vantage point, they could see the man, Bellach, as he ordered the search.\n“I should’ve guessed that scum would get here first,” hissed the Dwarf. “He must’ve led the Orcs here while we were lost in that swamp.” \nThe heroes looked on the scene with dismay. After all their travels, it seemed they had come too late to accomplish their mission. Then Nalir noticed something that made him growl,“He’s got the other half of my map with him! Look, he’s using it to direct the Orcs.” Suddenly the Dwarf started laughing, “That\n\nfool! He’ll never find the hidden chamber with just half. He’s searching in the wrong spot!”\n\nNalir’s news gave the heroes hope that they may yet discover Celebrimbor’s forge and recover its secrets before Bellach and his Orcs. However, the Dwarf had gone as far as he would, “What you do from here is your business, but with all these Orcs searching about, I daren’t go down there. If we’re seen by those Orcs, even warriors of your mettle may not survive.”\n\nThe heroes objected but it was clear that Nalir could not be convinced to lead them any further. “I’ll tell you where I found the hidden chamber,” said the Dwarf, “but I’m not going nowhere near that many Orcs. I doubt if anybody could make their way through that valley without being spotted.”\n\nNalir did his best to describe where the entrance to the hidden chamber was located before wishing the heroes luck and slipping away. He gave one last dubious look at the heroes before disappearing out of sight.\n\nTurning back to the matter at hand, the heroes look out over the vale of Ost-in-Edhil and try to discern the entrance to the hidden forge at the valley’s end. They would have to move with great stealth if they wished to evade Bellach’s forces and reach  the end of their quest.\n\n \n\nYou have finally reached the ruins of Ost-in-Edhil, but Bellach and his Orcs have arrived before you. They appear to be searching for the hidden chamber. If you want to reach it first, you will have to move quickly and carefully...\n\n \n\nYou have just recovered a partial ring-mould from Celebrimbor's secret forge when you are struck from behind. You look up to see Bellach holding the mould and gloating, \"Fools! My master will be pleased.\" As he turns to leave, he shouts to his servants, \"Kill them!\" You must escape the Orcs and recapture the mould!\n\n \n\nAfter leagues and days of travel dogged by dangerous foes, you finally hold the prize for which you have labored: a partial ring-mould retrieved from the secret and ancient forge of the Gwaith-i-Mírdain, the People of the Jewel-smiths, the same Elven-smiths who forged the Rings of Power in the Second Age of Middle-earth. The servants of Mordor sought to capture it, but by your courage and skill Bellach has finally been defeated and his Orcs scattered.\n\nYour companions fall silent as each of you gazes at this venerable relic of an earlier Age. The interior of the mould is lined with an inscription of flowing Elvish runes, perhaps written by the hand of Celebrimbor himself. If the ring-mould had been brought to Mordor, it would have surely given Sauron more strength. But in Isengard, there is hope that Saruman the White will be able to use the ring-mould to combat the power of the Enemy.\n\nEager to see this powerful artifact in the hands of the Wise, you begin your return trip to the Wizard’s Vale without delay. Keeping the Misty Mountains to your left, you journey towards the Old South Road that will lead you back to Isengard. A few days travel brings you back to the borders of Dunland. As you climb the highlands of that country a new sight gives you pause: smoke rises over the hills in the distance and carrion birds circle above the reek.\n\nWar has come to Dunland.\n\n \n\nThe Antlered Crown\n\nThe signs of war littered the hills of Dunland. Everywhere the heroes looked there was smoke and blood and fire. Across a wide valley, the bodies of Dunlending warriors lay slain in the dirt. Some wore the trappings of the Boar tribe, others were dressed with Raven feathers.\n\nAs the heroes searched the battlefield for survivors, they were alerted to an approaching troop by the tromp of marching feet. Looking in the direction of the sound, they descried the banners of the Boar Clan flying above an army of Wild Men. Striding proudly at the front was chieftain Turch wearing the Antlered\n\nCrown. He halted when he saw the heroes.\n\n“Well met,” said the chief with a smile. “I am glad to see you again, but you cannot travel any further; our country is at war.” His face was stern, but his eyes were weary.\n\nHe removed the Antlered Crown  and wiped his brow, then regarded the thing in his hand and frowned. “The Antlered Crown has not united the Dunlending clans as I had hoped. The leader of the Raven Clan has rejected my leadership and laid claim to the crown for himself, instigating this fight.” The large chieftain spat in the dirt to show his disdain.\n\n“The cowards of the Wolf Clan have reserved their allegiance for the moment, but if they should ally with the Raven, I fear we will be overmatched,” he explained. Then, looking at the heroes he continued, “Yet, if the emissaries of Saruman were to ally themselves with us, the Boar Clan would surely be victorious!\n\nAnd you would return to Isengard with the friendship of a united Dunland. What say you?”\n\nThe heroes were reluctant to fight in the Dunlendings’ war. Yet, even if they refused, it seemed unlikely that they could escape Dunland unscathed. Better to fight alongside the Boar Clan than to flee into danger, they decided, especially if it meant they might earn friendship of the Wild Men for Saruman. Surely the threat of Mordor demanded that all free peoples unite together?\n\nSeeing an opportunity to strengthen the West, the heroes agreed to march with Turch and his clan.\n\n“Excellent!” bellowed the Boar chieftain. “Come, the Raven Clan is still scattered among the hills. We must find their chief before he gathers the rest of his clan to him. If we defeat the chief of Ravens, the rest of his clan will submit.”\n\nChieftain Turch placed the Antlered Crown back on his head and signaled to his men, “We march!”\n\n \n\nOn your return journey to Isengard, you find war in Dunland. The Raven Clan has refused the Boar's claim to The Antlered Crown, and chief Turch asks you to join his Clan as they march to battle. Seeing an opportunity to earn Saruman the friendship of a unified Dunland, you agree to join forces and fight...\n\n \n\nChief Turch's goal is to defeat the Raven Clan before they can marshal their full strength, but Dunland is a vast country and there is much ground to cover. The longer it takes to subdue the enemy, the more time they have to gather...\n\n \n\nThe warriors of the Raven Clan won't stop figting as long as their leader spurs them on. You must find the Raven Chief and defeat him in order to break the spirit of his men and bring and end to this conflict...\n\n \n\nChieftain Turch leads the warriors of his clan in a victory shout, then turns to you with a wide grin. “The three clans of Dunland are united at last. Now that the Raven Clan is defeated, the Wolf Clan will support my rule and the Dunlendings will be one people again.”\n\nThe large Dunlending leans closer so that only you can hear what he says. There is real concern on his face. “It pains me to think that I fought against the servants of Saruman at our first encounter. Please tell your master I regret those deeds, and that I desire only friendship with Isengard. The people of Dunland are in his debt.”\n\nYou promise to share Turch’s words with Saruman when you return to Isengard. “Good,” says the chieftain, looking relieved. “I believe that the services you have done for the White Wizard shall long be remembered.”\n\nAfter parting with the Boar Clan, the remainder of your journey to Isengard is uneventful. Upon reaching the great tower of Orthanc, you are greeted by Saruman. The Wizard’s face displays a triumphant smile when he learns that you have been successful in your task.\n\n“Well done!” he congratulates you as you tell him of your journeys. There is a gleam in the Wizard’s eyes as he accepts custody of the ring-mould taken from Celebrimbor’s forge. “I shall examine this mould carefully,” he says. “I am certain a close study of this artifact will give the Wise new strength with which to fight the Enemy.”\n\nWhen you tell the tale of your encounter with the Wild Men of the Boar Clan, Saruman lifts an eyebrow and strokes his beard. “You have exceeded my expectations by earning the friendship of Dunland. This is an event of great import.”\n\nThe Wizard peers out a tall window of Orthanc, deep in thought. “An alliance between Isengard and the Dunlendings could bring an end to their age-long strife with Rohan, and bring order to this region. I will need to send an envoy to their chieftain soon: one who can speak for both Isengard and Rohan. Perhaps King Théoden will consent to send Gríma. He is deep in both our councils.” Turning back to you, Saruman’s pleasure in your accomplishments is evident. “You have done great things, my friends, and you have my gratitude,” he declares.\n\nAfter a couple weeks of rest, it is time to resume your journey north. Saruman accompanies you from his tower to the gate where the guards bring your horses to you. As you climb into your saddles, the Wizard gives you a parting instruction, “Give my greetings to Master Elrond in Rivendell, but pray, speak nothing of the ring-mould. The eyes and ears of Mordor are everywhere, and even the Wise are not safe. Better that it’s whereabouts remain secret.”\n\nYou can see the wisdom in Saruman’s request and you swear to tell no one of your discovery. “Excellent,” he says, lifting his voice. “I wish you good speed in your travels. If you see Mithrandir, give him my greetings as well. Farewell!”\n\nYou ride out from Isengard and the gates close shut behind you. You have ended one journey, only to begin another. As you set out for Rivendell, you consider all your accomplishments and celebrate, if only for a moment, the great deeds you have done in Saruman’s service.\n\n \n\n \n\nEXTRA MATERIAL\nIdraen\n \nThe autumn sky was just beginning to darken as the Ranger's keen eyes picked up a sign of the missing girl's passing. It was a piece of stiff wooden fibre, which she plucked from the muddy ground outside Chetwood's northern edge. To most, it would seem inconsequential, but the Ranger knew better. She recognized the weave from Ashleigh's basket. The missing girl was bright, happy and simple; her favorite pastime was picking berries along the edge of the woods. The Trail was still fresh.\n \nWith skill drawn from decades of experience, the Ranger tracked many footprints leading north - farther north than the missing girl had ever dared travel. The many tracks only confirmed what she had already concluded. Ashleigh was traveling with company, whether by choice or by captivity. Ashleigh's mother had feared the same when she approached the Ranger on the road leading out of Archet just a few hours before. The simple folk of Archet knew little of her motivations and less of her origins, and only called her \"Hawk\" or her unnaturally keen senses and grim visage. Rumour was that Hawk had no home, and cared little for company. Though not strictly false, rumours had a habit of exaggeration.\n \nHawk ventured north for several more hours with great haste. Her quarry's tracks were occasionally broken by dry, rough terrain and she often found herself guided by her intuition alone. She knew these lands better than any who called it their home. The clouds above began to gather as she finally reached the Weather Hills, and the Ranger started to move quietly and slowly, guessing that they would be setting camp for the night close by. As it often was, her hunch was correct.\n \nAshleigh's captors were men, probably bandits who made their living terrorizing the people of Bree-land. Ashleigh's mother must have known something of these bandits before asking the Ranger for help. The people of Archet tended to stay away from her kind out of fear and mistrust. They were unaware of the long lineage of the Dunedain and their tireless vigilance in defense of the region. She must have been desperate to turn to a Ranger for help.\n \nHawk watched them silently for some time while she waited for just the right time to strike. Ashleigh was bound and gagged, as though she'd been crying out. The men wore simple, torn cloths and leathers. They were armed with daggers, spears and blades, likely stolen from the guards or smiths in town. \"We'll wait a few days,\" one said while they prepared to set up camp. \"Then ransom 'er off at a good price.\" A cold fury rose within the Ranger, and she could stand to watch no longer. There was a crack of thunder above, and rain came swiftly after.\n \nThe din of the rain drowned out the sound of her advance. She slew the two men in the rearguard before they knew she was upon them. Their cries of pain warned the rest of the bandit company of trouble, but Hawk had taken them unaware, and had years of experience with her blade. By the time the rest drew their weapons and turned to face her; the battle was already near its end. \"Kill her!\", one yelled, and they came at her all at once, attempting to surround and overtake her.\n \nJust as Hawk planned, the bandits were ill suited to fight in the rain and slippery mud. The Ranger, however, was well acclimated to fighting in harsh weather. With cold precision she parried each of their blows and struck them back in turn, the sound of whistling steel and snaps of thunder filling the evening air.\n \nAll but one fell by her hand, the last dropping his weapon and fleeing for his life. After noting the direction of the man's flight, the Ranger untied Ashleigh, took off her cloak and wrapped it around the young girl to protect her from the cold rain. \"H-hawk?\" Ashleigh asked in a trembling voice, scared both from her ordeal and of the Ranger who'd saved her; having been told many times to stay away from the wandering folk.\n \n\"My real name is Idraen,\" the ranger replied, giving her real name for the first time, \"and I am not here to harm you.\" She brushed a bit of mud off of Ashleigh's cheek and smiled warmly. \"Come now, your mother is worried.\" After a long moment, the girl smiled back.\n \n \nDESIGN NOTES\n“But I rode to the foot of Orthanc, and came to the stair of Saruman; and there he met me and led me up to his high chamber. He wore a ring on his finger.”\n-Gandalf, “The Fellowship of the Ring”\n \n“The Ring-maker” cycle suggests how Saruman was able to build the martial capabilities of Isengard prior to the events that unfold in The Lord of the Rings.\nWhile Saruman certainly would have gathered much knowledge on ring-making over his many years of study, our story provides an explanation for how he acquired an important piece of that puzzle: an old mould from Celebrimbor’s lost forge. With a newly-forged ring of power, we suggest that Saruman was able to reshape life and create his army of fighting Uruk-hai from the essence of the great mountain orc Mugash. Our story further seeks to explain how Saruman was able to befriend the Dunlendings who later would do his bidding during the War of the Ring.\nIn The Lord of the Rings, Tolkien provides only a few details on the culture and origin of the Wild Men of Dunland. For the purposes of our drama, we take the liberty to assume they were a clannish people suffering from internal struggles. Based on Tolkien’s Nordic and Saxon inspirations, we guess that his vision for the Dunlendings could have been rooted in the early peoples of the British Isles, such as the Britons, Welsh, or Picts. The early tribes of Britain were routed from their pastoral lands by the Saxons, just as the Dunlendings were displaced from the plains of Rohan by the horselords of Eorl. To this end, we use the concepts of clans, chiefs, and druidic imagery such as the “Antlered Crown” to give cultural flesh to the Dunlendings.\nWe hope our interpretation of the events surrounding Saruman’s secret rise to power is interesting and sensible to fans of The Lord of the Rings. It is, of course, our interpretation, and we do not claim to know Tolkien’s mind in these matters. For the sake of drama and adventure, we make a few assumptions in our story. For example, we assume that Saruman sought help in building some of the foundations of his powers, above and beyond what he learned (and trusted to be true) from the Palantir. As described in The Lord of the Rings, we assume Saruman was able to procure help by manipulating neighbors and travelers, in part by using the persuasive powers of his voice.\nThe delicious irony in our story is, of course, that it is the player’s heroes who take the role of unsuspecting pawns in abetting Saruman’s long journey to power.\nThe story told in “The Voice of Isengard” and “The Ring-maker” cycle contains a few stretches that we hope hard-core The Lord of the Rings fans will forgive. It is unlikely, for example, that Celebrimbor’s forge would have survived the fall of Hollin during the Second Age. Sauron himself would certainly have remembered its location, for it was here, disguised as Annatar, that he studied ring-making. However, for the purposes of our tale, we suggest that is was not outside Celebrimbor’s abilities to shield the forge’s location from Sauron’s mind, for the powers of the Elven rings were still strong in Middle-earth at the time of Ost-in-Edhil’s fall.\nOverall, we hope to have told a compelling tale that conceivably could have rested within Tolkien’s historical framework for Middle-earth. We hope players enjoyed our attempts to stay within Tolkien’s vision, and we hope, above all, that players had great fun in overcoming the challenges presented in “The Ring-maker” cycle.\nEdited August 18, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1706454","commentId":1706454,"userName":"PsychoRocka","timestamp":1438067167,"content":"THE LOST REALM + ANGMAR AWAKENED CYCLE\n\n \n\nIntruders in Chetwood\n\nThe House of Elrond was bustling with preparations. Fall was turning the leaves on the tress of Rivendell to flaming colors, and the valley echoed with the singing of merry voices. The Elves were gathering the last of the summer harvest to celebrate the Autumnal Equinox. All were busy except the Master of the House and his guests, a band of weary travelers who had recently arrived from important errands in Gondor and Dunland. The heroes were tired from a journey of many leagues fraught with peril, and Elrond had welcomed them to rest in his home and tell what they could of their adventures.\n\nIn the Hall of Fire, Elrond spoke with the heroes at length concerning their service to the White Council. Many great deeds they had done to forestall the growing power of Mordor, and for their acts of valor, Elrond made them honored guests and bid them stay until they were refreshed.\n\nWhile they spoke with the Elf-lord, a messenger entered the Hall to announce another traveler newly come to Rivendell. Behind him stood a tall man of proud bearing. He wore the weather-stained garb of a Ranger. From the man’s appearance, it was clear that his errand was urgent.\n\n“Mae govannen, Dúnadan,” said Elrond. “The sons of Valandil are welcome in Imladris.”\n\nThe Ranger placed his hand over a hawk pendant he wore on a chain around his neck and bowed. “My lord,” he spoke, “my name is Iârion, and I have ridden here in haste to seek my kinsman, Aragorn. There is evil afoot in the untamed lands north of Bree, and we Rangers have need of our Chieftain.”\n\n“The son of Arathorn is not here,” answered Elrond. Gesturing for the Ranger to sit in the empty chair next to him, he continued: “But tell me more of your errand. Long have the Dúnedain kept the villages of Bree safe with secret vigil, yet seldom have they sought for aid in that thankless task. What evil drives you here now?”\n\nThe Ranger took the seat that was offered to him before explaining: “Orcs have been discovered west of the Weather Hills in greater number than we have seen them in many years. They are spying out the land, and we believe they plan to attack.”\n\n“Alas, Aragorn is far afield with my sons and the warriors of my house,” replied Elrond. Until they return, I have no one to send to your aid.”\n\nIârion looked downcast but mastered himself before speaking: “Then I must return at once to my kinsmen and help them prepare as best I may.”\n\n“I will tell your Chieftain of the threat to his people as soon as he returns,” said the Elf-lord.\n\nThe Ranger stood up, bowed to Elrond, and turned to leave, but the heroes who were sitting there rose to their feet and stepped forward. “We will come with you,” spoke one, and the rest nodded in agreement.\n\n“I thank you strangers,” replied Iârion. “But as Master Elrond has said, our deeds are secret and thankless; we Dúnedain receive no reward for our sacrifice, and neither do we have any to offer.”\n\n“Hunting Orcs is its own reward,” said the hero evenly. He continued, “We will not sit idle here while you and your folk fight this battle. Not while we have strength left. We will come.”\n\n“Then let us ride swiftly to the aid of my people,” said Iârion with fresh hope in his eyes.\n\n“May the favor of the Valar be upon each of you in this task,” spoke Elrond in farewell.\n\nTogether the Ranger and the heroes bade farewell to the Last Homely House. They rode west from the valley of Rivendell toward the villages of Bree-land. They followed the Old Road over the Last Bridge all the way to the southern end of the Weather Hills. There they turned aside to climb Weathertop, the tallest of the hills. Its summit commanded a great view of the surrounding area, and Iârion told his companions there would be Rangers keeping vigil there. From them, the Dúnadan hoped to learn some news before pressing on.\n\nWhen they reached the top, they found two Dúnedain who greeted them. “Ho, Iârion, I see you have brought others to help us, but I fear it may be too late,” one of them said grimly. “A large number of Orcs descended from the hills last night. A war party it seemed to us, but moving warily and avoiding the road. We watched them creep north and west along the edge of the marsh until they disappeared beyond the fens.”\n\n“It is likely that they mean to come upon the villages of Bree-land from the north,” replied Iârion looking in the direction the Rangers indicated. “Our people in Chetwood must be warned! One of you take my horse and ride with haste to do so. My companions and I will follow the Orcs and do what we can do to delay them.”\n\nTurning to the heroes, Iârion laid his hand on the pommel of his sword as he addressed them: “There are many lonely homesteads north of Bree. We must do what we can to track these Orcs and safeguard those people. Come!”\n\n \n\nRangers have sighted a large group of Orcs making its way towards Bree-land. The Dúnadan, Iârion, has asked you to help him intercept the war party before it can reach the quiet village. The Orcs are a day ahead of you and moving fast, but there is hope you can catch them with the Ranger’s tracking skill…\n\nYou must move swiftly to prevent the Orcs from reaching Bree-land!\n\n \n\nIârion leaned on the hilt of his sword and watched the last of the Orcs flee to the east, away from peaceful villages near at hand. The Ranger and his company of heroes had chased their quarry to the very borders of Bree-land, where they forced their enemy to turn and give battle.\n\nThe war-party was better armed and better disciplined than the sort of ordinary rabble the Ranger was accustomed to hunting, but in hindsight it seemed clear to Iârion that the Orcs were bent more on pillaging than fighting, for they broken and fled after only a short battle.\n\n“Clearly these Orcs did not expect to be met by such determined resistance,” said one of the heroes triumphantly, looking down at the body of the last Orc he had slain before the rest turned to flee.\n\nRoused from his tired musings, Iârion turned to face the man and replied gravely, “Yes, but the audacity of their attack unnerves me; the Orcs have not dared to venture this far west in years. What is it that leads them here now?”\n\nThe heroes could see the concern in the Ranger’s eyes, and the rush of victory faded as they considered the implications of his question.\n\n“I’m afraid our work is not yet finished, my friends,” said Iârion, gazing into the distance. “There is to be a gathering of the Dúnedain at Fornost in a few days to celebrate the Autumnal Equinox. I must go thither with news of this attack, for I fear it is but a prelude of things to come, and the Rangers must be ready for what follows.”\n\nTurning to the heroes with him, Iârion continued, “However, we cannot allow those Orcs that fled to escape, or they may return again in even greater numbers. Since I must go to Fornost, I ask you: will you track them in my stead?”\n\nFrom the strained look in his eyes, the heroes could see how hard it was for the honorable Ranger to burden them with this dangerous task, so they made him an oath that none of the Orcs who had ventured so close to Bree would live to return again.\n\n“Well said,” replied Iârion. Then, he raised his sword in salute and spoke, “May the spirit of Oromë guide you on your hunt!”\n\nWith that, the Ranger sheathed his blade and hurried away. The heroes watched him head north along the Greenway for a minute before turning their eyes to the east and the trail of their enemies.\n\n \n\nThe Weather Hills\n\nFor days, the heroes pursued the remnants of the war-party east from Chetwood across the northern edge of Midgewater Marshes and into the wide plain beyond. Along the way, they came upon several burnt homesteads. Each was plainly the work of Orcish savagery. However, at each home, the heroes were surprised to find no bodies. Instead, they found signs of struggle and the unmistakable tracks of Orcs dragging their captives away. \n\n“Why would retreating Orcs stop to take prisoners?” asked one of the heroes, examining the impressions on the ground.\n\n“Perhaps they think to ransom their lives?” answered another as he emerged from the charred ruin of a collapsed hovel.\n\n“One or two prisoners would have sufficed if that were their intent, but these Orcs have taken a dozen at least,” replied the first. “Look at the markings here.”\n\nThe man in the doorway knelt by his companion to examine the earth more closely. After a minute he said, “I think I see the answer to this riddle: The Orcs we chase are not the same that attacked this home, though it is likely that they are in league with each other. Look here! The prints made by this family as they struggled against their captors are at least a full day older than those of the Orcs we have pursued here.”\n\nThe rest of the heroes agreed that he was right, but this discovery did little to ease their mood since it suggested the attack near Bree was only part of a larger plot. There was a brief silence as each member of the company contemplated what that might be.\n\nAt length, one of them spoke, “If the Orcs are in league together,then it is likely that the ones we hunt will lead us to their meeting place. There we may hope to find those who were captured. Even if we cannot rescue them, we can at least avenge ourselves upon their captors!” The rest agreed that this was their only course of action,and they resumed the chase.\n\nThe Orcs’ trail led them north and east towards the Weather Hills. As they marched, the sky above them grew dark with clouds driven by a chill wind out of the north. By the time they reached the first rocky slope of the hills, it was unusually cold.\n\nThe heroes drew their cloaks about them, but it did little to keep out  the frosty air. As freezing rain began to fall on the heroes in heavy drops, one of them lifted his eyes skyward and said aloud, “This is\n\nan ill omen, my friends. The weather turns against us and washes out our trail. I fear there is some new evil at work here that gives aid to our enemies.”\n\nThere was some murmur of agreement among the company before another spoke up, “It matters not whence the rain comes or if the trail ends; our quarry hides somewhere in these hills, and we must find them or forsake their captives and our oath.”\n\nThere was a hushed ring of steel as each of the heroes drew his weapon in silent reply. The heroes pulled up their hoods and began to search the hills for sign of the Orcs...\n\n \n\nYou've pursued the remnants of an Orc war party east from the borders of Bree-land and into the wilderness beyond. Their trail climbs out of the lowlands and into the Weather Hills.\n\n \n\nAs you pursue the Orcs, the weather itself turns against you. Now you must contend with the elements while you hunt the enemy.\n\n \n\nYou've hunted the Orcs to their secret gathering place on the northern edge of the Weather Hills: the old Dúnedain border fort of Amon Forn. With nowhere left to run, the Orcs turn and fight with desperate savagery.\n\n \n\nAlready weary from days of travel through harsh weather, you are hard pressed to match the Orcs' ferocity. You must rally your men or see them fall!\n\n \n\nThe Orcs had made their camp inside an old Dúnedain border-fort built at the northern edge of the Weather Hills in the Second Age during the war between Arnor and Angmar.\n\nThe ancient wooden gates were destroyed with age and the Orcs could not stop their pursuers from entering in. Once inside, the heroes fulfilled their oath to Iârion by slaying every Orc they found hiding among the ruins. After the fighting was finished, the heroes cleaned the blood from their weapons and began searching for the Orcs’ captives. Inside what might once have been the great hall of the fort, they found the mutilated bodies of several villagers. Their desecrated corpses were arranged at the center of an evil pattern on the floor. The victims had clearly been sacrificed as part of some unholy sacrament, but none could guess what it was. Then did the heroes rue their decision to slay all the Orcs without questioning them first. “This is not Orc work,” said one of the heroes who looked with horror at the scene. “This is foul sorcery.” “Aye, but whose?” asked another in reply. “Let us search the rest of the fort in hopes that we may find the answer,” said a third, covering his mouth and turning his face away from the bodies.\n\nAt the far end of the hall, they found a darkened stairway leading down. The heroes lit a torch and descended the narrow passage as it twisted its way underneath the fort. At the bottom of the stairs they found a dank cellar sealed by a locked door. From inside they could hear shuffling and whimpering sounds.\n\nThe heroes forced the door open and thrust a torch inside. The flickering orange light revealed a small group of survivors huddled together in a corner. They appeared half-starved, and they shivered in the cold dungeon. The heroes removed their cloaks and placed them around the unfortunate prisoners to help warm them. The air was cleaner outside, so the heroes led the survivors back up the stairway and away from the dungeon. But as they passed the bodies in the hall, the rescued captives screamed and wept.\n\n“Who has done this?” asked one of the heroes, but they were too distraught to answer. Outside the wind had died down and the rain had stopped. The heroes lit a fire in the courtyard of the old fort and the survivors gathered around it. At length, an older man named Thaurdir spoke, “We didn’t see what happened. We couldn’t. They kept us locked in that dungeon for days without any light. We could only hear the screams...” His voice trailed off. The man’s hood covered most of his face so the heroes could not see his expression. After a moment he continued, “We could hear the harsh voices of the Orcs too, but there was another voice that commanded them. I don’t know what kind of creature it was, but it was terrifying to hear.” “We found none but Orcs when we arrived here,” spoke one of the heroes. “Then it must have escaped,” answered the old man.\n\n“If that is so, we cannot stay here,” replied the hero. He turned to his companions and said, “We should take these people to Fornost where the Rangers are gathered. Iârion will want to hear what they can tell him of their capture.” Turning to the former prisoners, he said, “You will be safe there.” The rest of the heroes voiced their agreement, but the traumatized survivors merely nodded. After they had given their charges something to eat and water to drink, the heroes began their slow march to Fornost.\n\n \n\nDeadmen's Dike\n\nIt was a long journey from the Weather Hills to Fornost Erain, made longer by the weary survivors the heroes were escorting. The unfortunate villagers had suffered much hardship during  their captivity, and the unusually cold weather did not improvetheir condition. Soon they were all sick from their ordeal. In\n\nthe end, the heroes had to send a runner ahead to summon help from the Dúnedain they were seeking.\n\nWith help from the Rangers, the heroes were able to bring the survivors safely to Fornost. Once the capital of Arthedain, the ancient city was abandoned after the war with Angmar, almost a thousand years ago. Now the desolate ruin was called Deadmen’s Dike, yet on high days, the Dúnedain still gathered\n\nthere, as they did now.\n\nIârion and a younger Ranger were there to greet them when they entered the city gates. The noble Dúnadan had a look of wonder on his face as he watched the heroes bring the survivors inside the walls. “You have exceeded your oath in saving these people,” he exclaimed. “On behalf of the Dúnedain, I thank you friends. Come, join us at the council fire and tell us your tale. My brother, Amarthiúl, will take care of your charges.”\n\nThe younger Ranger, a man of good stature, brought the survivors to see the healers while Iârion led the heroes to the central square of the city. A council of Dúnedain were gathered there around a large fire. In the place of honor was their Chieftain, Aragorn, son of Arathorn. He looked at the heroes with keen interest as Iârion introduced them, “Here is the valiant company that helped us defend the villages of\n\nBree-land and pursued our enemies to their hiding place in the Weather Hills. They have come here with the survivors they rescued from the Orcs, and with evil news.”\n\nThe heroes described for the Rangers the details of their adventure: the burnt homesteads, the Orcs’ captives, the old border-fort of Amon Forn, and the grisly sacrifices. After the whole account had been made, there was a long silence before Aragorn finally spoke “Your tale is full of woe,” said the son of Arathorn,“We have not heard of such evils since the fall of ancient Angmar.”\n\n“Indeed,” replied Iârion, “their tale bears the very trappings of Angmar. The king of that cursed land was a powerful sorcerer, and many stories such as theirs were heard in his day.” “Aye,” answered Aragorn, “but the armies of Angmar were defeated, and the Witch-king fled the North. That fell wraith\n\nnow commands the fortress of Minas Morgul and threatens Gondor with war. These foul deeds cannot be his doing.”“And yet the crimes we hear of now are the same as were uncovered in this very city when it was recovered from Angmar many years ago,” insisted Iârion. “If they are not the Nazgûl’s work, then perhaps one of his disciples has returned to take his place?”\n\nAs the Dúnedain debated this question, the setting sun fell behind the hills of Evendim to the west, and the sky darkened above them. From another part of the city there came a shrill cry, and a moment later Amarthiúl came running towards the council.“Iârion! Iârion!” he shouted between breaths. “We are betrayed!” “What is it man?” asked Iârion. “What has happened?” “Black sorcery!”\n\nsaid Amarthiúl, seizing Iârion’s arm. “One of the survivors. The old man. The one called Thaurdir. He...”\n\nThe younger Ranger took a breath, “He is a wraith!”“A wraith? How did you learn this?” asked Iârion with an astonished voice. “When I brought the survivors to see the healers, I saw the old man slip away. I thought that suspicious, so I followed him in secret,” explained Amarthiúl, speaking quickly. “He walked\n\nstraight to the tombs and there cast aside his cloak. His face was drawn and withered like a corpse, but his eyes!” The young Ranger blanched, and then continued, “I made no sound, yet he looked straight at me where I hid among the shadows, and Iknew he could see me with those hollow eyes. Being discovered,\n\nI drew my sword to confront him, but he merely laughed. It was the most horrible sound I’ve ever heard! Then, from the open tomb behind him, I could see the spirits of the dead gathering around him. That is when I ran here.”\n\nIârion was about to reply when the flames of the great fire suddenly burst into the air and then died, leaving the Rangersin total darkness. All about them, a chill fog gathered. From within the black mist they could hear scraping and rustlingsounds. As their eyes adjusted to the dark, they descried the horrid outline of many ghouls in rusted armor surrounding them. The dead faces glared at them with hollow eyes, and\n\nrotted hands raised ancient blades to attack.\n\n“To arms, Dúnedain!” shouted Aragorn, drawing his blade. “The wraiths of Angmar are upon us!”\n\n \n\nYou've brought the prisoners you rescued from the Weather Hills to Fornost. The Rangers gathered there are shocked to hear what you discovered at Amon Forn. Before their Chieftain can decide what to do, an unnatural fog covers the ruins in darkness, and the spectres of dead warriors emerge from the mists to attack you!\n\n \n\nThe foul sorcery that drives the ghouls against you attacks your mind as well, and you fight to master your fear in the face of an unrelenting enemy. The question of who works the evil spell is answered by the appearance of a dark figure. The old man you had thought to be the Orcs' prisoner has revealed himself to be a powerful wraith. He must be stopped!\n\n \n\nThe Rangers were unprepared for an attack, and they were nearly overmastered by the sudden onslaught of Thaurdir andhis ghouls. But the heroes who stood with them rallied the Dúnedain to victory with their unyielding courage. Even so, it was a frightful battle. Swords were not the enemy’s only weapon, and the fear of them nearly drove the heroes mad. Yet as the dawn drew closer, the sorcerer’s spells began to fade and the Rangers gained the upper hand. However, just as victory seemed assured, Thaurdir seized Iârion and fled the city. The brave Ranger was holding two enemies at bay whenthe sorcerer struck him over the head with a resounding blow.  Then, Thaurdir ordered two of his minions to retreat with the body. From behind a press of ghastly warriors, the heroes saw Amarthiúl give chase but they were unable to aid him becauseof the enemies that barred their way. As the first light of sun broke through the clouds, the heroes\n\nstruck down the last of their unnatural foes and ran after Amarthiúl. They found him at Deadmen’s Gate; his eyes glazed in a stupor. He still wielded his sword and struck at the air around him, but there were no ghouls left to fight.“Amarthiúl!” cried one of the heroes, “The dawn has come, and the enemy has fled.”\n\nThe Dúnadan lowered his sword and regarded the heroes as one waking from a dream. “I couldn’t reach him,” he muttered as he fell to his knees. “When I saw them take Iârion, I tried to follow. But the fog grew thick around me, and I lost my way.” “It was an evil spell that clouded your eyes,” said one of the heroes, trying to comfort the young Ranger. “The wraith that attacked us was a powerful sorcerer. It was he\n\nthat took your friend. Why?” asked Amarthiúl, but none could answer. On the ground, the young Ranger found the hawk pendant of Iârion and regarded it in his hand. “It matters not,” said the Dúnadan clutching the pendant and rising to his feet. “Thaurdir has taken my friend, so I will pursue him.” “We will aid you in this quest,” spoke the heroes with one voice. “We cannot abandon Iârion to the same fate as those village people.” “Then let us depart swiftly,” said Amarthiúl, sheathing his weapon. “We may still rescue him if we move quickly!”\n\n \n\nThe Wastes of Eriador\n\nThe battle at Fornost was fierce and bitter, and left many of the Dúnedain wounded. The sight of the wraiths had verynearly broken their spirit, and had it not been for the valiant efforts of Iârion’s companions, the Rangers would not have withstood the attack. Once dawn had finally arrived, the\n\nDúnedain recuperated their strength, shoring up the defenses of Deadmen’s Dike and tending to the wounded.\n\nAmarthiúl had other concerns. Iârion had been captured during the battle by the Wraith Thaurdir, and there was still time to come to his aid. The heroes who had helped defend Fornost vowed to rescue Iârion as well, and so their hunt began. It didn’t take long for them to find the enemy’s tracks leading\n\nnortheast into the hills.\n\nThaurdir and the remnants of his forces, including the minions that subdued and captured Iârion, were making great haste across the North Downs. Despite the enemy’s efforts to get away, the heroes were smaller in number and eager to pursue their quarry. Iârion’s captors took little care to cover their tracks, and so the hunters spent many hours chasing afoot without stopping to rest, eat or find their bearings. They traveled far into the night, hoping to overtake Thaurdir under the cover of darkness. But when the sun rose over the green hills, they had still closed little ground on their adversary.\n\nAmarthiúl looked north to the horizon and sighed, worry etched upon his brow. “It’s no use. Thaurdir is a Wraith of the shadow world, and his minions care not for food or rest. They travel unhindered for weeks without feeling weariness, while we struggle to keep pace.” He turned to his companions, forlorn.\n\n“Patience, my friend,” one of the heroes said, clasping Amarthiúl’s shoulder. “Whether it be at sunset tonight or a fortnight from now, we will not stop pursuing them until we have rescued Iârion. They must have some need of him alive, for we have seen no sign that harm has befallen him.” “Indeed, although that thought worries me equally,” another of their company said. “Amarthiúl, what do you know of Iârion?\n\nWhat reason would Thaurdir have to take him captive? Surely Aragorn, Chieftain of the Dúnedain, would have been a greater prize.”\n\nThe young Ranger took Iârion’s pendant from one of the pouches he wore across his belt and stared at it remorsefully. “I... I am not sure,” he said, shaking his head. “Iârion comes from a noble bloodline, that I do know. This is the symbol of his house,” he explained, showing the heroes the pendant of the hawk-in-flight they’d seen Iârion wearing. “A lesser prize than Aragorn you say, and no doubt that is true. But Aragorn’s true heritage we have long kept hidden from the Enemy. Iârion’s heritage needed no such safekeeping. As long as I’ve known him, he has worn this pendant proudly.” The Ranger’s eyes narrowed and he looked at the heroes with bitter vengeance deep in his thoughts. “Whatever the reason, I know what I saw at Fornost. Thaurdir could have taken many others, but left them dead or wounded instead. When Iârion challenged him, he sent his minions one at a time, sacrificing them to Iârion’s blade in order to wear him down. He meant to capture Iârion alive. Perhaps that was his goal all along.” The rest of the\n\ncompany nodded in response to Amarthiúl, whose logic seemed sound.\n\n“All the more reason why we must pace ourselves,” one of the heroes said. “We are no help to Iârion falling over with exhaustion. We must be ready to fight when we reach the Wraith. Let us press on!”\n\nThey continued to track their quarry for many miles, keeping a more sustainable pace, resting briefly when necessary and pressing onward with haste when the enemy’s tracks led them downhill or through level country. Eventually they reached the edge of the North Downs, where the green hills gave way to the\n\nvast and desolate lands of northern Eriador. The weather grew colder and fouler the further north they traveled. Snow and freezing rain began to pelt their cloaks and hoods, and for the first time since departing Fornost, they felt the need to camp for the night.\n\nThat was the first night they heard the howling. It came from all around them, growing louder with each passing minute. One of the heroes took charge and alerted the rest of the company. “We cannot tarry. The wolves here are evil and vicious, and the darkness of night is their hunting ground.” They quickly broke camp, the weight of weariness beginning to take its toll. Throughout the night, the incessant baying of wolves was everat their heels. Amarthiúl gave voice to their common concern: “I fear our hunt has just become theirs...”\n\n \n\nFollowing the surprise attack on Fornost, you have agreed to help the Ranger, Amarthiúl, track the villains who captured his friend, Iârion.\n\n \n\nYour enemies' tracks lead you across the North Downs towards Angmar. In the barren lands between you and that dread realm, the nights are black and bitter cold, but it is the howling of Wargs that gives you chills.\n\n \n\nWargs have pursued you into the wastelands! They hound your every step, slowing your progress by day and attacking you when the sun has set.\n\n \n\nEach night, another member of your company is caught at the edge of the firelight and dragged away. The sounds of snarling and screaming echo into the darkness.\n\n \n\nYou cannot go on like this. You must do something to discourage the Wargs from pursuing you further.\n\n \n\nIf you can defeat the alpha male, that will scatter the pack...\n\n \n\nThey had endured the freezing cold and the biting fangs of evil wolves for many days, traveling as far as they could by day and fending off fierce attacks each night, but over time the company had grown weary. Defeating the pack’s leader had cause the creatures to retreat, but spending restless nights chased and harassed by wolves had forced them far off track, close to the peak of Mount Gram which towered into the northern clouds. They were far from Thaurdir and their friend Iârion, with no way to tell them how much time had been lost fighting the evil wolves. Worse, they were far too exhausted to continue marching without sleep, and many of them had grown sick from the cold. What little game there was to hunt in the wastes had been scared off by the wolves, and the rations from Fornost were running out.\n\nAfter many days of these conditions, a night with no howling was a great relief. The company discussed at length whether this meant it was safe to camp for the night, but in the end, they were too hungry and weak to continue. Knowing they were in a dangerous position, they had no choice but to stop for the night.\n\nThat was when the Goblins struck. They emerged under the cover of darkness, clad in white fur that blended with the snow. The sentries that kept watch were taken from behind, pulled to the ground and gagged. One spotted the approaching Goblins and called out, but was immediately struck by Goblin-arrows. The sentry’s shouts woke the rest of the company, but taken by surprise and outnumbered nearly ten to one, the odds were grim. The largest of the Goblins stepped forward and grinned wickedly. “Surround them! Don’t let any escape!” it bellowed. “Gornákh wants them alive!”\n\nThe ensuing battle was futile. The heroes fought valiantly, but the heavy snow impeded their movement and the Goblins had a strong upper hand. Most of the company was knocked unconscious or cornered and surrounded. Others fought to the bitter end, though the Goblins seemed to be trying to take as many captives as possible. Those who resisted and could not be captured were pierced with stone arrowheads or spear-tips, and left to bleed in the snow.\n\nThe heroes were forced to submit, disarmed of their weapons, and bound. They looked amongst themselves for a moment before they realized that Amarthiúl was no longer standing among them. They weren’t sure if his body was among the slain. “Come along now, lads,” the larger Goblin growled, pulling one of the heroes to his feet and forcing him to march at spear-point. “Mount Gram awaits.”\n\n \n\nEscape from Mount Gram\n\nBlindfolded, the company was marched into the tunnels of Mount Gram. It seemed they walked for miles uphill, and through many winding corridors. When the blindfolds were removed, they were deep in the heart of the Goblin stronghold, with no knowledge of an escape route.\n\nGornákh’s dungeons were gruesome and awful. They smelled of rot and decay, and the floor was damp, covered in frost and slime. Flickering torchlight scarcely illuminated the dungeon’s halls. The Goblins separated the companions and brought them down different tunnels, passing by chambers filled with wicked instruments. Cries of lament and pain echoed throughout the dungeons, filling them with dread.\n\nThe companions were thrown into separate prison cells, all windowless and scaled with frost. Some were dragged to cells close to the dungeon’s entrance, and others were brought much further into the belly of the dungeons. Each was alone. Any attempt on their part to call out to their companions was met with a swift beating.\n\nOne by one, they were brought to the chamber of Gornákh, who interrogated them cruelly at the edge of a knife or whip, adding to their scars and their misery whenever they gave an unsatisfactory answer. Even so, none would dare betray their companions or their mission, and spoke nothing other than witty retorts or curses under their breath.\n\nOn rare occasions, they were offered a repulsive meat of unknown origin that smelled of death, and likely tasted just as bad, though none of them dared to eat it. After prolonged starvation, however, even this foul meat was starting to look tempting. Having lost track of time in the never-ending darkness of the dungeon, they started to wonder if there was any hope of escape. A seed of despair took root and began to grow.\n\nFinally, the monotony was broken when one of the company’s heroes overheard what sounded like a regiment of Orcs arriving in the dungeons. “Gornákh!” a familiar voice bellowed, his voice echoing throughout the halls. “We have come to claim your prisoners in the name of Daechanar!” The hero stood in her cell and leaned against the cold bars, trying to see past the darkness. There could be no mistaking that voice, warped and tinged with evil. It was Thaurdir, the Wraith they had confronted in Fornost. The one who had taken their friend.\n\n“But, we are the ones who captured them! They are our prizes, not yours… And I am not yet done playing with them!” Gornákh protested, angry with Thaurdir’s presence.\n\nThe voice of Thaurdir was cold and imposing. “Remember to whom you speak,” he responded. “Lord Daechanar has claimed these for his own. Bring them to Carn Dúm at once. They will make fine soldiers for the Lord of Angmar.” There was a long, sinister pause. “Or do I have to remind you what Lord Daechanar does to those who do not obey?”\n\nThe hero clenched her hand over the bars of her cell, surprised at the mention of a Lord of Angmar. The argument between Thaurdir and Gornákh grew heated. Several of Gornákh’s guards ran out of the hall, presumably heading to where the argument was taking place. The hero shuddered to think of what fate might befall the Goblin who defied Thaurdir—or worse, the fate that awaited the hero’s companions. Just then, a faint light crawled across the walls, and the lightest of footsteps approached the cell. The shape of a hooded man appeared, illuminated dimly by the light of a torch. The hero drew away from the bars cautiously.\n\n“Don’t fret,” the man whispered, and Amarthiúl pulled down the hood that covered his face. He raised a keyring and unlocked the door to the cell, and a wave of relief washed over the prisoner.\n\n“Amarthiúl! You came back for us!” the hero whispered, exiting the cell and embracing the Ranger.\n\n“Of course. After the battle with the Goblins, I escaped and managed to track everyone to this mountain. I couldn’t find a way in at first, but when Thaurdir and his Orcs arrived, I slipped in behind them. Once the jailor was distracted, I made my way to your cell. The way I came is now guarded by Orcs from the north. However, there is another exit, a hidden gate high in the southern end of the mountain. I overheard one of the Goblins talking about it.”\n\n“Good,” the hero replied. “We’ll find as many of the others as we can and make our way to this southern gate.”\n\nAmarthiúl hesitated for a moment, and clenched his jaw. “If Thaurdir is here, that means that Iârion is here as well. He must mean to bring us all north to Carn Dúm, together.” He handed his keyring to the hero, closing his companion’s hand around it. “There are many more of our company imprisoned here. Find them and make your way to the southern gate. I will try to find Iârion and meet you there.” The hero nodded, and the two clasped forearms. With that, the Ranger quietly headed back the way he came.\n\nThe newfound sense of freedom gave way to anxious dread. The halls were quieter than ever before. Alone and without weapons or gear, the task ahead was daunting. Even so, the rest of the company could not be abandoned. The hero steeled her resolve and went to work…\n\nYou have been captured and imprisoned by the goblins of Mount Gram.\n\nYou have endured much during your imprisonment in Mount Gram at the hands of a cruel goblin known as Gornákh. But before you are taken north as prizes for “Lord Daechanar,” Amarthiúl comes to your rescue. After he frees you, he slips off to find Iârion, whom you suspect is imprisoned nearby. Armed with only your wits and resolve, you must find the rest of your company.\n\nAlone and without your equipment, you steel yourself and begin to search for your companions and belongings.\n\nHaving rescued as many of your companions as you can find, you begin to make your way towards the dungeon’s hidden exit. By now Gornákh is surely aware of your escape, and the orcs that were with Thaurdir are now searching for you, as well.\n\nOrcs and Goblins rush to find you before you can make your escape. You must make haste if you wish to make it out of Mount Gram alive!\n\n \n\nYou have been captured and imprisoned by the goblins of Mount Gram. \n\n \n\nYou have endured much during your imprisonment in Mount Gram at the hands of a cruel goblin known as Gornákh. But before you are taken north as prizes for \"Lord Daechanar,\" Amarthiúl comes to your rescue. After he frees you, he slips off to find Iârion, whom you suspect is imprisoned nearby. Armed with only your wits and resolve, you must find the rest of your company.\n\n \n\nAlone and without your equipment, you steel yourself and begin to search for your companions and belongings.\n\n \n\nHaving rescued as many of your companions as you can find, you begin to make your way towards the dungeon's hidden exit. By now Gornákh is surely aware of your escape, and the orcs that were with Thaurdir are now searching for you, as well.\n\n \n\nOrcs and Goblins rush to find you before you can make your escape. You must make hast if you wish to make it out of Mount Gram alive!\n\n \n\nIn hindsight, the dank cold of the dungeon was tranquil in comparison to the icy weather outside. The narrow pass twisting down the snowy mountainside was slippery and treacherous, and one false step could spell doom. After cautiously making their way down the pass for hours, they reached the base of the mountain and hid in the treetops, and waited.\n\nIt wasn’t long before Amarthiúl descended down the narrow pass and the company was reunited at last. Iârion was not with him. “Thaurdir is aware of our escape,” the Ranger said grimly once they had said their greeting and taken stock of their numbers. “Our fortunes have turned. Now we are the ones being pursued.”\n\n“And what of Iârion?” another of their company asked, to which Amarthiúl’s response was solemn silence.\n\n“I tried to reach him,” he explained after a long pause. “He was held captive by the Orcs who came with Thaurdir. He was unconscious, but unharmed. I slew many of the Orcs, but that awful Wraith appeared and fought me back. He ordered that the Orcs take him to Carn Dúm, and held me at bay while they escaped.” Amarthiúl cursed and slammed his bloody fist against a nearby tree, furious and desperate. “I was beaten again. I barely made it out alive. And worse, Thaurdir is hot on our trial. I fear I’ve only made things worse.”\n\n“You rescued us from torture and death, or worse,” one of the heroes replied, comforting their friend. “For now we must regroup and get away from this awful place. I fear we cannot pursue Iârion’s captors north, not in our current state.”\n\n“Are we to abandon our mission, then? To abandon Iârion?” Amarthiúl asked. “No, we cannot. We must make haste towards Carn Dúm, to catch up with the Orcs and rescue him!”\n\n“I understand how you feel,” another one of the companions assured Amarthiúl, “but are we, alone and weary from our imprisonment, to confront all the forces of Angmar in their bastion of Carn Dúm?”\n\nAmarthiúl opened his mouth to respond, but he knew they were right. Most of them were wounded, and some hadn’t eated in days. Their clothing was torn, their rations long gone, and they had little of the equipment they’d brought with them from Fornost. “You’re right,” he said at last, sorrowful. “What, then? Have we failed in our quest?”\n\n“No,” the hero said with a smile. “Not yet. Not while there is hope. We know they desire Iârion alive, for whatever ill purpose. We have no choice but to head south, to Rivendell, to seek the counsel of Elrond and gather our strength.” He clasped his hand on Amarthiúl’s shoulder. “Perhaps then we can assault Carn Dúm to rescue Iârion. But there are many miles between here and Rivendell, and Thaurdir still pursues us. One step at a time, brother.” Amarthiul nodded, and the company set off to the south.\n\n \n\nAcross the Ettenmoors\n\nThe company had barely escaped from the dungeons of Mount Gram with their lives, thanks to the bravery of the Ranger Amarthiúl and the skill and guile of the heroes who rescued their companions. Heading south from Mount Gram, they found the return to Rivendell fraught with peril at every turn. The need for haste forced the company to travel into the wild lands of the Ettenmoors, a decision they quickly regretted. The Ettenmoors were an untamed and dreary land, overrun with Trolls and beasts that roamed the wilds, constantly searching for food. The heroes had recovered some of their belongings in the dungeons, but were exhausted from their imprisonment and in bad shape to be fighting such monsters. The rolling hills were beset with horrid weather. The skies did not clear for even a moment, a torrent of rain constantly pelting their cloaks. The rain muddied the ground, soaked their clothes and chilled their bones. The clouds overhead were obsidian. At night, they blotted out the moon and the stars, and the occasional flash of lightning was the only light to guide them. Now and again, a roar of thunder crashed around them, setting their ears to ring. There was little food to be found in the hills of the Troll-fells, and even less shelter. If they could find a haven - a small cave to hide in, or a patch of trees to give them cover - they could take a brief rest, safe from the Trolls and the rain. However, they would soon be forced to move again, for they would have to keep a steady pace to make it to Rivendell in time to help Iârion. At least, that was the reason they gave for their haste. They knew the Wraith Thaurdir was pursuing them still, and the thought of him catching up to them in this dreadful place brought terror to their hearts…\n\n \n\nYou have escaped from the prisons of Mount Gram, but you are not safe yet.\n\n \n\nYour trek through the Ettenmoors only gets worse as your injured company is pursued by hungry trolls and bettered by cold and rain.\n\n \n\nThis land is barren and untamed. Food is scarce, and you must take care to avoid the Trolls and other creatures that roam the moors. If you are lucky, you may find a safe place to hide and rest for a short time before your journey continues.\n\n \n\nYou are getting closer to the edge of the Troll-fells, but exhaustion has taken its toll. One way or another, this journey is nearing its end...\n\n \n\nYour wounded companions only slow your progress. With Trolls on your heels and foul weather overhead, you press onward.\n\n \n\nThe journey through the Ettenmoors was full of hardship and turmoil, but the company was able to persevere through the wilds. They had endured the cold and evaded Trolls–and worse–at every turn. When they scaled the last hill and saw the woods of Rhudaur before them, they breathed sighs of relief and rejoiced for the first time since escaping the Goblin dungeons.\n“This is the land of Rhudaur, one of the three kingdoms of old Arnor,” Amarthiúl explained as they entered the pine woods. “The line of Isildur did not survive in Rhudaur, and over time the number of Dúnedain here dwindled. The elders tell us that evil men, hillmen in league with the realm of Angmar, usurped the last king of Rhudaur many hundreds of years ago. From that moment on Rhudaur was a vassal of the Witch-king, and those Dúnedain still remaining in this land were either slain in cold blood, or fled west.”\n“You are well-schooled in the history of your people,” one of the heroes said in amazement.\nAmarthiúl smiled. “It is important that we Dúnedain remember who we are and where we come from,” he replied. “Our kingdom was divided and our people were scattered in the long war with Angmar, and not many of us remain. But we believe there will come a time when the blood of Isildur can reunite the kingdoms of Arnor and Gondor. If we forget our heritage, we lose our purpose.”\nOnce they felt that they had traveled far enough from the Troll-fells that they could safely rest, the company set up camp, hunted game and cooked a fresh meal for the first time in weeks. But they could not linger for long. Their destination was still many miles to the southeast, and they felt a cold chill following them into Rhudaur, as though tendrils of dread had crawled after them through the moorland… \n \nThe Treachery of Rhudaur\nHaving escaped imprisonment in the Goblin dungeons of Mount Gram and an icy death in the rugged Coldfells at the hands of hungry Trolls, the heroes had finally reached the woods of Rhudaur. The company made good time for several days, fair weather and plentiful food motivating them to travel at a brisk pace. Yet, no matter how many leagues they crossed, the dark presence and fear that had been tugging at the back of their minds ever since escaping Mount Gram never ceased to haunt them. When they slept, they were plagued by dreadful nightmares, and every waking moment was filled with the sensation of being pursued.\n\n\n \n\nAs they traveled, evidence of the kingdom’s collapse peppered the woods. They crossed through ancient ruins and made their way around towers of stone and rubble, long forgotten and ravaged by years of disrepair. “This area has been largely uninhabited for centuries,” Amarthiúl explained to them. “Once Rhudaur was annexed by the Witch-king, those loyal to him were called to fight in his long war with Arthedain. The kingdom of Rhudaur was abolished and left to ruin.”\n\n \n\n“They should have you teaching young pupils,” one of the companions said with a chuckle, and Amarthiúl himself gave a smirk. “Perhaps, but this is the path I chose for myself,” Amarthiúl disclosed. His expression grew solemn. “When I was younger,\n\nI followed Iârion and several other Rangers on a hunting expedition. I was eager to prove myself to the others, that I could be one of them. But I was too brash and foolish, and the orcs captured me. Iârion risked his life to save me. His determination, his willingness to sacrifice everything, inspired me to become more than a scholar or a healer. I swore that I would repay my life debt with steel and blood. I wanted to become a warrior and a leader like him, to save others like he saved me.” The Ranger gave a sigh and rubbed his forehead, worried. “Now he is the one held captive, tortured or worse, and I am powerless to help.”\n\n \n\nAmarthiúl appeared inconsolable. It had been tough watching the young Ranger’s determination go unrewarded for so long. “I understand now why you are so driven to find him,” one of the heroes said. “Do not lose hope. We are not defeated yet.”\n\n \n\nJust then, the young Ranger’s gaze was drawn behind the heroes, deeper into the woods, and his eyes widened. “Is that what I think it is?” he muttered, and ran ahead. They hadn’t seen Amarthiúl run that swiftly since departing from Fornost. It didn’t take long to catch up to the Ranger - the building he had seen lay fifty meters away, obscured by trees and brush. The pinewood forest opened into a small clearing, concealed on all sides by dense overgrowth. At the other end of the clearing, they saw a stone gatehouse, decrepit from years of disrepair, forgotten by time, but standing strong nevertheless. Behind the gatehouse stood the ruins of an ancient keep tucked into the woods. They had seen several such ruins throughout their journey, but what caught their eyes was the symbol painted upon the wooden door of the gate. It was the symbol of the regal hawk-in-flight.\n\nAmarthiúl pulled Iârion’s pendant from underneath his tunic, where he wore it on a thin chain. “This symbol... It’s the same!” he exclaimed, holding the pendant up next to the symbol on the door.\n\n \n\n“You said Iârion wore this pendant proudly as a symbol of his lineage,” one of the heroes said, and the company exchanged anxious glances. “This is a fortuitous discovery. We have not the slightest clue why Thaurdir - and this Daechanar who commands him - took Iârion captive at Fornost. If Amarthiúl is right and the Wraith was after Iârion in particular, these ruins might hold the answer to this mystery.” There was a murmur of agreement, and Amarthiúl nodded.\n\n“Then what are we waiting for?” he declared, an eager light in his eyes. But as soon as they opened the door to the gatehouse, a furious gale, chill as ice, knocked them to the ground. The wind shrieked. There was a foulness in the air all around them - in the ruins, and in the woods behind them. Something evil haunted Iârion’s ancestral home, and worse, the malevolence that had followed them from Mount Gram was close behind.\n\n \n\nYou have decided to explore the ruins of this ancient keep, but Thaurdir pursues you, and time is of the essence.\n\n \n\nAs you study the clues that you've found, you feel a chill wind flow through the keep. \"You will not leave this place alive,\" a sinister voice echoes throughout the halls. \"My master Daechanar will it so.\" \"Thaurdir!\" Amarthiúl exclaims, unsheathing his blades.\n\n \n\nThe wraith you fought in Fornost has followed you since your flight from Mount Gram. Your only hope is to escape with the clues you've found.\n\n \n\nThe company’s investigation of the ruins was fruitful, but dangerous. Iârion’s ancestral keep was haunted by the wights of Dúnedain who had sided with Angmar, and the spirits of those they had slain in their wicked pact. It seemed that few Dúnedain had managed to escape from this place alive, just as the heroes were barely able to escape with their lives.\n\nOnce they had reached a reasonable distance, they began to piece together what they had found inside the keep as they walked at a brisk pace. Most of the ancient documents they found were too tattered and faded to read, but some were still legible. Among them was a family tree, inscribed inside a leather tome bearing the hawk crest they had become familiar with - the crest of Iârion’s family.\n\n \n\n“Look!” the hero holding the tome shouted, pointing to the tree. “I recognize this name: Daechanar. That is the same name as the one who commands Thaurdir - the “lord of\n\nAngmar” mentioned in the Goblin dungeons!” One of the companions shook her head, pondering what they had learned. “It cannot be the same person. It’s been over a century. The Dúnedain are long-lived, but they are not immortal. The Daechanar in this family tree should be long dead by now...” They pondered that thought for some time, but they were too weary from their hardships to come to any conclusions. While they were starting to understand the events that had unfolded in Arnor many hundreds of years ago, there were too many pieces of the puzzle still missing.\n\n \n\n“We should continue to Rivendell,” one of the heroes declared at last. “Even Thaurdir cannot pursue us there, and we can consult Elrond about these matters. If there is anyone who will understand what we are dealing with, it is he.” There was a murmur of agreement, and the company continued traveling with great haste.\n\n \n\nThe ghostly presence of Thaurdir hung over them still, an ominous stormcloud threatening to overtake them if they dwelled any longer...\n\n \n\nThe Battle Of Carn Dum\n\nThe leaves had fallen and winter’s cold bite had crept ever southward by the time the heroes’ company reached Rivendell.  They were greeted by Elven guards who recognized the heroes and welcomed them, escorting the company into The Last Homely House and offering them food and drink, which they accepted heartily. When they asked to see Elrond, they were granted a swift audience and brought into Elrond’s Hall.\n\n \n\nThe Elf-lord entered soon after, bidding the heroes to sit and tell their tale. The company spoke at length with Elrond about their long journey - their discovery at Amon Forn, the attack on Fornost, their imprisonment in Mount Gram, and the information they found in the ruins of Rhudaur.\n\n \n\nWhen they mentioned the name Daechanar and showed Elrond the tome they had found in the home of Iârion’s ancestors, his eyes narrowed with recognition and his jaw clenched. “That is a name I have not heard spoken in over a thousand years,” he said. “The Daechanar you speak of was once a Dúnedain of Rhudaur. It is he who paved the way for the kingdom’s collapse,  defecting to the side of Angmar and joining the Witch-king as one of his trusted lieutenants. His brother Iârchon and his sons were among the few Dúnedain who managed to escape, fleeing here to Imladris to dwell for a time.”\n\n \n\nElrond knew of what he spoke by memory. He had lived through these events, and not read of them in a book. “Not long after, the forces of Angmar laid siege to Rivendell. We were beset by our enemies for some time, but after many seasons we broke the siege. Iârchon was among those who fought to defend Imladris. I watched as he met his traitorous brother on the fields of battle. Daechanar was slain and the battle was won, but Iârchon was disturbed by his brother’s last words and came to me seeking counsel. I still remember those words, to this day: ‘I will outlive all of you and haunt your descendants long after you are dead. My master has seen to that. ’ I feared that the lord of the Nazgûl had taught some manner of foul sorcery to his lieutenant, that which knits dead flesh and traps spirits long-deceased within this realm.”\n\n \n\nAmarthiúl’s eyes went wide with fear and realization, and he rose to his feet. “Do you mean to tell us that the Daechanar who commands the dead we have encountered is this same Daechanar, who died so long ago?” “Just so,” Elrond replied, and bid the young Ranger to sit once more. “Only I believe he was never truly defeated - his body was broken, but his spirit remained. ‘I will haunt your descendants long after you are dead.\n\n’ You say that Iârion was captured alive at Fornost, and I do not believe this to be coincidence.” He paused for a long moment, considering what he had heard. “Iârion is of Daechanar’s blood. I believe he means to possess Iârion, to use as his new body. Then, his return to this world will be complete. With the Witch-king in Minas Morgul, Daechanar would rule over the dark land of Angmar - you’ve already seen orcs at his command and the Goblins of Mount Gram in his allegiance. The safety of the north would be shattered.” It seemed difficult to believe, but the wisdom of Elrond did not lie, and the heroes did not doubt for a moment the truth behind his words. Finally, everything they had experienced made sense.\n\n \n\n“Iârion has been captive for weeks,” one of the heroes said mournfully, hoping all was not lost. “Are we too late to stop Daechanar’s plan from coming to fruition?”\n\n \n\nAmarthiúl clenched the pendant of the hawk-in-flight which hung from his neck, and spoke assionately. “We must head north immediately! ”\n\n \n\nElrond spoke calmly despite the dire situation, raising his palm to the Ranger. “Your bravery is admirable, young Ranger, but have patience. A powerful ritual such as this is not something easily cobbled together. It is no coincidence that Thaurdir and his forces attacked when they did. In several weeks, midwinter will be upon us. It is the coldest and darkest day of the year’s cycle, the last day before life begins to spring anew. On midwinter’s night, Daechanar will find his passage into Iârion’s body easiest. If I am correct, he is biding his time and waiting for the right moment. That means we have time to gather our strength, and for you to rest. You must be weary from your long journey.” The Elf-lord then called several Elves into the hall, and tasked them with traveling south and west to find as many Rangers as they could and summon them to Imladris. “I do not have a host of Elves to send into battle, but those I can spare will accompany you north, to the fortress of Carn Dûm.”\n\n \n\nThe heroes looked at one another and nodded, confirming their intentions and rising to their feet. One of them gave Elrond a short bow and addressed him politely. “Daechanar must be stopped. We shall venture north as well, and see this mission to\n\nits end.”\n\n \n\nAmarthiúl turned to the heroes, his expression full of stern determination. “My friends, time and time again you have put your life on the line for my kin. Please, allow me to join you. Wherever your travels lead you, my swords shall be yours if you give me leave to assist.”\n\n \n\n“You have earned your place among us,” one of the heroes said, clasping Amarthiúl’s forearm. “We are grateful to have you fighting by our side.”\n\n \n\nFor over a fortnight the company rested well in Rivendell, recovering from their wounds and exhaustion. Each day more Rangers responded to Elrond’s call, arriving in Imladris with bow and sword, eager to seek vengeance for their brethren who fell in Fornost. They waited as long as they could to prepare for the assault, but they were soon out of time and could tarry no longer if they wished to reach Carn Dûm before the winter solstice. With a small but determined band of Elves and Rangers at their side, their only hope was to fight their way into the fortress so they could stop Daechanar’s ritual...\n\n \n\nYour company has made its way swiftly north, and finally the fortress of Carn Dûm looms before you. Unsure if you have arrived in time, you can only hope beyond hope that Iârion is still alive.\n\n \n\nThaurdir has mustered the defense of Carn Dûm. There is no turning back now. \"For Iârion!\" the Rangers begin to shout, unsheathing their swords.\n\n \n\nA swirling dark cloud starts to gather above you, and a cold wind tenses your muscles. \"I have a bad feeling about this...\" you hear Amarthiúl mutter. It seems Daechanar's ritual has begun. Sensing you have little time to spare, your company rushes to the gates of Carn Dûm\n\n \n\nAs they slew Thaurdir, his remains crumbled and decayed into ash before their very eyes, and his armor and weapon clattered to the ground harmlessly. But before they could rejoice in their victory, the howling of wolves sounded in the air, as if all around them.\n\n \n\n“Goblins!” One of the Rangers in the rear ranks shouted, “Goblins from Mount Gram!” The company found themselves assaulted from the south by Goblins while the Orcs of Carn Dûm rallied their defenses once more. They had but a moment to slip into the fortress before they were surrounded on all sides. One of the Elves that had accompanied them from Rivendell turned to the heroes with a grim expression and shouted over the clamour of battle, “You must make your way into the fortress and stop Daechanar’s ritual!” “What about you?” One of the heroes replied, worried.  “You cannot hold off these Goblins forever!” “Then do not take forever! Now go!” he beseeched the\n\nheroes again before joining the fray.\n\nThe heroes had no choice but to leave the rest of their party to fend off the Goblins, slipping through the gates of Carn Dûm. They slew the few Orcs that remained in their way, and infiltrated the enemy’s stronghold to confront Daechanar and rescue their friend...\n\n \n\nThe Dread Realm\n\nThe capital of Angmar was a terrifying place. Once the heroes had defeated the Orcs guarding the entrance and made their way inside, all was eerily quiet in comparison to the battle raging outside. The halls of Carn Dum were cld and lonesome, though no matter where the heroes ventured within its walls, the feeling that they were being watched never ceased. The realm of Angmar had claimed immeasurable lives over many hundreds of years in its long war with the Dunedain. With each step they took, their burden grew worse.\n\n \n\nThe fortress was sprawling, but if they strained their senses, they heard cries of pain coming from below. So, deeper into the stronghold they ventured, down many long and steep flights of stairs, the corridors becoming narrower, the stone walls pressing in all around them.\n\nSomewhere within these catacombs, surrounded by the watchful dead, their friend Iarion was struggling in torment. Spurred onward by steel resolve, the heroes began their search…\n\n \n\nAs you descend into the catacombs beneath Carn Dum, you find yourself overcome with terror. Still, you press onward, knowing that Iarion’s fate—and perhaps the fate of the north—lies in your hands.\n\n \n\nDaechanar’s powers of sorcery and necromancy are strongest here, in the capital of the Witch-realm where the Lord of the Nazgul once resided.\n\n \n\nA final scream fills the dreadful halls of Carn Dum, and you suspect the worst. As you enter the site of Daechanar’s dark ritual, your fears come to life. Iarion stands before you, cracking his neck and gripping the blade at his side tightly, as though testing his muscles. Only it isn’t him.\n\n \n\nDaechanar, in the body of your ally Iarion, laughs wickedly. Despair and frustration are the only thoughts that enter your mind. In the end, you were too late to stop this cruel fate. “Finally! Yes, this body will do nicely,” the wraith wearing the guise of your friend muses. He draws his blade.\n\n \n\nThe impostor in Iarion’s body collapses in agony, and a piercing shriek echoes through the halls as the sorcerer exits Iarion. “Thank you,” Iarion says with a pained smile before his eyes close for the last time. Before you can mourn your loss, the walls begin to shake and crack. The catacombs are collapsing!\n\n \n\nThe heroes had but seconds to spare as the catacombs rumbled and collapsed around them. They ran as fast as they could, trying to remember the route they took through Carn Dum’s dark and labyrinthine halls. The walls shook and screeched as a dark power coursed through them. Walking corpses collapsed and decayed, foul spirits dispersed, and the power that Daechanar had summoned began to crumble with his defeat.\n\n \n\nThe dark clouds above the fortress scattered, and the light of day washed over the battlefield. With the defeat of their master and the sun glaring down at them, the Goblins fled south to their mountain refuge. The remaining Elves and Rangers, rallied by the turning tide, drove the Orcs into a full rout. The battle was won… but the victory was bittersweet. As the heroes emerged from the fortress carrying Iarion’s body, their company was filled with a great sorrow. Though they were able to defeat Daechanar and stop his plans from coming to fruition, they were too late to save their friend. The tragedy of slaying the Ranger with their own hand was something the heroes would never forget, although they had his final words to comfort them.\n\nThe return trip was melancholy, but swift. Although winter had come to the north in full force, the deadly, unnatural weather they had become familiar with seemed to subside with the fall of Daechanar, and the evils of Angmar no longer dared to emerge and stand in the heroes’ way. Once they had put the peak of Mount Gram behind them, the Elves decided to part ways, heading back to Rivendell. The heroes thanked them for their aid, and in return the Elves told them they were welcome to return to Imladris once their business with the Dunedain was finished. The rest of the company continued west to Fornost, to lay to rest their fallen comrades.\n\n \n\nThe Rangers and the heroes buried the dead in a tomb dedicated to those who fell in defense of the North, and gathered together to speak words in memory of their valiant sacrifice. After everyone but the heroes and Amarthiul had left, the young Ranger approached Iarion’s sepulcher, holding the pendant of the hawk-in-flight. “I was not able to save him,” he said as the heroes approached. The death of Amarthiul’s mentor weighed heavily upon his heart.\n\n“None of us were,” one of the heroes replied, mournfully. “But had you not been determined to pursue Thaurdir and rescue your friend, who knows what horrors Daechanar would have unleashed upon the lands your kin protect?”\n\n \n\nThe Ranger nodded, clutching the pendant tighter. “He had no siblings or heirs. The line of Iarion and Daechanar is ended.” With that, Amarthiul stepped forward to place Iarion’s pendant atop his tomb. Letting go of Iarion’s pendant seemed to be a difficult act. As he lay the pendant on the tomb of his friend, he calmly sang:\n\nA fearless man in darkest night\n\nA faithful brother bright with mirth:\n\nHis spirit now is taken flight\n\nBeyond the circles of the earth.\n\n \n\nOne of the heroes rested a hand on Amarthiul’s shoulder. The Ranger had come a long way and had grown much during their journey. “Iarion was a noble warrior. He would be proud to see how strong you’ve become.” They lingered for some time, grieving their loss, before they finally emerged from the quiet tombs of Fornost. “What will you do now?”\n\n \n\n“I pledged my swords to you, remember?” Amarthiul said with a warm smile. “The Dunedain are in your debt. I aim to repay that debt. If you ever need my assistance, do not hesitate to call upon me.” With those words of friendship, they parted ways. The heroes traveled back to Rivendell and spent the rest of winter under the care of the Elves, recovering from their many journeys and battles. Before the snows thawed, however, a messenger came for them bearing a scroll with a peculiar seal.\n\n \n\nIt seems the heroes were needed once again. Fully rested and ready for adventure, they thanked Elrond for his hospitality and ventured back into the wild, riding as fast as they could to the west… Toward the Grey Havens.\n\n\nEpilogue\n\nIarchon did not bother to clean the Orc blood from his sword as he stepped over the creature’s body. His nose twinged, the coppery smell of blood mixed with the scent of ash and scorched wood overwhelming the battlefield. The ringing of steel swords and the clamor of battle echoed across the hills, drowning out the sound of the flowing Bruinen. He gripped his sword tighter than ever before, cursing his own kin for the treachery that had led to the downfall of his people’s kingdom. Something—sweat, blood, or both—trickled down his forehead. “Daechanar,” he called to the figure standing across the steep plain that flanked the ford. “This ends, now.”\n\n \n\nHis older brother simply laughed – no, not his brother. This accursed man who stood before Iarchon could not be his brother, could never truly have been. Not after betraying his family and pledging himself to the Witch-king. Not after setting loose cruel hillmen on their ancestral home, and driving his sword through many of Iarchon’s own kin.\n\n \n\nDaechanar drew his blade from its scabbard, and it ebbed with dark power, like a hundred poisonous whispers in Iarchon’s ears. He didn’t recognize the strange sword his brother wielded, dark runes etched upon its handle. The traitor examined it for a moment, admiring its handiwork and keen edge. “You are a fool, Iarchon,” he said calmly, a malicious smile tugging at his lips. “My master offered you a place at his side, as he has given me, but you refused. Now I must kill you, instead.” He took several long strides forward, his tattered cloak billowing in the wind.\n\n \n\nIarchon’s heart wrenched. He was prepared to fight his brother to the death, but had hoped to avoid such a confrontation. Seeing now the murderous intent in Daechanar’s eyes, he knew it was the only option. The lieutenant of Angmar showed no mercy, advancing swiftly and slashing savagely with the edge of his blade. Iarchon raised his sword in a defensive posture, deflecting each of Daechanar’s blows. He could not bring himself to strike his brother.\n\n \n\n“How long?” Iarchon screamed. “How long has your mind been seized by the Enemy? How long have you plotted the demise of our kingdom?” He parried Daechanar’s sword to the side, twisting and letting his brother’s momentum carry him forward, past Iarchon. Before Daechanar could regain his footing, the noble brother was upon him, his sword spurred by vengeful wrath. Though he landed several scathing blows, his blade tearing through his adversary’s cloak and leather hauberk, Daechanar’s expression was still twisted into an uncanny grin.\n\n \n\n“Tell me little brother, who do you think will win this war?” Daechanar asked over the sound of their swords clashing. “Do you think you stand any chance against the armies of Angmar?” Iarchon gritted his teeth. His brother’s words cut deep. They had already suffered loss after loss, and now the Witch-king’s forces threatened to overwhelm all of the north. Daechanar took the advantage, pressing Iarchon backwards with each of his powerful blows. Against the swiftness and strength of Daechanar’s attacks, the noble brother was barely able to defend himself, the dark b lade slicing into his armor and flesh several times. Blinded by arrogance and seeing his imminent victory, the traitor hadn’t realized the trap until it was too late.\n\nWhen they were children, they used to spar with wooden swords in their keep’s courtyard. The older brother was the fiercer, nimbler fighter, but the younger brother more cunning. Whenever Daechanar tasted victory, he relished in it and abandoned his defense in order to end the fight. Iarchon put himself on the brink of defeat before his opening appeared—a gap in Daechanar’s defenses. He swiftly ducked under a slice meant for his neck and drove his sword into Daechanar’s chest. The turncoat’s eyes widened and his face twisted into an expression of agony.\n\n \n\n“I know not who will win,” Iarchon responded, pushing his blade deeper into his brother’s chest, “only that you will not survive to see the war’s end.” Daechanar gasped for air, his lungs pierced by Iarchon’s blade. His voice croaked, one last gasp before his breath escaped him.\n\n“You’re wrong, little brother,” he smiled. “I will outlive all of you and haunt your descendants long after you are dead. My master has seen to that.”\n\nThen the life fled from Daechanar’s eyes, and he fell into his brother’s arms.\n\n \n\n \n\nEdited October 29, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1720676","commentId":1720676,"userName":"PsychoRocka","timestamp":1438742280,"content":"The Lost Realm and Angmar Awakened Cycle\n\n \n\nEXTRA MATERIAL\n\n \n\nRossiel\n\n \n\nIeneth nîn Ninnith. I call myself Rossiel, but it was not always so. At birth my father gave me the name\n\nNinnith, a name I carried with me for centuries. My older sister was named after mother’s red hair - rare among the Elves of Lórien - but when my sister’s hair grew in, it was golden like the leaves of the Mallorn.\n\nAll names are a prophecy yet to unfold, mother told us. But neither of us ever felt a connection to ours.\n\n \n\nAs a child, I was adventuresome. My tutelage began early, but I often spent my days exploring the woods of Lórien with my older sister. Father told me not to wander, but my heart was in the treetops. Deep in the dark of night I would climb one of the trees atop Cerin Amroth, the highest point in Lórien. I loved to look out to the northeast, towards the forest once known as Greenwood. Its treetops were barely visible\n\non the horizon, green and full of life. And without fail, sister would sneak out and follow me through the woods. “Is your head in the clouds again, Ninnith?”\n\n \n\n“Climb to me!” I’d reply, and she would, joining me atop the golden-leaved branches. We would sit for hours, watching the sun rising above the forest. When we returned to Caras Galadhon, mother would scold us. She would tell us to find one of the Lady’s handmaidens and do whatever she asked of us.\n\n \n\nI long for those days again. The days when the shadow was thin, Greenwood was green, and I could see my sister smiling.\n\n \n\nMy tutoring progressed more rapidly than hers. Elves spend hundreds of years learning and practicing their crafts, but I would master each subject within mere decades. Some called me a prodigy. I hated that word. It inferred I had some power to change my fate. Lórien was a beautiful prison, but a prison nonetheless. Before long I was under the tutelage of Lady Galadriel herself – a great honor. I rarely had the\n\nopportunity to visit my family. Most of my years were spent living in the great tree in the center of the City of Trees, separated from my sister. Unlike me, she was allowed to leave the Naith on diplomatic errands with an escort of Elves. She often traveled to Amon Lanc, what was once capital of the kingdom of Thranduil. Sometimes she would come to Lady Galadriel bearing messages from Thranduil himself. “My little Ninnith!” she’d call out when she saw me, her joyful smile warming my heart.\n\n \n\nMany centuries passed. The shadow in the east grew. Whispers of a dark menace growing in southern Greenwood were met with sorrow and inaction. The last time I slipped out of the city and climbed Cerin Amroth, I looked towards Amon Lanc, and saw a great darkness over Greenwood. A shudder coursed up my spine. I had a terrible feeling, as though I knew what was to come but could not accept it. As I looked out to the horizon, I knew I had to leave.\n\n \n\nI ignored the shouts of the sentries as I descended the flets of the great tree with haste, taking a silver spear wreathed withleaves from the craftsman’s halls. I ran as fast as my legs could take me, through the great gates and crossing the white bridge that was the only exit from the city.\n\n \n\nI felt a terrible freedom as I ran through the woods of the Naith, weaving through Mallorn trees with steps as silent as the wind. But I could not bring myself to enjoy the journey, for I knew there would be no joy at its end. I did not stop running until I’d reached the Anduin, using one of the white boats that was moored on the western bank to cross the river. Although I’d never left Lórien until that night, my sister often spoke of the route they traveled to reach Amon Lanc. I recalled her words and followed the path they took without straying.\n\n \n\nI reached the eaves of Greenwood at the end of the third day. As I stood before its towering trees, I felt the maleficent presence within. It did not stop me from entering, but with every step into the darkness, the shadow thickened. It wasn’t long before I saw the horror which confirmed my worst fears. I dropped my spear and fell to my knees, my eyes watering.\n\n \n\nThe Elves were slain cruelly, trapped by thick webs and hanging from the treetops, a vile demonstration. Trembling, Iclimbed the branches and cut them free from their webs. Their skin was ghostly pale, gaunt as though it was stretched thinover their bones. Their faces were frozen in pain.\n\n \n\nMy sister was among them. My sister, Rossiel. Slain by monsters, children of Ungoliant that had infested the forest and driven Thranduil’s people out. The beautiful Greenwood I sang about as a child. Tears filled my eyes and blurred my vision. I gripped my spear tight. Rossiel. My sister.\n\n \n\nHer name would not be forgotten. Her name which mother gave her. Mine is meaningless; hers is the name to which prophecy is ascribed. The name I used to murmur in my sleep when I longed to see her. The name that brought a smile to my lips whenever I heard it. Her name would live on.\n\n \n\nI reached up and touched a lock of my red hair in disbelief.\n\nAll names are a prophecy yet to unfold.\n\n \n\nFrom that moment on, her name would be my own. I vowed that I would one day cleanse the evil that inhabited this place. No longer would I allow myself to do nothing, to be held captive within the Naith. I took charge of my destiny, and strove out into the world, the memory of my sister forever burning in my mind.\n\n \n\nI eneth nîn Rossiel. Yes... Rossiel is my name.\n\n \n\nAmarthiul\n\n \n\nIarion placed his hand on the hilt of his sword as he often did when he spoke sternly to his pupil. “You are not coming with us on this mission. I have made myself clear on this matter numerous times.” His order was firm, his gaze unwavering. Years ago, when Amarthiul’s father fell in battle, it was Iarion who had taken the body in and become his mentor, teaching him the ways of the Dunedain. The boy was smart, but reckless.\n\n \n\n“I am a better fighter than any of the others my age, and the swiftest. I have passed every test the elders have given me. I am ready, I swear to you!” Though Amarthiul was only ten-and-four, he spoke the truth. Among his peers, he had proved himself to be of superior intelligence and skill at arms. The boy was quick to learn and already knew much of their people’s lore, but he was more interested in hunting Orcs and other agents of the Enemy.\n\n \n\n“You believe that winning a hundred sparring matches and reading of the wars of our ancestors prepares you for anything, but you have never hunted an enemy such as this. Orcs are tough-skinned, mighty, and truly frightening. Their hate is overwhelming; it drowns their thoughts with rage and makes them more dangerous than you can imagine.\n\n \n\nAmarthiul put on a brave face and began to speak, but his mentor shook his head and cut him off. “My word is final. You are to stay here and continue your training.” With that, Iarion and the other Rangers left Fornost with haste. Their mission was urgent. Scouts had reported Orcs venturing along the hills of Evendim. Whether they were agents of a greater plot or searching for victims along the shores of Lake Nenuial, the Rangers would deal with them all the same.\n\nAmarthiul refused to be left behind so easily. He gathered several days’ worth of rations and armed himself with two blades from Fornost’s armoury. He followed the other Rangers west, close enough that he could track their prints, but too far for them to tell they were being shadowed. The young Dunadan took care to make sure he wasn’t spotted; he knew if he revealed himself close to the river Brandywine, the Rangers would have no choice but to let him tag along.\n\n \n\nThe Rangers’ pace was much faster than Amarthiul had anticipated, crossing many leagues each day. Though he struggled to keep up, he was determined to prove he was capable of the feats of his brethren, and his resolve spurred him onward. He fancied that when he finally revealed himself to the other Rangers, they would be proud of him, impressed that he was able to keep pace.\n\n \n\nUnfortunately for Amarthiul, he hadn’t anticipated the Orcs traveling east along the Brandywine. Seeing an easy target, they came upon Amarthiul under the cover of night, when they were strongest and their foe was weary. When the first Orc screamed a battle-cry in its guttural tongue, Amarthiul froze and his heart pounded in his chest. The Orcs charged at him from all directions. Valiantly he drew his blades and tried to defend himself, but he was overcome with terror. His years of training fled from his mind, replaced by panic. Within seconds, he was overmatched.\n\n \n\nThe Orcs weren’t looking to kill the young one. Instead, they knocked him to the ground and disarmed him. One Orc grappled him, and he was blindfolded and bound tightly with thick rope.\n\n“Har! What have we got here lads?” asked an Orc with a laugh, kicking the bound Dunadan cruelly.\n\n“Looks like fresh meat,” answered another. “Let’s eat it!”\n\n“Don’t be too quick! This one’s a young ‘in. I bet there’s more of his kind nearby. Let’s catch ‘em first. Then we’ll kill the whole lot.”\n\n \n\nAmarthiul cursed himself for his foolishness. Because of him, the other Rangers would be waylaid by the band of Orcs they sought to hunt.\n\n“No! I’m the only one—” he began to say, but one of the Orcs gagged him with a sash of heavy wool and his voice came out muffled.\n\nThey tied him upside-down from the branch of a high tree and hid, knowing that any other Rangers nearby would come to investigate the sounds of the scuffle. Before long, Amarthiul heard the sounds of leaves rustling around him, and suddenly the sounds of battle erupted like a storm. Blindfolded and unable to see, he could only listen helplessly as he heard swords whistle, bowstrings twang, the clash of steel on steel. And then, it was quiet.\n\n \n\nAmarthiul was cut loose and dropped to the ground, his bounds cut one at a time, though he was held from behind firmly by his wrists with a gloved hand. When his blindfold was removed, it was Iarion who stared at him wordlessly. All around the boy, the Orcs lay slain at their feet. Many of the Rangers were wounded, their armor nicked or cut loose, bleeding wounds being tended with herbal paste and bandages.\n\n \n\nIarion said nothing. It was the silence that stung the most. He knew he had failed them, he had put them in danger. “I… I…” he began, his heart leaping into his throat as words failed him. “…I’m sorry,” was all he could say before he began to sob.\n\n“It’s all right, young one,” his mentor said, taking the boy in his arms and resting a hand on his head. “One day, you’ll return the favor.”\n\n \n\n \n\nAngmar Awakened Cycle Design Notes\n\n“No one lives in this land. Men once dwelt here, ages ago; but none remain now. They became an evil people, as legends tell, for they fell under the shadow of Angmar. But all were destroyed in the war that brought the North Kingdom to its end. But that is now so long ago that the hills have forgotten them, though a shadow still lies on the land.” –Aragorn, The Fellowship of the Ring\n\n \n\nThe story of “The Lost Realm” and the “Angmar Awakened” cycle explores the rich history of the Dunedian of Arnor and their long war with the Witch-realm of Angmar by introducing a new conflict between those two powers in the time period of The Lord of the Rings: The Card Game. During that time, the Witch-king commands the tower of Minas Morgul and the kingdom of Angmar has been abandoned for centuries, so for the purposes of our story we introduce a powerful sorcerer, Daechanar, who is rebuilding the ancient kingdom by drawing all manner of evil creatures into his service.\n\n \n\nDaechanar is just one of five key figures that we created for this cycle, and we hope that fans of The Lord of the Rings will appreciate our efforts to develop characters and a story that feel at home in Middle-earth. Daechanar in particular was an exciting character to explore: a traitorous Dunadan who became a powerful sorcerer under the tutelage of the Witch-king himself. His back story was inspired by the history of Rhudaur as described in the appendices of The Return of the King. From The North-kingdom and the Dunedain we learn that after the kingdom of Arnor was divided, the people of Rhudaur became allied with Angmar. So, for our story, we suggest that some of the Dunedain who lived in Rhudaur at that time became servants of the Witch-king. Daechanar would have been chief among them, and he learned to command the evil spirits of Angmar from his Nazgul master. His Wraith lieutenant, Thaurdir, would have been one of those evil spirits.\n\n \n\nAs for the Dunedain of Arnor, not many details are provided about their day-to-day life and culture in The Lord of the Rings, so we did our best to draw inspiration from the information that is available. We do know that the Rangers are a wandering people who keep a constant watch over the lands within the bounds of their ancient kingdom. For the purposes of our story, we suggest that the Dunedain may have used the ruins of Fornost as meeting grounds, since we know from The Return of the King that they visited those ruins from time to time.\n\n \n\nTo help represent the bravery and nobility of the Rangers of the North, we introduce two Dunedain characters: Iarion, and his pupil, Amarthiul. We hope that their story of kinship is one that the players enjoy. For the character of Iarion, we assume that other Dunedain, besides the heir of Valandil, are able to trace their ancestry to noble families from the three kingdoms of Arnor. It is Iarion’s lineage, as a descendant of Iarchon, that ties him to the villain Daechanar. That bond is what drives our story forward. For the character of Amarthiul, we explore the question of how the Dunedain grow to manhood and attain their renowned skills. Since we know that the Rangers are primarily a houseless people, we suggest that young Dunedain live in the wild with a mentor, most likely their father, and learn from following him. The bond that would result from that close friendship would undoubtably be strong, as we see in Amarthiul’s determination to rescue Iarion.\n\n \n\nOverall, we hope to have told a compelling tale that conceivably could have rested within Tolkien’s historical framework for Middle-earth. We hope players enjoyed our attempts to stay within Tolkien’s vision, and we hope, above all, that the players had great fun in overcoming the challenges presented in the “Angmar Awakened” cycle.\n\nEdited October 29, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1720967","commentId":1720967,"userName":"banania","timestamp":1438763939,"content":"Stumbled on the same issue as I wanted to included the \"Do not read\" stories to the Quest Companion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1721247","commentId":1721247,"userName":"Ecthelion III","timestamp":1438783871,"content":"I can type up and send the Do Not Read stories for Lost Realm and Angmar Awakened (first two packs). However I don't have any of Ringmaker.\n\nWould you like me to?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1721274","commentId":1721274,"userName":"PsychoRocka","timestamp":1438784643,"content":"I have them at home so can do it when I get time but if you feel like you are more than welcome to =)\n\nIt would definitely speed the process up a little haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1724555","commentId":1724555,"userName":"PsychoRocka","timestamp":1438926039,"content":"Time to power ahead and get this finished! The amazing Matt Newman helped me out and sent me all the DO NOT READ sections to make things far easier. What a great guy right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1724710","commentId":1724710,"userName":"banania","timestamp":1438936168,"content":"It's amazing to have designers getting \"involved\" in the community (interviews, answering rule questions, reading forums to nightmare-stomp-our-asses). I saw a Feonix registered on the Campaign Log, that's neat!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1725437","commentId":1725437,"userName":"Ecthelion III","timestamp":1438968255,"content":"> “Consult the bones,” ordered the chief as he rose to his feet and towered over the old man. “Let the Boar spirit decide.”\n> The old druid reached inside his boarskins and reluctantly brought out a small purse. He opened the pouch to let the small bones inside it spill onto the ground, then he bent to his knees and lowered his face to inspect them closely.\n> After a tense minute of silence, the old man grunted, and rising slowly to his feet he spoke slowly, “The strangers may undertake the trials.”\n> “The bones have spoken,” spoke the chief. “It is decided then: You will undertake the trials to recover the Antlered Crown for the Boar Clan. Success will grant you and your master our friendship. Failure will grant you death.”\n\n\n\n\n\n7:51 :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nEdited August 7, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1725468","commentId":1725468,"userName":"Raven1015","timestamp":1438969104,"content":"Willow!!! Yes!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1725533","commentId":1725533,"userName":"Ecthelion III","timestamp":1438970967,"content":"> Willow!!! Yes!!!\n\nI still remember your Madmartigan custom card..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1726332","commentId":1726332,"userName":"PsychoRocka","timestamp":1439001804,"content":"Voice of Isengard and the Ring Maker Cycle now finished!\n\nThe Lost Realm and what we have so far of the Angmar Awakened cycle will be up soon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1733345","commentId":1733345,"userName":"Ecthelion III","timestamp":1439410383,"content":"It doesn't look like you have any of the Do Not Read from Against the Shadow.\n\nEdited August 13, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1733607","commentId":1733607,"userName":"PsychoRocka","timestamp":1439421265,"content":"Updated with all the DO NOT READ sections from Against the Shadow cycle added.\n\nEdited August 13, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1737042","commentId":1737042,"userName":"PsychoRocka","timestamp":1439625714,"content":"Now completely up to date with Mount Gram added!\n\n \n\nAlso some thoughts/notes on the narrative so far:\n\n-Our group of heroes have really overcome a lot at this point and have fought off/escaped from Nazgul, Trolls, The Watcher, The Balrog mutliple times, Nameless Ones, Mumakill, giant spiders almost the size of Shelob (Attercop, Attercop is massive..), whole packs of wargs, Cabal Champions, countless orcs and orc chieftains and many traitorous men. We have helped Aragorn track, capture and deliver Gollum to Thranduil's kingdom. We have discovered the fate of Balin's colony and escaped Moria intact after encountering the Balrog and then even managed to push it back into a dark pit and overcome it. We have helped Gondor in its defense against Mordor's various tests of its resolve and defenses in the time leading up to the War of the Ring and even helped defend Cair Andros from a large force during a large siege AND helped take back Osgiliath during a daring assault led by Boromir and his forces. We overcame the traitor Alcaron and safety delivered Faramir back from the very jaws of Minas Morgul. We have even destroyed and disbanded a traitorous ring of conspirators in Minis Tirith itself.\n\nSure at the same time we may have inadvertently helped Saruman get a perfect specimen in order to start breeding Uruks.... and helped him find Celebrimbor's ring mould so that he can attempt to craft his own ring of power.... and even helped him gain the allegiance and gratitude of a unified and far more powerful Dunland who are later integral to his attack on Rohan.....\n\nbut we are badass!! Without our band of heroes behind the scenes in all of this non-canon action things would have been alot more grim throughout Middle Earth come the War of the Ring and events during the actual books. I think overall the designers have done a really good job of trying to make the narrative fit as well as possible as a very intricate addition to the tolkien universe that does not contradict or change anything in the lore as best as possible. Almost everything they do is very fitting and potentially possible within said universe in the period of time it is set. Sure certain things... (mainly in the second cycle) don't fit as well as they could (Balin's colony etc) but overall and ignoring very early narrative choices I think they have made potentially the most thematic and fitting game for this universe we have ever seen that has its own non-lore additions and creations at the same time. \n\n-I know this has been discussed on the forums in the past but I think it is fairly clear that it is perhaps a different set of heroes that go off on the adventures in the Khazad-Dum box and the following Dwarrowdelf cycle. During Khazad-Dum we discover the fate of Balin's colony but then later in the Dwarrowdelf cycle during The Long Dark the group of heroes hopes to perhaps meet up with Balin which does not make sense if we are already aware of his colony's fate. If I remember correctly people speculated that perhaps the group that undertake the adventures in the three quests of the Khazad-Dum box die or meet some other fate whilst attempting to escape from The Balrog during Flight from Moria and an entirely new group escort Arwen to Rivendell and then enter Moria to check it out for Elrond. It also does not make sense that we are sent straight back into Moria after we just escaped it. As well as this after doing so TWICE surely our heroes would have alerted everyone to the Balrog's prescence.\n\nThis means that even the Dwarrowdelf cycle ending in Shadow and Flame and ignoring Khazad-Dum is somewhat dodgy as during the events of LOTR no one is aware that it is specifically a Balrog causing issues in Moria so this doesn't gel at all.\n\nHonestly this deluxe box and cycle are the weakest narrative wise as from the third cycle onwards the narrative is simply amazing and the first cycle is simply us helping Aragorn to capture Gollum and doesn't really mess with the storyline of LOTR.\n\nThis is ironic as although I love the lore, flavour text and narrative of this game this deluxe box and cycle feature some of my favorite or most played quests. Overall a very unthematic part of the game but very amazing quests, cards and artwork.\n\n-God that betrayal by Lord Alcaron is just devastating... I remember when we first got Morgul Vale and discovered the fact of his betrayal. Man did I have fun letting my heroes bust his face in while playing Morgul Vale the first few times. Ironically I find both Murzag and the Nazgul harder bosses than Alcaron during this quest even though he is the traitor and in a way main antagonist of the quest. It is thematic that his ability represents Faramir being rushed to Minas Morgul however and fits with the narrative they gave us perfectly. There is actually a bit of foreshadowing in my opinion of his character in the DO NOT READ section for Assault on Osgiliath. He is over excited and enthusiastic after a great but devastating battle in which surely many men fell. He speaks Sauron's name as though it is no big deal although it is well known in Middle Earth that names, songs and speech itself can have great power and influence. He is over eager to pursue the Orcs and \"break their black bones on the mountains\". Even just how desperate he is and the pleading he does to encourage Boromir and Faramir to pursue the orcs is highly suspicious. Did anyone see this betrayal coming or guess it might happen? I do not remember having any idea that it would happen and was shocked and extremely impressed by the designers when I first read it. It fit so well with a LOTR based game and his background story we get in Morgul Vale is possibly my favorite part of the entire narrative so far. Just hearing a mention about his Estate and blood slaves in the shores of the Sea of Nurnen in Mordor is amazing.\n\n-Did anyone else think it was a pretty awesome coincidence that right after the Ring Maker cycle finishes and we have just finished helping Saruman breed Uruks, forge his own ring and gain the alliance of Dunland we get the Treason of Saruman and got to enact revenge on him for tricking us and making us help him with all those unholy tasks? I was pretty pleased to dispatch both him and Grima during the third quest of this saga box after all the nonsense we went through for them during the Ring Maker cycle.\n\n-The new cycle's narrative is awesome so far in my opinion and I am very excited to see where it goes and who exactly this Lord Daechanar is. I do hope we rescue Iarion and he does not meet some grisly fate in Carn Dum before we arrive. Similarly I hope we are able to achieve some sweet sweet revenge on Thaurdir. Imagine if Daechanar is Alcaron/Ulchor!!!! I'm sure he won't be but wouldn't that be a crazy twist, he didn't really die during the Morgul Vale and was sent instead to bring Angmar back into existance. I'm not advocating this and think it would be silly (we killed him!) but just think it would be a funny/crazy twist. It is also interesting and also very fitting thematically that the Witch King is not in fact the big boss at the end of this cycle (he is in Minas Morgul at this time fighting Gondor on and off is he not?) as some assumed he would be and it is fact this Lord Daechanar that is being spoken of as the new ruler or lord of Angmar. Is he a Black Numenorian? Is he something else entirely?\n\n-Lastly I wanted to just list a few a places that are my favorite places this game has taken us to. Places that the massive Tolkien nerd and fanatic in me is so glad we get to see expanded and explored more than Tolkien ever did but based upon things he wrote or alluded to. I love that we get to explore the very depths of Moria and the nameless ones mentioned by Tolkien but never expanded upon. We get to fight these primeval and terrifying beasts (maybe even Maia) and see an imagining of what they might look like. Love the art in both the normal and nightmare quest. I love that we get to go to Pelargir and Cair Andros, both of which are places that not much action happens in during the events of LOTR (that we get in much description at least). The same is true of the Druadan forest. Ost-in-Edhil and Tharbad are perhaps my favorite locations that this game has allowed us to travel to and see a deeper depiction of. Tharbad was such an important place in the second age and early third age but in complete ruin during The War of the Ring. That we get to go there and explore the ruins and small town/population that still exists there and then also get to explore Ost-in-Edhil shortly afterwards which has also fallen to ruin and is arguably a far more epic and important city from the Second Age than even Tharbad was is just so **** cool. Ost-in-Edhil is where Celebrimbor taught Sauron in the ways of ring forging and was later slain by Sauron. How epic that we get to explore these ruins and uncover celebrimbors secret chamber and ring mould!\n\n \n\nI encourage and implore you to discuss anything you wish in relation to the narrative for this game on this thread. What are your favorite parts of the narrative or favorite thing our group of heroes has achieved? What are your favorite places we have gotten to visit?\n\nEdited August 15, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1740997","commentId":1740997,"userName":"PsychoRocka","timestamp":1439864011,"content":"Design Notes for Ring Maker Cycle added. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1742267","commentId":1742267,"userName":"Raven1015","timestamp":1439912814,"content":"Nice overview PsychoRocka! I agree that the Dwarrowdelf cycle was the most \"off\" thematically, whereas everything else has been pretty outstanding in terms of story, especially the recent cycles. I think it all comes down to the designers at the time wanting to find an excuse for players to fight the Balrog, the Watcher, etc., before Saga Expansions were a thing, even if it meant coming up with a nonsensical story. The only thing that makes sense lore-wise (to me) is if both sets of adventurers, the Khazad-dum ones and the Dwarrowdelf ones, died. Or if they had a memory wipe of some kind!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1795818","commentId":1795818,"userName":"PsychoRocka","timestamp":1442296902,"content":"Start of Across the Ettenmoors added. Do not read section will be added later this afternoon when I am home and have access to it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1961030","commentId":1961030,"userName":"Ecthelion III","timestamp":1451422721,"content":"bump"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1961358","commentId":1961358,"userName":"PsychoRocka","timestamp":1451434169,"content":"I thought people completely lost interest and so I got a bit lazy... really should have stuck with this. I will do my best to get it updated today!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1961398","commentId":1961398,"userName":"Gizlivadi","timestamp":1451435805,"content":"Have you already got The Dread Realm? I'd love to read the story of that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=1961480","commentId":1961480,"userName":"PsychoRocka","timestamp":1451439606,"content":"Ok so the rules documents have stopped after Across the Ettenmoors.... \n\nhttps://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/ [https://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/]\n\nYet another aspect of the game that support seems to be trailing behind for.... (alongside the quest log etc) \n\n \n\nI will have to do this at home sometime as I have Treachery and Carn Dum but not Dread Realm just yet. If anyone has the do not read (and beginning as well really!) section for Dread Realm and can be bothered typing it up for me and sending it in a message I would really appreciate it. Otherwise I will do it when I get my hands on the pack. Should hopefully have the rest of ettenmoors, treachery of rhudaur and carn dum up tonight sometime. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2260569","commentId":2260569,"userName":"Finduin","timestamp":1465525007,"content":"I was one of the people that used your material for my work in my blog. So I hoped that you can continue with this. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2260664","commentId":2260664,"userName":"Ecthelion III","timestamp":1465530596,"content":"Tell you what, I'll type up the Dread Realm story, design notes, and epilogue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2260706","commentId":2260706,"userName":"Ecthelion III","timestamp":1465534168,"content":"Exactly one hour later...\n\n \n\nThe Dread Realm:\n\nThe Dread Realm\n\nThe capital of Angmar was a terrifying place. Once the heroes had defeated the Orcs guarding the entrance and made their way inside, all was eerily quiet in comparison to the battle raging outside. The halls of Carn Dum were cld and lonesome, though no matter where the heroes ventured within its walls, the feeling that they were being watched never ceased. The realm of Angmar had claimed immeasurable lives over many hundreds of years in its long war with the Dunedain. With each step they took, their burden grew worse.\n\nThe fortress was sprawling, but if they strained their senses, they heard cries of pain coming from below. So, deeper into the stronghold they ventured, down many long and steep flights of stairs, the corridors becoming narrower, the stone walls pressing in all around them.\n\nSomewhere within these catacombs, surrounded by the watchful dead, their friend Iarion was struggling in torment. Spurred onward by steel resolve, the heroes began their search…\n\nAs you descend into the catacombs beneath Carn Dum, you find yourself overcome with terror. Still, you press onward, knowing that Iarion’s fate—and perhaps the fate of the north—lies in your hands.\n\nDaechanar’s powers of sorcery and necromancy are strongest here, in the capital of the Witch-realm where the Lord of the Nazgul once resided.\n\nA final scream fills the dreadful halls of Carn Dum, and you suspect the worst. As you enter the site of Daechanar’s dark ritual, your fears come to life. Iarion stands before you, cracking his neck and gripping the blade at his side tightly, as though testing his muscles. Only it isn’t him.\n\nDaechanar, in the body of your ally Iarion, laughs wickedly. Despair and frustration are the only thoughts that enter your mind. In the end, you were too late to stop this cruel fate. “Finally! Yes, this body will do nicely,” the wraith wearing the guise of your friend muses. He draws his blade.\n\nThe impostor in Iarion’s body collapses in agony, and a piercing shriek echoes through the halls as the sorcerer exits Iarion. “Thank you,” Iarion says with a pained smile before his eyes close for the last time. Before you can mourn your loss, the walls begin to shake and crack. The catacombs are collapsing!\n\nThe heroes had but seconds to spare as the catacombs rumbled and collapsed around them. They ran as fast as they could, trying to remember the route they took through Carn Dum’s dark and labyrinthine halls. The walls shook and screeched as a dark power coursed through them. Walking corpses collapsed and decayed, foul spirits dispersed, and the power that Daechanar had summoned began to crumble with his defeat.\n\nThe dark clouds above the fortress scattered, and the light of day washed over the battlefield. With the defeat of their master and the sun glaring down at them, the Goblins fled south to their mountain refuge. The remaining Elves and Rangers, rallied by the turning tide, drove the Orcs into a full rout. The battle was won… but the victory was bittersweet. As the heroes emerged from the fortress carrying Iarion’s body, their company was filled with a great sorrow. Though they were able to defeat Daechanar and stop his plans from coming to fruition, they were too late to save their friend. The tragedy of slaying the Ranger with their own hand was something the heroes would never forget, although they had his final words to comfort them.\n\nThe return trip was melancholy, but swift. Although winter had come to the north in full force, the deadly, unnatural weather they had become familiar with seemed to subside with the fall of Daechanar, and the evils of Angmar no longer dared to emerge and stand in the heroes’ way. Once they had put the peak of Mount Gram behind them, the Elves decided to part ways, heading back to Rivendell. The heroes thanked them for their aid, and in return the Elves told them they were welcome to return to Imladris once their business with the Dunedain was finished. The rest of the company continued west to Fornost, to lay to rest their fallen comrades.\n\nThe Rangers and the heroes buried the dead in a tomb dedicated to those who fell in defense of the North, and gathered together to speak words in memory of their valiant sacrifice. After everyone but the heroes and Amarthiul had left, the young Ranger approached Iarion’s sepulcher, holding the pendant of the hawk-in-flight. “I was not able to save him,” he said as the heroes approached. The death of Amarthiul’s mentor weighed heavily upon his heart.\n\n“None of us were,” one of the heroes replied, mournfully. “But had you not been determined to pursue Thaurdir and rescue your friend, who knows what horrors Daechanar would have unleashed upon the lands your kin protect?”\n\nThe Ranger nodded, clutching the pendant tighter. “He had no siblings or heirs. The line of Iarion and Daechanar is ended.” With that, Amarthiul stepped forward to place Iarion’s pendant atop his tomb. Letting go of Iarion’s pendant seemed to be a difficult act. As he lay the pendant on the tomb of his friend, he calmly sang:\n\nA fearless man in darkest night\n\nA faithful brother bright with mirth:\n\nHis spirit now is taken flight\n\nBeyond the circles of the earth.\n\nOne of the heroes rested a hand on Amarthiul’s shoulder. The Ranger had come a long way and had grown much during their journey. “Iarion was a noble warrior. He would be proud to see how strong you’ve become.” They lingered for some time, grieving their loss, before they finally emerged from the quiet tombs of Fornost. “What will you do now?”\n\n“I pledged my swords to you, remember?” Amarthiul said with a warm smile. “The Dunedain are in your debt. I aim to repay that debt. If you ever need my assistance, do not hesitate to call upon me.” With those words of friendship, they parted ways. The heroes traveled back to Rivendell and spent the rest of winter under the care of the Elves, recovering from their many journeys and battles. Before the snows thawed, however, a messenger came for them bearing a scroll with a peculiar seal.\n\nIt seems the heroes were needed once again. Fully rested and ready for adventure, they thanked Elrond for his hospitality and ventured back into the wild, riding as fast as they could to the west… Toward the Grey Havens.\n\n \n\nEpilogue\n\nIarchon did not bother to clean the Orc blood from his sword as he stepped over the creature’s body. His nose twinged, the coppery smell of blood mixed with the scent of ash and scorched wood overwhelming the battlefield. The ringing of steel swords and the clamor of battle echoed across the hills, drowning out the sound of the flowing Bruinen. He gripped his sword tighter than ever before, cursing his own kin for the treachery that had led to the downfall of his people’s kingdom. Something—sweat, blood, or both—trickled down his forehead. “Daechanar,” he called to the figure standing across the steep plain that flanked the ford. “This ends, now.”\n\nHis older brother simply laughed – no, not his brother. This accursed man who stood before Iarchon could not be his brother, could never truly have been. Not after betraying his family and pledging himself to the Witch-king. Not after setting loose cruel hillmen on their ancestral home, and driving his sword through many of Iarchon’s own kin.\n\nDaechanar drew his blade from its scabbard, and it ebbed with dark power, like a hundred poisonous whispers in Iarchon’s ears. He didn’t recognize the strange sword his brother wielded, dark runes etched upon its handle. The traitor examined it for a moment, admiring its handiwork and keen edge. “You are a fool, Iarchon,” he said calmly, a malicious smile tugging at his lips. “My master offered you a place at his side, as he has given me, but you refused. Now I must kill you, instead.” He took several long strides forward, his tattered cloak billowing in the wind.\n\nIarchon’s heart wrenched. He was prepared to fight his brother to the death, but had hoped to avoid such a confrontation. Seeing now the murderous intent in Daechanar’s eyes, he knew it was the only option. The lieutenant of Angmar showed no mercy, advancing swiftly and slashing savagely with the edge of his blade. Iarchon raised his sword in a defensive posture, deflecting each of Daechanar’s blows. He could not bring himself to strike his brother.\n\n“How long?” Iarchon screamed. “How long has your mind been seized by the Enemy? How long have you plotted the demise of our kingdom?” He parried Daechanar’s sword to the side, twisting and letting his brother’s momentum carry him forward, past Iarchon. Before Daechanar could regain his footing, the noble brother was upon him, his sword spurred by vengeful wrath. Though he landed several scathing blows, his blade tearing through his adversary’s cloak and leather hauberk, Daechanar’s expression was still twisted into an uncanny grin.\n\n“Tell me little brother, who do you think will win this war?” Daechanar asked over the sound of their swords clashing. “Do you think you stand any chance against the armies of Angmar?” Iarchon gritted his teeth. His brother’s words cut deep. They had already suffered loss after loss, and now the Witch-king’s forces threatened to overwhelm all of the north. Daechanar took the advantage, pressing Iarchon backwards with each of his powerful blows. Against the swiftness and strength of Daechanar’s attacks, the noble brother was barely able to defend himself, the dark b lade slicing into his armor and flesh several times. Blinded by arrogance and seeing his imminent victory, the traitor hadn’t realized the trap until it was too late.\n\nWhen they were children, they used to spar with wooden swords in their keep’s courtyard. The older brother was the fiercer, nimbler fighter, but the younger brother more cunning. Whenever Daechanar tasted victory, he relished in it and abandoned his defense in order to end the fight. Iarchon put himself on the brink of defeat before his opening appeared—a gap in Daechanar’s defenses. He swiftly ducked under a slice meant for his neck and drove his sword into Daechanar’s chest. The turncoat’s eyes widened and his face twisted into an expression of agony.\n\n“I know not who will win,” Iarchon responded, pushing his blade deeper into his brother’s chest, “only that you will not survive to see the war’s end.” Daechanar gasped for air, his lungs pierced by Iarchon’s blade. His voice croaked, one last gasp before his breath escaped him.\n\n“You’re wrong, little brother,” he smiled. “I will outlive all of you and haunt your descendants long after you are dead. My master has seen to that.”\n\nThen the life fled from Daechanar’s eyes, and he fell into his brother’s arms.\n\n \n\nAngmar Awakened Cycle Design Notes\n\n“No one lives in this land. Men once dwelt here, ages ago; but none remain now. They became an evil people, as legends tell, for they fell under the shadow of Angmar. But all were destroyed in the war that brought the North Kingdom to its end. But that is now so long ago that the hills have forgotten them, though a shadow still lies on the land.” –Aragorn, The Fellowship of the Ring\n\nThe story of “The Lost Realm” and the “Angmar Awakened” cycle explores the rich history of the Dunedian of Arnor and their long war with the Witch-realm of Angmar by introducing a new conflict between those two powers in the time period of The Lord of the Rings: The Card Game. During that time, the Witch-king commands the tower of Minas Morgul and the kingdom of Angmar has been abandoned for centuries, so for the purposes of our story we introduce a powerful sorcerer, Daechanar, who is rebuilding the ancient kingdom by drawing all manner of evil creatures into his service.\n\nDaechanar is just one of five key figures that we created for this cycle, and we hope that fans of The Lord of the Rings will appreciate our efforts to develop characters and a story that feel at home in Middle-earth. Daechanar in particular was an exciting character to explore: a traitorous Dunadan who became a powerful sorcerer under the tutelage of the Witch-king himself. His back story was inspired by the history of Rhudaur as described in the appendices of The Return of the King. From The North-kingdom and the Dunedain we learn that after the kingdom of Arnor was divided, the people of Rhudaur became allied with Angmar. So, for our story, we suggest that some of the Dunedain who lived in Rhudaur at that time became servants of the Witch-king. Daechanar would have been chief among them, and he learned to command the evil spirits of Angmar from his Nazgul master. His Wraith lieutenant, Thaurdir, would have been one of those evil spirits.\n\nAs for the Dunedain of Arnor, not many details are provided about their day-to-day life and culture in The Lord of the Rings, so we did our best to draw inspiration from the information that is available. We do know that the Rangers are a wandering people who keep a constant watch over the lands within the bounds of their ancient kingdom. For the purposes of our story, we suggest that the Dunedain may have used the ruins of Fornost as meeting grounds, since we know from The Return of the King that they visited those ruins from time to time.\n\nTo help represent the bravery and nobility of the Rangers of the North, we introduce two Dunedain characters: Iarion, and his pupil, Amarthiul. We hope that their story of kinship is one that the players enjoy. For the character of Iarion, we assume that other Dunedain, besides the heir of Valandil, are able to trace their ancestry to noble families from the three kingdoms of Arnor. It is Iarion’s lineage, as a descendant of Iarchon, that ties him to the villain Daechanar. That bond is what drives our story forward. For the character of Amarthiul, we explore the question of how the Dunedain grow to manhood and attain their renowned skills. Since we know that the Rangers are primarily a houseless people, we suggest that young Dunedain live in the wild with a mentor, most likely their father, and learn from following him. The bond that would result from that close friendship would undoubtably be strong, as we see in Amarthiul’s determination to rescue Iarion.\n\nOverall, we hope to have told a compelling tale that conceivably could have rested within Tolkien’s historical framework for Middle-earth. We hope players enjoyed our attempts to stay within Tolkien’s vision, and we hope, above all, that the players had great fun in overcoming the challenges presented in the “Angmar Awakened” cycle.\n\nEdited June 10, 2016 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2261263","commentId":2261263,"userName":"Ecthelion III","timestamp":1465569227,"content":"Treachery of Rhudaur:\n\nThe Treachery of Rhudaur\n\nHaving escaped imprisonment in the Goblin dungeons of Mount Gram and an icy death in the rugged Coldfells at the hands of hungry Trolls, the heroes had finally reached the woods of Rhudaur. The company made good time for several days, fair weather and plentiful food motivating them to travel at a brisk pace. Yet, no matter how many leagues they crossed, the dark presence and fear that had been tugging at the back of their minds ever since escaping Mount Gram never ceased to haunt them. When they slept, they were plagued by dreadful nightmares, and every waking moment was filled with the sensation of being pursued.\n\nAs they traveled, evidence of the kingdom’s collapse peppered the woods. They crossed through ancient ruins and made their way around towers of stone and rubble, long forgotten and ravaged by years of disrepair. “This area has been largely uninhabited for centuries,” Amarthiul explained to them. “Once Rhudaur was annexed by the Witch-king, those loyal to him were called to fight in his long war with Arthedain. The kingdom of Rhudaur was abolished and left to ruin.”\n\n“They should have you teaching young pupils,” one of the companions said with a chuckle, and Amarthiul himself gave a smirk.\n\n“Perhaps, but this is the path I chose for myself,” Amarthiul disclosed. His expression grew solemn. “When I was younger, I followed Iarion and several other Rangers on a hunting expedition. I was eager to prove myself to the others, that I could be one of them. But I was too brash and foolish, and the orcs captured me. Iarion risked his life to save me. His determination, his willingness to sacrifice everything, inspired me to become more than a scholar or healer. I swore that I would repay my life debt with steel and blood. I wanted to become a warrior and a leader like him, to save others like he saved me.” The Ranger gave a sigh and rubbed his forehead, worried. “Now he is the one held captive, tortured or worse, and I am powerless to help.”\n\nAmarthiul appeared inconsolable. It had been tough watching the young Ranger’s determination go unrewarded for so long. “I understand now why you are so driven to find him,” one of the heroes said. “Do not lose hope. We are not defeated yet.”\n\nJust then, the young Ranger’s gaze was drawn behind the heroes, deeper into the woods, and his eyes widened. “Is that what I think it is?” he muttered, and ran ahead. They hadn’t seen Amarthiul run that swiftly since departing from Fornost. It didn’t take long to catch up to the Ranger—the building he had seen lay fifty meters away, obscured by trees and brush. The pinewood forest opened into a small clearing, concealed on all sides by dense overgrowth. At the other end of the clearing, they saw a stone gatehouse, decrepit from years of disrepair, forgotten by time, but standing strong nevertheless. Behind the gatehouse stood the ruins of an ancient keep tucked into the woods. They had seen several such ruins throughout their journey, but what caught their eyes was the symbol painted upon the wooden door of the gate. It was the symbol of the regal hawk-in-flight. Amarthiul pulled Iarion’s pendant from underneath his tunic, where he wore it on a thin chain. “This symbol… It’s the same!” he exclaimed, holding the pendant up next to the symbol on the door.\n\n“You said Iarion wore this pendant proudly as a symbol of his lineage,” one of the heroes said, and the company exchanged anxious glances. “This is a fortuitous discovery. We have not the slightest clue why Thaurdir—and this Daechanar who commands him—took Iarion captive at Fornost. If Amarthiul is right and the Wraith was after Iarion in particular, these ruins might hold the answer to this mystery.”\n\nThere was a murmur of agreement, and Amarthiul nodded. “Then what are we waiting for?” he declared, an eager light in his eyes. But as soon as they opened the door to the gatehouse, a furious gale, chill as ice, knocked them to the ground. The wind shrieked. There was a foulness in the air all around them—in the ruins, and in the woods behind them. Something evil haunted Iarion’s ancestral home, and worse, the malevolence that had followed them from Mount Gram was close behind…\n\nYou have decided to explore the ruins of this ancient keep, but Thaurdir pursues you, and time is of the essence.\n\nWhen you touch a dark blade, you can feel a cursed power coursing through it. In Tengwar, the name “Daechanar” is inscribed upon its handle.\n\nYou look through the keep’s many torn and ancient records, hoping to find information to help you understand the Enemy’s plan. You find a tattered, barely legible scroll dated over 1000 years ago, summoning those loyal to the Witch-king of Angmar for an assault on Rivendell.\n\nYou search through the ashes of the keep’s destroyed rooms. If you are diligent, you may be able to find a clue as to Iarion’s ancestry. You find a pendant, similar to the one you’ve seen Iarion wearing. The inscription on the back says: “Iarchon, may this pendant guide you away from the shadow that dwells within us all. –Your loving father”\n\nAs you study the clues that you’ve found, you feel a chill wind flow through the keep. “You will not leave this place alive,” a sinister voice echoes throughout the halls. “My master Daechanar wills it so.”\n\n“Thaurdir!” Amarthiul exclaims, unsheathing his blades.\n\nThe wraith you fought in Fornost has followed you since your flight from Mount Gram. Your only hope is to escape with the clues you’ve found.\n\nThe company’s investigation of the ruins was fruitful, but dangerous. Iarion’s ancestral keep was haunted by the wights of Dunedain who had sided with Angmar, and the spirits of those they had slain in their wicked pact. It seemed that few Dunedain had managed to escape from this place alive, just as the heroes were barely able to escape with their lives.\n\nOnce they had reached a reasonable distance, they began to piece together what they had found inside the keep as they walked at a brisk pace. Most of the ancient documents they found were too tattered and faded to read, but some were still legible. Among them was a family tree, inscribed inside a leather tome bearing the hawk crest they had become familiar with—the crest of Iarion’s family.\n\n“Look!” the hero holding the tome shouted, pointing to the tree. “I recognize this name: Daechanar. That is the same name as the one who commands Thaurdir—the “lord of Angmar” mentioned in the Goblin dungeons!”\n\nOne of the companions shook her head, pondering what they had learned. “It cannot be the same person. It’s been over a century. The Dunedain are long-lived, but they are not immortal. The Daechanar in this family tree should be long dead by now…” They pondered that thought for some time, but they were too weary from their hardships to come to any conclusions. While they were starting to understand the events that had unfolded in Arnor many hundreds of years ago, there were too many pieces of the puzzle still missing.\n\n“We should continue to Rivendell,” one of the heroes declared at last. “Even Thaurdir cannot pursue us there, and we can consult Elrond about these matters. If there is anyone who will understand what we are dealing with, it is he.” There was a murmur of agreement, and the company continued traveling with great haste. The ghostly presence of Thaurdir hung over them still, an ominous stormcloud threatening to overtake them if they dwelled any longer…\n\n\n\n \n\nThe Battle of Carn Dum:\n\nThe Battle of Carn Dum\n\nThe leaves had fallen and winter’s cold bite had crept ever southward by the time the heroes’ company reached Rivendell. They were greeted by Elven guards who recognized the heroes and welcomed them, escorting the company into The Last Homely House and offering them food and drink, which they accepted heartily. When they asked to see Elrond, they were granted a swift audience and brought into Elrond’s Hall.\n\nThe Elf-lord entered soon after, bidding the heroes to sit and tell their tale. The company spoke at length with Elrond about their long journey—their discovery at Amon Forn, the attack on Fornost, their imprisonment in Mount Gram, and the information they found in the ruins of Rhudaur.\n\nWhen they mentioned the name Daechanar and showed Elrond the tome they had found in the home of Iarion’s ancestors, his eyes narrowed with recognition and his jaw clenched. “That is a name I have not heard spoken in over a thousand years,” he said. “The Daechanar you speak of was once a Dunadan of Rhudaur. It is he who paved the way for the kingdom’s collapse, defecting to the side of Angmar and joining the Witch0king as one of his trusted lieutenants. His brother Iarchon and his sons were among the few Dunedain who managed to escape, fleeing here to Imladris to dwell for a time.”\n\nElrond knew of what he spoke by memory. He had lived through these events, and not read of them in a book. “Not long after, the forces of Angmar lay siege to Rivendell. We were beset by our enemies for some time, but after many seasons we broke the siege. Iarchon was among those who fought to defend Imladris. I watched as he met his traitorous brother on the fields of battle. Daechanar was slain and the battle was won, but Iarchon was disturbed by his brother’s last words and came to me seeking counsel. I still remember those words, to this day: ‘I will outlive all of you and haunt your descendants long after you are dead. My master has seen to that.’ I feared that the lord of the Nazgul had taught some manner of foul sorcery to his lieutenant, that which knits dead flesh and traps spirits long-deceased within this realm.”\n\nAmarthiul’s eyes went wide with fear and realization, and he rose to his feet. “Do you mean to tell us that the Daechanar who commands the dead we have encountered is this same Daechanar, who died so long ago?”\n\n“Just so,” Elrond replied, and bid the young Ranger to sit once more. “Only I believe he was never truly defeated—his body was broken, but his spirit remained. ‘I will haunt your descendants long after you are dead.’ You say that Iarion was captured alive at Fornost, and I do not believe this to be coincidence.” He paused for a long moment, considering what he had heard. “Iarion is of Daechanar’s blood. I believe be means to possess Iarion, to use as his new body. Then, his return to this world will be complete. With the Witch-king in Minas Morgul, Daechanar would rule over the dark land of Angmar—you’ve already seen orcs at his command and the Goblins of Mount Gram in his allegiance. The safety of the north would be shattered.” It seemed difficult to believe, but the wisdom of Elrond did not lie, and the heroes did not doubt for a moment the truth behind his words. Finally, everything they had experienced made sense.\n\n“Iarion has been captive for weeks,” one of the heroes said mournfully, hoping all was not lost. “Are we too late to stop Daechanar’s plan from coming to fruition?”\n\nAmarthiul clenched the pendant of the hawk-in-flight which hung from his neck, and spoke passionately. “We must head north immediately!”\n\nElrond spoke calmly despite the dire situation, raising his palm to the Ranger. “Your bravery is admirable, young Ranger, but have patience. A powerful ritual such as this is not something easily cobbled together. It is no coincidence that Thaurdir and his forces attacked when they did. In several weeks, midwinter will be upon us. It is the coldest and darkest day of the year’s cycle, the last day before life begins to spring anew. On midwinter’s night, Daechanar will find his passage into Iarion’s body easiest. If I am correct, he is biding his time and waiting for the right moment. That means we have time to gather our strength, and for you to rest. You must be weary from your long journey.” The Elf-lord then called several Elves into the hall, and tasked them with traveling south and west to find as many Rangers as they could and summon them to Imladris. “I do not have a host of Elves to send into battle, but those I can spare will accompany you north, to the fortress of Carn Dum.”\n\nThe heroes looked at one another and nodded, confirming their intentions and rising to their feet. One of them gave Elrond a short bow and addressed him politely. “Daechanar must be stopped. We shall venture north as well, and see this mission to its end.”\n\nAmarthiul turned to the heroes, his expression full of stern determination. “My friends, time and time again you have put your life on the line for my kin. Please, allow me to join you. Wherever your travels lead you, my swords shall be yours if you give me leave to assist.”\n\n“You have earned your place among us,” one of the heroes said, clasping Amarthiul’s forearm. “We are grateful to have you fighting by our side.”\n\nFor over a fortnight the company rested well in Rivendell, recovering from their wounds and exhaustion. Each day more Rangers responded to Elrond’s call, arriving in Imladris for their brethren who fell in Fornost. They waited as long as they could to prepare for the assault, but they were soon out of time and could tarry no longer if they wished to reach Carn Dum before the winter solstice. With a small but determined band of Elves and Rangers at their side, their only hope was to fight their way into the fortress so they could stop Daechanar’s ritual…\n\nYour company has made its way swiftly north, and finally the fortress of Carn Dum looms before you. Unsure if you have arrived in time, you can only hope beyond hope that Iarion is still alive.\n\nThaurdir has mustered the defense of Carn Dum. There is no turning back now. “For Iarion!” the Rangers begin to shout, unsheathing their swords.\n\nA swirling dark cloud starts to gather above you, and a cold wind tenses your muscles. “I have a bad feeling about this…” you hear Amarthiul mutter. It seems Daechanar’s ritual has begun. Sensing you have little time to spare, your company rushes to the gates of Carn Dum.\n\nAs they slew Thaurdir, his remains crumbled and decayed into ash before their very eyes, and his armor and weapon clattered to the ground harmlessly. But before they could rejoice in their victory, the howling of wolves sounded in the air, as if all around them.\n\n“Goblins!” One of the Rangers in the rear ranks shouted, “Goblins from Mount Gram!” The company found themselves assaulted from the south by Goblins while the Orcs of Carn Dum rallied their defenses once more. They had but a moment to slip into the fortress before they were surrounded on all sides. One of the Elves that had accompanied them from Rivendell turned to the heroes with a grim expression and shouted over the clamour of battle, “You must make your way into the fortress and stop Daechanar’s ritual!”\n\n“What about you?” one of the heroes replied, worried. “You cannot hold off these Goblins forever!”\n\n“Then do not take forever! Now go!” he beseeched the heroes again before joining the fray. The heroes had no choice but to leave the rest of their party to fend off the Goblins, slipping through the gates of Carn Dum. They slew the few Orcs that remained in their way, and infiltrated the enemy’s stronghold to confront Daechanar and rescue their friend…\n\n\n\n\n\n \n\nAmarthiul backstory:\n\n\n\nAmarthiul\n\nIarion placed his hand on the hilt of his sword as he often did when he spoke sternly to his pupil. “You are not coming with us on this mission. I have made myself clear on this matter numerous times.” His order was firm, his gaze unwavering. Years ago, when Amarthiul’s father fell in battle, it was Iarion who had taken the body in and become his mentor, teaching him the ways of the Dunedain. The boy was smart, but reckless.\n\n“I am a better fighter than any of the others my age, and the swiftest. I have passed every test the elders have given me. I am ready, I swear to you!” Though Amarthiul was only ten-and-four, he spoke the truth. Among his peers, he had proved himself to be of superior intelligence and skill at arms. The boy was quick to learn and already knew much of their people’s lore, but he was more interested in hunting Orcs and other agents of the Enemy.\n\n“You believe that winning a hundred sparring matches and reading of the wars of our ancestors prepares you for anything, but you have never hunted an enemy such as this. Orcs are tough-skinned, mighty, and truly frightening. Their hate is overwhelming; it drowns their thoughts with rage and makes them more dangerous than you can imagine.\n\nAmarthiul put on a brave face and began to speak, but his mentor shook his head and cut him off. “My word is final. You are to stay here and continue your training.” With that, Iarion and the other Rangers left Fornost with haste. Their mission was urgent. Scouts had reported Orcs venturing along the hills of Evendim. Whether they were agents of a greater plot or searching for victims along the shores of Lake Nenuial, the Rangers would deal with them all the same.\n\nAmarthiul refused to be left behind so easily. He gathered several days’ worth of rations and armed himself with two blades from Fornost’s armoury. He followed the other Rangers west, close enough that he could track their prints, but too far for them to tell they were being shadowed. The young Dunadan took care to make sure he wasn’t spotted; he knew if he revealed himself close to the river Brandywine, the Rangers would have no choice but to let him tag along.\n\nThe Rangers’ pace was much faster than Amarthiul had anticipated, crossing many leagues each day. Though he struggled to keep up, he was determined to prove he was capable of the feats of his brethren, and his resolve spurred him onward. He fancied that when he finally revealed himself to the other Rangers, they would be proud of him, impressed that he was able to keep pace.\n\nUnfortunately for Amarthiul, he hadn’t anticipated the Orcs traveling east along the Brandywine. Seeing an easy target, they came upon Amarthiul under the cover of night, when they were strongest and their foe was weary. When the first Orc screamed a battle-cry in its guttural tongue, Amarthiul froze and his heart pounded in his chest. The Orcs charged at him from all directions. Valiantly he drew his blades and tried to defend himself, but he was overcome with terror. His years of training fled from his mind, replaced by panic. Within seconds, he was overmatched.\n\nThe Orcs weren’t looking to kill the young one. Instead, they knocked him to the ground and disarmed him. One Orc grappled him, and he was blindfolded and bound tightly with thick rope.\n\n“Har! What have we got here lads?” asked an Orc with a laugh, kicking the bound Dunadan cruelly.\n\n“Looks like fresh meat,” answered another. “Let’s eat it!”\n\n“Don’t be too quick! This one’s a young ‘in. I bet there’s more of his kind nearby. Let’s catch ‘em first. Then we’ll kill the whole lot.”\n\nAmarthiul cursed himself for his foolishness. Because of him, the other Rangers would be waylaid by the band of Orcs they sought to hunt.\n\n“No! I’m the only one—” he began to say, but one of the Orcs gagged him with a sash of heavy wool and his voice came out muffled.\n\nThey tied him upside-down from the branch of a high tree and hid, knowing that any other Rangers nearby would come to investigate the sounds of the scuffle. Before long, Amarthiul heard the sounds of leaves rustling around him, and suddenly the sounds of battle erupted like a storm. Blindfolded and unable to see, he could only listen helplessly as he heard swords whistle, bowstrings twang, the clash of steel on steel. And then, it was quiet.\n\nAmarthiul was cut loose and dropped to the ground, his bounds cut one at a time, though he was held from behind firmly by his wrists with a gloved hand. When his blindfold was removed, it was Iarion who stared at him wordlessly. All around the boy, the Orcs lay slain at their feet. Many of the Rangers were wounded, their armor nicked or cut loose, bleeding wounds being tended with herbal paste and bandages.\n\nIarion said nothing. It was the silence that stung the most. He knew he had failed them, he had put them in danger. “I… I…” he began, his heart leaping into his throat as words failed him. “…I’m sorry,” was all he could say before he began to sob.\n\n“It’s all right, young one,” his mentor said, taking the boy in his arms and resting a hand on his head. “One day, you’ll return the favor.”\n\nEdited June 10, 2016 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2272550","commentId":2272550,"userName":"Ecthelion III","timestamp":1466269384,"content":"Voyage Across Belegaer:\n\nThe road west to the Grey Havens was as peaceful and uneventful as the company of adventurers could have hoped. The horrors they faced in the dread realm were far behind them, and with spring blooming, they were free to enjoy their travels for the first time in what seemed like ages. It wasn’t long before they passed the Tower Hills, and arrived at the gates of the Havens.\n\n \n\nThey were greeted warmly by Cirdan the Shipwright, the Master of the Grey Havens, leading a group of Elves. “Thank you for all responding to my letter so quickly. Allow me to welcome you to Mithlond, the last port of the Elves east of the great sea of Belegaer,” he said to the heroes with a smile. The wisdom of ages past shone in Cirdan’s eyes. “Follow me, and I shall bring you to our meeting chambers. There, you shall discover the reason why you have traveled many leagues from Rivendell.”\n\n \n\nEager to assist in whatever manner they could, the company followed the Elves through the gates and were escorted to a tall white tower overlooking the Gulf of Lune. Elegant Elven ships were docked in the harbors, tall and white with the star of Earendil shining upon their sails. They were as much works of art as they were sailing vessels, beautiful examples of the exceptional craftsmanship of the Elves. Strangely, there were also two Gondorian vessels docked in the port, the White Tree of Gondor emblazoned upon their sails.\n\n \n\nThe tower’s circular meeting chamber was beautifully decorated. Open arched windows facing the west allowed for a steady breeze of sea-wind that kept the company cool as they waited. Soon after their arrival, a wiry middle-aged man entered the room. He had long black hair, a thinning beard, and high cheekbones. “This is Lord Calphon of Dol Amroth,” Cirdan introduced the man, “and he has come a long way by sea to seek our assistance.” Lord Calphon stood and smiled, shaking their hands one by one. His eyes were equal parts relief and worry.\n\n \n\n“It would be easier if I started at the beginning,” Calphon explained as he sat down at the table, worriedly fidgeting with his clasped hands. Cirdan made a gesture to the nobleman as if to give him the floor, and Calphon told his tale. “It started but a few months ago; I had a peculiar dream, the most vivid dream I’ve ever had. In this dream, I saw a beautiful island in the wide ocean, and I longed with all my heart to go there. I saw ruins of ancient Numenor that sprawled across the island, reaching even deeper below the waves. The moment I awoke, I knew that it was not a simple dream. But that was not the only dream I had.\n\n \n\n“I continued to dream of the island and its secrets for months. To this very day, I have visions of its temples and ruins. I did not believe the island could exist, because we in Gondor are taught that Numenor sank beneath the ocean in its entirety. I’d heard of the wisdom and foresight of the Elf-lord Cirdan, and thought that if any should know of the great ocean of Belegaer, it would be the Elves who sail its seas. So I took my ship, the Dawn Star, and the fastest ship from the fleet of Dol Amroth, the Silver Wing, and ventured here in the hope Cirdan could lend his wisdom.” He nodded to Cirdan, who turned to address the heroes.\n\n \n\n“I have been assisting Calphon in interpreting his dreams, and have come to the conclusion that the island in this visions is but a sunken peak of Numenor. That land indeed drowned beneath the waves when the Valar unleashed their wrath upon the Numenoreans. But I believe its highest peaks may have survived its Downfall. It cannot be coincidence that Calphon, one of Numenorean blood, dreams of his ancient homeland.”\n\n \n\nThe heroes listened to Calphon’s story and the wisdom of Cirdan with great interest. Once Cirdan had finished speaking, one of the heroes stood and politely asked, “Even knowing of the island’s origin, finding it in the open ocean would be quite an undertaking. Of what assistance can we be on this venture?”\n\n \n\nCirdan walked to the chamber’s open windows and looked out to the Gulf of Lune and the harbor of Mithlond. “This will be a long journey, and while I cannot see what dangers Calphon should face, I sense that great peril follows in his wake. I have not the power to command you, but should you desire to assist, I would ask that you sail with him and help him reach the island from his visions. I sense the utmost importance in this quest.”\n\n \n\nThe heroes looked among themselves for a time, but there was no argument or debate. The urgency in Cirdan’s voice and his fabled foresight were all the heroes needed. They nodded to one another in agreement. “We shall accompany Lord Calphon on his voyage,” one of the heroes stepped forward and spoke. “But, we have not a vessel of our own.”\n\n \n\nCirdan smiled and his eyes shone bright, as though he knew the heroes would accept. He bid the heroes follow him, and exited the chambers with eager steps, the company following close behind. They accompanied the Shipwright down many flights and through white archways, until they came at last to the docks of the Havens. Sunlight danced on the water’s surface, and seagulls sang over the Lune. “Behold!” said Cirdan, motioning to the nearest dock.\n\n \n\nA beautiful Elven ship lay anchored in port. It was white, with folded wings on its sides, and on its prow was carved a majestic swan. “I envisioned this vessel long before Calphon reached out to us,” the Elf-lord said, placing his hand upon the side of the ship with care. “It was built for a voyage of paramount importance, but has never yet left the Gulf of Lune. I believe this is the journey for which it was built. From here on, this ship shall be known as Oloroitare, the ‘Dream-chaser.’ I give this ship and its crew to you, the champions of Gandalf and Elrond, to keep you safe in your journey. There is another vessel docked in this port, the Narelenya, which you may also find useful, should you need it. These ships, and those of Lord Calphon, shall be your fleet.”\n\n \n\nThe Dream-chaser’s strength and beauty were second to none. The heroes thanked Cirdan with all their hearts, humbled by the greatness of the Shipwright’s gifts. “We shall not fail in our quest,” spoke one of the heroes, bowing low. “Nor shall we fail to keep safe the gifts of the Havens.”\n\n \n\n“I do not doubt it,” Cirdan replied, smiling. And with that, preparations were made for their long voyage…\n\n \n\nThe Dream-chaser and her fleet depart from the Grey Havens, in search of the island from Calphon's dreams. Only a week out from the coast, the black sails of Corsair ships can be seen in pursuit!\n\n \n\nCalphon squints at dark storm clouds on the horizon. \"In my dream, the skies were dark and full of wrath... Perhaps the island lies within that squall?\" You hesitate. Guiding your ship into a deadly storm is foolish, at best... But what if he’s right?\n\n \n\nAfter days of aimless travel at sea, a dark mist settles along the ocean's surface, obscuring your visibility and frightening your ships’ crew. \"Wait,\" Calphon says, \"this happened in my dream, too... I think if we find a way through this mist, we shall be one step closer to the island.\"\n\n \n\nCalphon bursts into one of the heroes’ quarters in the middle of the night, sweating profusely and breathing heavily. “I saw it again!” he cries. “It was the same island as before, only the sun was rising behind it, bathing the sky in orange. It must be to the east!” You can change course to follow Calphon’s vision, but you risk being discovered by the Corsairs chasing you...\n\n \n\nCalphon recognizes a bright star in the night sky, pointing to it. \"There! That star! I remember that star from my vision. I believe we must follow that star if we are to reach the island.\" Calphon’s guidance has led you this far. But none of your maps or almanacs make any mention of this bright star...\n\n \n\nCalphon insists you are very close to finding the island, but Corsairs still shadow your fleet. You must either fight them or outpace them before you can reach the island and weigh anchor.\n\n \n\n“I don’t see any more of them,” one of the heroes shouted, looking out over the great sea for any sign of black sails. The Corsairs had pursued them across many leagues of ocean. To see the horizon with no signs of the enemy was a great relief to the heroes, and to the crew.\n\n \n\n“I don’t understand,” Calphon said quietly. “Gondor is a hated enemy of the Corsairs of Umbar, ‘tis true. But why would these Corsairs pursue us for so long, and so far?”\n\n \n\n“I’m more concerned with the fact that they were so far north to begin with,” the hero chimed in. “We were only several days out from the Havens when we first spotted them. It can’t be a coincidence,” she concluded. “They must have followed your ships from Dol Amroth.”\n\n \n\nCalphon’s eyes widened, and he was stricken with concern. “What? But, I hadn’t seen any signs of them in my voyage north…” He gripped the ropes of the ship tightly, his knuckles turning white. “…It pains me greatly to think that my actions may have put the Elves of the Havens in danger. I hope that Cirdan will forgive me.”\n\n \n\nThe hero comforted Calphon with a smile. “Don’t worry. All this confirms is that our journey is not in vain. The Corsairs must have pursued us this far for a reason. Our aim should be to discover that reason. Let us find the island from your dream, and see for ourselves what secrets it holds.”"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2296117","commentId":2296117,"userName":"987654321","timestamp":1467732255,"content":"Like Psychorocka said, the game suggests the heroes won each scenario in the history of Midlle-Earth. If we had failed Shadows of Mirkwood, Gollum would have been somewhere else and couldn't help Frodo and Sam entering Mordor. If we had failed Dwarroldelf... nothing should have happened. The odd one. If we failed Against the Shadow, Cair Andros would have been taken, Osgiliath still in possession of the enemy and Faramir would be either captain of Mordor or emprisoned by refusal to be. If we had failed The Ring-Maker, Saruman would have not gained his Ring of Power, created the Uruk-Hai and allied an united Dunland. If we had failed Angmar Awakened, Daechanar would have conquered the North, including the Shire and possibly found the Ring and become ultrapoweful. If we had failed The Dream-Chaser... We will see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2296121","commentId":2296121,"userName":"987654321","timestamp":1467732346,"content":"With the PoDs, almost all don't care if we won or not. Only Sagas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=2479927","commentId":2479927,"userName":"PsychoRocka","timestamp":1477711280,"content":"Updated with the Angmar Awakened Cycle complete including backstories for Amarthiul and Rossiel and Design Notes. Thanks so much to Ecthelion III for helping out big time!!! I will try and get the narrative for The Dreamchaser deluxe box up when I have time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=3481614","commentId":3481614,"userName":"PsychoRocka","timestamp":1537798811,"content":"THE GREY HAVENS AND DREAMCHASER CYCLE\n\n \n\nVoyage Across Belegaer\n\nThe road west to the Grey Havens was as peaceful and uneventful as the company of adventurers could have hoped. The horrers they faced in the dread realm were far behind them, and with spring blooming, they were free to enjoy their travels for the first time in what seemed like ages. It wasn't long before they passed the Tower Hills, and arrived at the gates of the Havens.\n\nThey were greeted warmly by Cirdan the Shipwright, the Master of The Grey Havens, leading a group of Elves, \"Thank you for all responding to my letter so quickly. Allow me to welcome you to Mithlond, the last port of the Elves east of the great sea of Belegaer,\" he said to the heroes with a smile. The wisdom of ages past shone in Cirdan's eyes. \"Follow me, and I shall bring you to our meeting chambers. There, you shall discover the reason why you have traveled many leagues from Rivendell.\"\n\nEage to assist in whatever manner they could, the company followed the Elves through the gates and were escorted to a tall white tower overlooking the Gulf of Lune. Elegant Elven ships were docked in the harbors, tall and white with the star of Earendil shining upon their sails. They were as much works of art as they were sailing vessels, beautiful examples of the exceptional craftsmanship of the Elves. Strangely there were also two Gondorian vessels docked in the port, the White Tree of Gondor emblazoned upon their sails.\n\nThe tower's circular meeting chamber was beautifully decorated. Open arched windows facing the west allowed for a steady breeze of sea-wind that kept the company cool as they waited. Soon after their arrival, a wiry middle-aged man entered the room. He had long black hair, a thinning beard and a high cheekbones. \"This is Lord Calphon of Dol Amroth,\" Cirdan introduced the man, \"and he has come a long way by sea to seek our assistance. \"Lord Calphon stood and smiled, shaking their hands one by one. His eyes were equal parts relief and worry.\n\nONGOING PROJECT"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=4000162","commentId":4000162,"userName":"stimpaksam","timestamp":1602447664,"content":"The Fate of Numenor\n\n \n\nThe sky was bathed in a beautiful sunrise, the bright orange sun rising over the peak of the mountain just as Calphon had described. “Land ho!” a sailor shouted, and the fleet buzzed with activity. The island was large, dominated in its center by the peak of what must have once been a tall mountain. Deep in the island’s dense jungle were broken towers and ancient ruins.\n\n“So, it does exist,” Calphon whispered as he reached the bow of the ship, looking out to the island with great relief. “I’m glad I did not lead us to the middle of the Belegaer for naught.” The heroes shared Calphon’s relief, but had always suspected the island was real, as the wise Círdan would otherwise not have sent them on such a dangerous voyage. The ships were anchored off the western coast of the island, and the crews lowered small canoes onto the surface of the ocean. The company prepared to disembark and make their way to the shore, arming themselves in case the island proved dangerous, and making sure to take enough rations for several days.\n\n“You should stay here,” one of the heroes told Calphon as theyprepared to leave. “You’ve done your part in helping us find the island. Now is the time for us to do ours.” Calphon shook his head and refused, determined.\n \n\n“No, I must go with you,” he explained. “I may not be able to lead us once we are on the island, but I’ve spent the better part of a year envisioning this day. I need to set foot upon that shore and see the ruins of Númenor for myself.”\n \n\nThe heroes looked amongst themselves with worry, but none could bring themselves to refuse Calphon’s request. “We know not what secrets or dangers the island may hold,” one of them said. “But if this be your will, we shall honor it and protect you.” Calphon nodded without deliberation.\n \n\nThe company boarded the smaller vessels and set forth, rowing in the direction of the uncharted shore.\n\nYou arrive on the island's western beach, the edge of a dense jungle looming beyond. With no map to guide you and no idea of what to expect, you venture forward, deeper into the island...\n\nMarkings on Adûnaic suggest the existence of a grand shrine somewhere on the island. Perhaps there, you will find answers.\n\nYou search for the shrine, unsure of its exact location...\n\nDo not read the following until the heroes have won the quest\n\nExploring the uncharted island was exhausting, but it was the onslaught of the faithless undead that made the company’s travels truly perilous. Making their way deeper and deeper into the island, they’d finally come to a building of note – an imposing shrine, tucked into the side of the mountain.\n \n\nAs soon as they crossed the threshold of the shrine, they felt the presence of something dark and evil. Tapestries and statues, faded and ruined from years of disrepair, depicted the evil Morgoth as a great and powerful being. “We in Gondor know the tale of Númenor’s glory and downfall; that in the dark days before Númenor’s destruction, many faithless Númenoreans worshipped Morgoth,” Lord Calphon explained, examining one of the foreboding statues. “This must have been one of the temples erected in his worship.”\n \n\nThey searched the shrine extensively, but ultimately it proved fruitless. With many questions unanswered, the company began to lose hope that the shrine was their true destination. Wishing to continue their exploration of the island, they began to leave, but Calphon insisted they stay. “Wait! We mustn’t go yet… I… I remember this place, I think…” He ran his hand along the far wall, as if attempting to remember the secrets the stones themselves held. “I remember… The sound of a hammer upon the anvil… The heat of the forge…”\n\nThe company looked amongst one another with concern, approaching Calphon cautiously. The nobleman’s eyes were closed as he placed his ear upon the wall, listening closely. “Lord Calphon?” one of the heroes said after a moment, placing a reassuring hand on Calphon’s shoulder. The nobleman startled as though waking from a dream, and he turned towards the heroes with a shocked expression. “There’s something here!” he exclaimed. He walked several paces to another section of the wall and placed his hand on the stones.\n\nTo the company’s surprise, the stones gave way, and the wall opened outwards as if upon invisible hinges, a door leading into a hidden passageway. Wide-eyed and wordless, Calphon entered the passage, the heroes close behind. The corridor was narrow and dank. They soon found themselves descending a flight of steep stairs, deeper into the darkness of the temple. Finally, after many steps, they came to a small chamber with a raised altar in its center. Two candelabras stood on either side of the altar, ancient and unlit. On the altarlay a large key of black iron.\n\n“A key?” Calphon said, taking the key in his hands, a puzzled expression upon his face. “I don’t understand. I sought the answer to this mystery, but all we have found on this island is another riddle.”\n\n“Perhaps the Elves of the Havens will have the answer,” one of the heroes suggested. With no sign of a matching lock anywhere on the island, the company made their way west, to the coast.\n\nRaid on the Grey Havens\n\n \nThe voyage back to the Grey Havens was long, but not nearly as perilous as the adventure to find the island from Calphon’s dream. Despite the fleet’s distance from familiar stars, without Corsairs hounding their every move, it was a relatively simple matter to head northeast until they reached the coast of Middle-earth, following it north to the Gulf of Lune. The heroes were constantly on the lookout for black sails, but none were seen along their journey. Finally, they reached the safety of the Grey Havens, and were welcomed by the ringing of bells and elves singing over the gulf.\n\nOn the evening of their arrival, they were brought to the meeting hall once more, and they celebrated, for their quest had been accomplished. The Elves bid them tell of their journey, and the company obliged, although Calphon remained silent for much of the tale.\n\nCírdan took great interest in the company’s story, as they told of their voyage to find the island, and of their exploration of the ancient ruins of Númenor. “I’m not sure how I knew where to look,” Calphon said of his discovery in the shrine to Morgoth. “T’was as if… as if I was remembering something from my past, from a long time ago.” He reached into his doublet and pulled out the mysterious black key, which he’d placed on a thin chain around his neck, and set it onto the large table in the center of the council. “This strange key is all we found on the island. We thought that perhaps the wise Elves of the Havens would know what significance it holds.”\n\n\nThe Elves examined the key closely for some time, and Círdan stroked his beard in contemplation. Finally, Galdor, one of the wisest in Círdan’s council, broke the silence. “It is surely Númenorean in design, and yet there is something odd about it. I know not what lock it might open.” Calphon sighed, feeling hopeless. Galdor handed the key to Círdan, and as soon as he took it in his hands, a shudder coursed through his body.\n\n\n“There is an unwholesome quality to this key,” he said, turning the black key over in his hands and staring at it as though attempting to look through it. Before he could examine it further, they heard a commotion on the watch towers. “The sea-watchers!” Galdor shouted. The heroes rushed to the tall windows overlooking the gulf. To their dismay, they could see Corsair ships advancing from the west, their black sails difficult to see under the cover of night. Arrows red with fire began to fill the sky, and skiffs rushed toward the docks.\n\nThe chamber erupted into chaos. “Corsairs! Corsair raiders are upon us!” Elves and Men shouted outside the tower, and the sounds of battle boomed like a storm around them. The smell of burning wood wafted in from outside. Círdan ordered Calphon and the other Elves to make their way to safety before turning to the heroes and asking for assistance. “They’re burning the ships in the harbor!” he exclaimed, distraught. “We must prevent them from destroying the fleet!” Nodding in agreement, the heroes drew their blades and ran to join the fray.\n\nCorsairs are attacking the Grey Havens and burning the Elven fleet. You must defend the Havens from these fierce raiders and save as many ships as you can!\n\nA menacing ship leads the raiders, its charismatic captain bellowing orders to the Corsairs: ”Kill the defenders!” he shouts. ”Destroy their ships!”\n\nDo not read the following until the heroes have won the quest\n\nThe battle was hard fought, and several ships were lost in the flames. But with the heroes’ assistance, the Elves were able to turn the tide of the battle and repel the Corsairs. The Corsair leader, a hardened captain named Sahír, ordered a full retreat, and their ships fled quickly west out of the Lune.\n\nThe Elves put out the remaining fires and took stock of what had been lost in the raid. “Corsairs have never been seen this far north. What purpose did attacking the harbor serve?” one of the heroes asked aloud. “They had not the numbers to take the Havens.” There was a murmur of agreement at first, until one by one they realized their folly. The heroes thought about their voyage to the island, and how the Corsairs had seemed to know of their plans, pursuing them far into the Belegaer.\n\n“Lord Calphon!” a voice among them shouted, and they ran back into the tall tower overlooking the gulf, weapons still drawn. With haste they flew up many flights of steps, until finally they reached the quarters of Lord Calphon, bursting through the door.\n\nThey were too late. The nobleman lay slain on the floor of his chambers, a pained expression upon his face. He had a deep wound in his chest, as though skewered by a sword. Several of Calphon’s bodyguards, along with a few Corsairs, were also killed in the struggle. The mysterious black key, and the thin chain upon which it hung, was missing. A three-pronged hook was latched to the base of one of the open windows, and a long rope trailed down to the sea below.\n\n“We have no time to lose,” one of the heroes spoke after a moment of shock and mourning. “The Corsairs have taken the key. That is why they retreated: they’d already accomplished their goal.” The heroes gave their final regards to the nobleman from Dol Amroth, and went with haste to the Dream-chaser. There, Círdan was assessing the damage done to his greatest work, and to the other ships in the Elven fleet. When they gave him the news of Calphon’s murder, he shook his head with dismay.\n\n“You must pursue them, as fast as the wind can take you. I give to you the helm of the Dream-chaser once more. I’m sure Calphon’s crew would give leave to let you captain his ships, in his stead.” His eyes shone bright as the stars above. “The road ahead will be uneasy, and I know not where it ends. But that key is at the heart of things, that much is certain. Find it, and discover its purpose!” The heroes nodded and departed at once, in search of the artifact, and in revenge for Calphon.\n\n_______________________________________________________\n\nNa’asiyah slid her knives back into her bandolier, disgruntled. They’d accomplished their goal, but Sahír had completely ignored her plan. She and a small team of her best raiders had taken a rowboat and snuck up to the Elven towers under the cover of the evening mist. With their skill in stealth, they should have been able to infiltrate the tower, subdue the Gondorian, and grab the artifact without notice. Instead, the moment they had reached the tower, they heard bells and sounds of battle.\n\nWith all of Mithlond alerted to their presence, Na’asiyah’s job had became much more difficult. The nobleman’s bodyguards were well-trained, and several of Na’asiyah’s raiders had been lost in the fray. In the end, they had been forced to slay the Gondorian in order to get the key. She’d hoped to capture the nobleman; to make it look like he had simply vanished, so they could have made a clean getaway. But thanks to Sahír’s attack, that option had been impossible.\n\nAs soon as the Stormcaller and its fleet were out of sight of the Havens, she stormed into the Captain’s quarters, arms folded across her chest. “With all due respect Captain, what happened out there? Attacking the Havens was our plan of last resort. I thought we were going to sneak in and retrieve the artifact, not start a damned war.”\n\n\nCaptain Sahír was sitting in his chair, legs raised and crossed on his table. He looked exceedingly pleased with himself, smiling as he turned the black key over and over in his hand. “Na’asiyah,” he said casually, “We are Corsairs. We do not sneak about as thieves in the night. The sea is ours. Those who would share it must tremble to see our sails on the horizon.”\n\n\n“Captain, did you not choose me to be your first mate? If you were going to ignore my advice, the least you could have done was warn me. Now we have stirred the hornet’s nest. We could have vanished in the night, and been leagues from the Havens before they even knew the key was gone. Now they will surely pursue us with all the speed they can muster.”\n\n\nSahír’s smile diminished, and his eyes met Na’asiyah’s with a sinister glare. “My dear Na’asiyah, are you afraid of them?”\n\n\n“Of course not, Captain,” she said calmly, her eyes narrow. She’d questioned the wisdom of Sahír’s plan, but she had no qualms about spilling blood, if it be her Captain’s will. “I just hope that your prize was worth the lives of the sailors we lost.” She left with a curt nod, closing the door to Sahír’s quarters behind him. The sailors on the deck looked to her for orders, as they often did when Sahír was preoccupied. Seawind coursed through her thick hair, and she felt a moment’s reprieve from strife and anger. “Well? What are you waiting for, you lousy lot?” she shouted to the crew, hotly. “We’ve got ships to outrun! Full sail ahead!”\n\nEdited October 11 by stimpaksam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183420-the-narrative-for-this-game-so-far-story-spoilers/?do=findComment&comment=4000167","commentId":4000167,"userName":"stimpaksam","timestamp":1602448208,"content":"Thought I'd finish out the Grey Havens. I not sure what happened with the formatting but the last quest is group in with The Fate of Numenor. I can't seem to fix it."}]}