{"url":"https://community.fantasyflightgames.com/topic/183691-victory-display/","title":"Victory display","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183691-victory-display/?do=findComment&comment=1710858","commentId":1710858,"userName":"Ghost Dancer","timestamp":1438321179,"content":"I've seen this mentioned a lot on the forums and in articles lately, but I can't see any mention of it in the rule book. I'm assuming its just an area where all defeated 'Victory' cards are placed (as an easy way to track their points), but just want to check?\n\n \n\nI've been doing this anyway, but shuffling them back in the encounter deck if the deck runs out (after noting down the points)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183691-victory-display/?do=findComment&comment=1710873","commentId":1710873,"userName":"GrandSpleen","timestamp":1438322548,"content":"When you defeat an enemy with victory points, or explore a location with victory points, you set it aside into an area you'll call the 'victory display.'  Recently there are some new cards that interact with the victory display.\n\n \n\nWhen you reshuffle the encounter deck, you do NOT put the victory display cards back into the deck.  These are cards that are meant to be \"one and done\" -- typically challenging cards that you're only meant to deal with once in a game.  In later quests you start to see strong \"boss\" kinds of enemies and locations that go into the victory display as a requirement for defeating a stage of a quest, and things like that.\n\n \n\nThe manual talks about the Victory X keyword, but the official FAQ has this to say about the Victory Display:\n\n \n\n(1.29) Victory Display The victory display is a game area where victory points are tracked. Cards in the victory display are considered to be out of play, but are not considered to be a part of the encounter discard pile. Cards in the victory display are not considered “removed from game,” and some card effects may still interact with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183691-victory-display/?do=findComment&comment=1710883","commentId":1710883,"userName":"Ghost Dancer","timestamp":1438323745,"content":"Ah thanks. I like the fact they are not shuffled back in, makes sense :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183691-victory-display/?do=findComment&comment=1728590","commentId":1728590,"userName":"Narsil0420","timestamp":1439178833,"content":"I'm wondering if mire keyword in Passage of Marshes puts the location in the victory display if discarded that way..."}]}