{"url":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/","title":"(1.25) Collecting, Adding, Moving, and Gaining Resources","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1709340","commentId":1709340,"userName":"cmabr002","timestamp":1438254776,"content":"Can someone please provide clarification as to how collecting resources is different than gaining resources?\n\n \n\nBased on the bolded parts, collecting includes gaining and gaining includes collecting so why are they different terms?  Should the definition of collecting resources be read as \"Collecting resources refers to both collecting resources during the resource phase and increasing the total number of resource tokens the players control through other card effects\".  This way, it would not include moving resources.  If, however, collecting resources is supposed to include movement of resources, then I fail to see how collecting and gaining resources are different ideas.\n\n \n\nThe only reason I believe collecting resources is not supposed to include movement of resources is because in the second sentence of the first paragraph it states being unable to collect resources means you cannot obtain new resources.\n\n \n\nThanks!\n \n\n> (1.25) Collecting, Adding, Moving, and Gaining Resources\n> \n> Collecting resources refers to both collecting resources during the resource phase and gaining resources through other card effects. An effect that prevents a hero from collecting resources prevents both methods of acquiring new resources.\n> \n>  \n> \n> Adding a resource to a hero’s pool is the act of taking a resource from the token bank and placing it in that hero’s pool. Adding a resource always results in the total number of resources controlled by the players being increased.\n> \n>  \n> \n> Moving a resource is the act of taking a resource from one hero’s pool and placing it in another hero’s pool. This does not count as ‘adding’ a resource because it did not take a new resource from the token bank and the total number of resources controlled by the players did not increase.\n> \n>  \n> \n> Gaining a resource is a blanket term that includes collecting, adding and moving. Any time the number of resources in a hero’s pool is increased, that hero has gained one or more resources.\n\nEdited July 30, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1709372","commentId":1709372,"userName":"jnicol","timestamp":1438257615,"content":"My interpretation is that \"gaining\" in the 1st paragraph does not refer to Gaining as defined in the 4th paragraph, but rather is simply a synonym for \"obtaining\".\n\n \n\nIn other words, it's just a poor choice of words.\n\n \n\nHowever it is still unclear to me whether Moving resources via a card effect is permitted when the recipient is prevented from Collecting resources! I would have guessed that it was permitted, but now I'm a lot less certain...\n\nEdited July 30, 2015 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1709376","commentId":1709376,"userName":"cmabr002","timestamp":1438258033,"content":"Honestly, that's my interpretation too, but wanted to know if that's how others interpreted it or if there is an alternate interpretation that distinguishes collecting from gaining that I am overlooking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1858224","commentId":1858224,"userName":"cmabr002","timestamp":1445422769,"content":"I got an answer from Caleb on this one.\n\n \n\n> Question: If a hero \"cannot collect resources\" can that hero receive a resource if the resource is moved to the hero's resource pool via a card effect such as Blue Mountain Trader? The reason I am confused about section (1.25) is because it says the following: \"Collecting resources refers to both collecting resources during the resource phase and gaining resources through other card effects. An effect that prevents a hero from collecting resources prevents both methods of acquiring *new* resources.\" [Emphasis on the word \"new\"] It seems that moving a resource does not create a \"new\" resource and so I am not sure if it would be defined as \"collecting\".\n> \n>  \n> \n> Answer: No, a hero who cannot collect resources cannot gain them by any means. Section 1.25 of the FAQ states that collecting resources refers to gaining resources, and gaining resources includes collecting, adding, and moving. I think the confusion comes from the overlapping use of collecting and gaining. Both terms are used interchangeably, thus a hero who cannot ‘collect’ resources cannot ‘gain’ them either, and vice versa.\n\n \n\nI am glad to know I can now confidently say that gaining and collecting are entirely synonymous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1858355","commentId":1858355,"userName":"Seastan","timestamp":1445430741,"content":"> I am glad to know I can now confidently say that gaining and collecting are entirely synonymous.\n\n \n\nStage 3B of Into the Pit says \"Heroes do not collect resources during the resource phase.\" Does this mean you could not gain resources by any means, for example Steward? I realize you could wait until the planning phase, but to me this use of \"collect\" is just referring to the framework effect and isn't limiting all methods of gaining resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1858364","commentId":1858364,"userName":"cmabr002","timestamp":1445431259,"content":">  \n> \n> > I am glad to know I can now confidently say that gaining and collecting are entirely synonymous.\n> \n>  \n> \n> Stage 3B of Into the Pit says \"Heroes do not collect resources during the resource phase.\" Does this mean you could not gain resources by any means, for example Steward? I realize you could wait until the planning phase, but to me this use of \"collect\" is just referring to the framework effect and isn't limiting all methods of gaining resources.\n> \n>  \n\n \n\nI can't say for certain, but based on what Caleb said, I can only assume you couldn't use things like Steward of Gondor during the resource phase.  Although, I must say I was surprised by Caleb's answer.\n\nEdited October 21, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183614-125-collecting-adding-moving-and-gaining-resources/?do=findComment&comment=1858474","commentId":1858474,"userName":"GrandSpleen","timestamp":1445435706,"content":"It says \"do not\" and not \"cannot.\"  Seems to suggest it's only meant to remove the usual framework effect."}]}