{"url":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/","title":"What is your best deck? (Rohan)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1716300","commentId":1716300,"userName":"Fingolfin Fate","timestamp":1438537188,"content":"I would like to get this challenge up, for those who want to play. I know the strategy section has things similar to that but I still ask. I will start with Rohan, in light of the recent spoilers of Gamling and Snowmane, which I feel may both be very beneficial to the faction, what would be your best Rohan deck?\n\n \n\nA few simple rules:\n\n1) Try to be as thematic as possible, but still as good as possible also within the theme\n\n2) Use the non-yet released cards if you find them fit\n\n3) 50 cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1716317","commentId":1716317,"userName":"Gizlivadi","timestamp":1438537790,"content":"This is the solo deck I want to make when I get the Two Towers expansions. Nothing really new or different, just the standard thematic Rohan deck.\n\n \n\nTheoden\n\nEowyn\n\nEomer\n\n \n\nHama x1\n\nWestfold Horsebreeder x3\n\nWest Road Traveller x3\n\nEscort from Edoras x3\n\nWestfold Outrider x3\n\nWestfold Horse Breaker x3\n\nGamling x1\n\nEomund x2\n\nThe Riddermark's Finest x2\n\nGuthlaf x1\n\nElfhelm x1\n\n \n\nHerugrim x2\n\nAncient Mathom x3\n\nRohan Warhorse x3\n\nFirefoot x1\n\nSnowmane x2\n\nHorn of Gondor x1\n\n \n\nGather Information \n\n \n\nTest of Will x3\n\nFeint x3\n\nRide to Ruin x3\n\nMustering the Rohirrim x3\n\nHelm! Helm! x2"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1716734","commentId":1716734,"userName":"Piratelli","timestamp":1438561981,"content":"I always try to make thematic decks to play! I have to say that i like Rohan but even with the new Théoden they dont get close to silvan dwarves or outlands.\n\nI tried to use almost all thematic possibilities i guess, only using rohan allies and gandalf. \n\nMy deck build style is \"a deck to rule them all\", cause i dont like decks that are good in one specific mission but suck in others.\n\nAfter lots of experiments here what i felt that was the best for rohan so far.\n\n \n\nTheoden (spirit)\n\nEowyn\n\nThéodred\n\n \n\nhama 2\n\nelfhelm 1\n\ngamling 1\n\neoumund 1\n\nwestfold horse breeder 3\n\nrider of the mark 3\n\nridemark finest 3\n\nwest road traveler 3\n\nsnowburn scotu 3\n\nwarden of helms deep 2\n\ngandalf 3\n\n \n\nancient mathon 3\n\nsteward of gondor 3 (not thematic but really good card)\n\nherugrin 2\n\nsnowmane 2\n\n \n\nsneak atack 3\n\nvaliant sacrifice 2\n\ntest of will 3\n\nride to ruin 1\n\nhelm! helm! 1\n\nastonishing speed 2\n\ngaladrins greetings 2\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717094","commentId":1717094,"userName":"Fingolfin Fate","timestamp":1438580255,"content":"Thanks a lot guys. Very nice to see others' deck-building skills. And reassuring that other veteran players think along the same lines. I completely agree, till now Rohan was fun but not close to the likes of Silvan. I hope Gamling and Snowmane will be valuable additions. I was thinking 2 copies of Gamling and 1 of Snowmane but I am not sure. Now I see both of you run it the other way around.\n\n \n\nWhat I really like to see is when an old (an generally mediocre) card gets much better. I think that is what happened to Mustering the Rohirrim. The card has been useful since the beginning in a way because there were already enough Rohan allies -- say since the end of the Mirkwood cycle. What made a big difference is Spirit Théoden because now you can afford to spend that one resource for the event since you will save it with Théoden.\n\n \n\nI was mostly doing the Tactics version with Éomer where the card draw is lacking. The Leadership version with Théodred can get around it with Sacrifice and Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717104","commentId":1717104,"userName":"danpoage","timestamp":1438581512,"content":"I had a chance to play my mono-Spirit Rohan deck quite a bit at Gen Con with Gamling and Snowmane. Those cards elevate that deck to a whole new level. It is a sight to behold.\n\nEdited August 3, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717128","commentId":1717128,"userName":"Fingolfin Fate","timestamp":1438584070,"content":"Good to hear that. I really, really hope so. The idea of having Gamling recycle all those Rohan allies with very potent discard effects is great. The fact it triggers Éomer, Horn, Sacrifice, Imrahil (across the table perhaps) is of course all for the better.\n\n \n\nHow many copies of Gamling and Snowmane did you run in your deck? I am guessing three each if you were playing mono-Spirit with Éowyn? Who was your third hero, Dúnhere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717603","commentId":1717603,"userName":"danpoage","timestamp":1438613154,"content":"I am currently running 2 copies of Gamling, but after seeing just how well he works I will probably increase that to 3. Incidentally, with critical unique Rohan allies like Eomund, Hama and now Gamling, Mustering the Rohirrim is a very important card for this archetype. My third hero is actually Galadriel. Granted, it's not the most thematic choice, but it gives me access to plenty of threat control, as well as Asfaloth (since Nenya gives Galadriel a Lore resource icon). I've found the extra threat control and location control to be essential in 4-player games (Northern Tracker is my only non-Rohan ally). After I have a second to catch my breath and recover from Gen Con, I want to revisit my Rohan \"leaves play\" deck that included Prince Imrahil. Thanks to Hama and Gamling, that deck might actually be viable without having to chump block. It is exciting to see Rohan decks ascend in prominence."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717891","commentId":1717891,"userName":"Teamjimby","timestamp":1438621617,"content":"Grandspleen and I have been playing through the campaign with a pair of Rohan decks that work really well together.  He runs Eomer, Merry, and Grima while I use Theoden, Eowyn, and Erkenbrand.  So far we've played through the first 6 quests plus Old Forest and Fog on the Barrow Downs and I think we've only lost twice (a.k.a., a hero died so we reset the quest).  So far my deck has been ally-heavy with very few attachments, because Theoden's discount combined with A Very Good Tale can get you off to a great start.  But now with Snowmane in the mix, I might transition and include Celebrian Stone and Herugrim to pimp out Theoden."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717953","commentId":1717953,"userName":"Authraw","timestamp":1438623227,"content":"I've been playing solo through the Saga boxes with a Merry/Grima/Théoden deck. I always run it with 3 spheres, but I switch Merry and Théoden from quest to quest depending on whether I need a quicker start (Tactics Théoden, Spirit Merry) or more allies (Spirit Théoden, Tactics Merry).\n\nThere aren't many Lore cards, just some of the more expensive draw and healing cards. The rest is evenly split between Tactics and Spirit, with most of the Spirit cards being rohan allies.\n\nThéoden ends up doing the majority of the work, so he gets plenty of weapons and readying. I was planning to use Tireless Ranger to be able to put Wingfoot on him, but now that Snowmane is out I might not need it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1717994","commentId":1717994,"userName":"Fingolfin Fate","timestamp":1438624299,"content":"Thanks for all the input fellas. Appreciated.\n\n \n\nI have put Gríma into good use before, but always with Strider. I am yet to try Erkebrand, he might be one of the very few heroes (him and one or two Dwarves, I believe) that I have never given a try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1718161","commentId":1718161,"userName":"Teamjimby","timestamp":1438629692,"content":"> Thanks for all the input fellas. Appreciated.\n> \n>  \n> \n> I have put Gríma into good use before, but always with Strider. I am yet to try Erkebrand, he might be one of the very few heroes (him and one or two Dwarves, I believe) that I have never given a try.\n\nYou need to give Erkenbrand a try.  Assuming you have access to healing, I would generally prefer to have him over Beregond.  I can't tell you how many extra attacks, discarded attachments, and returns to the staging area that I've cancelled with him.  I would only prefer Beregond if I am going up against a lot of enemies with 5+ attack or don't have healing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1718935","commentId":1718935,"userName":"Ecthelion III","timestamp":1438660711,"content":"Erkenbrand is great! Plus with the new Tactics attachment from Wastes of Eriador, he kicks absolute booty!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1718972","commentId":1718972,"userName":"Fingolfin Fate","timestamp":1438663011,"content":"I totally see that guys. I am noticing it more and more how much the shadows effects cost me. Before I was usually afraid of a chump getting killed or otherwise making the attack undefended (Wolves of Mordor, Captured Watch-tower from Massing at Osgiliath, for instance), so I was trying to avoid those. Now, losing an attachment, additional attack, or especially returning the enemy to the staging area when you had prepared three or four characters to strike it: it is painful.\n\n \n\nBut the Helm doesn't work with him. Still… the biggest problem for me was to choose the right deck for Erkebrand. I have lately preferred Spirit-Tactics Rohan decks but I see Spirit-Leadership may be worth of reinventing (those Dúnhere, Éowyn, Théodred decks from the Mirkwood era were great, though they would seem rather silly within the current card pool context)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1719030","commentId":1719030,"userName":"Teamjimby","timestamp":1438666547,"content":"> Erkenbrand is great! Plus with the new Tactics attachment from Wastes of Eriador, he kicks absolute booty!\n\nI hate to burst your bubble, but you can't use the Raven Winged Helm to cancel the damage that Erk does to himself.  Well, you technically can, but it prevents his ability from actually working."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1719052","commentId":1719052,"userName":"danpoage","timestamp":1438667684,"content":"The Might of Rohan v2\n\nHeroes:\nThéoden (ToS)\nÉowyn (Core)\nÉomer (VoI)\n\n \n\nAllies: 24\nWestfold Horse-breeder (VoI) x3\nEscort from Edoras (AJtR) x3\nThe Riddermark’s Finest (THoEM) x2\nWest Road Traveller (RtM) x2\nWestfold Outrider (VoI) x2\nWestfold Horse-breaker (THfG) x2\nÉomund (CatC) x3\nGamling (TLoS) x3\nHáma (ToS) x3\nElfhelm (TDM) x1\n \n\nAttachments: 13\nArod (ToS) x1\nRohan Warhorse (VoI) x1\nSpear of the Mark (TMV) x3\nSnowmane (TLoS) x3\nFirefoot (TDT) x2\nHerugrim (ToS) x3\n \n\nEvents: 12\nFoe-hammer (TH:OHaUH) x3\nFeint (Core) x2\nA Test of Will (Core) x2\nMustering the Rohirrim (THfG) x2\nRide to Ruin (THoEM) x2\nAstonishing Speed (RtM) x1\n \n\nSide Quests: 1\nGather Information (TLR) x1\n \n\nSideboard: 15\nRider of the Mark (RtR) x2\nElfhelm (TDM) x1\nSecret Vigil (TLR) x3\nHasty Stroke (Core) x2\nRide to Ruin (RtM) x1\nCharge of the Rohirrim (CS) x1\nHelm! Helm! (ToS) x2\nRide Them Down (TAC) x2\nAstonishing Speed (RtM) x1\n\nEdited August 4, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1719162","commentId":1719162,"userName":"Fingolfin Fate","timestamp":1438675351,"content":"Thanks Beorn. My deck-list is not very different from yours. I do include Ride them Down and Helm! Helm!, Forth Eorlingas! and even a copy of Charge of the Rohirrim but I almost always find most of these cards sitting in my hand when I draw them. A copy or two of Eorlingas is probably still worth it but I fear the rest is mostly just for theme and the staples such as A Test of Will or Feint will generally have much more utility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/183962-what-is-your-best-deck-rohan/?do=findComment&comment=1719347","commentId":1719347,"userName":"Ecthelion III","timestamp":1438691225,"content":"> > Erkenbrand is great! Plus with the new Tactics attachment from Wastes of Eriador, he kicks absolute booty!\n> \n> I hate to burst your bubble, but you can't use the Raven Winged Helm to cancel the damage that Erk does to himself.  Well, you technically can, but it prevents his ability from actually working.\n\nAh well. I guess it's the same as Treebeard/Song of Mocking?"}]}