{"url":"https://community.fantasyflightgames.com/topic/184199-ithilien-archer/","title":"Ithilien Archer","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184199-ithilien-archer/?do=findComment&comment=1720783","commentId":1720783,"userName":"kofdaniel","timestamp":1438750104,"content":"Hi, the wording in Ithilien Archer says:\n\n \n\nResponse: After Ithilien [http://hallofbeorn.com/Cards/Search?Trait=Ithilien.] Archer [http://hallofbeorn.com/Cards/Search?Trait=Archer.] attacks and damages an enemy, return that enemy to the staging area. \n\n \n\nLets say I am attacking a 3 defense enemy and Im attacking with Ithilien Archer and another ally or hero with at least 2 attack, I can say that the damage is always done by the Ithilien Archer? so I can trigger his ability. That is important if I have a 6 or 7 defense beast and I want to return it to the staging area attacking with the archer and 4 or more other allies.\n\n \n\nAs a bonus if I have different allies with different abilities that trigger at doing damage, can I trigger all or some?\n\n \n\nTy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184199-ithilien-archer/?do=findComment&comment=1720810","commentId":1720810,"userName":"GrandSpleen","timestamp":1438751734,"content":"Yes, you can do this.  There was a ruling way back about the tactics event Heavy Stroke -- after a Dwarf character deals X damage to an enemy, deal X damage to that enemy again.  If a Dwarf attacks with a non-Dwarf, you have to factor each character's willpower independently.  But it's up to you to decide which character's attack gets past the enemy's defense stat.\n\n \n\nSo Ithilien Archer should work the same way.  It's up to you to decide which character is actually damaging the enemy.\n\n \n\nHaving written that, I suppose if you have multiple characters whose abilities trigger when they deal damage, you should only be able to trigger the ability on the character or characters whose attack value actually got past the enemy's defense.... depending on the way the ability is worded.  If it says something like \"After this character participates in an attack that damages an enemy,\" then I suppose that character doesn't need to be the one to deal the damage.  But if it says \"After this character damages an enemy,\" I think that character needs to be the one dealing."}]}