{"url":"https://community.fantasyflightgames.com/topic/184176-tauriel/","title":"Tauriel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720416","commentId":1720416,"userName":"Qaanaaq","timestamp":1438727297,"content":"There was a Tauriel contest at COTRP, and I have sent the picture, but somehow it did not show up in the contest. I did not care mucuh then, have even forgotten.\n\nI have found the picture on my harddrive, and I thought, what a card!\n\nI think I really made her work thematically, and this is how she should have been in the movies. \n\nplus, I have always been bothered why is she Taur - iel, she must be something bullish... \n\nHMPJpVu.png [http://i.imgur.com/HMPJpVu.png]\n\nEdited August 4, 2015 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720484","commentId":1720484,"userName":"alexbobspoons","timestamp":1438730427,"content":"Lol @ facial hair hehe\n\nShe did look cuter in the film though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720650","commentId":1720650,"userName":"ppsantos","timestamp":1438740562,"content":"Base 6 attack str? Way too strong.  Nobody, not even Aragorn, Gimli, Gandalf, or Saruman, has it that high."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720684","commentId":1720684,"userName":"bubblepopmei","timestamp":1438742930,"content":"Haters gonna hate.\n\nTauriel and Kili is the most important OTP relationship of Tolkien's career."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720692","commentId":1720692,"userName":"PsychoRocka","timestamp":1438743387,"content":"Dude you best be making an outrageous joke. That is a highly offensive statement  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720725","commentId":1720725,"userName":"bubblepopmei","timestamp":1438745776,"content":"Who trolls the trolls.\n\nI actually liked it ^__^.\n\nAs a woman, I'm 100% in favor of replacing white dude bros with women and inventing them where no dude bros could be replaced.\n\nThe offensive thing is calling me dude. Bro."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720768","commentId":1720768,"userName":"Epi Lepi","timestamp":1438748856,"content":"> Who trolls the trolls.\n> \n> I actually liked it ^__^.\n> \n> As a woman, I'm 100% in favor of replacing white dude bros with women and inventing them where no dude bros could be replaced.\n> \n> The offensive thing is calling me dude. Bro.\n\n \n\nBasically this: https://twitter.com/timescanner/status/546187187575095296 [https://twitter.com/timescanner/status/546187187575095296]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720785","commentId":1720785,"userName":"PsychoRocka","timestamp":1438750293,"content":"My apologies for any offense with dude, its a weird habit I have. I call female friends in real life dude quite often so just a bad habit of mine. Not to mention the fact I had no idea what gender you are so it is in no way intentional.\n\nAlso I just meant with the whole Tauriel and Kili relationship. It completely destroys the significance of Gimli and Legolas's friendship. Also it is completely Peter Jackson invented and not at all part of Tolkiens career. Also Beren-Luthien, Aragorn-Arwen, hell even Melian and Thingol are all far more important relationships in Middle Earth. But then you know all this and were simply making a joke =P\n\n \n\nAlso for the record I really enjoy all the FFG created female heroes to even it out a little especially Idraen and the new Silvan hero Rossiel. Her whole backstory with her sister is amazing and incredibly sad fitting very well with Tolkien's world.\n\nEdited August 5, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720804","commentId":1720804,"userName":"GrandSpleen","timestamp":1438751357,"content":"The problem with Tauriel-Kili is that it was not done well.\n\n \n\nTacked.  On."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720857","commentId":1720857,"userName":"Olorin93","timestamp":1438755335,"content":"Is that a Qunari? Love it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720988","commentId":1720988,"userName":"DukeWellington","timestamp":1438766336,"content":"> Who trolls the trolls.\n> \n> I actually liked it ^__^.\n> \n> As a woman, I'm 100% in favor of replacing white dude bros with women and inventing them where no dude bros could be replaced.\n> \n> The offensive thing is calling me dude. Bro.\n\nYuck. This kind of feminist ranting is so incredibly annoying. Nobody is oppressing you. The Lord of the Rings is amazing and a big reason is how non-feminist it is. Tolkien wrote strong and compelling female characters without pretending that girls kick ass or whatever. When the politically correct thought police arrive and \"fix\" his work (by replacing Glorfindel with Arwen, for instance) it does not improve the art; it makes it worse. Go watch the hundreds of other girl power movies out there that all suck and let LOTR be the timeless classic that it is. Feminism makes everything lame, and I wish people would stop apologizing for that fact."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1720997","commentId":1720997,"userName":"banania","timestamp":1438767213,"content":"Come on... this is not \"feminist ranting\", she's just saying she's ok replacing some the male characters by female characters. \n\n \n\nTolkien was a man of his time and his legendarium is sexist. I like that FFG has created Mirlonde, Eleanor, Idraen, Rossiel, Beravor, etc. to fill in the blanks. I just wished there was more of that and also into the Leadership and Tactics sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721004","commentId":1721004,"userName":"PsychoRocka","timestamp":1438768068,"content":"Not to mention none of this was brought up to begin with. Tauriel+kili is just an abomination and I simply said that it was offensive to say its the most important relationship in tolkiens career when it is in fact not at all a part of his career and whats more not an important relationship either. You can like the relationship but to say its the most important or was written by Tolkien is just wrong and offensive to his legacy.\n\nThen all of a sudden the supposed lack of female characters in his works and the term I used to speak to another forum member (which in no way was intended to be offensive) are thrown in my face and I'm apparently the bad guy.\n\nMost people who play this game are big time tolkien fans so maybe don't say that something that is purely in the movies is better than the content in the books and if you insist on doing so be prepared for disagreement and don't try to twist it into some gender related thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721019","commentId":1721019,"userName":"DukeWellington","timestamp":1438769338,"content":"Come on... it was feminist ranting, which is why it was followed up by a link to a twitter feed on lack of female characters in Tolkien. Also, I like how the claim that it is not feminist ranting is immediately followed by saying Tolkien was a sex is man of his time... okay.\n\nWomen should not be in combat because violence is a man's role in society. That is actually entirely true and people were smart enough to recognize how reasonable that was until feminism. Now everyone on this forum can't wait to throw Tolkien and most of human history under the bus so they can be the first to apologize for offending somebody for their feminist preferences. I guess you are all people of the times.\n\nI stand by what I said. The attempts to \"fix\" Tolkien make lotr worse. Thankfully FFG hasn't gone full feminist yet so the characters are not so groan worthy. I'm sure we will see some female warrior soon though, and it will be lame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721021","commentId":1721021,"userName":"DukeWellington","timestamp":1438769459,"content":"And I bet most people agree with me. They just don't have the guts to stand up to feminist bullies and politically correct thought police."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721034","commentId":1721034,"userName":"banania","timestamp":1438770559,"content":"Yes, we men who want and like to interact with more female characters in med-fan worlds don't have guts. And other things too we don't have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721180","commentId":1721180,"userName":"soullos","timestamp":1438780804,"content":"AhNeverMind.jpg [http://i388.photobucket.com/albums/oo324/Tyrol3/AhNeverMind.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721234","commentId":1721234,"userName":"bubblepopmei","timestamp":1438783380,"content":"Well this got charming. ^___^\n\nI am being facetious to suggest that Tauriel and Kili is the best relationship in tolkien verse. Although it's nice to see a guy who is short but otherwise looks like Aragorn, a guy with daddy issues who looks like Aragorn, and Aragorn himself can find love in a universe mostly devoid of women.\n\nRanting is when a person grumbles, complains, and makes wild statements. There's ranting in these mountains but it's not coming from me.\n\nI think the card is funny but coulda been a lady. I think there's plenty of white guys in tolkien verse to replace with Arwen.I genuinely think it's absurd to venerate the preservation of something and denegrade it's evolution. That happens in other places too and it's equally sad and pathetic.\n\nI guess I know what you mean about Legolas and Gimli diminished.I don't really care, but I understand. ^__^\n\nYay ffg for continuing to be adults."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721237","commentId":1721237,"userName":"Ecthelion III","timestamp":1438783537,"content":"Idraen has more attack than Gimli. Just saying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721374","commentId":1721374,"userName":"Raven1015","timestamp":1438787777,"content":"Wow, I really dreaded the day that this kind of thing would happen in the forums. And I would feel quite cowardly if I didn't say something, despite any misgivings I might have.\n\n \n\nPointing out the limitations of Tolkien as a man of his time is not throwing him under the bus. It's what we should do with any author or person of the past. Accepting anyone wholesale and holding them sacrosanct is an invitation to shutting down meaningful thought. I love Tolkien and the stories he created so much. I can also acknowledge that there aren't many female characters. It's one thing to say that women in such a world would not be involved in battle. That's fair. But women would surely be involved in many other aspects of life in places like the Shire, Rivendell, etc. It's not slighting Tolkien to say that he did not give women a prominent place in The Lord of the Rings and The Hobbit (there are definitely more women in the First Age stuff). On the plus side, I think the few women he did include are very complex, meaningful characters. Someone like Eowyn has far more depth than she is often given credit for, as is Galadriel.\n\n \n\nI don't even want to delve into the claims made about feminism, as that is likely a can of worms that will lead nowhere good. But bubblepopmei seemed to say that as a woman, she would be in favor of adding more female characters, even at the expense of taking out male characters. This is a personal opinion and preference and not a rant. As a man, being able to see male characters that you can relate to in fantasy worlds (and that aren't cartoon characters) and in a card game is pretty much a given. When you're not on the other side of that equation, then it may be hard to understand what it's like not to have people like you represented on the page. \n\n \n\nAs a person of color, I can relate to this in that 90% of fantasy worlds/games will not have anyone that looks like me. I've struggled with my thoughts about someone like H.P. Lovecraft, for example, (creator of the Cthulhu mythos) who created amazing stories that I love, but also was a complete racist. I can acknowledge and decry his racism while not throwing out his stories or the games based on them. Thankfully, Tolkien was not as horrid about gender as Lovecraft was about race, but the idea is the same. \n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721447","commentId":1721447,"userName":"DukeWellington","timestamp":1438790252,"content":"I didn’t realize it was a joke. That softens my rage, but I still disdain feminism.\n\nI was about to counter that it still qualified as a rant, but then I realized that debating about whether a statement counts as a rant or not is a complete waste of time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721491","commentId":1721491,"userName":"legolas18","timestamp":1438791767,"content":"Though Tolkien might have been sexist (although personally I like to imagine he was not), I think one of the things that makes Lord of the Rings so great is that in that world.... Women were generally looked at as inferior.  But through his stories, there came about a few that were amazing.  In a world where females are looked at as unable to fight, Eowyn was able to rise to the top of the story in a very Mulan-fashion to show that guess what? Females CAN do stuff.  And that the men were wrong to assume otherwise.  \n\nI like to think that Tolkien did not have a large cast of female characters intentionally; not because he was sexist, but because he knew that it would make more sense in Middle-Earth, and that by having only a few, it would make them even more memorable.  \n\nPerhaps he was sexist.  And I know that somebody is going to pull the Tolkien letter on me as proof that he was... But, in my own perfect picture of Middle-Earth, this is how I would like to imagine the author and his motives."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721493","commentId":1721493,"userName":"legolas18","timestamp":1438791837,"content":"Also, I'm very sorry Qaanaaq that this thread was completely derailed into an argument."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721520","commentId":1721520,"userName":"bubblepopmei","timestamp":1438792759,"content":">  \n> \n> Wow, I really dreaded the day that this kind of thing would happen in the forums. And I would feel quite cowardly if I didn't say something, despite any misgivings I might have.\n>  \n> Pointing out the limitations of Tolkien as a man of his time is not throwing him under the bus. It's what we should do with any author or person of the past. Accepting anyone wholesale and holding them sacrosanct is an invitation to shutting down meaningful thought. I love Tolkien and the stories he created so much. I can also acknowledge that there aren't many female characters. It's one thing to say that women in such a world would not be involved in battle. That's fair. But women would surely be involved in many other aspects of life in places like the Shire, Rivendell, etc. It's not slighting Tolkien to say that he did not give women a prominent place in The Lord of the Rings and The Hobbit (there are definitely more women in the First Age stuff). On the plus side, I think the few women he did include are very complex, meaningful characters. Someone like Eowyn has far more depth than she is often given credit for, as is Galadriel.\n>  \n> I don't even want to delve into the claims made about feminism, as that is likely a can of worms that will lead nowhere good. But bubblepopmei seemed to say that as a woman, she would be in favor of adding more female characters, even at the expense of taking out male characters. This is a personal opinion and preference and not a rant. As a man, being able to see male characters that you can relate to in fantasy worlds (and that aren't cartoon characters) and in a card game is pretty much a given. When you're not on the other side of that equation, then it may be hard to understand what it's like not to have people like you represented on the page. \n>  \n> As a person of color, I can relate to this in that 90% of fantasy worlds/games will not have anyone that looks like me. I've struggled with my thoughts about someone like H.P. Lovecraft, for example, (creator of the Cthulhu mythos) who created amazing stories that I love, but also was a complete racist. I can acknowledge and decry his racism while not throwing out his stories or the games based on them. Thankfully, Tolkien was not as horrid about gender as Lovecraft was about race, but the idea is the same. \n> \n>  \n\n \n\nAs my toddler would say - 'one million infinity' likes to you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721531","commentId":1721531,"userName":"bubblepopmei","timestamp":1438793008,"content":"> I didn’t realize it was a joke. That softens my rage, but I still disdain feminism.\n> \n> I was about to counter that it still qualified as a rant, but then I realized that debating about whether a statement counts as a rant or not is a complete waste of time.\n\n \n\nYou make the world feel less safe for women. I'm quite sure you don't care aka 'i don't agree' but I state this and you should know that it is true. It is unlikely you express this only online and given that this is a lord of the rings card game forum and you are aggressive I imagine if the forum were more implicitly feminism you would have had me swatted already.\n\n \n\nWhen you inevitably look to the women in your circle and ask them, they may very well deny it. Perhaps with a nervous laugh or a pause. Regardless of what they tell you, it remains true. I would tell a lion it doesn't hurt if I thought it would stop the teeth from sinking in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721533","commentId":1721533,"userName":"Epi Lepi","timestamp":1438793062,"content":"> I didn’t realize it was a joke. That softens my rage, but I still disdain feminism.\n> \n> I was about to counter that it still qualified as a rant, but then I realized that debating about whether a statement counts as a rant or not is a complete waste of time.\n\n \n\n \n\nYou're a piece of sh!t dude, hope that helps. Please don't breed, think, vote or interact with civilized society you garbage human."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721602","commentId":1721602,"userName":"Dain Ironfoot","timestamp":1438794956,"content":"> And I bet most people agree with me. They just don't have the guts to stand up to feminist bullies and politically correct thought police.\n\nnope, i don't agree.\n\n \n\nand i'd argue you don't know what feminism truly means, but rather, operate under a warped, cartoonish, sensationalized definition of the term.  but this is hardly the time nor place to discuss such a thing. \n\nEdited August 5, 2015 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721614","commentId":1721614,"userName":"bubblepopmei","timestamp":1438795335,"content":"I marvel at how classy most of you are here. Straight up serious. So awesome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721654","commentId":1721654,"userName":"DukeWellington","timestamp":1438796744,"content":"I debate feminists all the time and I love it. They always ALWAYS say \"you don't know what feminism is\". They soon start attacking me personally and calling me names. Feminism is an evil sick ideology that conditions people to hate men and hate reason. You have no arguments or evidence. All you can do is belittle and bully those who disagree. Feminism destroys families, pits men and women against each other, and generally makes a mockery of the traditions and morality that made society function and improve for thousands of years. You know nothing about me. All you know is that I spoke blasphemy against your religion and you must punish the heretic. You prove my point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721685","commentId":1721685,"userName":"John Constantine","timestamp":1438797480,"content":"Feminism in it's true form is an extremely good initiative which I fully support. Nowday's feminism is usually a twisted and corrupted entity that has nothing in common with it's true self, unfortunately. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721712","commentId":1721712,"userName":"DukeWellington","timestamp":1438798336,"content":"So, I do genuinely love to discuss and debate feminism, probably more than playing LOTR. However, it is true that this is not the place for that, so, out of respect for the forum I will control myself and refrain from any further comment on the topic. If anybody really wants to engage me they can do so with a PM.\n\nFinal note, I despise feminism, not women. It's important to understand the difference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721742","commentId":1721742,"userName":"PocketWraith","timestamp":1438799009,"content":"> Final note, I despise feminism, not women. It's important to understand the difference.\n\nIt's far more important to understand the difference between despising inequality and despising men, but apparently you haven't grasped that one, so I don't really see why you should expect people to respect your distinction if you don't respect theirs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721775","commentId":1721775,"userName":"banania","timestamp":1438799851,"content":"> I debate feminists all the time and I love it. They always ALWAYS say \"you don't know what feminism is\". They soon start attacking me personally and calling me names. Feminism is an evil sick ideology that conditions people to hate men and hate reason. You have no arguments or evidence. All you can do is belittle and bully those who disagree. Feminism destroys families, pits men and women against each other, and generally makes a mockery of the traditions and morality that made society function and improve for thousands of years. You know nothing about me. All you know is that I spoke blasphemy against your religion and you must punish the heretic. You prove my point.\n\n\"Feminism destroys families\"\n\nDude."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721777","commentId":1721777,"userName":"John Constantine","timestamp":1438799972,"content":"I think this topic is a huge misunderstanding."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721889","commentId":1721889,"userName":"Olorin93","timestamp":1438803066,"content":"Yeah, I think I'm staying out of this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721894","commentId":1721894,"userName":"Raven1015","timestamp":1438803301,"content":"25C_Red_Alert_LCARS_by_Friedebarth.png [http://th03.deviantart.net/fs44/PRE/f/2009/114/5/a/25C_Red_Alert_LCARS_by_Friedebarth.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1721995","commentId":1721995,"userName":"jnicol","timestamp":1438806977,"content":"> And I bet most people agree with me. They just don't have the guts to stand up to feminist bullies and politically correct thought police.\n\nI do not agree with you even slightly.\n\nSome incredibly ugly and hateful things have been said in this thread. Until now I have found the LOTR LCG community be tolerant and welcoming, and I would hate for that to change."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184176-tauriel/?do=findComment&comment=1722085","commentId":1722085,"userName":"FFGEvan","timestamp":1438810303,"content":"Hello The Lord of the Rings LCG community-\n\n \n\nThis thread has been locked because it has devolved into arguments and personal attacks. Please remember that this community is meant to discuss The Lord of the Rings: The Card Game, and keep your conversations civil and understanding. Feel free to continue beneficial discussion in other threads.\n\n \n\nThanks, and keep playing,\n\nFFG Forum Moderator"}]}