{"url":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/","title":"My first win!! My first experience.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1720950","commentId":1720950,"userName":"Emberhair","timestamp":1438762771,"content":"Gosh I'm terrible.\n\nFirst scenario, core set, passage through mirkwood i think. \"One of the easiest scenarios\" I've heard people say.\n\nBut hold! That did not stop me from barely winning by the skin of my teeth with one dead hero (Boromir) and 49 threat at the end! (Close call huh?)\n\nI was trying a Gondor themed deck with Beregond (Tactics) and Boromir and Aragorn (Leadership). They had 32 starting threat... not ideal. My goal was essentially to buff Beregond as my defender with attachments while Aragorn and Boromir built up Gondor allies. Beregond can reduce the cost of attachments on himself. Boromir gives all Gondor allies a passive attack bonus. I also used steward of gondor on aragorn so he obtained the gondor trait and got an attack buff too. At least.... that was the plan.\n\nBoromir got that annoying condition web attachment instantly so that gimped me for the whole scenario. Aragorn kept having to pay a resource to uptap himself because Boromir was down. Beregond was defending like a boss despite not getting ONE attachment turn up in my deck the entire scenario. I got some nice event cards in my hand, but they all got discarded by a treatchery. I had less than 3 cards in my hand for a lot of the scenario.\n\nSlowly chipping away at the quest progress while Beregond essentially tanked every fight with no enemy kills, I met the engagement check with Hummerhorns, meaning i had to place 5 dmg on a hero. Boromir died caught in that web. Looks like Sean Bean can't even survive the LOTR LCG.\n\nNo attachments, 1 dead hero, barely any resources or cards i could afford; things were looking bleak. I got to the last quest to kill Ungoliant's Spawn. Beregond, once again, defended like a true boss while aragorn and some low dmg allies wailed on him. I won the game just in time.\n\nAll in all, I can't decide whether I am as terrible as I think I am. Part of me thinks I just had terrible luck. Also the Lore deck could have saved me a lot of hurt.\n\nBut there we go. My first adventure, my first pitiful win. Sean Bean is still dead.\n\nEdited August 6, 2015 by Emberhair"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721381","commentId":1721381,"userName":"Raven1015","timestamp":1438788000,"content":"Don't worry about it. You're not terrible, you're just new to the game. It takes a bit of time to get used to the flow of the game, the decisions that are required, etc. Congrats on the win...and get used to dead heroes!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721459","commentId":1721459,"userName":"legolas18","timestamp":1438790493,"content":"Awesome.  These stories are what makes the game amazing! Journey down the Anduin next! At least you won't have spiders...  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721642","commentId":1721642,"userName":"ppsantos","timestamp":1438796297,"content":"Wait, you have Beregond and Boromir as heroes? So you have Heirs of Numenor.  Intriguing decision here to get HoN as well.  Good luck with the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721731","commentId":1721731,"userName":"alexbobspoons","timestamp":1438798819,"content":"Good win and welcone.\n\nDont worry, the game has a learning curve that progresses well you will be fine after practice and dead heroes :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEnjoy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721780","commentId":1721780,"userName":"banania","timestamp":1438800072,"content":"Welcome to the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721875","commentId":1721875,"userName":"Olorin93","timestamp":1438802657,"content":"Hey, welcome to the game! It's always rough at first, before you really get into the strategy and scenarios.\n\nA few things to remember is that Beregond only lowers the cost for attachments played on himself (so Steward of Gondor would be attached for free on him but not on anyone else) and that Boromir's Attack boost only applies to allies - so Aragorn wouldn't get it, even with the Gondor trait.\n\nLooking forward to your next report!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1721917","commentId":1721917,"userName":"sappidus","timestamp":1438804166,"content":"Don't forget, Beregond's discount applies only to Weapons or Armor played on himself, so Olorin93's example of Steward of Gondor is actually incorrect. (As if Steward of Gondor needed even more help! ;-) ) Perhaps you meant Gondorian Shield?\n\nEdited August 5, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722115","commentId":1722115,"userName":"jnicol","timestamp":1438811399,"content":"Hey at least you won your first game! I'm fairly sure I didn't, and I've never found Passage Through Mirkwood to be the cakewalk that other players describe.\n\nIt is bold to construct a deck from non-core set cards for your first game. Most people start by playing one of the mono-sphere \"decks\" from the core set. But it sounds like you already have a good understanding of the strengths and weaknesses of the different spheres and card synergies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722295","commentId":1722295,"userName":"PsychoRocka","timestamp":1438819873,"content":"Hahahaha love the Sean Bean lines. Sounds like you had some pretty epicly bad luck getting the nasty condition attachment first turn and losing all your events to the treachery that discards them all (can't recall its name? Eyes in the Forest?). Congrats on the win despite all this and welcome to the game! I too had heirs of numenor very early on (bought it mainly for Beregond did you do the same? =P) and racked up countless losses against the quests in that box as I had only core and HoN. I definitely do not suggest attempting wins against the HoN quests until you have expanded your player cards a fair bit as it is more or less the hardest deluxe box to date. \n\nI used to run fairly high starting threat decks as well but eventually moved away from that and now keep my decks under 30 starting threat. Maybe try out replacing Aragorn with someone like Theodred and seeing how that goes.\n\nAlso kudos on making your own decks from the get go. I actually did the same and skipped the premade decks. I come from a MTG background so was excited to deck build and wanted to try out two sphere decks straight away. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722619","commentId":1722619,"userName":"Olorin93","timestamp":1438837718,"content":"> Don't forget, Beregond's discount applies only to Weapons or Armor played on himself, so Olorin93's example of Steward of Gondor is actually incorrect. (As if Steward of Gondor needed even more help! ;-) ) Perhaps you meant Gondorian Shield?\n\nSorry, that's right. It's even more restricted than I thought. I got the impression Emberhair lowered the cost of all attachments just because Beregond was in play, but maybe I misunderstood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722768","commentId":1722768,"userName":"Emberhair","timestamp":1438848968,"content":"Thanks for all the feedback guys! Its really helpful. I'm definitely still learning because i found a lot of \"what if?\" moments happen when i was unsure how certain mechanics operated.\n\nFor example, Boromir had the web attachment so he remained tapped unless i paid 2 resources. First thing i was unsure about was whether that paying the 2 resources discards the attachment or just untaps boromir for that round. I decided the web attachent was permanant even after i paid the 2 resources and he would become tapped again at the end of the round. It just seemed more thematically appropriate considering its Mirkwood and there are cobwebs everywhere.\n\nFurthermore, i attached \"Cram\" to Boromir so if i discarded cram, i can ready him. But I was unsure if that was allowed. Which card's effect would take priority; cram or the web attachment? I decided that since cram was one use and the web attachment was permanent, I'd throw myself a bone and allow Boromir to ready by discarding cram instead of paying two resources for that round only. After that round finished I tapped Boromir again. I have no idea to this day whether that was even allowed.\n\nI seemed to find a lot of little things like that happen throughout the game unfortunately. Could be because I'm just new. Would explain why I got the steward of gondor thing confused too. I knew beregond's discount only works on him. But boromirs card reads \"allies\" which I suppose I didnt take literally enough haha. I know now that Aragorn can no longer have the attachment. Thanks for clearing that up.\n\nOh and btw, the reason I have all these cards is because I'm more of a collector than a knowledgeable gamer at lotr lcg haha. I have them all... to look at... :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] BUT I PLAY NOW. PLEASE LIKE ME GAIz\n\nAlso, yes. I did buy HoN for Beregond. How could anyone not?? He looks like such a badass!\n\nEdited August 6, 2015 by Emberhair"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722822","commentId":1722822,"userName":"jnicol","timestamp":1438851433,"content":"> For example, Boromir had the web attachment so he remained tapped unless i paid 2 resources. First thing i was unsure about was whether that paying the 2 resources discards the attachment or just untaps boromir for that round. I decided the web attachent was permanant even after i paid the 2 resources and he would become tapped again at the end of the round.\n\n \n\nYou did it correctly. Caught in a Web remains attached until a card effect removes it. Miner of the Iron Hills is perfect for this.\n\n \n\nYou can still use Cram or any other readying effect while a hero is Caught in a Web. The only thing you are not allowed to do is ready your hero during the refresh phase, when they would normally be refreshed automatically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1722840","commentId":1722840,"userName":"Emberhair","timestamp":1438852372,"content":"Oh that makes much more sense to me now! So its only the refresh readying of the hero thats cancelled. Its cool I did the right thing but much better that I actually understand why it works like that. Thanks for that jnicol!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184206-my-first-win-my-first-experience/?do=findComment&comment=1723317","commentId":1723317,"userName":"PocketWraith","timestamp":1438874878,"content":"Actually it sounds like you possibly made things even harder for yourself, because you said you tapped Boromir again at the end of the round - Caught in a Web doesn't force you to exhaust the hero at the end of the round, it only stops them readying in the Refresh phase - he should only have been exhausted if you exhausted him earlier in the round to do something (quest/attack/defend most likely)."}]}