{"url":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/","title":"Interview with Caleb Grace from Gen Con","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1722587","commentId":1722587,"userName":"Raven1015","timestamp":1438835724,"content":"We were able to sit down with Caleb at Gen Con for what was a very enlightening and entertaining interview! Enjoy!\n\n \n\nhttp://greycompanypodcast.com/2015/08/06/28-caleb-grace-gencon-2015/ [http://greycompanypodcast.com/2015/08/06/28-caleb-grace-gencon-2015/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1723379","commentId":1723379,"userName":"Rob_Oz","timestamp":1438876751,"content":"Had a chance to listen to the interview last night and enjoyed it. A great deal of ground was covered but I was particularly interested when discussion touched upon the movies. It seemed fairly evident that Caleb (and the Grey Company folks) are not huge fans of the movies. While I do enjoy the movies to a certain extent, I found this commentary reassuring, as it tells me that the designers draw from Tolkien's written material for their work and not the movies. To me, that is as it should be.\n\n \n\nI also enjoyed hearing about the design approach to some of the scenarios, such as Belegost but also The Three Trials which I (and most of the community) really enjoy. Great work on The Three Trials, Matt Newman! And yes, Caleb, Wastes of Eriador is quite enjoyable, so rest assured that you did contribute good stuff to the Angmar Awakened cycle.\n\n \n\nScorpagorn, yeah thanks for that guys. Now I'll have to work to expunge that from my head like other nicknames such as Splorfindel, Loragorn, etc. And I'll have to resist the urge to call out \"get over here\" when my friend uses his Tactics Aragorn deck this weekend. Great, just great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1723427","commentId":1723427,"userName":"Olorin93","timestamp":1438878105,"content":"The Caleb Grace! Thanks for linking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1723692","commentId":1723692,"userName":"Gizlivadi","timestamp":1438886032,"content":"It's always great to listen to another interview with Caleb or Matt. Some ground was already covered before\n\nlike someone else said but I loved Caleb's insight on the heroes of the new saga box and the Gencon quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1723723","commentId":1723723,"userName":"l3afonthewind","timestamp":1438887314,"content":"> And I'll have to resist the urge to call out \"get over here\" when my friend uses his Tactics Aragorn deck this weekend. Great, just great.\n\n \n\nCan confirm. Resistance is futile. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184304-interview-with-caleb-grace-from-gen-con/?do=findComment&comment=1724268","commentId":1724268,"userName":"soullos","timestamp":1438907431,"content":"Great interview. Hearing Caleb's design process, inspiration, even some design mistakes, and insight behind the scenes is fascinating. That GenCon quest sounds like so much fun too. Challenging and high replayability in a good ol' dungeon crawl? Sign me up! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] One question should've been asked; \"when will the GenCon quest be available for POD?\" ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}