{"url":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/","title":"Weekly Deck Challenges","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723503","commentId":1723503,"userName":"legolas18","timestamp":1438880743,"content":"CURRENT QUEST\n\nInto Ithilien\n\nCHALLENGE\n\nDo not use Leadership or Tactics cards in your decks             (or as heroes)\n\n \n\nRULES\n\nFreestyle: Beat the quest with no hero/deck restrictions. This is if you just want to play the scenario for fun and not have to worry about doing challenges you may or may not be able to accomplish. \n\nChallenge: Beat the quest within the parameters of the challenge.  This is if you'd like to push yourself and your deck building capabilities to accomplish harder things. \n\n \n\nFor this challenge, you can use any amount of players/decks, but none may have Leadership or Tactics cards in their decks or as heroes.\n\nYou may play in Easy, Normal, or Nightmare mode.\n\nIf you'd like to participate, just post your story after you're done! \n\n \n\nPast challenges:\n\nAugust 2015 #1 - Beat Conflict at the Carrock with a Hobbit deck \n__________________________________________________________________________________\n\n \n\nHey all.  I thought it might be fun if I (or somebody else) proposed a deck-building challenge every week, just to keep things fresh.  \n\n \n\nSo for the next week coming up, I had the idea to challenge everyone to make a deck featuring Brand son of Bain as the prominent hero. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  You can build more than one deck if you prefer playing two-handed (like I do), and that would allow you to more easily make his mechanic work.  Also, you have to beat a scenario with the deck(s), although I'm not sure yet if the scenario will also be specific to the week's challenge or not.\n\n \n\nSome other ideas I had for weekly challenges included a Gandalf secrecy deck, a couple of Dwarves and Ents alliance decks, and possibly a Grima Doomed deck.\n\n \n\nWhat do you think? Would it be fun?\n\nAlso, I'm sure others will have more creative ideas than mine, so feel free to post your ideas for deck challenges.  \n\nEdited August 16, 2015 by legolas18"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723533","commentId":1723533,"userName":"Raven1015","timestamp":1438881725,"content":"Good idea. For awhile, there was a challenge thread on BGG where people could challenge each other to certain specific tasks, like beating Redhorn Gate with a mono-Tactics deck or defeating Siege of Cair Andros with all Hobbit heroes. Those kinds of specific challenges can be pretty entertaining so maybe something along those lines could work, but maybe just as a weekly challenge for everyone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723647","commentId":1723647,"userName":"Teamjimby","timestamp":1438884651,"content":"I like the idea and I really enjoyed that BGG challenge.  Unfortunately that thread died out, and I think it's because it burned too hot, too quickly.  So I wonder if a weekly challenge is too frequent.  In a given week I am lucky if I can find time to make a new deck and test it out.  Especially if we are talking about using sub-optimal decks that will require multiple attempts and tweaks.  If I had a month, that would be more doable. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723755","commentId":1723755,"userName":"legolas18","timestamp":1438888618,"content":"Monthly would also work.  Anyone have different suggestions as to what the challenge could be??? I want the challenge to be fun, not frustrating, so hopefully the challenges will be doable.  I for one have a very difficult time beating a large majority of the quests without powerful decks for some reason, so I don't think a challenge like \"beat Lake Town with heroes of all threat 8 or under\" would be very fun, simply because I know I wouldn't be able to do it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723804","commentId":1723804,"userName":"cmabr002","timestamp":1438890109,"content":"I think this sounds like a fun idea that I could get into once I finish all the current scenarios.  I think I am fairly weak at deck building in that I can only build one type of deck.  Anything else becomes difficult for me to build so this challenge would probably strengthen my deck building skills and force me to use cards that I may be overlooking due to my preferences."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723823","commentId":1723823,"userName":"PocketWraith","timestamp":1438890650,"content":"> \"beat Lake Town with heroes of all threat 8 or under\"\n\nI'm tempted to try this now...\n\n \n\nI don't have specific ideas for challenges off the top of my head, but I think more specific like the above is the way to go. Restrict our options to force us to be creative about it.\n\n \n\nI also agree that monthly would be better than weekly. If this takes off I might well try and do all the challenges and post about them on Warden of Arnor, but I only have so much time and like to do other posts as well, so weekly would be a stretch and it'd be more likely I'd just cherry pick the challenges I particularly liked/found interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1723824","commentId":1723824,"userName":"Teamjimby","timestamp":1438890731,"content":"I've always had an idea of awarding a score based on the heroes you choose.  Like you would get 1 point if you used Glorfindel but 5 points if you used Fatty.  It could also penalize cards like Steward of Gondor and reward Keen-Eyed Took.  The advantage with this system is it allows newer/weaker players to build strong decks to beat the quest, but challenges experienced players to build sub-optimal decks to get the highest score.  The disadvantage of course is that you need to assign arbitrary scores/ranks to every hero, if not every card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1724236","commentId":1724236,"userName":"alexbobspoons","timestamp":1438905601,"content":"Though i wouldn't have the time or skill to take part myself, i think this whole idea is awesome and would really enjoy reading reports and following the challenge thread.\n\nI really hope you go through with it, it will be great :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1724473","commentId":1724473,"userName":"PsychoRocka","timestamp":1438920227,"content":"I tried to run something similar but more based on achieving specific things in particular quests more so than deck building challenges. People showed interest but it didn't really go anywhere =(  I had fun for the first few weeks attempting the challenges myself though...\n\nI hope if you do start this people are a bit more responsive and participate. I don't really deck build outside my two decks I always use so will unfortunately have to sit this one out though. Will definitely be following and reading up on the challenged though =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1725484","commentId":1725484,"userName":"Khamul The Easterling","timestamp":1438969534,"content":"Haha yeah, remember back in the day when Leptokurt held those fun Mono sphere challenge/competitions? Those were the days;)\n\nEdited August 7, 2015 by Khamul The Easterling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1725675","commentId":1725675,"userName":"legolas18","timestamp":1438974897,"content":"Alright. So then how do you guys want to do this? Do you want me to just say a challenge? Or would you guys like to vote on challenges?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1725855","commentId":1725855,"userName":"SauronTheGreat","timestamp":1438979149,"content":"we could all give input and then trust you to choose what people seem to like best.  And if your able, it might be better if we could do biweekly.  It would suck to wait a month to build and show of a cool deck and then not be able to do it for different reasons.  No one would have to do it every week; some could do it once a month or whatever they wanted.  it would be totally a personal choose how much you want to do it.   another good thing would be that you could choose which ones you wanted to prioritize.  if you hated the idea of one thing everyone had decided you wouldn't have to wait an entire week for the next go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1725874","commentId":1725874,"userName":"John Constantine","timestamp":1438979697,"content":"I would like to participate in something like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727057","commentId":1727057,"userName":"legolas18","timestamp":1439064542,"content":"Okay. Well one more question.  There are certain challenges that I think would be extremely fun and challenging that some people would be opposed to doing. For example, if I gave the challenge, \"Beat Foundations of Stone with four players, each with a mono-sphere deck,\" then how many of you guys would NOT do it, because you guys are more inclined to doing solo play/don't want to go to all that work?  I don't want to give a challenge that people won't do, and yet that seems like it would be very interesting.\n\n \n\nEDIT: I just wanted to clarify that I didn't mean to sound rude in that post. Rereading it made me realize that it may have sounded a bit... condemning? Sorry if it did. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited August 8, 2015 by legolas18"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727063","commentId":1727063,"userName":"gandalfDK","timestamp":1439065001,"content":"Many players here are solo, don't have a huge playgroup, etc. so multiplayer challenges are quite hard to realise I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727148","commentId":1727148,"userName":"SauronTheGreat","timestamp":1439069560,"content":"I might be able to access 4 players... winning on the other hand would be... interesting.  not done to much mono sphere... might be fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727182","commentId":1727182,"userName":"legolas18","timestamp":1439071432,"content":"I usually play either two-handed solo or two-player, but I don't think it would be too hard to do four player solo.  But really though, if you guys think that multiplayer challenges would be too much work or too stressful to keep track of everything, I'll just cross them off the future list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727250","commentId":1727250,"userName":"PocketWraith","timestamp":1439075580,"content":"Four handed play is a pretty big faff, though I've done it once or twice, so I'd consider it for an interesting challenge. Personally I play 3 player pretty frequently so that'd be OK for me, but I guess other people maybe not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1727300","commentId":1727300,"userName":"Teamjimby","timestamp":1439078566,"content":"I think these types of challenges are best suited for 1 or 2 player.  3 or 4 player games take a long time, so I don't know if I'd want to \"sacrifice\" my limited 3/4 player time to attempt a crazy challenge that could take multiple tries. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1728275","commentId":1728275,"userName":"legolas18","timestamp":1439155670,"content":"Kay, good to know.  \n\nHere's another idea for a challenge...\n\nUse the \"Big Three,\" as I like to call them (Eowyn, Beregond, and Beorn), to beat Shadow and Flame.  \n\nThe scenario is of course changeable.  But now I really need input from you guys.  Is there a particular challenge that has already been mentioned that you'd like me to set as the challenge of the month (or biweekly, depending on how it plays out)?\n\nOr is there one that you'd like to suggest? I think I'll put the current challenge in my first post once we get a majority wiling to do it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1728287","commentId":1728287,"userName":"alexbobspoons","timestamp":1439156510,"content":"How about:\n\nBeat passage through mirkwood with tactics mono using MINIMUM additional APs of progression style. Can you do it with just core? Core plus hunt/gollum? Etc..\n\nJust a thought, not much deckbuild scope.\n\nEdit: also, deck designs composed COMPLETELY of allies would be fun. What an army. Trying to get ally abilities to mimic non-ally cards :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited August 9, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1728322","commentId":1728322,"userName":"DukeWellington","timestamp":1439158848,"content":"So, I love the idea. I just want to throw out my preference. I think the challenges work best if they are 1/2 player and if they focus on building a deck for a specific quest or to achieve a specific goal (like beating a quest in 3 or fewer turns). I think the shadow and flame suggestion is a good one. I have always wanted to experiment with high threat heroes against that quest since you drop to 0 anyway (like Gandalf, Elrond, and Treebeard)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729038","commentId":1729038,"userName":"Dwarf king Bronze beard","timestamp":1439214862,"content":"> Edit: also, deck designs composed COMPLETELY of allies would be fun. \n\nI made a deck like that once and it worked really well if i remeber correctly.\n\n \n\nAnd for the challenges i would really like to do them, but i don't have all cards, not a 3-4 player game possiblities nor all quests so i can't do all challenges.\n\n \n\nOne challenge might be to build deck around some cards like hidden cache, Caldara or Zigil miner (i have actually done all of those in the 2-player decks) or another one (not so deck building challenge) would be to hunt down one really bad enemy in some quest like Mumak or Attercop."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729047","commentId":1729047,"userName":"John Constantine","timestamp":1439215189,"content":"> How about:\n> \n> Beat passage through mirkwood with tactics mono using MINIMUM additional APs of progression style. Can you do it with just core? Core plus hunt/gollum? Etc..\n> \n> Just a thought, not much deckbuild scope.\n\nSorry, but I just don't see how this is a deck challenge. I might be wrong, but I'll assume that most of the players have just 1 core set, and this is called a \"deck challenge\", but in the core set there is not enough cards to build even a single monotactics deck. Now, core + first cycle pool would be fun. Going back to our roots, you know.\n\nEdited August 10, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729437","commentId":1729437,"userName":"legolas18","timestamp":1439229249,"content":"http://www.boardgamegeek.com/article/18770081#18770081 [http://www.boardgamegeek.com/article/18770081#18770081]\n\n \n\nIs this the thread on BGG that you guys were talking about? Because either way, there's some good idea's on this thread that I think I'm going to.... Borrow.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]    Unfortunately, we don't have a currency system on the FFG forums that we can use to give rewards, but that's okay. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729548","commentId":1729548,"userName":"John Constantine","timestamp":1439232233,"content":"Elaborating on the initial idea of core monotactics, how about a deck with 2 tactics heroes and 1 hero of any other sphere (or none at all, bonus points for that :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png])? Like, at least 30 cards of that deck must be tactics. \n\n \n\nSome additional ideas: no allies, only unique allies. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729556","commentId":1729556,"userName":"sappidus","timestamp":1439232622,"content":"Just to throw another idea out there... On a whim the other day I made a mono-Leadership Highlander deck -- each card was a 1-of -- and trounced Passage to Mirkwood. But perhaps there's some more trying version of the challenge behind an all-1-ofs deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729583","commentId":1729583,"userName":"Teamjimby","timestamp":1439233502,"content":"The ideas don't have to be too crazy either.  I like the challenges that forced me to use unconventional heroes.  So something as simple as defeat quest X using spirit Pippin or Fatty or Lorefindel can be a fun challenge that forces you outside your comfort zone.  Or maybe defeat a certain quest where you start the game at +10 or 15 threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729719","commentId":1729719,"userName":"Noccus","timestamp":1439238191,"content":"The rules could be kept simple to start with, to see how it goes.\n\n \n\nHow about: beat the watcher in the water without scying? (NM mode requires too much luck and not skill with the doors of durin imo)\n\n \n\nThe player who used fewest turns used wins?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729735","commentId":1729735,"userName":"legolas18","timestamp":1439238799,"content":"OFFICIAL ANNOUNCEMENT\n\n \n\nHa. I just like saying that.\n\nBut really. Here's what I'm thinking. For this month / two weeks / time period until I feel like we need a change, the quest is going to be Conflict at the Carrock. Just for starters.\n\n \n\nHere's my proposed system:\n\nFreestyle: Beat the quest with no hero/deck restrictions. This is if you just want to play the scenario for fun and not have to worry about doing challenges you may or may not be able to accomplish. \n\nChallenge: Beat the quest within the parameters of the challenge.  This is if you'd like to push yourself and your deck building capabilities to accomplish harder things. \n\nThere will be a Deck Challenge associated with the current Quest Challenge. For this Quest, it will be to use a Hobbit Deck (i.e. A deck composed of three Hobbit heroes). \n\n \n\nWe don't necessarily have to have a point system. If you guys really want to, I was thinking something simple like 1 point for beating it on Freestyle and 2 points for beating it on Challenge. We can also add a bonus point(s) to the player who beat the quest with the lowest score, according to the regular scoring of the game.\n\n \n\nThoughts? Concerns? Complaints?\n\nThis doesn't have to be set in stone, but for now, we need something to get it started."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729807","commentId":1729807,"userName":"entMoot","timestamp":1439242372,"content":"I'm in. Going against the trolls is always fun. Should have a chance to take it on by the end of the week.\n\n \n\nGood call on just setting a challenge. Like you said, best to kick things off and tweak from here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729963","commentId":1729963,"userName":"John Constantine","timestamp":1439248865,"content":"Conflict at Carrock, 3 Hobbits, got it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729977","commentId":1729977,"userName":"alexbobspoons","timestamp":1439249608,"content":"> > How about:\n> > \n> > Beat passage through mirkwood with tactics mono using MINIMUM additional APs of progression style. Can you do it with just core? Core plus hunt/gollum? Etc..\n> > \n> > Just a thought, not much deckbuild scope.\n> \n> Sorry, but I just don't see how this is a deck challenge. I might be wrong, but I'll assume that most of the players have just 1 core set, and this is called a \"deck challenge\", but in the core set there is not enough cards to build even a single monotactics deck. Now, core + first cycle pool would be fun. Going back to our roots, you know.\n\nBut that was kind-of what i was going for, as most people think core-mono-tactics is impossible, so the challenge was how few aps does it take to \"be\" possible. Can you do it with core+hunt/gollum? Or can you do it with core+hunt/gollum+carrock? Etc etc\n\nSimply hitting the 50 card point isnt likely to give a workable deck, so at what point does the tactics card pool become viable enough?\n\nI one sense it may be less aboit deck building and more about card playing synergy... so would it be more a deck challenge to say you can have (for example) core plus any-three APs from the full collection?\n\nAnyways, as the current challenge is now set, i fear my ramblings detract and get in the way of that somewhat so ill go quiet and say best of luck contestants :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1729992","commentId":1729992,"userName":"legolas18","timestamp":1439250295,"content":"Different challenges will come! Not all of them will be like this. So, alexbobspoons, and anybody else, if you have more challenge ideas then keep them coming! \n\nI think for future challenges we can have others \"vote\" for their favorite. So any challenges that you see that you'd like to have set as the official challenge, give the post a \"like.\" The more likes a challenge has, the more I know that people want to do it.\n\n \n\nP.S.\n\nAlso keep in mind that this is all just for fun and to give the LOTR LCG community something to do while waiting for more expansions. I don't really think we'll have any \"winners.\"  This is just to help keep the game and community alive and well.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1730528","commentId":1730528,"userName":"koriakin97","timestamp":1439286720,"content":"I used to build a decks with one hero and no allies. That was playable only on easy level, but still fun"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1730654","commentId":1730654,"userName":"Dwarf king Bronze beard","timestamp":1439295941,"content":"That troll challenge sounds fun but since i dont have the black riders pack this is going to be really hard.\n\n \n\nChallenge: Conflict at the Carrock\n\n \n\nHeroes: Pippin, Merry, Frodo Baggins\n\nThreat: 21\n\nRounds:11!\n\nVictory points: 3\n\nScore: 129\n\n \n\nGame shortly: Used Zigil miners to get resources, killed the trolls one by one mainly by using Gandalfs, treebeard and Beorn (used stand and fight to get him). Pretty easy but slow game. Actually i'm going to try to do better score and switch all Elbereth cards to something more usefull.\n\nEdited August 11, 2015 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1731394","commentId":1731394,"userName":"legolas18","timestamp":1439319892,"content":"WOW. Really?!  That's awesome!  I really did not expect scores to be that low. I don't think I'd be able to do it at all! \n\nWell good job sir. Very well done, and thank you for posting your story!\n\nAlso, sorry that you didn't have Black Riders. Some challenges won't be able to include everybody, unfortunately, but you seemed to do it just fine without it!\n\nEdited August 11, 2015 by legolas18"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1731688","commentId":1731688,"userName":"alexbobspoons","timestamp":1439329200,"content":"I really am too busy playing catch-up on standard quests but gosh this really is an awesome idea to be involved in, long may it continue!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732031","commentId":1732031,"userName":"Teamjimby","timestamp":1439346944,"content":"Beat the challenge on my first try using my \"Big Ally\" Sam/Pippin/Glorfindel secrecy deck [https://community.fantasyflightgames.com/topic/134482-ally-heavy-tri-sphere-secrecy/], except with Merry instead of Glorfindel.  Two sacks came out, but I cancelled them both with Test of Will.  I spent a few turns ramping up, but then I was slowed by the fact that I could only engage one troll per round and I happened to draw an extra hill troll to add another round.  At the end of the game I had 13 allies, including 8 that cost 4 or more.\n\n9 completed rounds = 90\nTotal combined Threat = 19\nTotal damage on Heroes = 2\nCost of dead Heroes = 0\nVictory points = 4\nTOTAL SCORE = 107\n\n \n\nEdit: I accidentally cheated by cancelling sacks.  I don't think it would have changed the game much because roasted slowly never appeared and my heroes didn't do a whole lot, but my score probably would have been higher.\n\nEdited August 12, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732083","commentId":1732083,"userName":"Teamjimby","timestamp":1439350054,"content":"And just for fun I played it again using Merry (T), Frodo, and Pippin in a deck with no non-Hobbit allies.  So Farmer Maggot, Wandering Took, Bilbo, and a bunch of events and attachments.  I got lucky enough to recruit Grimbeorn fairly early and some Peace and Thought combined with Hobbit Pipes let me draw half of my deck.  Feinted the first two trolls, and Grimbeorn defended the next two.  Merry (dual wielding daggers), Farmer Maggot, and Grimbeorn were able to take them out in one attack.\n\n11 completed rounds = 110\nTotal combined Threat = 20\nTotal damage on Heroes = 0\nCost of dead Heroes = 0\nVictory points = 0\nTOTAL SCORE = 130"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732110","commentId":1732110,"userName":"Ecthelion III","timestamp":1439351685,"content":"> Beat the challenge on my first try using my \"Big Ally\" Sam/Pippin/Glorfindel secrecy deck [https://community.fantasyflightgames.com/topic/134482-ally-heavy-tri-sphere-secrecy/], except with Merry instead of Glorfindel.  Two sacks came out, but I cancelled them both with Test of Will.  I spent a few turns ramping up, but then I was slowed by the fact that I could only engage one troll per round and I happened to draw an extra hill troll to add another round.  At the end of the game I had 13 allies, including 8 that cost 4 or more.\n> \n> 9 completed rounds = 90\n> \n> Total combined Threat = 19\n> \n> Total damage on Heroes = 2\n> \n> Cost of dead Heroes = 0\n> \n> Victory points = 4\n> \n> TOTAL SCORE = 107\n\nSacks cannot be canceled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732119","commentId":1732119,"userName":"legolas18","timestamp":1439352456,"content":"Thanks for the reports Teamjimby! That's awesome.  It seems that our challenge so far has proven that trolls are no match for a group of angry Hobbits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732161","commentId":1732161,"userName":"Teamjimby","timestamp":1439355284,"content":"> Sacks cannot be canceled.\n> \n>  \n\nYou're right!  I always look at the end of the text box to check for \"cannot be cancelled\", but they snuck that one into the middle of the text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732730","commentId":1732730,"userName":"Raven1015","timestamp":1439390537,"content":"I used Tactics Merry/Lore Pippin/Sam to win with a final score of 140. The stupid shadow effect that removes progress from the quest stage prolonged the game for one round, so it really could have been 130, and using OHaUH Gandalf and his threat increases definitely upped the score as well. I'm interested in trying again to see if I can play more efficiently. \n\n \n\nShort summary: Treebeard, OHaUH Gandalf, Gildor hit the board early. When combined with a couple of Sneak Attacks and Beorn, the trolls were a cakewalk.\n\n \n\nThis deck almost feels like cheating, so it would be interesting to try on a more sneaky variety of Hobbit deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732822","commentId":1732822,"userName":"legolas18","timestamp":1439393006,"content":"Definitely. Maybe a Spirit Merry, Spirit Pippin, Fatty deck? It would be interesting, if nothing else.\n\nAnd a suggestion: To those who played this and felt you beat it rather easily, do you think playing two-handed would change that at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732863","commentId":1732863,"userName":"John Constantine","timestamp":1439393937,"content":"Just finished a game with 122 total score. Some Sam, Pippin and Bilbo goodness going on, Bilbo being an ultimate defender with a lot of warnings, hitches and a brand, Sam and Pippin ruthlessly questing while raising the Ent power behind to strike down da Trolls :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1732886","commentId":1732886,"userName":"Raven1015","timestamp":1439394589,"content":"> Definitely. Maybe a Spirit Merry, Spirit Pippin, Fatty deck? It would be interesting, if nothing else.\n> \n> And a suggestion: To those who played this and felt you beat it rather easily, do you think playing two-handed would change that at all?\n\n \n\nHmm, not sure. For this particular quest, two-handed would probably make it even easier. I'm going to try the super-squishy all Spirit Hobbit team and see how that goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733285","commentId":1733285,"userName":"legolas18","timestamp":1439408465,"content":"Alright. \n\nJust tried the quest of Freestyle, using two Dunedain decks. It went horribly. It seems that by assigning a challenge that I thought would be challenging, I in fact assigned a challenge that it is actually a pretty good strategy against the quest.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nRather unexpected. haha.\n\nI hope for the next \"challenge\" to be more challenging.\n\nEdited August 12, 2015 by legolas18"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733311","commentId":1733311,"userName":"Dwarf king Bronze beard","timestamp":1439409312,"content":"As so far the scores has been really close together. I had 129 and Teamjimby had only one score more than i had (hehee i beated you  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] ) and the number one is now John Constantine with points of 122 so very narrow difference.\n\n \n\nAlso how long this challenge continues? I would like to start new one soon  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733419","commentId":1733419,"userName":"Teamjimby","timestamp":1439412787,"content":"> Alright. \n> \n> Just tried the quest of Freestyle, using two Dunedain decks. It went horribly. It seems that by assigning a challenge that I thought would be challenging, I in fact assigned a challenge that it is actually a pretty good strategy against the quest.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> Rather unexpected. haha.\n> \n> I hope for the next \"challenge\" to be more challenging.\n\nYeah, you just happened to pick a strategy that worked perfectly.  Perhaps a more difficult challenge would be to have a starting threat of at least 34.\n\nEdited August 12, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733454","commentId":1733454,"userName":"koriakin97","timestamp":1439414167,"content":"Starting threat of 34+ is not bad when you run Gandalf Elrond and galadriel. Maybe excluding these heroes? Or wach hero needs to have 11+ threat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733721","commentId":1733721,"userName":"legolas18","timestamp":1439427337,"content":"Well here's what I'm thinking. I'll start a new challenge at the beginning and halfway point of each month. So I was planning on starting a new challenge on the 16th of this month. Sound good? And yes, I'll definitely choose my challenge more carefully this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1733834","commentId":1733834,"userName":"Seastan","timestamp":1439433879,"content":"Final Score: 75.\n\nRounds: 3 completed (won in combat phase of round 4).\n\nHeroes Sam, Merry (Lore), Pippin (Tactics)\n\n \n\nStrategy: Get high threat by failing the quest with all the trolls in the staging area after they appear. Then they all engage, and you play A Good Harvest + Out of Sight to prevent them from attacking. Finally, use a combo of Steward of Gondor, 2x Gondorian Fire, 3x Fast Hitch/Cram, and 2x Blade of Gondolin (all on one Hobbit) to take out all the trolls and complete the quest in one fell swoop. All this is easily obtained thanks to Peace and Thought, Deep Knowledge, Sneak/Gandalf, Daeron's Runes, and We are not Idle providing massive card draw. Legacy of Numenor, Tighten our belts, and Steward provide the necessary resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1734587","commentId":1734587,"userName":"Zalrus9","timestamp":1439481875,"content":"Just beat the quest with a Sam/Tactics Merry/Lore Pippin Ent deck on normal. got a cluch Tighten Our Belts on the first turn, and was able to get three ents in play (including Treebeard) on the second turn. Spent about 3 rounds on the first stage, ammasing an army of tree people, and then went to the second stage. Got almost overwhelmed by the threat in the staging area (including 2 sharpshooters in there), but my high hp allies prevailed, and I took out the trolls one by one and won eventually.\n\n \n\nThis was fun! Can't wait to hear what the next challenge will be. I really like this as it gives me a reason to play the game by myself as I await the expansions. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1734929","commentId":1734929,"userName":"legolas18","timestamp":1439494508,"content":"Alright. Why don't we have suggestions? \n\"Like\" the challenge idea if you... Well, like it.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnd the challenge is still going, so feel free to continue posting your stories!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735105","commentId":1735105,"userName":"Seastan","timestamp":1439503047,"content":"Great idea legolas18. Here are some ideas (some of which I've seen around, some of which I came up with)\n\n \n\n1. Mono-tactics: The Redhorn Gate\n\n2. Decks with only cost X cards, where X can be 0,1,2,3,4 etc\n\n3. Female-only heroes/allies\n\n4. Aragorn-Legolas-Gimli deck\n\n5. Three handed, all 9 members of the fellowship: Journey in the Dark."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735183","commentId":1735183,"userName":"entMoot","timestamp":1439507343,"content":"I ended up at 116 points.\n\n \n\nWas using the classic trio of Black Riders Sam, Merry, Pippin. The quest gave me a few set backs (Despair twice slowed the game down a lot). I didn't pack many allies and hence, not a lot of willpower in the deck, but was eventually able to tear the trolls up using A Good Harvest and Thicket of Spears to set up Merry + Beorn + readying shenanigans in combat. After that it took one more round to clear the Carrock.\n\n \n\nAll told I had 8 rounds completed, no damage, 40 threat and 4 victory points (a Hill Troll joined the 4 divas at the end)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735189","commentId":1735189,"userName":"Teamjimby","timestamp":1439508237,"content":"I like the idea of playing Passage Through Mirkwood with a single hero.  Bonus points would be awarded if you beat the quest with a hero that nobody else used (since I'm guessing Gandalf would be a popular choice)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735280","commentId":1735280,"userName":"DukeWellington","timestamp":1439514081,"content":"This was a great challenge, so don't beat yourself up. Seastan did not disappoint with his performance and that's what these kinds of things are all about, so even easy ones can be fun. Here are a few suggestions (X is used as a \"fill in the blank\"):\n\nBeat X quest in X turns.\n\nBeat X quest with 0 threat.\n\nBeat X quest with only Hobbits or Rohan or Dunedain or Eagles or X.\n\n4 handed shadow and flame nightmare (has it ever been done?)\n\nJourney to Rosgabel with mono tactics (not even sure it's possible)\n\nBuild a deck around X (a bad or underused hero, like Dwalin for instance).\n\nI also suggest we compete for best score and declare a winner after a \"season\". I'm motivated to try and beat Seastan score :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735291","commentId":1735291,"userName":"Authraw","timestamp":1439514726,"content":"Surely Journey to Rhosgobel Mono-Tactics must be possible... Now I want to try it.\n\nHow about beating Into Ithilien without any Tactics cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735313","commentId":1735313,"userName":"entMoot","timestamp":1439515965,"content":"Was the Blade of Gondolin x2 meant to explore The Carrock and place the 1 progress on Stage 2B? I don't think this works since the Carrock is made into the active location as soon as you complete Stage 1B and it is immune to player effects.\n\n \n\n> Final Score: 75.\n> \n> Rounds: 3 completed (won in combat phase of round 4).\n> \n> Heroes Sam, Merry (Lore), Pippin (Tactics)\n> \n>  \n> \n> Strategy: Get high threat by failing the quest with all the trolls in the staging area after they appear. Then they all engage, and you play A Good Harvest + Out of Sight to prevent them from attacking. Finally, use a combo of Steward of Gondor, 2x Gondorian Fire, 3x Fast Hitch/Cram, and 2x Blade of Gondolin (all on one Hobbit) to take out all the trolls and complete the quest in one fell swoop. All this is easily obtained thanks to Peace and Thought, Deep Knowledge, Sneak/Gandalf, Daeron's Runes, and We are not Idle providing massive card draw. Legacy of Numenor, Tighten our belts, and Steward provide the necessary resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735404","commentId":1735404,"userName":"Seastan","timestamp":1439522094,"content":">  \n> \n> Was the Blade of Gondolin x2 meant to explore The Carrock and place the 1 progress on Stage 2B? I don't think this works since the Carrock is made into the active location as soon as you complete Stage 1B and it is immune to player effects.\n> \n>  \n> \n> > Final Score: 75.\n> > \n> > Rounds: 3 completed (won in combat phase of round 4).\n> > \n> > Heroes Sam, Merry (Lore), Pippin (Tactics)\n> > \n> >  \n> > \n> > Strategy: Get high threat by failing the quest with all the trolls in the staging area after they appear. Then they all engage, and you play A Good Harvest + Out of Sight to prevent them from attacking. Finally, use a combo of Steward of Gondor, 2x Gondorian Fire, 3x Fast Hitch/Cram, and 2x Blade of Gondolin (all on one Hobbit) to take out all the trolls and complete the quest in one fell swoop. All this is easily obtained thanks to Peace and Thought, Deep Knowledge, Sneak/Gandalf, Daeron's Runes, and We are not Idle providing massive card draw. Legacy of Numenor, Tighten our belts, and Steward provide the necessary resources.\n> \n>  \n\n \n\nI thought about that. The Blade of Gondolin places progress on the current quest. It is a game framework effect, and not a player card effect, that instead places that progress on the active location, so I figured it still works. But it turns out you are right, and buried deep in the FAQ (p13 of FAQ 1.7) it says that Legolas' ability cannot place progress on immune locations. This \"immune to player card effects\" again proves to be one of the most confusing rules in the game to me.\n\n \n\nWhen I made the attempt I played one more round just in case the blades ended up not working. I amassed 1+10 more points, but if you swap out the 2 blades I had for 2x Secret Vigil, my actual score is 75+1+10-2-2=82. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1735841","commentId":1735841,"userName":"Dwarf king Bronze beard","timestamp":1439555497,"content":"Complete a journey down the Anduin without using allies. I think it would be kinda hard one because you will need much willpower at stage 2 (which is kinda hard to achieve without any allies) and of course combat would be harder too.\n\n \n\nWhat you think?\n\nEdited August 14, 2015 by Dwarf king Bronze beard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1737340","commentId":1737340,"userName":"raven614","timestamp":1439653659,"content":"Just beat it after 8 try's. But once I got Steward of Gondor and Gondor Fire going on Pippin I crushed it. Good fun keep the challenges coming.\n\n \n\n10 completed rounds = 100\nTotal combined Threat = 28\nTotal damage on Heroes = 2\nCost of dead Heroes = 0\nVictory points = 6\nTOTAL SCORE = 124"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738031","commentId":1738031,"userName":"legolas18","timestamp":1439702219,"content":"OFFICIAL ANNOUNCEMENT\n\nThanks for all the reports and suggestions!\n\nTomorrow I'm going to change the challenge.  The challenge I've chosen is going to be as follows:\n\n \n\nQuest:  Into Ithilien\n\nChallenge: Beat the quest using only Spirit or Lore decks and heroes.\n\n \n\nSound good?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738081","commentId":1738081,"userName":"Authraw","timestamp":1439708601,"content":"Sounds great!\n\n \n\nMy recommendation is to start a new thread for the new challenge so we can continue to discuss this one here if we want to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738147","commentId":1738147,"userName":"John Constantine","timestamp":1439714444,"content":"Do you mean by monospheres, or a deck can contain any combination of spirit and lore cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738422","commentId":1738422,"userName":"PocketWraith","timestamp":1439735701,"content":"> OFFICIAL ANNOUNCEMENT\n> \n> Thanks for all the reports and suggestions!\n> \n> Tomorrow I'm going to change the challenge.  The challenge I've chosen is going to be as follows:\n> \n>  \n> \n> Quest:  Into Ithilien\n> \n> Challenge: Beat the quest using only Spirit or Lore decks and heroes.\n> \n>  \n> \n> Sound good?\n\nSlightly disappointing for me because I've done that before. I built a Lore/Spirit deck specifically for Into Ithilien (admittedly it was intended for multiplayer, but it works solo as well)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738429","commentId":1738429,"userName":"John Constantine","timestamp":1439735879,"content":"And another question, since we have a sphere restriction there, and by the FFG's own design, Neutral is not a sphere - can we include Gandalf hero?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738431","commentId":1738431,"userName":"PocketWraith","timestamp":1439735962,"content":"And actually, does \"Spirit or Lore decks\" mean we can't even splash other spheres? Because if so my existing deck would actually be ineligible since I splashed in a couple of Eagles via Elrond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738719","commentId":1738719,"userName":"legolas18","timestamp":1439758088,"content":"Hahaha\n\nWhoa guys. Okay, I had in mind the challenge of doing this quest WITHOUT Leadership or Tactics, so I'd say no splashing. I'm not saying that you have to do it monosphere, although that's what I would do.  Personally I think you guys who usually do it solo should really try it two-handed. It really amps up the challenge.\n\n \n\nAnd Authraw, you really think I should start a new thread? I will if people want me to. I was just going to keep them in the same thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1738724","commentId":1738724,"userName":"legolas18","timestamp":1439758470,"content":"Also, I am sorry PocketWraith if you've already done this. It seems I can't please everybody, but you could always just try a different deck.   :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1739188","commentId":1739188,"userName":"Authraw","timestamp":1439788765,"content":"Well I haven't had a chance to try this challenge yet, but I wouldn't want to derail the thread once you start a new challenge.\n\nIt's ultimately up to you though, you're the one spearheading it. It honestly doesn't matter that much, it'll be fun either way. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1739792","commentId":1739792,"userName":"Dwarf king Bronze beard","timestamp":1439826517,"content":"I would like that there would be a new thread for the new challenge. I think it would be better like that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1739935","commentId":1739935,"userName":"legolas18","timestamp":1439831590,"content":"Alright, two people have spoken. Moving to a new thread!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1746964","commentId":1746964,"userName":"Authraw","timestamp":1440123012,"content":"I just did the Hobbit challenge. I decided to do Nightmare Conflict at the Carrock since I own it, but hadn't played it yet.\n\n10 Rounds, 38 Threat, 19 Victory Points for a total score of 119.\n\n \n\nI wanted to do something a little different from the classic so I went with Merry (T) / Pippin (L) / Bilbo and an army of Ents. The card draw with this deck was crazy! It took a while to get going, but by carefully underquesting I was able to play enough Ents to be able to take out each troll one by one.\n\n \n\nFull decklist (and strategy) here [http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-decks/_/lord-of-the-rings-submitted-decks/hobbit-and-ent-deck-for-nightmare-conflict-at-the-carrock-r264].\n\n \n\nThis is the first time I've tried a full-out Ent deck, it was really fun! Definitely wouldn't work in quests that hit hard from the get-go though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/?do=findComment&comment=1782306","commentId":1782306,"userName":"PocketWraith","timestamp":1441744596,"content":"OK, I've been catching up on the challenges, and I've posted what I did for both on Warden of Arnor, so if anyone's interested:\n\n \n\nhttps://wardenofarnor.wordpress.com/2015/09/06/forum-challenge-1/ [https://wardenofarnor.wordpress.com/2015/09/06/forum-challenge-1/]\n\n \n\n(Summary: Ridiculously long game, side-quests OP)"}]}