{"url":"https://community.fantasyflightgames.com/topic/184636-new-player-question/","title":"new player question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184636-new-player-question/?do=findComment&comment=1727954","commentId":1727954,"userName":"cooler150","timestamp":1439138780,"content":"Hi all just started playing LotR card game with the wife. Neither of us has played card games before so as you can imagine there is one or two questions.\n\n \n\nI have watched a few how to videos and such and we have played a few games and think we have a general idea of what we are doing. In fact we enjoy it so much we have just ordered an expansion and some packs.\n\n \n\nAnyway down to my first question\n\n \n\nIf you have an event card in your hand that allows you stop an attacking enemy from attacking that round does this mean you stop it getting a shadow card too or does that still come into effect ?\n\n \n\nEg: the Feint card\n\n \n\nCombat Action: Choose an enemy engaged with a player. That enemy cannot attack that player this phase.\n\n \n\nThanks in advance for any replies to this question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184636-new-player-question/?do=findComment&comment=1729134","commentId":1729134,"userName":"Dsbessie","timestamp":1439217794,"content":"I am new also, however my understanding is you would need to play Feint at the very beginning of the attack phase and the the shadow card would be discarded as if it never exsisted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184636-new-player-question/?do=findComment&comment=1729239","commentId":1729239,"userName":"alogos","timestamp":1439222174,"content":"Rulebook or faq has a detail exemple of how feint should be played.\n\nYou play it before an ennemy begin an attack, because it does not stop an attack, it prevent one from occuring. Shadow cards, in the combat phase, are dealt before any action can be done and does not matter if the enemy can't attack because it never get revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184636-new-player-question/?do=findComment&comment=1729242","commentId":1729242,"userName":"jjeagle","timestamp":1439222270,"content":"- you deal Shadow cards to every engaged enemy at the very start of the combat phase (before you would have a chance to play Feint)\n\n \n\n- if you then subsequently Feint an enemy before it attacks, it won't attack and its Shadow card won't be revealed\n\n \n\n- the unused Shadow card will then be discarded at the end of the combat phase"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184636-new-player-question/?do=findComment&comment=1729350","commentId":1729350,"userName":"cooler150","timestamp":1439225735,"content":"Thanks all for the replies."}]}