{"url":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/","title":"Quest difficulty and Metagaming","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1727680","commentId":1727680,"userName":"Eu8L1ch","timestamp":1439118572,"content":" \n\nFirst question: what is that determines the difficulty of a quest for you?\n\n \n\nNote: I'm not considering the official difficulty ratings of quests, however there is a nice post on Tales from the Cards blog on this topic: https://talesfromthecards.wordpress.com/2013/09/16/lotr-rants-difficulty-rating/ [https://talesfromthecards.wordpress.com/2013/09/16/lotr-rants-difficulty-rating/]\n\nI think it's worth taking a look at it if you haven't already, it's interesting and well-done, IMO.\n\n \n\n \n\na) Randomness. ( cards/effect that don't come up often but can make the game end abruptly when they appear - Sleeping Sentry ; effects that swing from 'no effect' to 'game over' - Power of Mordor, The Leaping Fish )\n\n \n\nb) Player count. ( some quests are harder while playing solitaire, others become harder increasing the number of players )\n\n \n\nc) Specialisation required. ( a specific aspect of the game is emphasised - healing, treachery/shadow cancellation etc. )\n\n \n\nd) Encounter hate for a specific element of player decks ( Allies, Card Draw, etc. ); also see Specialisation.\n\n \n\ne) Brute encounter strength. ( difficult setup, high threat locations, high atk/hp enemies etc. )\n\n \n\n \n\nBonus question: do you consider a deck to be stronger than another (against a quest) because it has a higher win rate or because it can achieve better performances when the 'stars are right'?\n\n \n\n \n\n \n\nThis interests me from a gameplay perspective but also from a design perspective.\n\n \n\nFor example: is it rewarding for you to play a quest that has its difficulty level ramped up by the need for a lot of healing?\n\nOr that forces you to bring a lot of cancellation (and that might still not be enough) like Road to Rivendell?\n\n \n\nDo you consider more difficult a quest that requires a specialised deck in order to be beaten, but that can be beaten consistently when you do so, or a quest you'll have trouble with no matter the type of deck you bring?\n\n \n\n \n\n \n\n \n\n \n\nThe main point, for me, is that the quest-pool is growing so large that no deck can claim it can have a reasonable chance of success against most quests without some significant changes. While this certainly isn't a bad thing in itself, it makes me wonder about what I believe to be 'fair game' when I play a quest.\n\nI used to consider a high degree of specialisation (building a deck with a few specific cards form the encunter deck in mind) as an easy way to win and boring from a flavour-wise perspective (\"Oh look! Lucky me I brought a mono sphere deck: Master's Malice!\") since it makes cards in the encounter deck a non-issue in a way that for me has more to do with metagame skill rather than playing skill, and for me metagaming isn't that fun.\n\nNow, many quests require you to actually keep a few encounter cards in mind if you want to have a serious chance to win, and even then winning is far from granted ( this is especially true for NM sets ).\n\n \n\n \n\nSo, it seems to me there are *at least* two ways of playing this game: puzzle-solving and straightforward playing, with all the possible nuances inbetween the two.\n\n \n\n \n\n-Puzzle solving means you're taking into account every possible metagame consideration while you build the deck and play the quest.\n\n \n\n- Straightforward playing means you're playing as if you didn't know anything about the encounter cards left in the deck; in a way you don't even consider the ecnounter deck as a deck of cards.\n\n \n\nI think almost no one plays with full 'puzzle-solving' or 'straightforward' attitude.\n\nHowever I think almost everyone is more inclined towards one or the other.\n\n \n\n \n\nA few considerations:\n\n \n\n- Straightforward play makes it almost impossible to beat some quests, and makes it very difficult to beat most.\n\n \n\n- There is a signficant number of quests that favor puzzle solving, but some are still hard even with a puzzle-solving approach and close impossible without. (Compare old 'A Journey to Rhosgobel' to 'Fog on the Barrow Downs')\n\n \n\n \n\n \n\nMy approach:\n\nI tried building decks to play the Deluxe + Cycle quests because I wanted to develop a narrative by not changing decks and avoiding metagaming as much as possible (I'm not all out against metagaming: a bit is rewarding, but too much spoils the fun for me).\n\nAlso, I tried not to make considerations such as \"if i leave this lowly enemy engaged with me instead of destroying it, that treachery - of which there are still 2 copies in the deck - will just return 2 threat to staging instead of surging, so let's just leave it be for now\".\n\nIdeally, for me, a quest should be designed so that metagaming helps just a little and so that it can be beaten with a good degree of straightforward play, meaning that just taking a generic good deck gives you some chances of winning.\n\n \n\n \n\nHowever, I've noticed, for example, I had to constantly change deck during the Ringmaker cycle to beat some very specific quests: Dunland Trap, Three Trials, Nin-in-Eilph (and Trouble in Tharbad, to a degree).\n\nThe problem is I love those quests, but I just couldn't beat them with regular decks, so I had to depart from the narrative I was trying to build and change decks.\n\nThe same looks to be true for the Lost Realm: the first three quests require very different abilities to be beaten.\n\n \n\nSo it seems to me that significant puzzle-solving attitude is needed.\n\nThis is true in my experience for both solo and 3-4 players (especially for 3-4 players, in which certain cards have to be taken into account because they become killers and also because the needed proportion of fighting/quest/miscellaneous abilities varies signficantly with the quest you're playing, so it's very hard to just bring 3-4 decks along and play a few gameplay-different quests with those).\n\nIt might be that two is the sweet spot, as the game looks to be more balanced for 2 players, but it still seems to me some of those 'issues' are still there.\n\n \n\nIn the end, I appreciate the puzzle-solving aspect of the game but I would really like to have the option of playing without often making metagame considerations in order to win: I'm a Boromir-Pippin type that cares for victory and deck effectiveness but that wants to full-immerse in the spirit of the quest too.\n\n \n\n \n\n \n\nWhat are your experiences? What do you think of quest difficulty? Do you feel more like a puzzle-solving or a straightforward player, or of a third kind I didn't mention? What are your goals when building a deck?\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1728061","commentId":1728061,"userName":"ricedwlit","timestamp":1439143138,"content":"Nice post.\n\n \n\nI'll toss in my two cents. As the card pool has evolved I've moved to more of a theme based approach where I'll try to build a pair of decks (I play solo two handed) and then stick with them throughout the cycle. However, as you've noted, this can very difficult to do. So, in deference to the metagame, I've allowed the deck to evolve so that I can adjust to the challenges at hand.  I still try to keep some continuity, but now I have the freedom to adjust to the quests (and use new Heroes as they come out).\n\n \n\nFor example, my most recent play through of the Ring Maker cycle I used a \"Rohan and Silvan\" theme and the decks evolved as follows:\n\n \n\nThe Fords of Isen:\n\nDunhere, Eowyn, Eomer\n\nDenethor, Mirlonde, Theodred\n\n \n\nTo Hunt an Orc\nSwap Grima for Denethor. (Thematically just made sense to have him join)\n\n \n\nInto Fangorn:\n\nSwap Celeborn for Theodred (What can I say: you're entering a forest so why not some more elven heroes!)\n\n \n\nThe Dunland Trap\n\nSwap Glorfindel (Spirit) for Dunhere\n\n \n\nThe Three Trials\n\nNo hero change. (Seemed unrealistic to not use same heroes as were trapped)\n\n \n\nTrouble in Tharbad\n\nSwap Idraen for Glorfindel, Haldir for Grima (First opportunity to use Haldir Hero, so Grima decides to cut and run!)\n\n \n\nThe Nin-in-Eilph\n\nSwap Glorfindel for Idraen (Help to manage locations.)\n\n \n\nCelembrimbor's Secret\n\nNo hero change\n\n \n\nThe Antlered Crown\n\nSwap Grima for Haldir (Two reasons: for theme, Grima reappears to get the credit; for gameplay need to get cards out quickly again.)\n\nEdited August 9, 2015 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1728277","commentId":1728277,"userName":"koriakin97","timestamp":1439156077,"content":"We managed to beat in 3 player first 4 scenarios of ring maker (we don't have the other two) without any changes. We just build decks ready for a bit of everything. Of course we had to replay some scenarios, but we beat them all on second attempt. We checked encounter deck before playing, but we didn't know cards well enough to plan long strategies"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1728432","commentId":1728432,"userName":"jnicol","timestamp":1439167282,"content":"Interesting questions.\n\n \n\nI am a fairly new player and am still finding my playing style, but I would classify myself as a Boromir/Pippin player archetype according to Nate French's classification system. I construct a custom deck for each scenario, trying to find a successful combination that will \"solve\" the quest. I am also interested in novelty combos and decks that are fun to play, although my card pool limits the possibilities available to me.\n\n \n\nI enjoy scenarios with a puzzle aspect to them, and which require me to strategize and deck build accordingly. If I manage to beat the quest on my first attempt (Conflict at the Carrock, Hills of Emyn Muil) it is a little disappointing because I like the scenario to be difficult enough that it takes me a few attempts to \"crack the code\". If I can beat a scenario on the first pass then I feel the need to replay it using an intentionally weak deck to get my money's worth!\n\n \n\nAlthough I do not attempt to play thematically, or use the same deck for every scenario, I do have a preference for a Lore/Spirit deck with a splash of Leadership, which is built around the abilities of Eowyn, Bilbo and Denethor. I add in cards from the current adventure pack if they seem like they will help beat the scenario, and if the deck isn't working then I adjust it accordingly. This deck has worked very well for me against the Shadows of Mirkwood cycle, Escape from Dol Guldur excepted.\n\n \n\nWhen I move on to Khazad Dum I am sure I will switch to a deck built around the Dwarf trait.\n\n \n\nTo answer your question about what makes a scenario difficult, I would say randomness. An \"easy\" scenario like A Passage Through Mirkwood can turn deadly if you draw an enemy on your first turn, and have to face down two enemies during the first round. Or the Hummerhorns can destroy your quest in an instant. Hidden objectives are another random element that can make a scenario difficult - the Athelas objectives in a Journey to Rhosgobel, for instance.\n\n \n\nA scenario needs an element of randomness to be challenging and unpredictable, but not so much that it feels like a game of chance. So far I think that the game's designers have gotten the balance right."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1728597","commentId":1728597,"userName":"ppsantos","timestamp":1439179162,"content":"I think there should be 2 separate difficulty ratings: one for solo and another for multiplayer (or 2 player). It cannot be simply a +1 or +2 DF for multiplayer because some scenarios are easier the more players there are and there are some scenarios which are harder the more players there are.\n\n \n\nI agree that randomness  also affect the perceived difficulty of the scenario.  But instead of +1 or +2 DF, I suggest instead a +/- adjustment, ie. a range, to take into account the wild swings that could happen in the game.  That way, players can see that, a scenario, on the average, could be moderate difficulty, but has a +/-1 DF and could slightly be easier or harder depending on the draw of the encounter deck.\n\n \n\nLastly, I disagree with the notion that specialization required should play a role in the DF because:\n\n \n\n1. Players are expected to adjust: their playing strategy, their deck, and whatever else that may need to be adjusted in order to succeed.\n\n \n\n2. I don't subscribe to the notion that the \"one deck to rule them all\" is expected to have a fair chance to succeed in whatever quest and that if it does not (say, because the scenario requires certain player cards which the 'one deck to rule 'em all' does not currently have in the deck) the scenario should be given a DF modifier for 'increased' difficulty because 'specialization' is required.    'Specialization' is part of the expected player adjustment mentioned in #1.\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1729763","commentId":1729763,"userName":"Noccus","timestamp":1439239963,"content":"Good topic Eu8L1ch.\n\n \n\nFor me, or us, as I mostly play with three players, it is definitely A) the randomness that can get to us in the form of devastating treacheries or shadow effects.\n\nWe mainly play NM mode, and some are so brutal they can just wipe you from the table.\n\nUsually we have two players playing spirit to counter this, and Eleanor is always on the table in our games.\n\n \n\nB) is not really a problem normally, as we don't know any better. \n\n \n\nC) I don't count. If you build specific deck for a quest then of course it's get easier.\n\n \n\nD) Same as C, as we've managed everything with non-specific build decks until now.\n\n \n\nE) This can be a cause of course, but a lot less so then the \"random factor\" of treacheries & shadow cards.\n\n \n\nI guess we play pretty straight forward, in video game like way: the holy trinity: tank, dps & heal  quest.\n\nVery effective I must say.\n\nEdited August 10, 2015 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1729901","commentId":1729901,"userName":"jnicol","timestamp":1439246544,"content":"> the holy trinity: tank, dps & heal quest.\n\nNoob question: Can you explain the terms \"tank\" and \"dps\"? I've seen people refer to \"tanking\" in the past but wasn't able to find a good explanation of the term.\n\nEdited August 10, 2015 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1729950","commentId":1729950,"userName":"GrandSpleen","timestamp":1439248220,"content":"these are terms that come out of online gaming, at least \"dps\" is for sure..... it refers to damage-per-second and it is what it sounds like.  How much damage can your character do per second of combat?  It's not literally applicable to LotR LCG, but Noccus is invoking the phrase in a loose sense to mean that you need a character who can deal out enough damage to succeed in combat.  \"Tank\" is the character who can absorb a lot of hits, so he means that you need to have defense covered in combat as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1729966","commentId":1729966,"userName":"jnicol","timestamp":1439248998,"content":"Brilliant explanations, thanks GrandSpleen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1729989","commentId":1729989,"userName":"alexbobspoons","timestamp":1439250172,"content":"My play style has evolved that i usualy take the deck i beat tge last scenario with (kinda campaign style) and play my next scenario \"straightforward\" and blind to any encounter deck cards.\n\nThis is a lot of fun, but tends to be very difficult. So after enough plays to get used to the scenario, i then try to puzzle-solve a deck to beat it.\n\nSo i kinda play both approaches, and if i am honest, i am not good enough at building decks to quite say which approach is the more difficult for me as yet :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIm not sure what i find hardest in a deck either. Some cards just blindside me :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1730390","commentId":1730390,"userName":"Ghost Dancer","timestamp":1439273243,"content":"I'm still fairly new to the game and have just completed the Shadows of Mirkwood quests, some of which I found a lot easier than others. \n\n \n\nI started with a couple of dual sphere decks, but playing solo I soon discovered that tri-sphere worked much better. I settled on a Leadership/Lore/Spirit deck, but found I had to make minor changes for some quests (swapping out a few cards, or in some cases changing some heroes). I love deck building, so I really like this aspect of the game - for me half the fun is tweaking the deck to deal with each quest, using an identical deck all the time would soon get boring for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1731678","commentId":1731678,"userName":"alexbobspoons","timestamp":1439329024,"content":"> I'm still fairly new to the game and have just completed the Shadows of Mirkwood quests, some of which I found a lot easier than others. \n> \n>  \n> \n> I started with a couple of dual sphere decks, but playing solo I soon discovered that tri-sphere worked much better. I settled on a Leadership/Lore/Spirit deck, but found I had to make minor changes for some quests (swapping out a few cards, or in some cases changing some heroes). I love deck building, so I really like this aspect of the game - for me half the fun is tweaking the deck to deal with each quest, using an identical deck all the time would soon get boring for me.\n\nI have only dipped my toe into Darrowdelf so played a similar amount and my favour was also trisphere but Leadership/Tactics/Spirit :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited August 11, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184615-quest-difficulty-and-metagaming/?do=findComment&comment=1732421","commentId":1732421,"userName":"Eu8L1ch","timestamp":1439377564,"content":"Thank you all for the feedback, and I'm glad you found it interesting. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n@ricedwlit\n\n \n\nI think we have a similiar approach, I also happen to change a Hero or two over the course of the cycle but  usually keep the deck more or less the same.\n\n \n\n \n\n \n\n@Ppsantos\n\n \n\nI mostly agree with you on separating the difficulty ratings for solo and multiplayer (I actually think we should have 3 ratings, to be accurate: solo, 2P, 3-4P).\n\n \n\nThat's an interesting proposition, you're turning the statement upside down: there is no 'specialisation', just quests that are worse for presumed general-purpose decks, so, if I understand you correctly, you think there are no 'standard' deck and no 'standard' abilities but rather consider each quest as a single challenge.\n\nHowever, I think it's hard to deny that some abilities are always useful and always important to have, whereas some are much more situational, as you can easily win most quests without having them.\n\nFor example, I think card draw and resource generation (or, to be precise, resource-card draw balance) are abilities that determine the overall effectiveness of a deck: you can have a healing deck for Journey to Rhosgobel, but if you don't draw the right cards or have trouble playing enough of them you'll not win very often, no matter how much adjustment you did.\n\nA 'general-purpose' deck is a deck that excels under the aspects that are common to all successful decks but lacks quest-specific abilities (to a degree, at least).\n\nSuch decks can usually have very high win rates against a significant number of quests, so that's why people usually think the 'ODTRTA' notion at least makes sense - even if this doesn't necessarily mean such a deck exists.\n\n \n\nBuilding a ODTRTA is usually intriguing because it's something that's very difficult to do and puts to the test your deckbuilding abilities, since it is usually assumed that, after attaining a certain level of ability, almost (*DG Solo is an exception, but that's mainly due to contraints that are had to get by with deckbuilding) every quest becomes easy if you deckbuild for it (as Noccus wrote).\n\nSo, not allowing yourself to specifically deckbuild is a way to increase the level of difficulty.\n\nI was curious about what people chose as their 'difficulty level', that is how many adjustments they allowed themselves.\n\nOne of the main questions (implied in) my post was this:\n\n\"Since some quests do require at least some specialisation to be beaten, how many adjustment do you allow yourself to still keep the game difficult and exiciting?\n\nWhat do you believe to be 'fair game' for the level of difficulty you want?\"\n\nI think for me it depends on the quest, since some are difficult even with adjustments so it's worth it to try and 'solve' them with a specific deck.\n\nAnother question was:\n\n\"Do you enjoy the fact that some quests *require* specialisation to be beaten?\" (so that even if you are not trying to build a deck to puzzle-solve the quest you still need to adjust)\n\nFor me, that presents a few problems, one of which is trying to find the right difficulty level, since 'no adjustments' is pretty absolute and easy to be taken as a standard, whereas 'few adjustments' only draws a blurred line.\n\nTrying to work out a restricted 'meta' for a deck, that is a metagame taking into account only a section of all the quests one could play, is my main answer.\n\nThe choice I make for my 'restricted meta' is a Deluxe+Cycle, thus trying to put some sense of 'objectivity' back into my difficulty-adjustment (since cycles are supposed to be part of the same narrative and usually share the same mechanics).\n\nWhat baffles me is when not even the restricted meta of a deluxe+cycle allows a deck to perform well, forcing me to make some changes: this makes it much harder for me to set my level of difficulty (note this is only one aspect of the problem, another aspect is the lack of narrative and I'm also not considering in-game metagaming).\n\n \n\n@Noccus\n\nAbout the Holy Trinity: I think that's a fairly good way fo splitting up tasks, even though I've found in my 3p games we tend to go with Quest, Combat (some defense, but mainly use Haldir or Tactics events to avoid defending as much as possible), Miscellaneous (usually healing, some extra wp, situational effects... it depends).\n\n \n\n@Ghost Dancer\n\nI love deckbuilding too, but there are multiple ways to enjoy it: puzzle-solving each quest is surely one, but one could also try beating the same subset of quests using different decks each time. In fact, that's the approach I like the most since it's very interesting to see how the dynamics for the same quest change when you use different decks. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI still have to try playing Campaign-style, as not being allowed to change my heroes but receiving rewards in exchange seems exactly what appeals to me right now.\n\n \n\n \n\nI think the quests fall into one of these categories, difficulty-wise:\n\n \n\n- Easy quests: easy even with a general-purpose deck ( The Hunt for Gollum )\n\n \n\n- Puzzle quests: difficult with a general-purpose deck, easy with a specifically built one (Battle of Lake-Town)\n\n \n\n- Strictly puzzle quests: almost impossible with a general-purpose deck, difficult with a specifically-built one ( Fog on the Barrow Downs )\n\n \n\n- Hard quests: difficult with a general-purpose deck, only slightly easier with a specifically-built one ( some NM quests )\n\n \n\n \n\nAnd all the various nuances in between of course.\n\nEdited August 12, 2015 by Eu8L1ch"}]}