{"url":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/","title":"New LOTR Goodness!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1727929","commentId":1727929,"userName":"Rob_Oz","timestamp":1439137398,"content":"My GenCon agent delivered some LOTR Goodness to me yesterday, a mere one week after GenCon! He was amply rewarded with beer and lunch.\n\n \n\n11811583_10154141800496982_7257305580603 [https://scontent-iad3-1.xx.fbcdn.net/hphotos-xpt1/v/t1.0-9/s200x200/11811583_10154141800496982_7257305580603067271_n.jpg?oh=0833c0e7f56b2140e48fa518b0a67892&amp;oe=5648B290]\n\n \n\nMy play area for the new stuff:\n\n \n\n11831649_10154141801221982_6303507533304 [https://scontent-iad3-1.xx.fbcdn.net/hphotos-xpf1/v/t1.0-9/s200x200/11831649_10154141801221982_6303507533304402683_n.jpg?oh=b3a9f573863f0f980c0904c3ada46be0&amp;oe=563C4BAD]\n\n \n\nMany thanks to Stephen for procuring this custom play-mat for some of the D.C. area LOTR players in June of this year. The custom play-mat is an image of \"They are Coming\" from Journey in the Dark. Stephen also arranged our 2014 Fellowship event which netted me (and many other D.C. area players) the well-known \"Black Riders\" play-mat last October. Love having these play-mats for my LOTR gaming.\n\n \n\nI've been playing LOTR:LCG since I purchased a copy of the Core Set on an impulse buy at GenCon in 2012. I was in the mood for a game that looked new and unusual and could be played solo. My off-the-cuff purchase of the Core set fulfilled both desires and I've been an avid fan ever since. With all the new stuff arriving and in the works for LOTR, the game just keeps getting better and better.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1727979","commentId":1727979,"userName":"Gizlivadi","timestamp":1439139947,"content":"Cool stuff. They are Coming is a strange image to make a playmat out of, but it does look nice. I'm dripping with jaleousy over that Land of Shadow box!\n\n \n\nSince we're showing off swag, I thought this would be the thread to show my new playmat:\n\n \n\nWnmr3Zt.jpg [http://i.imgur.com/Wnmr3Zt.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1727986","commentId":1727986,"userName":"DukeWellington","timestamp":1439140106,"content":"^^ O.O !!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1728045","commentId":1728045,"userName":"alexbobspoons","timestamp":1439142303,"content":"Awesome stuffs!\n\nMy playmat is the semi-famous two player one from BGG. Truly love it, though i do occupy most of staging so two players may be a squeeze :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1728123","commentId":1728123,"userName":"Olorin93","timestamp":1439147268,"content":"Gizlivadi, what is that art piece please? It's gorgeous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1728166","commentId":1728166,"userName":"Rob_Oz","timestamp":1439149495,"content":"Really nice play-mat, Gizlivadi. I took a peek at the Game of Thrones play-mats (a game I don't play) that FFG is going to put out and I don't think I care for marked space for cards or play zones on my play-mat. I'd rather just see the unobscured artwork. So I like the simple, clean look of yours.\n\n \n\nI was dubious about They are Coming as the basis of a play-mat, particularly since the image on the card itself is vertical, not horizontal. But I very much like the finished product. What isn't quite evident from my small picture is that you can see the text of the Book of Mazarbul quite well.\n\n \n\nI feel very happy and very fortunate to nab an early copy of Land of Shadow with my friend's help, as it is currently listed as \"At the Printer\" on the FFG status page. That likely means it won't be available in the U.S. (where I live) until October-ish. I still need to make my way through the Treason of Saruman, though, so I won't be playing the quests from Land of Shadow anytime soon. The player cards are getting used, however.\n\nEdited August 9, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/184635-new-lotr-goodness/?do=findComment&comment=1728172","commentId":1728172,"userName":"Gizlivadi","timestamp":1439149800,"content":"Olorin, you can just search in google images for \"Ted Nasmith lotr\", maybe changing the settings to bigger images, and you'll eventually find it. Ted Nasmith is one of my favorite Lotr artists of all time, so having a playmat with his depiction of the rohirrim is great. Can't wait to play my Rohan deck on it."}]}