{"url":"https://community.fantasyflightgames.com/topic/184713-forest-snare-and-nameless-thing/","title":"Forest Snare and Nameless Thing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/184713-forest-snare-and-nameless-thing/?do=findComment&comment=1729045","commentId":1729045,"userName":"cmabr002","timestamp":1439215050,"content":"I know there are already threads about this, but I am seeing conflicting information.  I am curious if the conflict is due to a change in rulings over time and since I just started getting into the game, I am not sure what the most up to date ruling is.  It seems that my source 2 is outdated and thus the current FAQ ruling would stand.\n\n \n\n1.  If Forest Snare attaches to Nameless Thing as a result of its forced effect does the Forest Snare prevent the Nameless Thing from attacking?\n\n \n\nSource 1:\n\n \n\n> Q: If a card is attached to Nameless Thing (D 125) as part of the resolution of its Forced effect, is that card’s\n> game text active?\n> A: No. Cards that are attached to Nameless Thing (or Elder Nameless Thing) as a result of triggering its Forced effect are considered attachments with no card title or game text. The only active part of the attached card is its cost.\n\n \n\nThis indicates that it does not work.\n\n \n\nSource 2:\n\n \n\n> jjeagle: A separate question - the situation where Forest Snare has been attached to a Nameless Thing as a result of the action on Nameless Thing. I can't see any reason why the effect of Forest Snare (\"Attached enemy cannot attack\") would not apply in this situation. However, this seems a little silly. I suspect that what is needed is a ruling that cards attached to Nameless Thing by its effect are treated as if they are blank for all other purposes apart from their printed cost.\n> \n>  \n> \n> Caleb: I like this question a lot because I think it's the beauty of card games when something unintended and fortuitous like this happens. There is absolutely no reason why a Nameless Thing that attaches a Forest Snare to itself should ignore the text on that Forest Snare. In other words, if you top-deck a Forest Snare with the Nameless Thing's text, then it cannot attack. I would laugh out loud in a game where that happened!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/184713-forest-snare-and-nameless-thing/?do=findComment&comment=1729060","commentId":1729060,"userName":"jjeagle","timestamp":1439215487,"content":"The FAQ is more recent and takes priority here.\n\n \n\nThe second ruling you cite is one I received from Caleb soon after the release of Foundations of Stone, but it was subsequently reversed via the FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/184713-forest-snare-and-nameless-thing/?do=findComment&comment=1729065","commentId":1729065,"userName":"cmabr002","timestamp":1439215597,"content":"Thanks jjeagle!"}]}