{"url":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/","title":"Despair Treachery","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735348","commentId":1735348,"userName":"Dsbessie","timestamp":1439517875,"content":"Am I correct in assuming the 4 progress tokens always come of the quest card even if there is an active location with progress tokens on it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735417","commentId":1735417,"userName":"jnicol","timestamp":1439523318,"content":"Interesting question. I have always assumed that the progress tokens are removed from the quest card, but reading the card text more closely I'm not so certain.\n\n \n\n\"When Revealed: Remove 4 progress tokens from the current quest card. (If there are fewer than 4 progress tokens on the quest, remove all progress tokens from that quest.)\"\n \nThe first part definitely instructs you to remove the progress tokens from the quest card. But the second part, in parentheses, says to remove the tokens from the quest rather than the quest card.\n \nSince \"the quest\" includes both the quest card and the active location, this means that if there is a combined total of fewer than 4 tokens on both the quest card and the active location (\"the quest\"), they should all be removed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735425","commentId":1735425,"userName":"PocketWraith","timestamp":1439524708,"content":"> Since \"the quest\" includes both the quest card and the active location,\n\n[Citation needed]\n\n \n\nI'm pretty sure the OP is correct. The active location serves as a buffer to the quest, it is not part of the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735449","commentId":1735449,"userName":"Raven1015","timestamp":1439527031,"content":"From the FAQ:\n\n \n\n\"When a card effect removes progress tokens from a quest or quest card, the effect applies specifically to the quest card, and never to the active location.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735501","commentId":1735501,"userName":"jnicol","timestamp":1439530223,"content":"Oops, you guys are quite correct. I don't know where I picked up the idea that the active location formed part of the quest. Sorry for any confusion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1735602","commentId":1735602,"userName":"banania","timestamp":1439537994,"content":"> Oops, you guys are quite correct. I don't know where I picked up the idea that the active location formed part of the quest. Sorry for any confusion.\n\n \n\nProbably because it's the reverse concerning player card effects.\n\n \n\nFor example, Legolas response refers to the \"current quest\" and still, you must place the progress tokens on the active location first, which acts as a buffer of the quest.\n\n \n\n \n\n> From the FAQ:\n> \n>  \n> \n> \"When a card effect removes progress tokens from a quest or quest card, the effect applies specifically to the quest card, and never to the active location.\"\n\n \n\nWhat I find quite \"meh\" with this ruling is that when you have 2 progress tokens on the quest card and 2 progress tokens on the active location, that FAQ entry implies that the Treachery \"Despair\" removes the 2 progress tokens from the current quest and you let the 2 other progress tokens on the active location. That's weird considering how \"placing progress on the quest\" from a player perspective works.\n\n \n\nI think I've misplayed this part for a long time, because it seems more thematic to me that the progress on the active location would also be gone. Let's think in terms of {active location+quest} as whole, the players must explore the location first and then place progress on the quest, whereas the encounter deck removes counter from the quest then from the active location. That'd seem like a more logical rule to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1736137","commentId":1736137,"userName":"Dsbessie","timestamp":1439566239,"content":"> From the FAQ:\n> \n>  \n> \n> \"When a card effect removes progress tokens from a quest or quest card, the effect applies specifically to the quest card, and never to the active location.\"\n\nSorry, seems like no matter how many times I read the faq I miss something.\n\nThanks for the replies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1745566","commentId":1745566,"userName":"Julia","timestamp":1440062169,"content":"Consider this (I think it's the rationale behind the FAQ): you win the game by completing the different quest stages, not by exploring active locations (well, at least in most of the cases). Hence, the rules are created to \"defend\" the quest:\n\n \n\n- effects removing progress markers target directly the quest stage you're at\n\n- effects adding progress markers target the eventually active location before targetting the quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185069-despair-treachery/?do=findComment&comment=1745567","commentId":1745567,"userName":"banania","timestamp":1440062295,"content":"I agree with the mindset, but I'd find it more logical if the Encounter Deck would keep removing progression tokens from the active location after there's no progression token left on the quest card.\n\nEdited August 20, 2015 by banania"}]}