{"url":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/","title":"Leadership sphere cannot attract allies?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739208","commentId":1739208,"userName":"ppsantos","timestamp":1439791025,"content":"Just noticed that up to Dwarrowdelf cycle, the leadership sphere has so few allies.  What's up with that? According to the Rule booklet, Leadership \"emphasizes the charismatic and inspirational influence of a hero, and that hero's potential to lead, inspire, and command both allies, and other heroes alike.\"  If that's so, shouldn't attracting/mustering allies be the strength of Leadership?  Shouldn't leadership have many inexpensive allies?  But the opposite happens in reality: so few leadership allies and most are generally expensive (compared to other spheres').\n\n \n\nFor the whole Shadows of Mirkwood cycle, Leadership only got 2 new allies (compared to 6 each for Lore, Tactics, and Spirit). In Khazad dum, Leadership got zero new allies, whereas all other 3 spheres got 1 new each.  For the whole Dwarrowdelf cyle, Leadership got 3 new allies (tactics also got 3, but Spirit and Lore got 4 each).  So, up to Dwarrowdelf cycle, leadership only gained 5 new allies, compared to 11 new allies for Lore and Spirit, and 10 for tactics.\n\n \n\nIs FFG trying to balance out the unintended overpoweredness of Faramir (core) and Steward of Gondor (core), that's why Leadership is being gimped?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739214","commentId":1739214,"userName":"Olorin93","timestamp":1439792025,"content":"I'm not saying you're wrong about the numbers, but are you trying to build a mono-sphere deck? Mono-sphere isn't really viable until the Against the Shadow cycle, and at that point there are more allies to go round. Why not pair Leadership with one of the other spheres so you don't have to compromise with deck building?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739239","commentId":1739239,"userName":"ppsantos","timestamp":1439794182,"content":"No, it's not about deckbuilding.  The lack of allies was just opposite of what I thought Leadership is about -- rallying allies to your cause, which I interpret as allies wanting to join (ie abundance of allies) and charisma of 'leadership' - making allies 'cheap' (ie does not take a lot of resources to rally the allies to your cause)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739296","commentId":1739296,"userName":"koriakin97","timestamp":1439798589,"content":"Leadership specializes at giving boosts and resources- so leading and mustering. If you have leadership (combined with other sphere) it's easier to quickly muster army of allies. and leadership got cheap allies in gondor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739360","commentId":1739360,"userName":"Olorin93","timestamp":1439804979,"content":"Yeah, Leadership is equal parts rounding up allies and buffing them (and other players' characters). Leadership allies are still coming out e.g. for Gondor and Dúnedain in the Lost Realm and AA. If you only have the first two cycles and want to build an efficient ally-swarming deck, dual-sphere is your best bet.\n\nedit: And regarding ally cost - Lore really is the cost-reducing sphere. As Leadership has the best resource acceleration, it shouldn't be able nor really need to reduce card cost on its own. Combined with Lore, though, you can get quite many cards on the table in a short time.\n\nEdited August 17, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739593","commentId":1739593,"userName":"GrandSpleen","timestamp":1439819066,"content":"Take a look at the \"400 player cards\" thread that is currently ongoing in this forum.  Leadership has more allies than any other sphere in the current game state."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185316-leadership-sphere-cannot-attract-allies/?do=findComment&comment=1739675","commentId":1739675,"userName":"Chris51261","timestamp":1439823062,"content":"Things are looking up for leadership, they just got their first 3 attack ally! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}