{"url":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/","title":"Silly Questions but...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1744467","commentId":1744467,"userName":"Fewzz","timestamp":1440004986,"content":"Hello Everyone\n\n \n\nPlease understand i am very new to these games, i have never played any of them before, ever.\n\nI do have a few silly questions, i apologise if they sound silly.\n\n \n\nQ When i have a few enemy cards in the engagment area how do i choose what one attacks first, or is that totally my choice.\n\n \n\nQ I have played a few test games and seen a few tutorials but i have just had a card that has a cost of X, i assume this isnt 10, so what does that mean?\n\n \n\nQ 'Attached Hero gains Gondor Trait' , ok but what is the Gondor Trait, ive googled everywhere and no answers.\n\n \n\nQ Final silly one, how do i know where the Hero is from , ie Gondor etc\n\n \n\nMany thanks for any answers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1744981","commentId":1744981,"userName":"Teamjimby","timestamp":1440026403,"content":"When you have multiple enemies engaged with you, you get to choose the order that they attack.  Note that enemies in the Staging Area do not attack.\n\n \n\nX is a variable.  The cost of the card is determined by the text, where it will say \"X is...\"\n\n \n\nAll characters have traits.  Some are Noble, Warrior, Noldor, Dwarf, Rohan, and Gondor.  Gaining the Gondor trait just means they have one additional trait.  So if you put it on Gimli he would be Dwarf, Warrior, Noble, and Gondor.  Traits don't do anything themselves, but certain cards interact with traits (i.e. attach to a Dwarf hero).\n\n \n\nThe traits tell you where they are from.  The common location/race-based traits from the core set are Gondor, Rohan, Dwarf, Noldor, Silvan, and Dunedain.  Later on you get Hobbits and others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1745079","commentId":1745079,"userName":"PsychoRocka","timestamp":1440030906,"content":"Have a look at cards like Gondorian Shield and the leadership Boromir Hero. \n\nThey have abilities or effects that tie in with the Gondor trait.\n \n\nhttp://hallofbeorn.com/Cards/Details/Boromir-HoN [http://hallofbeorn.com/Cards/Details/Boromir-HoN]\n\nhttp://hallofbeorn.com/Cards/Details/Gondorian-Shield-TSF [http://hallofbeorn.com/Cards/Details/Gondorian-Shield-TSF]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1745517","commentId":1745517,"userName":"Flrbb","timestamp":1440057640,"content":"First of all lets give you a warm welcome to this great game (and to the forums, of course) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n1.\n\nAs said above enemys in staging area will not attack you (usually). First they have to engage you. This is done by moving them out of the staging area, placing them in front of you. All engaged enemys attack you. You can decide in which order. But I guess, the important question is: which enemys will engage you? Well, first of all you may chose one enemy to engage, after that each enemy whose engament cost is lower than your threat will engage you.\n\n2.\n\nOn the card itself is a writen text which elaborates the meaning of X. If you have to value that X without playing the card itself, then X is treaten as 0.\n\n3.\n\nGame-wise traits are keywords which can triger certain other things, e.g. allowing you to attach certain cards to your characters.\n\n4.\n\nRead the books, watch the movies. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] And, basically the traits gives hints about that question of yours."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1745727","commentId":1745727,"userName":"jnicol","timestamp":1440073350,"content":"In the core set For Gondor! is a card that has synergy with the Gondor trait:\n\n \n\nhttp://hallofbeorn.com/Cards/Details/For-Gondor-Core [http://hallofbeorn.com/Cards/Details/For-Gondor-Core]\n\n \n\nSo for instance if you attach Steward of Gondor to a hero, which I think is the card you've described, then you can play For Gondor! to give that hero both an attack and a defence boost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1747922","commentId":1747922,"userName":"Fewzz","timestamp":1440176233,"content":"Thankyou for the answers, much appreciated.\n\n \n\nAbout the cards with the X cost, i still dont follow all of them, for example:\n\n \n\nGandalfs Search\n\nCard cost X\n\nAction:\n\nLook at the top X cards of any players deck, add 1 of those cards to its owners hand and return the rest to the top of the deck in any order.\n\n \n\nSo how much does the card cost to use?\n\nHow many cards am I allowed to look at , it just says X."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1747927","commentId":1747927,"userName":"CJMatos","timestamp":1440176411,"content":"In the case of Gandalf's Search [http://hallofbeorn.com/Cards/Details/Gandalfs-Search-Core] the cost of X is the number of cards you look...\n\n \n\n \n\nMeaning you can see as many cards as Lore resources you have...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1747935","commentId":1747935,"userName":"Teamjimby","timestamp":1440176742,"content":"Most of the cards that cost X let you choose how much you want to spend.  So with Gandalf's search, you get to choose how many cards you want to look at and how many resources you want to spend.\n\n \n\nThe other common card is Stand and Fight, where X is determined by the ally you want to bring back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1747936","commentId":1747936,"userName":"DukeWellington","timestamp":1440176769,"content":"So, if you spend 5 resources then X is 5. If you spend 3 then X is 3. It is up to you. That is the point of using X."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1747953","commentId":1747953,"userName":"Fewzz","timestamp":1440177486,"content":"Oh i see thanks, im now off to learn some more, i am sure more questions will arise, man its a tough game lol. Another thing I am trying to get my head around is when a card is single use or not, how do I know if to discard a card after use etc.\n\n \n\nOH and how many cards should I have in a player deck, is it 50 max?\n\nEdited August 21, 2015 by Fewzz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1748235","commentId":1748235,"userName":"entMoot","timestamp":1440188259,"content":"Welcome to the game!\n\n \n\nEvents are the player cards that are single use by default. You play their action or response, follow its instructions and then discard the event.\n\n \n\nAllies and attachments stay in play unless a card tells you otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1748307","commentId":1748307,"userName":"Julia","timestamp":1440190903,"content":"> OH and how many cards should I have in a player deck, is it 50 max?\n\n \n\n50 (+ the heroes) is the minimum for organized play: you can have thicker decks, if you wish, but the more cards you add, the more difficult will be to trigger specific combos (you dilute the odds)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1748389","commentId":1748389,"userName":"jnicol","timestamp":1440193562,"content":"> OH and how many cards should I have in a player deck, is it 50 max?\n\n \n\nIf you're just playing with only the core set then you may struggle to build a decent 50 card deck, and might have to add some rubbish cards to pad it out. For this reason I played 30-40 card decks until I had some adventure packs to bolster my card pool.\n\n \n\n50 is the minimum for a tournament deck, but for casual play such a restriction doesn't exist - the prebuilt mono-sphere decks that come in the core box are 30 cards, for instance. Once your card pool grows then you can work your way up to a 50 card deck, which is what most people play.\n\n \n\nCheck out page 27 of the rule book for further information about customizing your player deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185589-silly-questions-but/?do=findComment&comment=1750977","commentId":1750977,"userName":"alexbobspoons","timestamp":1440369218,"content":"And just to add to others posts above, theres nothing to stop you having a 100 card deck... BUT if you did, then the likelihood of you managing to draw out your favourite cards right when you need them goes really down! So although you can have as many as you like, most people tend to stick at around 50 once they have designed a specific deck (I struggle leaving out some cards so my decks have all been 53-56 cards).\n\nI tended to find I had no idea on deck building at first, but then after quite a few plays with the different core decks (getting familiar with the cards) I started to find myself thinking \"hey that card from the lore-sphere would have gotten me out of that mess) and then as I moved on to other adventures I had a few play-throughs first to see what the quest was like, then I sat back and thought \"what was difficult in the quest? Which cards did I not really need to use? What did I really need much more of (eg questing, combat etc) then I would take my basic deck, tweak it by removing some cards and adding others etc, then have another play and see how it goes.\n\nSo I knew nothing about deck building, but just gradual re-playing got me used to the cards enough to get by in my own way :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] so that difficulty aspect you do get to master in time, keep at it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nWelcome to probably the best game I have played in pretty much 30 years of gaming. Hope you enjoy it as much as me!!"}]}