{"url":"https://community.fantasyflightgames.com/topic/185717-confused-engager/","title":"Confused Engager","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1746824","commentId":1746824,"userName":"SamNotWise","timestamp":1440113983,"content":"I'm playing solo and I'm confused on when a player \"...may choose to engage an enemy in the staging area\". Here is my situation. I have three enemies, two enemies with a threat of 30 and one with the threat of 25, and my threat level is 26. I want to engage one of the enemies in the staging area with a threat of 30. If I choose to engage that enemy even though their threat counter is lower than my threat level...\n\n \n\n1) Do they attack me?\n\n \n\n2) If they do not attack me, can I attack them?\n\n \n\n3) At the refresh stage do they go back to the staging area?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1747673","commentId":1747673,"userName":"PocketWraith","timestamp":1440167714,"content":"Firstly, just a clarification, the 30 and 25 are the enemies' engagement costs, not their threats. Threat contributes against your willpower during questing, engagement cost compares to your threat for engagement checks..\n\nIn the Encounter phase each player can make one optional engagement. You could use this to engage any of the 3 enemies. If you use your optional engagement to engage one of the 30 EC enemies, or if you choose not to use your optional engagement, then the 25 EC enemy will also engage you naturally when you make engagement checks.\n\n \n\nAll engaged enemies attack the engaged player during combat.\n\nAfter all enemy attacks have been resolved, you can declare attacks on any and all enemies engaged with you.\n\nEngaged enemies do not return to the staging area unless a player or encounter card effect causes them to do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1748065","commentId":1748065,"userName":"SamNotWise","timestamp":1440182258,"content":"So essentially choosing to engage an enemy in a staging area is just another way to not just engage an enemy but to pull threat from the staging area.\n\n \n\nAlso, if I choose to engage a 30EC enemy when my threat is 25, will they engage with me even though my threat counter is not at 30 or higher?\n\nEdited August 21, 2015 by SamNotWise"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1748226","commentId":1748226,"userName":"CJMatos","timestamp":1440187972,"content":"If you choose to engage an enemy, your threat doesn't count... that enemy will engage you...\n\n \n\n \n\n \n\nIn the case you describe at the opening post:\n\n \n\nIf you optionaly engage a 30EC enemy, you will have to face 2 enemies on combat, because the one with 25EC will engage due to your threat being equal/higher than his EC.\n\n \n\n \n\nSo, yes, optionally engaging is a way to remove threat from staging area..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1748304","commentId":1748304,"userName":"Julia","timestamp":1440190791,"content":"It's enough that you follow a simple flowchart\n\n \n\n- you check the engagement costs of enemies in the staging area (in your example, 30, 30, 25)\n\n- all the enemies whose engagement cost is equal to or lower than your threat level, will engage you automatically\n\n- before this engagement happens, you're given a chance to optionally engage one enemy\n\n \n\nDuring the \"optional\" engagement, you may call any one of the enemies in the staging area to you, regardless of their engagement cost. This means in your example that you may optionally engage one of the \"30\" enemies or the \"25\" enemy. After that, you must check for engagement against the other enemies.\n\n \n\nAfter you're done with optional engagement and engagement checks, to all the enemies that are engaged with you are dealt shadow cards and their attacks are resolved. This number of enemies includes:\n\na) enemies engaged during a previous round that you weren't able to kill (and so they are still engaged with you)\n\nb) the enemy you optionally engaged this round\n\nc) all enemies that engaged you this round because of their engagement costs being lower than (or equal to) your threat level"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185717-confused-engager/?do=findComment&comment=1748454","commentId":1748454,"userName":"SamNotWise","timestamp":1440195938,"content":"Thanks everyone for the help! I was playing a quest in the core set last night and that hit me as something I've never done before."}]}