{"url":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/","title":"Sleeping Sentry Shadow Card WTF!!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749520","commentId":1749520,"userName":"alexbobspoons","timestamp":1440271954,"content":"So (road to rivindell)\n\nThe shadow effect says \"defending player must discard all exhausted characters he controls\"\n\nNot \"heroes\" or \"allies\" but \"characters\" which as far as I know means heroes plus charachters.\n\nSo in one turn I just lost 3 heroes and 3 allues (including Arwen) and lost the game in one card turn despite doing really well.\n\nIs this right? Is that card so powerfull???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749561","commentId":1749561,"userName":"Authraw","timestamp":1440274361,"content":"Yeah, Sleeping Sentry is infamous for being really unfair. It's a really poorly designed card, because you have to know it's there and plan around it. It makes the game really swingy.\n\n \n\nThat doesn't happen too often after you get out of the Dwarrodelf cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749571","commentId":1749571,"userName":"alexbobspoons","timestamp":1440274748,"content":"Thanks.. shocking!\n\nIf you dont have shadow-cancel then you either risk it, or only commit/exhaust half your force every turn. Eek.\n\nReally does seem overpowered if it comes up as shadow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749583","commentId":1749583,"userName":"DukeWellington","timestamp":1440275517,"content":"Skrying is very important in that quest and in the next one, because of similar effects. There are only 2 copies and if you see them coming they can be dodged easily. I prefer not to think of them ad unfair but as cards that encourage a different deckbuilding style. That is why I am a big fan personally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749643","commentId":1749643,"userName":"Ecthelion III","timestamp":1440278382,"content":"> That doesn't happen too often after you get out of the Dwarrodelf cycle.\n\n[cough] Master's Malice [cough]\n\n(http://hallofbeorn.com/Cards/Details/The-Master%27s-Malice-HoN [http://hallofbeorn.com/Cards/Details/The-Master%27s-Malice-HoN])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749723","commentId":1749723,"userName":"PocketWraith","timestamp":1440282124,"content":"To quote myself on Warden of Arnor: \"It’s pretty much the mother, father and any other family member you care to name of cancel-or-die cards, and the prospect of it really kind of spoils the quest for me.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1749740","commentId":1749740,"userName":"alexbobspoons","timestamp":1440283067,"content":"I must admit, in my first two games it went past without being a shadow card, and i dont tend to read ahead, so its first pop up as a shadow was a heck of a surprise :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750077","commentId":1750077,"userName":"Seastan","timestamp":1440302386,"content":"They had to release a card like this early in the life of the game, so that now they can throw horrible shadow effects at us and we just say, \"Well, at least it isn't Sleeping Sentry.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750166","commentId":1750166,"userName":"GrandSpleen","timestamp":1440308876,"content":"No single card should shape your deck... the developers have learned this by now, and more recent quests encourage you to deckbuild based upon the flavor of that quest, instead of one single card within its encounter set"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750337","commentId":1750337,"userName":"Glaurung","timestamp":1440327565,"content":"Im not agree Sleeping Sentry is poor desgned card… .\n\nThat idea of this quest.. They wonna still Arwen. So if you fell a sleep they will kill everyone and kidnapped her. In nightmare mode is even more difficult! I like this quedt, you must manage enemies which engaged with you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750388","commentId":1750388,"userName":"Olorin93","timestamp":1440332220,"content":"Road to Rivendell is one of my favourite quests, but we exclusively play it in easy mode as an ill-timed Sleeping Sentry can cost you the game for no good reason. My group really play for the atmosphere and cooperative features and not for reading up on the metagame and tailoring their decks to stand a better chance of winning. A poorly designed card like this is different from an all-round tough scenario - we beat A Knife in the Dark in standard mode recently and that was simply tough in itself. The quest let us make decisions and we never felt any particular effect was unbalanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750498","commentId":1750498,"userName":"alexbobspoons","timestamp":1440340461,"content":"Now i kniw the card is there and have planned for it i am really getting into this scenario :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEven planning to cancel the sentry doesnt always work though because of that birdy card that stops any cancelling :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1750747","commentId":1750747,"userName":"Lecitadin","timestamp":1440358443,"content":"That's why I have so much hesitation to build decks for nightmare or tough regular quests that don't include Spirit, to cancel such harsh cards. And if you draw such a card and don,t have Test of Will at hand, well... you're done!\n\nThe only other way to deal with such cards is with Lore (Denethor, Scout ahead, etc.)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1752031","commentId":1752031,"userName":"cmabr002","timestamp":1440425615,"content":"> No single card should shape your deck...\n\nPersonally, I think it is fine if a single card forces your deck.  A lot of players, myself included, enjoy the challenge of having to build a specific deck to achieve a high win rate.  There are different challenges when it comes to terms with deck-building but making a deck to combat one card in order to achieve a high win rate is enjoyable even if the deck you created would get stomped on by most other scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1752508","commentId":1752508,"userName":"GrandSpleen","timestamp":1440441614,"content":"This is not an argument against scenario-specific deckbuilding.  I was converted into that camp long ago.  Disliking Sleeping Sentry is a very different thing from disliking scenario-specific deckbuilding (and I'll repeat: I enjoy deckbuilding).\n\n \n\nA quest is so much more flavorful and enjoyable if the 'meta' of that scenario is established by a variety of cards instead of one single card.  Look at The Wastes of Eriador, for example.  In that quest you are generally prevented from making progress by 1) the Night objective, 2) a treachery that forces you onto Night, 3) painful sidequests and a treachery forcing you to change quest cards, 4) enemies retreating to the staging area (more threat during the quest phase).... It's not one single card that sets the flavor for the whole game.  Road to Rivendell is a fairly vanilla scenario with one evil card.  Yes, there are a couple more hard cards as well, but their power level or impact on your approach to the quest is not on par with of Sleeping Sentry.\n\n \n\nIf we take the design approach of Sleeping Sentry and put it on Wastes of Eriador, you can do this: remove the Day/Night objective, remove sidequests, remove some threat in the staging area (enemies retreating, for example), and then do something like this: add one treachery that says \"When Revealed: Raise each player's threat by 5 and remove all progress from the quest.  No progress may be placed on the quest for the remainder of the round.\"\n\n \n\nThat way, it becomes an easy, vanilla scenario and you can deal with it by building a scry & cancellation deck that removes or otherwise circumvents that one card.  Which is what you do with RtR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185897-sleeping-sentry-shadow-card-wtf/?do=findComment&comment=1752543","commentId":1752543,"userName":"cmabr002","timestamp":1440442493,"content":"I suppose I like all aspects of deck-building equally and don't see anything wrong with a deck being about one card.  The way I see it is that there are three types of deck-building.  They all provide different challenges and different cards are useful in their own ways depending on which deck-building goal you are trying to achieve.\n\n \n\n1.  Deck-building for success against a large percentage of scenarios with a single deck.\n\n \n\n2.  Deck-building to deal with multiple and/or simultaneous threats (in the case that you mention).\n\n \n\n3.  Deck-building to deal with a single threat.\n\n \n\nGranted, this is very generalized, but most of the time when building a deck I can see it falling into one of these categories (I suppose there is thematic too).\n\nEdited August 24, 2015 by cmabr002"}]}