{"url":"https://community.fantasyflightgames.com/topic/185948-wild-bear-in-road-to-rivindell/","title":"wild bear in road to rivindell","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185948-wild-bear-in-road-to-rivindell/?do=findComment&comment=1750514","commentId":1750514,"userName":"alexbobspoons","timestamp":1440341312,"content":"SO\n\nIt says after wild bear engages a player it makes an immediate attack.\n\nSo far it has always ambushed me, so the thing makes an immediate attack during the quest/staging phase then later as its already engaged it gets to attack again during the combat phase.\n\nThats how Ive played it.\n\nJust now, i am about to selectively engage it. So my thinking is it then gets its immediate attack during encounter phase then straight after gets another attack during combat phase (harsh).\n\nAm I playing it right or should enemies only attack once per whole-turn? Its not as if the exhaust like good guys do..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185948-wild-bear-in-road-to-rivindell/?do=findComment&comment=1750581","commentId":1750581,"userName":"entMoot","timestamp":1440346553,"content":"You have been playing it right. Enemies always get their attack during combat even if they got to attack earlier in the turn from some other effect.\n\n \n\nFor whatever reason, immediate attacks like the Bear frustrate me more than additional attacks from shadow cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185948-wild-bear-in-road-to-rivindell/?do=findComment&comment=1750950","commentId":1750950,"userName":"alexbobspoons","timestamp":1440368244,"content":"Thanks entmoot i thought i was right but wanted to check i hadnt been making it too hard un-necessarily. To be fair to the bear, it only has 2attack, so compared to others in the deck is a light hitter so doubling up on its attack to represent the fact its no kitten isnt too bad. I imagine this mechanic happening with a harder hitter it not quite so nice though.\n\nChump blockers and feints to the rescue!!"}]}