{"url":"https://community.fantasyflightgames.com/topic/185910-2015-fellowship-event-deck-builds/","title":"2015 Fellowship Event Deck builds","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/185910-2015-fellowship-event-deck-builds/?do=findComment&comment=1749892","commentId":1749892,"userName":"BigDaddyW","timestamp":1440293532,"content":"I'm new to the game and was wondering what some of the deck builds will be for this event. I have the core set and all the way up to Assault on Osgiliath. I'm still working on core adventures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185910-2015-fellowship-event-deck-builds/?do=findComment&comment=1752142","commentId":1752142,"userName":"Raven1015","timestamp":1440429670,"content":"Usually, it's a bit difficult to deck build for these types of events, because A) we don't know exactly what is coming and B) these special event quests tend to be specialized. Generally, I just try to hit as many areas of the game as possible (if you're playing with others, you can plan together so that combat, questing, location control, treachery cancellation, thread reduction, etc. is covered) and try to build a deck that is pretty balanced so that hopefully it can adapt to whatever arises."},{"commentUrl":"https://community.fantasyflightgames.com/topic/185910-2015-fellowship-event-deck-builds/?do=findComment&comment=1752666","commentId":1752666,"userName":"Rob_Oz","timestamp":1440446669,"content":"Welcome to the LOTR:LCG community!\n\n \n\nOne deck-building issue to consider for the Fellowship Event is your heroes. When attending a public event like this, you often don't know who you will be playing with unless you attend with a pre-made group. As a result it's usually a good idea to have some contingencies for your hero choices, as it's pretty easy to duplicate heroes (and unique allies, come to think of it). So you might want to think about the following:\n\n \n\n1) Make multiple decks that use different heroes. This is probably the best option as it should provide you the flexibility to adapt to other players' hero choices pretty easily. Keep in mind, however, that if all your decks tend to use the popular heroes (Glorfindel, Elrond, Aragorn, Gandalf, Treebeard, Boromir, etc) you'll probably still conflict with other players' heroes.\n\n2) Design a deck (or decks) that can interchange some or all of its heroes for others. Not altogether easy, but usually do-able for most decks. Not really workable with decks built to support a particular trait, however (i.e. Hobbits, Gondor, Rohan, etc.)\n\n3) Make a deck that utilizes less popular heroes to help avoid overlap with other players. Easier said than done, but it can be a rewarding way to play, as your fellow players will probably enjoy seeing the heroes and the deck in action.\n\n \n\nSome of our forum members are pretty frequent convention-goers, so they may have some good suggestions about how they handle this matter.\n\n \n\nThe goal of all this is to save time at the Fellowship Event so you can get into playing the quest as quickly as possible.\n\nEdited August 24, 2015 by RobOz"}]}