{"url":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/","title":"The Hunt for Gollum - moving from Stage 1 to Stage 2","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1755476","commentId":1755476,"userName":"Julia","timestamp":1440541995,"content":"The first stage special rules read:\n\n \n\nForced: After the players quest successfully, the first player looks at the top 3 cards of the encounter deck. Reveal and add 1 of those cards to the staging area, and discard the other 2 cards.\n\n \n\nI was wondering what's the exact time trigger for the Forced effect. Specifically, let's say I successfully quest and complete this Stage of the adventure; should I resolve the Forced effect even in this case, or, the successfull questing resulted in this stage to be discarded before Forced is triggered? I always played you have to resolve the Forced before discarding Stage 1 and moving to Stage 2, but it'd be nice to be sure I'm playing right. Or wrong :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nThanks for help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1755644","commentId":1755644,"userName":"awp832","timestamp":1440547640,"content":"I agree with you,  first you determine if the quest is successful,  then you place progress on the active location, then the quest stage (clearing it).  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1756530","commentId":1756530,"userName":"jnicol","timestamp":1440592569,"content":"You're playing it correctly. From the FAQ:\n\n \n\n> (1.24) Questing Successfully\n> Questing successfully and the physical placement of progress tokens are two separate game occurrences that happen in sequence during the Quest Resolution step. As soon as the players determine that the total committed Willpower is greater than the total Threat in the staging area, they are considered to have quested successfully. Any Forced or passive effects initiated by questing successfully resolve before physically placing progress tokens.\n> Example: Tom has just successfully quested during stage 1B of The Hunt Begins (SoM 11), and he will be placing enough progress to advance to the next stage. However, he must first resolve the Forced effect (which resolves immediately upon the occurence of “questing succesfully”) before placing progress tokens on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1756596","commentId":1756596,"userName":"ppsantos","timestamp":1440595367,"content":"So, after determining that players have quested successfully, but before placing the progress tokens, you have to resolve the Forced trigger. If the Forced trigger adds, say a location or kills one questing ally, having determined that players have \"successfully quested\", yo don't recalculate the total willpower of the committed characters, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1756912","commentId":1756912,"userName":"CJMatos","timestamp":1440604947,"content":"Exactly ppsantos... Once determined that have quest sucessfully (or unsucessfully) any changes on the staging area won't affect that result."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186172-the-hunt-for-gollum-moving-from-stage-1-to-stage-2/?do=findComment&comment=1757040","commentId":1757040,"userName":"Julia","timestamp":1440608093,"content":"Thank you all guys!"}]}