{"url":"https://community.fantasyflightgames.com/topic/186368-the-wastes-of-eriador-progress-on-active-location/","title":"The Wastes of Eriador - Progress on active Location","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186368-the-wastes-of-eriador-progress-on-active-location/?do=findComment&comment=1759157","commentId":1759157,"userName":"nemesismartyn","timestamp":1440699945,"content":"Hey there!\nI got some questions about The Wastes of Eriador.\n\n \n\nThe first one is: The Night-Objective states \"Progress cannot be placed quest cards\". Am I able to get rid of the active Location while questing at Night? Am I able to get rid of the active Location during the combat phase by killing an enemy(or by Legolas)? I am unsure, because the Manual says, that Progress always is put on the quest-card(and has to be put on an active location, if there is one). But since we cant place progress, does it mean we cannot clear the active location during night?\n \n\nThe second questing is kind of similar. The Location Eriador Wastes says \"While Eriador Wastes is in the staging area, no more than 5 progress can be placed on the current quest each round.\". so while i have an active location , e.g. Eriador Wastes and another copy of it in the staging Area. Can i only get 5 Progress tokens to explore Eriador Wastes, or can i get rid of the active location PLUS 5 progress tokens on the current active quest-card?\n \n\n \n\nWould be glad for some clarification. BTW, this quest is really awesome and so hard to beat. Since Morgul Vale i never had such a hard time beating a quest!\nBest Regards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186368-the-wastes-of-eriador-progress-on-active-location/?do=findComment&comment=1759210","commentId":1759210,"userName":"Mndela","timestamp":1440701562,"content":"My opinion:\n\n \n\n1. When it is night you can't place any resource token in any quest card (including side-quest cards), any effect can't do it in any moment.\n\n2. When that location is in staging, you only can place 5 tokens as much in the quest card, despite the active location. You first explore location, and after, if you have more wp you place up to 5 progrss tokens on the quest card, no more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186368-the-wastes-of-eriador-progress-on-active-location/?do=findComment&comment=1759604","commentId":1759604,"userName":"PsychoRocka","timestamp":1440715275,"content":"You can place progress on and explore the active location during night, you just cannot place progress on QUEST cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186368-the-wastes-of-eriador-progress-on-active-location/?do=findComment&comment=1760011","commentId":1760011,"userName":"GrandSpleen","timestamp":1440737232,"content":"Yeah, placing progress placed on a location is not progress placed on the quest card.  So the Night and Eriador Wastes limitations have no bearing on progress placed on locations."}]}