{"url":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/","title":"Gildor&#039;s Counsel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1759446","commentId":1759446,"userName":"midwestborn86","timestamp":1440708901,"content":"Does Gildor's Counsel reduce all card reveals by 1 (to a minimum of one) for the entire quest phase or just staging. For example say in a 2 player game I play Gildor's Counsel. 1 card is revealed instead of 2. Then enough progress is made to advance to the next quest card. The next quest card reads \"when revealed: reveal one card per player\" it is technically still the quest phase so would those 2 cards be reduced by 1 as well?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1759516","commentId":1759516,"userName":"DukeWellington","timestamp":1440711780,"content":"It doesn't actually matter because the reduction has already occured. The card doesn't say \"whenever you reveal cards per player reduce that amount\" so there is no reason to think the reduction would occur in multiple instances."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1759608","commentId":1759608,"userName":"PsychoRocka","timestamp":1440715387,"content":"Yep only triggers the once during staging. Still a very nice card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1759649","commentId":1759649,"userName":"midwestborn86","timestamp":1440717312,"content":"I never understood why this card gets hate. I find 2 players is its sweet spot. In particularly nasty encounter decks I would much rather reveal one card rather than 2 and pay for this rather than a 3 cost 2wp ally especially if you are running secrecy lore and have prepared the encounter deck with risk some light or Denethor giving you a breather turn if you know something tame is coming. Or even subsequent early turns if you have a trap ready and waiting\n\nEdited August 27, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1759693","commentId":1759693,"userName":"PsychoRocka","timestamp":1440719005,"content":"2 player is definitely the sweet spot. I use it two handed to great effect. Completely shuts down the encounter deck for a turn nine times out of ten and allows you to amass forces/finish off nasty enemies still engaged with players etc.\n\nGoes amazingly with a Ranger Spikes sitting in staging.\n\nThe amount of times I have avoided a nasty treachery or enemy and had it appear as a shadow card instead thanks to this card is pretty **** high"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1760019","commentId":1760019,"userName":"midwestborn86","timestamp":1440737730,"content":"It's great for those slow burn quests that give you a round or a little while to build up like Lonely Mountain and Weather Hills. It's awesome when the only card you turn over is like a 1 threat location or the sprung trap for the enemy like you said or a situational treachery that doesn't effect you. Basically a free round\n\n \n\nYep I'm also a firm believer that 2 players or 3 at most is the sweet spot for this game in general. All the quests seemed to be balanced for 2. Flipping over 4 cards a turn + surges is just to much to keep track of. I wouldn't be opposed to playing with more. But with 4 players I'd rather play a big board game or something. Lord of the Rings seems to have two of the greatest two player games. This and War of the Ring\n\n \n\nAlso Pippen + good meal = now it costs 1. Get it out with a Lore Ent for next round\n\nEdited August 28, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761327","commentId":1761327,"userName":"Seastan","timestamp":1440792371,"content":"I like to think of it this way: You flip one card per player, so on average you should expect each player, if they are pulling their weight, to make up for the effects of one encounter card per turn. Just by playing Gildor's Counsel you've done your expected duty, and anything else is just extra.\n\n \n\nAnd it's always great when you find out the card you prevented from coming up was something nasty like a Hill troll and he gets discarded as a shadow card during combat. You've just done the equivalent of cancelling his threat, defending against him, and killing him :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761876","commentId":1761876,"userName":"ppsantos","timestamp":1440816616,"content":"For Hill troll to get discarded as a shadow card, requires an engaged enemy.  What if there's no engaged enemy?  Then Gildor's counsel just delayed the Hill Troll's appearance for another turn and for what?  For 3 Lore resources and 1 lore card.  Too expensive for my taste.\n\n \n\nWhat if the card that GC postponed was \"Despair\" (remove 4 progress tokens) and it gets dealt as shadow card (defending character does not count its defense)?  The advantage of using GC varies too much.\n\n \n\nI think GC is too expensive for what it does.  It kind of postpones the staging of next card to next round without knowing what it is you are postponing but at a cost of a card and 3 Lore resources which in a lore sphere is scarce indeed.  The other cost of CG as a card is its 'opportunity cost' -- a better card could be put in instead of GC in the deck.  Let's compare GC with \"Rumour From the Earth\" (look at top card of encounter deck for 0 lore, pay 1 lore resource to return RFTE to hand).  What would you rather have: know what the next round's encounter card will be and get ready for it for 0 lore resource (doing it at end of round) or postpone that card for 3 lore resource?  \n\nEdited August 29, 2015 by ppsantos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761891","commentId":1761891,"userName":"PsychoRocka","timestamp":1440817398,"content":"Would rather GC all day every day. Rumour doesn't stop the card it just shows you what it is. Even if GC simply delays a card that is still a whole extra round to prepare and build your forces."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761896","commentId":1761896,"userName":"PsychoRocka","timestamp":1440817533,"content":"Also in two player/two handed the majority of the time there will be at least one enemy engaged with someone on any given turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761955","commentId":1761955,"userName":"Seastan","timestamp":1440821124,"content":"Don't think of it as postponing... that makes it sound like next turn you're going to flip an extra card to make up for it. What you are actually doing is reducing the total number of encounter cards being revealed throughout the game by 1. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1761959","commentId":1761959,"userName":"ppsantos","timestamp":1440821401,"content":"> Would rather GC all day every day. Rumour doesn't stop the card it just shows you what it is. Even if GC simply delays a card that is still a whole extra round to prepare and build your forces.\n\nBut GC also does not stop the card; GC could end up just postponing it.  And for scenarios that requires you to look for an objective card in the encounter deck, that 'one less card' might not be so good after all.  And RFTE can, if you do it, say during refresh, give you a round to know and prepare accordingly and build your forces for 0 lore.\n\n \n\nI'm not arguing that RFTE is better than GC.  It's just an example I've picked for the argument that there might be a better card to include.  Bottomline argument for me, GC is too expensive (3 lore).  If it cost 2 lore, maybe.  Just couldn't spare 3 lore for it, instead of playing an ally, or something else.\n\n \n\nI suppose this is the beauty of the game -- players can value the card differently.\n\nEdited August 29, 2015 by ppsantos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=1762006","commentId":1762006,"userName":"Teamjimby","timestamp":1440825013,"content":"I think it's a perfectly balanced card.  Each player gets 1 card and 3 resources per turn, and the encounter deck throws 1 card at you per turn.  So you are effectively trading one turn of assets for one turn of cancellation/prevention.  Of course when you have extra card draw or resource generation, you are trading less than one turn of assets.\n\n \n\nI think it's marginal in most decks, but can be very useful in, for example, a hobbit secrecy deck that has resourceful/leaf brooch/good meal and extra card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=3294278","commentId":3294278,"userName":"Boromore","timestamp":1524490287,"content":"Hi. Can I use Gildor's Counsel in a 1-player game to effectively cancel a surge effect? I realise I'd still have to stage at least one card, as per minimum..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=3294318","commentId":3294318,"userName":"GrandSpleen","timestamp":1524491993,"content":"No, you'll still have to resolve Surge.  You reveal your 1 card, then resolve it fully, which would include Surge if it's there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186388-gildors-counsel/?do=findComment&comment=3665728","commentId":3665728,"userName":"sappidus","timestamp":1554214380,"content":"> On 4/23/2018 at 9:31 AM, Boromore said:\n> \n> Hi. Can I use Gildor's Counsel in a 1-player game to effectively cancel a surge effect? I realise I'd still have to stage at least one card, as per minimum...\n\nNot that this was really in doubt, but @GrandSpleen [https://community.fantasyflightgames.com/profile/177891-grandspleen/] was correct:\n\n\n\n> [Gildor’s Counsel] will not prevent the surge keyword from triggering and being resolved.\n> \n> Cheers, Caleb\n\n"}]}