{"url":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/","title":"Lorien Guide&#039;s modern life","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762718","commentId":1762718,"userName":"John Constantine","timestamp":1440875275,"content":"Hello. This card was recently brought up, and it made me think about the current state of it.\n\n \n\nlorien-guide-core.jpg [http://www.cardgamedb.com/forums/uploads/lotr/lorien-guide-core.jpg]\n\n \n\nWhat do you think? Do you use him? Is he worth it?\n\n \n\nTo me, it seems, even with modern Silvan stuff going on, he costs 1 more resource than he should. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762723","commentId":1762723,"userName":"Pharmboys2013","timestamp":1440875596,"content":"Yea just not up to snuff compared to the other allies available now days. If it cost 2, or kept the 3 cost but had 2 will power, would be a much more usable card. Maybe the new noldor steed will inspire some more location control decks that people will try revisiting this card in"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762728","commentId":1762728,"userName":"Gizlivadi","timestamp":1440875761,"content":"Even though his cost is rather high and his stats are not impressive, I still run 2 of him in my silvan deck. Celeborn and Galadriel make him more worthwhile, and his ability usually comes in handy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762760","commentId":1762760,"userName":"Noccus","timestamp":1440877567,"content":"Ok, until I took a closer look at the picture posted above I always thought this he was a she.\n\n \n\nAnd that's years & years... o_0"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762778","commentId":1762778,"userName":"Gizlivadi","timestamp":1440878016,"content":"Well, I think it's fairly ambiguous. I just said he out of custom."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762860","commentId":1762860,"userName":"narubianHorror293","timestamp":1440881896,"content":"Yeah, haven't used him in a while. More willpower for a lower cost is almost always a better deal, I think. I haven't revisited old quests, so maybe there are cases there where he's useful. And I guess that in a Spirit-Leadership only Silvan deck you might actually find a spot for him, as he can quest and attack for 2 in the first round, and should cost you only 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1762869","commentId":1762869,"userName":"awp832","timestamp":1440882152,"content":"so glad you brought this up!   I recently had a change of heart about this card.   I am now running 3 copies.   This card is really good, it is serving me well.  3 cost does seem a bit high at first,  but Lorien guide isn't an ally you're going to be bouncing in and out of play,  just pay, play, and leave it there.  There are 2 main reasons why I think this card is worth the 3 cost.  \n\n1.  1 progress and 1 WP is sometimes better than 2 WP.   I am not saying it always is.   In fact, most of the time they are about equivalent.   On occasion (no active location, active location immune to player card effects) it is worse.  However sometimes 1 progress and 1 WP is way better,  because you can clear the active location without actually needing to win the quest.  Essentially,  if you are getting Location Locked,  then Lorien guide can help dig you out of the hole by allowing you to lose the quest, still clear the active location, and travel.  It can save you in games you would otherwise lose.  The more copies you have in play, the greater this effect.\n\n2.     2 hit points.  2 hp is a big deal.  2 hp on a non-unique Silvan ally is pretty rare actually, so you don't get a chance to have 2 hp characters too often.  It's worth paying for.  This character is not instantly slain by all those cards like the Necromancer's Reach, or Blocking Wargs, or the Biting Wind, etc.  That is like a major thing.   With 1 Silvan Tracker,  this card gets real good.  You can absorb archery for days.  It's so good.  And again, the more you have out, the greater the effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763253","commentId":1763253,"userName":"Pharmboys2013","timestamp":1440903130,"content":"awp832: appreciate your detail and reasons why you find it valuable. In some silvan builds I can see it being a possible include and advantageous. Looking at some other 3 cost spirit allies with similar stats though, and I just doing think the guide stacks up unless in a silvan archetype:\n\nEomund: has the \"most of the time, equivalent\" 2 WP, 2 HP, and if you are running any other Rohan characters, a better play. Is unique tho\n\nBofur: Not that you are ever paying the 3 resources for him, but for comparisons sake, 2WP, 3 HP (advantage) plus still his main effect. once again unique which is I guess is a draw back since there cant be multiple copies in play\n\nRider of the Mark: 2WP, 2HP, can cancel at least 1 shadow in multiplayer, multiple if more than one player has spirit, in solo, this and Lorien guide would be just about equal.\n\nPelargir Shipwright: 0 Base WP....but c'mon if you're running 3 cost spirit allies...you probably have at least 2 spirit heroes. 3 HP (advantage). So if you are running 2 or especially 3 spirit heroes, advantage shipwright\n\nGreyflood Wanderer: 2WP, 2 HP, has the doomed ability, if you want to use, advantage wanderer otherwise equivalent\n\nCelduin Traveler: 2WP, 2 HP, can be played for 1 cost in secrecy and can discard a location from top (which may not be ideal since generally locations are most benign encounter cards). A relatively close equivalent, but the Traveler still has more going for it overall\n\nEdited August 30, 2015 by Pharmboys2013"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763429","commentId":1763429,"userName":"Iron Lung","timestamp":1440917618,"content":"I feel like both him and the northern tracker were better cards before the more recent expansions. Many locations are now immune to player card effects or treacheries will slow the amount of progress applied.\n\nEven at their higher costs their abilities were pretty good. Now I tend to reevaluate their inclusion in my decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763562","commentId":1763562,"userName":"PocketWraith","timestamp":1440934946,"content":"> Bifur: Not that you are ever paying the 3 resources for him, but for comparisons sake, 2WP, 3 HP (advantage) plus still his main effect. once again unique which is I guess is a draw back since there cant be multiple copies in play\n\nYou mean Bofur?\n\n \n\n> I feel like both him and the northern tracker were better cards before the more recent expansions. Many locations are now immune to player card effects or treacheries will slow the amount of progress applied.\n> \n> Even at their higher costs their abilities were pretty good. Now I tend to reevaluate their inclusion in my decks.\n\nNorthern Tracker is still the master of location control. Immunity isn't that common."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763584","commentId":1763584,"userName":"Pharmboys2013","timestamp":1440936394,"content":"Pocketwraith: yep, Bofur. Thanks. Bad with vowels ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763585","commentId":1763585,"userName":"John Constantine","timestamp":1440936422,"content":"Let us assume for one second that LotR LCG is a digital game and developers can patch any card globally for all owners of the game. What would you prefer - bumping Lorien Guide's willpower to 2 or lowering his cost to 2?\n\nEdited August 30, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763649","commentId":1763649,"userName":"joezim007","timestamp":1440940190,"content":"I would drop attack and cost by one. That way it is more equivalent to other 2 cost Silvan allies, though to match the others even more closely they'd drop a hit point instead of the attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763680","commentId":1763680,"userName":"Bullroarer Took","timestamp":1440942795,"content":"To be consistent with modern silvans it would be two cost and the ability would be place one (or two) when entering play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763696","commentId":1763696,"userName":"John Constantine","timestamp":1440943681,"content":"Yeah, but I meant making card viable in the current game circumstances when almost all (if not all) other 3 cost spirit allies are simply better, without taking away it's core feel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763715","commentId":1763715,"userName":"Pharmboys2013","timestamp":1440944466,"content":"While making it cost 2 would make it fit better within the silvan archetype, as a whole, I think the best iteration of it would be if the willpower would be bumped to 2.  Then its practically a pseudo 3 willpower which sets it apart from the other 3 cost spirit allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763721","commentId":1763721,"userName":"John Constantine","timestamp":1440944737,"content":"I agree with you on that one. I treat his ability as a sort of 0.5 willpower :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186575-lorien-guides-modern-life/?do=findComment&comment=1763886","commentId":1763886,"userName":"narubianHorror293","timestamp":1440953085,"content":"> I agree with you on that one. I treat his ability as a sort of 0.5 willpower :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nI think this 1 progress can sometimes be stronger than 1 willpower, since it can allow you to:\n\n1. Place progress on the active location even when you fail questing. This can save you when you're location locked and the threat in the staging area grow as fast, or faster, than your total willpower.\n\n2. Explore (and discard) the active location before staging, if just one progress is missing (or more, if you have more than one Guide, and/or Asfaloth). I can think of several useful cases:\n\n * Ready Idraen before staging (but after committing to quest), enabling her to exhaust for some effect in the action window between stating and quest resolution. Just from the top of my head - ping some 1 hp enemy with Ranger Bow, removing his threat from the quest.\n * Same goes for having the cards from Ancient Mathom available for staging. Maybe it will get you that Fresh Tracks [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Long-Dark/Fresh-Tracks.png] that you need in your hand while staging happens.\n * Same goes for having the 'free' ally from Elf-stone available for staging.\n * Get the beneficial effect of some \"rewarding\" location before staging. E.g. \"Warg Lair\" enables each player to draw 1 card when it is explored - again might get you something like Fresh Tracks.\n * Avoid the de-buffing or harmful effect of some active location that may effect the quest phase. For example, The Eaves of Mirkwood [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Hunt-for-Gollum/The-Eaves-of-Mirkwood.png] stops you from cancelling encounter card effects - no A Test of Will for you! How good is it when the active location needs just one more progress to go, and then the Guide pings it off while committing, enabling to cancel some horrible treachery? Or stopping Caradhras [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Redhorn-Gate/Caradhras.png]from messing your quest stage with that -1 willpower to questing characters.\n * Prevent an almost explored location (one progress missing) from returning to the staging are when a 'push-over' location is revealed and makes himself the active location; these include Dreadful Gap [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Dreadful-Gap.png], Stock Brook [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Black-Riders/Stock-Brook.jpg], Blocked Tunnel [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Land-of-Shadow/Blocked-Tunnel.jpg], Vale of Shadows [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Stone-of-Erech/Vale-of-Shadows.png], and possibly some more in the future.\n\n \n\n> 2.     2 hit points.  2 hp is a big deal.  2 hp on a non-unique Silvan ally is pretty rare actually, so you don't get a chance to have 2 hp characters too often.  It's worth paying for.  This character is not instantly slain by all those cards like the Necromancer's Reach, or Blocking Wargs, or the Biting Wind, etc.  That is like a major thing.   With 1 Silvan Tracker,  this card gets real good.  You can absorb archery for days.  It's so good.  And again, the more you have out, the greater the effect.\n\n \n\nWow, that is a really REALLY good point. Silvan Tracker makes the difference between 1 hp Silvans and 2 hp Silvans even bigger than the usual difference between 1 and 2 hp allies - which is anyway bigger and more important than the difference between 2 and 3 hp allies and so on. With Silvan Tracker, a 2 hp Silvan is almost infinite hp, for the purposes of archery, treachery damage and blocking low attack enemies. And since we have 8 1-hp Silvan allies and only 5 2-hp ones, out of which two are unique, it gives the Guide extra merit.\n\nEdited August 30, 2015 by narubianHorror293"}]}