{"url":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/","title":"Art direction on wargs is all over the place","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1762490","commentId":1762490,"userName":"Gizlivadi","timestamp":1440863496,"content":"If I'm not mistaken, Tolkien originally thought of wargs as regular or just bigger, fiercer wolves. I am aware that in this game they have to make them look a little more fearsome since it's a fantasy setting, but to me they are just looking weirder and weirder. At first they looked like a cross between a dog and a bear with the hump, but they looked fine to me. Then in The Road Darkens they made them look more like regular wolves, but in the Wastes of Eriador things got really weird. The Northern Warg looks like a Tasmanian Tiger (even though I do like the art), but the White Warg and Pack Leader are really weird. The former's not so bad, it looks nice and ghostly, which I like, but the Pack Leader is just nuts. It doesn't look remotely canine, much less like a warg. It looks more like an undead spawn from hell, and I don't like it one bit. Seriously, who thought that removing the skin from their heads was a good idea? How do they even hunt without a nose? Not a huge fan I must say.\n\n \n\nSorry for the improvised and disjointed rant, but I wanted to make the thread quick so I can read your opinions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1762500","commentId":1762500,"userName":"John Constantine","timestamp":1440863938,"content":"I get you, but I like the diversity amongst those arts. Kinda prevents all those wargs from different sets from wearing on me. And I like a bit of mistyc here and there - I'm refferencing to a warg with skeletal nose :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1762843","commentId":1762843,"userName":"narubianHorror293","timestamp":1440880790,"content":"I agree with you. I liked the art of the old ME:TD CCG. Just scary black wolves:\n\n4d0fbd0188827_58244n.jpg [http://s.ecrater.com/stores/58244/4d0fbd0188827_58244n.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1762960","commentId":1762960,"userName":"gandalfDK","timestamp":1440885469,"content":"Wargs were not mere bigger wolves. Wargs were something more. The Wolves from the Hobbit are named wolves but actually aare Wargs. They could talk and allowed Orcs etc. to ride them, they were not ridden upon.\n\nNothing about the art, but Wargs are not your regular black/grey wolf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1762977","commentId":1762977,"userName":"Gizlivadi","timestamp":1440886636,"content":"You're right GandalfDK, totally forgot about that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1763062","commentId":1763062,"userName":"gandalfDK","timestamp":1440890116,"content":"I agree with you too that I find the depictions of Wargs differ a bit too much. I liked the idea behind the Wargs of the Dwarrowdelf, Wargs in different shapes and species etc. (although Mountain and Snow qarg are really ugly imo) and Pack Leader etc are a bit too much if you ask me. A bit more unification among the pieces of art wouldn't hurt indeed, Gizlivadi\n\nSame goes for Azogs Warg.. Albinos normally would never survive that long in a pack.. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1763066","commentId":1763066,"userName":"gandalfDK","timestamp":1440890200,"content":"Ps. I hope Matt read your thread about the magic and especially the artifacts! Maybe we'll see some of it in the Grey Havens cycle!\n\nGandalfNL ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1763889","commentId":1763889,"userName":"narubianHorror293","timestamp":1440953387,"content":"> Wargs were not mere bigger wolves. Wargs were something more. The Wolves from the Hobbit are named wolves but actually aare Wargs. They could talk and allowed Orcs etc. to ride them, they were not ridden upon.\n> \n> Nothing about the art, but Wargs are not your regular black/grey wolf.\n\n \n\nI agree that they are not your regular black/grey wolves, but I don't think any of the characteristics differentiating them from wolves should be physical, except size. Or maybe they should look a bit more vicious and bigger, sort of like 'dire' versions of D&D animals, but still basically wolves. After all, both the original Norse word 'Warg' means wolf, and the descriptions given in the books and in other materials describe them as some breed of wolves, possibly demonic.\n\n \n\nAnd I didn't care too much for the hyena-like Wargs of the movies, or the more rat-looking ones of the Hobbit movies (although I don't take these things to heart, and I enjoy seeing orcs riding terrible animals anyway).\n\n \n\nSo I'll stick to my classic-yet-larger-and-blacker look for wargs.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited August 30, 2015 by narubianHorror293"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1763961","commentId":1763961,"userName":"gandalfDK","timestamp":1440957236,"content":"Well, probably that's more a case of personal preference.\n\n \n\n\"J.R.R. Tolkien [http://tolkiengateway.net/wiki/J.R.R._Tolkien] derived the word warg from Old English [http://tolkiengateway.net/wiki/Old_English] wearg-, Old High German warg-, and Old Norse [http://tolkiengateway.net/wiki/Old_Norse] varg-r., all of these terms literally translating tostrangler, choker.\" (Tolkien Gateway) \n\nWhile Norse vargr was a common synonym for wolf, Old English wearg was used only for an outlaw or hunted criminal. \n\n \n\nIf you take a look at the Norse mythology as well,  like Fenrir, seem to have been inspiration for Wargs. This is why I think Wargs are like our Eurasian Wolf but larger in everything. I was thinking at species like Maned Wolf and even think the movie adaption ain't so bad. \n\nIf you would support the theory of Warg being a family name, like Canidae (doglikes), different breeds of Wargs are even possible and thus different takes on art. Peter Jackson seemed to do so by portraiting his Wargs in the Hobbit very different from the Isengard Wargs he created.\n\n \n\nI'll stick to: the more creatures, the better.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited August 30, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1763966","commentId":1763966,"userName":"OMZA","timestamp":1440957689,"content":"Northern warg shocked me, too. We are discovering different warg breeds, it is enjoyable such a vivid imagination."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186560-art-direction-on-wargs-is-all-over-the-place/?do=findComment&comment=1764119","commentId":1764119,"userName":"Olorin93","timestamp":1440966348,"content":"As gandalfDK brings up a linguistic aspect, I might mention that since \"varg\" is the most common word for wolf in Swedish, the translation of The Hobbit that I grew up with calls wargs \"ulvar\" to set them apart from normal Wolves - but the word is a cognate to ModE \"wolf\". The translation has had to flip it around. I haven't checked, but it's likely the Norwegian and Danish translations are the same."}]}