{"url":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/","title":"So... Staff of Lebethron, anybody?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765305","commentId":1765305,"userName":"John Constantine","timestamp":1441028876,"content":"Since the day that card was spoiled, I was kinda confused and still I am. First of all, it's Leadership, which is not big on low threat heroes (even Sam is 8). Second - it's restricted, for some reason (limit 1 per hero would be better here in my opinion). Its definetely requires multisphered deck, but the most prominent candidate for multisphereing is lore, which has burning brand, which is not even restrcited.\n\n \n\nI can definetely see how to use this card, but the way I see it - it requires too much setup/too specific deck, and is simply not worth it. Prove me wrong, please. I'm begging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765321","commentId":1765321,"userName":"l3afonthewind","timestamp":1441029564,"content":"Currently, I can really only see this card seeing play in a dedicated hobbit deck, specifically one that is packing Sam. Since the deck is going to be focused on exploiting enemies' threat cost anyway, this is a great 1x or 2x to plop on your defender (likely Sam or Spirit Frodo). In that kind of hobbit deck, the restricted slots aren't really in contention the way they are in many decks, and since hobbits have so few HP, a nasty shadow has more potential to do worse things. In just about any other deck though, I would agree that Burning Brand is better. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765325","commentId":1765325,"userName":"Lecitadin","timestamp":1441029700,"content":"I also think that in a Hobbit or secrecy deck with a good defender, it would work. Other than that, I dunno... maybe Rossiel would also be a good candidate for this staff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765326","commentId":1765326,"userName":"Teamjimby","timestamp":1441029768,"content":"At this point it might as well say \"Attach to Sam Gamgee\" because he's the only existing hero I can ever see playing it on.  You could theoretically put it on Frodo, but if you are running a low threat deck with leadership, that means Sam is in your deck.  But, as someone that plays Sam a lot, I can't wait for this card.  Repeatable shadow cancellation is amazing, and song of wisdom + burning brand is a lot of work to put on a non-lore hero.  Now with Sam if you have another leadership hero, you can play Hobbit Cloak and Staff of Lebethron on the first turn and you can safely block a 4 attack enemy.  Restricted doesn't matter for Sam because he never uses other restricted items.\n\n \n\nI'm working on a Sam showcase deck with Halbarad, Sam, and Pippin.  Eventually you can get a Hobbit Cloak, Fast Hitch, and 2 Staff of Lebethron on Sam.  Engage 2 enemies with Halbarad and Sam is blocking twice at 5 defense with shadow cancellation.  If you have extra fast hitches he can attack for 3.  Taste it Again to attack for 5. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765339","commentId":1765339,"userName":"John Constantine","timestamp":1441030329,"content":"> I also think that in a Hobbit or secrecy deck with a good defender, it would work. Other than that, I dunno... maybe Rossiel would also be a good candidate for this staff.\n\nRossiel is nor Hobbit, neither Gondor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765404","commentId":1765404,"userName":"Raven1015","timestamp":1441032349,"content":"It's mainly a tool for Sam, which is fine in my book. It always helps to consider the pack a card is coming out in. In this case, Land of Shadow features the Shelob quest, which is one of Sam's defining moments in the books, so it makes sense that the hero would get some special support cards, including the Staff and Taste It Again! Without spoiling too much, I'll say that the Staff is incredibly helpful against Shelob..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765438","commentId":1765438,"userName":"donkler","timestamp":1441032950,"content":"I could also see this getting some use in those scenarios that have you facing off against a 50 threat \"boss\" enemy that you need to reliably defend against every round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765449","commentId":1765449,"userName":"tricil","timestamp":1441033140,"content":"... or scenarios in which you start with a lower threat than usual (e.g. Shadow and Flame).\n\n \n\nEdit: I think Dan makes a good point. Burning Brand can only be attached to a Lore character, so it does not even work with Sam Gangee unless you also attach Song of Wisdom to him (or any other hero from a different sphere).\n\nEdited August 31, 2015 by tricil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765478","commentId":1765478,"userName":"danpoage","timestamp":1441033722,"content":"It is absolutely amazing in my Keep It Secret, Keep It Safe deck - which features Sam, Pippin (Lore) and Glorfindel. I've also been able to make it work in a Hobbit/Ranger deck that uses Sneak+Gandalf and Secret Vigil for threat control. Take No Notice and Leadership Anborn also help to keep enemies' threat high enough to take advantage of the Staff's effect. Repeatable shadow control without needing a high-defense Lore character is really quite valuable. This is especially true because there are so many options (beyond his amazing ability) for readying Sam Gamgee, Gardener Extraordinaire."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765627","commentId":1765627,"userName":"Glowwyrm","timestamp":1441037458,"content":"In the campaigns I play with Sam, he is usually my main defender. It's really easy to buff his defense and hit points (hobbit cloak, dunedain warning, nobel hero, bill) and ready him (fast hitch, his ability, unexpected courage), and not too hard to get him sentinel for multiplayer (arwen, dunedain signal). Adding shadow cancellation is icing on the cake. And spirit Merey has made the hobbitndeck even better\n\nI don't mind Sam getting an attachment that is mostly meant for him, but he's also one of my favorite character in the books and thd game. Any other uses we get from the staff are bonus, like throwing on your lone hero in Escape from Mount Gram (Imrahil maybe), or any other quest that messes with your threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765742","commentId":1765742,"userName":"Authraw","timestamp":1441040963,"content":"Eleanor could also be a reasonable target."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1765813","commentId":1765813,"userName":"narubianHorror293","timestamp":1441043708,"content":"> Eleanor could also be a reasonable target.\n\nYeah, that's true. Cladara is also a low threat spirit Gondor hero with 2 defense.\n\n \n\nI think that since the secrecy meta is strictly at the Hobbit zone for the moment it's kind of hard to imagine any other type of secrecy deck, but these kind of things sometimes open future possibilities which are hard to see at the time of release or spoiling. Also, considering that Gondor rangers too kind of like to mess with enemies with engagement costs higher than the player's threat - recall Leadership Anborn's or Lore ally Mablung's abilities, and the fact that Faramir likes enemies in the staging area - this might also be a nod towards that deck type, regardless of secrecy; of course, this will hold only when you'll want a none-Lore Gondor hero to defend in such a deck, which at the moment seems unlikely as we have yet to see such a hero (I use Denethor+Burning Brand for this in my mono-lore Gondor rangers deck).\n\nEdited August 31, 2015 by narubianHorror293"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1766563","commentId":1766563,"userName":"PsychoRocka","timestamp":1441072238,"content":"I think its definitely a decent card and has the potential to be quite strong/effective in a very low threat hobbit or secrecy deck.\n\nI tried to make it work in my 28 starting threat Sam Gamgee, Elladan and Elrohir deck as a nice defensive attachment for either Sam or Elrohir (via Steward of Gondor). Played 3 or 4 games with it and it was just not cutting it. Honestly I have to agree with John that it would be far more useful if it was limit 1 per character and not restricted. That was the main thing that stopped it being useful for me. I wanted to put it on Elrohir primarily but he needs his two restricted slots for Gondorian Shield/Elven Mail. As amazing as shadow cancellation is the fact you can only cancel the shadow if the attacking enemy has a higher engagement cost than your threat means this is far far less important to my decks and to Elrohir's setup than the +2 defense the shield provides or the Sentinel and +2 HP the mail provides. As well as this 28 starting threat isn't exactly that low and often it is only useful for the first few turns of the game and then has little to no effect. Because Elrohir defends so many attacks however even late game it is decent as there will usually be at least ONE high engagement cost enemy or even boss (with 45 or 50 engagement cost) that you can use it against. At the same time however there are many quests where after just a few turns there are very few enemies that have higher engagement cost than your threat. Ultimately as decent as it was it was simply not worth the restricted slot on Elrohir and honestly most of the time was not even worth it on Sam. My decks don't actually use Sam to defend very often AT ALL and he is rather used for his three willpower and then as an additional attacker when he receives a fast hitch/when he is able to ready due to his ability and so often receives a dagger of westernesse or on occasion even 2 of them or one dagger and a dunedain mark. When I briefly tried out Staff of Lebethron however I often placed the second copy of Gondorian Shield drawn onto Sam to further boost his defense which meant with Staff and Shield he could not receive a Dagger and was a very lackluster attacker. With a fast hitch, shield and dagger he can quest for 3, defend for 2 to 3 against a lesser foe and then attack for 2-4 depending on the enemy's engagement cost or can even quest and then attack twice instead (happens far more often in my decks). This role of quester/attacker fits my decks far better and although it would be nice to have him be able to defend a bit more reliably when need be as well; Hobbit Cloak doesn't work well in my decks (which is very similar to staff!) and I toyed around with the idea of including Ring Mail for a while (with Gimli ally as a second option to receive this) but its 2 cost in tactics was not worth it for a hero who was a backup defender and not the primary one so ultimately the Staff was far better suited for Elrohir in my decks. Restricted killed this idea however and if it was not restricted and was limit 1 per character I think I would probably keep it in the decks (at the least as a sideboard card) as it would still be pretty useful and would cancel at least a few shadow cards in every game which honestly is pretty **** good considering Hasty Stroke costs 1 to cancel a shadow effect (can cancel it after revealed however whereas the staff discards it before hand) and the staff can discard many shadow cards over the course of a game and only costs 1 as well.\n\n \n\nTL;DR \n\nProbably awesome for super low all hobbit or secrecy decks but because of the restricted keyword not very good in any other decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1766769","commentId":1766769,"userName":"Ryodu","timestamp":1441081413,"content":"It definitely shines when used on Sam Gamgee. He doesn't really use a lot of restricted attachments unless you throw some daggers on him. Otherwise he can go on Spirit Frodo.\n\nAs for Gondor heroes that would like the staff I can't think of any at the moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1766943","commentId":1766943,"userName":"Nickpes","timestamp":1441097022,"content":">   Eventually you can get a Hobbit Cloak, Fast Hitch, and 2 Staff of Lebethron on Sam.  Engage 2 enemies with Halbarad and Sam is blocking twice at 5 defense with shadow cancellation.  If you have extra fast hitches he can attack for 3.  Taste it Again to attack for 5. \n\n \n\nHow does he have 5 defence? isn't it 4 ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1766949","commentId":1766949,"userName":"PsychoRocka","timestamp":1441097390,"content":"Two optionally engaged enemies that both have higher engagement cost than your threat = +2 defence\n\nHobbit Cloak whilst defending against enemies that have higher engagement cost than your threat = +2 defense\n\n+1 for his base stat of 1 defense so yeah 5 is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1766978","commentId":1766978,"userName":"Nickpes","timestamp":1441099613,"content":"oh, missed the two optionally engaged enemies with Halbarad  :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1767141","commentId":1767141,"userName":"Lecitadin","timestamp":1441110999,"content":">  \n> \n> > I also think that in a Hobbit or secrecy deck with a good defender, it would work. Other than that, I dunno... maybe Rossiel would also be a good candidate for this staff.\n> \n> Rossiel is nor Hobbit, neither Gondor.\n> \n>  \n\nI'd play Steward on her and make her Gondor. But then, this would become quite a setup to play..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1767183","commentId":1767183,"userName":"PsychoRocka","timestamp":1441112518,"content":"Rossiel is a great target for burning brand however which is far better than the staff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186750-so-staff-of-lebethron-anybody/?do=findComment&comment=1767357","commentId":1767357,"userName":"John Constantine","timestamp":1441118411,"content":"That was an extremely fruitful discussion. For me, at the very least. Thank you."}]}