{"url":"https://community.fantasyflightgames.com/topic/186739-loving-blue-mountain-trader-for-the-hobbit-campaign/","title":"Loving Blue Mountain Trader for The Hobbit campaign","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186739-loving-blue-mountain-trader-for-the-hobbit-campaign/?do=findComment&comment=1765079","commentId":1765079,"userName":"narubianHorror293","timestamp":1441017552,"content":"So, I played \"We must away...\" two-handed solo yesterday, building two dwarf decks - one Leadership-Spirit and one Lore-Tactics. Naturally, I threw Blue Mountain Trader [bMT] (3 copies) into the Ld-S one, as he's a two-cost dwarf, which is rare enough. Anyway, I get him in my opening hand, and manage to get him in turn one, even though I have two leadership heroes and one spirit (Dain, Thorin and Nori) by using We are not idle to put another resource or two on Nori. Then I notice that since the other \"player\" is the first player and controls Bilbo, I can give him BMT to take one resource from Bilbo (which only can't gain resources from card effects, not lose)! Furthermore, since he has Ori, it ups him to 5 dwarves (together with the 1 cost Lore guy he put in), which means he'll be getting an extra card next turn, which was more important than Thorin's extra resource since he already had Steward on him (kinda of a killer opening hand).\n\n \n\nI ended up using the Bilbo-robbing trick one more time, maybe twice, because you really need resources on Bilbo for un-sacking and some other effects, but it was crucial in the early turns.\n\n \n\nSo basically:\n\n1. Even after errata (once per round), BMT is generally great for resource smoothing between two multi-sphere decks.\n\n2. Because of the rarity of 2-cost dwarves (which makes sense, considering the power of that trait), BMT has extra value in dwarf decks, like any low cost dwarf ally.\n\n3. Because of the \"While you control at least 5 Dwarf characters...\" type dwarf heroes and allies, BMT movability makes him extra-good.\n\n4. Because you can rob Bilbo of his resources each and every round, he becomes even better in The Hobbit saga expansions (actually, I only played this deck through the first quest, so this might be less the case in the other saga quests).\n\n \n\nHopefully this hasn't been discussed to death. Sorry if this is redundant.\n{Also, I didn't get any rules wrong here, right?}\n\nEdited August 31, 2015 by narubianHorror293"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186739-loving-blue-mountain-trader-for-the-hobbit-campaign/?do=findComment&comment=1765275","commentId":1765275,"userName":"PocketWraith","timestamp":1441027471,"content":"Similar fun can be had with Bifur when one doesn't need the Saga hero's resources. I recently played some three player games of the LotR saga quests where we just transferred Frodo's resource to Bifur every single round because we had no other use for them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186739-loving-blue-mountain-trader-for-the-hobbit-campaign/?do=findComment&comment=1767238","commentId":1767238,"userName":"banania","timestamp":1441114846,"content":"I always seem to find use for those Fellowship resources:\n\n \n\n- Both Frodo's ability (cancelling encounter cards) and Aragorn (readying heroes) are very good\n\n- The card \"Fellowship of the Ring\" is actually amazing and cheap\n\n- The card \"Frodo's Intuition\" is very good too, providing you play hobbits\n\n \n\nAnd most above all, since Fellowship resources can be used to pay for neutral cards, this has renewed my interest for \"The White Council\" event.\n\n \n\nI shudder to think of a 4-player Saga game with everyone running 3 copies of \"Keen as Lances\".\n\n \n\nI don't remember what I used to do with Baggins ressources though :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}