{"url":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/","title":"2015 Hero Championship - A proposal","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767155","commentId":1767155,"userName":"Eu8L1ch","timestamp":1441111593,"content":"I had this idea for the Hero Championship coming this year, and I decided to put it forth so that the one/s who is going to run the Championship might consider it.\n\n \n\nWhen we build a deck we usually have to take into account a factor: the threat cost of the Hero. So why not make a championship that takes into account this factor as well?\n\nI did a quick breakdown of the heroes currently available (including Dori) by their Threat cost, and got these numbers - barring any mistake of course:\n\n \n\n5-8 Threat Cost: 20 Heroes\n\n \n\n9-10 Threat cost: 25 Heroes\n\n \n\n11-14 Threat Cost: 18 Heroes\n\n \n\nWhy not make 3 different branches of the championship pitting heroes with a similiar threat cost?\n\nAfter a given number of rounds they could be mixed up, but I think having such separation at the beginning would really help in determing which ones the community thinks are the best (and even the partial results would be interesting).\n\nFor example, I think it's not easy to make a comparison between Merry (T) and Elrond: their relative strengths are too different to be compared, as is their cost. However comparing Merry (T) to Mirlonde makes a lot more sense IMO: even if, of course, each hero has its own peculiarities and decks he/she can fit in it's much easier to compare those supposed to occupy the same slot in a deck.\n\n \n\n \n\nFurthermore, I think it would be very helpful if there was a way to keep into account the different player modes when voting: some Heroes are absolute beasts in a 3-4p game, but they suck solo, and vice versa for other heroes.\n\nI understand this would be hard to implement, but I think it would be worth a try; at least it could help specifying whether one has to take into account all game modes and balance his judgment or just the one he thinks is the most important for the hero in question - this would help in having an evaluation of the heroes that is consistent in its criteria.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767175","commentId":1767175,"userName":"tricil","timestamp":1441112368,"content":"Can't we just start the first group at 6 Threat to avoid an obvious winner? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767196","commentId":1767196,"userName":"Nickpes","timestamp":1441113108,"content":"Not sure if he will be a winner over Sam (I believe he is the best hero in game, my most used one for sure, but he is so good that myself will not vote him anyway, I will prefer Sam) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767230","commentId":1767230,"userName":"Thanatopsis","timestamp":1441114655,"content":"So when Samwise Gamgee (the forum member, not the hobbit) started the Hero Championship in 2013 it was meant to be very casual and completely unscientific. Last year, I followed suit and used the prior year's results as a basis for rankings (e.g. Legolas had a first round bye). \n\n \n\nI've been mulling over some other options to break the heroes into brackets. Sort of like regional conference match-ups. I thought it might be cool to group by trait or by sphere (e.g. the Hobbits and the Gondorians each send their champions into the quarter finals). Your idea to group by threat cost is another fantastic method to break them up.\n\n \n\nThen again, there is something to be said about the random mash-up of the past two years. The odd pairings can be fun!\n\n \n\nAs far as taking into account player modes to aid in decision making: people vote for a variety of reasons. Art is a huge factor for me, but sometimes I'm just grumpy and decide that I hate elves, or maybe I'll vote for the obvious underdog because I take pity on them. It's not always based on meta-analysis and power level. Any aid that is provided will be super helpful to some and relatively useless to others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767320","commentId":1767320,"userName":"Eu8L1ch","timestamp":1441116796,"content":"@Tricil\n\n \n\nSure, we could :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nBut as Nickpes said, Glorfindel is no more without proper competition. While I still think he is by far the best Hero for solo mode, in a challenge taking into account multiplayer as well the result might not be so obvious (well, Asfaloth.. 5 threat 3 Willpower 3 Attack.. ..erm).\n\n \n\n \n\n@Thanatopsis\n\n \n\n\"Then again, there is something to be said about the random mash-up of the past two years. The odd pairings can be fun!\"\n\n \n\nTrue that, I think it really depends on the flavor you want to give to the championship. Sorting them with some gameplay-specific criteria would help discussion on their relative strength but would surely take away from the random fun factor.\n\n \n\n\"As far as taking into account player modes to aid in decision making: people vote for a variety of reasons.\"\n\n \n\nThis is a very good point, and one I was taking into account myself: basically there's a lot of variety in the player community, so such an approach might not appeal to every player.\n\nAnyway, mine was just a proposal, hopefully a helpful one even if in the end it will not be implemented. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186849-2015-hero-championship-a-proposal/?do=findComment&comment=1767815","commentId":1767815,"userName":"Teamjimby","timestamp":1441131211,"content":"If you're going to lump the heroes by threat or sphere or whatever, I would vote to have 4 categories so it fits into a bracket.  I'd be fine either way, because it's also kind of fun having weenies like Pippin go up against Gandalf."}]}