{"url":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/","title":"Can you cancel Immune cards when revealed?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1766912","commentId":1766912,"userName":"JYoder","timestamp":1441093661,"content":"In playing Fog on the Barrow Downs, I'm one card draw from victory and drew \"Great Barrow.\" If it triggers, I lose. Can Frodo and the One Ring cancel it?\n\n \n\n\"Great Barrow\" says it's \"Immune to player card effects,\" but since it's being drawn, is its text valid at that time?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1766926","commentId":1766926,"userName":"PsychoRocka","timestamp":1441095343,"content":"Unfortunately I believe you cannot... Frodo reads \"that was just revealed\" so the card has already been revealed and is immune to player card effects. Honestly I find that is the most difficult part of Fog on the Barrow Downs. You need to get through stage 3 and the copy of Great Barrow you must explore as FAST as possible to avoid getting stuck in Great Barrows over and over.... Pretty punishing. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1766979","commentId":1766979,"userName":"Nickpes","timestamp":1441099698,"content":"You cannot, happened to me also ... pretty nasty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1767426","commentId":1767426,"userName":"JYoder","timestamp":1441120563,"content":"Thanks for replies, which is as I feared. What I had thought to be a clever quest is now rather annoying. The difference in drawing Great Barrow or not is huge as it's happened to me twice now. Very obnoxious, especially when you know Tom is sitting in that deck too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1767874","commentId":1767874,"userName":"Nickpes","timestamp":1441132815,"content":"Something I just thought, though I am not sure if it is legal (have not tried it myself when I won the quest)\n\n \n\nIn order to travel to Standing Stones, which is something you must do in order to win the quest, you have to reveal a Great Barrow. Maybe you can quest to place the progress needed on 3B, and when you have them all travel to Standing Stones. The Great Barrow will appear and you go to stage4. After you eplore it, you return to 3B, place a progress on Great Barrow (which is then explored and discarded), and you just need to explore Standing Stones since the progress needed will be already on 3B. \n\nBUT I am not sure if when you create the seperate stage 4, progress already placed on stage 3 are lost or remain"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1767896","commentId":1767896,"userName":"PocketWraith","timestamp":1441133379,"content":"No, going to stage 4 doesn't change anything at stage 3, so that is a viable approach if you can get it to work for you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1768175","commentId":1768175,"userName":"JYoder","timestamp":1441141725,"content":"BTW, in multiplayer, I assume the first player token continues to move among all players, and therefore the Frodo hero can move in and out of different Great Barrows and staging areas?\n\nEdited September 1, 2015 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1768674","commentId":1768674,"userName":"GrandSpleen","timestamp":1441161197,"content":"No-- if you're playing in campaign mode, the campaign card says that the first player token doesn't move when anybody is in a barrow.  If you're not playing in campaign mode, you're not intended to be using Frodo (nothing instructs you to), so there's nobody to move around and you can continue to pass the token."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1769164","commentId":1769164,"userName":"raven614","timestamp":1441192811,"content":"I didn't play it campaign mode and found really hard to beat with out Frodo. So i played with Frodo anyway solo. Been really enjoying your post on your struggles with this senario. This is my favorite part of the book and thought ffg did a good job with the senario. Don't have the Old Forest yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1769471","commentId":1769471,"userName":"PocketWraith","timestamp":1441205427,"content":"> No-- if you're playing in campaign mode, the campaign card says that the first player token doesn't move when anybody is in a barrow.  If you're not playing in campaign mode, you're not intended to be using Frodo (nothing instructs you to), so there's nobody to move around and you can continue to pass the token.\n\nReally? I mean, I guess that makes sense of why the first player not changing is only in campaign mode, but it loads up Frodo as part of the OCTGN set, so I just didn't question it. It seems odd not to use him, since the quest is directly representing those events in the story, even if you're not playing a full campaign."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1769615","commentId":1769615,"userName":"GrandSpleen","timestamp":1441209147,"content":"I've used Frodo out of campaign mode too, it's just more fun and thematic as you say.  But I think it's not intended that you do.  This was released originally as a Fellowship event, and there wasn't any communication from FFG reminding people to bring their Black Riders box so they could use Frodo, and there's nothing on the cards anywhere that suggests you can use him.  If you play campaign mode, however, the set belongs to the campaign, and then campaign rules apply.  Those state that you have to use a Ring-bearer. \n\n \n\nOCTGN isn't official, so can't really draw conclusions from there, and anyway OCTGN doesn't know if you're planning to do campaign mode or not.  Better to give you the Frodo card and have you not use him, than have you miss Frodo when you need him.  Also something to be aware of: there's a mistake on one of those OCTGN cards somewhere... I think it was the Dreadful Song treachery.  The actual card says it must attach to a hero, but if I recall correctly the OCTGN states \"character.\"  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1769872","commentId":1769872,"userName":"PocketWraith","timestamp":1441216050,"content":"OCTGN has separate sets for the campaign and non-campaign versions of the LotR saga quests, including Old Forest and Barrow Downs.\n\nDreadful Song is correct in OCTGN - I suspect any inconsistencies will have been before the image packs were released, as the text on the proxied versions may have been copied incorrectly, but the image packs obviously are the images from the actual cards, so they'll be all correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1769967","commentId":1769967,"userName":"GrandSpleen","timestamp":1441218666,"content":"Gotcha, good to know. Yeah, when I played it last there were no images, so it was just an early version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1770938","commentId":1770938,"userName":"JYoder","timestamp":1441255118,"content":" \n\n> Been really enjoying your post on your struggles with this senario.\n\n \n\nWell, I'm glad someone is, because I'm not.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n \n\n> No-- if you're playing in campaign mode, the campaign card says that the first player token doesn't move when anybody is in a barrow.\n\n \n\nGood call. I thought I had read you didn't change first player token, but in re-reading the setup cards, I couldn't find it, so thank you.\n\n \n\nAfter a few more tries, I finally beat this annoying clever quest, and not passing Frodo actually helped.\n\nEdited September 10, 2015 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1886101","commentId":1886101,"userName":"Mndela","timestamp":1447074229,"content":"Seems rare to me if you are in a separate stage and can't interact with ofthe friends, and however Frodo changes of controller going with first player (speaking about non-campaign mode, for sure)\n\nEdited November 9, 2015 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1886533","commentId":1886533,"userName":"Chris51261","timestamp":1447091467,"content":"I've always thought that the Fellowship heroes were used regardless of whether or not you're playing campaign mode since they so closely mirror Baggins sphere Bilbo, who is specifically mentioned on a few quest cards (Flies and Spiders comes to mind).\n\nEdited November 9, 2015 by Chris51261"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1886543","commentId":1886543,"userName":"gandalfDK","timestamp":1447091780,"content":"That's right. You do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1886613","commentId":1886613,"userName":"GrandSpleen","timestamp":1447094505,"content":"Yeah you do.  But Fog on the Barrow-downs is not part of any campaign box.\n\n \n\nThere are special provisions to allow you to play it in campaign mode, however."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186837-can-you-cancel-immune-cards-when-revealed/?do=findComment&comment=1887031","commentId":1887031,"userName":"Chris51261","timestamp":1447108415,"content":"Ohhh, yeah you're right. I just re-read the little card inserts for Fog on the Barrow Downs, I thought it said something about Frodo. It alludes to him with the rules part about \"immune to player card effects\" getting cancelled, but that's about it."}]}