{"url":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/","title":"Is it worth buying nightmare?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770226","commentId":1770226,"userName":"SauronTheGreat","timestamp":1441226606,"content":"I have through stewards fear, assault on osgiliath, first three sagas, and first to GenCon.  I don't have that much money and I was wondering if it would be better for me to look at getting the real sets before nightmare, or vis-versa. Thinking about it, a normal set has 60 cards and cost twice as much as the nightmare that has a third the cards.  anyhow, if I do get nightmares, I wont have the funds to get too many and would like to know which the best ones are.\n\nThx"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770236","commentId":1770236,"userName":"John Constantine","timestamp":1441226827,"content":"Comparing nightmare sets to the regular ones is a bit incorrect, as the regular sets yield you player cards. But, if you're satisfied with your current card pool and all you want is challenge/diversity from the quest deck - go for nightmare. Otherwise shoot for regular sets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770240","commentId":1770240,"userName":"FetaCheese","timestamp":1441226939,"content":"When your old quests are collecting dust in the storage, you will know it's time to get the nightmare decks and breathe them new life. You will know.\n\n \n\nUntil then, get normal packs and expansions.\n\nEdited September 2, 2015 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770379","commentId":1770379,"userName":"awp832","timestamp":1441230538,"content":"I started buying the nightmare quests selectively for quests that I both really enjoy and also find a bit too easy.  I must say I'm having a difficult time with it. I only play 2 player, if that makes any difference.  Of the quests that I bought..\n\n \n\n1.  Passage though Mikwood still gathers dust because it's STILL too easy.   Very disappointed.\n2.  Journey Along the Andiun is pretty fun.\n3.  Into the Pit and 7th level are pretty fun.\n\n4.  Flight From Moria is insane.   I seriously can't fathom how you beat this quest NM without some serious luck.  Have never won it.   Have lasted several turns but the only time I felt I was \"close\" to beating it was upon drawing Blocked By Shadow with a lot of questers out.   Both of us died to treachery.   So this one gathers dust too.  At least it came with Into the Pit and 7th level.  Shame because I really like this quest!\n5.  Encounter at Amon Din is similarly insane.  Like, slit-your-wrists, turn 2-3 and you lose insane.   I cant even...   Very dissapointed.  This quest is so thematic and fun,  but easy at normal level.   I thought it would be a perfect nightmare buy.  The difficulty level between normal and NM is a huge gap.\n6.  Assault on Osgiliath.   Jury is still out on this one,  I really like Assault on Osgiliath quest.  On normal mode sometimes we win it and sometimes we dont.  I thought nightmare might be fun.   It is fun,  it's super fun.   But I don't actually know if I think it's any harder.  It might even be easier.  Playing this quest after losing Flight From Moria and Encounter at Amon Din about 500 times each left me scratching my head.   Where Flight from Moria and Encounter at Amon Din have huge difficulty gaps,  Assault on Osgiliath has a really small difficulty gap.  \n\nOf course different players have different abilities, different levels of difficulty that are right for them.   However,  of the 7 nightmare decks I have bought,  3 are shelfed because either too easy still or not just hard but beyond hard, have-never-ever-won-them-and-NOT-through-lack-of-trying.  3 of them are fun,   and 1 of them I could probably put in either pile.   So is it worth it to spend the money?  ...  I don't know.  I tend to get more enjoyment out of regular packs in general, I suppose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770429","commentId":1770429,"userName":"FetaCheese","timestamp":1441231552,"content":"Yikes, is encounter at amon din that hard? I was thinking about picking it up soon because I like the theme of the quest, but I find NM JDtA hard enough as is, I doubt I can handle harder than that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770471","commentId":1770471,"userName":"Seastan","timestamp":1441232928,"content":"> Yikes, is encounter at amon din that hard? I was thinking about picking it up soon because I like the theme of the quest, but I find NM JDtA hard enough as is, I doubt I can handle harder than that.\n\n \n\nEncounter at Amon Din NM is very hard. It also forces you into some specific deckbuilding. The new mechanic is that every quest phase you must discard a villager or reveal an extra encounter card. Luckily you start off with 1 villager so you can discard it the first turn. However, if you don't explore any locations that turn you don't save any villagers, and next turn you must reveal an extra encounter card. This only makes it harder to complete locations and you quickly spiral to your death.\n\n \n\nIf you build a strong willpower + asfaloth deck it's slightly easier to beat but still pretty tough. It's the kind of quest you beat once and never look at again. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770492","commentId":1770492,"userName":"tricil","timestamp":1441233527,"content":"Uhm, if Normal is too easy and Nightmare is too hard, why don't you shuffle SOME but not all Nightmare cards into the deck? For example, I think Encounter at Amon Dim is a lot of fun with the Nightmare setup card and rules but with no/only some additional Nightmare cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770510","commentId":1770510,"userName":"Trialus","timestamp":1441234133,"content":"I haven't played nightmare yet, but have thought about getting a few packs.  Not so much for the enhanced difficulty (the game is plenty difficult for me), but because it seems that they frequently use nightmare to change up the style of the quest and possibly make them more thematic.  Not to mention that the artwork is usually pretty awesome.   If I go for it, I was thinking that I would use my own version of \"easier mode\"....Every hero gets 2 resources to start, if still to hard, give myself an optimal starting hand...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1770540","commentId":1770540,"userName":"FetaCheese","timestamp":1441235190,"content":">  \n> \n> > Yikes, is encounter at amon din that hard? I was thinking about picking it up soon because I like the theme of the quest, but I find NM JDtA hard enough as is, I doubt I can handle harder than that.\n> \n>  \n> \n> Encounter at Amon Din NM is very hard. It also forces you into some specific deckbuilding. The new mechanic is that every quest phase you must discard a villager or reveal an extra encounter card. Luckily you start off with 1 villager so you can discard it the first turn. However, if you don't explore any locations that turn you don't save any villagers, and next turn you must reveal an extra encounter card. This only makes it harder to complete locations and you quickly spiral to your death.\n> \n>  \n> \n> If you build a strong willpower + asfaloth deck it's slightly easier to beat but still pretty tough. It's the kind of quest you beat once and never look at again. \n> \n>  \n\n \n\nThat's disappointing. Are there any HoN/AtS NM packs worth buying in your opinion? Preferably not frustratingly difficult. which I guess is hard since HoN in general is filled with frustrating mechanics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1771125","commentId":1771125,"userName":"PsychoRocka","timestamp":1441273251,"content":"Stewards Fear Nightmare is pretty epic, I would definitely recommend getting it as it is not overly hard but changes the quest quite a bit and is just all round awesome. I can also attest to how insane NM Encounter at Amon Din is, I played it a couple of times, was very shocked at just how hard it is and have not played it again since. Need to try again sometime soon and rack up many losses to try get a single win :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1771603","commentId":1771603,"userName":"Seastan","timestamp":1441291819,"content":">  \n> \n> >  \n> > \n> > > Yikes, is encounter at amon din that hard? I was thinking about picking it up soon because I like the theme of the quest, but I find NM JDtA hard enough as is, I doubt I can handle harder than that.\n> > \n> >  \n> > \n> > Encounter at Amon Din NM is very hard. It also forces you into some specific deckbuilding. The new mechanic is that every quest phase you must discard a villager or reveal an extra encounter card. Luckily you start off with 1 villager so you can discard it the first turn. However, if you don't explore any locations that turn you don't save any villagers, and next turn you must reveal an extra encounter card. This only makes it harder to complete locations and you quickly spiral to your death.\n> > \n> >  \n> > \n> > If you build a strong willpower + asfaloth deck it's slightly easier to beat but still pretty tough. It's the kind of quest you beat once and never look at again. \n> > \n> >  \n> \n>  \n> \n> That's disappointing. Are there any HoN/AtS NM packs worth buying in your opinion? Preferably not frustratingly difficult. which I guess is hard since HoN in general is filled with frustrating mechanics.\n> \n>  \n\n \n\nHoN: These Nightmare packs \"fix\" the quests in my opinion. The make it harder and more thematic, but gameplay is not changed much\n\nThe Steward's Fear: I recommend. Very challenging but in a good way. The additional plots add some new life, and also make it less likely to draw Unholy Alliance, which is a win-win.\n\nThe Druadan Forest: I recommend. The NM changes the game completely and becomes unlike any other quest. You start with 5 resources on each hero, but don't generate any more for the rest of the game! It forces some creativity in your deckbuilding for sure.\n\nEncounter at Amon Din: I do not recommend, see above.\n\nAssault on Osgiliath: Another NM that \"fixes\" the quest rather than adds significant changes. For multiplayer it can actually be easier than the standard mode because it has a new mechanic to help you combat location lock.\n\nThe Blood of Gondor: NM makes it harder, but not tear-out-your-fingernails-hard like Amon Din NM. No significant gameplay change.\n\nThe Morgul Vale: same comment as Blood of Gondor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1771817","commentId":1771817,"userName":"Rob_Oz","timestamp":1441296771,"content":"Seastan - greatly appreciate your short reviews of the HoN NM packs. I've purchased just a few NM packs because it was my impression that the only thing they did was make the quests harder. While I really love this game, I find the game difficult enough as it is, so buying more quests simply for an increased challenge didn't really appeal to me. Moreover, I don't really have the time or patience for specific deck-building so beyond the completionist aspect I haven't seen a reason to buy the NM packs. Your descriptions, however pique my interest as it seems as though some NM quests don't necessarily up the difficulty level (or at least don't up the difficulty significantly), but instead re-purpose the quest. \n\n \n\nOn a side-note I have found myself buying a few NM packs simply because I enjoy the art in this game immensely, especially the encounter deck art.\n\n \n\nI'd love to hear more short reviews of the NM packs if folks would be willing to add to this thread. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/186999-is-it-worth-buying-nightmare/?do=findComment&comment=1772742","commentId":1772742,"userName":"alexbobspoons","timestamp":1441319990,"content":"Enjoyed reading this thread and Seastans reviews, I also would like to see more such reviews for other NM quests if people have the time to write up. Other cycles and sagas maybe."}]}