{"url":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/","title":"What do I need for 4 player games?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1772544","commentId":1772544,"userName":"alphasquid","timestamp":1441314723,"content":"I'm wanting to start playing this game with some friends.  What is the best to start with, and how do I go from there?  I will probably be the one buying all the product.\n\n \n\nIs getting 2 core sets the only way to play 4 player, or can I get the core set plus some sort of expansion(s)?\n\n \n\nOnce we start, what's the best way to distribute new cards to the players as I buy them?  Should they mostly keep the same decks from session to session?  In my mind, I'm sort of seeing it like a D&D campaign I guess.  Is it like that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1772580","commentId":1772580,"userName":"Seastan","timestamp":1441315477,"content":"When I first started out I was often playing 4 player with friends. We managed to have fun with only 1 core set. The core set only comes with 2 threat trackers though, so a couple of the players had to keep track of their threat on paper or their phone. Since there are 4 spheres of influence, it divides up quite nicely into 4 players with each person taking 1 sphere.\n\n \n\nFor me it seems to make sense to stick with the 1 sphere/player for a while until your card pool grows considerably. If 1 person starts building strong multi sphere decks by taking the best cards/heroes from each sphere then the other players will be left with the junk cards/heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1772611","commentId":1772611,"userName":"Raven1015","timestamp":1441316172,"content":"You can keep similar decks from game to game if you want to keep a campaign feel. However, keep in mind that certain scenarios require special deck building to meet their unique challenges, so that is something you should all be aware of. Lots of players have fun playing the quests in order and \"earning\" the cards of each pack as they reach that pack. This can help to give a bit of a sense of \"leveling up\" and will keep the deck building manageable. Good luck!\n\nEdited September 3, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1773235","commentId":1773235,"userName":"ppsantos","timestamp":1441338600,"content":"I agree with start with just one Core Set and use the 4 premade decks to play the 3 scenarios that come with the Core Set.  Then judging by your play experience, you could decide if you want to spend more to buy the second Core Set (for more threat trackers and player cards) or an expansion.  If you do decide that this game is for you, then I suggest the Black Riders Saga expansion as your next purchase.  The saga boxes do offer a 'campaign' feel that you are looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1773718","commentId":1773718,"userName":"Flrbb","timestamp":1441352801,"content":"If you want to save money; the second core set is not needed by force. But it is a \"very, very nice to have\". As said above it gives you two more threat trackers and you will have more cards (e.g. unexpected courtage), but they are always the same..\n\nWith a low count on player cards its is strongly advised to divide cards for deckbuilding by colour. Then, if two players are interested in each others colour as a second supporting colour, those two can switch cards on their own.\n\nAs I am personally the type of a \"collector\" I'd never split up a game, but for deckbuilding it is the best if each player can spend some time with his available card pool! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIn my opinion the game with 4 players gets really hard. It is not a problem of having enough quest power or dealing with the enemy, but dealing with lots of treacherys/when revealed effects. These will hurt when they show up - if not, you will have an easy game. I think the game experience is not that good with 4 players but you will notice that on your own..\n\nThat said, if you buy expansion packs focus on easier quests to buy first. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1774453","commentId":1774453,"userName":"Olorin93","timestamp":1441376319,"content":"If you are 4 people, I really recommend two core sets. It gives you one threat tracker each, more tokens and cards, and all players can go multi-sphere. It's not like one player has to pay for everything if everyone wants to get started. If you get serious about the game, it's highly possible you'll all want your own core set eventually."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1774503","commentId":1774503,"userName":"Julia","timestamp":1441376941,"content":"Yup, I'm on Olorin's boat here. I don't have the experience others may have with the game, but I'd go with 2 core sets for sure. Basically because in this way you'll have some richer decks, enough Gandalfs for everyone, a good number of good allies and stuff. As for the investment value, so far I played (only counting from 2014/09/04 to 2015/09/03) 110 games against core set only quests, and I'd be in for more without any doubt, so, it's a good investment, I think"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1775663","commentId":1775663,"userName":"alphasquid","timestamp":1441398649,"content":"> Yup, I'm on Olorin's boat here. I don't have the experience others may have with the game, but I'd go with 2 core sets for sure. Basically because in this way you'll have some richer decks, enough Gandalfs for everyone, a good number of good allies and stuff. As for the investment value, so far I played (only counting from 2014/09/04 to 2015/09/03) 110 games against core set only quests, and I'd be in for more without any doubt, so, it's a good investment, I think\n\n \n\n \n\nMy core set came with 4 Gandalfs, is that enough, or do I need more?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1775717","commentId":1775717,"userName":"Seastan","timestamp":1441399579,"content":">  \n> \n> > Yup, I'm on Olorin's boat here. I don't have the experience others may have with the game, but I'd go with 2 core sets for sure. Basically because in this way you'll have some richer decks, enough Gandalfs for everyone, a good number of good allies and stuff. As for the investment value, so far I played (only counting from 2014/09/04 to 2015/09/03) 110 games against core set only quests, and I'd be in for more without any doubt, so, it's a good investment, I think\n> \n>  \n> \n>  \n> \n> My core set came with 4 Gandalfs, is that enough, or do I need more?\n> \n>  \n\n \n\nHe's certainly a good card but you don't need more than 4 of him in the sense of being able to beat the quests. If you feel you would enjoy the game more if he turned up in your hand more often then that's one way to justify another set. But that's essentially up to you and your play group.\n\n \n\nStrategically, I think it makes sense to give the leadership player 3 copies of Gandalf to combine with Sneak Attack. The other decks could go either way. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1775969","commentId":1775969,"userName":"alexbobspoons","timestamp":1441407528,"content":"Thing is, Gandalf-core can be a very very useful card because of his when-played effects..BUT he only lasts one round then flitters off (not including other card effects that change this) so even though he is unique, having multiple copies is good because you just know he doesn't hang around after being played. So bearing in mind a max deck count is x3 per player, you can have quite a few Gandalf in decks when multiplatform and your four core vandals will only cover 1.3 players worth if you wanted Gandalf.\n\nSo you don't breeders extra Gandalf but they are very very useful (and I am speaking bizarrely as a one handed solo player)\n\nEdited September 4, 2015 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1776040","commentId":1776040,"userName":"Julia","timestamp":1441410151,"content":">  \n> \n> > Yup, I'm on Olorin's boat here. I don't have the experience others may have with the game, but I'd go with 2 core sets for sure. Basically because in this way you'll have some richer decks, enough Gandalfs for everyone, a good number of good allies and stuff. As for the investment value, so far I played (only counting from 2014/09/04 to 2015/09/03) 110 games against core set only quests, and I'd be in for more without any doubt, so, it's a good investment, I think\n> \n>  \n> \n> My core set came with 4 Gandalfs, is that enough, or do I need more?\n\n \n\nAs a general question: 4 Gandalfs are enough, for many reasons. The deeper you go into the game, the stronger will your decks become, so that you'd prefer other cards to Gandalfs, basically because, as the others said, it's just a \"one round flirt\". But when you begin playing, Gandalf is a great card. You can use him to reduce your threat, to damage your enemies or to draw cards, AND it's an amazing 4 Willpower, 4 Attack, 4 Defense, so that you can use him to quest, to attack or to defend. So, until you learn the game, you may want to have at least 2 copies of Gandalf in each deck. The top is a Leadership deck with 3x Sneak attack and 3x Gandalf so that technically you're able to play him up to 6 times in a given game.\n\n \n\nAs said, it really depends on how you plan on expanding the game. If you think you'll be staying for a while on the core set only, then getting two cores is one choice. Otherwise, get one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187123-what-do-i-need-for-4-player-games/?do=findComment&comment=1776651","commentId":1776651,"userName":"C2K","timestamp":1441446512,"content":"I find Core-Gandalf to be useful in any deck(except if you are running hero Gandalf :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] ).  He is just so much utility.  But that said, in a 4 player game, you wouldn't need more than 3 out of the leadership sphere's deck, because you can only have 1 out at a time. \n\n \n\nAnother perk in getting 2 core sets is getting another copy of Unexpected Courage, which lets a hero do more, and another Horn of Gondor, which is decent econ for Tactics.  Not to mention you will be able to flesh out most of the other cards to their max limit. But its certainly not necessary, especially if you plan to invest in big box expansions and adventure packs. \n\nEdited September 5, 2015 by C2K"}]}