{"url":"https://community.fantasyflightgames.com/topic/187432-rossiels-passive-ability-with-immune-to-player-card-effects/","title":"Rossiel&#039;s passive ability with immune to player card effects?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/187432-rossiels-passive-ability-with-immune-to-player-card-effects/?do=findComment&comment=1777674","commentId":1777674,"userName":"midwestborn86","timestamp":1441516013,"content":"If the active location or attacking enemy shares a trait with one in the victory display but the attacking enemy or active location is immune to player card effects does Rossiel still get her bonus? Also can you use Leave No Trace or None Return on a non unique location or enemy that is immune to player card effects (does it go out of play so it's immunity is not applicable?)? \n\n \n\nAlso would it be correct to assume Out of the Wild can be used on a card immune to player card effects as you are choosing a card out of play in the encounter deck?\n\nEdited September 6, 2015 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187432-rossiels-passive-ability-with-immune-to-player-card-effects/?do=findComment&comment=1777686","commentId":1777686,"userName":"GrandSpleen","timestamp":1441516955,"content":"1- Rossiel still gets her bonus.  It's like the bonus conferred from a defensive attachment, it isn't directly interacting with the enemy card.\n\n \n\n2- I believe you can use both of these cards on an immune location/enemy (as long as it's not unique).  The cards are played after the location is 'explored' or after the enemy is 'destroyed,' which means it will have been placed in the discard pile already, and its immunity text would be inactive.\n\n \n\n3- Yes, you can use Out of the Wild to remove an immune card from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187432-rossiels-passive-ability-with-immune-to-player-card-effects/?do=findComment&comment=1777737","commentId":1777737,"userName":"midwestborn86","timestamp":1441524720,"content":"Thanks. I've been looking forward to making a control deck since Out of the Wild first came out. It seems they are allowing this playstyle now, preparing the deck. Removing treacheries instead of cancelling. Getting bonuses to those low threat avg heroes that allow you secrecy. Finishing off with keen as lances. As fun as this deck could be we could use one more card similar to out of the wild to increase the strategic element. Perhaps a cost 4 secrecy 2 card that allows you to search 6, remove 2, replace the others in any order. Or a cost 1 secrecy 1 that says look at the top card and add it to the victory display if it's non unique and worth no points.\n\nEdited September 6, 2015 by midwestborn86"}]}