{"url":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/","title":"When is Overcome by Grief first triggered","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1787449","commentId":1787449,"userName":"JYoder","timestamp":1441949583,"content":"I can't find this answer anywhere...\n\n \n\nIf Overcome by Grief is attached to your hero, and it was your char that was destroyed, does the forced affect trigger right away? Or only the next time one of your chars is destroyed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1787811","commentId":1787811,"userName":"monkeyrama","timestamp":1441971315,"content":"I think that it does not trigger first time around, as it is attached using the trigger 'after a character is destroyed', which is the same trigger as the card's own effect. But, timing in this game is funky sometimes. Maybe worth a yodel to the designers?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1787928","commentId":1787928,"userName":"PsychoRocka","timestamp":1441977282,"content":"Pretty sure that you do have to trigger the second effect. The cards forced effects must be triggered in order as the card reads I'm pretty sure, making the second effect trigger after the first. Could be wrong but pretty sure this is the case, maybe ask Caleb?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1788532","commentId":1788532,"userName":"Veve7","timestamp":1441992547,"content":"Official answer:,,No. Overcome by Grief was not attached at the time it would have triggered. Once it is attached, then you will exhaust the attached hero the next time it triggers.\"\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1793658","commentId":1793658,"userName":"monkeyrama","timestamp":1442221878,"content":"Phew, otherwise my campaign was looking a bit dubious!! Galadrie; was regularly Overcome by Grief, since her utility for the deck is (mostly) being Spirit and letting me quest with newly played Rohan allies. If this were ruled the other way I would have a lot less card draw!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1967160","commentId":1967160,"userName":"NathanH","timestamp":1451733402,"content":"Bit of a necro, but... why doesn't the second effect trigger?\n\n \n\nA character is destroyed. The trigger \"A character has been destroyed\" is in effect. The first Forced effect triggers, attaching Overcome by Grief to one of my heroes. Overcome by Grief now has a different Forced effect, based on the trigger \"A character has been destroyed\" which is still in effect.\n\n \n\nReasoning: If you play Valiant Sacrifice when a character leaves play, and draw a new Valiant Sacrifice, you can play this second copy because the trigger \"A character has left play\" is still in effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1967250","commentId":1967250,"userName":"cmabr002","timestamp":1451742526,"content":"> Bit of a necro, but... why doesn't the second effect trigger?\n> \n>  \n> \n> A character is destroyed. The trigger \"A character has been destroyed\" is in effect. The first Forced effect triggers, attaching Overcome by Grief to one of my heroes. Overcome by Grief now has a different Forced effect, based on the trigger \"A character has been destroyed\" which is still in effect.\n> \n>  \n> \n> Reasoning: If you play Valiant Sacrifice when a character leaves play, and draw a new Valiant Sacrifice, you can play this second copy because the trigger \"A character has left play\" is still in effect.\n\n \n\nI think the only reason it doesn't trigger is because of the intent of the designers.   I agree it should trigger based on the rules as we know it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1967308","commentId":1967308,"userName":"NathanH","timestamp":1451746212,"content":"Perhaps a GoT or Conquest player could give some insight into how this would behave in those games, in which there is a more formal framework for triggers and nested activations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1968155","commentId":1968155,"userName":"shosuko","timestamp":1451789493,"content":"I think the reason is that there are 2 types of actions.  There are Responses, and Forced.\n\n \n\nA response is played in a window following an action, and as long as you are still in that window following an action you can play the response.\n\n \n\nA Forced is different, it has to actually be in play for it to happen as it is not active but passive.  It's not played but triggered.\n\n \n\nSo when you trigger the first Forced part of Overcome by Grief you attach it to a character and THEN it becomes the condition with the second Forced ability...  But because it was not an condition attachment with a forced when the character left play, it won't trigger.\n\nEdited January 3, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1968523","commentId":1968523,"userName":"NathanH","timestamp":1451815725,"content":"That is one system that would work.\n\n \n\nAnother system would be that cards on the table need to have been in play at the time to \"see\" the trigger, but cards in your hand are all-seeing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1968583","commentId":1968583,"userName":"cmabr002","timestamp":1451820863,"content":"> I think the reason is that there are 2 types of actions.  There are Responses, and Forced.\n> \n>  \n> \n> A response is played in a window following an action, and as long as you are still in that window following an action you can play the response.\n> \n>  \n> \n> A Forced is different, it has to actually be in play for it to happen as it is not active but passive.  It's not played but triggered.\n> \n>  \n> \n> So when you trigger the first Forced part of Overcome by Grief you attach it to a character and THEN it becomes the condition with the second Forced ability...  But because it was not an condition attachment with a forced when the character left play, it won't trigger.\n\n \n\nForced effects, by definition are \"triggered\" and not passive.  This is explained in the FAQ.  I understand what you are saying, though and I don't think it is necessarily true.  There theoretically could be player cards that have Forced effects that trigger from a player's hand.  There's no reason this is prohibited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1968606","commentId":1968606,"userName":"cmabr002","timestamp":1451823305,"content":"> That is one system that would work.\n> \n>  \n> \n> Another system would be that cards on the table need to have been in play at the time to \"see\" the trigger, but cards in your hand are all-seeing.\n\n \n\nMaybe this is true, but if a Forced effect said \"After x reveal a card from the encounter deck\" and you revealed another copy of a card that caused the effect, shouldn't you resolve the second one (this would basically be identical the the Valiant Sacrifice ruling except with Forced effects instead of responses?  So, it would be more appropriate to say \"card in play at the time to 'see' the trigger, but cards in your hand, in the encounter deck, in the encounter discard pile, in the player's discard piles, and in any other out of play state where it can eventually move to an in play state are all-seeing\".  Which is pretty much convoluted and messy. The problem with trying to create an interpretation that explains the ruling is that we don't have enough information from the ruling alone to apply it to other situations.  Once we start applying this specific ruling to other situations, we are basically creating our own rules.\n\n \n\nI really think the simplest resolution here is that the designers created the card, not realizing that how it was written would cause both effects to trigger the first time it was attached.  They clarified the intent when they ruled on this card or they ruled incorrectly.  They need to errata the card, rescind this ruling, or rescind the ruling that you can combo timing windows...the first two solutions are the easiest.  Until they do any of these, though, we just have to accept they ruled the way they did and have to also accept that they did not provide enough information with the ruling to determine an explanation for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970124","commentId":1970124,"userName":"shosuko","timestamp":1451898073,"content":"I don't think Forced and Response are the same thing.\n\n \n\nA Forced ability is not a passive, but it's not the same as a response.  Response is an action you can play after something happens, it is optional and activated.  Forced is triggered when the ability is in play and what triggers it occurs.\n\n \n\nSo for your situation if there were a card with \"Forced: When a character leaves play reveal a card from the encounter deck\" and you revealed a card with \"Forced: when a character leaves play ...\" I believe you would not resolve that second force effect at that time, as it was not in play to trigger off of a character leaving play.\n\n \n\nRules page 23 - Forced Effects\nThese effects initiate and resolve immediately, whenever their specified prerequisite occurs.\n\n \n\nRules page 23 - Response\n\ncan be triggered by their controller in response to (i.e. immediately after) a specified game occurrence.\n\n \n\n \n\nI don't think there could be a forced effect from the hand, or a forced effect which awaits a trigger which is not on a card which would remain in play to wait for that trigger.  If a card comes into play which has a Forced effect, but what would trigger it's effect has already happened, I don't see how it would trigger this new forced effect.\n\nEdited January 4, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970132","commentId":1970132,"userName":"NathanH","timestamp":1451898686,"content":"1.08 and 1.09 in the FAQ refer to Forced effects as \"Forced responses\", which is why I would, without further clarification, treat them the same as much as possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970161","commentId":1970161,"userName":"shosuko","timestamp":1451900763,"content":"Yes, however they aren't played as responses are, they are triggered by the occurrence, and by the game.  Which is why them coming into play after the trigger has occurred wouldn't trigger them.  They weren't in play when the trigger happened for the game to activate their effect.\n\n \n\nThis is what is consistent with current play patters such as Overcome by Grief not triggering it's second effect immediately after it's first, and Valiant Sacrifice being able to be repeated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970167","commentId":1970167,"userName":"NathanH","timestamp":1451901194,"content":"I'm afraid I don't see any difference between the wording\n\n \n\n\"These effects initiate and resolve immediately, whenever their specified prerequisite occurs.\"\n\n \n\nand the potential wording\n\n \n\n\"These effects initiate and resolve in response to (i.e. immediately after) a specified game occurrence.\"\n\n \n\nI wouldn't be surprised if your interpretation is ruled correct, because it's cleaner, but I see no reason why it follows from the rules as written. I've submitted a rules question (using the example where Second Hall's effect reveals a Ranging Goblin).\n\nEdited January 4, 2016 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970176","commentId":1970176,"userName":"shosuko","timestamp":1451902152,"content":"Imagine it this way - because perhaps this will clarify my interpretation.\n\n \n\nForced effects are more immediate than Responses.  Forced responses resolve immediately when their specified prerequisite occurs.  There is no room between a triggering effect and a forced effect for a player to do anything.\n\n \n\nSo when something happens - the game scans every card in play - looking for forced effects.\n\n \n\n1 - tally up all forced effects to be completed.\n\n2 - first player determines in what order these forced effects will resolve.\n\n3 - forced effects are then resolved in that order.\n\n4 - players can activate responses.\n\n \n\nIf the game works this way, which I believe it does, then it only checks once for forced effects.  This means another card entering play with a forced effect which could trigger from the original effect won't, as it has already passed that section of the game's mechanics.\n\n \n\nThis is different than a player, as players are simply open to act as they wish in the 4th step as I've represented it, giving them the freedom to stack effects as they gain the ability to do so.  A rare moment for this game when a player has it better than the game haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970181","commentId":1970181,"userName":"NathanH","timestamp":1451902480,"content":"I understand what you mean, but I don't see any reason to believe it must be true."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1970331","commentId":1970331,"userName":"Seastan","timestamp":1451914103,"content":"> I don't think there could be a forced effect from the hand, or a forced effect which awaits a trigger which is not on a card which would remain in play to wait for that trigger. \n\n \n\nPoisoned-Counsels.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Treason-of-Saruman/Poisoned-Counsels.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971345","commentId":1971345,"userName":"NathanH","timestamp":1451939690,"content":"> Hi Nathan,\n> \n> Forced effects do not trigger unless they are in play at the time that they would trigger. This is true for Response effects as well.\n> \n> Cheers,\n> \n> Caleb\n> \n>  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971356","commentId":1971356,"userName":"cmabr002","timestamp":1451940039,"content":"-\n\nEdited January 4, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971391","commentId":1971391,"userName":"cmabr002","timestamp":1451941128,"content":">  \n> \n> > Hi Nathan,\n> > \n> > Forced effects do not trigger unless they are in play at the time that they would trigger. This is true for Response effects as well.\n> > \n> > Cheers,\n> > \n> > Caleb\n> > \n> >  \n> \n>  \n\n \n\nI actually found this (with respect to Responses only) in the rules but it DOES NOT APPLY to events so you can still play cards like A Test of Will.  It says:\n\n \n\n> In order to trigger a response on a hero, ally, or attachment card, the card on which the response is printed must be in play, unless the response specifies that it can be triggered from an out of play state. Event cards with “Response:” effects are responses that are played from a player’s hand.\n\n \n\nSo it seems that Locations and Enemies should follow the same rules as heroes, allies, and attachments, but I see no reason why a treachery card with a Forced effect could not chain like Valiant Sacrifice and Foe-hammer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971405","commentId":1971405,"userName":"NathanH","timestamp":1451941406,"content":"I don't think any treacheries have Forced responses except for When Revealed? Some turn into attachments that have Forced effects, but it seems reasonable (and consistent with the Overcome By Grief ruling) that they follow the same rules as all other in-play cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971418","commentId":1971418,"userName":"cmabr002","timestamp":1451941711,"content":"> I don't think any treacheries have Forced responses except for When Revealed? Some turn into attachments that have Forced effects, but it seems reasonable (and consistent with the Overcome By Grief ruling) that they follow the same rules as all other in-play cards.\n\n \n\nCorrect, there is only one treachery that has a Forced trigger which is Poisoned Counsels but does not apply here because that card is treated as if it were a player card.  However, they could implement one.\n\n \n\nSince Overcome by Grief is an objective, I agree it makes sense to be treated the same way as heroes, allies, attachments, locations, and enemies with Forced effects.  Although, I still see no reason why a theoretical treachery could not chain if it had \"Forced: After x reveal an additional encounter card and deal 1 damage to each hero\".  This would be almost identical to event chaining like with Valiant Sacrifice and Foe-hammer.\n\n \n\nI'm just trying to grasp the distinction and whether treacheries should fall into the \"heroes, allies, attachments, locations, enemies, objectives etc.\" category or if they should fall into the \"event\" category.\n\n \n\nEdit: I guess a treachery would never be in a \"hand\" like events are so no Forced effects would ever be relevant, and if they wanted to make it relevant they would have to create a scenario that had specific rules stating that treacheries got placed into some similar hand-like state instead of being discarded.  So until that happens, it is moot.\n\nEdited January 4, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971436","commentId":1971436,"userName":"cmabr002","timestamp":1451942207,"content":"I still think his ruling is somewhat contradictory to the Event chaining with Valiant Sacrifice though (although I never really liked the event chaining ruling)...It seems like the corollary ruling would be \"Forced effects [Response effects from events] do [can]not trigger unless they are in  [a player's hand] play at the time that they would trigger.\n\nEdited January 4, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971619","commentId":1971619,"userName":"NathanH","timestamp":1451948600,"content":"I deliberately didn't check whether this overrides that previous ruling, because I don't want him to take our toys away!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/?do=findComment&comment=1971849","commentId":1971849,"userName":"shosuko","timestamp":1451958598,"content":"So what I gather is:\n\n \n\nThere are cards which need to be in play for their abilities to be in effect.  This covers heroes, allies, and attachments, as well as enemies, locations, and objectives.  It makes sense.  However event cards such as Valiant Sacrifice don't need to be in play (or rather can't really be in play) for their effect to be used.\n\n \n\nI could see that logic following that if there was a treachery card had a similar type of effect that it would work this way.  The reason events can work as they do is that they sit in your hand, out of play but revealed to a player.\n\n \n\nNow if there was a encounter deck that had a \"hand\" like side deck of exposed cards with forced effects waiting to happen, then I'd agree they could chain in the same manor as Valiant Sacrifice.  If there were a \"quest hand\" with \"forced: when an ally takes damage place this card in the encounter discard, deal that character another point of damage and draw another card into the quest deck's hand\" that the newly drawn card could still trigger off of that ally taking damage.\n\nEdited January 5, 2016 by shosuko"}]}