{"url":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/","title":"Physical aspect of deckbuilding","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1793875","commentId":1793875,"userName":"Qaanaaq","timestamp":1442236474,"content":"I enjoy the thought experiment part of deckbuilding, thinking about core concepts and putting together a few core strategy cards. I also enjoyplaytesting.\n\nI played some on octgn, but there is just a lot more enjoyment in handling, shuffling the cards with hands. Also the art plays a less mechanic role, when playing with \"hands\".\n\n \n\nBut there is an aspect of deckbuilding where I would like to ask for advice. I do not enjoy the deck counting, filling, searching, getting out putting back aspect, which I assume is due to my storage solution. Just as my encounter cards, i store the player cards in a box. Although labeled with The-Tom's nice dividers, it is still quite unenjoyable to look for let's say 10 leadership events to make up the 50. Holding in my hand, laying them out, cannot properly read them... cannot properly look at them. I want to read THAT undervalued leadership card, and perhaps put that it in, I would like to use THAT not used core set attachment and not forget it.... and I want to look at To the Eyrie art atleast.\n\nOfcourse Dan's search (http://hallofbeorn.com/Cards/Search [http://hallofbeorn.com/Cards/Search]) is a wonderful tool, but directed searches eliminate a degree of chance, stumbling upon some card...\n\nI want to enjoy deck building, but I need the aesthetic experience.  I am thinking of buying some nice binders, as that seem to be the solution. But before I make some irresponsible purchase -\n\n \n\nwhat are your deckbuilding solutions, sans octgn, how do you make it enjoyable, effective? how much physical handling is involved?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1793919","commentId":1793919,"userName":"Goblin King","timestamp":1442237854,"content":"An index of decks is very helpful. I keep a spreadsheet of decks previously built. I also add in decks that I see on the various pages like Hall of Beorn. I don't always make them, but it is good to keep them in mind. I also include notes on decks, like when a new card comes out that would have gone really well in a deck I had two years ago, I make a note of it on the spreadsheet.\n\nI know a lot of people who really liked keeping their cards in binders rather than boxes. This allows them to see more cards when deckbuilding. I've personally never gone for this, but can see the benefits.\n\nBeorn's index is a wonderful tool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1793921","commentId":1793921,"userName":"Seastan","timestamp":1442237960,"content":"Despite owning all the physical cards, I do all my deckbuilding online. I've been using The Rivendell Councilroom lately (http://ddddirk.github.io/lotrdb/ [http://ddddirk.github.io/lotrdb/]) because it's so fast. It's pretty easy to filter by set/sphere/trait/type to get what you need.\n\n \n\nI then supplement this with Hall of Beorn's (http://hallofbeorn.com/Cards/Search [http://hallofbeorn.com/Cards/Search]) \"category\" filters. So say I've put together a deck and I feel that it is lacking in resource generation, I set that filter on Hall of Beorn and take a look to see if there is anything that would work in my deck that I've forgot about."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1793992","commentId":1793992,"userName":"Julia","timestamp":1442240439,"content":"I have a comprehensive excel spreadsheet with cards from core to the last pack in Shadows of Mirkwood, with keywords highlighted and cross-referred. In this way you have everything on screen, and then if you have the cards sorted alphabetically, it's extremely fast creating the deck.\n\n \n\nBeware, it's not the whole LCG (but I plan on slowly expanding my work), but it's a start. If interested, feel free to PM me your email, and I'll be more than happy to send you over the work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794059","commentId":1794059,"userName":"Olorin93","timestamp":1442242221,"content":"I was thinking earlier today that I really enjoy putting decks together in my mind or on paper, but when I build them they often don't perform quite as well as I'd like. I took a dwarf power deck against the Weather Hills today and lost, then lost even Passage Through Mirkwood with a new spirit/tactics Gondor Dúnedain deck. I've come to realise I like thinking about new combos and strategies, but I actually sit down to sort and play quite rarely and most of my decks never make it past the planning stage because I lose interest in the theme or need to do something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794063","commentId":1794063,"userName":"Teamjimby","timestamp":1442242319,"content":"Like others, I do most of my deck building online, but will occasionally do it on the fly if I'm making small adjustments or throwing together a new deck at the game store because other players used my heroes. \n\n \n\nI have a similar storage solution of boxes, sorted by sphere and card type.  One thing that helps me is that I remove 2 copies of the lesser used cards and store them in a different box that rarely gets opened.  This way, when I am making a deck and flipping through my leadership events, I can grab my 3 copies of sneak attack and a Very Good Tale, maybe skip over the 3 copies of Strength of Arms and others, but then I only have to hold and skip past one copy of Common Causes and Rear Guards. \n\n \n\nThen while pulling out cards for the deck, I make a pile of \"must include\" cards (usually 30-50) and a pile of \"probably won't include but you never know\" cards (usually 30 to 50).  I already know the \"must include\" cards by heart and don't need to look at them again.  But I go through the other pile so I can at least spend a few seconds reflecting on the possible inclusion of a less used card.  In the rare event I actually decide to use one of the single cards, I go to the other box and grab the extra copies.\n\n \n\nI mainly do this because otherwise I couldn't keep all my player cards in one core box, but it also makes the stack of leadership events or lore characters or whatever more manageable to hold."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794083","commentId":1794083,"userName":"Bullroarer Took","timestamp":1442242710,"content":"I resisted putting my player cards in binders for over a year, but it became too unwieldy just using a box. Putting them in binders was one of the best things I've done in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794127","commentId":1794127,"userName":"Lecitadin","timestamp":1442243673,"content":"Has anybody ever tried to store their cards by effect? Like \"Attack/defence\", \"questing\" or \"card draw/resources\", etc ? I'm thinking about it.\n\nEdited September 14, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794190","commentId":1794190,"userName":"Raven1015","timestamp":1442244925,"content":"I do all of my deck building online these days, but based on what you're asking, I would highly recommend going the binder route. In the early days of the game, I stored cards in boxes, and building decks was too cumbersome. But with a binder, you can look through all your cards quickly and easily, and then pick out what you want. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794250","commentId":1794250,"userName":"Gizlivadi","timestamp":1442246825,"content":"Most of the times I deckbuild with physical cards, which is made far easier when you store all your player cards in a binder. The boring part is then putting back all the cards that didn't end up in the deck, but it's a minor drawback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794255","commentId":1794255,"userName":"Noccus","timestamp":1442247003,"content":"I do enjoy deckbuilding in my head, were most of it comes together really.\n\nThen the next step is adding the deck a excel spreadsheet I made.\n\nThis helps it make visible & ajustable on what I lack and need to cut and so on.\n\nGot alot of decks in that sheet that never see the light of day tho.\n\nAs on the physical part:\n\nI have a few of those special white cardboard boxes, and keep my cards in lockable sturdy plastic bags.\n\nKind of like ziplock, but not quite. I have them sorted by 1 sphere, 2 type, 3 chronologic.\n\nAll the bags are labelled with 1sphere & 2 type. And it works. I can find what I want fast enough, and the copies I need.\n\nThat said, I do not enjoy fishing out the cards. But it must be done.\n\nBut that goes for the set up for every game too. I do not like all the shuffling. But it must be done.\n\nBut my 2 buddies use binders.\n\nWhile it is nice to browse and enjoy the art & so on, it is also a hassle to pluck out the cards needed 1 by 1.\n\nAnd when you have the entire card pool you will need at least two of the big ones.\n\nSo both box & binders are the same on handling that way imo.\n\nThe only plus is the showcase.\n\nEdited September 14, 2015 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794389","commentId":1794389,"userName":"Authraw","timestamp":1442250862,"content":"We actually have 5 small binders, one for each sphere plus neutral. Each binder is sorted by card type but arbitrarily ordered within any given type. We love using the binders to deckbuild--you start by picking your spheres and then you can put aside the part of your collection that doesn't apply. Works great for multiple people building from the same pool, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794441","commentId":1794441,"userName":"Teamjimby","timestamp":1442252357,"content":"For all the binder people, how do you sort your cards within a given sphere and type?  Do you sort by cost, name, release date, trait, or something else?  The thing that keeps me away from binders is the thought of finding the right slot to put them back into when I am done or needing to move every card in the binder every time I get a new pack. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794459","commentId":1794459,"userName":"Authraw","timestamp":1442252733,"content":"Other than type (and sphere on a per-binder basis) we don't have a sort order--that keeps it manageable to pull cards out of the binder and put them back (or get new cards) without going crazy. It's also important to leave some blank space between each type for the collection to grow.\n\nIt's not difficult to sort through the 2-4 pages of \"Lore events\" to find the one you want, for instance. No need to get more granular than that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794478","commentId":1794478,"userName":"Raven1015","timestamp":1442253146,"content":"> Other than type (and sphere on a per-binder basis) we don't have a sort order--that keeps it manageable to pull cards out of the binder and put them back (or get new cards) without going crazy. It's also important to leave some blank space between each type for the collection to grow.\n\n \n\nSame here. No order beyond sphere and type. This means you simply put cards back in any available space! Makes that problem disappear.\n\n \n\nEdited September 14, 2015 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794487","commentId":1794487,"userName":"Bullroarer Took","timestamp":1442253300,"content":"I have one binder for each sphere (and another for neutral).  In each sphere binder the cards are arranged in sections:  heroes, allies, attachments and events.  The cards are in release order in each section."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1794636","commentId":1794636,"userName":"Ryodu","timestamp":1442256399,"content":"> Despite owning all the physical cards, I do all my deckbuilding online. I've been using The Rivendell Councilroom lately (http://ddddirk.github.io/lotrdb/ [http://ddddirk.github.io/lotrdb/]) because it's so fast. It's pretty easy to filter by set/sphere/trait/type to get what you need.\n> \n>  \n> \n> I then supplement this with Hall of Beorn's (http://hallofbeorn.com/Cards/Search [http://hallofbeorn.com/Cards/Search]) \"category\" filters. So say I've put together a deck and I feel that it is lacking in resource generation, I set that filter on Hall of Beorn and take a look to see if there is anything that would work in my deck that I've forgot about.\n\n \n\nI do something similar as well, though I use CardGame DB. I often build my decks digitally and then build them physically afterwards. Every now and then, and I think it depends on my time available to me and my \"mood\" I will build a deck from the ground up using my physical cards. \n\n \n\nAs for storage solutions to help in deck building, I use a binder for my player cards. The Heroes are first (separated by sphere) followed by the player cards to each sphere (broken down into Allies, Attachments, and Events). The Neutral cards are in the back of the binder and not as organized. My encounter cards are stored in the box but having my player cards in a binder makes it pretty easy to flip through and pull what I need (and to put cards back as well)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795326","commentId":1795326,"userName":"jnicol","timestamp":1442273474,"content":"I do all my deck building online, and have recently moved to storing cards in a binder for the same reason as the OP - it was beginning to feel chaotic to sort through a big pile of cards in a box.\n\nFor deck building I have recently begun using Dirk's Rivendell Councilroom (linked earlier in this thread), which is excellent. Prior to that I was using the CardGameDB LOTR deck building tool.\n\nFor my binder I have been using loose Ultra Pro 9 pocket pages, in a 3 ring binder. After a lot of experimentation I think I have settled on storing 3 unsleeved cards per pocket.\n\nPros:\n\n- 3 cards per pocket is much easier to browse. 1 card per pocket introduces a lot of visual noise, making it harder to scan cards.\n\n- 3 cards per pocket is very space efficient.\n\n- Loose pages are easy to rearrange, and mean you'll never have to reorganise your collection to make room for new cards.\n\n- Your cards look purdy.\n\nCons:\n\n- If you store your cards unsleeved in the binder you will need to sleeve and unsleeve cards every time you put them into a deck.\n\n- The biggest drawback of a binder is that at any given moment a sizeable chunk of your collection will be in decks, meaning there will be many gaps in the binder. This makes deck building from the binder more cumbersome than you might hope.\n\nFor me the pros outweigh the cons, but time will tell..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795349","commentId":1795349,"userName":"jnicol","timestamp":1442274080,"content":"> Other than type (and sphere on a per-binder basis) we don't have a sort order--that keeps it manageable to pull cards out of the binder and put them back (or get new cards) without going crazy.\n\n+1. I have been organising my cards by type, then by release date, but the first time I went to put cards back in the binder I realised the flaw in my method. It is a PITA to figure out what pocket a card is supposed to be in - I have to consider the card number and the set it is from, which are printed in minuscule text. A recipe for madness!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795401","commentId":1795401,"userName":"entMoot","timestamp":1442275785,"content":"I deck build out of binders also. I organize them by release date only, placing all the heroes on one page at the front of the cycle. Then each AP takes up one of the 9-slot pages with 3 copies of each card per slot.\n\n \n\nI like this method since I know exactly where new cards need to go and it reminds me about older cards I might not use as often. When I am working on monosphere decks, it can be a bit much turning of the pages, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795441","commentId":1795441,"userName":"awp832","timestamp":1442277333,"content":"I recommend hiring a deck butler/servant/maid.  That way you can play with all the cards without having to put them away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795476","commentId":1795476,"userName":"Authraw","timestamp":1442278584,"content":"> I recommend hiring a deck butler/servant/maid.  That way you can play with all the cards without having to put them away.\n\n+1 for the deck butler, definitely makes things easier for us."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1795622","commentId":1795622,"userName":"soullos","timestamp":1442284843,"content":"I organize my player cards in binders and boxes. Only one copy of each player card is in a binder (to keep the binder from bulking up) and the rest are stored in a box in the same order as they appear in the binder. I separate by sphere, then by Allies, Attachment, and Events. Order of cards after that is random, but newer cards I just place in their appropriate section next in line. I keep heroes in their own smaller binder (4 pocket sleeve sheets, stored in order of release).\n\n \n\nI find this set up useful to look over the cards without the binder being so unwieldy (before I stuffed ALL player cards in the binders). When I need to find a card I know exactly where it is in the box and the binder (I get deck lists online and build them using my binder/box method)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1800925","commentId":1800925,"userName":"JohnGarrison1870","timestamp":1442467316,"content":"I just can't use octgn. I've tried several times (in a desperate attempt to scratch my LotR LCG itch without blowing so much money on the physical cards), but the experience seemed so soulless that I kept quitting each game in mere minutes due to ennui. I've tried various deckbuilding programs to at least make deckbuilding smoother, but they all take away much of the fun for me, which is manipulating the cards and physically organizing and sorting them.\n\n \n\nThis sometimes makes me wonder why I'm into this game at all... :/  Forsooth, if it was digital only I wouldn't play at all.\n\n \n\nLIke OP, I prefer to keep my cards in boxes with nice organizers, and resisted binders for a long while. But just a few days ago I finally got sick of forgetting which cards I owned, and taking many long hours just to make a single deck because of all the sorting by hand I had to do. So I finally broke down and put my player cards into a binder.\n\n \n\nBest thing I could have done. My enjoyment of the deckbuilding process has increased evermore, the process is much faster, I think it results in better decks because it is far easier to compare my card options amongst each other, and it is also more beautiful and pleasant to be able to easily browse through my collection in leisure, deckbuilding or not. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 17, 2015 by JohnGarrison1870"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1800929","commentId":1800929,"userName":"GrandSpleen","timestamp":1442467733,"content":"I use those long white cardboard boxes, one for each deluxe+cycle, with Saga expansions in separate boxes as well. Currently player cards are in 3 of those, with lore+tactics in one box, spirit+leadership in another, and neutral cards in their own (with lots of empty space).   About to outgrow that solution though, the dual sphere boxes are very tight when I don't have any decks built.\n\n \n\nWhen I deckbuild, I used to go through the cards physically.  As the game has grown, this has become too cumbersome and I now use online deckbuilders almost exclusively.  After the deck is designed, I build it physically.  \n\n \n\nThe big downside of the cardboard boxes is that it's a lot of boxes.  No problem when I'm at home, but when I go to an event I bring all my player cards (3 boxes right there), a deck box (up to 4), and often one or two boxes of encounter cards (so maybe 6 total).  Add to that any other stuff I want to put in my box-carrying bag (glasses case, wallet, keys, etc) and it's a pretty big deal to move around inside the bag and find the box I'm looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1860048","commentId":1860048,"userName":"bobross","timestamp":1445521954,"content":"> I organize my player cards in binders and boxes. Only one copy of each player card is in a binder (to keep the binder from bulking up) and the rest are stored in a box in the same order as they appear in the binder. I separate by sphere, then by Allies, Attachment, and Events. Order of cards after that is random, but newer cards I just place in their appropriate section next in line. I keep heroes in their own smaller binder (4 pocket sleeve sheets, stored in order of release).\n> \n>  \n> \n> I find this set up useful to look over the cards without the binder being so unwieldy (before I stuffed ALL player cards in the binders). When I need to find a card I know exactly where it is in the box and the binder (I get deck lists online and build them using my binder/box method).\n\n \n\nI might try this. I've always had my cards in Dragon Shield Clear and a few months ago bindered them to facilitate deck building. However, I've noticed some cards are bending a little since it's a tight fit with the sleeves. This is the very definition of a 'first world problem,' but it still bothers me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188338-physical-aspect-of-deckbuilding/?do=findComment&comment=1863941","commentId":1863941,"userName":"JTG81","timestamp":1445780577,"content":"If you enjoy art then Binder for sure. Sometimes I will just sit down and flip through my binders looking at the amazing art in both the player and encounter cards (as I binder my encounter sets as well). It is hard to sit back and enjoy the card art of some nasty goblin or Treachery in game as I am just trying to survive."}]}