{"url":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/","title":"Your Favourite 5 Quests and Why! Round 2","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1795883","commentId":1795883,"userName":"PsychoRocka","timestamp":1442302370,"content":"Hey Everyone!\n\nSo running the unique ally championship has really psyched me into doing some more little projects on the forums to keep things interesting and active on here while we wait for the last 3 Angmar Awakened AP's to come out. The unique ally championship is running very smoothly and is currently up to the final vote between Arwen and Treebeard. At the end of the week it will end however so I thought I would get this thread up and running as well.\nEssentially over a year ago I started a thread entitled Your Favourite 5 Quests and Why. I had people vote for their five favourite quests (with a description of why those 5 quests) and tallied the results. The results were pretty interesting and very few quests did not receive at least one vote. Here is that thread and the results if you are interested:\n\nhttps://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/page-1?hl=%20your%20%20favorite%20%20quests [https://community.fantasyflightgames.com/topic/107343-your-favorite-5-quests-and-why/page-1?hl=%20your%20%20favorite%20%20quests]\n\n \n\nI thought it would be interesting to run this exact same poll again with all the new material that has come out since I first ran it. I believe we were up to about Dunland Trap back then so we now have the entire Ring Maker cycle, Treason Of Saruman, Lost Realm and the first 3 Angmar Awakened AP's, Ruins of Belegost, Land of Shadow (a select few have this and ruins of belegost but the majority of people do not) and any new nightmare packs that have come out since then (probably all the HoN and AtS nightmare and Voice of Isengard and Black Riders) as well to choose from. Hopefully this time more people get involved and I can get a bigger tally/vote going and we can truly see which quests are the community favourites!\nLike last time all I require is a top five: you do not need to order the 5, you can make honourable mentions of other quests but ultimately you must choose exactly 5 as your 5 favourite quests and finally include as much explanation or details as you want or if you really want none at all!\n\n \n\nI'll start off with my favourite five quests at this point in the game:\n-The Massing at Osgiliath. \n\nThis is the only quest of the five that has stayed from my vote last time! The first ever POD they did for this game but potentially still the best one. Super difficult if you are playing progression style or still pretty hard but FAR more manageable when using the whole card pool. This quest has great art, great enemies, a very punishing boss, super thematic and never done again sacrificing of objective allies or a hero to be able to quest/advance on a certain quest stage, objective allies that are revealed from the encounter deck or as shadow cards and some truly horrid locations (Pelennor Fields, Morgulduin and the Overlook). Even the whole west bank/east bank and only being able to travel to certain ones on certain quest stages is really clever and not something that has really been done again either. It has it all!!!!\n\nIt is also still one of the main quests I try out deck changes against (the other being JatA) and still one I will sit down and play for no real reason other than wanting to play some LOTR LCG. I think they did so well with this quest and it coming out so early in the games life must have been very beneficial. It also would have been amazing for people like Glaurung who wanted harder challenges when nightmare mode did not yet exist. \n\n-The Seventh Level (Nightmare). \n\nThis is probably my favourite nightmare quest. It turns such an easy pushover quest into something much harder and much much more fun. Overseer Marul is a great boss enemy and the various effects and boosts the goblins can get from the new nightmare cards are varied and all quite clever. They can gain extra attack power, be immune to damage, be immune to player card effects etc. I also really really like that for once instead of a mechanic that simply boosts Orcs it is a mechanic that only boosts Goblins. Yes they are ultimately the same thing but Goblin often (but not always) refers to the smaller and less fearsome or troublesome Orcs. In this quest therefore it is the horders of smaller goblins within Moria that are being boosted (and not the bigger Orcs that are the leaders, captains etc) which is far more thematic if you think about it and quite unique to this quest. There are a handful of enemies with only the Orc trait and not the Goblin trait as well and these are exactly what I have mentioned: the captains and overseers. Take out the captains and the hordes lose morale and therefore their boosts as well. \n\n- The Three Trials.\n\nThis quest from the ring maker cycle is easily my favourite from the cycle and is a great quest centering around 3 bosses and 3 trials. All three trials and enemies were amazingly crafted and all have a unique feel to them. The choice of what order to take on each trial as well as what enemies and barrow locations appear at each quest stage both add so much replayability and diversity to the quest. It is also very fun beating the Guardians twice, one at a time then all at once at the end. I constantly find myself coming back to this one and will probably always continue to as it has a very good difficulty level, great theme and fantastic mechanics. This is also the only quest from the cycle with time counters on enemies, all the others feature time counters on either the quest stages or locations. Very clever quest that is a very unique take on the \"boss\" battle with three separate bosses you take on one at a time in a random order but that you also then need to beat all at once at the end.\n\n-Intruders in Chetwood\n\nThis is my favourite quest of the new cycle thus far however I have the feeling Treachery of Rhuadar with its multiple optional side quests and clues then final stage (similar to The Stewards Fear which is only not on this list as I have played it to death) that plays out depending on what clues you collected could overtake this one when released. This quest can be very tough if you draw into too many side quests too quickly but can also be fairly easy to beat if you manage side quests well or don't get too many too quickly. It is a simple quest with only one quest stage however it requires a lot of progress to beat that one stage and side quests constantly appear that you must deal with or face some pretty nasty effects. The encounter cards are especially nice in this quest (most newer cards just seem more nuanced and clever/unique but in a hard to describe way, overall new encounter cards are just so much more diverse and random) being a batch of cards from the newest cycle and the quest can vary greatly between different attempts which is also great. The second quest from the box is great but those weather treacheries can be a bit overly painful and the third quest is great but a little tough (and quite especially at the start which is always the case but even more so the case with this quest I believe with its brutal setup). Escape from Mount Gram would be taking this spot but it has just a little bit too much setup so although its a great quest it takes a lot more setup and is far more finicky too. Wastes of Eriador is great but day and night is a real painful mechanic, oh how I wish you could at least clear side quests during night... or at the very least player side quests if not encounter ones...\n\nThis quest keeps it simple but provides brand new mechanics and kicks off our newest cycle with a bang.\n\n-Helms Deep\n\nWhen Treason of Isengard was released I found posts on a few different forums where solo players were complaining about this quest not being as epic or on the scale it should be on and as a two handed player I could not disagree more. I just love how thematic and tough this quest is with 2 or more players as you get utterly swarmed by Uruks and Dunlendings and are constantly sweating it out worrying what will happen next. The treacheries are downright brutal and some of the locations have terrible effects. The quest stages can easily overwhelm you with their effects if not managed properly. This is one of the most unique quests in the game with the Defense keyword and we may not get any more of this type except perhaps Minis Tirith??? (please do this FFG, there has to be at least one other quest with the Defense keyword it is just fantastic!) later in the saga. Captures the feel of Helms Deep perfectly. My favorite quest to play in the Saga so far.\n\n \n\nHonourable Mentions:\n\n-Journey in the Dark\n\nThis quest is just fantastic as well and I think the developers captured the theme and essence of both Moria and the Balrog perfectly. An amazing battle and race to escape. Could say so much about this quest and my particular strategy, which is to escape Moria before the Balrog even appears and incur only two threats and no fallen heroes, but I have done so on many other occasions so will leave it. Another amazing saga quest and a close second to Helms Deep.\n\n-Escape from Mount Gram\n\nAs mentioned above a second favourite in the new cycle after Intruders in Chetwood. Such a unique quest and so much replayability by using a different starting hero every time as well as how random the captured cards you free will be and how differently the player decks work in this quest (being only events and certain attachments). Would probably be in the top five but as mentioned above just has too much setup time and is a little too finicky, mainly because of how many captured cards you must constantly place underneath encounter cards and how big your hand/s get towards the end (almost a third of the deck at times!!).\n\n-Fog on the barrow downs\n\nGreat quest but god I hate taking on multiple great barrows too quickly.... can be extremely frustrating and brutal but still an amazing quest. Such great enemies and art!\n\n-Ruins of Belegost\n\nJust got my hands on this quest recently and it is so **** cool!!! After staring at the spoilers on hall of beorn constantly I thought I had it perfectly sussed out by the time I got it but it turned out to be a little harder than anticipated and I already thought it was going to be pretty **** hard. I have played four games of this quest and lost 3 and somehow beat it the fourth time but probably should not have. I got crazily lucky and won with both decks at 49 threat (not kidding!) and 9 goddamn tokens on stalking the ruins... This quest is insanely difficult but very very cool, once I have played it more and gotten another win or two I may like it more but as yet I have not played it enough.\n\n \n\n \n\n \n\n \n\n \n\nPoll - Top Quests\n\n-Foundations of Stone - 5 Votes\n\n-The Stewards Fear - 5 Votes\n\n-The Massing at Osgiliath - 5 Votes\n\n-Helms Deep - 4 Votes\n\n-Wastes of Eriador - 4 Votes\n\n-Intruders in Chetwood - 3 Votes\n\n-The Seventh Level (Nightmare) - 3 Votes\n\n-The Three Trials - 2 Votes\n\n-Siege of Cair Andros - 2 Votes\n\n-Escape from Mount Gram - 2 Votes\n\n-Fog on the Barrow Downs - 2 Votes\n\n-The Long Dark - 2 Votes\n\n-Watcher in the Water - 2 Votes\n\n-Peril in Pelargir - 2 Votes\n\n-Road to Rivendell - 2 Votes\n\n-The Stone of Erech - 2 Votes\n\n-Journey along the Anduin - 2 Votes\n\n-Blood of Gondor - 2 Votes\n\n-Trouble in Tharbad - 2 Votes\n\n-Flies and Spiders - 2 Votes\n\n-Journey in the Dark - 1 Vote\n\n-Battle of Lake Town - 1 Vote\n\n-Conflict at the Carrock - 1 Vote\n\n-Siege of Cair Andros (Nightmare) - 1 Vote\n\n-Into Ithilien - 1 Vote\n\n-Into Ithilien (Nightmare) - 1 Vote\n\n-Knife in the Dark - 1 Vote\n\n-Knife in the Dark (Nightmare) - 1 Vote\n\n-Assault on Osgiliath (Nightmare) - 1 Vote\n\n-Journey along the Anduin (Nightmare) - 1 Vote\n\n-Fords of Isen - 1 Vote\n\n-A Shadow of the Past - 1 Vote\n\n-The Old Forest  - 1 Vote\n\n-Hills of Emyn Muil - 1 Vote\n\n-Passage Through Mirkwood - 1 Vote\n\n-Shadow and Flame - 1 Vote\n\n-Dungeons Deep and Caverns Dim - 1 Vote\n\n-Celebrimbor's Secret - 1 Vote\n\n-Encounter at Amon Din - 1 Vote\n\n-The Hunt for Gollum - 1 Vote\n\n-Journey to Rhosgobel - 1 Vote\n\n-The Morgul Vale - 1 Vote\n\n-The Morgul Vale (Nightmare) - 1 Vote\n\n-Flight from Moria - 1 Vote\n\n \n\n \n\n \n\nLast counted vote: Jjenks476\n\nEdited September 17, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1795890","commentId":1795890,"userName":"Nickpes","timestamp":1442303219,"content":"Hm, Interesting indeed, It seems that I will have to change my mind a bit since last competition\n\n \n\n1. Helms Deep\n\nMaybe it is not the best, maybe it is tough (for some), easy (for others), but I believe this to be the most thematic quest ever made for this game. The fact that you try to keep active locations from becoming explored -since the locations are the walls of Helms Deep-, cause that would mean that the army of Saruman is one step close to victory, is something unique. I love it and each time I play it I feel like I am in there \n\n \n\n2. Journey in the Dark\n\nAgain, apart that it can become a bit tough, it is very thematic to lose a hero in order to kill Balrog, if you manage to escape before he appears, better for you\n\n \n\n3. Massing at Osgiliath\n\nI believe it will never get out of the list. Very thematic with great tough enemies. As the card pool progress it becomes easier but still it is tough and a good quest to test your decks and strategies\n\n \n\n4. Fog on the Barrow Downs\n\nIt is difficult, very thematic and I love when Tom appears to save the day. It can get you near madness when you are about to place the last progress to win and the great barrow appears with your threat on 49 though (has happened me twice)\n\n \n\n5. Battle of Lake Town\n\nSmuag is in there, need to say more? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1795898","commentId":1795898,"userName":"John Constantine","timestamp":1442303906,"content":"> 5. Battle of Lake Town\n> \n> Smuag is in there, need to say more? \n\nActually, yes. Because Smaug is also present in the Lonely Mountain quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1795942","commentId":1795942,"userName":"Nickpes","timestamp":1442307395,"content":"I do not like it that much to be honest  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1796024","commentId":1796024,"userName":"NathanH","timestamp":1442312996,"content":"I'm going to skew things a bit because I haven't played the later quests yet. So far (Mirkwood, Dwarrowdelf, Shadow, Black Riders, Over Hill) my top five would probably be\n\n \n\nFoundations of Stone: Here's a scenario that's really great to play without looking at the cards. It's so cool when you reach quest card 3! And of course all those tentancle things are lots of fun.\n\n \n\nConflict at the Carrock: It's a big battle against trolls, what more do you want? I like this one better than We Must Away, because you actually have to kill all the trolls, although We Must Away's trolls are more interesting.\n\n \n\nSiege of Cair Andros: This one took 5 attempts for us to beat, making it the toughest time we've had so far. It has interesting decisions, chaotic events, and an encounter deck that absolutely refuses to be tamed. There were very few moments where we ever felt the deck was under even vague control. Really felt under siege throughout.\n\n \n\nBlood of Gondor: I like scenarios that are flinging enemies around all over the place. Damage tokens everywhere! Very chaotic, but the two objective allies together with the take-or-reveal hidden cards mechanic gives you some interesting choices in the chaos.\n\n \n\nKnife in the Dark: This is a long procession of unusual and interesting decisions. When do we travel to the Pony? What about Midgewater? Do we want to keep the Weather Hills around for later? How do we deal with Bill Ferny? When is shuffling in a ringwraith acceptable [almost never!]? The only disappointment is that Weathertop itself is a bit of a sideshow. I've never eve travelled there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1796168","commentId":1796168,"userName":"awp832","timestamp":1442319931,"content":"In no particular order...\n\n1.  Assault on Osgiliath (NM).   I really enjoy this quest.  I love the aspect of taking control of locations.   That's really thematic and fun.   NM removes the ever-annoying Master's Malice but still keeps it tough with hard enemies.   A+.\n\n2.  The 7th Level (NM).  I'm gonna be honest here,  I played a LOT of normal mode 7th level.   It was one of my favorite quests at the time when we had a limited card pool.   Recently got the NM variant and I am loving this quest all over again.  \n\n3.  The Wastes of Eriador.  This quest can be punishing but it is really fun.  Day/Night is sort of intriguing.   I love the side-quest mechanic in general in the Lost Realm quests.  \n\n4.  Intruders in Chetwood.   A lot of people have said this quest is easy,  but I disagree.   Perhaps if you have a strong deck against the particular challenges this quest gives it might be easy.  Generally though, I don't find it to be so.   No forced engagements can be surprisingly tricky when you're raising your threat by 3-4 points a turn.\n\n5. Journey Along the Anduin (NM).  It's a solid quest,  and it's such a good baseline of what you're up against.   You have to quest and fight,  there isn't really anything tricky going on here,  just can your deck handle questing and combat?  It's I think the best quest to test a new deck against.  And for that it makes the list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1796726","commentId":1796726,"userName":"Glowwyrm","timestamp":1442335081,"content":"In no particular order:\n\n \n\n1.  Helm's Deep: I've played it solo, two and three player and it's been great every time.  It's definitely easier solo, but not so easy that you can just slam through it without thinking like some quests.  It feels appropriately epic, there's tons of strategic decisions to make, and even if you feel like you've got things in hand, the encounter deck can fight back hard to take the lead.  That's rare in a quest.\n\n \n\n2.  Wastes of Eriador: Love/Hate relationship with this scenario.  It's hard solo, and brutal the more players you add.  The inability to cancel encounter cards at night feels cheap.  But it's so dang thematic, having the Wargs jump in and out of the staging area, staying away in the day and swarming you at night, questing hard in the day and prepping for combat at night, that I love playing it. \n\n \n\n3.  Trouble in Tharbad: Such a unique and interesting scenario.  Sure it's easy, but there's so many fun shenanigans to be done with the low threat and it's always fun spinning the threat dial down to zero (without having a Balrog in the staging area).  Escape from Mount Gram might eventually take this scenario's place, but I like that this scenario is just a tad more difficult and that I don't have to create a special deck in addition to normal setup.\n\n \n\n4.  Nightmare Siege at Cair Andros:  They nailed this one.  This is one of the best quests in terms of theme and difficulty.  It's hard, but not in the cheap, frustrating way that the original scenario is, and the addition of more battleground locations makes it feel like you're running from place to place trying to keep the fortress from being overrun.  Always a tense fight to the finish.\n\n \n\n5.  Foundations of Stone: Always a blast in multiplayer.  It's the first time the designers separated the players, and I still think it's the best way it was done.  It feels thematic to have all your stuff washed away and be lost in the dark facing nameless things, and there's always the real danger of landing at the wrong stage 4 and getting wiped out of the game. \n\n \n\nHonorable Mentions:\nMassing at Osgiliath: Still lots of fun to play and not a pushover.\nMorgul Vale: Some of my most epic wins came against this scenario.\nBattle of the Five Armies:  Now eclipsed by Helm's Deep, but they did a good job of making it feel like you are fighting a battle on multiple fronts.\nPeril in Pelagir NM: Kept the feel of the original while cleaning up the unnecessarily frustrating cards.\nJourney Along the Anduin (NM and Standard): Still one of the best scenarios in the game.  If this scenario wasn't in the Core Set, I probably wouldn't have bought any products beyond it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1796870","commentId":1796870,"userName":"Teamjimby","timestamp":1442338470,"content":"In semi-chronological order:\n\n \n\n1. Foundations of Stone - As someone that rarely plays solo, I really enjoy this quest because of the split staging areas.  This is probably still my favorite multiplayer quest, even if it is now on the easier side.  I also appreciate the unpredictability of the quest cards, because you could potentially lose all your resources, lose all your cards, or be facing 4 enemies.  There is no way to prepare for all of those.\n\n \n\n2. Steward's Fear - IMO, Heirs and Against the Shadow is the weakest cycle.  Too many cards are outright punishing and I generally don't enjoy the battle and siege.  But Steward's Fear stands out from the other quests.  Similar to Foundations of Stone, the unpredictability and variability of the quest makes it hard to prepare for.  The underworld deck is a nice addition because it changes the way that enemies appear.  Other than Steward's Fear, I'd be totally fine if I never played a quest from that cycle again.\n\n \n\n3. Fords of Isen - This might be my favorite quest of all time, even though it doesn't do anything too crazy.  I think the time mechanic is fantastic, but some of the other quests in the cycle go a bit overboard with it.  This one has just enough pressure that you need to hurry, but it doesn't crush you.  I really appreciate the card draw hate with the Dunlendings.  It changes the meta and creates unique player choices about whether or not you want to draw/discard cards.\n\n \n\n4. A Shadow of the Past - Really, all of the LotR saga quests are fantastic.  They continue to maintain a high quality and even improve with each box.  But the first quest has always been one of my favorites.  Maybe just because it was the first, but it does such a great job capturing the feeling of hiding from nazguls.  You are constantly in fear of failing a hide test and need to be careful to not move too fast.  Honorable mentions to Journey in the Dark, Breaking of the Fellowship, and Helm's Deep.\n\n \n\n5. Old Forest - Most of the POD quests are a lot of fun in multiplayer, but I think Old Forest is my favorite.  The locations are unique and make traveling an important decision.  You get the boss fight at the end, which is always fun.  The random quest cards again make planning unpredictable.  My only complaint is that it's nearly impossible to win in 3 or 4 player unless you have northern trackers.\n\n \n\nAfter putting together this list, I think my favorite aspects in quests are:\n\n- Random/unpredictable quest/encounter cards\n\n- Unique mechanics that challenge the standard meta (except for battle and siege)\n\n- Quests that are actually beatable in 3 to 4 player"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1797262","commentId":1797262,"userName":"Lecitadin","timestamp":1442347273,"content":"OK, here we go :\n\n \n\n1- Hills of Emyn Muil\n\n2-The Long Dark\n\n3-The Siege of Cair Andros\n\n4-Escape from Mount Gram\n\n5-Passage through Mirkwood\n\n \n\nAll quests are played on Easy Mode.\n\n \n\nI like to play these quests mainly when I'm tired, have a lack of concentration and don't want to do any fancy deck building.\n\nEdited September 15, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1797480","commentId":1797480,"userName":"Slothgodfather","timestamp":1442353042,"content":"Here is my current list, not in any particular order:\n\n \n\n1. Stewards Fear - I love the randomness of the plot/villain combination and how certain plots can punish certain deck builds.\n\n2. Three Trials - again with the randomness of encounters\n\n3. Stone of Erech - specter keyword and the time of day phases make this just thematic and awesome.\n\n4. Escape from Mount Gram - that setup!  I love how the designers keep coming up with ways of making the setup feel appropriate for the quest rather than just simply starting with some random cards for starter threat.\n\n5. Shadow and Flame - some of my favorite art (Counter-spell, etc.) as well as fun design space trying to stay out of the reach of Durin's Bane."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798060","commentId":1798060,"userName":"GrandSpleen","timestamp":1442373595,"content":"No particular order,\n\n \n\n1. Dungeons Deep and Caverns Dim.  Big fan of the riddles, and a couple of my most dramatic and memorable games happened with this quest.\n\n \n\n2. Fog on the Barrow-downs.  Dripping with theme, still like the Wights better than any other undead enemies we've seen to date, and it's too cool when Tom pops up to help (especially if you're stuck in a barrow when it happens).\n\n \n\n3. Steward's Fear.  Can't beat this one for replayability, also a very thematic quest, moderate difficulty so I'm not afraid to play it with a deck that hasn't been tailored for it, and the different combinations of plot and villain make it unique.\n\n \n\n4. Flies and Spiders.  Another 'split staging areas' scenario, and probably the most unique of them.  The game plays very differently for you depending on where you end up.  Also just a fan of the spider theme and this portion of the book.\n\n \n\n5. Celebrimbor's Secret.  My favorite quest of the Ring-maker cycle.  The Indiana Jones references are just bizarre, unexpected, but somehow awesome.  It's also of moderate difficulty, but more on the side of 'needs a tailored deck' in my experience.  It's a fairly vanilla quest as far as mechanics go, it has the Scour mechanic but that's quite similar to a number of other effects we've seen (the Lost keyword from The Long Dark immediately comes to mind), but I like it for the other things I mentioned.\n\n \n\nNow let's go read the thread from last time and see how my list compares...\n\n \n\nedit: only Dungeons Dim and the Barrow-downs are on there.\n\nEdited September 16, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798186","commentId":1798186,"userName":"Khamul The Easterling","timestamp":1442377722,"content":"Grandspleen; I do believe this is the first time AJtR didn't make your top 5 list! Interesting interesting haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798198","commentId":1798198,"userName":"divinityofnumber","timestamp":1442378026,"content":"No particular order:\n\n \n\n1) Steward's Fear\n\nEpic replay value and a nice challenge. I continue to return to this quest. \n\n \n\n2) Watcher in the Water\n\nGreat theme and mechanics; even the shadow effects are very well done. \n\n \n\n3) Peril in Pelargir\n\nThis scenario is just a ton of fun. 3- or 4-player games are particularly fun. \n\n \n\n4) Foundations of Stone\n\nThis one feels frantic and has great mechanics. \n\n \n\n5) Encounter at Amon Din\n\nPlaying with 3 or 4 players is amazing. I really enjoy this scenario. The mechanics and theme are excellent. \n\n \n\nI also love, as a whole, the Khazad Dum nightmare set of scenarios. Honorable mention to Fog on the Barrow Downs; so much fun to play as a group. \n\n \n\nThe above scenarios really have a great, almost d20 tabletop feel to them. I've found myself sitting at the kitchen table late at night after everyone else is sleeping, sipping a cold beer and laughing to myself, just having fun with these scenarios; it almost feels like you're playing a round of a table-top RPG. They have great theme and really fun mechanics. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798208","commentId":1798208,"userName":"GrandSpleen","timestamp":1442378364,"content":"Rhosgobel?  I don't remember ever putting that on any top 5 list, but I don't hate it... so maybe? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798295","commentId":1798295,"userName":"alexbobspoons","timestamp":1442384223,"content":"Hmm well I have played progression up to The Long Dark, so that affects my voting, but:\n\nHunt for Gollum (just felt so well balanced out of core)\n\nJourney to Rhosgobel (enjoyed specific deck building)\n\nRoad to Rivendell (just so balanced and fun)\n\nJourney Down the Anduin (memories of how good while starting out)\n\nMassing at Osgiliath (felt challenging yet doable and good location mechanics)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1798314","commentId":1798314,"userName":"Olorin93","timestamp":1442386083,"content":"Disclaimer - I haven't played past Encounter at Amon Dín except for VoI and Intruders in Chetwood, though I own all Ringmaker packs. In no particular order:\n\nThe Road to Rivendell (Love the narrative - only downside is I can't use my Arwen ally. It's only that one treachery card that drags this scenario down.)\n\nThe Watcher in the Water (Great theme, great art. Love the tentacle enemies and effects. Good difficulty level. Gate mechanic is a bit random, though.)\n\nThe Long Dark (I have a love-hate relationship with Moria in all Tolkien writings and adaptions, but I really dig this scenario. Too easy for a DL7, though.)\n\nPeril in Pelargir (This kicked me and my friends all the way back to the Shire for so long, but it is a well thought-out scenario. It's a breath of fresh air after the first two cycles and the Thug enemies are fun.)\n\nIntruders in Chetwood (This is a fun quest with great theme - I love Bree in the books. I hated this quesr at first, but my hatred has moved on to the Weather Hills - which I can't seem to beat, at least not in solo play.)\n\nHonorary mention: The Steward's Fear (I've only played this once, but I'm going to go back right now! Fun theme and it seemed to have excellent replay value.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1800187","commentId":1800187,"userName":"DunedainLoreKeeper","timestamp":1442442114,"content":"In no particular order my favorites so far are:\n\n \n\n1. Journey along the Anduin\n\nIt has it all, great boss battle, thematic questing section and a massive brawl at the end where you can almost ignore questing for a change. It set the standard for starting threat. It remains one of the best quests that generates stories afterwards.\n\n \n\n2. Massing at Osgiliath\n\nAnother thematic homerun. Crossing the Anduin feels a bit 'gamey' as you're trying to get a ranger to bite the bullet for you, but the final sprint for Minas Tirith is worth it.\n\n \n\n3. Foundation of Stone\n\nEverything Moria in one quest: a bit with orcs, getting lost, fighting unnamed evils etc. It's also great at generating stories with where players end up.\n\n \n\n4. Blood of Gondor\n\nHaving 2 additional characters with reasonable stats gives a lot of freedom to build a deck which I love about it. Like Dunland Trap, it feels like an actual ambush. Surviving it always feels epic.\n\n \n\n5. Into Ithilien\n\nSo many memorable encounter cards. pre-errata Blocking Wargs where great fun for solo. But the Ithilien Road (get off the road!) and Mumak also are burned into my memory.\n\n \n\nHonorable mentions (but no points from me):\n\nPeril in Pelargir\n\nThis one just makes me laugh. You have a bar-fight with eagles and ninja-assassins smashing through the windows, followed by a chase through Pelargir with every thug from Gondor (and the innkeeper with the bill for the chairs you smashed) on your heels. Normally I play LotR soundtrack in the background, this quest requires Yakety Sax. So silly it becomes hilarious!\n\n \n\nSiege of Cairn Andros\n\nMy favorite 'protect the castle' quest. I love how you make decisions wether to save a section or give up on them. Unfortunately it's hatred for non-tactics on top of the tactics-favored battle/siege questing makes it a little bit too narrow in deck possibilities which I dislike a lot. And it's a lot less interesting in 3-4 player games.\n\n \n\nHills of Emyn Muil\n\nYeah, I went there. Being a fan of the book before the movies, LotR for me is not just endless combat and action but mostly long travels and trying to stay low. Emyn Muil is one of the few quests that captures that 'endless travelling' feeling from the books. Where there isn't an orc behind every tree and under every rock. But gameplay wise it gets old, and I only enjoy it if I'm playing it as part of a series with the same deck where this quest tests it's location management capabilities while others test it's combat.\n\n \n\nThe Dunland Trap\n\nWell, it stresses me out, so it's a thematic home-run don't you think?\n\n \n\nI'm not a big fan of the ringmaker cycle in general because there are so many different triggers II often missed a few which nullifies my victory. I have to spent to much brainpower on keeping the mechanics working I feel. I enjoyed the Lost Realm quests, but they where lacking a game-defining moment that you want to talk about after the game is over. Like the first time we killed the Hill-troll. The mechnics (and side-quests) where great though, so I'm looking foreward to playing more of this cycle. So no new quests from me in the top 5, but plenty to look foreward to. I still haven't played all ringmaker quests and very few saga quests, so I can't comment on those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1800220","commentId":1800220,"userName":"Greyhound78","timestamp":1442442755,"content":"- Massing at Osgiliath - with new cards is not so hard, but I like to play it again\n\n- Steward´s Fear - very good quest, hard and thematic \n\n- Trouble in Tharbad - easy quest, but interesting and good for testing of player decks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n- Wastes of Eriador - very hard new quest, but I like to play it\n\n- Khazad dúm - all 3 quest, i like the story in dwarves mines and I like to play it with dwarves decks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 16, 2015 by Greyhound78"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1800393","commentId":1800393,"userName":"sappidus","timestamp":1442447119,"content":"The Morgul Vale - I think I failed this one before beating it more times than any other single quest. It really forced me to tech my decks completely differently than usual to beat the Nazgul, and every time I pull out the quest again, it's never a boring time, win or lose. (Honorable mention to The Three Trials, the other 3-boss battle whose added stress of randomization, Time, and the last stage resurrection makes it awesome in an entirely different way.)\n\n \n\nFlight from Moria - With its random quest stages, this was the first quest that truly made me feel lost, with a claustrophobia so total that all I wanted to do was get out. How thematic for Khazad-dum, right? (Honorable mention to Journey in the Dark, which provides, again, an entirely different reason for you to rush through the mines.)\n\n \n\nThe Stone of Erech - As my playing partner said, \"Man, that Derufin kid sure got us into a lot of trouble.\" Thematic home run with Midnight creeping ever closer, and the way the quest inexorably ramps up is my favorite in-quest difficulty curve in the game. (Honorable mention to Flight to the Ford, which also inspires a feeling of \"gogogo...!\")\n\n \n\nFlies and Spiders - That moment when you reveal Stage 3A and knock everyone the first player controls unconscious, except Bilbo? And Bilbo has to go around waking everyone up? Still my single favorite \"Hoooooly crap\" encounter deck moment. (Honorable mention to The Dunland Trap's Stage 2A.)\n\n \n\nHelm's Deep - There's no way to luck your way through this one (well, with more than one player). Beating this made me feel like I'd truly accomplished something, which is testament to the toughness (no pun intended) of the enemies, the mercilessness of the treacheries, and locations that really force you into tough decisions and tricky plays. Not to mention the quest design itself: it always seems like you've been battling against insurmountable odds for hours and hours, then you glance down and you still only have 3 tokens on The Defense of Helm's Deep. (Honorable mention to... well, there ain't nothin' like Helm's Deep, is there.)\n\nEdited September 16, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1800487","commentId":1800487,"userName":"jjenks476","timestamp":1442451187,"content":"Wastes of Eriador\n\n \n\nNM Knife in the Dark\n\n \n\nNM Into Ithilien\n\n \n\nNM Seventh Level\n\n \n\nNM Morgul Vale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1800648","commentId":1800648,"userName":"PsychoRocka","timestamp":1442456269,"content":"> - Massing at Osgiliath - with new cards is not so hard, but I like to play it again\n> \n> - Steward´s Fear - very good quest, hard and thematic \n> \n> - Trouble in Tharbad - easy quest, but interesting and good for testing of player decks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> - Wastes of Eriador - very hard new quest, but I like to play it\n> \n> - Khazad dúm - all 3 quest, i like the story in dwarves mines and I like to play it with dwarves decks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm going to count the first four votes but can't count that fifth one as it is one vote for three different quests. Choose one of the three as your favourite if you'd like or ill just count your other four  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1802155","commentId":1802155,"userName":"Greyhound78","timestamp":1442509310,"content":"Sorry, as last of my favourite quests i vote Into the pit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188438-your-favourite-5-quests-and-why-round-2/?do=findComment&comment=1806430","commentId":1806430,"userName":"Denison","timestamp":1442669716,"content":"1. Journey Down the Anduin (NM) - a location with 10/10 stats?!? Beautiful. All of my decks must pass a first round Hill Troll test to be found worthy.\n\n2. Passage Through Mirkwood - Great way to intro the game to someone. My favorite for nostagic reasons. My first victory!\n\n3. Battle of Five Armies - The pressure of three simultaneous quest cards was so intimidating! Great feeling to beat this quest.\n\n4. Celebrimbor's Secret - Loved the Indy homage.\n\n5. Stone of Erech - Always feel good for two quest cards before all hell breaks loose."}]}