{"url":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/","title":"Recommendations on an additional solo game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799373","commentId":1799373,"userName":"Trialus","timestamp":1442426517,"content":"Howdy all, \n\n \n\nTL;DR....Looking for recommendations of another solo game from people who like  the Lord of the Rings LCG.  \n\n \n\nFirst...I hope it is OK to put this here as it isn't directly LOTR LCG (or even FFG) related, but as LOTR LCG is my favorite game and I am looking for some thing additional to scratch the same itch I though this would be the most productive place to ask.  If it isn't appropriate to post this here, I apologize and am OK with it being moved/deleted by the mods.  \n\n \n\nI have been the Lord of the Rings for about two years now and have found that, while I have a good time playing with others, it is really as a solo game that I most enjoy it.  Being able to play a little bit more slowly and really sink into the adventure has become one of my favorite leisure activities.  Everything about the game is really so spot on...from the lore and beautiful artwork to the puzzle aspect of deck building/tweaking to how good a job the devs have done to marry theme with mechanics...heck, even the LCG format itself have all come together to make it a great game.  While I haven't nearly exhausted the available content (still a few quests I haven't played and lots of room to replay quests and get into Nightmare), I have been itching to add another solo game to my collection and thought that other LOTR players would be a good group to solicit advice from.\n\n \n\nI have a few games I am considering and wanted to hear from folks who might have experience with them.....\n\n \n\nThe ones I am considering are...\n\n \n\n-Pathfinder ACG \n\n-one of the Legendary games (Marvel, Aliens, Predator)\n\n-Thunderstone Advance/Numenera\n\n-Dungeon Crawler (just learned of this one, looks really interesting...)\n\n \n\n I've also looked at Warhammer Quest ACG,  Mage Knight and Friday...Already planning on getting Warhammer, MK looks more complex than I'm ready to commit to and the theme for Friday just doesn't do it for me.  I've done a bit of research on all of them, but would love any input from other LOTR players.\n\n \n\nThank you in advance!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799412","commentId":1799412,"userName":"Raven1015","timestamp":1442427129,"content":"Of the ones you listed, I can only speak to Pathfinder ACG. I do collect that one, but don't get to play it much. The positives of Pathfinder are the leveling up system and getting some of the feel of a solo RPG experience. You also don't have to do any deck building in advance, other than swapping in new cards/swapping out old ones. The negatives are that combat is much less interesting than LOTR LCG, basically involving a single die roll to beat a number. It's definitely less strategic/tactical than LOTR, although there are a few meaningful decisions to be made.\n\n \n\nAs for other solo games to throw out there...\n\n \n\n* Sentinels of the Multiverse: Can be played solo. Superhero theme. No deck building and can be a bit fiddly, but lots of different characters and is good fun.\n\n* Eldritch Horror: Great game with a horror/Cthulhu theme. A longer game than LOTR LCG and some of the others on your list, but is pretty straightforward for a board game, unlike something like Mage Knight.\n\n* Death Angel: Warhammer/40K theme. Lots of strategy involved. Can be very tough. No deck building. May become repetitive if you play it a ton.\n\n \n\nThere are tons of cooperative/solo games coming through Kickstarter, but that might be some time away if you're looking to buy now. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799447","commentId":1799447,"userName":"divinityofnumber","timestamp":1442427815,"content":"I am an avid LOTR LCG player and I am very excited for Warhammer Quest. I think that it will be a lot of fun. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799498","commentId":1799498,"userName":"Lecitadin","timestamp":1442429010,"content":"My recommendations :\n\n \n\n-Legendary Alien, it can be quite difficult (the new Predator one is 95 % the same, the same price but with only 2 missions, Aliens covers the 4 movies), so Aliens give me more bang for your buck (and they announced a Legendary Firelfy for next year!!!!). It is also an extremely well balanced game.\n\n-Legendary Marvel is less difficult and can be quicker and, I think, is a lot of pure fun. And the artwork is super nice..\n\nFor both those games, they can easily be played solo 2 handed, which is the best way to go, I think (if you beat Alien pure solo, I want to see a video!!!)\n\n \n\nI would not recommend Sentinels of the Multiverse, because this game requires A LOT OF BOOK KEEPING, it was not really meant to be played solo. And why I say book keeping, it's things like cards that able you to deal damage to one of the cards that dealt damage to one of your characters THE PREVIOUS TURN.... you almost need to take notes of everything that happens... pretty tedious... I sold the game after a few tries. And it's almost impossible to win with only one hero, and the book keeping gets worst when you play solo with more than one hero.\n\nBut... if you don't mind the book keeping and a lot of game mechanics, go for it.. but for the artwork alone, Legendary Marvel is way better, in my opinion.\n\nEdited September 16, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799522","commentId":1799522,"userName":"Teamjimby","timestamp":1442429568,"content":"I played through about half of the Pathfinder ACG before I got bored with it.  I found it to be too light and repetitive, but the campaign feeling is great.  It can work if you don't mind a ton of dice rolling with limited decisions.  Raven described it well above.\n\n \n\nMage Knight is fantastic, but as heavy as it gets.  You're looking at probably 3 hours per game, so it can be hard to get to the table unless you have a dedicated gaming area where you can leave it out for a few days.\n\n \n\nI play Legendary (Marvel) a lot with my wife.  I don't think it's particularly well suited for a solo game, but there are definitely some people that play it.  The base game is pretty easy if you are playing full co-op (or solo), so you will need to get the Dark City expansion.\n\n \n\nFriday is a decent little deck builder.  It's more of a filler and you can solve/optimize the strategy after a few plays, at which point you are just hoping for lucky draws.\n\n \n\nI've only played it once and it wasn't solo, but I really enjoyed Assault on Doomrock.  It's like a whole fantasy campaign in ~2 hours where you alternate between adventuring and combat for 3 rounds.  The adventuring is really streamlined but flavorful.  Combat is also kind of abstract because there are spacial/range components, but no board.  You level up, get loot, unlock new abilities, etc. and then have to fight a big bad boss.  Tough to win, but a lot of fun to play.  It has a humorous fantasy theme, but the mechanics are really solid.  It's hard to find right now, but there is a new batch coming in December or January.\n\n \n\nGloomhaven looks fantastic with really innovative combat and an epic campaign system.  But it's currently on Kickstarter (another 13 days), so it won't be available until Q2 2016."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799633","commentId":1799633,"userName":"Bullroarer Took","timestamp":1442432106,"content":"I'm thinking of trying Eldritch Horror based on the reviews.  A few others in here play it already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799698","commentId":1799698,"userName":"jnicol","timestamp":1442433485,"content":"Of the games you've listed I can only speak to Friday. It's a good solo deck builder (in the Dominion sense of the term) but it has a pasted on theme and feels very light compared to LOTR LCG. I don't regret buying it, but after the epicness of LOTR I think it would disappoint me if I bought it now. It doesn't really bring anything new to the deck building genre. Makes a nice portable filler game though.\n\nTop of my own solo wishlist are Legendary Encounters and Eldritch Horror."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1799932","commentId":1799932,"userName":"alexbobspoons","timestamp":1442437545,"content":"Also consider looking to your favourite theme in a card game, because on places such as boardgamegeek there are lots of rules variants making 1vs1 games into solo. Some will possibly not be so good but others are very well respected as there are clever people out there writing things and just because a game isnt orginally designed solo it doesnt mean that a very good solo version cannot be written for it.\n\n \n\nSo, its worth checking 2 player games and seeing what is there unofficial. Some solo variants are even better thought of than the 2 player.\n\n \n\nI now this isnt exactly what you were after but I thought it was worth mentioning anyway :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800098","commentId":1800098,"userName":"ricedwlit","timestamp":1442440331,"content":"I can definitely recommend Eldritch Horror for solo play. If you are looking to get into a Lovecraft Themed experience, then I highly recommend it. (Aside: you could also delve into Arkham Horror, however EH is easier to get into and is more polished). Game play will be longer than LOTR (although some of the later quests are taking a while...) so it may be that you'll need to wait for weekends to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800195","commentId":1800195,"userName":"tricil","timestamp":1442442243,"content":"I accidently stumbled over a recent game called \"Assault on Doomrock\" (first expansion is currently on Kickstarter), which can be played solo and it seems to have fairly unique and cool mechanics. I saw a couple of very positive recommendations and will also give it a try myself within the next couple of weeks. Does anyone here have previous experiences with this game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800355","commentId":1800355,"userName":"Teamjimby","timestamp":1442446083,"content":"> I accidently stumbled over a recent game called \"Assault on Doomrock\" (first expansion is currently on Kickstarter), which can be played solo and it seems to have fairly unique and cool mechanics. I saw a couple of very positive recommendations and will also give it a try myself within the next couple of weeks. Does anyone here have previous experiences with this game?\n\nI played it once (described above), and the next day put in a pre-order for the next print run, which I almost never do.  The mechanics are great, streamlined and somewhat abstract.  Theme and art are humorous fantasy, but not in a Munchkin sort of way.  It captures a whole campaign feeling in 2-3 hours.  If you have an hour to kill, Rahdo did a runthrough [https://www.youtube.com/watch?v=UqzBS-wlGzE] of it that shows how it works. \n\nEdited September 16, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800402","commentId":1800402,"userName":"Trialus","timestamp":1442447401,"content":"Whoa...thanks for all of the feedback and suggestions!  \n\n \n\nWhat you guys have said about Pathfinder is kind of what I expected.  I hadn't heard of Assault on Doomrock before, but it sounds interesting.  I'll have to check it out.  I have looked at Eldritch Horror before, but had forgotten about it.  It sounds like some folks really like it for solo play.  Might be time to watch a few gameplay vids of it.  I've actually got Sentinels.  My son and I play it somewhat frequently and like it quite a bit, but it IS a bit fiddly.   Legendary Aliens seems like a really great game, glad to get some reinforcement on that.\n\n \n\nEven though no one has mentioned it I might also take the plunge Dungeon Crawlers...Something about it intrigues me.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800492","commentId":1800492,"userName":"jjenks476","timestamp":1442451487,"content":"Imperial Settlers is actually a great solo experience.\n\n \n\nSpace Hulk Death Angel is an awesome little card game that feels like a tactical miniatures game.\n\n \n\nRobinson Crusoe is awesome.\n\n \n\nEldritch Horror is fun.\n\n \n\nI do not enjoy Legendary Marvel... Too bloody easy, and the rules are rather spotty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800515","commentId":1800515,"userName":"Authraw","timestamp":1442452224,"content":"Love the Legendary Alien game, it's my current go-to when nobody wants to play LotR. Not sure how good it is solo, but I suspect it's alright.\n\n> There are tons of cooperative/solo games coming through Kickstarter, but that might be some time away if you're looking to buy now.\n\nOh, do tell! I hate finding out after the fact that I missed a good Kickstarter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800523","commentId":1800523,"userName":"jnicol","timestamp":1442452397,"content":"> Space Hulk Death Angel is an awesome little card game that feels like a tactical miniatures game.\n\n \n\n+1.\n\n \n\nSH:DA was my benchmark solo game before I got into LOTR. They've managed to pack a lot of theme into such a small box.\n\n \n\nBe prepared to lose though. A lot. Every game feels like Escape from Dol Guldur!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800536","commentId":1800536,"userName":"Teamjimby","timestamp":1442452742,"content":">  \n> \n> > There are tons of cooperative/solo games coming through Kickstarter, but that might be some time away if you're looking to buy now.\n> \n> Oh, do tell! I hate finding out after the fact that I missed a good Kickstarter.\n> \n>  \n\nCheck out Gloomhaven and Gloom of Kilforth.  There's a couple weeks left for both of them.  It's interesting timing that these two Gloom-named fantasy co-ops are on Kickstarter at the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1800538","commentId":1800538,"userName":"jnicol","timestamp":1442452752,"content":">  \n> \n> Oh, do tell! I hate finding out after the fact that I missed a good Kickstarter.\n> \n>  \n\n \n\nI don't know which games Raven1015 was referring to, but one that caught my eye and is solo friendly and fantasy themed is Gloom of Kilforth which is designed by Tristan Hall aka Ninjadorg, who has made some custom scenarios for LOTR LCG:\n\n \n\nhttps://www.kickstarter.com/projects/tristanhall/gloom-of-kilforth-a-fantasy-quest-game-1-4-heroes [https://www.kickstarter.com/projects/tristanhall/gloom-of-kilforth-a-fantasy-quest-game-1-4-heroes]\n\n \n\nAlso Gloomhaven, which has been mentioned already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801401","commentId":1801401,"userName":"Lecitadin","timestamp":1442491832,"content":"> I do not enjoy Legendary Marvel... Too bloody easy, and the rules are rather spotty.\n\n \n\nThe new Secret Wars expansion lets you play with 2 masterminds, which makes it like a Nightmare mode..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801434","commentId":1801434,"userName":"Julia","timestamp":1442492904,"content":"You could also consider Elder Sign: the core game is rather easy to beat, but if you play with Gates of Arkham, you have a really interesting and challenging game to face. The setting is lovecraftian (like for Arkham Horror and Eldritch Horror), but the playtime is consistently shorter: 45 minutes top and you're done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801689","commentId":1801689,"userName":"Lecitadin","timestamp":1442499500,"content":"Yep, I should have mentioned Elder Sign also, I have it and it's pretty neat, with fabulous artwork.\n\n \n\nI REALLY hope FFG would release an expansion that allows to play Star Wars the card game in solo mode. Wiat... hmmm... maybe not.... just thinking about it hurts my credit card.... Forget the idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801745","commentId":1801745,"userName":"player1922162","timestamp":1442500791,"content":"Robinson Crusoe!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801845","commentId":1801845,"userName":"Nickpes","timestamp":1442502731,"content":"I also recomend Robinson Crusoe. You can feel the theme while playing and it can be very tough, which I like. There are scenarios very difficult to overcome"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1801847","commentId":1801847,"userName":"alexbobspoons","timestamp":1442502747,"content":"> I REALLY hope FFG would release an expansion that allows to play Star Wars the card game in solo mode. Wiat... hmmm... maybe not.... just thinking about it hurts my credit card.... Forget the idea!\n\nThere is an unofficial solo variant on boardgamegeek that seems to be very well respected by the BGG forum posters. Looks to have a lot of work gone into it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1802481","commentId":1802481,"userName":"Julia","timestamp":1442518007,"content":"> I REALLY hope FFG would release an expansion that allows to play Star Wars the card game in solo mode. Wiat... hmmm... maybe not.... just thinking about it hurts my credit card.... Forget the idea!\n\n \n\nUse some Old Republic credits instead..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1802533","commentId":1802533,"userName":"ossderossmane","timestamp":1442519379,"content":"> Robinson Crusoe!\n\n \n\nI second that reccomendation. Like LotR, it's brutally hard, highly thematic and plays 1-4. There are 6 or 8 scenarios in the base box, and a lot of material. There's also an expansion (which I haven't tried). It's certainly on the heavier side, but there's a few starting guides etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1802646","commentId":1802646,"userName":"Trialus","timestamp":1442522311,"content":"Cool! I'll have to add Robinson Crusoe to my list to check out..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1802988","commentId":1802988,"userName":"Raven1015","timestamp":1442528624,"content":"To answer the Kickstarter question, I was mostly referring to Gloomhaven and Gloom of Kilforth. Especially the latter, as I've been promoting it on the Tales from the Cards Facebook since it looks so good and was designed by Ninjadorg (designed some custom LOTR scenarios, as was previously mentioned). But there also have been a bunch of other solo/coop games that have come through Kickstarter lately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188620-recommendations-on-an-additional-solo-game/?do=findComment&comment=1804129","commentId":1804129,"userName":"13nrv","timestamp":1442577392,"content":"Mage Knight is great !"}]}