{"url":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/","title":"Would fixed opening hand nurture the deckbuilding or harm it?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807635","commentId":1807635,"userName":"John Constantine","timestamp":1442738334,"content":"Don't know if anybody knows of it, but there was a recent new card game release called Ashes: Rise of Phoenixborn or something. Pretty interesting and fresh concept, but what catched my interest the most is that they don't draw opening hand, they look through their deck and assemble their opening hand with only one rule: no dublicates in the opening hand.\n\n \n\nI must say I find that concept extremely interesting and I immediately applied it to the our beloved LotR LCG and behan to think what consequences that might bring...\n\n \n\nYeah, \"THE GAME WILL BECOME TOO EASY\" is the first things that comes to mind. But... there is one thing that bugging me: it could enable the type of decks that otherwise would be not viable or otherwise to inconsistent to play. The type of decks that depends on a one or couple specific cards that are required for the deck to start going. Also, what it could do is open up more space that was previously filled with the duplicates of stuff you wanted to see in your opening hand. \n\n \n\nSo, what do you guys think?\n\n \n\n \n\nUPDATE: The conclusion that fully fixed hand is too much, however having some fixed cards in your opening hand at a decent expense is another story:\n\n \n\nBefore drawing their opening hands, players have an option to search their deck for up to 3 different (meaning no duplicates) cards and add to their opening hand, but for each that card they would draw 1 less card to their opening hand. This would mean that various opening hands might look like this:\n\n \n\n6 random cards\n\n \n\n1 fixed card + 4 random cards\n\n \n\n2 fixed cards + 2 random cards\n\n \n\n3 fixed cards\n\n \n\nNote: Mulliganing resets only the random part of the opening hand.\n\nEdited October 6, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807638","commentId":1807638,"userName":"Veve7","timestamp":1442738773,"content":"I am for fixed opening hand!This is a way to make the game less random and more strategic!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807646","commentId":1807646,"userName":"alexbobspoons","timestamp":1442739831,"content":"Hmm, I think it could lead to some very different decks yes, but I also think it would probably do more harm than good.\n\nJourney down the Anduin wouldn't be the same challenge at all and thats just core set.\n\nI also think it would make a lot of cards redundant or less useful in terms of card draw. Those cards that let you fetch things from your deck wouldnt be needed as much as well as simple additional draw cards. I think it would be a shame to lose these cards effectiveness and the mechanics surrounding them.\n\nGandalf, sneack attack, steward of gondor and born aloft would mean three straight turns of Gandalf from the very start, which could really devastate some quests that rely on a quick ambush.\n\nSo interesting new deck builds yes, but I think at too bigger price for the collateral damage :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807654","commentId":1807654,"userName":"Noccus","timestamp":1442741074,"content":"It is a interesting concept to be sure, but I'm guessing this Ashes: Phoenix something game is a pvp game?\n\nIn a pvp enviroment this is a turbo boost right at the start of the game on both sides. Not a bad idea at all.\n\n \n\nBut in a co-op game? More specifically in LotR, this will make the players way too strong.\n\nThe 1st few rounds are critical. If you then have some cards in your hands you just picked, alot of the tension (& fun with it) would fly out of the window.\n\n \n\nAlso, I really like taking card by card from my deck and only then knowing what I'm getting.\n\nIt's always a surprise, and then you'll have to work with what you get.\n\n \n\nSo no, I'm not going to try, and while I think it's not a bad idea for pvp games, it won't be for a co-op game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807681","commentId":1807681,"userName":"John Constantine","timestamp":1442742805,"content":"Now, with the points \"against\" presented here, what if...\n\n \n\nBefore drawing their opening hands, players have an option to search their deck for up to 3 different cards and add to their opening hand, but for each that card they would draw 1 less card to their opening hand? This would mean that various opening hands might look like this:\n\n \n\n6 random cards\n\n \n\n1 fixed card + 4 random cards\n\n \n\n2 fixed cards + 2 random cards\n\n \n\n3 fixed cards\n\n \n\nNote: Mulliganing resets only the random part of the opening hand.\n\n \n\n \n\nWould it be more fair, less harmful for the game flow and mechanics, etc.?\n\nEdited September 20, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807722","commentId":1807722,"userName":"Qaanaaq","timestamp":1442747366,"content":"We let me just share this:\n\nin a few quests i got to the point of frustration(Three trials, Dol Guldur), when not being able to win after 10-20 tries. It was usually streaks of small marginal things but I lost. But of course the many games were a good school to understand the quest, and to know what kind of opening hands just possibly did not stand a chance. So what I did, I allowed myself a bit of laxness and would allow multiple mulligans. Also with Dol Guldur certain setups just made it impossible to win, not to mention that my goal was to win with core set cards. \n\n \n\nBut a fixed hand? That seems too easy. \n\nFor some very thematic combo decks I would allow 2-3 mulligans. \n\n \n\n \n\nBUT another gamemechanical way could be game text. Like - Setup: include this card in your opening hand. Draw one less card. or something.... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807796","commentId":1807796,"userName":"Denison","timestamp":1442754481,"content":"There are definitely players who aren't great at deck building (like me) who would probably like the idea of not worrying about the chances of a particular card being drawn in x number of rounds.\n\n \n\nThat said, I would be sad to lose the excitement of seeing Black Arrow in my starting hand while playing JDtA. Certainly there are countless strategies to deal with Hill Trolls these days, but I would be too tempted to go get the BA every time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807960","commentId":1807960,"userName":"Ecthelion III","timestamp":1442762654,"content":"What if you could take as many mulligans as you wanted, but after your free one you would draw one fewer card each time?\n\nEx:\n\n6 Cards\n\nMulligan\n\n6 Cards\n\nMulligan\n\n5 Cards\n\nMulligan\n\n4 Cards\n\n(If you were really that desperate you could continue)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1807999","commentId":1807999,"userName":"ossderossmane","timestamp":1442763805,"content":"I like this concept a lot. Especially since it's something that reduces unnecessary randomness. All these \"if only I had Steward/Light of Valinor/Nenya\" situations don't need to happen anymore. That said, it needs to be built into the game by design. If I remember correctly, Ashes has much smaller decks and hand sizes. 7 cards of your choice is definitely too many. One card per player or one card per hero would be great though. How about a dedicated card for your hero? Beregond always gets his shield, Leadergorn the Sword that was broken, Galadriel and Elrond their rings? That would add an interesting aspect to hero design.\n\n \n\nI'd expect this to become quite common in future card games, it's one of those ideas that are so simple they seem obvious in hindsight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808019","commentId":1808019,"userName":"John Constantine","timestamp":1442764482,"content":"Opening hand is 6 cards, 7th one you draw during your first resource phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808027","commentId":1808027,"userName":"Hectarion","timestamp":1442764672,"content":"I swear, I was thinking this exact same topic (also prompted by ashes and my own limited play time with LoTR). It's amazing to see this thread because I really was truly imagining the same ideas.\n\n \n\nThe thought I had was that any fixed card gives up another card. so, exactly like someone posted above (3 fixed cards, 2 fixed and 2 random, 1 fixed and 4 random, or 6 random). \n\n \n\nI also thought that both for balance reasons AND thematic ones, the fixed cards could only be uniques. This sort of fits well in two ways. One, no sneak attack shenanigans and two, it feels thematic, like \"Glorfindel is never without his trusty steed\"\n\n \n\nYes, it certainly makes the game ever so slightly easier. BUT, you can make far more thematic decks. You need far fewer copies of certain uniques because you fix them in your hand! I hate having 3x Stewart of Gondor in my deck simply to increase the chances of it in my opening hand. That feels odd and wrong. \n\n \n\nAnyhow, I love the idea and I love that other people are feeling similar. I'm trying to just suss through if there's any other problems, but otherwise, this might be how I play for a while. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808128","commentId":1808128,"userName":"FetaCheese","timestamp":1442768036,"content":"I am against this opening hand method for Lotr LCG because:\n\n \n\n1. Combo decks would dominate. Combos would be set up so easily the encounter deck could never catch up. Imagine having Steward, Blood of Numenor, Gondorian Fire, a couple of threat reduction cards and Light of Valinor in your starting hand with Boromir. Madness.\n\n \n\n2. Lots of cards would be redundant,  including most card draw, most emergency cards like feint and strong, upfront heroes like Beorn buy the player time to set up the combo, etc.\n\n \n\n3. The game's mulligan rule is already too powerful. Its not the game mechanics that are at fault if one's decks sucks.\n\n \n\n4. It goes against the spirit of randomness that is inherent in all cardgames and seems more like a boardgame rule. Even the best decks some times go awry, thats normal. Luck of the draw should apply on the starting hand as well.\n\n \n\n5. The game is too mature to have these kind of sweping changes in its core mechanics, thoufh seeing an ability like this in a player card, e.g. a hero would be prety cool.\n\n \n\n6. There are practically never dead cards in one's deck. A mere 50 card deck is small enough already with the current draw options.\n\n \n\n7. You can just houserule it. If you prefer playing non-optimal decks or you are not much of a deck builder and you find the regular mulligan rule too punishing then by all means do it, this is a co op game so its all good. Just have fun, I mean I also regularly take a 2nd mulligan myself. But there is no need to break the game for others too.\n\n \n\nThe suggestion posted above about using the new MTG mulligan rule (mulligan as many times as needed but draw 1 card less every time, also look at the top card of your deck after each mulligan) sounds better, but I am no designer and can't foresee what consequences it could have for the game.\n\nEdited September 20, 2015 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808149","commentId":1808149,"userName":"FetaCheese","timestamp":1442768713,"content":"> Now, with the points \"against\" presented here, what if...\n> \n>  \n> \n> Before drawing their opening hands, players have an option to search their deck for up to 3 different cards and add to their opening hand, but for each that card they would draw 1 less card to their opening hand? This would mean that various opening hands might look like this:\n> \n>  \n> \n> 6 random cards\n> \n>  \n> \n> 1 fixed card + 4 random cards\n> \n>  \n> \n> 2 fixed cards + 2 random cards\n> \n>  \n> \n> 3 fixed cards\n> \n>  \n> \n> Note: Mulliganing resets only the random part of the opening hand.\n> \n>  \n> \n>  \n> \n> Would it be more fair, less harmful for the game flow and mechanics, etc.?\n\n \n\nIt is very harmful because players are encouraged to mulligan since the fixed starting card effect is so powerful. The smaller starting hand penalty is negated by extra card draw allowed from not being forced to have duplicates in  your hand. If you are sure to get Steward turn one, a huge benefit by itself, then you can afford only one copy of it in your deck, which leaves you with space for 2 other cards of your choice, like Deep Knowledge for example. Then you can accelerate the pace by which you go through your own deck quite significantly.\n\n \n\nUseless duplicate cards are part of the game btw and taken into account by the designers. It's not wrong or odd, it's quite normal for a deck building game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808158","commentId":1808158,"userName":"John Constantine","timestamp":1442769125,"content":"I would argue here with you, FetaCheese.\n\n \n\n1) Combo decks already dominate everything, this will be no change. The point is to make less powerful and more thematic deck viable. Also, read my suggestion in the middle of the thread, I'm now speaking from it's perspective.\n\n \n\n2) With the change I suggested, they won't.\n\n \n\n3) No, it is not. It is a much needed emergency that may even turn things worse. It's not about decks that \"suck\". Bad deck won't last even with 10 fixed opening hands card, but the game is extremely punishing and unloads on player from the get go, so most of the time the player is either powerdecking or playing easy mode if he wants to win, I'm silent about the nightmare. Once again, there are numerous decks that require that one or two things in their opening hands to work well, and will simply crumble without it. Fending them off just because they \"suck\" is just mean.\n\n \n\n4) This is just a matter of teste, I'm not going to argue about that, however you mentioned \"all cardgames\", while I use Ashes as an example, which has a completely fixed setup hand.\n\n \n\n5) I'm not trying to convince the designers to errata or stuff, I'm just theorycrafting.\n\n \n\n6) And there are spheres and setups that have limited draw access or don't have one at all. This kinda of rule would enable them. Especially when draw is kept mostly in the Lore.\n\n \n\n7) Break game for others? Did I broke the game for others by posting this thoerycrafting thread? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808226","commentId":1808226,"userName":"Gizlivadi","timestamp":1442771059,"content":"I was thinking this very same topic a while ago. To put it shortly, I would like to have something like this, maybe not a whole hand of your choosing, but in the end I think it's clear it will never happen. Most of the times when I play solo I just mulligan till I get one of the key cards I play first turn. It would be great if we could choose 2 or 3 cards in our starting hand so that we can include more cards in the deck instead of useless copies of cards you want to get as quickly as possible. But as I said, this will never happen unless they make a 2nd edition of this game and evaluate this proposal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808241","commentId":1808241,"userName":"Chris51261","timestamp":1442771360,"content":"There's lots of quests where your deck has to be operating at full strength turn 1 to even have a chance against. I'm all for anything that makes the game less about random draw and more about strategy. Good idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808281","commentId":1808281,"userName":"Hectarion","timestamp":1442772529,"content":"> There's lots of quests where your deck has to be operating at full strength turn 1 to even have a chance against. I'm all for anything that makes the game less about random draw and more about strategy. Good idea.\n\nThis, exactly. \n\n \n\nCard draw still matters in the game. You need more events and allies to play all the time. drawing more than one a turn still matters and getting the right ones when you need them matter. Tutoring for the right card still matters.\n\n \n\nHere's my proposal and I think it matches John Constantine's idea for the variant.\n\n \n\nFor your opening hand, you can fix 1-3 cards. For each card you fix, you draw one less random card in your opening hand. Fixed cards must be unique cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808376","commentId":1808376,"userName":"Authraw","timestamp":1442776534,"content":"Even getting to fix a single card is interesting and opens up deck design, I think. When you build a deck, you'd be thinking, \"What is my turn 1 card?\"\n\nIt becomes an interesting decision, sort of along the same vector as picking your heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808393","commentId":1808393,"userName":"Fingolfin Fate","timestamp":1442777143,"content":"I would say harmful: easier to get the broken combos going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808410","commentId":1808410,"userName":"John Constantine","timestamp":1442777870,"content":"> I would say harmful: easier to get the broken combos going.\n\nSee, I call that a lack of perspective. The only thing you mention is that it would make something that is already avialable easier. But, from what I've seen, those broken combos usually have no problems in setting themselves up without any houserules. However, what else it does is enables lesser class of decks which is extremely questionable or even unplayable otherwise, the point you entirely miss for some reason."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808483","commentId":1808483,"userName":"Ecthelion III","timestamp":1442781336,"content":"Spirit hero\n\n10 threat cost\n\n2W 3A 1D\n\n4 hit points\n\nSetup Action: Discard 2 cards from your hand to search your deck for a card and add it to your hand. (Limit 3 times per game.)\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808510","commentId":1808510,"userName":"jnicol","timestamp":1442782204,"content":"I think it is too late in the game's evolution for a rule change like this, but as a thought exercise I think that a fixed opening hand is a interesting idea.\n\n \n\nThe variant that has been described where you get one less random card for each fixed card in your opening hand sounds like a good way to balance things out.\n\n \n\nI can imagine a quest built around this mechanic, where the setup on the first quest card let players search their deck for X cards to add to their opening hand.\n\n \n\nI can also imagine a fixed opening hand working similarly to the game's official Easy Mode, so that players struggling against a scenario could fix their opening hand to make the scenario easier without removing gold border cards per Easy Mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808516","commentId":1808516,"userName":"Qaanaaq","timestamp":1442782506,"content":"a bit complicated but with one card, could the mechanic be phrased less complicated?\n\n \n\nneutral event\n\nMaking precautions\n\n \n\nno cost ( - )\n\n \n\nsetup: play after quest setup but before drawing starting hand.\n\nsearch your deck for X cards before drawing your starting hand. Limit X cannot be more than 3. Put Making precautions out of play.\n\nFor each card drawn this way your starting hand is less by 2X cards.\n\nThen draw your starting hand.\n\nYou cannot mulligan when drawing your starting hand this way.\n\n \n\nLimit one per deck.\n\n \n\nor could be possible: limit can be used once per 5 games :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 20, 2015 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808521","commentId":1808521,"userName":"Gizlivadi","timestamp":1442782634,"content":"Getting cards like Steward of Gondor, Light of Valinor, Vilya, Nenya, or Gondorian Shield in the opening hand makes a huge difference IMO, especially in solo. That should have been Easy Mode I think, or maybe \"You can start with one attachment of cost 2 or less in play\". "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808534","commentId":1808534,"userName":"Chris51261","timestamp":1442783123,"content":"If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808560","commentId":1808560,"userName":"Fingolfin Fate","timestamp":1442784315,"content":">  \n> \n> > I would say harmful: easier to get the broken combos going.\n> \n> See, I call that a lack of perspective. The only thing you mention is that it would make something that is already avialable easier. But, from what I've seen, those broken combos usually have no problems in setting themselves up without any houserules. However, what else it does is enables lesser class of decks which is extremely questionable or even unplayable otherwise, the point you entirely miss for some reason.\n> \n>  \n\nI should have checked the author of the post. I will not make this mistake again. Why even ask mr never miss anything?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808576","commentId":1808576,"userName":"FetaCheese","timestamp":1442784663,"content":"> I would argue here with you, FetaCheese.\n> \n>  \n> \n> 1) Combo decks already dominate everything, this will be no change. The point is to make less powerful and more thematic deck viable. Also, read my suggestion in the middle of the thread, I'm now speaking from it's perspective.\n> \n>  \n> \n> 2) With the change I suggested, they won't.\n> \n>  \n> \n> 3) No, it is not. It is a much needed emergency that may even turn things worse. It's not about decks that \"suck\". Bad deck won't last even with 10 fixed opening hands card, but the game is extremely punishing and unloads on player from the get go, so most of the time the player is either powerdecking or playing easy mode if he wants to win, I'm silent about the nightmare. Once again, there are numerous decks that require that one or two things in their opening hands to work well, and will simply crumble without it. Fending them off just because they \"suck\" is just mean.\n> \n>  \n> \n> 4) This is just a matter of teste, I'm not going to argue about that, however you mentioned \"all cardgames\", while I use Ashes as an example, which has a completely fixed setup hand.\n> \n>  \n> \n> 5) I'm not trying to convince the designers to errata or stuff, I'm just theorycrafting.\n> \n>  \n> \n> 6) And there are spheres and setups that have limited draw access or don't have one at all. This kinda of rule would enable them. Especially when draw is kept mostly in the Lore.\n> \n>  \n> \n> 7) Break game for others? Did I broke the game for others by posting this thoerycrafting thread? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n \n\n1. I have to disagree with you here, I think swarm decks like Dwarves especially but also Outlands are at least as strong if not stronger than true combo decks. I also read your 2nd post and replied to it above, please commend on it if you will.\n\n \n\n2. I also read your 2nd post and replied to it above, please commend on it if you will. I still think its a very problemati approach.\n\n \n\n3. Perhaps \"suck\" was too strong a term but the truth is a lot of people prefer to play subpar but thematically appealing decks. Nonetheless, I feel a second mulligan at no penalty is very powerful. Good decks include the tools to bring a combo together and if one's deck has no \"plan B\" in case one's deck is not ideal, that's the player's fault and not the designers. With the amount of card draw available, every deck can work in multiplayer and even single player. I do not want to be mean but I feel this is a playerbase issue here and the gap between player expectations vs actual CCG gameplay.\n\n \n\n4. It's a matter of taste, true. I consider Lotr LCG a \"classic\" card game with roots in the CCG tradition and I'd personally prefer for it to stick to the good old pillars of ccg gameplay.\n\n \n\n5. I know! Don't take what I write too seriously.\n\n \n\n6. True only in single player and with a growing card pool drawing is becoming a non-issue even for non-lore decks. Look at Galandriel for example, she gives lore a run for its money. O fcourse a lot of players will only play her if it feels appropriate to them, but imposing a self-limitation on one's self and then having a hard time because of it doesn't mean the game's mulligan rule sucks.\n\n \n\n7. I know, I know :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808581","commentId":1808581,"userName":"Ecthelion III","timestamp":1442784836,"content":">  \n> \n> I should have checked the author of the post. I will not make this mistake again. Why even ask mr never miss anything?\n\n12036546_433437200183012_781112764448348 [https://scontent-dfw1-1.xx.fbcdn.net/hphotos-xpa1/v/t1.0-9/12036546_433437200183012_7811127644483481505_n.jpg?oh=3824faa5f3e84f60240bd514e3e33770&amp;oe=569F1297]\n\nEdited September 20, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808586","commentId":1808586,"userName":"FetaCheese","timestamp":1442785033,"content":"> If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n\n \n\nI HATE to be THAT guy, I am no expert or anything and regularly get crashed by Nin-in-Eilph but...\n\n \n\n\"Well, we didn't draw our key cards, so we never stood a chance\" and \"we lose turn one\", especially in multiplayer, is indicative of some seriously problematic decks unless you are playing against a quest with a messed-up opening."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808597","commentId":1808597,"userName":"Ecthelion III","timestamp":1442785412,"content":">  \n> \n> > If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n> \n>  \n> \n> I HATE to be THAT guy, I am no expert or anything and regularly get crashed by Nin-in-Eilph but...\n> \n>  \n> \n> \"Well, we didn't draw our key cards, so we never stood a chance\" and \"we lose turn one\", especially in multiplayer, is indicative of some seriously problematic decks unless you are playing against a quest with a messed-up opening.\n> \n>  \n\nMore and more quests these days have beginnings that require you to have control over the encounter deck in the first few turns. While I agree that decks shouldn't rely on a couple cards to function, drawing a handful of expensive cards or cards that are only helpful late-game is bound to happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808618","commentId":1808618,"userName":"Chris51261","timestamp":1442786300,"content":"I'm exaggear\n\n \n\n>  \n> \n> > If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n> \n>  \n> \n> I HATE to be THAT guy, I am no expert or anything and regularly get crashed by Nin-in-Eilph but...\n> \n>  \n> \n> \"Well, we didn't draw our key cards, so we never stood a chance\" and \"we lose turn one\", especially in multiplayer, is indicative of some seriously problematic decks unless you are playing against a quest with a messed-up opening.\n> \n>  \n\nI knew I shouldn't have put \"turn 1\" in there. I was exaggerating to make a point. And against lots of the Nightmare decks, I'm standing by that. Lots of times your game isn't over after turn 1, but it might as well be. Scoop and reset. And there are quests where there are very few options outside of some kind of relying on certain cards. Consistently bad opening hands are indicative your deck needs work, but at the end of the day your fate is in the hands of pure probability. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808651","commentId":1808651,"userName":"PocketWraith","timestamp":1442787419,"content":"> There's lots of quests where your deck has to be operating at full strength turn 1 to even have a chance against. I'm all for anything that makes the game less about random draw and more about strategy. Good idea.\n\nBeing able to cope with the randomness of your draw is a key element of the strategy in this game.\n\n \n\n> See, I call that a lack of perspective. The only thing you mention is that it would make something that is already avialable easier. But, from what I've seen, those broken combos usually have no problems in setting themselves up without any houserules. However, what else it does is enables lesser class of decks which is extremely questionable or even unplayable otherwise, the point you entirely miss for some reason.\n\nGive examples of decks which aren't currently viable but would be under these conditions. I'm skeptical, because this game is pretty well designed to give a variety of effective options.\n\n \n\n> If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n\nThe most powerful decks, and a lot of less powerful but still good decks, will have means of dealing with not drawing their key cards right off the bat. If they never draw them at all it may be a problem, but that is a considerably smaller percentage.\n\n \n\n> I'm exaggear\n> \n>  \n> \n> >  \n> > \n> > > If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n> > \n> >  \n> > \n> > I HATE to be THAT guy, I am no expert or anything and regularly get crashed by Nin-in-Eilph but...\n> > \n> >  \n> > \n> > \"Well, we didn't draw our key cards, so we never stood a chance\" and \"we lose turn one\", especially in multiplayer, is indicative of some seriously problematic decks unless you are playing against a quest with a messed-up opening.\n> > \n> >  \n> \n> I knew I shouldn't have put \"turn 1\" in there. I was exaggerating to make a point. And against lots of the Nightmare decks, I'm standing by that. Lots of times your game isn't over after turn 1, but it might as well be. Scoop and reset. And there are quests where there are very few options outside of some kind of relying on certain cards. Consistently bad opening hands are indicative your deck needs work, but at the end of the day your fate is in the hands of pure probability. \n\nAgain I say: Give examples. Tell me which quests are completely dependent on the luck of drawing specific cards, because again I am skeptical. Maybe some nightmare quests, but nightmare is supposed to be that hard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808678","commentId":1808678,"userName":"FetaCheese","timestamp":1442788418,"content":"> I'm exaggear\n> \n>  \n> \n> >  \n> > \n> > > If you're running 3 copies of a card, drawing 6 and then 7 cards, your chances of drawing any given card is like 57%. There are so many quests where that basically means my deck will lose, through no fault of my own, 43% of the time. And before there are shouts of \"BUILD YOUR DECK BETTER!\" we all know the most powerful decks revolve around some key cards. This is always one of the biggest hangups when I introduce people to this game. We set up, draw our cards, and lose turn one. When they ask why, I say \"Well, we didn't draw our key cards, so we never stood a chance.\" It's part of the game, and I sincerely doubt it'll ever change, but I like the idea a lot. \n> > \n> >  \n> > \n> > I HATE to be THAT guy, I am no expert or anything and regularly get crashed by Nin-in-Eilph but...\n> > \n> >  \n> > \n> > \"Well, we didn't draw our key cards, so we never stood a chance\" and \"we lose turn one\", especially in multiplayer, is indicative of some seriously problematic decks unless you are playing against a quest with a messed-up opening.\n> > \n> >  \n> \n> I knew I shouldn't have put \"turn 1\" in there. I was exaggerating to make a point. And against lots of the Nightmare decks, I'm standing by that. Lots of times your game isn't over after turn 1, but it might as well be. Scoop and reset. And there are quests where there are very few options outside of some kind of relying on certain cards. Consistently bad opening hands are indicative your deck needs work, but at the end of the day your fate is in the hands of pure probability. \n\n \n\nI mostly disagree. Only botched quests like Peril in Pelargir presents such difficult and frankly unfair setups. In normal mode I feel that if one hasn't managed to establish a board presence by the start of turn 3 then he is either extremely unlucky (once it took me 30 something draws to get Light of Valinor!) or the deck is just lacking. Usually, lacking 1 or 2 key cards shouldn't cripple the deck to the point of no return and in fact solid decks can regularly manage to make do with weaker draws.\n\n \n\nYou mention Nightmare mode however so I am kinda confused by your statement. NM is supposed to be hard and can occasionally be unfair ( Gladden Marshlands then reveal the Brown Lands in Q2 of JdtA, HAHA TIME TO SCOOP) and honestly thats not a mulligan related problem. If your decks can't consistently (90% of the time) get the cards you need by turn 3, the deck is too weak for NM mode, simple as that. I hope you don't introduce people with NM mode...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808924","commentId":1808924,"userName":"Seastan","timestamp":1442799402,"content":"Maybe it would be helpful for us all to see an example of a deck where the only way to make it good is to select an opening hand, rather than just modify it with different cards so that it can be good with a random hand.\n\n \n\nLike others, I am having difficulty sympathizing with someone whose entire deck depends on a specific combo of cards to stand a chance, but doesn't include tons of draw/search cards in order to get it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808961","commentId":1808961,"userName":"Hectarion","timestamp":1442802027,"content":"I think some folks are attacking this from the wrong angle.\n\n \n\nIt is always possible to come up with a deck that wins against X scenario. It is always possible to optimize your deck with the given player cards to beat a specific challenge, or utilize a specific combo.\n\n \n\nMy estimate is that this variant makes other decks possible. For example, someone on our local FB group posted about a deck starting with Gandalf and his toys (pipe, staff and horse). That'd be cool! That's 6 less duplicate cards you need to keep in your deck. How fun would that be, to put more thematic cards in a deck where Gandalf is walking around all badass and beating things up. It's much more possible in this mode. You don't 'depend' on having Bilbo to fetch the pipe. You don't depend on cards to search for the other pieces. You can just play a thematic deck.\n\n \n\nMy believe is that there's two forms of difficulty in the game. There's the enounter deck, which throws all sorts of nastiness at you regardless of what deck you're using ; and the player deck difficulty. Is it easier to win the game with a Glorfindel, Elrond, (someone else) deck? Definitely! Is it harder to do the same quest set with just hobbits? Definitely! (?) \n\n \n\nSo the decks you bring to the game help determine the difficulty of the game. This variant does not change the other half of the game (the encounter deck) like Easy Mode does. This just makes it so the player deck half of the game, can be molded into something in theory, more thematic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1808982","commentId":1808982,"userName":"Seastan","timestamp":1442803099,"content":"> I think some folks are attacking this from the wrong angle.\n> \n>  \n> \n> It is always possible to come up with a deck that wins against X scenario. It is always possible to optimize your deck with the given player cards to beat a specific challenge, or utilize a specific combo.\n> \n>  \n> \n> My estimate is that this variant makes other decks possible. For example, someone on our local FB group posted about a deck starting with Gandalf and his toys (pipe, staff and horse). That'd be cool! That's 6 less duplicate cards you need to keep in your deck. How fun would that be, to put more thematic cards in a deck where Gandalf is walking around all badass and beating things up. It's much more possible in this mode. You don't 'depend' on having Bilbo to fetch the pipe. You don't depend on cards to search for the other pieces. You can just play a thematic deck.\n> \n>  \n> \n> My believe is that there's two forms of difficulty in the game. There's the enounter deck, which throws all sorts of nastiness at you regardless of what deck you're using ; and the player deck difficulty. Is it easier to win the game with a Glorfindel, Elrond, (someone else) deck? Definitely! Is it harder to do the same quest set with just hobbits? Definitely! (?) \n> \n>  \n> \n> So the decks you bring to the game help determine the difficulty of the game. This variant does not change the other half of the game (the encounter deck) like Easy Mode does. This just makes it so the player deck half of the game, can be molded into something in theory, more thematic.\n\n \n\nI am starting to see your point, but I don't think this particular example convinces me. Isn't a Gandalf + toys deck already one of the most powerful archetypes in the game at the moment, even when built strictly according to theme? I could be wrong, but I was under the impression that the OP's idea behind this was to help out decks that can't function without an optimized setup. But I agree with your other observations about the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809016","commentId":1809016,"userName":"Hectarion","timestamp":1442805917,"content":"That's totally fair. I don't think I've actually played that deck so I wasn't sure if it needed the help. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Now I really want to try it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809026","commentId":1809026,"userName":"Bullroarer Took","timestamp":1442806892,"content":"The weakness of Elrond & Gandalf decks is when they don't draw their key cards early. I don't think my elves deck would ever lose if I was able to pick my opening hand. Remember that it's not that you would just get the six cards you want to start, but that you would now only have to put 1 Vilya, 1 Light of Valinor etc in your hand which allows you to strengthen the deck even further in other areas.\n\nAs an aside, in the early days of the game I used to test my decks against hard quests by hand picking my opening hand. If I still lost then it was clearly not good enough. Had the game been built for this from the beginning it would probably be okay, but it was built in the traditional LCG mold and that part of the game is fine as is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809103","commentId":1809103,"userName":"Authraw","timestamp":1442811301,"content":"Interestingly enough, my deck for Challenge #4 [https://community.fantasyflightgames.com/topic/188678-challenge-4/?p=1809095] might fall under this category of \"interesting decks that could benefit from a few fixed cards\". It's terribly inconsistent, but if I somehow manage to get Delay the Enemy in my opening hand, it's pretty fun to play. But being mono-tactics (with only two heroes, no less) it has no reliable way to ensure it can get to the single copy of Delay the Enemy in any reasonable amount of time, so most of the time the game gets scooped around turn 3 and I try again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809122","commentId":1809122,"userName":"John Constantine","timestamp":1442812870,"content":"> I should have checked the author of the post. I will not make this mistake again. Why even ask mr never miss anything?\n\n...what?\n\n \n\nI'm writing from my work, so I can't address everything that was asked of me in this thread, but regarding the example of deck that will not survive long, a fine example would be that solo aggro deck with Boromir that is about engaging and killing anything as soon as it pops up out of the encounter deck. It simple: if you get Gondorian Shield in your opening hand - you're good. If you don't - cya. It has Spirit Glorfindel too, by the way, so having Light of Valinor there is kinda crucial too for the \"aggroeness\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809149","commentId":1809149,"userName":"Trialus","timestamp":1442815159,"content":"While I generally agree that this probably is somewhat detrimental to the balance of the game and wouldn't argue for it as a real change to the game, I keep it in mind for when I am getting repeatedly trounced by a quest. If I beat a quest using this format I don't consider it an actual win, but still got to have a fun time playing. That is the beauty of LOTR, especially in solo play... we can all play as we wish without negatively impacting others. Just gotta be honest about how we play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809415","commentId":1809415,"userName":"narubianHorror293","timestamp":1442836669,"content":"I think this suggestion is a nice way to make the game much easier, and will definitely make a lot of thematic decks viable (and the group of elite decks currently ruling the meta, it will make unstoppable). However, it will make the game a very VERY different game, and it can't even be considered (IMHO) a variant of easy mode, as it makes several important aspects of the game either non-relevant (deck fetching) or a lot less important (card draw). As a past MtG player, and an avid deck builder (both for MtG and LotR LCG), I gotta tell you that the randomness of the deck in general and specifically the opening hand makes up so much of the game and challenge of deck building, that the effect of such a house rule will be tremendous.\n\n \n\nSo yeah, this might be a nice variant for thematic play, that may even become quite popular (given the feedback in this thread), but it is obviously not a change that can be organically incorporated into the game without taking too much away from it. This aspect of the game is really important to me, and from the other kind of reactions in this thread - I'm not the only one.\n\nOn a personal note - I think that's exactly what house rules are for, especially in a co-op game. I personally would probably never play this variant, the same way that I don't ever take a second mulligan; It's part of the fun for me (and I'm fine with people doing what they want to make the game more fun and thematic for them). My most recent anecdote regarding this is not getting LoV in either my opening hand or my mulligan in my Bilbo+Glorf secrecy deck in the second LotR Saga quest (I think). Not only that, I found it maybe in turn 9 or 10. And I was forced to quest with Glorf to keep our heads afloat, so my threat kept going past 20 and than back down once I got some threat reduction. It was challenging, and unique, and made for some hard decisions - and it was a blast! (and we won :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png])\n\nEdited September 21, 2015 by narubianHorror293"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809416","commentId":1809416,"userName":"jjenks476","timestamp":1442836708,"content":"Wow, i am surprised so many people still feel like they need to use power cards. I have not used Spirit Glorfindel, Asfaloth, Vilya, Gandalf (in any form), Tactics Boromir, Dwarve characters or Outlands in ages. These cards are clearly too powerful even against NM I never have to resort to using them. In my opinion the cheapest cards I still use are Elrond and Haldir.\n\n \n\nI would say that if people need specific cards in their opening hand just start the game with them in hand. If they are so critical to your deck then and you can't win without them then you are building a deck that can only do one thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809485","commentId":1809485,"userName":"ppsantos","timestamp":1442840641,"content":"Having fixed opening hand harmful to the game? That's an understatement.  It will destroy the game, deck building, and even the marketing of adventure packs.   If you could have in your opening hand those unique cards, you only need one copy of each unique in your deck.  And if you only need one copy of the unique in the deck, why should the adventure packs have 3 of those uniques?\n\n \n\nFixed/set opening hand is too drastic for the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809495","commentId":1809495,"userName":"Lecitadin","timestamp":1442841178,"content":"What would be cool, I think, is a 0 cost neutral event card that allows you to take a 3rd mulligan... assuming you draw it in your first 2 hands!   :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]\n\nEdited September 21, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809559","commentId":1809559,"userName":"Seastan","timestamp":1442843209,"content":"> Interestingly enough, my deck for Challenge #4 [https://community.fantasyflightgames.com/topic/188678-challenge-4/?p=1809095] might fall under this category of \"interesting decks that could benefit from a few fixed cards\". It's terribly inconsistent, but if I somehow manage to get Delay the Enemy in my opening hand, it's pretty fun to play. But being mono-tactics (with only two heroes, no less) it has no reliable way to ensure it can get to the single copy of Delay the Enemy in any reasonable amount of time, so most of the time the game gets scooped around turn 3 and I try again.\n\n \n\nNice example. I would've like to see no 1/deck limit on Delay the Enemy as it's one of the few cards in the game that can make solo tactics viable. I picture a fun mono-tactics deck that tries to keep Delay the Enemy around to setup, then once it has a lot of allies and resources it uses Trained for War and Book of Eldacar to quest through the game like normal. \n\n \n\n>  \n> \n> > I should have checked the author of the post. I will not make this mistake again. Why even ask mr never miss anything?\n> \n> ...what?\n> \n>  \n> \n> I'm writing from my work, so I can't address everything that was asked of me in this thread, but regarding the example of deck that will not survive long, a fine example would be that solo aggro deck with Boromir that is about engaging and killing anything as soon as it pops up out of the encounter deck. It simple: if you get Gondorian Shield in your opening hand - you're good. If you don't - cya. It has Spirit Glorfindel too, by the way, so having Light of Valinor there is kinda crucial too for the \"aggroeness\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n\n \n\nAre you are referring to the Boromir/Spirfindel/Galadriel solo deck that beats everything? Because when I am using it against anything but the most difficult Nightmare quests I don't even allow myself the standard mulligan rule, as it makes it too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809702","commentId":1809702,"userName":"John Constantine","timestamp":1442846941,"content":"FetaCheese: \n\nYou're talking about it like every deck has Lore. Not everybody wants to run Lore, especially in solo. You still might need duplicates, because plenty of quests feature attachment destruction. It seems you can't see my point because you're a powerdecker and you look at everything from the perspective of power maximization.\n\n \n\nNow, to the second numbered post:\n\n1) Maybe you and I have seen different combo decks, but those decks I've seen could beat the game turn 1. Without any fixed hands. I don't think Dwarves or Outlands will ever gonna be that powerful :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n3) Yeah, but you know the difference between a kickstart and actual playthrough? Having a right card in your hand at the beginning does not wins you a game or rids you from the need to draw anything else, it simply improves your chance and probably serves as the oil for the gears of your deck. You're not gonna win a game by just having something in your opening hand, you'll still need to play, draw, etc. There is still a lot of game to have there, and I'm 100% sure encounter deck can and will kick some ass even if the whole world would play with fixed hands, not so frequently, but still.\n\n4) I once had that approach, but I reconsidered that after some time.\n\n6) What about people who like some stuff that is not that viable due to the games harsh meta game? Some hero, or maybe playstile, or maybe even trait? They exist in the game, they are available to play, but if you will - you will fail most of the time, unless you find a way to make it work, and for that you'll usually need some setup that game rarely allows you for, unless you're a power player, which won't happen in that case then.\n\n \n\nSeastan, no, that deck had Eowyn instead of Galadriel.\n\n \n\n \n\n \n\nSIDE NOTE: \n\n \n\nThere is another interesting approach I've seen in another card game. The infamous Hearthstone.\n\n \n\nWhen players draw their opening hand there, they can simply pick any number of cards from their opening hand and re-draw them, and then they are stuck with what they've drawn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809711","commentId":1809711,"userName":"FetaCheese","timestamp":1442847333,"content":"I like Hearthstone's mulligan rule tbh. Not sure if it'd work with Lotr LCG though because in HS you start with a mere 3 cards in your hand so a bad starting hand is even more criplling, plus it only has a 30 card deck.\n\n \n\nPlayers who for whatever reason avoid the power cards have easy mode and the 2-resources-in-turn-1 rule. Edit: Of course, one should feel free to houserule whatever mulligan rules one wants.\n\nEdited September 21, 2015 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809725","commentId":1809725,"userName":"John Constantine","timestamp":1442847897,"content":"Second player starts the game with 4 cards (not to mention the coin being added to your hand as 5th card)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809801","commentId":1809801,"userName":"PocketWraith","timestamp":1442850783,"content":"> FetaCheese: \n> \n> You're talking about it like every deck has Lore. Not everybody wants to run Lore, especially in solo. You still might need duplicates, because plenty of quests feature attachment destruction. It seems you can't see my point because you're a powerdecker and you look at everything from the perspective of power maximization.\n> \n>  \n> \n> Now, to the second numbered post:\n> \n> *snip*\n> \n> 6) What about people who like some stuff that is not that viable due to the games harsh meta game? Some hero, or maybe playstyle, or maybe even trait? They exist in the game, they are available to play, but if you will - you will fail most of the time, unless you find a way to make it work, and for that you'll usually need some setup that game rarely allows you for, unless you're a power player, which won't happen in that case then.\n> \n>  \n> \n> Seastan, no, that deck had Eowyn instead of Galadriel.\n\nHow do you know anything about FetaCheese's playstyle? Dismissing his point as missing yours does nothing to help your argument, it merely proves you can't be bothered to actually make one.\n\n \n\n6) Again: Give examples. Because I've played and won games with every hero released other than Damrod, Rossiel and Dori (because they're new), and with a wide variety of traits and playstyles, so I find it hard to believe there are so many non-viable setups. I'll maybe concede Spirit Pippin, the worst designed hero in the game, but even there I have won games with him.\n\n \n\nSo... what deck is this then? We're not psychic, we don't automatically know what deck you're thinking of just from a vague description. Based on what you've told us though, I don't see why that should require a fixed starting hand. 2 Defence can serve against a decent number of enemies, you start at 25 threat so some just won't engage you right away, plus you can chump block if you have to. I remain unconvinced that this deck using two debatably overpowered heroes and the best quester in the game can't cope without extra advantages being given to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809860","commentId":1809860,"userName":"John Constantine","timestamp":1442852627,"content":"How do I know? Maybe from all the clues he gave me, like \"if you don't use power cards you deserve to suffer or go play easy mode\" (not direct wording, just a nutshell, no offense). And I've made plenty of points throughout this thread, thank you, if you so easily discarding all of them, then why are we even talking?\n\n \n\n6) Keeping the enemies is not an option, the deck is relying on rush. Enemies in the staging mean no progress, mean location lock, mean game over. Trust me, I've played my fair share of games with that deck, in the end I've had to put 3 Gondorian Shields and simply forfieted any games that didn't turned it up in the opening hands, because I knew what was coming.\n\n \n\nSpeaking of a card draw, it's probably a bad example, but it is still valid: MonoLeadership deck and Lord of Mornthod. If you don't draw it anywhere near the beginning of the game - you're literally going to be out of your draw engine. And I've had those games, believe me.\n\n \n\nMany secrecies literally rely on having Resourceful to properly function.\n\n \n\nDecks that have some out of sphere cards rely on getting the glue.\n\n \n\nYou don't like it - fine. I'm not insisting on anything, this thread is a t-h-e-o-r-y-c-r-a-f-t."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809940","commentId":1809940,"userName":"FetaCheese","timestamp":1442855494,"content":"When did I say thematic players deserve to lose or not have fun? That's why there is easy mode. Handicapped encounter decks for handicapped player decks seems fair to me.\n\n \n\nDear mr Neighbour are you troll-lol-loling me?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1809999","commentId":1809999,"userName":"John Constantine","timestamp":1442856677,"content":"> When did I say thematic players deserve to lose or not have fun? That's why there is easy mode. Handicapped encounter decks for handicapped player decks seems fair to me.\n> \n>  \n> \n> Dear mr Neighbour are you troll-lol-loling me?\n\nWell, that's what I was talking about. Feta, as I said - no offense, I was talking about your attittude and impression you made on me with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810040","commentId":1810040,"userName":"divinityofnumber","timestamp":1442857657,"content":"Fixed opening hand would break the game, in my opinion. A game would need to begin with that being the rule from the outset. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810046","commentId":1810046,"userName":"PocketWraith","timestamp":1442857727,"content":"> 6) Keeping the enemies is not an option, the deck is relying on rush. Enemies in the staging mean no progress, mean location lock, mean game over. Trust me, I've played my fair share of games with that deck, in the end I've had to put 3 Gondorian Shields and simply forfieted any games that didn't turned it up in the opening hands, because I knew what was coming.\n> \n> \n> \n>  \n> \n> Speaking of a card draw, it's probably a bad example, but it is still valid: MonoLeadership deck and Lord of Morthond. If you don't draw it anywhere near the beginning of the game - you're literally going to be out of your draw engine. And I've had those games, believe me.\n> \n>  \n> \n> Many secrecies literally rely on having Resourceful to properly function.\n> \n>  \n> \n> Decks that have some out of sphere cards rely on getting the glue.\n> \n>  \n> \n> You don't like it - fine. I'm not insisting on anything, this thread is a t-h-e-o-r-y-c-r-a-f-t.\n\nIf you manage to get location locked in solo with some of the best willpower in the game at your disposal, you're doing something wrong. Why does the deck depend on rushing? 25 starting threat, solo, I don't see why there's any need for you to rush. If you can't win with that deck without drawing a Shield in your opening hand, I suspect there's something else wrong with it.\n\nLord of Morthond is only really a good draw engine for Outlands in my experience. Even there it's not essential though. Mono-Leadership also has access to Valiant Sacrifice, Sneak Attack Gandalf, King Under the Mountain, Erestor, etc to draw more cards, plus things like ally Galadriel and A Very Good Tale.\n\nSecrecies work much better with Resourceful, but you should be able to manage without it for a while. I'll grant that Secrecy, especially two-hero Secrecy without repeatable threat reduction like Merry or Galadriel, is a difficult archetype to pull off. But it still has enough toys at its disposal that it should be OK against some quests at least (some quests it just won't work, but almost every deck has quests like that).\n\nDecks that depend on out of sphere cards should be built with sufficient draw or fetch effects to give a high likelihood of getting their resource-fixing cards in a timely fashion.\n\n \n\nYou say you're not insisting on anything, but the fact is you started this thread by asking a question, and you have then proceeded to brow-beat everyone who gave the answer opposite to your own opinion on the matter. You're in no position to be criticising other people for the impression they make with their attitudes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810062","commentId":1810062,"userName":"John Constantine","timestamp":1442858156,"content":"Yes, and something wrong is not engaging and killing enemies as soon as they are available to engage and kill, as I previously said. And for that I need Gondorian Shield in my opening hand. If I don't have it - Boromir will die after 3-4 attacks at best.\n\n \n\nThere is a lot of \"ifs\" - those decks should this, these decks should that. Not everything can always accomplish everything, unfortunately.\n\n \n\nI started a thread and asked a question, then I developed my opinion through the discusccion of this thread. I don't know the term \"brow-beat\", but I strongly disagreed only with people who claimed that change to be bad because of those combo decks which are already bonkers no matter what, any further boosts to them are trivial. I'm in a pretty decent position to recieve impressions and judge by them, and as you have seen, FetaCheese haven't argued my impression of him, which means it was right. \n\n \n\nNow, I will stop responding to you, kind sir, unless you stop attacking me personally and start some constructive discussion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810077","commentId":1810077,"userName":"FetaCheese","timestamp":1442858470,"content":">  \n> \n> > When did I say thematic players deserve to lose or not have fun? That's why there is easy mode. Handicapped encounter decks for handicapped player decks seems fair to me.\n> > \n> >  \n> > \n> > Dear mr Neighbour are you troll-lol-loling me?\n> \n> Well, that's what I was talking about. Feta, as I said - no offense, I was talking about your attittude and impression you made on me with it.\n> \n>  \n\nI don't see your point... Self-limitations is handicapping, which is fine to do if you wanna have fun for whatever reason and I often do it myself, but this does not indicate a weakness in game mechanics. Handicapping is common in our community,\n\n \n\n \n\nI personally think that fixed opening hands would skyrocket combo decks since EVERY deck would see an increase in power. So if all decks double their strength with a new mulligan rule that simply means that weaker decks will still be weaker to power decks...and since new quests will have to accomondate for the power level of over 9000 of the power decks, then the weaker deks will still lag behind... Basically a new mulligan rule wouldn't fix things in the way you are suggesting because all the decks are affected. Using easy mode is a simpler, more elegant solution.\n\n \n\nEdit: nah mate, me not answering doesn't mean I am conceding anything. This isn't reddit.\n\nEdited September 21, 2015 by FetaCheese"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810088","commentId":1810088,"userName":"PocketWraith","timestamp":1442858678,"content":"> Now, I will stop responding to you, kind sir, unless you stop attacking me personally and start some constructive discussion.\n\nLOL. :rolleyes: [//content.invisioncic.com/Mfantflight/emoticons/default_rolleyes.gif] Sure, Mr. Pot, this Kettle will just stop bothering you since there's obviously no point to continuing this 'discussion'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810103","commentId":1810103,"userName":"John Constantine","timestamp":1442859075,"content":"FetaCheese, powergaming at it's finest. If X exists, not using X is handicapping. But, suprise, not everyone enjoys X, yet wants to play the game, and want to epxerience it in full (meaning full encounter deck, not easy mode). This is not a weakness in game mechanics, this is a weakness in game design, where not using X is handicapping yourself, and the encounter cards are designed around the X power level.\n\n \n\nBut you can't just count it like \"doubling the strength\" of the deck :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] That's extremely dependent on the deck in question. Inconsistent start deck would benefit a lot from this, possibly increaing it's effectiveness 3-4 or even more times, while some crazy combo deck capable of wiping the quest on turn 1 will barely feel it. It will just take less time to setup the combo, the result gonna be the same. What the point bothering about those boring combo decks?\n\n \n\nI didn't said you conceded your point, I said you didn't argued that you're a powergamer. \n\nEdited September 21, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810147","commentId":1810147,"userName":"FetaCheese","timestamp":1442860147,"content":"Nice strawmanning, especially when I have kept repeating in my posts about how often I play non-optimized decks, which is the majority of the time. Also I never told people what they should enjoy or not. There is no point to the rest of your post I haven't answered before though I will say again that weaker archetypes and weaker cards are normal in a CCG-inspired card game and not a game design fault for a variety of reasons (immature card pool is a major issue in Lotr). Finally, feelings don't trump reallity, especially gameplay which is governed by math and PROPABILITIES.\n\n \n\nSeastan's Boromir deck might just be the most powerful deck I have played with and takes at least 3 turns to set up with Galandriel drawing, unless I am extremely lucky. You severelly underestimate the effect your mulligan theory would have for the game, it'd limit deck construction far more than not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810194","commentId":1810194,"userName":"John Constantine","timestamp":1442861142,"content":"Stop using those strange terms I have never heard before :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nNon-optimized deck can easily be a power deck. Just through a couple of dwarf stuff in, add Dain and you have a non-optimized power deck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Weaker archetypes do exist, however, and people who wants to play them too. Well, saying that this variant will just double any deck potential is opposed to both reality and math alike.\n\n \n\nI never said anything about Seastan's deck. I've never actually seen it, to be more precise. \n\n \n\nMan, I'm feeling like we're just tossing the same thing around back and forth, let's stop this and just agree to disagree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810242","commentId":1810242,"userName":"FetaCheese","timestamp":1442862404,"content":"Here, I will simplify it for you! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n \n\nf2rj4n.jpg [http://oi57.tinypic.com/f2rj4n.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810304","commentId":1810304,"userName":"Lecitadin","timestamp":1442864143,"content":"Mouhaha!! I really like your post!!! Amazing!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810352","commentId":1810352,"userName":"John Constantine","timestamp":1442865467,"content":"I think I even saw that BGG thread on the last slide :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1810380","commentId":1810380,"userName":"Lecitadin","timestamp":1442866156,"content":"Yeah... This game is brutal when you start playing it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1813474","commentId":1813474,"userName":"divinityofnumber","timestamp":1442972839,"content":"Off-topic rant:\n\n \n\nPeople need to be more creative and open-minded with respect to what counts as thematic. The card can represent an essence, not merely the literal name on it. A card can represent a presence, a will, a force, and influence. Many would say that including three heroes that never met in the book(s) is off-theme. But, we can easily see how the actions of those heroes and their narratives intertwined to form the composite that is the beautiful LOTR universe.\n\n \n\nThis comes up a lot in the AGOT LCG as well; \"How can this character combat that character? This character was dead before that character was even born.\" I think that people should not take the cards so literally. The cards represent an essence, a presence, a force that at some time made an impact on the universe in question. True, person X would never have been able to actually fight person Y; but, you can understand how the actions and presence of person X could run up against the essence of person Y.\n\n \n\nThink of the LOTR narrative as a coherent whole, and all of the characters as a sort of symbiosis, a constellation of moving parts, some closer together than others, with the real beauty of the universe dependent on the gestalt. It could be thought of as even more beautiful to play a deck with characters that had little or no contact in the book, thinking of the beauty of their different lives and experiences, but how they both played a specific role in bringing about the climactic events of the overall narrative. It can be beautiful to think of a deck as a collection of unique lives and stories, with the ending to the story dependent on the actions of all of them, to greater and lesser degrees. If you really love the LOTR universe, it can be really cool and beautiful to play a deck and wonder what two characters might have said to each other, had they ever met, or entertain the \"what if's\" in our minds.\n\n \n\nI encourage people to think about things as a whole, and not just say something like, \"Those two never met. This is unthematic.\" -- not saying that anyone on these boards does that, but I have heard people in card-gaming over the years say many such things.\n\nEdited September 23, 2015 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1814675","commentId":1814675,"userName":"Introverdant","timestamp":1443024055,"content":"How about making it a Keyword and applying it only to extraordinarily challenging quests?\n\n \n\nFor something like the Siege of Cair Andros, the ability to choose your opening hand would enable a lot more deck types to be successful. \n\nI've been attempting the quest with mono-lore lately, and it's very doable even with my limited cardpool - but only if I draw exactly the right opening hand. \n\nSo... do I just reset and mulligan until I get that hand? How does that make any sense?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1814716","commentId":1814716,"userName":"John Constantine","timestamp":1443024716,"content":"Actually a nice idea. I would like something like a keyword that would be printed on setup part of each quest, like Planning X, where X would be the number of cards you can handpick for your opening hand instead of drawing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1815780","commentId":1815780,"userName":"DunedainLoreKeeper","timestamp":1443053443,"content":"I've done a bit of game design so I'd like to add my experiences with randomness.\n\n \n\nFirst of all, this game has a sort of fixed opening compared to other games like Magic or Hearthstone in the shape of our three hero characters. Most cardgames starts you off with nothing.\n\n \n\nWill it break the game by making super combo's available? I don't know, after all, the encounterdeck would be more difficult as well as a balance. But ideas like this shouldn't be judged on balance issues I think, that's for far later.\n\n \n\nMy major concern is with the primary reason randomness exists in games: replayability. Presumably players will build decks with their opening hand in mind and have a 'optimal' opening hand as part of their deck design. This means the first 2-3 turns are going to be VERY similar in every playthrough. As you know, the first few turns are key in this game, moreso than in other cardgames. If you win a game with a fixed hand, you'll likely win every other time you'll play. If you lose, it'll probably be nigh-impossible to win by trying again, discouraging players. Removing the randomness in the first few turns from the player-deck side, will narrow the performance of your deck considerably. Ironicaly, that means that if you're playing a challenging scenario, the first few encountercards will determine how the game is going to go, so I'll likely feel MORE random than before because the few random events that are left, become that much more important to the flow of the game! The more random events in a game, the more 'spread out' your luck can be. Better to flip a hundered coins than just one.\n\n \n\nOn the other hand, with an 'optimal first turn play', and very little variation in the first few turns, playing the game will become much less challenging for the player. Once you figure out the 'trick' of your deck, it'll either work or not. Sure, with well-rounded characters you'll still have to determine if you'll quest or not, but many other options become autopilot. Trying to discover the optimal play from a random set of cards from your deck is what keeps the game fresh every time you play.\n\n \n\nWhat would it do for deckbuilding? I think it'll make deckbuilding a lot more interesting actually. In a way, it is a bit like programing an A.I. to play the game for you. You make the most important decisions before the game starts, then you just sit it out and watch it unfold.\n\n \n\nAs for balance, obviously stacking your cards is a form of making the game easier, just like easy mode. And, being a coop game and all, LotR is super house-rule friendly. I would only recommend using this rule against very specificly-difficult quests like Siege of Cair Andros as Introverdant said, but try not to abuse it too much. The regular Easy Mode is in my opinion a more elegant solution that keeps the game just as interesting, but allows sillier decks. I also really like the Hearthstone mulligan which let's you mulligan part of your hand instead of all-or-nothing. I would recommend that instead of Easy Mode or in addition to Easy Mode over a fully fixed opening hand. You'll just LIKE the game better that way, or atleast bored later rather than sooner.\n\n \n\nI do think it's a good start for actual card design. We have Loragorn that let's you reset your threat, why not a hero that reset's your hand? But as the cardpool expands, we're getting more alternatives (letting you put more copies of a desired effect in your deck) and we're getting more fetch-cards that let's you search your deck for specific combo pieces. And if you're building a combo-deck finding ways to get the pieces into play is part of the deckbuilding fun! With a more limited cardpool, I can get the temptation. After all, core-set players are only going to defeat the Hill Troll if they get their sphere's anti-troll card. With today's cardpool, I feel like the days of cards being either super-powerfull or absolute crap are over. There are enough cards to keep the bad ones out and fill a deck with cards that are all useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1815979","commentId":1815979,"userName":"divinityofnumber","timestamp":1443062513,"content":"> Actually a nice idea. I would like something like a keyword that would be printed on setup part of each quest, like Planning X, where X would be the number of cards you can handpick for your opening hand instead of drawing.\n\n \n\nIt just seems way too powerful, even if each person could guarantee a single card. Have you played decks (or combinations of decks, given other players) where Legacy of Numenor (LoN) and Deep Knowledge (DN) are played at the beginning of the game. My playgroup commonly all adds in threat-reduction, and we all run either or both (depending on decks) LoN and DN. Have one person run Lore Aragorn, the people running Spirit include 3x Elrond's Counsel, and every player running 3x Core Gandalf. If you can always have an opening where each player gets double (or even triple) resources and 9-11 cards, the game would get really silly. My group consistently has absolutely insane opening planning phases as it is.    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1822621","commentId":1822621,"userName":"joezim007","timestamp":1443410537,"content":"I'm glad to see the bickering has stopped, at least for now.\n\nI want to get my say in here.\n\nFirst of all, we need to remember the question: Would fixed opening hand nurture the deckbuilding or harm it? The question wasn't whether or not it'd be good for the game as a whole. I think that by allowing us to eliminate duplicates of some cards and some card draw effects, we make room for additional cards that would not otherwise end up in the deck, therefore, it would nurture and give more options for deck building. In this sense, it could be a good thing.\n\nOn the other hand, I do agree with so many people that the game wasn't designed with this in mind so it does break the game in a few minor ways.\n\nAll that being said, I think it's a fun thought experiment and would love to hear about you guys testing it out. No one is going to yell at you for trying this game with a few house rules, at least I sure as heck hope not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1822715","commentId":1822715,"userName":"divinityofnumber","timestamp":1443417160,"content":"I have always been a fan of the way the MTG handles mulligans; you can do as many as you want, but one less card each time. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1825281","commentId":1825281,"userName":"Olorin93","timestamp":1443545041,"content":"> Off-topic rant:\n> \n>  \n> \n> <>\n\nWhile I see what you're saying, \"unthematic\" is obviously a very vague term here. I can't bring myself to enjoy playing decks that may be powerful but make little sense with regard to how the characters relate to each other and the world. Take this example concerning attachments:\n\n \n\n- Nothing could bring me to put Steward of Gondor on Elrohir, even though it would make him a more reliable defender. He knew Aragorn and the other Dúnedain, sure, but he has nothing to do with the authority or resources of the Steward.\n\n \n\n- I could, however, put Horn of Gondor on e.g. Eomer - because he hears horns cry from Minas Tirith and quickens his speed. That I would even call thematic.\n\n \n\nMiddle-Earth is a vast place, with different cultures, norms and flavour; there is a difference between what could happen and what really makes no sense -\n\n \n\n- If things had gone differently, Thorin, Fili and Kili could have survived until the War of the Ring and gone to hang out with Hirluin and Mablung, or Cirdan decided to take a break from boats and go chill in Lothlorien. That's fine.\n\n \n\n- But even with Elf-Friend, I can't fathom why someone would put Light of Valinor on Eowyn. She has never been there; her people is not in any way related to Aman. Get another readying effect for her - Theoden could've traded with elves in Eriador and received some Miruvor. That's fine.\n\n \n\nDo you see the difference? The nitpicking you describe does sound tedious, but there is a very broad spectrum. If it makes little sense I'm not going to enjoy playing it.\n\n \n\n \n\nAs for the on-topic question: A fixed opening hand would make everyone play Noldor at this point just for the headstart.\n\nEdited September 29, 2015 by Olorin93"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1825754","commentId":1825754,"userName":"Seastan","timestamp":1443562501,"content":"One person's limits on theme are another person's opportunity for imagination. For example:\n\n \n\nPerhaps Aragorn becomes king and takes on Elrohir (a long time friend, companion, and now brother-in-law) as an advisor and steward.\n\n \n\nEowyn and Faramir named their son Elboron - which means \"Enduring Star\". Perhaps this could be taken to mean that Eowyn developed a devotion to Elbereth later in life, and has a deep love of the Light of Valinor.\n\n \n\nI like that FFG has allowed a great amount of flexibility and allows us to police ourselves. If we don't like certain combinations of cards there is no need to play them. At the same time I think it's harsh to condemn someone who does happen to use the cards together. They may have thought of a creative way in which it makes thematic sense to them, or they may not care at all. Either way, there is no need for rants :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nP.S. While Elf-Friend certainly has many interesting possibilities, its combo with LoV isn't that stellar. We are talking about a 2-cost 2-card combo to get 1 readying effect. UC or Snowmane is almost strictly better for this application so I'd be surprised if it gets much play. Not to mention you are taking up a very valuable unique card that another player could put to good use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1835115","commentId":1835115,"userName":"Letux","timestamp":1444071351,"content":"It worked well for the Babylon 5 card game, but it would make things too easy in this game probably. Let's start with 6 Test of Wills, all our best attachments, best ally and why not Doomed 4 out some resources. I guess we need a sigil to cancel that out... Look all set turn one.\n\nEdited October 5, 2015 by Letux"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1835171","commentId":1835171,"userName":"John Constantine","timestamp":1444073035,"content":"6 Tests of Will is a strong opening hand indeed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1835708","commentId":1835708,"userName":"Letux","timestamp":1444093536,"content":"Between the group"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1836009","commentId":1836009,"userName":"John Constantine","timestamp":1444109246,"content":"I think I should update the main post so new people stop referring to it exclusively.\n\n \n\nA-a-and done.\n\nEdited October 6, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1838502","commentId":1838502,"userName":"joezim007","timestamp":1444233423,"content":"Yea, Legacy of Numenor in multiple opening hands could be a ridiculously good way to start assuming everyone could handle the threat. Though the threat cost would certainly add up. We are talking about reducing hand size for every chosen card, though, so you may end up with too many resources. =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1838528","commentId":1838528,"userName":"Seastan","timestamp":1444234201,"content":"This makes Erestor even more powerful. I never have enough resources to play the opening hand of 10 cards anyway. With this rule you could pick any three cards you want and still start the first round with a hand of 7  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1940405","commentId":1940405,"userName":"isthar","timestamp":1450324031,"content":"Just tried carn dum with a gandalf, spirfindel, eowyn setup, choosing Gandalf Staff, Un. Courage, Valinor, Harp... and nope. Carn dum is still ridiculous :-(\n\n \n\nI personally don't think the OP was crazy, and I think for fun (or rather, for necessity perhaps on those very hard quests that punish you right away) this can help get through a question that is just taking you 10+ tries..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1940412","commentId":1940412,"userName":"Gizlivadi","timestamp":1450324389,"content":"In true solo I could really see an argument for John Constantine's variant, as in solo there are quests you pretty much need a certain card from the very beggining. I also think it's fairly balanced."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1941637","commentId":1941637,"userName":"zeromage","timestamp":1450389042,"content":"What about a new hero:\n\nGandalf (lore) starting threat: 14\n\nW: 3\n\nA: 3\n\nD:3\n\nHp:5\n\nYou may select your opening hand from your deck. Shuffle your deck afterwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1943659","commentId":1943659,"userName":"joezim007","timestamp":1450464629,"content":"> What about a new hero:\n> \n> Gandalf (lore) starting threat: 14\n> \n> W: 3\n> \n> A: 3\n> \n> D:3\n> \n> Hp:5\n> \n> You may select your opening hand from your deck. Shuffle your deck afterwards.\n\n \n\nInteresting idea. I wouldn't mind seeing some sort of card to help assist with something similar to this. It could be cool. I started reviewing fan-made content for this game (Shown below... I just tried throwing the link it but it decided to show the video, so whatever) and my next review is going to be talking about this rule proposal and I may even mention this card idea in there as well.\n\n \n\n\n\n\nEdited December 18, 2015 by joezim007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1943674","commentId":1943674,"userName":"Gizlivadi","timestamp":1450464985,"content":"> What about a new hero:\n> \n> Gandalf (lore) starting threat: 14\n> \n> W: 3\n> \n> A: 3\n> \n> D:3\n> \n> Hp:5\n> \n> You may select your opening hand from your deck. Shuffle your deck afterwards.\n\nHonestly I'd like it much more if there was a general rule that allowed you to choose 1 or 2 cards instead of a new Gandalf hero that restricted you to play Lore in order to choose your starting hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1943705","commentId":1943705,"userName":"webslinger9","timestamp":1450465932,"content":"Maybe it could be a Side Quest that starts in play.\n\n \n\nPreparations for the Journey Ahead\n\nNeutral: Cost -\n\nQuest Points: 4\n\n \n\nLimit 1 per deck. Do not shuffle into your deck. Put into play into the staging area at the start of the game.\n\nResponse: When drawing your initial hand of cards, you may select your opening hand. Shuffle your deck afterwards.\n\n \n\nWhile this quest is in the staging, progress cannot be placed on locations in the staging area. You cannot travel to locations until this quest is complete.\n\n \n\n \n\nA very strong effect, but with the downside of having to complete it before you can start travelling to locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1944069","commentId":1944069,"userName":"Seastan","timestamp":1450474048,"content":"I think people are seriously underestimating how strong you could make your deck with a select 6 cards to start with. You could give it a downside like \"all heroes start with 1 hit point\" and I'd still take the deal.\n\n \n\nThe idea of reducing the size of your opening hand for each card you select could work, as suggested earlier in the thread (although still broken the case of ways to quickly rebuild your hand size like Erestor or Beravor). But being able to choose all 6? I think it's too strong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1944114","commentId":1944114,"userName":"Gizlivadi","timestamp":1450475339,"content":"If you're not running Lore, lack any card draw and you're not relying in a particular combo, just straight aggro \"play guys n go\" and you choose your starting hand, you can still lose fairly often against the harder quests. Now obviously the story is different if you're running the Forest Snare Amarthiul deck or any deck where you can draw tons of cards first round, but for many of the more normal Loreless decks selecting your starting hand doesn't necessarily guarantee victory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1944138","commentId":1944138,"userName":"zeromage","timestamp":1450475974,"content":"Seastan:\n\nYou should post a video of you picking your opening hand against a brutal nightmare deck. I'd love to see what you could do with that starting condition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/188985-would-fixed-opening-hand-nurture-the-deckbuilding-or-harm-it/?do=findComment&comment=1944630","commentId":1944630,"userName":"Seastan","timestamp":1450500459,"content":"> Seastan:\n> \n> You should post a video of you picking your opening hand against a brutal nightmare deck. I'd love to see what you could do with that starting condition.\n\n \n\n \n\nNot sure if it counts, but I've already done this kind of thing. For my Boromir deck (no lore heroes) I picked my ideal starting hand of 6. Then I took it up against Nightmare Journey Along the Anduin, but I also modified the encounter deck so that it would have an especially nasty start, with the setup revealing 3 surging Troll Spawns into a Gladden Marshlands, then adding in the Hill Troll.\n\n \n\nThe video is here [https://youtu.be/UxpK_u-V8JY], but this is from before I started recording audio, so it might be boring to watch."}]}