{"url":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/","title":"Strongest player card adventure pack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808418","commentId":1808418,"userName":"sappidus","timestamp":1442778138,"content":"I was deconstructing my latest decks back into my binders when I thought of the following: which adventure pack has the strongest/best player cards? Obviously this is going to be somewhat subjective, everyone likes different kinds of decks, yadda yadda. (Note that I am excluding deluxes/sagas... Just adventure packs with a hero and nine different player cards.) I've got to go with Foundations of Stone; if you adjust for release time, I'm not sure what else could challenge it.\n\n \n\n...The Glorfindel that became so dominant that we have to refer to the original core set version by a different nickname.\n\n...His toys Light of Valinor and Asfaloth, the first of which can be extremely useful in ANY deck with a Noldor or Silvan hero, and the second of which is still the strongest location controller in the game.\n\n...The auto-include that is Daeron's Runes.\n\n...Imladris Stargazer, with her powerful (and targetable!) effect that potentiates all kinds of decks, e.g., Elrond/Vilya, dwarven miners.\n\n...Longbeard Elder, the best dwarf in the Dain sphere until ally Gimli finally appeared.\n\n...Path of Need, which is tough to use consistently but usually game-ending when deployed appropriately. (Witness the recent talk about combo decks focused on it.)\n\n...Heavy Stroke, which isn't useful too often but provides damage amplification to a degree that is hard to match.\n\n...and, um, Trollshaw Scout and Healing Herbs, which kinda suck, but hey, no pack is perfect.\n\n \n\nWhat do y'all think? If you agree FoS is #1, what would be #2? If you disagree, show me what you got. (Say The Steward's Fear; I dare you.)\n\nEdited September 20, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808435","commentId":1808435,"userName":"Djenni","timestamp":1442778800,"content":"What about Steward's Fear with its OP Outlands and Gondorian Shield plus more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808438","commentId":1808438,"userName":"Gizlivadi","timestamp":1442778962,"content":"Many of the packs from the Dwarrowdelf cycle are really really good. I agree that FoS is one of the best if not THE best, but there are other really good ones. Watcher in the Water is also a great pack, including 3 of my favortie cards in the game, Sword that was Broken, Arwen and Elrond's Counsel. S&F is also good if only for Elrond, Vilya and other great utility cards. There's also The Steward's Fear for Outlands and Gondorian Shield."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808494","commentId":1808494,"userName":"Ecthelion III","timestamp":1442781601,"content":"The Redhorn Gate has some fabulous player cards.  Taking Initiative, Keeping Count, and Ravenhill Scouts are staples in any deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808602","commentId":1808602,"userName":"sappidus","timestamp":1442785677,"content":"> The Redhorn Gate has some fabulous player cards.  Taking Initiative, Keeping Count, and Ravenhill Scouts are staples in any deck.\n\nThat should be one of the forum challenges: construct a deck that, on some scenario, just once, can play all of these cards for some positive effect.\n\nI would love it just for the thought of someone going, \"Yes!! Taking Initiative put Ravenhill Scout into play!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808671","commentId":1808671,"userName":"PocketWraith","timestamp":1442788044,"content":">  \n> \n> > The Redhorn Gate has some fabulous player cards.  Taking Initiative, Keeping Count, and Ravenhill Scouts are staples in any deck.\n> \n> That should be one of the forum challenges: construct a deck that, on some scenario, just once, can play all of these cards for some positive effect.\n> \n> I would love it just for the thought of someone going, \"Yes!! Taking Initiative put Ravenhill Scout into play!\"\n\nThat would be very impressive since Taking Initiative has nothing to do with putting allies into play. You may be thinking of Timely Aid, which is a much much better card with the Secrecy discount.\n\n \n\nTo the original question, FoS is the first pack that springs to mind for me as well. S&F for Elrond/Vilya, TSF for Outlands.\n\nLately I can't think of a pack which screams \"power\" in quite the same way. There are packs which I possibly prefer, because they contain lots of nice utility sort of cards, but nothing that's quite on the Glorfindel/LoV/Asfaloth level. The best in recent times would be maybe The Antlered Crown (Erkenbrand, Captain of Gondor, Booming Ent, Treebeard etc). Depending on how effective victory display/Rossiel decks turn out to be a case could possibly be made for Escape from Mount Gram, since it also has awesome Ent stuff and Double Back. It loses out a little to FoS though because Rossiel didn't get all of her toys in the same box, she had to wait for None Return to come in Across the Ettenmoors."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1808706","commentId":1808706,"userName":"Ecthelion III","timestamp":1442789737,"content":"The Road Darkens had Gandalf and [almost] all of his toys, plus some really solid allies. I can't think of one dud in that box.\n\n \n\nEdit: It's not an adventure pack, but it has about the same number of player cards as one, so...\n\nEdited September 20, 2015 by Ecthelion III"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1809253","commentId":1809253,"userName":"Olorin93","timestamp":1442824956,"content":"While I'm not sure it rivals Foundations of Stone, Celebrimbor's Secret deserves a mention. We got Galadriel, Nenya, the Mirror, Orophin (who brings great stats and ally recursion to Silvan decks), Heir of Mardil (great readying effect if you hold off on e.g. Steward of Gondor until later), Cloak of Lorien (much-needed defense boost for elves), Wandering Ent (fantastic ally for low cost, like most ents), and the Handmaiden, who is a great quester and provides -1 threat for any player. The tactics cards I haven't actually tried so I can't vouch for them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1809562","commentId":1809562,"userName":"Lecitadin","timestamp":1442843231,"content":"The Dead Marshes pack offered Boromir, one of the coolest and strongest heroes in the game and fast Hitch, that made Hobbits pretty powerful, also (think Fast Hitch with tactics Merry comboed with our guy Boromir or tactics Aragorn).  The rest of the pack was OK, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189017-strongest-player-card-adventure-pack/?do=findComment&comment=1809600","commentId":1809600,"userName":"sappidus","timestamp":1442844013,"content":">  \n> \n> >  \n> > \n> > > The Redhorn Gate has some fabulous player cards.  Taking Initiative, Keeping Count, and Ravenhill Scouts are staples in any deck.\n> > \n> > That should be one of the forum challenges: construct a deck that, on some scenario, just once, can play all of these cards for some positive effect.\n> > \n> > I would love it just for the thought of someone going, \"Yes!! Taking Initiative put Ravenhill Scout into play!\"\n> \n> That would be very impressive since Taking Initiative has nothing to do with putting allies into play. You may be thinking of Timely Aid, which is a much much better card with the Secrecy discount.\n> \n>  \n\n \n\n \n\nAha, so I did! Well, Ravenhill Scout may be better as discarded by Taking Initiative than any other use of him. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}