{"url":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/","title":"Specific Turn Order question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811053","commentId":1811053,"userName":"JYoder","timestamp":1442888079,"content":" \n\nI know how and when general turn orders resolve, but came across a unique instance. (Or at least it is for me, but I'm guessing there's a ruling somewhere.)\n\n \n\nI'm playing 2 handed. The 1st deck drew it's encounter card. Now the 2nd deck drew \"Saruman's Orders\" which reads: \"When Revealed: Each player must choose: either return an enemy engaged with him to the staging area, or reveal an encounter card.\"\n\n \n\nNeither deck has anyone engaged, so both need to reveal an encounter card. What order is it done? Start with the current deck, which is taking it's turn? Or the 1st deck, because it's the 1st player? Normally it wouldn't matter, but in this case it does because of the \"Peril\" keyword on the revealed cards.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811092","commentId":1811092,"userName":"GrandSpleen","timestamp":1442890079,"content":"Since it is not specified on the card, I would just start with the first player.   Don't know if there's an official ruling.  Usually the card will say 'starting with the first player...' so if it does not say so, I would assume that's the standard.  Kind of like a card that says 'shuffle the deck' after you do a deck searching effect.  Even if it doesn't say so, you're supposed to shuffle... but they go ahead and write it anyway most of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811127","commentId":1811127,"userName":"ppsantos","timestamp":1442891624,"content":"Just wondering, why can't you choose \"return an enemy engaged wth him to the staging area\" since the choice is an \"either or\"?  I know that nobody has anyone engaged, but does that prevent you from choosing the first option?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811134","commentId":1811134,"userName":"JYoder","timestamp":1442892046,"content":" \n \nOr is this a case of multiple actions occurring at once, and players choose the order? So in a 4 player game, you wouldn't even have to go around the table, but could jump around? *shrug*\n\n \n\n \n\n> Just wondering, why can't you choose \"return an enemy engaged wth him to the staging area\" since the choice is an \"either or\"?  I know that nobody has anyone engaged, but does that prevent you from choosing the first option?\n\n \n\nI wish I could! In fact, way back in the day, that's how I did play \"or\" clauses where you can choose. But then I made the mistake of reading the FAQ, under 1.44...\n\n \n\nIf a card instead uses the structure “... must either X or\nY...” then the player may choose which task to perform,\nalthough one of them must be performed in full, if able.\n \nI read that to mean, if you can't do one, then you have to do the other -- you can't choose an option that does nothing (unless both options do nothing.)\nEdited September 22, 2015 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811256","commentId":1811256,"userName":"ppsantos","timestamp":1442897694,"content":"I interpret the \"Must either X or Y\" differently, than \"Must X or Y\" ( faq 1.44).\n\n \n\nAren't you applying the \"Must X or Y\" ruling (instead of the either or ruling) on your interpretation of Saruman's Orders? \"if you can't do one, then you have to do the other \" If you can't do X fully, then you must do Y.\n\n \n\nWith \"either X or Y\", the player may choose which task to perform. The FAQ does not say that you could choose an option only if you could perform it fully (which is a requirement for 'Must X or Y').  I interpret \"Although one of them must be performed in full, if able\" to mean that once you've chosen an option, you must perform it, if you are able.  If you are not able to fully or, even just partially to perform, then no problem.  That is, you first choose an option, then once you've chosen, you perform that option, if able."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811303","commentId":1811303,"userName":"GrandSpleen","timestamp":1442900472,"content":"'must either' stuff makes my brain hurt.\n\n \n\nI think, when you have a choice (\"must either\"), you are meant to choose an option that you can perform fully.  I don't see why they would write it they way they have, otherwise.\n\n \n\nIf you can choose an option that you can't perform, the FAQ explanation is fully of silly redundant text.  Basically saying \"You're free to choose either one, but remember to do the one you chose!\" Well, duh.  \n\n \n\nIt makes more sense to me to read this as \"You're free to choose either one, but if possible you have to choose one that can by fully performed.\"\n\n \n\nThey use the word \"although,\" as well.  You use this word when you're about to say something that is contrary to expectations (\"I'm quite an important person, although I'm only a small hobbit\")\n\n \n\nSo... \"You're free to choose either one [good thing], ALTHOUGH make sure you remember to do it! [...? doesn't run counter to what was just said]\"\n\n \n\nOr... \"You're free to choose either one [good thing, designers are giving us a boon], ALTHOUGH you have to choose one that can you perform fully [bad thing, that boon has been limited-- contrary to expectation]\n\n \n\nSo the second reading makes sense to me with \"although,\" and the first does not.\n\n \n\nAh semantics.  I tried to find a thread where all this stuff was discussed, more than a year ago, but the search function in this forum seems to be broken.  Type \"must,\" or \"either,\" or \"must either\" and it returns 0 results.  Not even this current thread comes up for me.   Wha...!?  Also I think some very old threads have been archived or deleted(?) and are no longer available.\n\nEdited September 22, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811402","commentId":1811402,"userName":"PsychoRocka","timestamp":1442906587,"content":"Yeah the search function on the forums has been broken for a long time now, its completely useless honestly. Searching on google will give you better results for previous discussions on these forums which is just ridiculous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811411","commentId":1811411,"userName":"PsychoRocka","timestamp":1442907245,"content":"https://community.fantasyflightgames.com/topic/180085-either-or/ [https://community.fantasyflightgames.com/topic/180085-either-or/]\n\nhttps://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/ [https://community.fantasyflightgames.com/topic/126831-quick-question-followed-by-night/]\n\n \n\nmanaged to find these two threads for you.\n\n \n\nhad to search \"followed by night ffg\" and \"must either x or ffg\"\n\nTried so many combinations and searchs before I could find these, apparently putting lotr, lotr lcg or forums in your search actually stops you from finding old threads rather than helping..... It is pretty god awful trying to find old threads sometimes, especially rules ones which should not at all be the case. They are definitely there just very hard to find. \n\nEdited September 22, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1811578","commentId":1811578,"userName":"NathanH","timestamp":1442917373,"content":"The FAQ item should be amended to\n\n \n\nIf a card instead uses the structure “... must either X or\nY...” then the player may choose which task to perform,\nbut must, if able, choose one that can be performed in\nfull.\n \nI think this is the intention."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1812715","commentId":1812715,"userName":"JYoder","timestamp":1442946932,"content":"So, bottom line, I'm playing the card in question correctly, right? (Each player can't do the first bit, so each must choose the 2nd.)\n\n \n\nOn a side note, I read those other threads, and the whole \"All\" vs \"Each\" distinction, I have to say, is completely unintuitive, nonsensical, and dare I say, moronic. I still don't even know what it's saying, or even trying to say with it's language acrobatics and misdirection. Those are the kinds of rulings that can ruin a game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189161-specific-turn-order-question/?do=findComment&comment=1813064","commentId":1813064,"userName":"GrandSpleen","timestamp":1442955390,"content":"Yeah as I read it, you're playing it correctly."}]}