{"url":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/","title":"LotR LCG player archetypes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1811902","commentId":1811902,"userName":"narubianHorror293","timestamp":1442930003,"content":"I just read the \"Ned, Shagga, and Jaime… Revisited - Nate French on Player Archetypes in A Game of Thrones: The Card Game\" [https://www.fantasyflightgames.com/en/news/2015/9/21/ned-shagga-and-jaime-revisited/] article published yesterday on the FFG site. First off, I really enjoyed it - it's a good read, and one that's highly relevant for LotR LCG. While reading the article, you can understand how these considerations of player archetypes that Nate French talks about were clearly also taken when he designed the LotR LCG. It is of course a reference to the classic MtG player archetypes [http://archive.wizards.com/Magic/magazine/article.aspx?x=mtgcom/daily/mr11b], and the two sets of archetypes have a lot in common, naturally.\n\n \n\nSecond, I think that the three archetypes that Nate presents there - Ned, Shagga and Jaime - have clear parallels in our beloved game. So, risking being redundant (as this has  probably already been discussed), I think the right names for the same archetypes in LotR LCG are:\n\n \n\nThe LotR LCG \"Ned\" - The Master of Lore\n\nA true fanboy of the source material, the Master of Lore enjoys building highly thematic decks, recreating his favorite tales through the game. He also takes offense when mechanics and theme collide. Legolas can't be the Steward of Gondor. There's no chance Thorin managed to get his hands on Celebrian's Stone. Gimli and his father Gloin shouldn't be hanging out together all throughout Middle Earth. And no! The eagles can't go into Moria!\n\n \n\nMotto: \"Aragorn hasn't actually met Gandalf until T.A. 2956.\"\n \n\nI gotta say I have a little of the Master in me. I'm not a fanatic, so I'm ok with Glorfindel and Bilbo finding their way into one of my LotR saga decks, but I do have to assure myself that it might have been the case that Bilbo had joined Froddo, and that the company came upon Glorfindel rather than Gildor, who then decided to tag along. I will, however, for the life of me, will not allow Aragorn, Gimli, Boromir or Legolas feature in my Saga decks before the point in the story in which they appear in the books.\n \n\nThe LotR LCG \"Shagga\" - The Grey Companion\n\nThe Companion is in it for the puzzle. The great thing about a living card game is that the card pool keeps expending, and new ways to try and play the game are continuously created (and destroyed). Compi enjoys hours of pouring over his card boxes or binders to find just the right card to complete his new deck, or to find some way to utilize an old over-looked card.\n\nMotto: \"I can make this Song deck work.\"\n\n \n\nThis is so me. This is what I enjoy the most about this game (the theme coming a close second), and what I spend most of my time on - I probably spend 80% percent of my time with the game building decks or thinking about decks, and only 20% playing, and I'm just fine with that.\n\n \n\nThe LotR LCG \"Jaime\" - The Glaurung\n\nBeing that LotR LCG is a cooperative card game, where players combine their effort to fight the encounter deck, the game makes it kinda hard to get too competitive. That's not going to stop The Glaurung, though. Forged in the dark fires of Orodruin, trained by the KGB and armed with three core sets, The Glaurung is in it to crush the encounter deck and make Sauron kneel before the might of power-gaming. He's also the most strict about the rules out of the three archetypes, because he's got to beat the encounter deck in his own game.\n\nMotto: \"Is too easy. I wait for Nightmare cards.\"\n\nI am definitely part Glaurung. When I build a deck, I usually bend my thematic idea when I start optimizing it to become the best it can.\n \n\n \n\n \n\nAlso, I think there's a definite type that is missing from the list and is prominent in the LotR LCG player community...\n \n\nThe LotR LCG \"Hodor\" - The CotR Brandon\n\nThe CotR Brandon isn't too worried about thematic sense, and though he likes to win that's not his main concern either; The Brandon likes awesome cards. The Brandon wants to throw Steward of Gondor and Gondorian Fire on Tactics Boromir to have him kill four goblins in one combat phase with a completely over-the-top and unnecessary attack strength of 11, because that's just fun. And if the rules get in the way of that, maybe the rules need to sit this one out. The Brandon likes Sneak Attacking core Gandalf, he likes pumping Gimli with wounds and he likes killing stuff with Beorn. Usually, he likes Tactics. A lot.\n\n \n\nMotto: \"Can I put this axe on Beorn? I'm gonna put this axe on Beorn.\"\n\nWell, I guess we all got a little Brandon in us (naughty thoughts!), because everyone likes to smash things up in an epic LotR-films-like way\n\n\nSo, what do you think? Are these player archetypes a good representation of the people of our community? Is there an archetype missing? And can I put this axe on Beorn? I'm gonna put this axe on Beorn.\n\nEdited September 22, 2015 by narubianHorror293"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1811953","commentId":1811953,"userName":"GrandSpleen","timestamp":1442931266,"content":"Gotta put the link for this in here, because FFG did a news article a few years ago with their own conversion of these archetypes:\n\n \n\nhttps://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/ [https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1812091","commentId":1812091,"userName":"narubianHorror293","timestamp":1442934154,"content":"> Gotta put the link for this in here, because FFG did a news article a few years ago with their own conversion of these archetypes:\n> \n>  \n> \n> https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/ [https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/]\n\n \n\nOh, that's nice! Thanks! I like my archetype names more, though.  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1812126","commentId":1812126,"userName":"Raven1015","timestamp":1442934786,"content":"> Gotta put the link for this in here, because FFG did a news article a few years ago with their own conversion of these archetypes:\n> \n>  \n> \n> https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/ [https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/]\n\n \n\nYeah, I remember when this came out. The interesting thing is that these archetype names never really caught on in the LOTR LCG community like they did in the AGOT community. I always hear AGOT players referring to things as \"Nedly\" or \"being a Jaime\", but I hardly ever hear LOTR players talk about being a \"Boromir\" or \"Pippin\" (it does happen, just rarely). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1815451","commentId":1815451,"userName":"gandalfDK","timestamp":1443042772,"content":"Beorn did one too, on playertypes! Can't find the link...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189200-lotr-lcg-player-archetypes/?do=findComment&comment=1815538","commentId":1815538,"userName":"danpoage","timestamp":1443045281,"content":"https://hallofbeorn.wordpress.com/2013/01/28/key-concepts-play-style/ [https://hallofbeorn.wordpress.com/2013/01/28/key-concepts-play-style/]"}]}