{"url":"https://community.fantasyflightgames.com/topic/189338-troll-key-and-troll-purse/","title":"Troll Key and Troll Purse","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189338-troll-key-and-troll-purse/?do=findComment&comment=1815057","commentId":1815057,"userName":"Gandalf196","timestamp":1443032203,"content":" * These two items have some tricky interactions. From Boardgamegeek.com: (https://boardgamegeek.com/thread/843685/troll-key-and-troll-purse [https://boardgamegeek.com/thread/843685/troll-key-and-troll-purse])\n\n \n\n\"If there are no Troll enemies in play when Troll Purse or Troll Key are revealed, then they are placed in the discard pile.\" \n\n \n\nSo, their effect is not applied, because they're not discarded, but placed in the discard pile. Ok.\n\n \n\nAlso:\n\n \n\n\"Anytime the Troll Key or Troll Purse would be discarded (whether as shadow cards or by questing successfully at stage 2) they are added to the staging area. After they are added to the staging area, you check if there is a troll enemy in play to attach them to. They were worded this way so players would have a better chance at discovering the treasure and avoid the frustration you described\"\n\n \n\nTherefore, I must conclude that, if there are no trolls in play when the Troll Key or Troll Purse are discarded (thus having its effect applied: added to the staging area), they key and/or the purse will remain in the staging area indefinitely and will not be attached to the troll when they are put into play, which means that if you're unfortunate to discard these cards as shadow cards in Stage 1 (before the Trolls appear), you won't have the opportunity to claim them.\n\n \n\nAm I correct?\n\n \n\n * Regarding Stage 2B, does anyone know why the quest stage has one (1) quest point on it ? It is not posible to place tokens on this mission:\n\n \n\n\"Any time players would place progress tokens on this quest, discard an equal number of cards from the encounter deck instead. (Progress is placed on the active location before triggering this effect.) \"\n\n \n\nSo, wouldn't it be better if there was no number printed at all, or just a zero (0)? As far as I understand it, you win this mission when its Forced takes place:\n\n\"Forced: If there are no Troll enemies left in play, or if there are no cards left in the encounter deck, advance it to the next stage\"\n\n \n\nmeaning you don't need to spend a single token to win this mission. \n\n \n\nAgain, am I correct?\n\n \n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189338-troll-key-and-troll-purse/?do=findComment&comment=1815305","commentId":1815305,"userName":"cmabr002","timestamp":1443038792,"content":"1.  No I don't think that is correct.  While Troll Key and Troll Purse are in the staging area they are constantly checking to see if there are any Troll enemies in play.  As soon as a Troll enemy enters play, they would attach to that Troll.\n\n \n\n2.  Correct.\n\nEdited September 23, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189338-troll-key-and-troll-purse/?do=findComment&comment=1815354","commentId":1815354,"userName":"GrandSpleen","timestamp":1443040245,"content":"These cards received errata awhile back.  They no longer have \"When Revealed\" text, and should now read:\n\n \n\n“If Troll Purse/Key is discarded, add it to the staging area. If Troll Purse is unattached and in the staging area, attach it to a Troll enemy, if able.\"\n\n \n\nThat's a passive effect and, as cmabr002 points out, they will attach to a troll once one enters play.\n\n \n\nHere's the FAQ [https://images-cdn.fantasyflightgames.com/ffg_content/lotr-lcg/support/LotR-FAQ.pdf] with the errata text.\n\n \n\nI don't know why stage 2 has a quest point, you're correct in that you don't need 1 progress on it to win.  They could have done it better by putting -- on the quest card and then explaining it in the card text, which is what they do in more recent scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189338-troll-key-and-troll-purse/?do=findComment&comment=1858351","commentId":1858351,"userName":"jimjim19681968","timestamp":1445430673,"content":"Many thanks. I just arrived at this quest."}]}