{"url":"https://community.fantasyflightgames.com/topic/189393-gandalf/","title":"Gandalf &lt; ???","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1815982","commentId":1815982,"userName":"Camron_lambert","timestamp":1443062590,"content":"IN your opinion, what ally cards are stronger than Gandalf?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816004","commentId":1816004,"userName":"divinityofnumber","timestamp":1443063631,"content":"Core Gandalf is not as much strong as he is versatile. He feels really strong because he can help you out in multiple ways. I think that, although not quite as awesome as Core Gandalf, ally Treebeard is excellent. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816071","commentId":1816071,"userName":"joezim007","timestamp":1443066515,"content":"Which Gandalf ally?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816092","commentId":1816092,"userName":"Bullroarer Took","timestamp":1443067816,"content":"Didn't we just do this? They don't call her Arwin for nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816097","commentId":1816097,"userName":"Teamjimby","timestamp":1443068726,"content":"Gandalf is definitely versatile and fits in a lot of decks, although a lot of his value comes from Sneak Attack.  But in certain decks, Treebeard, Faramir, Arwen, and maybe Quickbeam could be more useful.  Heck, if we are going for value per resource spent, Westfold Horse-Breeder would be on the short list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816142","commentId":1816142,"userName":"divinityofnumber","timestamp":1443072330,"content":"Yes, the COTR podcast just discussed how the value of Westfold Horse-Breeder keeps rising as more and more cards are released. Quickbeam is awesome.\n\n \n\nTreebeard, like Core Gandalf, is really versatile. Unlike Gandalf, Treebeard sticks around. He costs only 4 neutral resources, which is amazing given his stats. 4 attack strength is a major plus, as is 5 hit points. And, every other turn he can do two things for you, because he can ready himself. I find myself throwing 1x Treebeard in almost every deck I build lately. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816490","commentId":1816490,"userName":"FetaCheese","timestamp":1443095004,"content":"Steward of Healing.\n\n \n\nArwen.\n\n \n\nQuickbeam.\n\n \n\nTreebeard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816530","commentId":1816530,"userName":"Lecitadin","timestamp":1443096587,"content":"Leave no Trace with Keen as Lances (even without Rossiel) : almost like Gandalf, but for a fraction of the price."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816546","commentId":1816546,"userName":"awp832","timestamp":1443097615,"content":"it's very hard to compare Gandalf as an ally to other allies.   Gandalf doesn't stick around, he doesn't function like other allies.  He costs a lot, he comes in, he has a powerful effect and then he leaves.  So, I guess I have to ask \"stronger\" than Gandalf in what sense?   \n\nBut Gleowine has got to be up there.   Repeatable card draw, 2 hp, and cheap.  Arwen and Horse breeder both very good as already mentioned.\n\nFaramir.   Can turn quests around in a big way.  \n\nI'd definitely say that Honor Guard is stupid good.  He has a ton of hp for a 2 cost,  sure he probably wont attack or block much on his own,  but I am telling you, that ability is fantastic.\n\nLegolas for the same reason as Gleowine.   He costs more, but card draw in Tactics is more valuable, plus he has much better stats.\n\nOr maybe just a simple \"staple\" card,  like West Road Traveller.   Cheap questing.   You're going to need that.   Most of the time I would rather see her in my hand than Gandalf.  \n\nEnvoy of Pelargrir is very useful for resource smoothing.  \n\nVassal of the Windlord is really solid.   Broken (to the extent that a card can be \"broken\" in a coop game.   Under-costed, would be a better term..)  in Battle quests.\n\nMost of these I would say are \"stronger\" than Gandalf in that I would rather have them in my hand than Gandalf.   Gandalf gives you a strong boost once,  but most of  these allies will give you a smaller (though still strong) boost, but continue to give it to you over multiple turns.  \n\nEdited September 24, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816800","commentId":1816800,"userName":"PocketWraith","timestamp":1443107888,"content":"We're just talking Core Gandalf right? OHaUH Gandalf > Core Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1816978","commentId":1816978,"userName":"divinityofnumber","timestamp":1443113475,"content":">  \n> \n> But Gleowine has got to be up there.   Repeatable card draw, 2 hp, and cheap. \n> \n>  \n\n \n\nIt's nice to see that someone likes Gleowine as much as I do. I think he deserves more love than he gets. You get immediate card draw after playing him, which is nice. Plus, you can choose any player to draw a card. In a four-player game, I find myself using him to help out the Tactics player. They keep taking the enemies that no one else wants to take on, and I agree to keep feeding them an extra card per turn. Gleowine works for you, whether he is giving you cards, or you are passing out cards to other players in exchange for favors.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189393-gandalf/?do=findComment&comment=1817669","commentId":1817669,"userName":"Gizlivadi","timestamp":1443135808,"content":"I consider Gandalf more like an event than an ally really, much like the rest of the other 1-turn allies. He has a powerful effect that can turn a game around (don't even get me started on Gandalf with multiple copies of Sneak Attack), and gives you a huge stat boost. But since he is actually an ally, he can interact with cards like Imrahil, Strength of Arms, and can take quite a bit of archery damage. He's an extremely good card, but I have to agree that as far as regular allies go, Arwen, Quickbeam, Faramir and Warden of Healing, especially if played early, can be more crucial than playing Gandalf once (unless of course he actually saves you, for example if you're about to threat out)."}]}