{"url":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/","title":"why the delay for Land of Shadow?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1827243","commentId":1827243,"userName":"Pacificus","timestamp":1443633866,"content":"My apology if this question has already been answered, but does anyone know why it hasn't been released yet even though it was for sale at GenCon two months ago?  Does GenCon get a separate print run? \n\n \n\nThanks--Steve"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1827254","commentId":1827254,"userName":"Raven1015","timestamp":1443634183,"content":"It does seem to be the case that GenCon gets a separate print run, as releases at Gen Con usually aren't available to the public until a month or two afterwards. For example, the Game of Thrones 2.0 Core Set was at Gen Con, but won't be for sale until next week. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1827325","commentId":1827325,"userName":"Teamjimby","timestamp":1443636349,"content":"Yeah, that's how they always do it.  There is a special rush delivery to get limited copies to Gen Con, then the retail release is usually 1-2 months later.  IIRC, Netrunner, Warhammer 40k, previous saga/deluxe boxes, and now Game of Thrones 2.0 have all been the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1827643","commentId":1827643,"userName":"Lecitadin","timestamp":1443644900,"content":"So the special quest (the one with the treasures and the dragon - sorry, I forgot the quest's title) will also come in around a month?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1827661","commentId":1827661,"userName":"danpoage","timestamp":1443645772,"content":"> So the special quest (the one with the treasures and the dragon - sorry, I forgot the quest's title) will also come in around a month?\n\nMore or less. Just think of the post-Gen Con releases as being delivered by Gandalf. A wizard is never \"late\"..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1828259","commentId":1828259,"userName":"ppsantos","timestamp":1443671343,"content":"I just find it strange that FFG would mark the Land of Shadow as \"on the boat\", that it's coming from overseas (and not yet on hand).  I mean why have two print runs and two shipping cost for Land of Shadow: one limited print run for Gen Con (and pay the shipping cost from China) and then the regular print run for the public release two months after?  Couldn't FFG order one big enough print run for both GenCon and hold on to the excess until it's time for public release?  If FFG ordered just one big print run, why label the LoS as \"on the boat\"?  Is FFG just following the 'normal' stage updates (in development, at the printer, on the boat, shipping now, and available now), even though they already have the stocks in the warehouse?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1828350","commentId":1828350,"userName":"Teamjimby","timestamp":1443676893,"content":"I think it's a schedule thing.  They are often up against deadlines, so I doubt the whole print run would have been ready for Gencon. I don't think they are sitting on stock in a warehouse, just waiting to make the Gencon purchases feel special."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1828843","commentId":1828843,"userName":"danpoage","timestamp":1443711607,"content":"> I just find it strange that FFG would mark the Land of Shadow as \"on the boat\", that it's coming from overseas (and not yet on hand).  I mean why have two print runs and two shipping cost for Land of Shadow: one limited print run for Gen Con (and pay the shipping cost from China) and then the regular print run for the public release two months after?  Couldn't FFG order one big enough print run for both GenCon and hold on to the excess until it's time for public release?  If FFG ordered just one big print run, why label the LoS as \"on the boat\"?  Is FFG just following the 'normal' stage updates (in development, at the printer, on the boat, shipping now, and available now), even though they already have the stocks in the warehouse?\n\n \n\nI actually talked about this with an FFG employee at Gen Con (sorry - can't remember who specifically it was). As Teamjimby said, it has to do with schedules and throughput. Even if they use multiple manufacturers, there is only capacity to print so many things in a certain period of time. Adding new manufacturers to your list of existing ones is not trivial, and might not make a difference as those manufacturers (if they're any good) will be busy making things for other companies. Printers are a finite resource, and in-house printing is either expensive or, in the case of POD, of lesser quality. As someone who has designed logistics software, I can say that this problem is devilishly complicated. Even when the manufacturing runs smoothly, shipping can be an issue as well (as we saw with the dock workers strike in the recent past). So while it might be tempting to blame FFG for bad planning or \"fix\" the issue with some oversimplification, as long as their games are made elsewhere, this is always going to be a challenge. From their in-flight report, it sounds like they are looking into doing more in-house printing. If they can improve the quality of POD, or perhaps have a second higher-quality tier, that would certainly help quite a bit. We'll see, but this is one of the challenges of dealing with physical goods.\n\nEdited October 1, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1828861","commentId":1828861,"userName":"Pacificus","timestamp":1443712197,"content":"> I just find it strange that FFG would mark the Land of Shadow as \"on the boat\", that it's coming from overseas (and not yet on hand).  I mean why have two print runs and two shipping cost for Land of Shadow: one limited print run for Gen Con (and pay the shipping cost from China) and then the regular print run for the public release two months after?  Couldn't FFG order one big enough print run for both GenCon and hold on to the excess until it's time for public release?  If FFG ordered just one big print run, why label the LoS as \"on the boat\"?  Is FFG just following the 'normal' stage updates (in development, at the printer, on the boat, shipping now, and available now), even though they already have the stocks in the wareh\n> \n>  \n> \n> >  \n> > \n> > > I just find it strange that FFG would mark the Land of Shadow as \"on the boat\", that it's coming from overseas (and not yet on hand).  I mean why have two print runs and two shipping cost for Land of Shadow: one limited print run for Gen Con (and pay the shipping cost from China) and then the regular print run for the public release two months after?  Couldn't FFG order one big enough print run for both GenCon and hold on to the excess until it's time for public release?  If FFG ordered just one big print run, why label the LoS as \"on the boat\"?  Is FFG just following the 'normal' stage updates (in development, at the printer, on the boat, shipping now, and available now), even though they already have the stocks in the warehouse?\n> > \n> >  \n> > \n> > I actually talked about this with an FFG at Gen Con (sorry - can't remember who specifically it was). As Teamjimby said, it has to do with schedules and throughput. Even if they use multiple manufacturers, there is only capacity to print so many things in a certain period of time. Adding new manufacturers to your list of existing ones is not trivial, and might not make a difference as those manufacturers (if they're any good) will be busy making things for other companies. Printers are a finite resource, and in-house printing is either expensive or, in the case of POD, of lesser quality. As someone who has designed logistics software, I can say that this problem is devilishly complicated. Even when the manufacturering works smoothly, shipping can be an issue as well (as we saw with the dock workers strike in the recent past). So while it might be tempting to blame FFG for bad planning or \"fix\" the issue with some oversimplification, as long as their games are made elsewhere, this is always going to be a challenge. From their in-flight report, it sounds like they are looking into doing more in-house printing. If they can improve the quality of POD, or perhaps have a second higher-quality tier, that would certainly help quite a bit. We'll see, but this is one of the challenges of dealing with physical goods.\n> > \n> >  \n> \n> Thanks danpaoage--that certainly makes more sense.  I was very much sympathetic to ppsantos in questioning how much more it must cost for multiple print runs/deliveries, but I guess logistics are a lot harder than they appear.  Full disclosure my group is still at Helm's Deep so its not like we are ready to start rummaging around in the Emyn Muil anyway..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/189993-why-the-delay-for-land-of-shadow/?do=findComment&comment=1870545","commentId":1870545,"userName":"Bullroarer Took","timestamp":1446152651,"content":"Still on the boat."}]}