{"url":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/","title":"Encounter Deck -- Drawing and Reshuffling questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=1832122","commentId":1832122,"userName":"JYoder","timestamp":1443900944,"content":"In playing \"The Road to Isengard\", I have a couple of questions...\n\n \n\n1) Orthanc location says \"After the players quest successfully, the first player looks at the top 3 cards of the encounter deck, reveals 1, and discards the others.\" What if there is only 1 card left? Do I simply reveal it? Or draw it, shuffle discard pile back into the deck, draw 2 more, and make my decision?\n\n \n\n2) Grima enemy says, \"After Grima attacks a player, that player shuffles Grima back into the encounter deck and reveals an encounter card.\" What if the encounter deck is empty? Do I place him here and draw him? Or do I shuffle the discard pile and Grima back into the encounter deck first and then reveal a card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=1832158","commentId":1832158,"userName":"GrandSpleen","timestamp":1443903421,"content":"1) I'm not sure!  This is happening during the quest phase, so if the encounter deck gets emptied, you have to reshuffle it immediately.  However, when you are \"looking\" at encounter cards, they are technically still in the encounter deck, so the deck is not emptied until you reveal or discard that last card.  And once you've done that, you'll reshuffle the encounter deck, but you've already made your choice about which cards get revealed/discarded, so it's too late to \"look\" at the top cards of the encounter deck again.  I suppose simply revealing that last card would be the safest way to play-- the card effect does state you need to reveal 1.  But it also gives you an element of choice: which card to reveal and which to discard.  So it's possible that you may be able to look at and discard that card.  So after saying all that, I'm not sure! But I would reveal the card, if it were my game.  \n\n \n\n2) I would do the first thing you described.  Shuffle him back into the encounter deck-- so Grima will become the only card in the deck-- then reveal a card from the encounter deck -- which would be Grima.  I wouldn't shuffle the encounter discard pile back in since nothing instructs you to do so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=1832186","commentId":1832186,"userName":"JYoder","timestamp":1443905371,"content":" \n\nSo if the encounter deck is emptied anytime during the quest phase, you are to shuffle in the discards? I understand you do if you have to draw more cards, but what if you've drawn all you need and the deck is empty? I've always played it's a bonus then, as the enemies get no shadow cards.\n\n \n\n1) Interesting what you said about maybe discarding it as one of the two cards. I figured you need to do things in the order given on the card. But you raise a good point -- it doesn't say \"... then discards the others\" but says \"... and discards the others\" so maybe they are considered simultaneous actions? Any way to get an official ruling?\n\n \n\n2) Sounds like there isn't an official ruling for this either... unless you're pretty sure your guess is correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=1832214","commentId":1832214,"userName":"GrandSpleen","timestamp":1443906891,"content":"Yeah, ANY time during the quest phase.  If you run out of cards during the combat phase, it'll stay empty.  If you have only 1 card left but there are 3 engaged enemies, you'll deal out that last encounter card as a shadow card to the first enemy, and the other two enemies will get no shadow cards.  \n\n \n\nBut if you run out of encounter cards during the quest phase, even if you've already completed the staging step, you have to shuffle the discard pile back in immediately.\n\n \n\n1) If you'd like to submit an official rules question, scroll way down to the bottom of this page where the copyright information is.  There is a link for \"Rules Questions.\"  That goes to the game developers.  If you submit one, be sure to let us know what the answer was!\n\n \n\n2) I'm reasonably sure about my understanding of the Grima question.  This is occurring during the combat phase, since (from what I can tell) there is no way for Grima to attack outside of the combat phase.  So you're able to resolve his text exactly as written: return him to the deck, \"shuffle\" it even though its only 1 card, then reveal the top card, which will still be Grima."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=1832368","commentId":1832368,"userName":"Rob_Oz","timestamp":1443917586,"content":"I played Grima the same way in \"Road to Isengard\" If the Encounter deck is empty after he attacks, he gets \"shuffled\" in and then comes right back out. Kinda annoying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2305315","commentId":2305315,"userName":"JYoder","timestamp":1468289994,"content":"Hehe. This is quite funny. I'm playing through the saga quests again, and I'm playing this same quest -- and I again came across this exact same scenario with Orthanc, where I have 1 card in the encounter deck, but I need to look at the top 3 cards. I did a Google search, and this original thread of mine immediately came up... but still no answer. I had sent the question to Caleb back then (almost 2 years ago) but never got a response. I've now resent that email today, so hopefully I can get a definitive answer.\n\n \n\nThat is, unless someone here now knows the answer from a similar situation after so much time has passed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2305449","commentId":2305449,"userName":"GrandSpleen","timestamp":1468300495,"content":"If you posted this thread when you originally had the question, it wasn't 2 years ago -- 9 months only.  My own answer hasn't changed.  I would still reveal that last card.  I give no credence to the favorite guideline \"choose the hardest option,\" but the text in this case seems to push toward revealing one.  They use the number 1 (\"reveal 1\") so I figure you should have to fulfill that.  You wouldn't reshuffle the deck while simply looking at the last card.  The question is whether you'd be allowed to discard that one card as one of \"the others,\" but I don't think you can have \"others\" if you don't have a \"1,\" so I'd reveal it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2305489","commentId":2305489,"userName":"NathanH","timestamp":1468305089,"content":"I use the following guidelines for dealing with situations where X cards are needed in a deck and there are fewer than X actually there.\n\n \n\n1) If it is a Cost, it cannot be paid.\n\n2) If it is an Effect, it uses all the cards remaining in the deck and resolves as best it can for these.\n\n \n\nIn the case of 2) you have to check the wording carefully each time, but in this case it means revealing the only card left in the deck. It's the \"reveal 1\" that has priority here. If it said \"discard two and reveal the other\" then I'd discard the one card and the \"other\" doesn't exist so I wouldn't do anything."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2305955","commentId":2305955,"userName":"rmunn","timestamp":1468332865,"content":"I agree with GrandSpleen and NathanH. The wording on Orthanc is an effect, not a cost, so you do as much of it as you can. In this case, that means looking at the top 3 cards of the 1-card encounter deck, so you look at only one card. Then you reveal it, and discard the others (a total of 0 cards).\n\n \n\nTHEN, because it is still the quest phase and the encounter deck is now empty, you immediately shuffle the discard pile. See section 1.24 of the FAQ:\n\n \n\n> (1.24) Questing successfully\n>  \n> Questing successfully and the physical placement of progress tokens are two separate game occurrences that happen in sequence during the Quest Resolution step. As soon as the players determine that the total committed Willpower is greater than the total Threat in the staging area, they are considered to have quested successfully. Any Forced or passive effects initiated by questing successfully resolve before physically placing progress tokens.\n>  \n> Example: Tom has just successfully quested during stage 1B of The Hunt Begins (SoM 11), and he will be placing enough progress to advance to the next stage. However, he must first resolve the Forced effect (which resolves immediately upon the occurence of “questing succesfully”) before placing progress tokens on the quest.\n> \n>  \n\n \n\nNow, if you had been instructed to discard three cards from the encounter deck (and then put all enemies discarded by this effect into play, or some similar wording), then it would work like this:\n\n \n\n1) Discard first card.\n\n2) Encounter deck is now empty during the quest phase: shuffle encounter discard pile.\n\n3) Discard second card.\n\n4) Discard third card.\n\n \n\nBut since you were told to just look at the top three cards, you wouldn't trigger a shuffle -- because looking at a card leaves it conceptually where it is. When you use King Under the Mountain, if one of the two cards is a Hidden Cache and you choose to discard it, it discards from the top of your deck and gives you the 2 resources. Likewise, when you look at the last card of the encounter deck, it's still in the encounter deck and the encounter deck isn't yet empty. It will only become empty when you draw or discard that last card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2309168","commentId":2309168,"userName":"JYoder","timestamp":1468467282,"content":"> If you posted this thread when you originally had the question, it wasn't 2 years ago -- 9 months only.\n\n \nWow, can't believe I didn't notice the year. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Anyway...\n \nResponse from Caleb, which verify what others have said...\n \n1. If there is only 1 card left on the top of the encounter deck when you resolve Orthanc’s effect, you must reveal that card.\n2. If there are no cards left in the encounter deck when Grima’s effect triggers, Grima would become the only card in the encounter deck, which means you would end up revealing him.\n \nSo I've one more question. The deck has 1 card in it at the start of the round. In a 2 player game, each now has to draw a card. Sarumon's effect is that when you draw cards, he is dealt 2 shadow cards and attacks. Do you reshuffle the encounter deck in this instance? Or do you only reshuffle the encounter deck when it's empty during the quest phase? (In which case, player 1 would only have 1 shadow card on Sarumon and player 2 would have none.)\nEdited July 15, 2016 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190299-encounter-deck-drawing-and-reshuffling-questions/?do=findComment&comment=2309218","commentId":2309218,"userName":"GrandSpleen","timestamp":1468470660,"content":"Only shuffle it in the quest phase.  Player 2 gets a free pass."}]}