{"url":"https://community.fantasyflightgames.com/topic/190349-undefended-attack-free-to-attack-after/","title":"Undefended attack. Free to attack after?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/190349-undefended-attack-free-to-attack-after/?do=findComment&comment=1832855","commentId":1832855,"userName":"jimjim19681968","timestamp":1443952022,"content":"Very simple, but require clarification.\n\n \n\nAn enemy attacks a hero.\n\n \n\nThe hero takes the attack undefended and takes resultant damage.\n\n \n\nHero is free to attack.\n\n \n\nYes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190349-undefended-attack-free-to-attack-after/?do=findComment&comment=1832861","commentId":1832861,"userName":"cmabr002","timestamp":1443952284,"content":"The short answer is yes, the hero is free to attack, but let me clarify...\n\n \n\nWhen you take an undefended attack, there is no specific target.  After determining how much damage the attack does, you can choose where to place the damage so long as the damage goes on one hero and isn't split up among your heroes.  After you finish resolving the enemy attack, you are free to attack the enemy with any ready characters, including any heroes that were damaged as a result of the undefended attack.\n\n \n\nEdit: Also, enemies (generally) attack the player and the player chooses how they wish to deal with the attack by defending it or taking it undefended.  There are a few card effects that indicate that the attacking enemy is attacking a specific character and those attacks are resolved identically to attacks against players with the exception that undefended damage from such an attack must be assigned to the designated character.\n\nEdited October 4, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190349-undefended-attack-free-to-attack-after/?do=findComment&comment=1833506","commentId":1833506,"userName":"Rob_Oz","timestamp":1443995497,"content":"An additional minor point, but thought it might be worth mentioning. Sometimes enemies make \"immediate attacks\" outside of the normal combat phase, usually via the enemy's own \"when revealed\" effect or a treachery. It is important to remember that if such an effect occurs outside the combat phase you cannot attack such an enemy even if you take undefended damage. The only way you could attack is through a card that grants you the ability to attack or do damage outside of the combat phase and even then this would likely be after you've already taken undefended damage from that enemy's extra attack.\n\nEdited October 4, 2015 by RobOz"}]}