{"url":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/","title":"Dunland Chieftan and Empty Encounter Deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/?do=findComment&comment=1832372","commentId":1832372,"userName":"cmabr002","timestamp":1443917983,"content":"Dunland Chieftan\n\n \n\n> Forced: After Dunland Chieftain engages a player, discard X cards from the top of the encounter deck where X is the number of cards in the engages player's hand. Put the topmost Dunland enemy discarded this way into play engaged with that player.\n\n \n\nWhat happens if you engage him in any phase other than the quest phase and there are not enough remaining cards in the encounter deck to fully satisfy his forced effect?\n\n \n\n1.  You cannot engage him either naturally or optionally regardless of your threat level.\n\n \n\n2.  You can engage him and must discard as many cards as possible, but you do not reshuffle the encounter deck to fully satisfy the text.\n\n \n\n3.  You can engage him and must discard as many cards as required, reshuffling the encounter deck if necessary.\n\n \n\n4.  Other\n\n \n\nMy question stems from the sentence in the rule book \"An empty encounter deck only resets during the quest phase\", but this sentence is in reference to drawing shadow cards, so I'm not entirely sure if it applies to Dunland Chieftan's forced effect as well.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/?do=findComment&comment=1832377","commentId":1832377,"userName":"PsychoRocka","timestamp":1443918427,"content":"Pretty positive it is 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/?do=findComment&comment=1832632","commentId":1832632,"userName":"Teamjimby","timestamp":1443933028,"content":"Agreed on 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/?do=findComment&comment=1838327","commentId":1838327,"userName":"cmabr002","timestamp":1444226531,"content":"Thanks for your responses.  I asked Caleb to be sure.\n\n \n\n> Q: What happens if you engage Dunland Chieftan in any phase other than the quest phase and there are not enough remaining cards in the encounter deck to fully satisfy his forced effect?\n> \n>  \n> \n> Caleb: When you engage Dunland Chieftain outside of the quest phase and there are not enough cards left in the encounter deck to fulfill his Forced effect, you do as much as you can: discard cards from the encounter deck until there are none left. Then, choose a Dunland enemy discarded that way and put it into play engaged with you. If no enemy was discarded, then nothing happens.\n\nEdited October 7, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190320-dunland-chieftan-and-empty-encounter-deck/?do=findComment&comment=1838370","commentId":1838370,"userName":"NathanH","timestamp":1444227828,"content":"If the encounter deck is running low, you can sometimes sneakily use this to exhaust the deck before shadow cards are dealt."}]}