{"url":"https://community.fantasyflightgames.com/topic/190864-4-player-rules-questions/","title":"4 player rules questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/190864-4-player-rules-questions/?do=findComment&comment=1841837","commentId":1841837,"userName":"Billonious1","timestamp":1444407046,"content":"I have two questions: why are two core sets needed to play with 4 people and does doubling up apply to expansions, like would I have to buy two core sets and two numenor expansion sets for 4 people to play with that expansion? Thanks for your time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190864-4-player-rules-questions/?do=findComment&comment=1842314","commentId":1842314,"userName":"CJMatos","timestamp":1444427123,"content":"The reason of two core sets needed for 3/4 players games is mainly because of threat trackers. And maybe not enough tokens (progress, damage, resources) at some point in game...\n\n \n\nIt certainly gives you more choices to make decks but not mandatory...\n\n \n\nAs for expansions and AP's, no need unless you need some player cards for decks..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190864-4-player-rules-questions/?do=findComment&comment=1844272","commentId":1844272,"userName":"TwiceBorn","timestamp":1444613385,"content":"With 4 players using a single Core set, you will be limited to 30-card decks per player with minimal deck building flexibility (most people like to build 50-card decks, which is the legal minimum for tournament play... but if you're just playing with friends for fun, then that limit is irrelevant).\n\n \n\nKeep in mind that playing with 4 players, you will effectively be doubling the rate at which Treacheries and other cards with nasty \"When Revealed\" effects are revealed from the encounter deck... and a single Core set only has two copies of A Test of Will, so you might have difficulty fending off some of those Treacheries (Eleanor can help mitigate that somewhat).\n\n \n\nIf you're happy playing with 30-card decks, then you should be fine playing with a single Core set. You can always keep track of threat increases on a sheet of paper, and use coins or other bits to supplement your token pools.\n\n \n\nI have 2 Core sets (and the player cards only from a third Core, purchased through eBay), but I don't think I would ever buy more than a single copy of each adventure pack/deluxe expansion.\n\nEdited October 12, 2015 by TwiceBornh"}]}