{"url":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/","title":"Emyn Muil newbie questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843570","commentId":1843570,"userName":"Lee418","timestamp":1444552808,"content":"The first question is more of a clarification than a question.\n\n \n\n1. The Emyn Muil quest card says:\n\n> Forced: If there are no locations in the staging area, the first treachery card revealed during the quest phase gains surge.\n> \n>  \n\n \n\nAs I read it, this condition applies to every game round, not just the first time a treachery card is drawn during the entire game. Correct?\n\n \n\n2. The Highlands location card says that travelling to that location requires the top card of the encounter deck be added to the staging area. But what happens if that new card has the Doomed keyword printed on it? According to the rulebook, Doomed effects are resolved when a card is revealed during the staging step of the quest phase or in setup. But what about the travel phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843575","commentId":1843575,"userName":"John Constantine","timestamp":1444553796,"content":"1. Yes;\n\n2. The Highlands read: \"Travel: In order to travel to The Highlands, the players must reveal the top card of the encounter deck, and add it to the staging area.\"\n\nNow, the crucial point here is the word \"reveal\". When you reveal an encounter card, you must resolve its keywords, which include Doomed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843577","commentId":1843577,"userName":"NathanH","timestamp":1444554569,"content":"According to the rulebook you're right that Doomed does nothing outside Quest or Setup, but sadly they issued a \"clarification\" (i.e. changed the rules) in the Official FAQ:\n\n \n\n>  \n> \n> Surge, Doomed, and Guarded keywords should be\n> \n> resolved any time the card on which they occur is\n> revealed from the encounter deck, including during\n> setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843616","commentId":1843616,"userName":"Lee418","timestamp":1444561904,"content":"Thanks guys!  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  That's cleared up those questions.\n\n \n\nI have a follow up question that's a bit more general in nature. Yesterday was my first attempt at a new adventure other than the ones included in the Core set. (Apart from Emyn Muil I also have The Dead Marshes, but haven't tried it yet.) Looking at the location heavy encounter deck I realised that questing was a top priority. So with that in mind I decided to use a Spirit-Tactics hero combo including Eowyn, Gimli, and Brand son of Bain. On the questing side this worked great. In fact it was almost overkill. But a couple of unlucky treachery cards practically wiped out the entire team due to their (Eowyn & Brand) low hit point levels and lack of healing opportunities.\n\n \n\nSo given my relatively small card pool, which resource and hero combinations would you suggest for Emyn Muil?   \n\nEdited October 11, 2015 by Lee418"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843638","commentId":1843638,"userName":"John Constantine","timestamp":1444564473,"content":"I would suggest you Spirit + Lore. Spirit is your best bet at questing, and this quest requires a lot of questing (+You need those Northern Trackers and Lorien Guides for this quest), while Lore has a couple of healing effects you were striving for (Including a hero that can heal you constitatnly, at a hefty cost though). Plus, Lore has a couple of location-interacting tricks up his sleeve, and it can help you draw the stuff you need faster.\n\nEdited October 11, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843705","commentId":1843705,"userName":"Lee418","timestamp":1444570223,"content":"Thank you, John Constantine. I will give it a go. My initial thoughts for hero selection are Eowyn and Glorfindel. But I'm unsure about the third one. \n\n \n\nDunhere doesn't sound like he will be all that much help in Emyn Muil.\n\n \n\nEleanor is a good possibility due to her low threat cost and useful ability. But she does have low willpower as well.\n\n \n\nBeravor isn't too bad stat-wise. But I'm not sure how useful her card draw ability will be in such a low combat oriented adventure.\n\n \n\nDenethor? Low threat, but also low willpower. On the other hand, he does have the ability to get rid of nasty encounter cards. \n\nEdited October 11, 2015 by Lee418"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843713","commentId":1843713,"userName":"John Constantine","timestamp":1444570830,"content":"I would suggest you Denethor, as he's the best defender out of the box, and he will be able to repel most of enemies you'll face without even being scratched. Even more, if you'll be lucky enough to face no enemies - his action will not be wasted, because you will be able to scry and know for sure what's coming next to preperare a perfect questing party, or get rid of a particularly nasty card ahead.\n\n \n\nEDIT: Note that having two Lore heroes might put a dent on your effort, because most efficient cards to deal with this quest are Spirit and you are going to need a lot of Spirit resources.\n\nEdited October 11, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843826","commentId":1843826,"userName":"Lee418","timestamp":1444580898,"content":"> EDIT: Note that having two Lore heroes might put a dent on your effort, because most efficient cards to deal with this quest are Spirit and you are going to need a lot of Spirit resources.\n\n \n\nI encountered the same problem on my first attempt while playing with a Tactics-Spirit deck. But I included three copies of the neutral attachment card, Song of Travel, in the deck, and even though I only drew one of them in the game it still helped a lot.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843830","commentId":1843830,"userName":"John Constantine","timestamp":1444581130,"content":"Good thinking!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1843909","commentId":1843909,"userName":"TwiceBorn","timestamp":1444586869,"content":"Straight solo, I've had great success using Denethor/Legolas/Eowyn (4 wins out of 6 games played).\n\n \n\n2-player or 2-handed, I've never lost using Aragorn/Eleanor/Thalin and Bilbo Baggins/Denethor/Eowyn. Since you don't currently have Bilbo Baggins, Beravor could be a good substitute. I think good card draw is key to victory, even in a low combat adventure. After all, if you don't have those Northern Trackers in your starting hand, then you might need some help accelerating your draw until you do find them! You'll also want to get treachery/shadow effect cancellation and threat reduction cards in hand a.s.a.p... and maybe even Gandalf, should you be unlucky enough to have to face Chieftain Ufthak in combat!\n\nEdited October 11, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1844062","commentId":1844062,"userName":"alexbobspoons","timestamp":1444597988,"content":"Welcome to scenarios outside core :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThis one isnt too eventful but I still managed to lose a few times.\n\nAtmospheric and thematic, but not exciting, so if you crave more excitement dont worry, emyn muil isnt typical :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1844071","commentId":1844071,"userName":"Lee418","timestamp":1444598279,"content":"> Straight solo, I've had great success using Denethor/Legolas/Eowyn (4 wins out of 6 games played).\n\n \n\nThanks for the tips, TwiceBornh. I've never tried to play a tri-sphere deck. But I might give it a go once I get a bit more experience under my belt. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1844083","commentId":1844083,"userName":"Lee418","timestamp":1444599363,"content":"> Atmospheric and thematic, but not exciting, so if you crave more excitement dont worry, emyn muil isnt typical :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm guessing that's the reason why it's one of the few Mirkwood cycle AP's that's still available to buy. Aside from, The Dead Marshes, they are pretty hard to find at the moment. \n\n \n\nEmyn Muil might not be action packed, but because it is so different it has forced me to experiment more with deck building. The usual 'monster bashing' decks I've played so far just aren't up to the task of such a high location/quest-heavy adventure. Despite it's bad reputation I'm enjoying it so far.  \n\nEdited October 11, 2015 by Lee418"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1844109","commentId":1844109,"userName":"John Constantine","timestamp":1444601171,"content":"I've enjoyed Hills of Emyn Muil during my times too. It was a nice break from being constantly assaulted by endless hordes and giant trolls. I could even call that quest \"a sight-seeing one\", so calm and relaxing it felt to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1844131","commentId":1844131,"userName":"alexbobspoons","timestamp":1444602813,"content":"Mirkwood cycle is currently being reprinted so stocks will be back up soon :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nGood point about deck building, hadn't thought of it that way.\n\nI've played tri sphere a lot and with a bit of resource generation in there (Steward of Gondor, Theodred, Gloin etc) its actually pretty addictive and not as resource starved as you initially expect.\n\nBest of luck :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1853668","commentId":1853668,"userName":"Lee418","timestamp":1445179740,"content":"Another Emyn Muil game today, with the new deck. (Which is working great btw.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ) I want to check that my win was by the book though.\n\n \n\nHere's the situation:\n\n \n\nI have 16 Victory points in hand so far.\n\n \n\nThe Active Location is, The North Stair (3 Travel, 3 Victory)\n\n \n\nIn the staging area is, The Highlands (1 Threat, 1 Travel, 1 Victory.) \n\n \n\nDuring the Quest Phase I commit characters worth 8 Willpower. The Encounter card drawn from the deck is, Orc Horse Thieves (3 Threat), pushing the total Threat up to 4.\n\n \n\nBefore resolving the Quest Phase I exhausted and discarded a copy of, The Riddermark's Finest, and placed the progress tokens on The Highlands card, thereby removing one of the two locations from play. (17 Victory)\n\n \n\nResolving the Quest: 8 Willpower versus 3 Threat. Result = +5. The North Stair is explored and claimed, pushing the Victory total to 20, while also clearing all Emyn Muil location cards and still leaving 2 points worth of travel for the Quest. A win, I think.\n\n \n\nBut was my use of, The Riddermark's Finest, legal? I've never played that card before, and want to check that I didn't fudge the result."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1853714","commentId":1853714,"userName":"Ecthelion III","timestamp":1445182173,"content":"Yep, that's a legit play. There's an action window in between revealing cards from the encounter deck and quest resolution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/190974-emyn-muil-newbie-questions/?do=findComment&comment=1853740","commentId":1853740,"userName":"Lee418","timestamp":1445184923,"content":"> Yep, that's a legit play. There's an action window in between revealing cards from the encounter deck and quest resolution.\n\n \n\nThanks for the clarification.\n\n \n\nI thought I would ask because I almost overlooked the opportunity to play the card. But after I did, and claimed an easy win at the same time, it kind of felt a bit cheap. My previous games have tended to be long, hard slogs through the Emyn Muil. But this was more like a quick day trip. My threat level only reached 37 too! Lucky/easy card draws I guess.  :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"}]}