{"url":"https://community.fantasyflightgames.com/topic/191071-buying-problems/","title":"Buying problems","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845042","commentId":1845042,"userName":"SauronTheGreat","timestamp":1444669105,"content":"Hay all!  So Im not the richest guy out there and even though I do enjoy this game, I find that the quests are not so replayable.  I don't want to spend ten bucks on a pack so that I can play the quest two or three times and get a few player cards.  Are there any new spins on the quests that I can use to make old quests fun again?  BTW,  I have three core,  through stewards fear, first three saga, first two GenCon, and also assault on Osgiliath.  Should I just give up on the game cause its to expensive or is it worth buying more packs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845110","commentId":1845110,"userName":"Seastan","timestamp":1444671694,"content":"Well, there are many fan made scenarios. Ninjadorg over on BGG created a bunch that I believe can be made with one core set: http://boardgamegeek.com/filepage/66659/ninjadorgs-lotr-lcg-scenarios [http://boardgamegeek.com/filepage/66659/ninjadorgs-lotr-lcg-scenarios]\n\n \n\nIf you don't mind my asking, what is it that makes you feel the scenarios are not so replayable?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845169","commentId":1845169,"userName":"Thanatopsis","timestamp":1444674360,"content":"Well, there's nightmare decks to make the quests more difficult. These decks also enhance the theme of each quest and tighten up encounter deck synergy. But, that is not a free alternative given your limited budget."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845472","commentId":1845472,"userName":"SauronTheGreat","timestamp":1444687578,"content":"Yes I have thought about designing my own quest.  That could be an alternative, but my quests are never as sharp or fair as theirs. And about replayable, part of it could just be that I play this game too often and have played all my quests anywhere from 5 to 20 times.  The other thing is that even though I play some solo, I also play with my two bros, and the one of them who has money to spend says that they are not replayable and that because of this he doesn't want to get knew ones.  And without his backup, I can't really afford that much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845515","commentId":1845515,"userName":"DunedainLoreKeeper","timestamp":1444689719,"content":"Replayability should come from using new player decks you constructed against quests you've played before. If that doesn't excite you enough to enjoy older quests, you'll have a problem. But 5 to 20 games out of a single quest is a lot of entertainment for it's price. Certainly cheaper than going to the movies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1845589","commentId":1845589,"userName":"awp832","timestamp":1444693737,"content":"I agree,  I'd say on average it takes me about an hour to go through a LotR game.  If you get 5-20 hours of entertainment per quest,  that's a fairly good deal IMO.   However, I understand trying to game on a budget.\n\nAlthough,  it seems you've spent a fair amount on this game already, if I may be so bold...  So you must like it fairly well, I should say.  Still, I have a few suggestions.\n\nYou must have favorite quests,  ones you feel are more repayable than others,  try to determine what you like about those quests and buy only the quests that seem like those.  Don't buy packs as soon as they come out,  wait a bit and get some opinions first.   If most people tend to really like the quest,  you'll probably get more value out of it.   \n\nAs mentioned, building new decks or fan made quests might be another option.   So might changing the number of players.   It sounds like you have quite a card pool already.   Couldn't you build several decks and try to get some other people in on the game? Search for people who might enjoy it,  make some new friends in the process.\n\nLastly, you might honestly do very well buying a different game.  I'm not saying permanently, and don't make the game an LCG/CCG.  Do a little research and find a board game that you think you'll enjoy and buy that.  Play it for a while, and you might find that once you come back to LotR LCG the quests are a bit less stale.   It sounds to me like your problem is you're bored with the quests because you've played them all so much,  not because they lack replayability.  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/191071-buying-problems/?do=findComment&comment=1846352","commentId":1846352,"userName":"SauronTheGreat","timestamp":1444745337,"content":"thx sounds good!  I'll try some of your ideas!"}]}