{"url":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/","title":"Complementary Spheres?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1853213","commentId":1853213,"userName":"otomo","timestamp":1445121846,"content":"I'm not new-new since I've played for a little bit and have a few of the expansions, but it looks like most people and blogs tend to build decks with Lore/Leadership and Spirit/Tactics. My wife and I have played and we've flipped that so I have a Lore/Tactics deck and she's got a Spirit/Leadership deck. Hers really is the main quest engine and mine does some buffing and handles most of the attacks (I'd say overall hers handles both a little better). Are we making it harder on ourselves by not playing synergistic spheres? Or does it not really matter because we've got everything covered between the two decks? Probably will make it harder to solo or go to play with other people if that's the case.  \n\n \n\nI'm also wondering if I'm going too heavy lore when I should be doing tactics.  I'm running Legolas / Bilbo (card draw) / Denethor and while I'm very much enjoying the card draw from Bilbo, he feels a little useless other than that.  I've got the hobbit expansions and the first couple of Shadows of Mirkwood packs so we don't have a huge card pool for player cards. I do run mostly lore cards though, but find myself never having enough money for most of my good tactics stuff.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1853217","commentId":1853217,"userName":"Ecthelion III","timestamp":1445122032,"content":"My favorite deck combinations are Leadership/Tactics for heavy combat and Spirit/Lore for support and questing. However, no two spheres are \"naturally built to work well together\". Whatever works the best for you is the way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1853225","commentId":1853225,"userName":"CJMatos","timestamp":1445122402,"content":"I think you need to read this article [https://wardenofarnor.wordpress.com/2015/07/12/how-do-the-spheres-combine/] from wardenofarnor about this topic..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1853266","commentId":1853266,"userName":"otomo","timestamp":1445126124,"content":"> I think you need to read this article [https://wardenofarnor.wordpress.com/2015/07/12/how-do-the-spheres-combine/] from wardenofarnor about this topic...\n\nOooh, thanks for that!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1853401","commentId":1853401,"userName":"awp832","timestamp":1445141557,"content":"like Ecthelion I use Ld/T and S/Lo.  I think a lot of people do.   However,   I think it's generally more important to have heros and cards that work well together than to worry about which sphere goes with what.  In 2 player I think it is a good idea to have all your bases covered, but exactly who picks up what sphere probably isn't too important.\n \n\nThat being said,  there are good reasons why Ld/T and S/Lo are popular.  I think one of the main reasons is fighting enemies gets expensive.  If you're engaging enemies you're probably losing allies at least on occasion as blockers, and you need to probably spend resources on getting your heros equipment so they can be better defenders and attackers.  Many of the strong cards in tactics are also very expensive by themselves (Legolas ally, Boromir ally, Eagles..), so it's nice to have a resource boost to help you pay for these, and that is what Leadership provides.  \n\nSpirit/Lore compliments this very nicely by having generally lower threat heros available, so that if you want you can help make sure that the deck that is good at fighting can engage everything, while Spirit/Lore provides healing, card draw, and other support.  Or you can help out a little bit with the fight using higher threat spirit/lore heros who are also good attackers or defenders, like Elrond, Treebeard, Idraen, Haldir, and Theoden while handling questing at the same time.\n\nBut like I said in the first paragraph,  this isn't a hard and fast rule.   You might be able to have good reasons for doing it differently that get around the same problems I mentioned.   You could use Theoden (S) in a S/T deck, using his cost reduction for allies to help take the place of resources that leadership provides.  You could pair that with a Gondor Ranger deck that is Lo/Ld that has a lot of Ranged and quest power (sword that was broken, visionary leadership, Faramir) and it would probably work very well.\n\nYou could use Legolas, Merry (T), and Haldir for a T/Lo deck that is pretty low threat and focuses on using Ranged, while someone plays S/Ld, and throws a horde of chump allies to defend against tougher enemies (maybe with a few Defenders of Helm's deep, or Erkenbrand to help).  There's a lot of things you can do,  the important thing is that you can solve the challenges the game presents to you.   If you find it easiest and most fun to do it with T/Ld and S/Lo like many of us do, than great.   If something else works for you, then by all means go for it.\n\nEdited October 18, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191533-complementary-spheres/?do=findComment&comment=1859685","commentId":1859685,"userName":"jnicol","timestamp":1445494481,"content":"My go-to sphere combination for solo play is Spirit/Lore with a splash of Leadership. In solo play I think the spheres you choose can be critical, since you inevitably have to make some compromises in terms of what your deck can do well.\n\nIn two player games I don't think it matters too much, since the weaknesses in your deck will be compensated for by your partner's deck. When I play with my son I play Lore/Spirit and he plays Leadership/Tactics, since he likes a) being rich and b) killing stuff.\n\nYou mentioned Bilbo + Denethor. I love these heroes together. They are very good for a a control deck (as described in the Master of Lore article linked earlier in this thread). Bilbo is kind of weak, but his card draw is phenomenally powerful. Plus if you have Fast Hitch (in one of the Mirkwood adventure packs, I can't recall which) then your Hobbit heroes become a lot more potent.\n\nEdited October 23, 2015 by jnicol"}]}