{"url":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/","title":"Quest Advancement Before Quest Resolution","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858769","commentId":1858769,"userName":"cmabr002","timestamp":1445446672,"content":"There is an interesting topic [https://boardgamegeek.com/article/20692381#20692381] on the BGG forums regarding this but I will also post the question here for your reference:\n\n \n\nHis question, in short, is \"If I meet the conditions for quest advancement before the quest resolution step occurs, but after committing characters to the quest, do I advance, continue to the quest resolution step, and then make progress on the newly revealed quest card?\"\n\n> Specifically referring to the 3 objectives in the quest \"Escape from Dol Guldur\".\n> \n> There are three objectives, all of which have a certain action requirement when claiming. The second stage of the quest states that you have to have to control of all the objectives to complete it and the third stage has a \"At the beginning of the quest phase\" event.\n> \n> My question is this:\n> \n> Can I stack the second stage with tokens, say 17 of the 15 needed, but not complete it because I control only one of the objectives. Then on the following turn, begin the quest phase by committing characters, draw cards, but then between the draw cards step and quest resolution step (action window here) claim both of the unguarded objectives, flip the second stage to reveal the final stage, then win the game in the same quest resolution step by resolving the quest difference onto the final stage card.\n> \n> Sorry, that was a mouthful, i hope it is clear enough.\n> \n> Thanks!\n\nEdited October 21, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858815","commentId":1858815,"userName":"GrandSpleen","timestamp":1445447951,"content":"Looks legal to me.  You can put 100 progress tokens on stage 2 if you want, but can't advance until you have all the objectives.  If you use the post-staging action window to claim all objectives, you'll advance immediately.  Then you proceed with quest resolution and can place progress tokens on the newly revealed quest stage.\n\n \n\nIf the new quest card interacts with staging in some way (like, all locations get +1 threat) you will need to factor in that new variable when you do quest resolution.  In this case, Escape from Dol Guldur, there isn't any new interaction and you would just win the game immediately."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858822","commentId":1858822,"userName":"cmabr002","timestamp":1445448087,"content":"I posted this on the other forum and not sure what the ruling is, but it muddies the waters a bit, I think.  I don't know what the correct answer is.  What do you think?\n\n \n\nRulebook (p. 14):\n \n\n> Each player may commit characters to the current quest\n> card.\n\n \n\n> Characters committed to a quest are considered\n> committed to that quest through the end of the quest\n> phase,...\n\nBased on this if the current quest card changes in between the committing of characters and the quest resolution then you cannot place progress on any newly revealed quest cards because technically no characters are committed to that quest (they were committed to the one that no longer is there).  I do not know if that is the intent, or if that is the correct interpretation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858826","commentId":1858826,"userName":"GrandSpleen","timestamp":1445448265,"content":"I repled on the BGG thread as well.  Here's my reply: \n\n \n\nLots of cards force you to change quest mid-staging. Flight from Moria does this, and the treachery in the Lost Realm box (Pressing Needs) or Heedless of Order in Battle of the Five Armies. You still resolve the quest after this kind of effect occurs, it doesn't nix the whole quest phase.\n\nEdited October 21, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858841","commentId":1858841,"userName":"cmabr002","timestamp":1445448697,"content":"> I repled on the BGG thread as well.  Here's my reply: \n> \n>  \n> \n> Lots of cards force you to change quest mid-staging. Flight from Moria does this, and the treachery in the Lost Realm box (Pressing Needs) or Heedless of Order in Battle of the Five Armies. You still resolve the quest after this kind of effect occurs, it doesn't nix the whole quest phase.\n\n \n\nWell that certainly Makes New Devilry and Heedless of Order a lot easier to handle :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] .  I always thought that it reduced our questing to 0 and we usually had to raise our threat by 10+.\n\nEdited October 21, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858850","commentId":1858850,"userName":"GrandSpleen","timestamp":1445449038,"content":"Geez, that would be a game-ender.  No, nobody was screaming about single game-ending threat increases until Water in the Wood from Into Ithilien..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858857","commentId":1858857,"userName":"cmabr002","timestamp":1445449208,"content":"> Geez, that would be a game-ender.  No, nobody was screaming about single game-ending threat increases until Water in the Wood from Into Ithilien...\n\n \n\nI've always said Battle of the Five Armies is nearly impossible with 4 players without cheesing it...because generally revealing 4-5 cards means you are going to hit a Heedless of Order and raise your threats by a lot and not being able to place progress...Now, I think it is entirely beatable with 4, even if it is still hard.\n\nEdited October 21, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191818-quest-advancement-before-quest-resolution/?do=findComment&comment=1858866","commentId":1858866,"userName":"GrandSpleen","timestamp":1445449408,"content":"We did a really fun thematic playthrough and won with 4 players (one decks for Men+Eagles with Beorn, two for Dwarves, one for Silvan Elves).  Heedless or Order is a neat treachery because it forces you onto a quest with a different keyword (Battle, Siege, or none) so you have to choose one strategically.  But no way is it meant to force your threat up by 20!"}]}