{"url":"https://community.fantasyflightgames.com/topic/191956-erestor-and/","title":"Erestor and...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861652","commentId":1861652,"userName":"Lecitadin","timestamp":1445609291,"content":".. The Dunland Trap : as anyone tried Erestor with this quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861785","commentId":1861785,"userName":"NathanH","timestamp":1445613948,"content":"Hmm, for Dunland enemy effects, does Erestor count as drawing 4 cards at once or 1 card and then 3 cards?\n\n \n\nIt says \"additional\", so I guess it means draw 4 at once.\n\nEdited October 23, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861798","commentId":1861798,"userName":"Seastan","timestamp":1445614412,"content":"What is special about the Dunland Trap? It punishes you when you draw cards right? But an Erestor deck draws as often as any other deck. The effects trigger when a player draws \"any number of cards\", and not for each card the player draws. Am I missing something?\n\n \n\nIf you want to find a quest that is painful for Erestor, look no further than the Road to Isengard (Stage 3B: Lose if you have 0 cards. I am not even sure the Harp could save you from this).\n\n \n\nOn the flip side, Erestor would excel at a quest like the Fords of Isen (Deal 1 damage for each card in your hand, etc.)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861832","commentId":1861832,"userName":"NathanH","timestamp":1445615764,"content":"I guess the idea is that the first stage of Dunland Trap likes to discard your hand every other turn, so Erestor decks aren't hurt so much by this.\n\n \n\nThe third stage also gives you a free shuffle-your-discard-into-your-deck, something that Erestor decks might be very happy to see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861883","commentId":1861883,"userName":"Delaric","timestamp":1445617823,"content":"Erestor is interesting with the Dunland quests because several effects punish you for hand size, and it can be an advantage to not hold over any cards from round to round - or at least have the option of ditching your hand without using the Harp if you want to.\n\nI haven't done Dunland Trap but I did play him in a deck against The Fords of Isen and found it helpful. I also threw in Protector of Lorien and Steed of Imladris (which is amazing in this quest), but being able to cycle your hand and ditch the stuff you can't use right away helps you against the jump the encounter deck can get on you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191956-erestor-and/?do=findComment&comment=1861928","commentId":1861928,"userName":"Teamjimby","timestamp":1445619256,"content":"I think I would be more scared by Deadmen's Dike than Dunland Trap.  You lose if your deck runs out, it makes you discard more cards from your deck, and you get punished for having extra copies of cards in your discard pile."}]}