{"url":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/","title":"Steed of Imladris","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861332","commentId":1861332,"userName":"monkeyrama","timestamp":1445589115,"content":"This may have been asked (although I don't think it has), but does anything limit the number of times you can use the response on the Steed of Imladris? The text is:\n\n \n\nResponse: After attached hero commits to a quest, discard a card from your hand to place 2 progress on the active location.\n\n \n\nAs the card is restricted, it is not very good unless you can choose to discard many cards to add lots of progress to the active location (otherwise, I'd probably not bother with it). As far as I know, Responses like this are not limited. Of course, I'm doubtless wrong about this, but I can't think of any reason the response here is limited except by number of cards in hand.\n\n \n\nObviously I'm thinking of Erestor here, as this is a huge boon to questing through some locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861375","commentId":1861375,"userName":"cmabr002","timestamp":1445594223,"content":"I do not think you can.  Otherwise Elrond could heal 1, over and over and fully heal any character who was healed at least one health.\n\n \n\nAlso, I just looked at the FAQ.  You definitely cannot.  See section (1.08):\n\n \n\n>  \n> \n> (1.08) Responses per Trigger\n> If a response or forced response is triggered, the effect can only occur once per trigger.\n\nEdited October 23, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861435","commentId":1861435,"userName":"monkeyrama","timestamp":1445600296,"content":"Darn. And proof I should look at the FAQ before posting. Thanks for clearing that up.\n\n \n\nThis makes the Steed a lot less exciting. I suppose it still fits into the Noldor archetype of discarding very well, so the restriction makes a certain amount of sense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861582","commentId":1861582,"userName":"wehehe","timestamp":1445606189,"content":"It is a great card. Maybe changing a card for 2 progress is not a big deal, but it is also a way to discard a card which can have a great sinergy with other cards:\n\n \n\n· Silver harp: Recovers the discarded card, it makes steed of Imladris almost an Asfaloth.\n\n· Caldara: A new way to put your big allies in the discard pile\n\n· Erestor (hero): A way to do something with a card that otherwise will be discarded\n\n· Stand and fight: Do you want to play with a few allies without sphere correspondence with your heroes ? Don't worry, discard them and put it into play with Stand and Fight.\n\n \n\nI am sure I am forgetting some other interesting sinergies, but those are for me enough to consider steed of imladris a very good card (of course, like others, it has to be used in the right deck)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861598","commentId":1861598,"userName":"Seastan","timestamp":1445607008,"content":"The fact that it says active location is what kills the card for me, although I admit to not giving it an honest try. Location lock is a well known problem in multiple players, and placing progress on the active location doesn't do much. It would be nice to have a card the reliably helps with it apart from Asfaloth and Northern tracker, which get a little stale after a while. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861622","commentId":1861622,"userName":"monkeyrama","timestamp":1445607693,"content":"I think it's the active location part as well that is less exciting. I totally see how it fits into many strategies to get card-discards that do something later, or indeed just ditching excess copies of unique cards, but I wish it was a little more flexible, since it is restricted! But, that said, I should give it a good run and see how it goes. Need to try out the new Noldor tricks anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861626","commentId":1861626,"userName":"cmabr002","timestamp":1445607882,"content":"Yeah, I think the main reason I don't like the card is because you have to place the progress on the active location.  I think it can still be useful, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861656","commentId":1861656,"userName":"Teamjimby","timestamp":1445609386,"content":"There are definitely some quests where it might be worthwhile.  I know there are some active locations that make you reveal extra cards or add other nasty effects, so clearing the active location before staging can be nice.\n\nEdited October 23, 2015 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861685","commentId":1861685,"userName":"cmabr002","timestamp":1445610770,"content":"> There are definitely some quests where it might be worthwhile.  I know there are some active locations that make you reveal extra shadow cards or add other nasty effects, so clearing the active location before staging can be nice.\n\n \n\nInto Ithilien comes to mind."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861783","commentId":1861783,"userName":"NathanH","timestamp":1445613792,"content":"Well, as long as there's an active location and you want to make as much progress on the location/quest as possible, it's sort-of like \"discard a card for +2 willpower this quest phase\" which is not bad. Of course it isn't quite as good as that, but it's not so far off.\n\n \n\nRandom weird use: In solo, combos with Ever Onward to allow you to mostly skip questing for a turn yet still wipe out a (low-progress) active location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1861816","commentId":1861816,"userName":"Teamjimby","timestamp":1445615288,"content":"Here are some examples of where the Steed would be nice:\n\n \n\nThe-Outer-Ridge.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Hills-of-Emyn-Muil/The-Outer-Ridge.png]The-Eaves-of-Mirkwood.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Hunt-for-Gollum/The-Eaves-of-Mirkwood.png]Dry-Watercourse.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Return-to-Mirkwood/Dry-Watercourse.png]Goblin-Gate.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Road-to-Rivendell/Goblin-Gate.png]West-Quarter.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Assault-on-Osgiliath/West-Quarter.png]Methedras.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Voice-of-Isengard/Methedras.png]Haunted-Keep.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Lost-Realm/Haunted-Keep.jpg]Giant-Web.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Hobbit-On-the-Doorstep/Giant-Web.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/191943-steed-of-imladris/?do=findComment&comment=1862374","commentId":1862374,"userName":"awp832","timestamp":1445636526,"content":"I was very excited about this card when it came out, but unfortunately my enthusiasm for it has been greatly diminished.\n\nPros:  While you can do this only once per steed,  you can have multiple steeds.  With enough steeds, you can just nuke a location.  Really it's an upgrade over Eowyn's ability or Protector of Lorien in terms of bang for your buck.  This card can singlehandedly get you out of location lock by allowing you to lose the quest and still clear a location, allowing you to travel.\n\nCons:  Immune to Player Card Effects locations kills this,  not that this happens too often but it's sort of annoying that it seems like oh man the ONE time this would be really super useful this game and -nope!   The dealbreaker for me on this card though is when you have to use it.   You MUST use it proactively, so unlike Eowyn or Protector of Lorien you can't decide if you're going to need it and then trigger the card.  I think that alone relegates it only to Noldor decks who feel \"meh,  a card is worth +2 quest power this turn I guess.  What do I need cards for anyway?\"   It doesn't fit really into other decks.  And out of Spirit,  there's probably other, better ways to get willpower.  What a shame."}]}