{"url":"https://community.fantasyflightgames.com/topic/192126-challenge-5/","title":"Challenge #5","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1864586","commentId":1864586,"userName":"Authraw","timestamp":1445830473,"content":"CURRENT QUEST\n\nThe Redhorn Gate\n\nCHALLENGE\n\nThe printed willpower of your heroes must total 3 or less (per deck)\n\n \n\nRULES\n\nFreestyle: Beat the quest with no hero/deck restrictions. This is if you just want to play the scenario along with us for fun and not have to worry about doing challenges you may or may not be able to accomplish. \nChallenge: Beat the quest (at any difficulty, with any number of players) within the parameters of the challenge. This is if you'd like to push yourself and your deck building capabilities to accomplish harder things.\n \nSince Legolas18 mentioned being too busy to continue the challenges in the last topic [https://community.fantasyflightgames.com/topic/188678-challenge-4/#entry1841186], I thought I would pick up the mantle for at least one more challenge. Forum games are fun, and I'd love to see this tradition continue!\n \nThis one has been knocking around in my brain for a few days now, so I thought I might as well put it out there for others to try as well. I feel like it should be possible, but I haven't actually done any deckbuilding yet.\n \nPost reports, comments, questions, and feedback!\n \nLinks to previous challenges, feel free to try these as well:\n#1 - Conflict at the Carrock, Hobbit Heroes [https://community.fantasyflightgames.com/topic/184355-weekly-deck-challenges/]\n#2 - Into Ithilien, No leadership or tactics [https://community.fantasyflightgames.com/topic/185361-bi-monthly-challenge-2/]\n#3 - The Battle of Lake-Town, Heroes of 8 or less threat [https://community.fantasyflightgames.com/topic/186193-challenge-3/]\n#4 - The Morgul Vale, Two heroes per deck [https://community.fantasyflightgames.com/topic/188678-challenge-4/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1864649","commentId":1864649,"userName":"Seastan","timestamp":1445835427,"content":"Great idea Authraw! Looking forward to this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1865287","commentId":1865287,"userName":"Kjeld","timestamp":1445881231,"content":"Well, not unexpectedly, a mono-leadership Outlands deck of Hirluin + Theodred + Erkenbrand handily destroyed the quest. 35 threat (thanks Dimrill Stair!), 1 damage on Erkenbrand, 6 victory points, and 14 turns (took 4 extra turns to find the 5th victory point -- I think I had 50 progress on Stage 3). Score: 170."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1866010","commentId":1866010,"userName":"Authraw","timestamp":1445914998,"content":"Nice! I was thinking about using Hirluin in my solution as well, we'll see.\n\nHow did you keep Erkenbrand and Theodred alive during the last quest card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1866083","commentId":1866083,"userName":"Kjeld","timestamp":1445921375,"content":"Well, I had Celebrian's Stone and 3x Dunedain Quest to help with that. But in this case, I just didn't quest with Erkenbrand or Theodred while Caradras was in play, and I cleared it in 1 turn with Faramir's help, so didn't have to worry about that too much. I also got lucky in the timing of Dimrill Stair -- it shuffled 4 non-victory-point locations back into the deck, which helped dilute the Snowstorms such that I never saw one. Though honestly, by stage 3 I was so well set up that I could have sacrificed both Erk and Theodred and been just fine -- Arwen's extra resource is a huge boon for Hirluin, and he almost doesn't need the other heroes.\n\nEdited October 27, 2015 by Kjeld"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1871207","commentId":1871207,"userName":"NathanH","timestamp":1446201150,"content":"I decided to be extremely silly. My first deck contained Sam all on his own. My second deck contained Glorfindel all on his own. Thanks to Timely Aid, Sneak Attack, and Very Good Tale, Sam's deck started the game with 7 willpower of allies on the table, as well as Gandalf-bombing a snow Warg. I was lucky enough to draw another VP location on around turn 5, and so won on turn 7 with total threat of 47 and 4 damage on heroes for a score of 121 (edit: I had 5 victory points, so 116).\n\n \n\nArwen is very useful for making this silly idea work.\n\nEdited October 30, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1871776","commentId":1871776,"userName":"Authraw","timestamp":1446221726,"content":"That's fantastic! I had considered various 2-hero decks for this challenge, but never a 1-hero deck! I like the way you think.\n\nWhat does it say about the metagame that 1-hero decks are now a viable way to beat the old quests? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1872306","commentId":1872306,"userName":"Authraw","timestamp":1446235616,"content":"I had a chance to give it a go today--it was a pretty tidy victory. Decided to go for Eleanor / Boromir (Le) / Erkenbrand using Visionary Leadership + Gondor characters to protect my questers. Once ally Faramir hit the table, it was pretty much over. Even though I drew both Snowstorm (-1WP to all questers) and Avalanche (commit all characters to the quest) during Stage 3B, I never once lost a character to having 0 WP. It got a little crazy trying to keep all the bonuses straight though: Denethor gets +1 for Visionary Leadership, +1 for Faramir, -1 for Snowstorm, -2 for damaged heroes, +1 from Sword of Morthond...\n\n \n\nThe Arwen objective ally really does make this quest pretty easy--an extra resource per turn helps to ramp things quickly. I imagine she's less decisive in games with more players.\n\n \n\nLink to my deck, for the curious [http://www.cardgamedb.com/index.php/thelordoftherings/the-lord-of-the-rings-deck-share?p=27170&deck=lotrdeck_5633cd7842043]\n\n \n\nTurns: 9\n\nThreat: 27\n\nDamage on Heroes: 3\n\nVictory Points: 6\n\nScore: 114\n\n \n\nI wish I had the Nightmare version of this quest, I'd give it a try.\n\nEdited October 30, 2015 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192126-challenge-5/?do=findComment&comment=1875675","commentId":1875675,"userName":"Seastan","timestamp":1446499355,"content":"I thought this was a great idea for a challenge, so I took it a little further to see how far we could push it.\n\n \n\nMy heroes are Beorn, Beregond, and Bombur, for a total of 0 willpower  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nVideo [https://www.youtube.com/watch?v=b-crgv0JSZU]"}]}