{"url":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/","title":"Am I doing something wrong: Shadow and Flame on 2nd try","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866169","commentId":1866169,"userName":"PigsAreOurEquals","timestamp":1445930714,"content":"Hi all,\n\nNew to the forum and relatively new to the game here (started playing +- 6months ago).\n\n \n\nThis week I finally opened my Shadow and Flame adventure pack. i was looking forward to it because from all I heard it's a serious challenge. To my expectation my previous deck failed miserably on the first try. So I decided (after all te reading on how difficult the quest is) to build a deck specifically for it.\n\n \n\nI won't post the full list here. but basically it relied on Gandalf+Elrond to bring out the strongest allies from all 4 spheres. Gimli to be loaded with weapons and take some damage to whittle the life of the balrog away.\n\nOther than that I just picked my best allies (mainly negelecting to look at cost), some stuff ( ally galadriel, master of the forge) to dig for my heroes toys and readying effects.\n\n \n\nSurprisingly I beat the quest on the first try with this deck. Even though the deck didn't run as smooth as I hoped, several dead cards since I thought that Elrond could pay for any card of the 4 spheres instead of just the allies (I only noticed this when I started playing) and Wizard's Pipe didn't show up untill late in the game when I had basically already won.\n\n \n\nall in all I was thrilled to have beaten this hard quest but also slightly dissappointed. I was expecting that even with a specific build it would take tweaking the deck and several attempts (maybe having to switch strategy. ..). Instead I managed on the first try with a non-optimized deck.\n\n \n\nSo my question is:\n\nDid I do something wrong?\n\nDid I just get very lucky?\n\n \n\nAny ideas and comments are welcome!\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866486","commentId":1866486,"userName":"sappidus","timestamp":1445953996,"content":"You may well have been lucky... but Shadow and Flame is far more difficult when done progression-style, i.e., with only the cards available at the time of its release AND you don't use the Hama-lock that is the Balrog's Achilles' heel. Also, Gandalf+Elrond/Vilya is one of the strongest archetypes in the game, so it wouldn't be unheard of for you to beat the quest in relatively few tries. See what happens if you play it again a couple of times, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866497","commentId":1866497,"userName":"Lecitadin","timestamp":1445954328,"content":"I think you got lycky, because this quest is a hard one. I play pure solo and Nightmare decks, but no Nightmare deck for me sor this quest, it's difficult enough in normal mode!\n\n \n\nAnd yes, you had a powerful deck, also!  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited October 27, 2015 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866512","commentId":1866512,"userName":"13nrv","timestamp":1445954633,"content":"> you don't use the Hama-lock that is the Balrog's Achilles' heel.\n\n \n\nGaladriel and Nori are also Achilles' heel of this quest ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited October 27, 2015 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866537","commentId":1866537,"userName":"Teamjimby","timestamp":1445955273,"content":"Yeah, it was a very hard quest at the time it came out.  It's still a good challenge not, but would be average compared to the newer quests.  If you want the challenge back, try it with just the Shadows of Mirkwood and Dwarrowdelf cards (i.e. no Gandalf hero)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866627","commentId":1866627,"userName":"danpoage","timestamp":1445957791,"content":"@PigsAreOurEquals: out of idle curiosity, is your username a reference to Animal Farm?\n\nEdited October 27, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866709","commentId":1866709,"userName":"l3afonthewind","timestamp":1445960101,"content":"Let me answer your question by rephrasing it: \n\n \n\n\"I used one of the strongest deck archetypes in the game against a quest that negates that deck's only weakness, am I doing something wrong?\"\n\n \n\nI doubt you did anything wrong. Gandalf and Elrond just rule the world. Especially when their high threat means nothing. The only part I question is what you mean by non-optimized. Are you consciously deciding not to play the deck with Vilya?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866796","commentId":1866796,"userName":"Mndela","timestamp":1445962421,"content":"Oh Vilya, i believe i remember it is a player card, isn't? Or i may have a deja-vu?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866843","commentId":1866843,"userName":"Slothgodfather","timestamp":1445963694,"content":"Hama-lock?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866850","commentId":1866850,"userName":"Seastan","timestamp":1445963791,"content":"> Hama-lock?\n\n \n\nUsing Feint repeatedly to prevent the Balrog from attacking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866876","commentId":1866876,"userName":"Slothgodfather","timestamp":1445964379,"content":"gotcha. yea, that is really useful.  I play with 3 or 4 players regularly, so that's only partly a solution.   \n\n \n\nside note - Leading Flaming, Whip Lash and Counter Spell are some of my favorite art in the entire game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1866882","commentId":1866882,"userName":"PigsAreOurEquals","timestamp":1445964515,"content":"Thank you all for your responses. I'll try a few more times to check for the luck factor. I should also stress that I thoroughly enjoy LOTR LCG both from gameplay as theme (been a Tolkien fan since I was 10).\n\n \n\nIt's true I don't use progression style decks but rather use my order of purchase which is:\n\nCore set\n\nKhazad dum (only deluxe)\n\nBlack riders\n\nThe road darkens\n\nWatcher in the waters\n\nFoundations of stone\n\nShadow and Flame.\n\n \n\nSide Note: Next up is treason of Sruman looking forward to taking on this next book.\n\nPerhaps I'll give it a try with core + khazad dum and 3 khazad dum packs. I guess I would take out Gandalf for Aragorn and use Stargazer to prime for vily, might still work. I forgot to mention the crucial role of Daughter of the nimrodel to keep constant healing of the Balrogs attacks.\n\n \n\n@l3afonthewind: by non-optimized I mean I just threw together a few cards that looked to work together without any playtesting. So I would consider that a first draft of a deck not yet having swapped out what doesn't work.\n\n \n\n@DanPoage: yes this is pointing to Animal Farm. But also to Churchill's famous quote:\n\n\"Dogs look up to us, cats look down on us, pigs treat us like equals.\"\n\n \n\nEdit: I don't have Hama so I didn't use him.\n\nEdited October 27, 2015 by PigsAreOurEquals"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192211-am-i-doing-something-wrong-shadow-and-flame-on-2nd-try/?do=findComment&comment=1869565","commentId":1869565,"userName":"PigsAreOurEquals","timestamp":1446101282,"content":"Last night I tried again using only cards that were available at the time shadow and flame appeared.\n\n \n\nAnd it did get harder. I got wiped out pretty quickly the first 2 attempts. The 3d one was more succesfull and i managed to reach the final stage andd get 15 damage on the balrog befor my last hero went down.\n\nStill I'm optimistic that with refinements to the deck I can make it. Not like Escape from Dol Guldur, where I fail miserably every time and by now I just have this is can't be done so why try feeling.\n\n \n\nThanks for your help the quest now seems to be near the sweet spot of a good quest, challenging but not impossible."}]}