{"url":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/","title":"How would you thematically explain Questing?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868516","commentId":1868516,"userName":"flightmaster101","timestamp":1446050016,"content":"I am interested in building a community around the north Seattle/ south Everett area and this Flight Crew thing came up.  I am thinking of how I would explain certain aspects of this game and how it folds into the theme.  When I practice my spiel to my friends the thing I get stuck on is always questing.\n\n \n\nThe conversation usually goes something like this:\n\n \n\nMe: Ok decide which characters will quest\n\nThem: Umm... I want all of them on the quest thats why I picked them.\n\nMe: No its not like that, you have to choose which characters to exhaust so their will power can offset the enemies increased threat value.  These characters will not be available for combat later in the round.\n\nThem:  how can characters not on the quest fight monsters who are encountered on the quest, and characters going on the quest not be available to fight monsters they encounter on the quest?\n\nSkip ahead 5 min of semantics and vocabulary...\n\nMe: Ok, FFG just does this becasue combat would be to straight forward, so they add a third mechanic that you always have to think about.  SWLCG has the force battle, AGOT has dominance, LOTR has questing, it's just the way it is.\n\n \n\nI would love for someone to give me a thematic way questing fits into the game mechanics so I don't have this conversation with people I demo for, and possibly turn them off of the game.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868530","commentId":1868530,"userName":"Raven1015","timestamp":1446050480,"content":"I think about it like this...\n\n \n\nA character questing means that they are devoting most of their time and attention to accomplishing the main task. This varies from quest to quest and stage to stage. So if you are playing The Steward's Fear, for example, then characters that are questing are devoting their time to investigating the conspiracy afoot. If you are on the second stage of Journey Along the Anduin, characters questing are focusing on navigating and steering the boat. \n\n \n\nI think of characters that are not questing as acting like lookouts and on guard duty. They are part of the quest of course, but instead of participating in the main action, they are keeping watch for enemies. This is why they end up doing the battling. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868546","commentId":1868546,"userName":"Gizlivadi","timestamp":1446051068,"content":"Pretty much what he said. It's a fairly abstract concept, but commiting to the quest means basically whatever that quest stage is about (a good example are the divided quest stages in Breaking of the Fellowship), but in my group we just refer to questing as \"running\". And that's it most of the times, running and exploring locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868590","commentId":1868590,"userName":"John Constantine","timestamp":1446052488,"content":"I have a couner question: why would you? Simply explain the mechanic of how it works and why you shouldn't overcommit.\n\n \n\nOn the topic, to explain thematicly what are you doing questing - just look at the current quest card!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868671","commentId":1868671,"userName":"Bullgator","timestamp":1446055315,"content":"I think of questing sort of like scouting ahead.  If you sent everyone scouting, no one would be prepared if the enemy attacks in strength.  But if everyone stays put in a defensive posture, no progress is made toward the geographic goal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868691","commentId":1868691,"userName":"flightmaster101","timestamp":1446056032,"content":"> I have a couner question: why would you? Simply explain the mechanic of how it works and why you shouldn't overcommit.\n> \n>  \n> \n> On the topic, to explain thematicly what are you doing questing - just look at the current quest card!\n\nI would like to have a thematic explanation in my back pocket becasue people who want to see the game becasue they are interested in the theme (i.e. Neds) like to imagine the situation as the game presents itself.\n\nIf you told a \"nedly\" player you have to spend 1 resource becasue its what the card says that would turn him off.  As opposed to a Jamie or Shagga player who would be like \"ok i need more resource production\".  A new \"nedly\" player would need to be guided in how to interpret the mechanics into the theme, i.e you must spend one resource becasue this treachery card represents a spoiling of food in the hot summer months."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868760","commentId":1868760,"userName":"Lecitadin","timestamp":1446059085,"content":"Just say the every character that quests will eventualy get a kiss from Rossiel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868811","commentId":1868811,"userName":"Bullroarer Took","timestamp":1446060679,"content":"A lot of LOTR players won't know the GoT terms."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868817","commentId":1868817,"userName":"DunedainLoreKeeper","timestamp":1446060911,"content":"Generally it's scouting or path finding. That's why locations need to be 'quested' and why Rohan has high willpower (they travel faster by horse).\n\n \n\nLoctations impede your questing because there is the threat of enemies there who can spot you and warn their allies of your whereabouts. The threat in the staging area symbolizes what extra effort you have to do to not be spotted. Failing to quest succesfully increases your threat, and therefore the chance of enemies finding you. Engagement checks represent enemies finding you, some find you easier than others. If you travel to a location, the quest points you put on the location represent your characters scouting the location for hidden enemies. Characters who aren't questing are staying behind to deal with attacks. Once a location is explored, you know where enemies are and how to avoid them so it no longer impedes on your progress. Enemies in the staging area are 'nearby' but not yet alerted to your presence so you have to move more carefully. Once you reach 50 threat you'll have effectively warned all enemies in the area and whatever objective you are trying to achieve can be twarted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868822","commentId":1868822,"userName":"jnicol","timestamp":1446061035,"content":"If you describe questing as exploring, scouting ahead or standing watch then I think it makes more sense. The questing characters are trying to fulfil the quest goals (e.g. travelling from one place to another), but if the company is under attack then some characters are unable to help advance the quest since they are waylaid by combat.\n\nIn early scenarios this separation of concerns was not implemented in a very thematic way. I remember struggling to understand why a hero who was on a raft down the Anduin, harassed from the banks by orcs, would nip off to explore the Necromancer's Pass!\n\nBut in later scenarios I think questing becomes very thematic. I am playing Khazad-dum at the moment, where questing and combat fit together perfectly.\n\n> I think of questing sort of like scouting ahead.  If you sent everyone scouting, no one would be prepared if the enemy attacks in strength. But if everyone stays put in a defensive posture, no progress is made toward the geographic goal.\n\nI love this explanation. This is such a succinct way of describing how questing and combat fit together thematically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868825","commentId":1868825,"userName":"Kakita Shiro","timestamp":1446061125,"content":"> A lot of LOTR players won't know the GoT terms.\n\nFrankly, I thought it was silly to even put AGoT names to the archetypes. Was \"Thematic Player\" too difficult so \"Nedly\" had to be developed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868830","commentId":1868830,"userName":"Bullroarer Took","timestamp":1446061358,"content":">  \n> \n> > A lot of LOTR players won't know the GoT terms.\n> \n> Frankly, I thought it was silly to even put AGoT names to the archetypes. Was \"Thematic Player\" too difficult so \"Nedly\" had to be developed?\n> \n>  \n\nAgree, but of course it was a response to Spike & Tim etc. from Magic.  The LOTR ones never resonated with the community.  I'm not even sure I could tell you what they are and certainly not what they mean.  I think there was Boromir and Bilbo, but..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868835","commentId":1868835,"userName":"jnicol","timestamp":1446061567,"content":"https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/ [https://www.fantasyflightgames.com/en/news/2011/5/23/bilbo-pippin-and-boromir/]\n\nTo save anyone having to look it up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868859","commentId":1868859,"userName":"flightmaster101","timestamp":1446062076,"content":">  \n> \n> > I have a couner question: why would you? Simply explain the mechanic of how it works and why you shouldn't overcommit.\n> > \n> >  \n> > \n> > On the topic, to explain thematicly what are you doing questing - just look at the current quest card!\n> \n> I would like to have a thematic explanation in my back pocket becasue people who want to see the game becasue they are interested in the theme (i.e. Neds) like to imagine the situation as the game presents itself.\n> \n> If you told a \"nedly\" player you have to spend 1 resource becasue its what the card says that would turn him off.  As opposed to a Jamie or Shagga player who would be like \"ok i need more resource production\".  A new \"nedly\" player would need to be guided in how to interpret the mechanics into the theme, i.e you must spend one resource becasue this treachery card represents a spoiling of food in the hot summer months.\n> \n>  \n\nOk replace Ned with Bilbo if you want to get into semantics, but my point stands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1868919","commentId":1868919,"userName":"GrandSpleen","timestamp":1446063806,"content":"> I am interested in building a community around the north Seattle/ south Everett area \n\n \n\nIncidentally, are you on the Puget Sound LotR LCG Facebook group?  We've got a nice little community, and there are players on there who are in the North Seattle & Everett areas.  Here's the link:  https://www.facebook.com/groups/1508287562747166/ [https://www.facebook.com/groups/1508287562747166/]\n\n \n\nWe do have the Fellowship Event organized at Uptown Espresso in West Seattle for next month!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192310-how-would-you-thematically-explain-questing/?do=findComment&comment=1869113","commentId":1869113,"userName":"DukeWellington","timestamp":1446069909,"content":"The best way to explain questing thematically, in my opinion, is to use the Fellowship example. Frodo has the responsibility of the ring and the rest of the group is there to protect him. As combat threats increase people have to divert their attention from traveling (questing) to neutralize the threat. Mechanically, you commit characters to the quest to demonstrate that they are focused on the main task (as Frod was). Those who are not committed to the quest are focused on supporting or protecting the main questers (as the rest of the fellowship was). Questing is primarily an abstraction of traveling, although, as others have said, some quests are focused on things other than travel (like battle or investigation). I hope that helps.\n\n*edit note: I typed in \"the rest of the fellowship\" and my auto correct replaced rest with \"restablishment\", huh??*\n\nEdited October 29, 2015 by DukeWellington"}]}