{"url":"https://community.fantasyflightgames.com/topic/192477-defeating-an-enemy-in-the-victory-display/","title":"Defeating an Enemy in the Victory Display","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192477-defeating-an-enemy-in-the-victory-display/?do=findComment&comment=1872240","commentId":1872240,"userName":"cmabr002","timestamp":1446233615,"content":"1.  What happens when you defeat an enemy in the victory display that is worth 0 victory points (via Haldir's ability)?\n\n \n\n2.  What happens when you defeat an enemy in the victory display that is worth any amount of victory points (via Haldir's ability)?  If it remains in the victory display can it continue accumulating damage past its maximum hit points?\n\n \n\n3.  Can you even defeat an enemy (if you can attack it) in the victory display due to it being an out of play area.  If you cannot defeat an enemy in the victory display can it be damaged?  If it can be damaged, can it accumulate damage past its maximum hit points?\n\n \n\nSee related topic [https://community.fantasyflightgames.com/topic/125430-do-i-understand-haldir-correctly/].\n\nEdited October 30, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192477-defeating-an-enemy-in-the-victory-display/?do=findComment&comment=1872312","commentId":1872312,"userName":"PocketWraith","timestamp":1446235807,"content":"I'm pretty sure the answer is 3. No. Enemies in the victory display are not in play and thus are not valid targets for any card effects except ones which specifically interact with the victory display. You can't attack them in the first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192477-defeating-an-enemy-in-the-victory-display/?do=findComment&comment=1872490","commentId":1872490,"userName":"cmabr002","timestamp":1446244169,"content":"I think I found the answer to this question - Haldir cannot attack an enemy in the victory display with his ability because:\n\n \n\n> Rule Book p. 25 - Card effects do not interact with cards in an out of play state unless the effect specifically refers to that state.\n\n \n\nBut that doesn't answer why Caradhras can come back into play via the quest card effect in Redhorn Gate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192477-defeating-an-enemy-in-the-victory-display/?do=findComment&comment=1872511","commentId":1872511,"userName":"GrandSpleen","timestamp":1446244930,"content":"Caradhras would be written differently if it were done today.  You just have to chalk it up to the age of the game and experience of the developers.  I don't think the developers planned for it to go out of play.  "}]}