{"url":"https://community.fantasyflightgames.com/topic/192528-organizing-my-collection/","title":"Organizing my collection","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192528-organizing-my-collection/?do=findComment&comment=1873344","commentId":1873344,"userName":"jsalyers","timestamp":1446319452,"content":"Recently got into the game by buying a large second collection and I need some tips on how to get it organized.\n\n \n\nI want to play the quests through from the core onward but I'm having trouble finding lists which detail what cards go into which sets. I've found the various card databases and they are very helpful but I was hoping there was an Excel sheet or Google Doc that might detail which cards were released in which expansions.\n\n \n\nI've got the rules that came with each expansion and they are helpful but I don't understand the symbols exactly. It appears that some expansions use cards from previous expansions...?\n\n \n\nCan you share how you organize your collections? Any tips for beginners are welcome as well! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI've signed up for our local 'questing' day on the 11/14 and I look forward to getting my first play mat!!!\n\n \n\nGood Questing!\n\n \n\nJ--\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192528-organizing-my-collection/?do=findComment&comment=1873630","commentId":1873630,"userName":"JohnGarrison1870","timestamp":1446343851,"content":"I often use the links in the \"Browse Full Sets\" list on the right side of the page on Card Game Database: http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler]\n\n \n\nAlternatively, and assuming the worst case scenario of all your cards being mixed up, I'd go through this process:\n\n \n\nLook at the symbols on the bottom right corner of the cards. (The tiny symbol below the text box; not the encounter symbol at the bottom of the illustration.) This will tell you what cycle the card comes from. For example, the core set cards have a ring symbol, the cards from the Shadows of Mirkwood cycle all have a spider web, the Black Riders saga set has a rider on a horse, the cards from Kazad-Dum/Dwarrodelf cycle have a battle-axe, and so on. Separate the cards by cycle or saga box by these symbols first.\n\n \n\nNext, within each cycle, organize the encounter cards into their groups based on the larger symbols at the bottom right of the illustrations. Each of the adventure packs (6 adventure packs per cycle) will only have one encounter group unique to it, which will be the most prominent symbol shown on the quest cards for that adventure pack quest. If the quest cards show additional encounter group icons, those will be from either the core set of encounters (for the shadows of mirkwood adventure packs), or from the deluxe expansion that started the cycle (Dwarrowdelf and beyond).\n\n \n\nHope that gives you a starting point.\n\nEdited November 1, 2015 by JohnGarrison1870"}]}