{"url":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/","title":"Custom Adventure Cycle - The Great Wyrms","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=1875405","commentId":1875405,"userName":"Kjeld","timestamp":1446489616,"content":"I have created a custom encounter cycle based around the story of Fram Framson slaying Scatha the Worm in the middle of the Third Age (c. TA 2000). The Appendices to Return of the King do not go into great detail about the story, so I have taken some creative license in interpreting these momentous events through the lens of the LotR LCG.\n\nIn short, the cycle begins in the first scenario, Fire Under Tree, with drakes invading the fertile valley of the Anduin between the Misty Mountains and Mirkwood, terrorizing the settlers there and burning all in their path. The heroes must meet this threat and protect the men, women, and children who stand helpless in the face of this fiery onslaught.\n\nAfter the heroes drive off the drakes and save the settlers -- having picked up the troubled hero Fram and his special dragon-slaying sword along the way -- they head north Into the Withered Heath to investigate the source of the drake invasion. Unfortunately, Fram proves headstrong and reckless, rushing off to fight dragons (and collect their amassed treasures) on his own. The heroes must mount a rescue mission in addition to searching for the source of the wyrmsiege.\n\nHaving finally tracked down a near-frozen Fram, the heroes finally have a lead that the dragonslayer discovered for them despite his rashness -- it seems the source of the drakes is a new great wyrm, known as Scatha, who has made his lair in the bitterly remote reaches of the Ered Mithrin. The heroes embark on The Hunt for Scatha, who seems bent on forming his own dominion of terror and tribute by driving the lesser drakes out to burn and pillage the lands to the south. Many hidden dangers lie in wait in these largely unexplored northern reaches, however, and the heroes must search high and low for Scatha's lair in order to drive the great dragon to ground and force a final confrontation. Meanwhile, however, just who is the hunter and who the hunted remains a nagging doubt in the minds of the heroes...\n\nAll of the OCTGN materials (set folder, 3 adventure decks, and image pack) can be found in this Dropbox folder: https://www.dropbox.com/sh/rbijusl3bjfgf8c/AAD7ZTrfFOUYskE8-LokroZya?dl=0 [https://www.dropbox.com/sh/rbijusl3bjfgf8c/AAD7ZTrfFOUYskE8-LokroZya?dl=0]. There are also a folder with just the card images and a folder with the deck lists for the three encounter decks if you are printing and playing.\n\nFor instructions on how to install OCTGN materials, see this page: http://octgngames.com/lotrlcg/developer-guide/ [http://octgngames.com/lotrlcg/developer-guide/].\n\n \n\npic2735961_md.jpg [https://cf.geekdo-images.com/images/pic2735961_md.jpg]    pic3668891_md.png [https://cf.geekdo-images.com/images/pic3668891_md.png]    pic3668886_md.png [https://cf.geekdo-images.com/images/pic3668886_md.png]\n\n \n\nPlayers will also be able to equip Fram with the legendary weapon Nothung, borrowed from an alternative name for Gram, the sword wielded by Sigurd to slay the dragon Fafnir. \n\n \n\npic3668890_md.png [https://cf.geekdo-images.com/images/pic3668890_md.png]     pic3668894_md.png [https://cf.geekdo-images.com/images/pic3668894_md.png]\n\n \n\nThe cycle consists of three adventures: Fire Under Tree, Into the Withered Heath, and The Hunt for Scatha.\n\n \n\npic3668888_md.png [https://cf.geekdo-images.com/images/pic3668888_md.png]     pic3668897_md.png [https://cf.geekdo-images.com/images/pic3668897_md.png]    pic3668908_md.png [https://cf.geekdo-images.com/images/pic3668908_md.png]     pic3668915_md.png [https://cf.geekdo-images.com/images/pic3668915_md.png]\n\n \n\npic3668889_md.png [https://cf.geekdo-images.com/images/pic3668889_md.png]    pic3668892_md.png [https://cf.geekdo-images.com/images/pic3668892_md.png]    pic3668896_md.png [https://cf.geekdo-images.com/images/pic3668896_md.png]    pic3668885_md.png [https://cf.geekdo-images.com/images/pic3668885_md.png]\n\n \n\npic3668893_md.png [https://cf.geekdo-images.com/images/pic3668893_md.png]    pic3668919_md.png [https://cf.geekdo-images.com/images/pic3668919_md.png]    pic3668918_md.png [https://cf.geekdo-images.com/images/pic3668918_md.png]    pic3668917_md.png [https://cf.geekdo-images.com/images/pic3668917_md.png]\n\n \n\nIt is a cold, bitter land the heroes will have to enter to find and defeat Scatha, filled with dragons, wargs and other vicious enemies. The very land itself will fight against them, driving them back and sapping their will away...\n\n \n\npic2735957_md.jpg [https://cf.geekdo-images.com/images/pic2735957_md.jpg]   pic2735964_md.jpg [https://cf.geekdo-images.com/images/pic2735964_md.jpg]    pic3668887_md.png [https://cf.geekdo-images.com/images/pic3668887_md.png]    pic2735948_md.jpg [https://cf.geekdo-images.com/images/pic2735948_md.jpg]\n\n \n\nThis is version 3. If you get a chance to try it out, please let me know your comments, suggestions, complaints, etc. so that I can improve the next version.\n\nEdited July 28, 2017 by Kjeld"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=1875435","commentId":1875435,"userName":"Gizlivadi","timestamp":1446490839,"content":"Great theme! This reminds me a lot of MECCG and it definately feels nostalgic. I love the setting of the Withered Heath and drakes and dragons, and I would love to see this in the game. Still, this is a great effort. Kudos man!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=1875456","commentId":1875456,"userName":"Kjeld","timestamp":1446491622,"content":"> Great theme! This reminds me a lot of MECCG and it definately feels nostalgic. I love the setting of the Withered Heath and drakes and dragons, and I would love to see this in the game. Still, this is a great effort. Kudos man!\n\n \n\nThank you. I leaned heavily on MECCG's The Dragons expansion for inspiration (and the artwork, in a handful of instances)  to flesh out the Fram v. Scatha setting. I very much loved that game, but Dragons was definitely one of the weaker expansions (hazards-wise) and never really quite worked the way I would have liked. It has been a lot of fun to get a chance to recreate that theme in a new game, where hopefully players can engage more deeply with the peril and excitement of dragon country. I'm not sure the designers will ever get around to doing \"historical\" scenarios like Fram and Scatha, so I thought it a good opportunity for a custom job."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=1875731","commentId":1875731,"userName":"alexbobspoons","timestamp":1446501549,"content":"Looks really good and very very well done on quality!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=1875867","commentId":1875867,"userName":"DunedainLoreKeeper","timestamp":1446506627,"content":"His sword is called Nothung? Is he trying to play an Oddyseus on the dragon? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2876995","commentId":2876995,"userName":"Flrbb","timestamp":1499870838,"content":"This might be a necro, but probably you want to have some feedback to your mission design :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI played the first quest and tried the second one. Both single player and with the same deck. In general, I think the quests relay some certain traits on player cards, like Scout and Warrior. Or Weapon attachments. When a player does not have that kind of cards, the game gains more difficulty.\n\nFor the first quest I had a good run, was facing (more or less) no bigger problems, had all the right cards at the right time. You should definitly add some more information to the quest 1A: 1. Wormsbane is Nothung and 2. \"Add Burnt to Ashes to the staging area.\"\n\nThe second quest just killed me; revealing the Ancient Cave Drake with the setup and another Dragon while questing, had to deal with a whoping 7. My willpower was definitly enough and I had nothing left to defend or do anything. I'd say this is a tough start (questing points wise) for a quest that is roughly 2 years old."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2878232","commentId":2878232,"userName":"Kjeld","timestamp":1499910904,"content":"> 11 hours ago, Flrbb said:\n> \n> I played the first quest and tried the second one. Both single player and with the same deck. In general, I think the quests relay some certain traits on player cards, like Scout and Warrior. Or Weapon attachments. When a player does not have that kind of cards, the game gains more difficulty.\n> \n> For the first quest I had a good run, was facing (more or less) no bigger problems, had all the right cards at the right time. You should definitly add some more information to the quest 1A: 1. Wormsbane is Nothung and 2. \"Add Burnt to Ashes to the staging area.\"\n> \n> The second quest just killed me; revealing the Ancient Cave Drake with the setup and another Dragon while questing, had to deal with a whoping 7. My willpower was definitly enough and I had nothing left to defend or do anything. I'd say this is a tough start (questing points wise) for a quest that is roughly 2 years old.\n\nThanks for trying out the quests, and I'll try to get around to updating the text on Quest 1A for Fire Under Tree soon. Apart from those omissions, did the quest play OK and make sense? Was there any part of it that didn't work mechanically, thematically, or in terms of game play?\n\nI know that the second scenario, Into the Withered Heath, is tough, and can vary dramatically in difficulty depending on the initial draw. I did want that one to have some variability, thematically, to represent the wildness and unknown qualities of the wilderness in the north of Middle Earth. There are quite a lot of different drakes and other nasty creatures that you can encounter on that quest, mostly with only one or two in the encounter deck. That said, if it seems so variable as to be not fun -- i.e. too much dumb luck and not enough consistency to be able to plan strategically -- then I welcome suggestions on how to fix it. Did you notice any other problems with that \n\nLet me know if you get a chance to try the third quest, The Hunt for Scatha. In many ways, that's the scenario I'm most unsure of in terms of how the mechanics I envisioned and tried to design work in practice. Especially I am concerned whether the directions are clear enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2878681","commentId":2878681,"userName":"Flrbb","timestamp":1499945916,"content":"2nd quest: did not replay yet.\n\n1st quest: I do have some comments you might want to consider\n\nRemote Farm \"..each other Settlement...\", why the \"other\"? From the gaming mechanics point of view there would not be much difference when it was only \"...each Settlement...\" and it would simplify the rulings a bit. This is just a minor suggestion, but in my opinion gaming rules always tend to be to complicated...\n\nNothung When attached to Fram, the sword can be discarded. Therefore I'd add something like \"When revealed: add to the staginbg area\" and also most probably \"Surge.\". Also, why does its effect (of canceling draggon effects) is only accessible if attached to a hero. (That forces you to have a warrionr hero in game.. which is very restictive)\n\nAncient Cave Drake I think, the wording is mixed up. I am not a native speaker, but \"treat as blank the...\" is in the wrong sequence. \"Treat something as blank\" would be better?\n\nThe White Setup Card The \"during questing\" in the pharagraph from \"SaveX\" is in my oppinion a bit vague. I interpreted as \"anytime, while players are in the pase of questing\". If you want to restict this to before commiting to rest or after questing, then maybe a \"before commiting characters to a quest\" or \"Quest Action:...\" would be more precise. Also, maybe you should add \"Flip this card\" on its front.\n\nDrakes Lair In my opinion this card chains way to much. I (again, playing solo) had that card in play and went from an (almost) empty staging area to 3 dragons, a Fleeing Settler and on top the Wyrm Strench. Luckily I had Test of Will. Otherwise this definitly had killed me - just because some bad coincidence at drawing cards from the encounter deck. The easiest solution would be a \"the first Drake gains surge\". A more interesting option would be: \"Immune to player card effects.\" (so it could not gain progress while in the staging area, therefore you have to travel to this location to get it out of the stagiong area) combined with: \"whenever a Dragon is revealed, add one token to Dragon Lair. It gains +1 Threat for each token on it.\" Then, a Lair would not be much of a problem, for now. But it had some rising threat over time.\n\nLeft Behind this is another card that makes me want to have a Test of Will at hands. Luckily I played with Galadrims Weavers and Tests of Will, had no problems with it. But seriously, at the end of game I had like 10 allies on the table. I never could collect that much resources again to get them back on the table and rising my threat would have killed me - drawing that card two times close after each other....\n\nFoolish Words I am not quite sure what it is with this card. I'd guess it is a card which is inspired by some elements of the books (which I don't know). But gaming mechanics-wise I totaly do not like it. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAnyhow, thanks for making a quest with a good selection of art and such! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Definitly had fun to play it.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2884241","commentId":2884241,"userName":"Yepesnopes","timestamp":1500257099,"content":"I am more than happy to test your scenarios on octgn and give you some feedback.\n\nSadly I am failing to install them on octgn, can you guide me through that process?\n\n \n\nCheers,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2884294","commentId":2884294,"userName":"Kjeld","timestamp":1500260809,"content":"Awesome, thanks!\n\nThis is probably the best guide for installing OCTGN scenarios: http://octgngames.com/lotrlcg/ [http://octgngames.com/lotrlcg/]. The end sections of the Developer's Guide explain how to install the appropriate files (the Set folder, the decks, and the image files). It seems more involved than it is -- mostly you just need to put the right files in the right folders, and then install the image pack with the OCTGN interface.\n\nAlso, if you wait a few days, I'll upload the revised scenarios based on Flrbb's feedback. I've updated the cards, but haven't yet made the new files ready for others to install.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2884507","commentId":2884507,"userName":"Flrbb","timestamp":1500278904,"content":"Hey Kjeld,\n\ndo you mind if you put the modified card images in a zip file for separate download? I am asking this, because I do not use Octagon (as much as I would especially for testing, but I love playing on the table) and it would be easier for me to print the new cards.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2885831","commentId":2885831,"userName":"Yepesnopes","timestamp":1500336923,"content":"Here it is my review of Into the Withered Heath\n\nThe theme and art of the scenario are very nice, truly immersing. Mechanically, the scenario is in general too random.\n\nI have `played it in Solo mode with three very different decks\n\nhttp://ringsdb.com/deck/view/24386 [http://ringsdb.com/deck/view/24386]\n\nhttp://ringsdb.com/deck/view/23204 [http://ringsdb.com/deck/view/23204]\n\nhttp://ringsdb.com/deck/view/46445 [http://ringsdb.com/deck/view/46445]\n\nobtaining similar poor results, about one win out of 6 games. The overall feeling is that your only chance to beat the scenario is by random luck or by designing a very specific deck, like in Into Ithilien in Heirs of Numenor.\n\nSome specific remarks\n\n1)      With treachery cards such as No provisions, and other When revealed effect such as Deep Cleft, cancelling cards are a must in the deck.\n\n2)      All encounter cards but two or three have shadow effects (I find this too much). Shadow cancellation is also necessary.\n\n3)      There are plenty of locations, some of them like Deep Cleft with many quest points. You need some location control such as Norhtern trackers or Asfaloth. Especially for locations such as Taiga (5 quest points) or Deep Cleft (6 quest points). Tiaga in particular is extremely nasty for my taste as you cannot retaliate against your enemies. Combined with the shadow card effects and the amount of threat in the staging area, it is a killer.\n\n4)      Due to the Drake /Dragon enemies your deck must include good defender and attackers.\n\nThe scenario, as it is, is very demanding for a deck and I am afraid it get worse the more players you add to the game due to encounter cards synergies. I think that in its current form is more adequate for a nightmare quest.\n\nHope it helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2886043","commentId":2886043,"userName":"Yepesnopes","timestamp":1500350316,"content":"Also the Acid X keyword is not very elegant. As it is now it affects attachments such as titles, songs and conditions. In my opinion it should only affect Item, Weapon, Armor (and may be mount) attachments.\n\n \n\nCheers,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2886132","commentId":2886132,"userName":"Yepesnopes","timestamp":1500359687,"content":"Here it is my review of Fire under Tree\n\nAs with Into the Withered Heath, theme and art of the scenario is really good. Contrary to Into the Withered Heath, this scenario is much more solid. The mechanics are really good and thematic, immersing the player into the adventure. The scenario is not an easy one, but still beatable and one does not feel unnecessarily punished or at the mercy of the randomness of the encounter deck cards.\n\nI have `played it in Solo mode with three very different decks\n\nhttp://ringsdb.com/deck/view/24386 [http://ringsdb.com/deck/view/24386]\n\nhttp://ringsdb.com/deck/view/57380 [http://ringsdb.com/deck/view/57380]\n\nhttp://ringsdb.com/deck/view/46445 [http://ringsdb.com/deck/view/46445]\n\nhttp://ringsdb.com/deck/view/62066 [http://ringsdb.com/deck/view/62066]\n\nI have obtained about 70% success ratio\n\nSome specific remarks\n\nI agree with the commments of Flrbb\n\nI think Nothung should be Restricted.\n\nI think (like in Into the Withered Heath) that all encounter cards having a shadow effect is unnecessary, but in this quest at least I have found that the effects are not that dramatic.\n\nAll in all a reaaaaally good quest, congratulations! I\n\nHope it helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2887459","commentId":2887459,"userName":"Yepesnopes","timestamp":1500431496,"content":"I have played twice (solo) The Hunt for Scatha.\n\nSome comments follow\n\n-Through the pass card says: “Put Fram Framson and Wormsbane into play, under the control of the first player.”\n\n     Is Wormsbane the sword Nothung? It must be corrected/ clarified.\n\n     Does Nothung (Wormsbane) start attached to Fram Framson or to any eligible character?\n\n   Then it continues with “Add Dragon Pass, Nothung and The Hunting and the hunted to the staging area.”\n\n     Nothung (Wormsbane) was instructed to be under the first player control already.\n\n   Then it follows “Place Fram Framson in play, under control of the first player.”\n\n     This was already instructed.\n\n-Why Nothung ability can only be triggered when attached to a hero and not to Fram Framson?\n\n-What happens with Nothung if the Treachery card “Foolish words” shuffles Fram Framson into the encounter deck, and Nothung was attached to him?\n\n- In the title of the card “The Hunting and the hunted”, hunting must be corrected, it writes with one t only.\n\n   The same card says “When a character takes any amount of damage from an attack, add a resource token to The hunting and the hunted. If the hunting and the hunted has more than 5 resource tokens, immediately remove Scatha Ahunt from play and add Scatha Roused, to the staging area. Remove all resource tokens from this card.”\n\n     What happens if the cards goes above 5 tokens when Scatha Cornered instead of Scatha Ahunt is in play?\n\n     What happens if the card goes above 5 tokens again when Scatha roused is in in play?\n\n- Scatha Cornered is not immune to player card effects, meaning you can kill him with repeated uses of Gandalf, or snipping him with Haldir, without even engage him once. It also means you can put him out of play with Saruman winning the scenario without even damaging him.\n\n \n\nAll in all I liked the scenario a lot! Similar to the first scenario it has a very nice flavor and cool mechanics.\n\nI cannot asses its difficulty yet. I have played it solo with this deck\n\nhttp://ringsdb.com/deck/view/57380 [http://ringsdb.com/deck/view/57380]\n\nmeaning  I had not an issue with the card Scatha Ahunt, as by exhausting one of my heroes, the threat of the card rises to 30, enough as to no engage me. I have to test the quest with a deck with higher threat and get engaged by the card. It seems to me it becomes very hard then.\n\nEDIT: I understand correctly that since Scatha Ahunt is not Immune to player card effects I can blank him with Nothung and ignore his effects, right?\n\nEdited July 19, 2017 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2888220","commentId":2888220,"userName":"Kjeld","timestamp":1500479696,"content":"New version is up! Thanks again for all the feedback, I've tried to address each of the points you've both made with the latest round of revisions. Also, I removed a few shadow effects and changed the setup for Into the Withered Heath, so hopefully it should still be difficult but no longer arbitrary."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2891210","commentId":2891210,"userName":"Flrbb","timestamp":1500620669,"content":"Thanks for the separate folder with the named images. Makes it indeed easier for me. I am sorting right now which cards I have to print again.\n\nLeft Behind I am not sure, maybe I found something which does not fit 100%: The shadow effect tells you to exhaust Fram, but only the first player controls Fram, so another player technically cannot exhaust him. If I remember correctly on official cards this passage would read: \"the players have to exhaust...\". But said again: absolutely unsure about this, also not very important.\n\nSadly, for the next week I won't be able to print and play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2892628","commentId":2892628,"userName":"RichardPlunkett","timestamp":1500692642,"content":"It looks like like blanking Scatha Cornered kills him immediately (his hitpoints of \"X\" becomes zero if his text box is blanked).\n\nIs that intended?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2894109","commentId":2894109,"userName":"Kjeld","timestamp":1500840774,"content":"> On 7/21/2017 at 8:04 PM, RichardPlunkett said:\n> \n> It looks like like blanking Scatha Cornered kills him immediately (his hitpoints of \"X\" becomes zero if his text box is blanked).\n> \n> Is that intended?\n\nNope, that's a design mistake! I think that Scatha Cornered will have to be immune to player card effects (and objective card effects, too), otherwise Saruman could also be used to insta-win, as someone else pointed out. I will likely also update Nothung so that the ability only affects non-unique Dragon enemies.\n\nEdited July 23, 2017 by Kjeld"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192657-custom-adventure-cycle-the-great-wyrms/?do=findComment&comment=2903011","commentId":2903011,"userName":"Kjeld","timestamp":1501257398,"content":"New version is up thanks especially to feedback from Yepesnopes and Flrbb!"}]}