{"url":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/","title":"New player, getting rekt by that Hill Troll","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1874552","commentId":1874552,"userName":"Hockeyzombie","timestamp":1446436402,"content":"So as the title says I'm very new to the game. I have one copy of the core set, the Black Riders, and A Journey to Rhosgobel. My friend and I beat the first quest fairly easily despite having to teach the rules to the other player (and the mistakes he made due to misunderstanding certain rules). \n\n \n\nThen the Hill Troll in the second scenario completely ran us over. We were having a lot of trouble questing successfully (first game we immediately ran into that Orc that gets resources tokens to boost his combat) but even in the second game we just couldn't deal with that troll. I was playing a Tactics deck, the other deck was Lore. We held the troll back for a while with that Lore card that stops an enemy from attacking but between trying to kill the troll through his 3 defence and keeping questing enough to keep our threat from climbing we struggled to deal with the enemies that were coming from the encounter deck. \n\n \n\nMy current thought is that the Lore deck may not have enough teeth for what we're trying to do. As it stood, I had to kill the troll and most other enemies because Legolas and Gimli were the only big hitters we had (I had to use Landroval for questing). \n\n \n\nCan I get some general advice on deckbuilding and trollslaying in particular?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1874567","commentId":1874567,"userName":"Kjeld","timestamp":1446437435,"content":"This forum thread should give you some good ideas: https://community.fantasyflightgames.com/topic/112305-hilltroll/?hl=%2Bhill+%2Btroll [https://community.fantasyflightgames.com/topic/112305-hilltroll/?hl=%2Bhill+%2Btroll]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1874583","commentId":1874583,"userName":"divinityofnumber","timestamp":1446438126,"content":"You're getting a taste of why this game is so awesome! It challenges us to dream, to build new decks, try new things, etc. Try Tactics and Spirit. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1874585","commentId":1874585,"userName":"PsychoRocka","timestamp":1446438339,"content":"> This forum thread should give you some good ideas: https://community.fantasyflightgames.com/topic/112305-hilltroll/?hl=%2Bhill+%2Btroll [https://community.fantasyflightgames.com/topic/112305-hilltroll/?hl=%2Bhill+%2Btroll]\n\nso funny, the first reply on that thread is someone saying something almost identical to you and linking to this: https://talesfromthecards.wordpress.com/2014/01/14/how-to-kill-a-hill-troll/ [https://talesfromthecards.wordpress.com/2014/01/14/how-to-kill-a-hill-troll/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1874599","commentId":1874599,"userName":"flightmaster101","timestamp":1446439487,"content":"Forest snare"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875024","commentId":1875024,"userName":"Hockeyzombie","timestamp":1446475534,"content":"> Forest snare\n\nWe did have that going for us, although we had a hard time with the encounter deck and our threat levels climbed too far. That one was partly just bad luck, there were too many enemies for me to kill without ignoring the troll and by the time we managed to kill it and move on our threat was in the low forties. Our next attempt, it didn't come up so I had to have Gimli with Citadel Plate defend every turn (he had Self Preservation as well). \n\n \n\nTactics seems essential. Legolas is very useful for keeping the pressure off of my ally so they can focus on things like questing and healing. Next attempt I'm going to try using Spirit, it's something I've kind of ignored in the face of how useful Steward of Gondor is. If that doesn't work I'll probably go Tactics/Leadership could work but I'm not sure I'll be able to quest successfully on a consistent basis with those decks. Good thing my teammate doesn't get overly discouraged by failure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875095","commentId":1875095,"userName":"Lecitadin","timestamp":1446478785,"content":"You can Thalin as a tactics hero, to get rid of those nasty crows that surge all the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875108","commentId":1875108,"userName":"jjohnson111","timestamp":1446479361,"content":"Thalin was awesome for that quest when I played it a few weeks ago.  No crows helped a lot.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875120","commentId":1875120,"userName":"Rob_Oz","timestamp":1446479810,"content":"The links others have posted in this thead have some good ideas, but here are a few suggestions:\n\n \n\nGeneral Ideas\n\n \n\nLow Starting Threat - try starting with decks that have starting threat several points less than 30, if possible. Since you have the Black Riders you could build a hobbit deck with a very low starting threat. This gives you a few turns to get ready for the Troll.\n\nEowyn - if you and your friend are having trouble questing, consider building a deck with Spirit and use Eowyn. Eowyn's 4 Willpower is a huge number for questing and can be boosted up to 6, if necessary. Spirit also gives you access to a number of valuable cards such as Test of Will, Hasty Stroke and Unexpected Courage.\n\nHobbit Deck - since you have the Black Riders, you have the basis for a solid Hobbit deck. Playing Merry/Pippin/Sam will give you a decent questing base (Pippin+Sam are 5, Merry chips in 2 more) and some good options for handling the Hill Troll. More on that below.\n\n \n\nDealing with the Hill Troll\n\nSneak Attack + Gandalf - this gives you a number of options. The best and obvious play is to Sneak Gandalf in for 4 damage on the Hill Troll. You can do this either during the quest phase and then quest with Gandalf for 4 extra willpower or during the combat phase for 4 defense or 4 attack depending on whether you have the Troll Forest Snared.\n\nFeint + Hobbits - since you have the Black Riders you can make a hobbit deck with a very low starting threat. Furthermore, the hobbit deck will have a number of uses against the Troll. Pippin will increase the Troll's Engagement Cost from 30 to 33 (assuming you play Merry/Pippin/Sam). This gives you a few more turns to set up for the Troll. Once you do engage the Troll, Pippin's 2nd ability will let you draw a card and Sam will ready and gain stat boosts. These options give you a chance to set up a fairly cheap way to kill the Troll via Feint+Sneak Attack + Gandalf. Engage the Troll, draw a card, ready Sam, Feint the Troll, Sneak Gandalf in for 4 damage and then hopefully finish the Troll with Gandalf, Sam, and Merry (if available). Dagger of Westernesse and Halfling Determination give you additional cheap ways to boost your damage. Halfling Determination also gives you a good Willpower boosting option if you are having trouble questing.\n\n\nI'll slightly disagree with the Forest Snare option. Yes, FS does stop the Troll cold and is generally a good choice. The issue is that the card costs 3 Lore, which is a fairly large amount to generate early in the game (depending on your heroes). That said, I did use Forest Snare on the Troll when I played this quest with just the Core Set.\n\nEdited November 2, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875333","commentId":1875333,"userName":"Slothgodfather","timestamp":1446487028,"content":"just to be clear, are you using 3 players from the 1x core, Journey and Black Riders?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875743","commentId":1875743,"userName":"alexbobspoons","timestamp":1446502072,"content":"Still a difficult scenario if the draw is bad.\n\nI think if I remember right that my best results were tri-sphere on this one solo.\n\nSpirit eowyn for questing and threat reduction.\n\nLore Berevor for forest-snare and card-draw (need your good cards out quick).\n\nTheodred Leadership to try and keep starting threat lower (think I used Gloin sometimes too) and with leadership came lots of chump blockers, celebrians stone, steward of gondor, warden of arnor etc etc.\n\nLots of good info above too.\n\nA damaged Gimli sporting citadel plate and an axe does some serious damage to a troll too!!\n\nDont be discouraged. This scenario is very hard for new players (and Dol Guldur even worse) but other packs are better balanced on difficulty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1875793","commentId":1875793,"userName":"PocketWraith","timestamp":1446503701,"content":"> and with leadership came lots of chump blockers, celebrians stone, steward of gondor, warden of arnor etc etc.\n\nYou mean Son of Arnor (Leadership ally released in the Core Set). Warden of Arnor is a Spirit attachment released in The Three Trials."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1876216","commentId":1876216,"userName":"Hockeyzombie","timestamp":1446528070,"content":"> just to be clear, are you using 3 players from the 1x core, Journey and Black Riders?\n\nTwo players, three heroes each. I was using Legolas, Gimli, and Thalin. The other player had the Lore heroes from the core set. Denethor, the lady that draws 2 cards, and the guy that can spend resources to heal people.\n\n \n\nThanks, RobOz. I'll have to try the Hobbits out and see what they can do for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1876757","commentId":1876757,"userName":"Slothgodfather","timestamp":1446566810,"content":"I haven't tested it, but just looking at the available heroes/cards, you could try Eowyn, Eleanor, Aragorn (leadership) paired with Legolas, Thalin and a Lore Hero.   Each has their merits.  With Glorfindels high threat, I'd say Denethor is a good choice as a backup blocker.\n\n \n\nImportant cards for the first deck: Common Cause for any time you didn't have to use Eleanor, Unexpected Courage (possibly for Thalin so you can quest and attack with him), Steward of Gondor, A Test of Will, Escort frrom Edoras, Sneak Attack + Gandalf, Stand and Fight and Parting Gifts.\n\n \n\nImportant cards for the second deck: Horn of Gondor (on Beravor), Dwarven Axe, Elf Stone + Beorn/Landroval, Daughter of the Nimrodel, Feint, Protector of Lorien (put on Aragorn) and Forest Snare"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1876810","commentId":1876810,"userName":"Rob_Oz","timestamp":1446568970,"content":"NP, Hockeyzombie. The hobbits are one option, but I see other good suggestions in this thread, too!\n\n \n\nRegardless of what heroes you choose, I think the key cards to consider for dealing with the Hill Troll are (as has been mentioned): Sneak + Gandalf, Feint and Forest Snare. Those cards should give you a way to bring down the Troll, control it and then hopefully kill it in 1-2 turns. Feinting and killing it in one turn is the best option, but if not then hopefully you can Feint it, do some damage and then Snare it on the next turn and finish it. Or, if you lack Forest Snare, Feint + damage and then kill it with Gandalf (via Sneak or normally) on the next turn before the combat phase.\n\n \n\nI imagine you probably already know this, but Gandalf's comes-into-play damage is direct damage outside the combat phase, so it ignores the Troll's 3 defense. So you are putting 4 damage on the troll directly, which is important since he has 9 hit points.\n\nEdited November 3, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1877647","commentId":1877647,"userName":"Veybo","timestamp":1446598795,"content":"My memories of playing this quest when it first came out (I'm assuming you are not playing the newer nightmare variant) were all about starting threat selection, and overall threat management.\n\n \n\nYou will find that, if you can manage your threat level you will be able to give yourself more time (turns) to set up your fellowship, and thus be better prepared for the troll.  This applies to both single and multiplayer games.\n\n \n\nI struggled a lot with this quest when the game was first released, until I became aware of the card \"The Galadhrim's Greeting\".\n\n \n\nIt's a great quest to help understand the game better, with regards to possible deck-builds, starting threat selection and strengths in certain sphere's.\n\n \n\nGood luck and let us know how you go.\n\n \n\nCheers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1877732","commentId":1877732,"userName":"jnicol","timestamp":1446603667,"content":"For me, the turning point was when I realised that if I kept my threat low the hill troll wouldn't engage. That buys you time to build up an ally army which is strong enough to bring the troll down.\n\n \n\nChoosing heroes with a low starting threat is key to this strategy, and as Veybo already mentioned, The Galadhrim's Greeting x 2 can buy you additional time.\n\n \n\nAnother more risky tactic is to defend the troll's attack with Gimli, supercharging him for a counter attack. This works well provided the troll isn't dealt a shadow card that boosts its attack, in which case Gimli will be killed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192607-new-player-getting-rekt-by-that-hill-troll/?do=findComment&comment=1877767","commentId":1877767,"userName":"Seastan","timestamp":1446605861,"content":"You are not alone in your frustrations with the Hill Troll. He's a stumbling block for many new players. In fact, you have inspired me to make a video about how to adapt your decks and strategy to overcome him! Spoilers ahead!\n\n \n\n\n\n\n\n \n\nDeck 1: http://goo.gl/t6Yw1e [http://goo.gl/t6Yw1e]\nDeck 2: http://goo.gl/vnhDmq [http://goo.gl/vnhDmq]\n\n \n\n "}]}