{"url":"https://community.fantasyflightgames.com/topic/192609-rulings-on-ungoliants-spawn/","title":"Rulings on Ungoliant&#039;s Spawn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192609-rulings-on-ungoliants-spawn/?do=findComment&comment=1874642","commentId":1874642,"userName":"Flrbb","timestamp":1446444884,"content":"This is some kind of \"at this point I am afraid to ask\" because I am playing LotR LCG since a long time. Now I have re-played the very first mission again - wondering if I got one card/ruling right. :/\n\nUngoliant's Spawn reads:\n\nWhen Revealed: Each character currently committed to a quest gets -1 Wilpower until the end of the phase.\n\nThere are two ways that this card will enter game.\n\na) it is reveald, which happens almost never, if playing solo.\n\nb) you get \"Don't leave the path\" which forces you to: \"When Revealed: Each player must search the encounter deck and discard pile for 1 Spider card of his choice, and add it to the staging area.\", which happens every other game.\n\nIf b) then the when reveald effect of US will not trigger, right? If it will trigger, then substracting one willpower until the end of phase is kinda stupid, because it is quite \"end of phase\". Also, in the nightmare mode it is the same with \"..is discarded..\"?!\n\nSo, please tell me that when reveald effect is triggerd almose none of the times! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192609-rulings-on-ungoliants-spawn/?do=findComment&comment=1874646","commentId":1874646,"userName":"TwiceBorn","timestamp":1446445100,"content":"The \"When Revealed\" effect of US will not trigger during the scenario (b) you listed above.\n\n \n\nCan't comment on the Nightmare version as I don't have it (and don't have time for online research at the moment). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192609-rulings-on-ungoliants-spawn/?do=findComment&comment=1874690","commentId":1874690,"userName":"DukeWellington","timestamp":1446449374,"content":"When a text says \"add to the staging area\" then the \"when revealed\" effect does not trigger. The text must specifically instruct you to \"reveal\" the card. So, no, the US effect would not trigger unless revealed during questing (a)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192609-rulings-on-ungoliants-spawn/?do=findComment&comment=1874714","commentId":1874714,"userName":"Flrbb","timestamp":1446451530,"content":"Thanks a lot!"}]}