{"url":"https://community.fantasyflightgames.com/topic/192753-design-musings/","title":"Design Musings","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877128","commentId":1877128,"userName":"DukeWellington","timestamp":1446579160,"content":"So, I have been experimenting with decks that work with the victory display and it has given me some troubling thoughts on the game in general. I have had some nagging issues for a while, but this deck really cemented my concerns. I want to know what you guys think.\n\nSo, ignoring all the many exceptions, the game generally follows the same pattern. 1. You setup stuff in the staging area etc. 2. You start with nothing but heroes and then play out you cards as quickly as possible. 3. You quest each round and reveal 1 encounter card per player.\n\nSo, at the beginning of the game you have: 1. Setup threats in staging area 2. Only heroes and nothing else 3. One encounter card per player during questing.\n\nLater in the game, assuming you survive and even stabalize, you have: 1. Nothing in staging area because setup threats are gone 2. Lots of allies and attachments because you have been playing them out 3. One encounter card per player during questing.\n\nObviously, the game starts hard and gets easier. It has to because of the basic structure of the mechanics. It would probably be better if the game started easy and got hard, but the game structure is such that the designers must intentionally use the quest itself to make this happen because by default it won't. Now a lot of quests do have ways to make things harder later, but it seems like once a player deck gets setup it just smashes through anything.\n\nConsider the victory display mechanic. When you use \"none return\" or \"leave no trace\" you are basically doing nothing, but it is an investment for later. The payoff is \"the door is closed\" which is, honestly, a borderline broken card. In solo, if you play it successfully your quest phase is a harmless breeze. The encounter deck literally does nothing. If you see it coming with Henamarth Riversong then you can commit everyone to the quest without fear and just smash. I built a deck around this with scroll of isuldur and the weaver to get as many plays of door is closed as possible and after you get setup the quest becomes a joke. Now, it takes a lot to setup so you can lose first, but still, it is very strong.\n\nThe main problem with this is the deck is so weak at the beginning that it can't really survive. When the game is hardest you can't do anything, but once the game is easy, then you dominate.\n\nThe other problem is that there are dozens of decks like that. Is it any more powerful than dwarves? No. I would say most decks are nearly invincible once they get setup. The thing that makes broken decks broken is not their power level but their SPEED. The Seastan Boromir or Love of Tales decks are not really that much more powerful than dwarf or silvan decks or a Gandalf deck. It is just that they get setup in about 1, 2, or 3 turns. Once they are setup, the rest of the game is a generic algorithm, a formality. The specifics of the story or setting is basically irelavent.\n\nFor this reason I am tired of the \"one deck to rule them all\" style of playing. I would rather have a game system and set of quests that let you take a few rounds to get setup in relative ease, then laI'd the smack down (like the troll ambush at the battle of carrock). I would like it if each quest required a unique deck style to defeat it. Instead, I feel forced to build only one style, a deck that absolutely pukes out allies and attachment in the first 1 or 2 rounds. In the end I don't think the victory display/door is closed deck will work because it doesn't do that.\n\nDon't get me wrong, I still totally love this game. I am not being negative. In fact, I am only saying these things because I hope it can spark thought in a direction that improves the game. I would love to hear your responses.\n\nEdited November 3, 2015 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877210","commentId":1877210,"userName":"Bullroarer Took","timestamp":1446582002,"content":"I think you are largely talking about the psychology of gaming and partly about single/multi player.\n\nOnce you have control of the board the only way the game can fight back is with surge - which gets complained about, or wrath effects (one damage to each exhausted character) - which also gets complained about, or finally some extreme effect on a quest card. A lot of players will argue that once they have achieved control of the board they deserve to win. (This is why Valar Morgulis is such a controversial card in thrones.)\n\nI don't play much multiplayer, but many quests are much harder to achieve this board control when the encounter deck is flipping multiple cards because it gives the encounter deck a better chance to combo off on you. Of course there is a lot more to keep track of which is why I generally avoid it.\n\nI hear your concerns and concur with them, but given the framework of the game I'm not sure there is much the designers can do. Which brings me to my misgiving: it really seems to me that the core set was rushed. Had they designers been given more time I think the spheres and tribes would have had their identities better established from the beginning and there would also be better balance between them. I love the game too and don't want to see it go away, but I do wonder how much better it would be if more thought had been given at the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877475","commentId":1877475,"userName":"ossderossmane","timestamp":1446590657,"content":"This is basically a power curve question, i.e. how the power of the encounter deck develops relative to that of the player deck. In a competitive card game you'd distinguish rush decks and controll decks. Rush decks aim to play powerful effects quickly, and to win fast. Controll decks tend to build up to a more powerful late game at the cost of early game power (the controll aspect comes from the requirement to survive until then through controlling the board). In a solo/co-op game, your opponent can not make strategic choices, instead the strategy is essentially given by the average power level of the encounter deck. There is no real build up, but a few things can be done and are done to make the encounter decks power curve more interesting. Some examples:\n\n \n\n- Quest cards: Conflict at the Carrock is the classic example. It starts easy and hits you hard once you go to the second stage, at which point the game tends to end quickly. Either your set up to deal with the trolls, or that's it.\n\n-Encounter cards that depend on the board state. There's (at least) two varieties of these, those that punish you for doing badly, and those that punish you for doing well. The former category are things like engaged enemies making extra attacks, additional negative effects for high threat etc. A good example for the latter category is something like Low on Provisions from the Voice of Isengard, where the shadow effect deals extra damage to undamaged characters, and the when revealed deals damage according to the number of characters in play.\n\n- Variance of the encounter deck, specifically individual devastating cards. These are often treacheries, but could also be particularly tough enemies like the Mumak from Heirs of Numenor. The threat of a card that hurts regardless of how well you set up forces faster play and more risk taking. The Cursed Dead are a neat design of a card that gets tougher later in the scenario - and you're not goint to have enough cancellation for this and the treacheries in the scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877629","commentId":1877629,"userName":"Seastan","timestamp":1446598285,"content":"Great topic Duke.\n \nI agree with the singleplayer/multiplayer point that has been brought up. When you have two decks in play you can have one Boromir-type deck that is heavily front-loaded, and one Rossiel-type deck that is slow to build up power. In fact, I've seen such a deck used to great success, moving the ringwraiths in A Knife in the Dark to the victory display so that they don't all show up in the last stage. But if you try to take this Rossiel deck against the quest solo, you'll be killed by the first nazgul.\n\n \n\n-----------------------------------------------------------------------------------------------------------\n\n \n\nI don't disagree with your observations about the game, but I think there is an underlying assumption that needs to be questioned. Should the game be designed in such a way that every archetype is just as good in solo as it is in multiplayer, and vice versa? Why?\n \nIt's been a common sentiment among the forums for the past few months that Dunedain are great in multiplayer but terrible in solo. Ok, lets say that it's true. Should we feel entitled to be able to turn every trait into a powerful solo deck? Is it because we've gotten used to it with Dwarves, Outlands, Silvan, Ents, etc.? The whole doomed archetype with Grima is very strong in solo, but when you bring it to a multiplayer setting everybody complains. So Dunedain are the opposite. Maybe the designers wanted to expand the game without introducing power creep, so they introduced a trait with the same level of power, but only in multiplayer settings.\n \nNow, I suspect that Dunedain will get stronger in solo as the expansions roll out, but they might never be on the same level as other decks in terms of solo play, and I don't think there is anything wrong with that. Same goes for victory display shenanigans.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877735","commentId":1877735,"userName":"Gizlivadi","timestamp":1446603701,"content":"@Seastan: I recently sent an email to Caleb regarding the Dúnedain issue, mainly asking him whether it was intentional or not to make them so much better in multiplayer (as of yet at least). Still got no answer, but I'll add to the discussion if he replies.\n\n \n\nNow back on the main topic. In all honesty, since I mostly play solo, I am much more partial to the idea of every archetype or mechanic being viable in solo. I get the idea of balancing the power creep by making it more multiplayer oriented, but on the other hand, imagine being an exclusively solo player with no one else to play, with your favorite group in the books being the rangers of the North, and since the Core set you've been dreaming of playing with Aragorn and Halbarad and whatnot, only to find that the deck is subpar in solo. That would be extremely disappointing, not to mention a waste of money. Thus, I tend to believe that a whole Deluxe and cycle's main mechanic, in this case the Dúnedain, should at least be playable solo, if only to at least cover a larger demographic. Doesn't have to be Dwarves or Silvan; the power level of the deck can be modified according to the player's taste as it is the case in a coop game, but IMO we should at least be able to make a Dúnedain deck and make it work decently in solo against a general variety of quests. Of course this is not the case of obvious multiplayer focused cards like Bard, Brand, Song of Earendil, etc, but making the main group of cards in a whole deluxe and cycle only playable in multiplayer is really disappointing for the solo player, as most of the cards will end up in the binder forever. Now as for the other themes in the cycle, I've tried the Rossiel deck and it works fine in solo, and I didn't even go with secrecy. The Noldor I still haven't played, but they're shaping up like a well rounded and generally powerful trait, so I'm excited to play them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1877822","commentId":1877822,"userName":"DukeWellington","timestamp":1446609478,"content":"The Dunedain issue is somewhat off topic, but my problem with the tribe is not that EVERY tribe must be good in multiplayer, but that the Dunedain should specifically be good solo because that fits their flavor.\n\nIn contrast mass Dwarf and Outlands are examples of tribes that, in my opinion, should NOT be good in solo but the design of the tribe specifically forces people to concentrate all the allies into one deck. In the same way that a solo player might be disappointed in Dunedain decks not being playable solo, I was disappointed that when my friends and I wanted to play the Hobbit saga thematically we couldn't really do it because the dwarf tribe needs a single player to have 5 dwarves in play, forcing all the dwarf allies into one deck.\n\nI feel like they originally designed the game (whether intentionally or not) to favor solo. Now they are correcting that, making the game more coop strong (which they should). Therefore the reason that Dunedain is strong in multiplayer is because of timing, not flavor. That is unfortunate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1878284","commentId":1878284,"userName":"Lecitadin","timestamp":1446648975,"content":"Maybe you should try nightmare quests, some of them give a hard time ti the strongest player decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1878286","commentId":1878286,"userName":"Seastan","timestamp":1446649023,"content":"> I feel like they originally designed the game (whether intentionally or not) to favor solo. Now they are correcting that, making the game more coop strong (which they should). Therefore the reason that Dunedain is strong in multiplayer is because of timing, not flavor. That is unfortunate.\n\n \n\nI'm curious to know why you feel that way. Looking at the first cycle, I would've said the opposite.\n\n \n\nPtM: Fixed setup regardless of the number of players.\n\nJatA: 1 extra encounter card/turn favors 2 players.\n\nEfDG: 1 captive out of 6 is better than 1 out of 3.\n\nTHfG: 1 extra encounter card/turn favors 2 players.\n\nCatC: Dealing with a fixed amount of big trolls gets easier with each additional player.\n\nAJtR: Revealing more cards from the encounter deck makes finding athelas easier.\n\nTHoEM: Possibly the one quest that is easier solo due to the nature of location lock.\n\nTDM: Neutral\n\nRtM: Favors multiplayer to such an extent that solo is almost impossible.\n\n \n\nAs for the flavor or theme of the stealthy Dunedain teaming up with others and getting up in the face of as many enemies as possible, I agree with you - it's a little strange. But I think I can sort of understand what they were going for. Here's what Caleb said about the Dunedain theme when the Lost Realm was first anounced:\n\n \n\n>  \n> \n>  \n> \n> The Dúnedain theme in The Lost Realm was inspired by the passage from The Fellowship of the Ring in which Aragorn explains to Boromir how the Rangers of the North have long protected the free peoples of Middle-earth.These Rangers were the greatest hunters of their time, and their constant vigilance drives the majority of the expansion’s player cards.\n\n \n\nI interpret this as an inherent multiplayer focus. If the point is to engage lots of enemies in order to prevent them from attacking someone else, there needs to be a \"someone else\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1878302","commentId":1878302,"userName":"DunedainLoreKeeper","timestamp":1446649694,"content":"Ossderossmane makes a good point about 'rush' decks vs 'control' decks. In general I think LotR tends to lean towards making the encounter deck the 'rush' deck and the player deck the 'control' deck, but this doesn't have to be set in stone.\n\n \n\nReturn to Mirkwood (solo) is brutally hard because of the threat increase, and rushing though the quest is mandatory.\n\nThe Stone of Erech has another elegant design where the encounter deck get's stronger the longer you play.\n\n \n\nOn the player side we see less 'rush' cards. Escort from Edoras and Hero Beorn would be the most 'rush' cards I can imagine. Possibly the designers are shying away from too much of such cards to prevent players from winning before a quest is really established. After all, that's how 'rush' decks tend to work in other games: defeat the opponent before they start doing much. \n\n \n\n \n\nI think it's good you started this discussion. There are many ways the designers CAN make decks less about gaining board control and reward different playstyles. It would be interesting to see how other people feel about that balance.\n\n \n\n \n\n(On a side-note, I had been thinking about writing an analysis about the design choices in this game and one topic: resource collection, ties right into the topic of power balance over time. Maybe I should actually write it soon. More stuff to ponder!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192753-design-musings/?do=findComment&comment=1878336","commentId":1878336,"userName":"DukeWellington","timestamp":1446651361,"content":"@Seastan Just to quickly answer your question, the game was originally designed to favor solo in terms of player card design, not quest design. Consider a card like Ever Onward (which nobody ever played). Essentially the card is completely useless in multiplayer. It would be good solo but is too expensive. Now they have Doom still Hangs, the multiplayer version, coming out. That is just one example to illustrate a larger theme where early design choices made the game more fun and rewarding in solo than multiplayer. Now they are working hard to correct that (which they should)."}]}