{"url":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/","title":"Last stupid question of the night, on Saruman","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877805","commentId":1877805,"userName":"sappidus","timestamp":1446608135,"content":"Saruman:\n\n \n\nAt the end of the round, discard Saruman from play. Response: After Saruman enters play, choose a non-unique enemy or location in the staging area. While Saruman is in play, the chosen enemy or location is considered to be out of play.\n\n \n\nOkay, let's say I Sneak Attack Saruman in during the resource phase, then play him during planning. Or I Born Aloft him back to my hand then play him again. Will the FIRST chosen enemy/location still be considered out of play?\n\n \n\nI think this is the relevant FAQ entry:\n\n \n\n(1.31) Self-referential effects: If a card refers to its own title in its text it should be read as referring only to that copy of the card. A card that refers to other copies of itself will use the language “any copy of...” or “another copy of...” or “a card with the title...” \n\n \n\nNow, *I* know I'm playing the same copy of Saruman, but I'm not sure the game framework knows, so to speak.\n\n \n\nThe problem with answering \"yes\" to the question is that if I hold off on playing that copy of Saruman again until some future round, then, since nothing about Saruman's text uses phrasing like \"until the end of the round\", that enemy/location chosen during a past round will then have to be considered out of play, which seems bonkers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877823","commentId":1877823,"userName":"DukeWellington","timestamp":1446609698,"content":"I don't understand this question. When Saruman leaves play the encounter card is no longer out of play. If he later comes back in play then you can remove the same card or a different one, but what does sneak attack or born aloft do to change anything?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877824","commentId":1877824,"userName":"evilidler","timestamp":1446609760,"content":"When a card is in your hand it's out of play. Any effects requiring it to be in play no longer apply."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877851","commentId":1877851,"userName":"sappidus","timestamp":1446611808,"content":"But in my thought experiment, Saruman IS back in play -- that's why there's all the hoops with Sneak Attack/Born Aloft. Does his effect automatically disappear AND not reinstate when he re-enters play? That is the crux of my question. (DukeWellington, what I'm playing devil's advocate for here is that Saruman could neuter two different encounter cards in the same round.)\n\nIn general, event cards leave play immediately, yet their effects are often still felt afterwards despite that. Specifically, this is because they'll state \"until the end of the phase\" or whatnot.\n\nIs it because Saruman makes no such stipulation that his effect entirely disappears when he leaves play, even if he comes back an instant later? Or is it because he's not \"known\" to be the same copy? Or DOES his effect in fact still take place?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877870","commentId":1877870,"userName":"GrandSpleen","timestamp":1446613768,"content":"It's clear on the card that when Saruman leaves play the effect ends.  Then, when you put him back to play, there is no game mechanic to allow the 'resurrection' of the effect.  It ended, putting him into play can't bring it back.  You can certainly trigger his Response again, but the original response's effect ended permanently when Saruman left play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1877942","commentId":1877942,"userName":"NathanH","timestamp":1446623386,"content":"I see what you are arguing, but for sanity's sake, the answer needs to be \"no\". Otherwise an effect that shuffles Saruman into your deck will create ambiguity later on when a Saruman is drawn later. This must be avoided at all costs, so all other arguments need to bow down to this.\n\nEdited November 4, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192789-last-stupid-question-of-the-night-on-saruman/?do=findComment&comment=1884604","commentId":1884604,"userName":"Ecthelion III","timestamp":1446947175,"content":"> all other arguments need to bow down to this.\n\nOh, boy."}]}