{"url":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/","title":"Totally random question involving Message from Elrond","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877663","commentId":1877663,"userName":"sappidus","timestamp":1446599339,"content":"(I think *any* question involving Message from Elrond is bound to be pretty random...)\n\n \n\nSo, Message from Elrond says:\n\n \n\nAction: Choose a player. That player may choose 1 card from his hand and add it to another player's hand. At the end of the round, if the chosen card is in that player's hand or in play, shuffle it into its owner's deck.\n\n \n\nNow, consider Rallying Cry:\n\n \n\nResponse: After an ally leaves play, add it to its owner's hand instead of placing it in the discard pile.\n\nValour Action: Until the end of the phase, add each ally that leaves play to its owner's hand instead of placing it in the discard pile.\n\n \n\nCan you use Rallying Cry to \"rescue\" an ally you've Message from Elrond'ed to another player back into your hand? Here's the issue as I see it: assuming the ally isn't already in a discard pile, at the end of the round, the Message from Elrond effect will trigger and the ally will leave play on the way to being shuffled back into its owner's deck. It is NOT heading to the discard pile, so neither Rallying Cry's Response nor Valour Action can apply... can it?\n\n \n\nUpon contemplation, I guess a more relevant question would be: can you use Rallying Cry to rescue a Ranger of Cardolan that's been put into play via that ally's Response effect? (\"At the end of the round, if Ranger of Cardolan is still in play, shuffle it into its owner's deck.\") But I like that I've managed to mention Message from Elrond, so I'm going to keep the question framed that way. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nRelated but somewhat separate question: Is the \"end of the round\" outside any phase? (Specifically, the Refresh phase during which Rallying Cry's Valour Action might be relevant here?) I'm pretty sure this sort of thing has come up before, but I can't remember the context. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877740","commentId":1877740,"userName":"Seastan","timestamp":1446604056,"content":"Am I rephrasing your question properly?\n\n \n\nCan the action on Rallying Cry prevent Beorn (Core) from being shuffled into your deck after triggering his action?\n\n \n\nI am not sure. My guess would be yes, as the phrase \"instead of placing it in the discard pile\" is just to make the effect more clear and not an actual qualification to trigger the response. But I've been wrong before.\n\n \n\n> Related but somewhat separate question: Is the \"end of the round\" outside any phase? (Specifically, the Refresh phase during which Rallying Cry's Valour Action might be relevant here?) I'm pretty sure this sort of thing has come up before, but I can't remember the context. \n\n \n\nYes, \"end of the round\" effects trigger after \"end of the refresh phase\" effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877756","commentId":1877756,"userName":"GrandSpleen","timestamp":1446604618,"content":"Yeah I don't know for sure either, but I interpret the \"instead of to the discard pile\" as implying that the card needed to be destined for the discard pile in the first place.  Otherwise it's just some redundant text, isn't it?  The first part of the sentence, \"add it to its owner's hand,\" is really not in need of clarification.\n\n \n\nIf that's accurate, Rallying Cry can't interact with cards that are under the effects of Message from Elrond, or with a Ranger of Cardolan after you trigger its effect, or with Beorn after you trigger his.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877762","commentId":1877762,"userName":"GrandSpleen","timestamp":1446605207,"content":"Here are some other cards that use the words \"instead of\"\n\n \n\nAgainst-the-Shadow.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Druadan-Forest/Against-the-Shadow.png]\n\n \n\nQuestion: if some card effect instructed you to use some other value when defending (attack power, # of resources...), would this card let you use willpower?  I don't think any relevant situations exist in the game, so it's just a thought experiment.\n\n \n\nBanks-of-the-Anduin.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Banks-of-the-Anduin.png]\n\n \n\nQuestion: If you use a card effect to take this location directly out of play but not to the discard pile -- like Short Cut -- will you trigger its Forced effect?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877763","commentId":1877763,"userName":"sappidus","timestamp":1446605360,"content":"> Am I rephrasing your question properly?\n> \n>  \n> \n> Can the action on Rallying Cry prevent Beorn (Core) from being shuffled into your deck after triggering his action?\n> \n>  \n> \n> I am not sure. My guess would be yes, as the phrase \"instead of placing it in the discard pile\" is just to make the effect more clear and not an actual qualification to trigger the response. But I've been wrong before.\n\n \n\nAh, an excellent, probably most real-play-relevant way of posing the question.\n\n \n\nIndeed, we must be careful here: after all, similar \"clarifying text\" was in play in the Stand and Fight/Gandalf ruling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1877939","commentId":1877939,"userName":"NathanH","timestamp":1446622888,"content":"A literal reading of the card would indeed mean that it replaces the go-to-the-discard-pile part of the process with a go-to-the-owner's-hand process, so if the card is not on its way to the discard pile then Rallying Cry has nothing to replace and so doesn't do anything.\n\n \n\nIt might be a mistake, though, and its intended to harvest everything leaving play. Both intentions for the card's use are plausible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1899149","commentId":1899149,"userName":"sappidus","timestamp":1447891848,"content":"I finally submitted this question to The Man(/Men). GrandSpleen and NathanH nailed it... Here's Caleb:\n\n \n\nThe word “instead” implies that the effect is a replacement effect: “instead of doing X do Y”. If you were not going to do X, then you don’t do Y. So, if you were not going to discard Beorn, then you would not return him to your hand instead.\n\n \n\nIt occurs to me that, other than allies already mentioned in this thread, both Curious Brandybuck and any dwarf that's entered play via To me! O my kinsfolk! are affected by this ruling. I think it also means that Banks of the Anduin's Forced effect won't trigger if Short Cut was played on it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1899507","commentId":1899507,"userName":"DukeWellington","timestamp":1447919498,"content":"Here is a way the cards do, in fact, interact. Let's say I use Message to give an Erebor Hammersmith to my friend. Rallying Cry has been played with valour effect. My friend plays Erebor Hammersmith and chump blocks with it. When it dies it returns to my hand instead of going to the discard (because I am the owner). Since it is my hand at the end of the round it is not shuffled back into my deck.\n\nDoes that work?\n\nEdited November 20, 2015 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1899628","commentId":1899628,"userName":"Seastan","timestamp":1447935227,"content":"Do you mean rallying cry? If so the yes I think that's how it works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192778-totally-random-question-involving-message-from-elrond/?do=findComment&comment=1900623","commentId":1900623,"userName":"DukeWellington","timestamp":1447980666,"content":"Oops. Yes I meant Rallying Cry. I edited the post."}]}