{"url":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/","title":"Deck building for Fellowship event","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1878900","commentId":1878900,"userName":"jpowers","timestamp":1446669222,"content":"Does anyone know if there are any deck-building restrictions for the Murder at the Prancing Pony events? I'm interested in going, but I'm way behind on cards - the last packs I bought were the Against the Shadow cycle and the Black Riders Saga box.\n\n \n\nAny information would be appreciated. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1878950","commentId":1878950,"userName":"Delaric","timestamp":1446670996,"content":"There are no special restrictions and in my experience it's not unusual for attendees to have a limited card pool.  You will run into conflicts if another player is using the same hero as you so you can either try to coordinate with your local attendees or just bring several options with you (and all your heroes just in case)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1879090","commentId":1879090,"userName":"Rob_Oz","timestamp":1446674396,"content":"Also not aware of any deck-building restrictions. As Delaric mentioned the main conflict you'll encounter is with people wanting to use the same hero or ally (e.g. 2 Boromir heroes or Bormomir hero vs Boromir ally). Some ideas to manage that issue are:\n\n \n\n1) Build a deck with less popular heroes. Try building a deck that doesn't use popular/top-tier heroes. Might make your deck more challenging to play, but your fellow players will likely enjoy seeing your deck in action (hopefully its a good deck, of course).\n\n2) Ignore the unique rule and just allow players to play with the same heroes/allies. Not a great solution but a reasonable one for saving time at the Fellowship Event. You don't want to dwaddle around tinkering with decks. You want to dive into the new scenario.\n\n3) Bring some sideboard heroes/allies for your deck. Someone else running Aragorn in your group? Have a back-up hero you can swap out. Someone at your table wants to run hero Gandalf while you've got ally Gandalfs in your deck? Have a back-up ally (or card) and just swap out Gandalf for the back-up.\n\n \n\nI attended the Fellowship Event last year and my experience was that everyone involved was really quite friendly about accomodating each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1880393","commentId":1880393,"userName":"jpowers","timestamp":1446745041,"content":"Thanks for the replies! Since I don't know for sure what the scenario needs, building a general-purpose deck with some alternate choices for heroes seems like the way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1881099","commentId":1881099,"userName":"Slothgodfather","timestamp":1446758464,"content":"I'd suggest keeping Keen as Lances handy in case anyone brings Rossiel to the party.  I have a Gandalf/Rossiel/Damrod deck, so people that already use ally Gandalf can basically just switch to Keen as Lances for nearly the same effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1881173","commentId":1881173,"userName":"Gizlivadi","timestamp":1446759743,"content":"Gandalf/Rossiel/Damrod sounds powerful. Well, anything with Gandalf is pretty powerful, but I've never tried him with Rossiel. Seems good though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1881235","commentId":1881235,"userName":"Kjeld","timestamp":1446761126,"content":"I'm thinking of running a Dori-Oin-Nori deck. That should avoid any duplication problems!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1881359","commentId":1881359,"userName":"gandalfDK","timestamp":1446764064,"content":"Going support player here! Thinking of Frodo/Loragorn/Eleanor, or maybe Beregond/Beorn/Eleanor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/192852-deck-building-for-fellowship-event/?do=findComment&comment=1881716","commentId":1881716,"userName":"divinityofnumber","timestamp":1446781733,"content":"Do not be the Gandalf Guy (i.e., the guy playing the Gandalf hero). Do not go to an event looking to merge with another group and trying to play with the Gandalf hero. Just don't."}]}