{"url":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/","title":"2015 Fellowship Event","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1886911","commentId":1886911,"userName":"flightmaster101","timestamp":1447104284,"content":"Has anyone out there played the in the fellowship event yet?  Any advice if you have?\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1893332","commentId":1893332,"userName":"sappidus","timestamp":1447482819,"content":"Just came back from two tries at the quest with 4 players. I admit, I was a bit skeptical about the whole \"whodunnit?\" theme in Middle-Earth, but we uniformly thought the quest was awesome.\n\n \n\nNot that we won, of course. Lost the first attempt to location lock and threating out -- the scenario pumps out a lot of threat increases in a variety of ways, including quest card effects, shadow effects, and, of course, treacheries. The second attempt hit us from the other direction, as we just got swamped with enemies; even with Beregond rocking a Gondorian Shield and Unexpected Courage *and* hero Gandalf riding Shadowfax, it was not nearly enough.\n\n \n\nAnd friggin' Bill Ferny, man. Friggin' Bill Ferny. Not to spoil too much, but let's just say his text includes the phrase \"Cannot be optionally engaged\".\n\n \n\nBut the whole accusation mechanic that the original FFG news article alluded to (required to pass to the final stage) is really well-executed. In The Steward's Fear, the replayability partly arises from the fact that you have no idea what Plot/Villain pair is going to come up. This quest inverts it beautifully: it really does feel like you are desperately trying to gather enough information to better guess which Suspect/Hideout is the right one. The crux of both of our playthroughs was definitely weighing the consequences of making a premature accusation versus being increasingly unable to deal with the encounter board state. So the moment of actual accusation was always very, very tense.\n\n \n\nDespite our failures, I think well-balanced decks will have a good shot at beating this quest. It strikes me as being easier than Fog on the Barrow-downs was, but I'm not sure that's saying much, heh. And there's a nice mechanic to ramp up the difficulty at the end, where explored Hideouts trigger nasty things just from being in the victory display. I think it's a really well-designed quest.\n\n \n\nP.S. The playmat is as awesome as you thought it would be.\n\nEdited November 14, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1893689","commentId":1893689,"userName":"jjohnson111","timestamp":1447524444,"content":"Played it twice last night, with similar experiences to Sappidus above.  I thought it played really well, and was a lot of fun.  The warnings listed are definitely on the spot, however the one thing I would mention from my first game experience was that yes, this is a threat increasing deck, but with the right board state from the encounter deck, you won't be able to effectively mitigate your threat - so don't go all crazy building a threat reduction deck.  \n\nFirst game we were location locked hard and one player was knocked out due to threat, so we scrapped it and reloaded.  Enemies hit hard.  We had a Rossiel questing style deck, an overall dwarf-do-it-all deck (me), Rohan focused who was doing much of the combat/blocking etc. and an elf deck.  Second game our Rossiel deck turned to a full tactics beat-down deck (which worked really well, I never engaged an enemy once the entire game, leaving me to quest REALLY hard every round) and we were lucky to not have the same location lock as we did before.  We knocked out a bit of investigation, and on one of our draws got a lot of into from my looking at the deck.  We ended out with having 2 suspects left, and 3 locations, and we guessed appropriately, and within the next turn we won the game!  \n\nThat second game ended with 2 of us about to tip 40 (starting at 27 for each of us) and the other two about to threat out within the next few rounds.  We were able to play the side quest at the start of the game which lowered our threat by 5, which was helpful, because it was at the right time.  \n\nAnd yes, the playmat is freaking sweet.  Now I want an alt-art Gimli :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nEnjoy your events!\n\nEdited November 14, 2015 by jjohnson111"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1893881","commentId":1893881,"userName":"Sprotte","timestamp":1447541553,"content":"Moin,\n\n \n\nwe were joining the event today in Kiel, northern germany. 11 people, 3 tables. The quest was/is awesome and tricky. On the third try we beat it. The first two plays with 4 players we lost because of the threat. The third play was with 3 players (Celeborn, Galadriel, Haldir + Eowyn, Eomer, Theoden (Spirit) + Prince Imrahil, Theodred, Dain Ironfoot). I don't want to spoiler, but this one location... Northern Tracker for the win. On the first try i had Boromir full equipped with Fire, Blood, Steward,... But it wasn't needed. The enemies are not weak, but not so awful, the other players didn't need him really. Quest power and location control was the way to beat this scenario. \n\n \n\nIt was a very fine day, met some people, played a fine scenario. Life is good. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nPlaymat and alternate Legolas are awesome. \n\n \n\nPS: Sorry for my English...\n\nEdited November 14, 2015 by Sprotte"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1893900","commentId":1893900,"userName":"Bullroarer Took","timestamp":1447543130,"content":"Your English is fine Sprotte.\n\n \n\nSo I am curious folks, does the quest have replayability?  And also, could you see this style of quest being adopted for a Sherlock Holmes LCG?  Or would it just get too stale quickly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1893904","commentId":1893904,"userName":"Sprotte","timestamp":1447543528,"content":"> Your English is fine Sprotte.\n> \n>  \n> \n> So I am curious folks, does the quest have replayability?  And also, could you see this style of quest being adopted for a Sherlock Holmes LCG?  Or would it just get too stale quickly?\n\n \n\nThanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAnd yes, high replayability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894023","commentId":1894023,"userName":"Teamjimby","timestamp":1447555762,"content":"Just got back from the Seattle fellowship event.  The quest is a lot of fun and pretty hard, but I was able to beat it on 2 out of my 3 tries.  I'd say it's similar in difficulty and maybe slightly easier than Fog on the Barrow Downs.  Replayability is really good.  It's a similar kind of thing as Steward's Fear, but you also have the option to accuse a suspect before you've actually solved the crime.  So there are more decisions and I think more replayability than Steward's Fear.\n\n \n\nSome spoilers on the encounter, so skip this paragraph if you don't want to see anything.  There are a lot of locations in the quest, and at one point you need to add one location per player.  So, northern trackers are a must.  But of course there is a location that makes you raise you threat each time you place progress on a location in the staging area.  If you want to use trackers, that means you need Elfhelm or you need to clear those locations.  Every location in the game has a bad travel effect.  Thankfully in one game I got a Thror's Map, which was worth its weight in gold.  I was able to clear those annoying locations, then clear everything else with my trackers. \n\n \n\nIt was really fun.  I think we had about 20 people, and they have another dozen or so tomorrow.  Probably half the people had only played solo or with their spouse, so it was cool to see them all experience multiplayer.  I think a few of them might start playing with us regularly. \n\n \n\nBig shout out to Rob for hosting.  He even made some homemade lembas [https://www.dropbox.com/s/f95j2oxlczbg87d/20151114_173331.jpg?dl=0] to include in our kits!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894042","commentId":1894042,"userName":"bobbywhiskey","timestamp":1447558425,"content":"My group beat it fairly easily in one attempt. By fairly easily, I mean that we stabilized the board without too much trouble and the only real danger we were in was eventually threating out. We were able to do just enough threat reduction using the old warehouse location or w/e, and were questing for about 60 a turn, so we didn't have trouble with the other 10 locations sitting in the staging. The decks we had (Silvan,Dunedain, Dwarves, Hobbits) were more than capable of handling the medium level of combat the scenario threw at us as well. It helped that we were able to engage the 40 engagement enemy(s) with tactics aragorn so that we didn't fall behind early on the quest. Haldir/hands upon the bow never got to shoot in there though due to the manors.\n\n \n\nWe basically got in a situation where we had our playthrough take nearly FIVE hours, and 3 of the decks ran out of cards because we just couldn't find one of the suspects in the investigation deck. In hindsight, it would've been easier to make a false accusation earlier and just fight the extra guy (we had the location figured out), but we hadn't payed too much attention to how severe that penalty was beforehand. Just knew it increased threat some when that was the only real concern.\n\n \n\nBut ultimately it was the wolf-pelt guy at the trading post. How predictable :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] \n\n \n\nDefinently a fun scenario, and could go faster/smoother with familiarity. Very replayable. Not as difficult as the other gencon/barrow downs scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894071","commentId":1894071,"userName":"GrandSpleen","timestamp":1447564117,"content":">  \n> \n> Big shout out to Rob for hosting.  He even made some homemade lembas [https://www.dropbox.com/s/f95j2oxlczbg87d/20151114_173331.jpg?dl=0] to include in our kits!\n\n \n\nNot to mention he painted Prancing Ponies on gift bags and packed all of our kits in them!\n\n \n\nspoilers for the scenario below:\n\n \n\nThe scenario definitely has replayability.  In compares closely to Steward's Fear, not only because you're randomly selecting some cards that will be revealed later in the quest, but also because you really need to explore the active location to get into a good position in the quest.  Decks that do well against the Steward's Fear should also do well here. SF's Plot cards have a greater impact on the game than do the cards in the Prancing Pony quest, as the Plot card gets revealed sooner and has a big impact on the game state."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894217","commentId":1894217,"userName":"Draconusde","timestamp":1447588790,"content":"We took part in the Fellowship Game yesterday at Patriot Games in Sheffield, Uk, and it was increadably good fun.\n\n \n\nWe managed to play through it twice, four handed, and on the first run we got handed a severe defeat, although we did, through some luck modifier from a passing god, manage to get the right culprit and location through blind guesswork.\n\n \n\nAfter some modfying of our decks, we convincingly beat it second time around, and much thanks were given.\n\n \n\nSo what of the scenerio itself.  Well, without ant doubt, the designers had been playing wahy too much Cleudo before coming up with this quest, and there is no complaints for that. Well thought out, with just enough frustration to make you want to push through, it was great fun, woth great replayability.  The 'whodunnit' makes for an interesting change of pace, but the need for location control is paramount, and not helped by some of the location cards themselves putting a break on it.\n\n \n\nIt's a great change of pace, and does need saome thought to succeed, and for my first time at a fellowship event, makes me eager for the next one.\n\n \n\nAnd the bonus of the amazing card mat is just the icing on the cake, with great artwork and oozing with quality.\n\n \n\nThe event is a great chance to meet with new players, and make new friends, and for a Lotr novice like me, a chance to get some help and pointers without feeling intimidated  \n\n \n\nA big shout out to Justin and Jim, who made everyone feel welcome, and show why we should support retailers over online shops to ensure events like this continue to take place in YOUR local community.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894344","commentId":1894344,"userName":"Noccus","timestamp":1447604204,"content":"Played it today with 3 people. Very fun quest.\n\nBest one I've seen in a while actually.\n\nThis whodunnit in a lotr setting worked out fine.\n\nThat said, we did beat the quest on the first try without too much trouble.\n\nIt took us 2 hours, and maybe we just got lucky, I got to shoot Bill Ferny with Haldir in the staging area, and my teammate pretty much neutered the encounter deck early on with Rossiel.\n\nThen Keen as Lances started to fly left and right countering the threat that climbing fast to the low 40s.\n\nReally like the mechanic with the checklist and all. Great quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894759","commentId":1894759,"userName":"Kakita Shiro","timestamp":1447637607,"content":"I played a a 4-player table four times and we got rocked hard. Consistently location locked. I definitely felt like the weak link at the table as I couldn't draw into any/many Allies with WP.\n\nEdited November 16, 2015 by Kakita Shiro"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894914","commentId":1894914,"userName":"DukeWellington","timestamp":1447652978,"content":"Just played it. I thought it was a lot of fun. Beat it on the second try. The MVP was northern tracker, mainly to skip travel so you don't have to pay cost. The only problem is the market square which raises threat when you place progress in staging so you need strider's pat to suck it up right away. Heavy location control quest, which is actually my favorite.\n\nThe suspects are also fun and difficult,especially with hideouts preventing damage. That is a great mechanic (rather than making them immune to player card effects). I had Beregond as a hero with Gondorian shield and I also had 2 honor guards out, so he was basically invincible, pretty satisfying. Without that, it would have been a lot mare difficult to absorb all those attacks while clearing out the hideouts. Again, a lot of fun, probably my favorite of the fellowship quests so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1894916","commentId":1894916,"userName":"DukeWellington","timestamp":1447653141,"content":"Oh, and since I had to go today I missed Teamjimby and GrandSpleen, but I did have the Lembas. Ridiculous effort from Rob to make the event rock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1895579","commentId":1895579,"userName":"Slothgodfather","timestamp":1447695883,"content":" We had 3 different groups of 4 attempting the quest on Saturday.  Only 1 was victorious against this quest!   I didn't think to make a list of what others were running, but the group I was with had these heroes:\n\n\n \n\n\n1: Eomer, Legolas, Mablung - eagles, heavy combat\n\n\n2: Celeborn, Elrond, Glorfindel (sp) - silvan bounce.  quest, heals and cancel.  light combat.\n\n\n3: Aragorn (leadership), Prince Imrahil, Eowyn - heavy quest, medium combat (signals/rangers), cancels\n\n\n4: Gandalf, Damrod and Rossiel - light questing, side quests, traps and enabling Keen as Lances for the group, extra light combat.\n\n\n \n\n\nThis combination proved to be very useful against this quest.  The only thing we were lacking was real threat reduction to help mitigate the first stage and the market locations.  The side quests from deck 4 proved invaluable during the second stage to avoid adding additional cards while we built up our investigation.  This did drag the game out but it gave us a fighting chance.  Legolas with Unexpected Courage keep progressing out the active location so the treacheries that keyed off the \"investigation\" keyword were relatively harmless.   We did have 1 player reach a threat of 48 on three different occasions but managed to squeeze in the location that lets you lower threat to keep everyone in the game.  Our suspect was the Goblin Fingers guy, and so we made use of Eowyn to ditch any high cost things from our hands to avoid threat-ing out from his attacks as well.\n\n\n \n\n\nOver all I loved this quest as it took what I liked about Stewards Fear and made it even better.   Looking forward to playing this one again!\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1895788","commentId":1895788,"userName":"cmabr002","timestamp":1447702839,"content":"The decks we used to beat it were:\n\n \n\nDeck 1: Dain, Thorin, Ori\n\nDeck 2: Elrond, Glorfindel, Bifur\n\nDeck 3: Treebeard, Grima, Legolas\n\n \n\nAll three decks had threat reduction (Sneak Attack Gandalf, Galadhrim's Greetings/Gandalf/Elfhelm, and Secret Vigil).  Due to this, the threat raising of the first stage was not a problem.  Deck 2 had Northern Tracker, Asfaloth, and Thror's Map so we were able to clear all the locations that negate threat reduction.  We did run into some difficulty clearing locations in the staging area due to the Market Square, but we were able to clear those before we threated out.  Deck 1 contributed most of the questing, but what really helped was Treebeard questing on stage 2.  This allowed us to quest successfully, but only place enough progress to clear the active location.  We had plenty of healing with Wellinghall Preserver and Warden of Healing in conjunction with Elrond's ability. \n\n \n\nOnce we stabilized and the threat in the staging area was reduced to basically nothing due to Northern Tracker, we were able to use Thror's Map to bypass the travel effects on the locations and clear the active location with Legolas' ability + Asfaloth before the next staging step avoiding that nasty treachery that triggers off the investigate value of the active location.  Granted, we did still have to deal with the shadow cards that trigger off the investigate value.  In rare cases we were unable to clear the active location with the Legolas/Asfaloth combo because Asfaloth had to be used on a different location or there was no enemy in play for Legolas to kill.  Fortunately, both times this happened the Dwarf deck was able to finish off the active location with Longbeard Elders before the staging step.\n\n \n\nAll in all, I really think that the 3 decks we brought happened to be very effective against this scenario.  The one obvious modification would have been to replace Grima with someone else, as the player controlling him never triggered his ability since it was clear the scenario was attempting to threat us out.  We pretty much had everything we needed to deal with all the threats this scenario dishes out despite having no knowledge of the scenario beforehand. \n\n \n\nSadly, I realized after the game that you only trigger investigate when you clear the active location and not locations in the staging area.  This allowed us to determine the location and enemy more quickly than we should have so I hope to play the scenario sometime soon to make up for our mistake.  I do not think it would have mattered, as we had complete control of the scenario and we were able to kill anything that appeared from the encounter deck and had no problems outquesting it as well.  Still...making rule errors in your favor never feels good.\n\nEdited November 16, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896004","commentId":1896004,"userName":"Kakita Shiro","timestamp":1447709851,"content":"> ...clear the active location with Legolas' ability + Asfaloth before the next staging step avoiding that nasty treachery that triggers off the investigate value of the active location.  Granted, we did still have to deal with the shadow cards that trigger off the investigate value.  In rare cases we were unable to clear the active location with the Legolas/Asfaloth combo because Asfaloth had to be used on a different location or there was no enemy in play for Legolas to kill...\n\nYou realize that Legolas can only put progress on the current quest, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896011","commentId":1896011,"userName":"Bullroarer Took","timestamp":1447710086,"content":">  \n> \n> > ...clear the active location with Legolas' ability + Asfaloth before the next staging step avoiding that nasty treachery that triggers off the investigate value of the active location.  Granted, we did still have to deal with the shadow cards that trigger off the investigate value.  In rare cases we were unable to clear the active location with the Legolas/Asfaloth combo because Asfaloth had to be used on a different location or there was no enemy in play for Legolas to kill...\n> \n> You realize that Legolas can only put progress on the current quest, right?\n> \n>  \n\nAnd Asfaloth can only put progress on a location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896060","commentId":1896060,"userName":"sappidus","timestamp":1447711312,"content":">  \n> \n> > ...clear the active location with Legolas' ability + Asfaloth before the next staging step avoiding that nasty treachery that triggers off the investigate value of the active location.  Granted, we did still have to deal with the shadow cards that trigger off the investigate value.  In rare cases we were unable to clear the active location with the Legolas/Asfaloth combo because Asfaloth had to be used on a different location or there was no enemy in play for Legolas to kill...\n> \n> You realize that Legolas can only put progress on the current quest, right?\n> \n>  \n\n \n\nActually, cmabr002 is correct: Legolas' ability does (in fact, MUST) put progress on the active location before the current quest. In fact, this is the first example in the FAQ, for item 1.00:\n\n \n\nThe rulebook (p. 15) reads: “Any progress tokens that would be placed on a quest card are instead placed on the active location.” Legolas (CORE 5) has an effect that reads, “...place 2 progress tokens on the current quest.” Legolas’ effect would place 2 progress tokens on the quest; the core rule from page 15 instead places those tokens on the active location. Thus, the Legolas ability can successfully resolve, and the core rule can be observed, without creating a golden rule situation. \n\n \n\nIn essence, where player cards are concerned, the active location serves as a buffer for progress that would normally be placed on the quest, unless otherwise specified."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896072","commentId":1896072,"userName":"Kakita Shiro","timestamp":1447712188,"content":">  \n> \n> >  \n> > \n> > > ...clear the active location with Legolas' ability + Asfaloth before the next staging step avoiding that nasty treachery that triggers off the investigate value of the active location.  Granted, we did still have to deal with the shadow cards that trigger off the investigate value.  In rare cases we were unable to clear the active location with the Legolas/Asfaloth combo because Asfaloth had to be used on a different location or there was no enemy in play for Legolas to kill...\n> > \n> > You realize that Legolas can only put progress on the current quest, right?\n> > \n> >  \n> \n>  \n> \n> Actually, cmabr002 is correct: Legolas' ability does (in fact, MUST) put progress on the active location before the current quest. In fact, this is the first example in the FAQ, for item 1.00:\n> \n>  \n> \n> The rulebook (p. 15) reads: “Any progress tokens that would be placed on a quest card are instead placed on the active location.” Legolas (CORE 5) has an effect that reads, “...place 2 progress tokens on the current quest.” Legolas’ effect would place 2 progress tokens on the quest; the core rule from page 15 instead places those tokens on the active location. Thus, the Legolas ability can successfully resolve, and the core rule can be observed, without creating a golden rule situation. \n> \n>  \n> \n> In essence, where player cards are concerned, the active location serves as a buffer for progress that would normally be placed on the quest, unless otherwise specified.\n> \n>  \n\nMind. Blown. Legolas' stock was high, but has now skyrocketed. WHEN WILL THE LEGOLAS BUBBLE STOP?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896128","commentId":1896128,"userName":"Slothgodfather","timestamp":1447714822,"content":"LOL.  Yea. I knew Legolas's progress would go on the quest, but the rules dictate that any progress to the quest mustgo on the active location first.  I do have a quick question though about the Silvan scouts that put progress on the \"active location\".  If there is no active location - does it spill over to the quest?\n\nEdited November 16, 2015 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896136","commentId":1896136,"userName":"otomo","timestamp":1447715544,"content":"> LOL.  Yea. I knew Legolas's progress would go on the quest, but the rules dictate that any progress to the quest mustgo on the active location first.  I do have a quick question though about the Silvan scouts that put progress on the \"active location\".  If there is no active location - does it spill over to the quest?\n\nI've always played that it just whiffs because I think active location becomes more specific where the rules actually dictate that quest tokens go to active location when there is one for tokkens that go on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896140","commentId":1896140,"userName":"cmabr002","timestamp":1447715678,"content":">   I do have a quick question though about the Silvan scouts that put progress on the \"active location\".  If there is no active location - does it spill over to the quest?\n\n \n\nIf there is no active location, no progress will be placed. \n\nEdited November 16, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1896531","commentId":1896531,"userName":"gatharion","timestamp":1447744504,"content":"I played in a three person game at the Fellowship event. I had a Dunedain deck and the others both had dwarf decks. It took us a long time, over three hours, against most decks we would have gotten location lock and threated out, but between Dain Ironfoot for the dwarves and Sword that was Broken for my rangers, all of our characters had at least plus one Willpower and we could just let locations pile up in the staging area with relative impunity. We were more than ready for the Suspect when the time finally came.\n\nThat night I tried it solo and my initial deck (Sam, Spirit Merry, and Beravor with a focus on Hobbit saga Gandalf ally) just got creamed as I kept ending up with too many enemies in my face and sky-rocketing threat.\nI then tried it with a Rossiel, Erestor, Spirit Glorfindel deck and won handily.\n\n \n\nI think it is a fun quest and has some replayability, but ultimately will get a bit tiresome as all of the searching will basically be same each time as the only part that really offers any variety won't appear until you make the accusation. \n\n \n\nOverall, it does have a similar feel to Steward's Fear (explore locations to advance mystery with randomized big bad) and while I think the Prancing Pony will generally be thought of as the better quest, there were elements to Steward's Fear that I felt carried the theme a bit better. The treacheries in SF I thought had more of a unique feel and I liked the mixed in Clue objectives that helped carry a bit of the narrative (we captured a prisoner, from him we'll be able discover what the villainous plot is...).\n\nWhile I thought the Investigate Clue-esq (like the boardgame) worked well-enough, it could also get a bit grinderish as you keep failing to find out the last bit or two of info that you need and I can see people getting kind of sick of dealing with that. I also found it a bit confusing thematically. So what's going on here? We're poking around in various buildings and in so doing we can learn if someone had an alibi and... that some entirely other location, is empty of hiding murderers... Like I just don't really get what's going on there. To borrow a line from Cardboard of the Rings, anybody want to \"thememurder\" this quest for me?\n\n \n\nI don't mean to sound so down on the quest, it is fun and I'm looking forward to playing it with my normal group as it has such a different feel from most other quests. I've got my eye on you, Johnny Goblin-Fingers!\n\nEdited November 17, 2015 by gatharion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1897132","commentId":1897132,"userName":"Slothgodfather","timestamp":1447780768,"content":"Presumably, during your investigation (looking at the investigation deck) you get information about certain people or places that allows you to write them off as suspects. You may have gotten the information from an informant, or from searching other locations that turn up evidence to support that these are not the person/place you are looking for. Finding the same people/locations when you randomly look at the deck is simply finding more information that proves their innocence. \n\n \n\n  There is also the one location that lets you add a suspect or hideout to the staging area.  This lets you confront a suspect who obviously turns violent - likely due to other criminal activities - or to thoroughly search a hideout, which may produce another villain that attempts to take you down.    This quest definitely has some more flexibility with the narrative than other quests do.  It is more fluid, as you can add to the story by what is actually happening in the staging area.  If you get jumped by Bill Ferny at his place then it could be he was working with the actual murderer and is trying to end your investigation. The same can be said for reaching stage 3 under faulty accusations.  If that happens, you get more suspects/hideouts to deal with.  The quest intro even establishes that if this happens, it's because you've stumbled into a larger plot than you realized with more players than just the lone killer.  \n\n \n\nside note - Goblin-Fingers was our murderer!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1897989","commentId":1897989,"userName":"gatharion","timestamp":1447824848,"content":"Like I said, it's not bad, it's just that the investigation aspect, which is really the lynch pin of the whole quest, is really abstracted. A bit more so than would be my preference. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1900963","commentId":1900963,"userName":"caelenvasius","timestamp":1448018716,"content":"My FLGS did our Fellowship events tonight (Nov. 19) since we had events the proper weekend and the 19th was when all the pre-registered players could make it. We had two groups.\n\n \n\nOne group had really well-tuned decks played by experienced players, and easily solved all the problems that MatPP presents (massive threat increases with limited threat reduction, powerful enemies, and location flooding), and it still took them almost three hours. They eventually realized the trick with Village Stable and used it to pull out Suspects (since Hideouts still have a trigger while in the victory display), and murder the Suspect before they became a threat.\n\n \n\nMy group of four, on the other hand...other than myself, every player was relatively new to the game, and did not have a firm grasp of even the basic rules; two of the three had very ill-tuned decks on top of this (the third used one of my well-tuned ones, after I showed him how it worked). While I absolutely love teaching new players—I frequently run demos for all the FFG games that have a presence at my FLGS, such that my store owner would personally vet me for my Flight Crew application—it's a bit annoying to have to do it at an event, since one is expected to at least have a decent grasp of the game if one is attending an event. Anyhow, our game took nearly five hours. We got location flooded super early into the game, such that most of our fighters had to quest instead, and we'd have to pull shenanigans to survive the enemies that did come out. While I figured out the use of Village Stable upon the first one being revealed, we never had enough breathing room to trigger it's Response. The game was tight enough as it was (with the staging area frequently beginning the quest phase with 20+ threat!) without a Suspect or Hideout screwing us over. In hindsight we probably should have sucked it up, but we ended up winning when a lucky Investigation gave us the answer to Whodunit. With no Suspects in play when we finally advanced to 3B, we immediately won.\n\n \n\nThis quest is actually pretty fun in hindsight, and has a pretty decent replay value, since while the quest is \"solved,\" the encounter deck is aggressive enough to add tension for a number of plays to come. I'm looking forward to adding this to our groups rotation of quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1901542","commentId":1901542,"userName":"Slothgodfather","timestamp":1448041472,"content":"@Caelvasius - when you make the accusation and advance to stage 3, shouldn't the set aside suspect and hideout be added to the staging area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1902377","commentId":1902377,"userName":"caelenvasius","timestamp":1448067109,"content":"Yeah, sorry, I forgot a step in my rundown, since I used \"we immediately won\" to stand for \"we didn't have to try hard to win at that point.\". Sorry for any confusion.\n \n\nWe traveled to the newly added Chetwood Campsite on the turn it was revealed. Next turn we quested hard, with the player running my well-tuned deck dropping most of his one-shot quest buffs to make sure we explored it. One of our players had a Legolas/red!Aragorn combo deck, and had a Ruffian in play with him with an Ambush attached. He popped the Ruffian via Ambush during the first action step of the Combat Phase, engaged Wolf-pelt Jake with Aragorn's ability, then played an Unseen Strike followed by a Quick Strike (targeting a -3 defense Jake with a +7 attack Legolas), all before Jake ever had a chance to attack. Granted, the player had some advice from me on how to properly execute the criminal, but the original idea was his. Kinda proud of him for pulling that combo straight out of his heiny. He was having trouble keeping up with the normal enemies (especially the surprise attacks by Greenway Footpads tapping out most of his defenders before the actual combat phase)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1907539","commentId":1907539,"userName":"klaymen_sk","timestamp":1448472310,"content":"We had our event in Slovakia yesterday. Seven players split between three tables. All three groups were victorious after all, the quest was really enjoyable and I'm looking forward to playing it with my group.\n\n \n\nI was running a Elrond/Merry/Pippin Ent deck, my friend ran Loragorn/Spiritfindel/Frodo - and he pretty much saved our bacon with Loragorn's ability + Desperate Alliance and Thrór's Map. Also while we have missed the Suspect, we were sure about the location. Fortunately, we had no problems dealing with two Suspects. The table with three players was running a slight variation of three starter decks (with extra copies added from the second core set) - Tactics, Spirit, Lore. At the last table, a guy was running some kind of Elven deck with Ents and I don't have a clue what was his girlfriend's deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193255-2015-fellowship-event/?do=findComment&comment=1907921","commentId":1907921,"userName":"Slothgodfather","timestamp":1448492216,"content":"Loragorn's limit is tied to his controler....  I've never thought of that..."}]}