{"url":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/","title":"aaaand the Land of Shadow is shipping now","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1886504","commentId":1886504,"userName":"Djenni","timestamp":1447090496,"content":"Yay!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1886508","commentId":1886508,"userName":"John Constantine","timestamp":1447090744,"content":"Wow. They are really taking their precious time with this one.\n\n \n\nI, for some reason, can't shake a feeling that Land of Shadow should have been released long ago by now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1886626","commentId":1886626,"userName":"Ryodu","timestamp":1447095085,"content":"> Wow. They are really taking their precious time with this one.\n> \n>  \n> \n> I, for some reason, can't shake a feeling that Land of Shadow should have been released long ago by now.\n\nIt should have been released, sure, especially since Gen-Con attendees had a chance to purchase a copy. But on the same hand I think it's important to keep a steady schedule of products. Too much at once and the game may feel saturated and overwhelming. Also, I think it's a special treat to let Gen Con Attendees get some products a little earlier than normal. Sucks for the rest of us folk but you have to provide some nice perks for going all the way out to Gen Con."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1886632","commentId":1886632,"userName":"John Constantine","timestamp":1447095445,"content":"...or just happening to live in a proximity of it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nDo you really feel that LotR LCG products coming out too often? Because I feel like breaks between the releases are too wide."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887345","commentId":1887345,"userName":"Bullroarer Took","timestamp":1447122554,"content":"Didn't we get The Road Darkens about a year ago? That would make two saga expansions this year? That's a better year than normal. I'm not complaining."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887593","commentId":1887593,"userName":"banania","timestamp":1447144970,"content":"Christmas swag."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887600","commentId":1887600,"userName":"alexbobspoons","timestamp":1447145735,"content":"I think lotr gets lots of releases personally.\n\nIt gets deluxe plus cycle like other lcgs but also gets sagas and nightmares and gencon and fellowship as extras. Seems like a good regular chunk of content to me :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887641","commentId":1887641,"userName":"John Constantine","timestamp":1447149438,"content":"> regular\n\nYeah... right :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887689","commentId":1887689,"userName":"banania","timestamp":1447153460,"content":"Man, we just had a release a month those past 5 months, just counting the APs, with no delay at all concerning those. I call that pretty regular, and a release a month is cool and Dread Realm & Land of Shadow should hit shelves roughly the same week from what I understand. So why the negativity?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887691","commentId":1887691,"userName":"John Constantine","timestamp":1447153644,"content":"I do not consider pure statement of a fact something negative. It's a common knowledge that LotR LCG has it's expansions being released with less frequency than the other LCGs. And then there are those delays (the recent one was involving some ship problems, if I remember correctly)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887706","commentId":1887706,"userName":"banania","timestamp":1447154571,"content":"Back in january yes.\n\nI think the situation has improved. The fact, as you call it, is that these days, releases are regular.\n\nBut ok, whatever. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887710","commentId":1887710,"userName":"monkeyrama","timestamp":1447154882,"content":"I think this debate came up a while back as well - it seems to come down to a bunch of factors that are specific to each person. So, for me, and I emphasise that I speak only for myself, the release speed of LOTR is just about manageable. I'm finally caught up with all the quests so far (except POD and Nightmare) and have two deck ideas to play with at some point. I can't keep up if it's any faster, much as I would love to. But I can see for some people the release speed is too slow - sometimes people post a deck that they took through the same quest 10 times, and I'm like :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]  and then a bit <_< [//content.invisioncic.com/Mfantflight/emoticons/default_dry.png] because I wanna do that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887712","commentId":1887712,"userName":"John Constantine","timestamp":1447155235,"content":"OK, let's operate the facts. AP release history of the current cycle:\n\n2 July 2015 = The Wastes of Eriador\n\n30 July 2015 = Escape from Mount Gram (28 days passed)\n\n3 September 2015 = Across the Ettenmoors (34 days passed)\n24 September 2015 = The Treachery of Rhudaur (21 day passed)\n6 November 2015 = The Battle of Carn Dûm (43 day passed)\n \nWith such variety of gaps, I wouldn't call those releases regular. Plus, those are just APs. Gaps between other content is far more greater than this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1887769","commentId":1887769,"userName":"banania","timestamp":1447158332,"content":":mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888455","commentId":1888455,"userName":"Buhallin","timestamp":1447182639,"content":">  \n> \n> OK, let's operate the facts. AP release history of the current cycle:\n> \n> 2 July 2015 = The Wastes of Eriador\n> \n> 30 July 2015 = Escape from Mount Gram (28 days passed)\n> \n> 3 September 2015 = Across the Ettenmoors (34 days passed)\n> 24 September 2015 = The Treachery of Rhudaur (21 day passed)\n> 6 November 2015 = The Battle of Carn Dûm (43 day passed)\n>  \n> With such variety of gaps, I wouldn't call those releases regular. Plus, those are just APs. Gaps between other content is far more greater than this.\n> \n>  \n\nA one week variation in release frequency is \"such a variety of gaps\"??  You should try X-wing.  Or SWLCG.  The only disruption I see in the numbers is that Rhudaur actually dropped a week EARLY.  How dare they?!?!\n\n \n\nBut seriously - that's actually pretty **** regular.  The Saga boxes are definitely much more irregular, but they're also above what FFG's normal LCG cycle is for other games so I'm not inclined to complain to much.  Except that my wife's Rohan deck is just DYING for Gamling...\n\n \n\nProduction consistency is certainly not one of FFG's strong suits, but if you find those dates unacceptably erratic I'm honestly not sure that anything would make you happy.\n\n \n\nEdit: And honestly, for all the quiet nature of it LOTR seems to get a lot more additional content than the others LCGs.  Between the Saga sets, Nightmare decks, and event release scenarios, there's a considerable amount of stuff above and beyond the usual Big+6 cycle.  That's probably worth factoring in here too.\n\nEdited November 10, 2015 by Buhallin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888458","commentId":1888458,"userName":"Bullroarer Took","timestamp":1447182807,"content":"I will readily concede that scheduling could be improved, but that is one of the prices we are paying for this LCG model where they are trying to keep the prices down and ship by sea.\n\n \n\nOn the other hand, let's look at what we normally get in a single year:\n\n \n\n1 deluxe expansion\n\n6 adventure packs\n\n1 (or two) POD adventures\n\n6 (or more) Nightmare packs\n\n1 Saga expansion  (but this year we got two)\n\n \n\nThat's really not too bad I think given the size of the team involved and all the development and art required."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888552","commentId":1888552,"userName":"alexbobspoons","timestamp":1447186116,"content":"From my standpoint, it was reading threads on Star Wars and also Conquest where some big production gaps turned people away from the game. The variety of content for LotR seems to avoid that better than those. Now I do not have dates to claim any of this as fact, I am merely going off the amount of people in games that have had an issue with production delays and lack of content. LotR doesnt SEEM to be as affected as those other games due to its quantity of stuff. Thats all Im saying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888826","commentId":1888826,"userName":"gandalfDK","timestamp":1447196299,"content":"Well, if we would have had this conversation a while back, people would say really different things..\n\nThere have been a lot of delays going on in the life of this game. Many products that should have been released were postponed etc. and many people were complaining about it. From The Antlered Crown to The Lost Realm took ages if you read the comments. This cycle has been a flood, that's true, but that seems to be the very nature of the beast. While we are in a cycle, packs release on the estimated times mostly, but it has been the wait between products that's been the longest in this game. Also, Saga expansions get delayed every time.\n\nI don't really agree that there is 'that' much extra for LotR LCG. Granted, we get nightmare and saga, but the events are twice a year, and are also only encounter. If you look at the amount of stuff we can't play 'with' LotR wins big time. Lcgs like Game of Thrones or Star Wars only get stuff a player could use. For example Treason of Saruman contained 165 cards. 33 of them are player cards (not counting boons or fellowship cards, because they cannot be used outside saga box). That's 20% of the box that players can control/use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888849","commentId":1888849,"userName":"Gizlivadi","timestamp":1447197688,"content":"Not only that, but the other LCG's get lots of more side-products and accesories like playmats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1888877","commentId":1888877,"userName":"Buhallin","timestamp":1447199917,"content":"> There have been a lot of delays going on in the life of this game. Many products that should have been released were postponed etc. and many people were complaining about it. From The Antlered Crown to The Lost Realm took ages if you read the comments. This cycle has been a flood, that's true, but that seems to be the very nature of the beast. While we are in a cycle, packs release on the estimated times mostly, but it has been the wait between products that's been the longest in this game. Also, Saga expansions get delayed every time.\n\nI'm curious if anyone has a simple listing of release dates?  At least skimming news articles it seems like the pattern for the last 2 years has been pretty consistent, with a big box in February and then months packs for the bottom half of the year.  I'm not convinced this isn't mostly perception bias - you mention Antlered Crown, but looking at the news articles it released 40 days or so after Celebrimbor's Secret - hardly a crushing deviation from a one-per-month cycle.  And the release before that, Nin-In-Eliph, was on 23 October compared to CS's 13 November.  So really it looks like Celebrimbor's Secret released early.\n\n \n\nIf we're going to go on about how awful their delays are, I'm starting to feel like we should look at actual dates rather than comments, because the codified perception around her is feeling pretty inaccurate.\n\n \n\n> Lcgs like Game of Thrones or Star Wars only get stuff a player could use. For example Treason of Saruman contained 165 cards. 33 of them are player cards (not counting boons or fellowship cards, because they cannot be used outside saga box). That's 20% of the box that players can control/use.\n\nI'm not sure this is a fair comparison.  For one, players most certainly use the encounter cards - it would be very hard to play the game without them.  Those cards also require at least as much development and playtest effort as the player cards do - probably more, honestly.  That LOTR ends up with a smaller player card pool is a fair comment (and one I've made myself) but that really has nothing to do with the pace of release from a production standpoint.  Maybe it FEELS like it's much slower because you aren't getting as many cards for your favorite deck, but that doesn't hold up to the production realities.  Whether a card goes in your deck or the encounter deck, it takes the same amount of effort to produce, from design to print to ship.\n\n \n\n> Not only that, but the other LCG's get lots of more side-products and accesories like playmats.\n\nThis is a fair point, but you're really talking about prize kits, right?  This is simply because LOTR isn't a competitive game, wasn't designed to be one, and doesn't support it all that well.  Scoring is hard, and very easy to manipulate.  If you can't rank people, it makes prizes much harder because you need to support prizes for all the players, as the coming Fellowship event is doing, rather than just a top 1-4 with a single card for everyone else.  Again, I think you can see this in the Fellowship event kit.  The store I'm going to charges $5 for GOT or X-wing events, but $15 for the Fellowship event.  Why?  Because everyone's getting a copy of the deck and play mat, because you really can't rank attendees.\n\n \n\nYes, some other games get more accessories, and you can probably feel neglected for that.  But it's not like that's unique to LOTR.  Most of the games get art card sleeves, although the LOTR ones seem to be discontinued.  Play mats are rare - other than the Disney-driven Ep7 ones, Netrunner is the only one that gets mats (and really, it is pretty much their largest LCG, hands-down, so you kinda have to cut them some slack).  Game of Thrones, for all its age, has nothing but the nifty clay trackers they released way way back when.\n\n \n\nSo yeah, we may be a little light on accessories and goodies, but I don't think it's anything that's uniquely neglectful compared to their other games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889242","commentId":1889242,"userName":"gandalfDK","timestamp":1447225745,"content":"Your comment on the encounter cards is why I used ' ' for the word with. Of course you need to use the encounter cards, but they aren't transferable to different quests and players don't control them really.\n\nI mention this because there is a shorter duration of satisfaction after a pack hits in the LotR LCG than when a pack hits in eg Game of Thrones, because a pack here just delivers much less variation then in other games. Less player cards mean that we have less combos to search for and eventually the new has run of every card because all have been tested. This is not something about factual release but the feeling towards delays etc.\n\nAlso, I didn't mention The Antlered Crowm because it released late, but TLR was late.\n\nEdited November 11, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889248","commentId":1889248,"userName":"gandalfDK","timestamp":1447226655,"content":"3 april 2015 TLR released.\n\n23 december 2014 TAC released.\n\n101 days.\n\n21 februari 2014 VOI released.\n\n15 november 2013 The Morgul Vale released.\n\n98 days.\n\nI was arguing that the releases between cycles often take a while. See the dates, I would say that those took a while. Releases of AP's once the DE hits the market usually runs quite smoothly and complaints about those release times are probably monthly bias.\n\nI don't have a problem with delays at all, as it means more time to catch up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889269","commentId":1889269,"userName":"Buhallin","timestamp":1447228821,"content":"> This is not something about factual release but the feeling towards delays etc.\n> \n>  \n\nWhich I acknowledged, and basically have no tolerance for.  If you can't be rational enough to appreciate the entire development process, then I grant no weight to your whining.  Note that this is a generic \"you\" and not \"you you\".\n\n \n\n> I was arguing that the releases between cycles often take a while. See the dates, I would say that those took a while. Releases of AP's once the DE hits the market usually runs quite smoothly and complaints about those release times are probably monthly bias.\n> \n> I don't have a problem with delays at all, as it means more time to catch up.\n\nThe original point which I was replying to was complaining about the highly erratic nature of the releases, which actual dates show it isn't.  You're right that there are bigger gaps between cycles, but that's pretty much the standard for all of FFG's LCGs, and LOTR doesn't hold the record for that by a long shot.\n\n \n\nThey're really stuck in a no-win situation on that one.  If they're targeting one cycle per year, the only options are tight releases with big gaps between cycles, or a spread release of each product.  Pretty sure people would hate that one, too.\n\n \n\nPeople can think it's slow or not, but it's certainly not all that erratic by any objective standard, which again was the original complaint."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889333","commentId":1889333,"userName":"gandalfDK","timestamp":1447236202,"content":"Well, I see this spiraling down to a yes/no game, but you are right for most part. For me, as someone who only really plays this game, the releases between cycles do feel too long and they are. Granted, there are other substitutional products released between them, but the saga expansions end soon.\n\nFact is that time is relative and you can look at release dates as facts and compare those with other LCGs and say that LotR is certainly not an LCG that gets released the slowest, but if you deem 40 days long, your interpretation of the facts are different then if you think 80 days are long. My point is, the discussion was about feelings before it started. You can not decide for someone that a release is fast or not. His standard for releases may be really different and therefore he may find 20 slow and 80 days absurd."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889652","commentId":1889652,"userName":"entMoot","timestamp":1447258802,"content":"Most of the year it is hard for me to play the game regularly due to my schedule, so I don't mind when a delay happens. As has been discussed above, FFG is working to produce a fairly large amount of content with what seems to be a pretty small but talented team.\n\n \n\nPart of the issue may be that the LCG model makes the statement that there are monthly packs alongside the larger releases (unless they have amended this since I last looked). Regardless of whether this level of production is feasible for FFG's development team, it suggests that there would be ~2 full cycles released each year rather than the one we have been seeing for LotR.\n\n \n\nWhen it is roughly 3 months between the end of a cycle and the release of the next box, with another handful of months before the monthly releases begin, I think it is understandable for there to be grumbling from the consumer base. Longtime fans of the game who end up here or at other forums understand that there are not monthly, but more frequent packs released along with the larger boxes, but the average time between products is closer to 1.5 to 2 months when the whole year is considered.\n\n \n\nWe can only speculate as to why The Land of Shadow was delayed, but I'd be curious to know if getting the smaller print run done for GenCon somehow pushed the larger print run down the printing queue for them overseas? I believe The Road Darkens was highly anticipated to be at GenCon and then was not available there last year. Perhaps the folks at FFG wanted to make up for this, but it came at an unforeseen cost in terms of the official release date?\n\n \n\n...all that aside, I am looking forward to being able to build Faramir decks, get the last Rohan cards for my spirit Theoden deck, and add to my grove of Ent allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1889889","commentId":1889889,"userName":"Buhallin","timestamp":1447269916,"content":"> You can not decide for someone that a release is fast or not. His standard for releases may be really different and therefore he may find 20 slow and 80 days absurd.\n\nYou're correct - I can't decide whether someone thinks something is fast or not.\n\n \n\nI CAN decide that their standards are unrealistic, and judge my level of concern for their viewpoint appropriately.  We can point it out when feelings aren't grounded in reality, and hope people will change their view based on actual data.   I can also point out when facts objectively don't support the claims being made, such as the original complaint about release variance that started this.\n\n \n\nIgnoring that leads to stupidity like the Red Cup Scandal, as people's feelings run rampant without any basis in reality.  There's nothing we can do to stop that from happening at least occasionally, but I certainly don't have to pat people on the head for their ignorance.\n\n \n\nLate edit: And yes, I know that comes off harsh, but I live in a data-driven world and I have no tolerance for people who'll ignore facts for the sake of their feelings, especially when they're using those inaccurate feelings to bash something that really doesn't deserve it.\n\nEdited November 11, 2015 by Buhallin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1890770","commentId":1890770,"userName":"banania","timestamp":1447335800,"content":"Perception.\n\nCapture.jpg [http://s21.postimg.org/midry4gsn/Capture.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1890856","commentId":1890856,"userName":"gandalfDK","timestamp":1447341445,"content":"That's where I'm aiming at."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193235-aaaand-the-land-of-shadow-is-shipping-now/?do=findComment&comment=1890877","commentId":1890877,"userName":"leptokurt","timestamp":1447342518,"content":"You guys crack me up! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] :D :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"}]}