{"url":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/","title":"More fun with keywords","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1899133","commentId":1899133,"userName":"sappidus","timestamp":1447890812,"content":"Can a player OTHER than the one revealing an encounter card with the Peril keyword play Don't Be Hasty! ? This could be theoretically useful for, say, readying an emergency chump blocker against a Warrior of Dunland."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1899139","commentId":1899139,"userName":"cmabr002","timestamp":1447891169,"content":"I think so, yes, but I'm not sure of anything anymore after going through \"The Battle is Joined\" thread..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1899276","commentId":1899276,"userName":"GrandSpleen","timestamp":1447900657,"content":"Ahhh, dunno. \"Don't Be Hasty\" does say you can use it before resolving keywords, so if this question came up while I was playing with others, I'd be fine with it.\n\n \n\nBut is 'Peril' a keyword that gets 'resolved?'    These threads are starting to make my head hurt..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1899475","commentId":1899475,"userName":"NathanH","timestamp":1447917159,"content":"AAAAAAAAAAAARGH!\n\nEdited November 19, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1899633","commentId":1899633,"userName":"Seastan","timestamp":1447935599,"content":"Peril is definitely a keyword, and don't be hasty specifically says it is played before keywords, so i don't see any problem here.\n\nFor the same reason I'm also pretty sure that Thalin can damage peril enemies that another player has revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1900938","commentId":1900938,"userName":"caelenvasius","timestamp":1448016650,"content":"Peril is a keyword same as Doomed, Surge, etc.\n\n \n\nThe Road Darkens insert, page 6:\n\n>  \n> \n> Peril\n> When a player reveals an encounter card with the Peril keyword [...]\n\nEdited November 20, 2015 by caelenvasius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1900953","commentId":1900953,"userName":"NathanH","timestamp":1448017796,"content":"The complication I guess is that Peril does not \"resolve\". I'm not sure whether this distinction matters, but it might."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1900985","commentId":1900985,"userName":"caelenvasius","timestamp":1448020643,"content":"Peril does resolve, though, same as all other encounter card keywords. The trigger for most of them (Peril included) is when they are revealed, and the resolution is whatever effect they do.\n\n \n\nDoomed triggers when the card is revealed, and resolves when all players increase their threat by the indicated amount, or Doomed is somehow prevented (the only card I can think of that can do this is The Door is Closed, but there may be others).\n\n \n\nSurge triggers when the card is revealed, and resolves after the additional card it reveals is finished resolving, or Surge is somehow prevented (again, the only card I can think of that can do this is The Door is Closed).\n\n \n\nPeril triggers when the card is revealed, and resolves after the revealed card finishes its normal resolution, with the caveat that only the revealing player may interact with the card in question. Or, once again, Peril is somehow prevented.\n\n \n\nDon't be Hasty interrupts the keyword's resolution, allowing you to remove and ready a hero commited to the quest. In this case, the keywords and \"when revealed\" effects then resolve as normal. The Door is Closed interrupts these keywords by discarding the card before the keywords have a chance to trigger in the first place. Note that (at least to my knowledge, feel free to correct me if I'm wrong about this) \"when revealed\" happens before \"after reveal[ing]\", so a card with a \"when revealed\" effect triggers it's \"when revealed\" effect before The Door is Closed cancels and discards the card. According to Caleb, The Door is Closed cancels the card in it's entirety, and play proceeds as if that card were never revealed. Check this link for the official response to this and a similar question [https://community.fantasyflightgames.com/topic/193016-the-battle-is-joined/page-2#entry1898185].\n\n \n\nEDIT:\n\nCheck the full text for the above keywords; you'll see that each of them includes the text \"when a card with the X keyword is revealed[...]\" constituting a trigger.\n\n \n\nEDIT 2:\n\nQuick Ears can also prevent Doomed/Surge/Peril, if the keyword were on an enemy.\n\nEdited November 20, 2015 by caelenvasius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1901100","commentId":1901100,"userName":"NathanH","timestamp":1448028855,"content":"I see your point, but man, if Peril is intended to be a triggered effect that creates an ongoing passive effect targeting the card for the duration of its staging, rather than a shorthand for an always-on prperty on the card itself, then that's a really convoluted idea!\n\n \n\nI've always interpreted Peril as an always-on property of the card, like Indestructible. This is so much simpler!\n\nEdited November 20, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1901374","commentId":1901374,"userName":"Mndela","timestamp":1448038268,"content":"Frodo + Ring in Black Riders expansion.... when you trigger them, it is before keywords? For example, if you return to deck an encounter card with doomed keyword..., we usually don't resolve the doomed.\n\n \n\nHowever, we didn't use the Frodo + Ring with a card with Peril keyword, for the reason that other players can't interact.\n\n \n\nWhat are we doing bad?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1901406","commentId":1901406,"userName":"NathanH","timestamp":1448038985,"content":"I really don't know, but I think it's currenly the consensus that Frodo Baggins [TBR] cancels Doomed and Surge (and Hide, for that matter).\n\n \n\nI've always unthinkingly played that Frodo cannot cancel Peril when the first player is not currently revealing the card. caelenvasius makes a good case for why I am wrong. On the other hand, I think it makes Peril more fun if Frodo is not so powerful.\n\nEdited November 20, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193911-more-fun-with-keywords/?do=findComment&comment=1902678","commentId":1902678,"userName":"caelenvasius","timestamp":1448105860,"content":"Frodo + Ring [TBR] cancels the entirety of the card as it's revealed, so the ONLY encounter cards that it cannot directly cancel are \"Immune to player card effects\" ones, since the Ring and Frodo are player cards. This happens at the same time frame as TDiC and Quick Ears, which is before any keywords or \"when revealed\" effects trigger."}]}