{"url":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/","title":"Ambush keyword and Dunedain Hunter","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1899077","commentId":1899077,"userName":"sappidus","timestamp":1447888183,"content":"I thought of this while contemplating the rules maelstrom currently embroiling the \"The Battle is Joined\" thread in the main forum... If you're playing Road to Rivendell (normal mode), and you play Dunedain Hunter, putting an enemy into play engaged with you, does it immediately make engagement checks and therefore possibly go engage another player?\n\n \n\nRelevant rules insert text: \"When an enemy with the ambush keyword enters play, each player, starting with the first player and proceeding clockwise, must make an engagement check. The engagement check is only made against the enemy that just entered play, and not other enemies that are in the staging area. If the enemy engages a player as the result of this effect, then no further engagement checks are made against it.\" (emphasis mine)\n\n \n\nObviously the designers weren't thinking of future effects like Dunedain Hunter's when this was written. Nevertheless.\n\nEdited November 18, 2015 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1899114","commentId":1899114,"userName":"cmabr002","timestamp":1447890080,"content":"I think you would put the enemy into play engaged with you.  Then, starting with the first player, it would make its engagement checks as a result of Ambush and possible engage another player. \n\n \n\nIf you are the first player, and it will engage you based on your threat, I'm not sure what happens...Does it engage you twice within the same phase?  I would say no, it would make an engagement check against you, determine that it would engage you, but does not \"re-engage\" you since it is already engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1899277","commentId":1899277,"userName":"GrandSpleen","timestamp":1447900893,"content":"agreed wih cmabr002, I would have it enter play engaged with the first player, then do engagement checks, then have it engage another player if necessary. If it would stay with the first player, I would not trigger 'when you engage an enemy' effects a second time because the engagement hasn't changed (although most of them aren't eligible anyway, as they are limited to once per phase [Mablung] or key off of engaging an enemy with higher engagement cost than your threat [Pippin, Sam])"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1899400","commentId":1899400,"userName":"Teamjimby","timestamp":1447910601,"content":"Assuming the first player played the Dunedain Hunter, I agree that it would stay with the first player and not \"re-engage\" the first player. But that also means the conditions for Ambush have not yet been satisfied (if the enemy engages a player as a result of this effect, then no further engagement checks are made).  So it would continue making engagement checks with other players until it engaged someone (or no one)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1899574","commentId":1899574,"userName":"NathanH","timestamp":1447928762,"content":"I'd dodge the issue by arguing that, according to the rulebook, engagement checks only look at enemies in the staging area. Thus, when the creature shows up immediately into a hero area, the ambush keyword triggers, and the player makes an engagement check against {All enemies in the staging area} \\setminus {All enemies that are not the newly-arrived enemy}. This set is always empty, so there is nothing to engage.\n\n \n\nI think if you choose to allow the enemy to use Ambush, then if it's already engaged with the first player it can't engage the first player again (otherwise, for instance, all enemies with \"... engages the first player\") are constantly re-engaging the first player, and this is Silly). In this case, i guess that a strict reading of the Ambush rules suggests that, since the Ambushing enemy has not engaged the first player by this effect, it can then Ambush another player. This also seems Silly.\n\nEdited November 19, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/193908-ambush-keyword-and-dunedain-hunter/?do=findComment&comment=1900937","commentId":1900937,"userName":"caelenvasius","timestamp":1448016496,"content":"I would surmise that the Ambush text still resolves, since keywords are essentially shorthand Forced effects. Note that this is effectively a \"gut feeling\", and that I cannot find anything in the core rulebook or FAQ to back this up, nor can I find anything that expressly denies it.\n\n \n\nUnder this assumption, Dúnedain Hunter pulls the enemy out of the deck and puts it into play engaged with you, as normal. Because the enemy is \"put into play,\" Ambush still triggers, which may cause the enemy to instead engage a different player. If no elligible player is engaged, the Ambushing enemy remains with the player who played Dúnedain Hunter, as it states that the enemy is engaged with you. Essentially, Ambush is an Interrupt ability which might not be able to resolve."}]}