{"url":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/","title":"Does a &quot;Forced&quot; effect interrupt progress placement?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1903853","commentId":1903853,"userName":"GrandSpleen","timestamp":1448223111,"content":"Here's a situation from The Old Forest scenario:\n\n \n\nLong Trailer attacks the first player after the active location is explored.  Will this interrupt placement of progress during the quest phase (I suppose not, but wonder what others think).  \n\n \n\nIn my game, we were on the final round and had enough willpower committed to win the scenario. The active location got explored and there were two of these guys in the staging area. I wasn't sure whether we had simply won the game, or whether to place tokens on the location and explore it, resolve the two attacks from these guys, and then finish placing progress on the quest card.  I had a big army of allies so I went ahead and resolved the attacks.  \n\n \n\n \n\nLong-Trailer.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Old-Forest/Long-Trailer.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1903930","commentId":1903930,"userName":"NathanH","timestamp":1448228863,"content":"This is only a vague recollection, but isn't it the case that if you would explore the Active Location and the Quest at the same time, then e.g. Ancient Mathom waits until the Quest has progressed to resolve, so I guess this would be the same, and you'd win before the Forced effects resolve.\n\n \n\nBut I might be remembering wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1903956","commentId":1903956,"userName":"DukeWellington","timestamp":1448230972,"content":"I think once you are actually placing progress you place all the progress before resolving the forced effect, but honestly, I don't know. Let's say, hypothetically you have a location with a Forced effect like this: \"Forced: After this location is explored replace this location with a location from the victory display if able.\" It seems that in that case the location from the victory display would come out and absorb progress from the same quest phase before placing on the quest card. That implies that the forced effect does in fact interrupt the placement of progress, but such a card does not exist so..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1904219","commentId":1904219,"userName":"Seastan","timestamp":1448252997,"content":"Has there been a ruling on what to do in Cair Andros if you complete the Banks and 1B at the same time? Do you remove stage 2 before advancing, or after?\n\n \n\nNow what if you are on stage 2 already with the Banks active. Would you complete the banks and place excess progress on stage 2, then remove stage 2? Or would you remove stage 2 first and place the excess on stage 3..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1908024","commentId":1908024,"userName":"Ecthelion III","timestamp":1448501910,"content":"12299240_451336018393130_523622529045491 [https://scontent-dfw1-1.xx.fbcdn.net/hphotos-xft1/v/t1.0-9/12299240_451336018393130_5236225290454910830_n.jpg?oh=5084c98f193c81378b228fd2fd8e3c54&amp;oe=56AF86CC]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194163-does-a-forced-effect-interrupt-progress-placement/?do=findComment&comment=1912735","commentId":1912735,"userName":"Mndela","timestamp":1448898211,"content":"It is like Cair Andros locations in 1b of Siege of Cair Andros.\n\n \n\nThe situation is the next: only last Cair Andros location is in game, it is in active location. You make....30 quest points in quest phase, sure you will explore active location and quest card.\n\n \n\n1b reads: 'if no Cair Andros locations in game, advance to next quest card'.\n\n \n\nWhat would happen then? Just when you explore the active location go to next quest card (and explore the new one, for sure, cause of resolution step is still running)? or not?\n\n \n\nPD: i guess not\n\nEdited November 30, 2015 by Mndela"}]}