{"url":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/","title":"Shadow cards for enemies &quot;considered to be engaged&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1903841","commentId":1903841,"userName":"GrandSpleen","timestamp":1448222802,"content":"There are a few enemies who are \"considered to be engaged\" with each player, and who attack each player in turn.  Old Man Willow from The Old Forest is one, Thaurdir from The Battle of Carn Dum is another.\n\n \n\nWhen do you deal shadow cards to these guys?  Per the core rules, each enemy engaged with a player is dealt a shadow card at the beginning of the combat phase.  You could interpret this such that in a 4 player game Thaurdir will get 4 shadow cards dealt to him, then resolve them all at once when attacking the first player.\n\n \n\nThis didn't make sense to me, so I have always simply dealt the enemy in the staging area a card at the beginning of his attack.  But I haven't seen any text or ruling to back this up.  Is this correct?  How do you all play this type of situation?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1903932","commentId":1903932,"userName":"NathanH","timestamp":1448228967,"content":"Shadow and Flame tells us of the Balrog: \n\n> Durin's Bane stays in the staging area and is considered to be engaged with all players whose threat is 1 or greater, allowing it to both add its threat to the staging area and attack. Durin's Bane attacks each player it is engaged with once during that player’s normal enemy attack resolution step. (One shadow card per engaged player should be dealt to Durin's Bane at the beginning of combat.) Each shadow card is only be used once, and is immediately discarded after that attack is completed\n\n \n\n \n\nI would interpret \"beginning of combat\" to mean \"at the beginning of the combat phase\".\n\nEdited November 22, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1903949","commentId":1903949,"userName":"DukeWellington","timestamp":1448230611,"content":"I would say that an enemy gets a shadow card if engaged with a player, regardless of how many players. It is simply on or off. Then, when the enemy attacks additional players it gets an additional shadow card for each attack. Unfortunately, this is another problem area for the game. In essence, a shadow card is given to an enemy as a step in that enemy making an attack, but there is also a framework step at the beginning of the combat phase where shadow cards are also dealt. This means there are actually two ways an enemy gets a shadow card in the normal operation of the rules. This is an awkward design, but it is what we have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1903991","commentId":1903991,"userName":"GrandSpleen","timestamp":1448233575,"content":"I looked more closely at the core set rules, and it does specifically say \"Deal 1 shadow card to each enemy.\"   So I suppose you would just deal the enemy 1 card.  Then, like DukeWellington mentioned, it would get another shadow card at the beginning of each additional attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1942216","commentId":1942216,"userName":"CookieWizard","timestamp":1450414622,"content":"The supplement for the Shadow and Flame expansion provides clarification on Durin's Bane: a multiple engagement creature. You deal it one shadow card per eligible player during each combat phase, resolving one of them with each attack. I just assume other creatures like this work the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194161-shadow-cards-for-enemies-considered-to-be-engaged/?do=findComment&comment=1942813","commentId":1942813,"userName":"awp832","timestamp":1450444451,"content":"have played it like CookieWizard,  but interested to know if this is how it's supposed to work."}]}