{"url":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/","title":"Can anyone give me a little help with mono-sphere decks.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905320","commentId":1905320,"userName":"silverthorn","timestamp":1448322851,"content":"I've just been invited to a play-through of all the Saga scenarios but the major problem is that all of the Fellowship are taken by the other players. I was thinking about taking a mono-sphere deck but my relative lack of experience with such decks means that if anyone can suggest good mono decks without canon Fellowship members I would be most thankful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905421","commentId":1905421,"userName":"Seastan","timestamp":1448328485,"content":"Caldara!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905554","commentId":1905554,"userName":"Nickpes","timestamp":1448338024,"content":"Take a Hama, Eomer and Beregong tactics deck. They all took part on the story. Eomer could fight a possible two enemies per turn and Beregond defend against two more also. Hama recycles events like thicket of spears, feint or the one that redies a gondor character giving him +1 to defend. There are also lots of allies who can help like the gondorian knight or the defending gondorian ally who has a 4def ...\n\nEdited November 24, 2015 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905567","commentId":1905567,"userName":"Kjeld","timestamp":1448339314,"content":"Mono-leadership outlands... Something like Hirluin + Theodred + Erkenbrand/Balin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905590","commentId":1905590,"userName":"Delaric","timestamp":1448341419,"content":"My take would be to do a mono Lore deck.  The heroes for those ones don't matter that much since thematically your deck would be in the background, helping the quest as a whole.  Mono Lore allows you to stock up on healing, card draw, and manipulating the encounter deck.  Elrond might be a good choice for that, he's sort of removed from the Ringbearer's quest in a way.  Heck, you could have a deck with Elrond, Bilbo, and Lore Glorfindel (or Erestor) and you could thematically be the aid of Rivendell - you're starting threat would be pretty high though.  When you get to The Treason of Saruman you can switch to using Damrod and maybe Beravor.\n\n \n\nIn games with 3-4 players you are a rock star if you bring healing and card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905692","commentId":1905692,"userName":"Flrbb","timestamp":1448355412,"content":"Try building a support deck. So, I'd say basically Lore and Spirit. Healing, card draw and lots of canceling effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905829","commentId":1905829,"userName":"Lecitadin","timestamp":1448370803,"content":"I agree that a support mono lore deck is always appreciated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1905969","commentId":1905969,"userName":"silverthorn","timestamp":1448378877,"content":"I think I'll try two decks (mono-Tactics and mono-Lore) and pick one for the actual run-through. I'll probably also restart my own run against the quests using the two decks to work out some of the kinks in the decks. Thanks for the advice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1907511","commentId":1907511,"userName":"JonofPDX","timestamp":1448471018,"content":"All good options (though personally I think playing Eomer without Leadership--and Imrahil--is a bit of a waste) but it is really going to depend on what named allies other people are playing. A Lore deck with a lot of named rangers, for instance, could step on some toes in the other decks even if the heroes don't become a problem. And of course, you all have to coordinate Gandalfs (nothing worse than running Core gandalf and finding someone running Hero or keeping OHaUH out forever). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1907881","commentId":1907881,"userName":"silverthorn","timestamp":1448490650,"content":"The playthrough has been pushed back to early next year (the guy whose house we were going to play at has just become a father again so things are on hold). I'm definitely thinking about going for a all-Mono support deck (probably with Elrond/Haldir/Rossiel) when the time comes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1907931","commentId":1907931,"userName":"Slothgodfather","timestamp":1448492888,"content":"I assume Gandalf has already been taken?\n\n \n\nFor mono-lore support, I'd run Damrod, Rossiel and Haldir.  Elrond is great, but typically unnecessary and unless you include some non-lore allies, your not utilizing one of his abilities.  Using Haldir means you don't plan to engage things, and traps will definitely help with that department.  Ambush and Ranger Spikes are 3x.  Also, using Rossiel gives your entire group access to Keen as Lances, which is amazing.    Also, Lore gives access to Advance Warning, Distant Stars, Gildor's Counsel and Quick Ears - all of which offer great support.\n\nEdited November 25, 2015 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1908403","commentId":1908403,"userName":"silverthorn","timestamp":1448541991,"content":"That's a interesting combination (I just got Land Of Shadow so using Damrod would be a definite possibility)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194248-can-anyone-give-me-a-little-help-with-mono-sphere-decks/?do=findComment&comment=1914508","commentId":1914508,"userName":"Slothgodfather","timestamp":1448992362,"content":"Let me know how you like it.  Seems like it should fit in really well as a support deck.  Can providing healing and staging area manipulation as well as solid attack through Haldir.  Get the tactics player to toss some weapons your way.  Remember than ambushed monsters don't need to be defended since you can attack (and kill) them as an action before they get a chance to attack.   And you'll have a slight form of cancel in the late game with The Door is Closed!.  \n\nEdited December 1, 2015 by Slothgodfather"}]}