{"url":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/","title":"Party Leader concept","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/?do=findComment&comment=1908203","commentId":1908203,"userName":"John Constantine","timestamp":1448518227,"content":"Just a small concept came to my mind one of these days, nothing special, just wanted to share it. \n\n \n\nLong story short, imagine if every hero was two-sided (lets ignore the fact that some quests need the hero to be facedown for the purpose of this concept), one regular side as we have them all now, and one \"leader\" side.\n\n \n\nDuring the setup, each player would choose one of his heroes to become the \"leader\" of his party and flip him to his leader side.\n\n \n\nHow leader versions of the heroes would be different from their regular counterparts?\n\nThey would have some inflated stats at no additional threat cost, and their ability would be somehow improved. They would also have a Leader trait so that some player and encounter cards could interact directly with them. Oh, and if your leader leaves play - you're eliminated.\n\n \n\nJust a couple of quick leader concept of core heroes from the top of my head.\n\n \n\nBeravor (10) 3/3/3/4 Dunedain. Ranger. Leader.\n\nAction: Choose a player to draw 1 card. Then, you may exhaust Beravor to have that player draw 2 additional cards. (Limit once per round.)\n\n \n\nAragorn (12) 2/4/3/5 Dunedain. Noble. Ranger. Leader.\n\nResponse: After Aragorn commits to a quest, spend 1 resource from his resource pool to ready him. He gets +2 Willpower until the end of the phase.\n\n \n\nAnd so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/?do=findComment&comment=1908290","commentId":1908290,"userName":"Flrbb","timestamp":1448526885,"content":"Good idea! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/?do=findComment&comment=1908547","commentId":1908547,"userName":"Gizlivadi","timestamp":1448550398,"content":"I like this idea. I was also thinking something similar, but it was attachments that gave various benefits at the same cost. Since I almost always reset if one of my heroes dies (unless it's later in the game where I can still pull through, this would be a welcome addition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/?do=findComment&comment=1908586","commentId":1908586,"userName":"Bullroarer Took","timestamp":1448552512,"content":"Powerful. Too powerful? Maybe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194403-party-leader-concept/?do=findComment&comment=1908654","commentId":1908654,"userName":"John Constantine","timestamp":1448555208,"content":"> Powerful. Too powerful? Maybe.\n\nI never intended to balance those examples I provided, I merely provided something to show what they might look like. And do remember that even though thy're more powerful than regular ones, you are eliminated as soon as your leader leaves play."}]}