{"url":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/","title":"Thaurdir and Feint in The Battle of Carn Dun","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/?do=findComment&comment=1910102","commentId":1910102,"userName":"donkler","timestamp":1448662659,"content":"I am confused about how the forced effect works in 1B of The Battle of Carn Dum. It reads:\n\n \n\n\"Forced: If there are 3 shadow cards dealt to Thaurdir, flip him\"\n\n \n\nIt seems the intention is that Thaurdir would start on the Captain side, flip over to Champion side, and then make an attack thus getting rid of his shadow cards.\n\n \n\nHowever what happens when I use Feint on him for this phase? The way I read it, the Forced effect happens after his attack is cancelled, so he flips again, deals shadow cards to enemies, the forced effect happens again, he flips again, he can't make an attack still, he flips again due to the forced effect, deals out more shadow cards... etc etc until he draws out the rest of the encounter deck as shadow cards.\n\n \n\nI'm pretty sure this is not how it is supposed to work. Is there a limitation on Forced effects? Like once a phase or round? I'm pretty sure that it doesn't mean to say \"Forced: If there are EXACTLY 3 shadow cards dealt to Thaurdir, flip him\", because then he will never attack again after a single round of cancelling his attack. Maybe I am doing it right, and the intention is he just makes a massive attack with dozens of shadow cards after the Feint wears off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/?do=findComment&comment=1910209","commentId":1910209,"userName":"GrandSpleen","timestamp":1448670821,"content":"I'm not sure I understood what you were doing.  \n\n \n\nSo you're playing Feint, that means we are currently in the Combat phase.  At the start of the combat phase, shadow cards are dealt to engaged enemies.  Thaurdir is not engaged on stage 1B, so he does not get any shadow cards.  Feint is not necessary, as he will not be attacking you anyway.  Even if he WOULD get a shadow card and made an immediate attack, you have now legal action window to play Feint because you can't take actions until after shadow cards have been dealt (And you can't cancel an attack that is already in progress).\n\n \n\nOn stage 2B, there is no provision for Thaurdir to be flipped if he gets 3 shadow cards.\n\n \n\nNot seeing where you are getting a loop out of this -- much less where you might see an instruction to deal 3 cards to Thaurdir all at once (enough to flip him while on stage 1B)?\n\n \n\nIf this hasn't helped, please clarify!\n\nEdited November 28, 2015 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/?do=findComment&comment=1910225","commentId":1910225,"userName":"DukeWellington","timestamp":1448671585,"content":"I think I understand your mistake. Let me restate what GrandSpleen was saying in a way you may understand better.\n\nAs GrandSpleen said, Feint can only be used as a combat action, so you can't use it to prevent attacks outside the combat phase. Also, as Feint is an action (not a response) you cannot use it to prevent an immediate attack. You have to play Feint BEFORE Thaurdir attacks. If he gets a third shadow card and flips you have no action window in which to play Feint.\n\nIt is very unlikely that he would get a third shadow card and flip after you play Feint against him in the combat phase. So, you probably either played Feint outside of the combat phase, or played it illegally as a response, or both.\n\nBut let's assume you played correctly and he got a third shadow card in the combat phase after you played Feint and he flips. Here is what would happen:\n\nFirst, he would not attack. Then, assuming you are on stage 1, you would flip him back to Captain AT THE END OF THE ROUND. This is outside of the combat phase. At that point, he would flip again because of his forced effect and he would immediately attack. When he attacks at the end of the round there is no way to stop him. Thus, there is no loop.\n\nI hope that helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/?do=findComment&comment=1910279","commentId":1910279,"userName":"donkler","timestamp":1448676399,"content":"Thanks, that does help! I was playing feint outside of combat which was my main issue. This is all based around the  \"Forced: If there are 3 shadow cards dealt to Thaurdir, flip him\" text on 1B.\n\n \n\nI still think the loop is possible in the combat phase under very specific, rare circumstances. Let's say in the combat phase Thaurdir starts on the Champion side with two Shadow cards already on him. I am super cautious and go ahead and Feint him before resolving any enemy attacks. First enemy attacks with Daechanar's Will as a shadow card which flips Thaurdir to his Captain side, but he is feinted and does not attack. The next enemy also has Daechanar's Will as a shadow card and flips Thaurdir again to his Champion side giving him and any other enemies another shadow card. So now Thaurdir has a 3rd shadow card but he cannot attack me this phase. The Forced effect makes it seem like Thaurdir would just flip back and forth forever since he cannot get rid of those darn shadow cards. There seems to be no limitation on the quoted Forced effect on the quest so i'm assuming it just keeps triggering one right after the other as long as he has at least 3 shadow cards.\n\n \n\nHopefully I am making sense. I just thought it was interesting there might be a possibility of an infinite Thaurdir flip out session."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194518-thaurdir-and-feint-in-the-battle-of-carn-dun/?do=findComment&comment=1910321","commentId":1910321,"userName":"GrandSpleen","timestamp":1448682005,"content":"Ah, I get you.  The Forced response does not give a clear point in time at which it is supposed to trigger.  It just says \"Forced: If there are 3 shadow cards dealt to Thaurdir, flip him.\"  So if Thaurdir is Feinted and somehow gets a third shadow card, he'll flip per the quest card's text, his attack will not resolve and he'll keep the shadow cards, and then it seems like maybe he'll flip again.\n\n \n\nThat Forced effect should probably say something like, \"After Thaurdir is dealt a shadow card, if he has 3 or more shadow cards dealt to him, flip him.\"\n\n \n\nIn any case, a Forced effect is meant to trigger only ONCE per qualifying trigger, so whatever that trigger is meant to be, it should only fire once and not cause a loop.  In other words, it can't fire continuously off of a continual \"state\" such as \"having 3 shadow cards dealt to you.  It needs a clear triggering event, and in this case that event could be better defined.\n\nEdited November 28, 2015 by GrandSpleen"}]}