{"url":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/","title":"faq 1.11 limitations on attacks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/?do=findComment&comment=1912002","commentId":1912002,"userName":"shosuko","timestamp":1448841486,"content":"I want to make sure I'm playing this right, so I'd like some clarifications.\n\n \n\nWhen it is my turn to attack, by the rules of the combat phase I get an opportunity to attack each enemy I am engaged with once.  I can also declare a ranged attack with my character against an enemy my team mate is engaged with.\n\n \n\nThe FAQ then says \"the game rules still only provide for a single attack against each of these enemies.\"\n\n \n\nSo if I make a ranged attack against an enemy, does that mean my team mate cannot make another attack against that enemy during his turn to declare attacks against enemies he is engaged with?\n\nOr is this only a per player per enemy limitation?\n\n \n\n- I think this is important as the troll Tom in the Over Hill and Under Hill has the restriction that \"Troll enemies can only be attacked by one character at a time.\"\n\n \n\nSo if I attack during my turn with Bard the Bowman on a troll engaged with my team mate, can they then attack during their turn taking advantage of the -2 shield penalty?\n\nEdited November 30, 2015 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/?do=findComment&comment=1912068","commentId":1912068,"userName":"Seastan","timestamp":1448846155,"content":"> I want to make sure I'm playing this right, so I'd like some clarifications.\n> \n>  \n> \n> When it is my turn to attack, by the rules of the combat phase I get an opportunity to attack each enemy I am engaged with once.  I can also declare a ranged attack with my character against an enemy my team mate is engaged with.\n> \n>  \n> \n> The FAQ then says \"the game rules still only provide for a single attack against each of these enemies.\"\n> \n>  \n> \n> So if I make a ranged attack against an enemy, does that mean my ally cannot make another attack against that enemy during his opportunity to declare attacks against enemies he is engaged with?\n\n \n\nBy \"ally\" do you mean the other player? Just making sure, because the term \"ally\" is a word defined in the game.\n\n \n\nOpportunities to declare attack are player based. If you use an archer to declare an attack against an enemy engaged with another player, then you can declare no more attacks against that enemy. But the other player can when it gets to his turn to declare attacks. Normally this never happens, because you generally want to wait until the other player declares the attack and then join in with your archer, rather than have to go through the enemy's defense twice.\n\n \n\n>  \n> \n> So if I attack during my opportunity with Bard the Bowman on a troll engaged with my opponent, can my ally then attack during his turn taking advantage of the -2 shield penalty?\n\n \n\nBy \"opponent\" do you mean the other player? By \"ally\" do you mean the other player? If that is what you mean then yes he can, but unless you have Bard set up with readying effects, you would probably want to save his attack for when the other player declares his attack against the enemy in order to pool your attack strength."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/?do=findComment&comment=1912093","commentId":1912093,"userName":"shosuko","timestamp":1448847386,"content":"I edited my original post, it should be more clear now what I meant.  It's different playing a multi-player co-op game than a 1v1 pvp game, sorry.\n\n \n\nWhat I'm gathering from your post though is that the limitation is per player, meaning I can declare 1 attack against any enemy I am able to attack (engaged or ranged) during my portion of the combat phase, and then my team mate also gets an opportunity for each enemy they are able to attack, meaning we could each attack the troll in 1 round this way, and take advantage of the -2 shield penalty from bard the bowman to deal with these troll ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nEdited November 30, 2015 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/?do=findComment&comment=1912104","commentId":1912104,"userName":"GrandSpleen","timestamp":1448847824,"content":"Yep correct!\n\n \n\nOne of my favorite deck combats had Bard doing ranged attacks into the staging area with a Great Yew Bow, then a companion deck also attacking into the staging area with Dunhere, making extra use of Bard's -2 defense effect for those bigger enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194649-faq-111-limitations-on-attacks/?do=findComment&comment=1912120","commentId":1912120,"userName":"shosuko","timestamp":1448849088,"content":"Yeah I was thinking Bard with Great Yew Bow + Haldir for some great staging area showdowns."}]}