{"url":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/","title":"Light of Valinor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914310","commentId":1914310,"userName":"Bullroarer Took","timestamp":1448984903,"content":"If it were \"Limit one per deck\", would spirit Glorfindel be so ubiquitous?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914318","commentId":1914318,"userName":"John Constantine","timestamp":1448985389,"content":"Nerfing an innocent card because of a single hero? (even though it was created specially for him)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914330","commentId":1914330,"userName":"Thanatopsis","timestamp":1448985982,"content":"I think a lot of people forget that the card text does not state \"attach to Glorfindel\". With the recent cycle, there are now several viable targets for this card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914350","commentId":1914350,"userName":"Noccus","timestamp":1448987135,"content":"Elrond was always a good target.\n\nDidn't even need to play a spirit hero with Vilya on him.\n\nAnd yes, LoV is strong.\n\nBut as trololo ...err...john said: it's the single hero that's the problem, not LoV."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914455","commentId":1914455,"userName":"Bullroarer Took","timestamp":1448990868,"content":"I'm aware of all that of course.  What then would be the best balance?  Starting threat 7?  9?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914465","commentId":1914465,"userName":"John Constantine","timestamp":1448991162,"content":"In terms of balance the best thing would be the lack of existance of an attachment that has no problem exploring stuff and is dedicated purely to him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914513","commentId":1914513,"userName":"Authraw","timestamp":1448992479,"content":"I would go with either \"When Glorfindel commits to the quest, raise your threat by 1\" or \"When Glorfindel exhausts, raise your threat by 1\". His starting threat is still probably too low even with that modification, but at least then LoV doesn't give you unconditional use of Glorfindel's attack AND willpower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914778","commentId":1914778,"userName":"JonofPDX","timestamp":1449002809,"content":"To the original question—“No, Spirit Glorfindel probably would not be as ubiquitous if Light was nerfed.” I would even go so far as to say that it would make Glorfindel a more interesting card to play. But it would pretty much ruin Light of Valinor—there would just be no need for it.\n\n \n\nFrom a practical gameplay stand-point giving it a “1 per deck” restriction means that you could never be sure of getting it in a given game. So why not play a more versatile readying effect. There was just a big discussion in another thread about whether or not Dain and Steward of Gondor limited the available design space for other cards. Here, UC seems to fall into the same category. With the additional restriction, there just wouldn’t be a good reason to play Light vs another readying effect (except perhaps treacheries that punish exhausted characters?).\n\n \n\nAnd from a thematic standpoint it would be a pretty big let-down in comparison with other similar cards. All the other “1 per deck” cards all have a high element of drama. You won’t see them every game, and half the time when you DO see them you won’t get good use out of them. But when they really hit you can have HUGE turns that define games (and help to create memorable dramatic moments). This…doesn’t. It’s arguably the best of all of those cards in your opening hand and the worst very late in the game but either way it’s the least exciting.\n\n \n\nHonestly, Light is really pretty balanced in a world that includes the ability to run 3x UCs. The problem (if there is a problem—more on that in a sec) is Glorfindel. He’s the one that’s so over-powered and it really doesn’t have that much to do with Light of Valinor or Asfaloth’s balancing.\n\n \n\nI would personally have loved for Glorfindel to read more like: (5) 3/3/1/5, Glorfindel does not exhaust to commit to the quest. Forced: When Glorfindel commits to the quest, raise your threat by 1 (or perhaps: “raise your threat by 2, another player may reduce their threat by 1” if you want to maintain the awesome and theme while giving players more to think about). This would free up 3 spots in your deck where Light of Valinor used to be (possibly for a redesigned Light that had a more interesting effect with a similar restriction) and would make Glorfindel players have to think a little more about whether to take advantage of Glorfindel’s ability.\n\n \n\nBut he wasn’t designed that way, at least in part because Glorfindel was originally released to make secrecy a viable option. The quests at that time were hard enough that you simply HAD to run higher-stated heroes to consistently do well and that ran counter to the keyword theme FFG was trying to establish. FFG just evidently didn’t realize how good the hero they made was in almost ANY deck archetype.  \n\n \n\nI do want to take a quick moment to defend poor Glorfindel, though, since he gets such a bad rap for is OPness. Yes, he is very powerful. But…we have other very powerful heroes (Elrond can straight-up break the game if you build him right). What makes Glorfindel unique is that he might be the easiest to play of the super-powerful cards. And I get why people hate that (just like people hated Outlands and some people are starting to make noises about Ents). They feel like this is a game of skill and they don’t want to purposely sabotage their own decks to get a challenge. And I understand that position. But…this is a coop game—and that changes things. Much more so than in a competitive setting you will be playing with players of varying skill-levels. And I think that as hard as the game can be in some quests, we NEED some of these “over-powered” deck archetypes to balance out for player skill and allow for teams including weaker players can still play together and have fun (I run a Gandalf-Hirluin-Eleanor Outlands deck for my girlfriend for that very reason). And yes, Easy-Mode makes up for that to an extent, but Easy-Mode tends to strip out some of the encounter decks most interesting and challenging cards; not to mention the diminished play-experience for the more skilled players in Easy-Mode…\n\n \n\nBlah blah—long comment is long. Sorry @ Bullroarer Took! Didn’t mean to right a freaking essay in your thread. \n\nEdited December 1, 2015 by JonofPDX"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914819","commentId":1914819,"userName":"Bullroarer Took","timestamp":1449003996,"content":"I play Glory too, but his problem isn't that he's overpowered, it's that he's EVERYWHERE.\n\n \n\n\"Look at my Rohan deck!  Eowyn, Théoden and Glorfindel...\"  Etc...  Why?  Because his starting threat is so low and with Light, there is no real penalty for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914845","commentId":1914845,"userName":"gandalfDK","timestamp":1449004624,"content":"Sorry for any derailment possibilities. I have proof that John is not Trololo.\n\nSo, please refrain yourself from making that mistake. They are not the same person.\n\nEdited December 1, 2015 by gandalfDK"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914854","commentId":1914854,"userName":"DunedainLoreKeeper","timestamp":1449004851,"content":"I think Glorf's ubiquitousness (is that a word?) comes not from him being powerful but from the lack of alternatives. Only 3 attack spirit character for a long time, one of two targets for Asfaloth (which in itself is an almost must-have card, especially in multiplayer) and only hero that starts with 5 threat. So if you needed any of these elements, he was your only choice. And having everything together also made him 'better' than most alternatives.\n\n \n\nBut Elrond and Gandalf are certainly on the same powerlevel but we're not as 'compelled' to use them. So I don't think nerfing anything Glorfindel related would influence his use much. Just add more alternatives. I for one would like more Glorfindel/Beorn heroes that have better stats/lower starting threat at some cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914888","commentId":1914888,"userName":"JonofPDX","timestamp":1449006191,"content":"> I think Glorf's ubiquitousness (is that a word?) comes not from him being powerful but from the lack of alternatives. Only 3 attack spirit character for a long time, one of two targets for Asfaloth (which in itself is an almost must-have card, especially in multiplayer) and only hero that starts with 5 threat. So if you needed any of these elements, he was your only choice. And having everything together also made him 'better' than most alternatives.\n> \n>  \n> \n> But Elrond and Gandalf are certainly on the same powerlevel but we're not as 'compelled' to use them. So I don't think nerfing anything Glorfindel related would influence his use much. Just add more alternatives. I for one would like more Glorfindel/Beorn heroes that have better stats/lower starting threat at some cost.\n\n \n\nThis is a super great point and you said it way better than I did. \n\n \n\nGlorfindel is just so EASY. Throw him anywhere with 3 copies of Light and Asfaloth and he'll do well. And I actually think that's a strength, but it is also a weakness since he shows up SO often. And beyond just Glorfindel fatigue, it also makes pick-up games pretty hard to organize. \n\n \n\nUltimately I don't think this gets resolved until there are other low threat options (Mirlonde could have been that but you have to run mono-Lore before it approaches that level and there's no up-side vs Glorfindel) and another Glorfindel that people want to play (Ally MIGHT help with that, but I still prefer Hero). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914893","commentId":1914893,"userName":"ossderossmane","timestamp":1449006330,"content":"DunedainLoreKeeper has a point there. Look at the alternatives available when Glorfindel was released: Eowyn (great), Eleanor (never really caught on), Dunhere (only in specific decks), Frodo (actually really good), Dwalin (uhm...yeah). So two actually good spirit heroes you've acutally already been using for quite a while. The next cycle and 3 saga boxes give you the following: 2 dwarfs with very specific applications, 2 hobbits that consistently rank at the bottom of all hero ratings, and Caldara, who is essentially mono spirit specific, i.e. you're usually playing her with Glorfindel.\n\nSo up to the 4th cycle, you have just about 3 universally good spirit heroes. If you play mono, he's in. If you play 2 spirit heroes, he's still probably in. And the low threat just makes him super easy to splash.\n\nBy the way, my preferred fix would be to change Light of Valinor to after attached character commits to the quest, ready him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914909","commentId":1914909,"userName":"JonofPDX","timestamp":1449006800,"content":"> DunedainLoreKeeper has a point there. Look at the alternatives available when Glorfindel was released: Eowyn (great), Eleanor (never really caught on), Dunhere (only in specific decks), Frodo (actually really good), Dwalin (uhm...yeah). So two actually good spirit heroes you've acutally already been using for quite a while. The next cycle and 3 saga boxes give you the following: 2 dwarfs with very specific applications, 2 hobbits that consistently rank at the bottom of all hero ratings, and Caldara, who is essentially mono spirit specific, i.e. you're usually playing her with Glorfindel.\n> \n> So up to the 4th cycle, you have just about 3 universally good spirit heroes. If you play mono, he's in. If you play 2 spirit heroes, he's still probably in. And the low threat just makes him super easy to splash.\n> \n> By the way, my preferred fix would be to change Light of Valinor to after attached character commits to the quest, ready him.\n\n \n\nOnly problems there are that A) it becomes just a way more restrictive UC (maybe reduce the cost? But then that may be overpowered...) and B) doesn't do what the designers originally needed it to do--keep Glorfindel's threat low so he can be used for secrecy decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1914991","commentId":1914991,"userName":"Bullroarer Took","timestamp":1449010876,"content":"> By the way, my preferred fix would be to change Light of Valinor to after attached character commits to the quest, ready him.\n\nI like it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915025","commentId":1915025,"userName":"leptokurt","timestamp":1449012786,"content":"> Sorry for any derailment possibilities. I have proof that John is not Trololo.\n> \n> So, please refrain yourself from making that mistake. They are not the same person.\n\nTo me it was quite obvious even without a proof. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] Not sure why some folks are convinced that they're the same person...\n\n \n\nBtw, what happened to trololo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915056","commentId":1915056,"userName":"CJMatos","timestamp":1449014085,"content":"> I'm aware of all that of course.  What then would be the best balance?  Starting threat 7?  9?\n\n \n\nHis starting threat to best balance him would be 10, 11 due to his stats and his \"negative\" ability...\n\n \n\nJust look at Lore Glorfindel... Same stats... threat 12"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915058","commentId":1915058,"userName":"awp832","timestamp":1449014244,"content":"I don't hate Glorfindel really.   He's strong,  but I certainly think we have other heros who are more powerful.  He's everywhere because, as stated,  spirit didn't have a lot of competitive options until recently.   With Galadriel, Theoden, and now Arwen and Ciradan, there are some good options opening up.\n\nI can definitely run Glorfindel without Light, and he's still strong.   Light isn't what makes him so good,  not by a long shot.   It's Asfaloth.   Asfaloth is the single best thing about Glorfindel,   Asfaloth is IMO practically the entire reason to run Glorfindel outside of secrecy.  \n\nThere is nothing currently in the game that can do what Asfaloth does even close to as well.  The only repeatable progress tokens on locations cards are The Riddermark's Finest with Gamling -which is difficult to set up and still expensive, even with Theoden helping, and Northern Tracker, which is far slower and more expensive than Asfaloth.  Asfaloth is also really easy to get out early because of Horse Breeder and possibly Mirror.  \n\nSo if we had another card that could help to deal with locations in a repeatable fashion,  I think we would see a lot less Glorfindel.  But we don't,  so he's still almost too good to pass up.\n\nEDIT:  A little more to say.   Northern Tracker used to be good, but he just doesn't synergize well with anything.  Back when you could run a good card because it was a good card,  Tracker was great.   But his traits are only Ranger -which has almost no synergies, and Dunediain, which now has synergies but pretty much all of them are out of sphere.  Even then, there isn't anything amazing.  You can ready his middleing-good stats with Descendants of Kings,  you can reduce his cost with Heir of Varanil,  and that's about all.  I hardly ever see Tracker anymore because it's so hard to pay for him  (maybe Arwen will rekindle him?) and in a deck that is built around traits he just doesn't fit in anywhere.\n\nEdited December 2, 2015 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915075","commentId":1915075,"userName":"Buhallin","timestamp":1449015145,"content":"It's something of a tangent, but I find Thror's Map to be even more valuable than Asfaloth for location management.  The extra progress is certainly great, but avoiding travel effects and being able to control which locations your progress clears (before they can sit in the staging area) is almost more important for any but the most location-heavy scenarios.\n\n \n\nI'm obviously in a minority, since there seems to be such community hate, but Glorfindel doesn't bother me.  I think with no ability, his stats put him around a 10 or 11 threat.  I think it's easy to underestimate the drawback, too - every turn you quest with him (and his high willpower makes that natural) you're increasing his starting threat.  If he were an 11, 2-3 turns not finding Light would make him one of the most expensive heroes in the game, and completely awful.  It's a tough balance point.  I've had games where Light just didn't show up at all, and he gets very limiting.\n\n \n\nI also think that people tend to look at him idealized - that first turn Light of Valinor does indeed make him awesome.  But if it doesn't come early, there's literally no other way to avoid his drawback.  Early game it's annoying, late game it can be crippling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915111","commentId":1915111,"userName":"SauronTheGreat","timestamp":1449017036,"content":"Ok so I partly agree with Buhallin.  The goal of the game is not equality.  there is a reason why there are cards like keen eyed Took.   You can get creative and use cards that aren't so good, build cool mechanics, and maybe beat mediocre quests, or you can use the better stuff and battle it out with the better quests.  yes, hes OP.  yes, he goes good with almost anything.  but he doesn't break the game.  Hes good, but if you think he is TOO good then just don't use him.  No offence, but I think hes fine.  I mean, if you are going to fix EVERYTHING that is OP in this game, start with steward, unexpected, eoywn, test of will, riversong, sneak attack, feint, ect... just to start in the core.  again, the goal of the game is not equality.  All decks were not created equal, and neither were all the cards that make up the decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915115","commentId":1915115,"userName":"danpoage","timestamp":1449017168,"content":"> It's something of a tangent, but I find Thror's Map to be even more valuable than Asfaloth for location management.  The extra progress is certainly great, but avoiding travel effects and being able to control which locations your progress clears (before they can sit in the staging area) is almost more important for any but the most location-heavy scenarios.\n> \n>  \n> \n> I'm obviously in a minority, since there seems to be such community hate, but Glorfindel doesn't bother me.  I think with no ability, his stats put him around a 10 or 11 threat.  I think it's easy to underestimate the drawback, too - every turn you quest with him (and his high willpower makes that natural) you're increasing his starting threat.  If he were an 11, 2-3 turns not finding Light would make him one of the most expensive heroes in the game, and completely awful.  It's a tough balance point.  I've had games where Light just didn't show up at all, and he gets very limiting.\n> \n>  \n> \n> I also think that people tend to look at him idealized - that first turn Light of Valinor does indeed make him awesome.  But if it doesn't come early, there's literally no other way to avoid his drawback.  Early game it's annoying, late game it can be crippling.\n\n \n\nThror's Map has received errata to be a Travel Action. This means that you can no longer use it after staging but before quest resolution to change which active location is about to get cleared. Before the errata, I agree with your comments about it being an amazing location control card. Now, Asfaloth on Glorfindel stands alone as the best repeatable location control, especially because there are a growing number of effects which punish Northern Tracker's \"put progress on everything\" effect. I suppose post-errata Thror's Map could be combined with Steed of Imladris to form a decent solution for repeatable location control, but this involves multiple cards and requires you to discard extra cards every round. Asfaloth is part of what makes Spirit Glorfindel so ridiculously powerful, and like Steward and Dain in their respective roles, seems to have warped the metagame in terms of all subsequent forms of location control. It is also why any location with 2 or fewer quest points now has either a terrible forced effect when it is explored, or is immune to player card effects.\n\nEdited December 2, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915149","commentId":1915149,"userName":"Buhallin","timestamp":1449019262,"content":">  \n> \n> Thror's Map has received errata to be a Travel Action.\n\nGAH.  How did I miss that?  That is truly sadness inducing :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nI'm not entirely sure that it drops its stock THAT much, though.  It still avoids travel effects, which is great.  It still lets you get nasty effects out of the staging area, if only before combat rather than quest resolution, and lets you do it even if you're stuck with another active location.  So sadly more limiting, but still solid.  Better or worse than Asfaloth?  Hard to say, honestly, because they serve different roles.\n\n \n\n \n\n> Asfaloth is part of what makes Spirit Glorfindel so ridiculously powerful, and like Steward and Dain in their respective roles, seems to have warped the metagame in terms of all subsequent forms of location control.\n> \n>  \n\n \n\nI'm not sure that it really holds as an issue for Spirit Glorfindel.  Lore Glorfindel can provide the same benefit, and does so without the second sphere requirement.  If it's JUST about Asfaloth, sticking to Lore seems a better bet.\n\n \n\nI do agree that Asfaloth is a defining card for location control though, mainly because of the timing.  Northern Tracker can often put far more progress out, but is a bit more expensive and does so before staging.\n\n \n\nBut I do think Sauron raises an excellent point that I was reluctant to wade into.  This is a cooperative game, not a confrontational one, and you control the power level of the cards you use.  I run a single deck with Glorfindel and Asfaloth because I find that in multiplayer (and I almost always play 2-3) you MUST have some location control.  Asfaloth provides a solution for the location lock would otherwise end many games regularly.  If you don't find that a problem, or play solo, just don't use it.  Same goes for Glorfindel.\n\n \n\nI have to admit that I've found the hate for certain \"metagame-skewing\" cards strange.  There really is no metagame - you have tools of a particular power level, and you choose the ones you need.  But this isn't a game where you may sit down across from someone and get hit by cheesy cards, and we complain about them because there's no other option.  You're in control of your experience, and bashing other people because they use certain cards more than you like is a strange thing.  Telling people how to play the game is rude but valid when you have to experience that; telling them how to play the game when they're playing separate from you is...  a step past rude."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915235","commentId":1915235,"userName":"DukeWellington","timestamp":1449026233,"content":"Pre-errata Thror's map was the most OP card ever. It was a repeatable Strider's Path. I would just destroy quests with that thing. It deserved the nerf, even if it did make me sad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915297","commentId":1915297,"userName":"GrandSpleen","timestamp":1449029622,"content":"Thror's Map, even post-errata, has been a total boss in recent quests.  It's invaluable in The Land of Shadow quests!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915308","commentId":1915308,"userName":"Rob_Oz","timestamp":1449029956,"content":"All the Land of Shadow quests and Murder at the Prancing Pony have multiple locations with negative Travel effects. I've found Thror's Map in my deck to be very important in handling these sorts of locations; one copy in a deck is usually sufficient.\n\n \n\nThe nerf certainly hurt greatly, but was reasonable.\n\nEdited December 2, 2015 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915350","commentId":1915350,"userName":"soullos","timestamp":1449031794,"content":"LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n\n \n\nThe guy is everywhere and it's annoying. He's just too easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915393","commentId":1915393,"userName":"JTG81","timestamp":1449033269,"content":"> LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> \n>  \n> \n> The guy is everywhere and it's annoying. He's just too easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n\n \n\nNope, he is pretty much mandatory for many decks which is why he is so ubiquitous. If you chose to play on easy mode you have the luxury of playing weaker heroes and have a more thematic experience, but if you want to play normal or nightmare Spirit Glorfindel should not be limit 0 per deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915412","commentId":1915412,"userName":"gandalfDK","timestamp":1449034651,"content":"> > Sorry for any derailment possibilities. I have proof that John is not Trololo.\n> > \n> > So, please refrain yourself from making that mistake. They are not the same person.\n> \n> To me it was quite obvious even without a proof. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] Not sure why some folks are convinced that they're the same person...\n> \n>  \n> \n> Btw, what happened to trololo?\n\nA ban."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915424","commentId":1915424,"userName":"PsychoRocka","timestamp":1449035552,"content":"> I don't hate Glorfindel really.   He's strong,  but I certainly think we have other heros who are more powerful.  He's everywhere because, as stated,  spirit didn't have a lot of competitive options until recently.   With Galadriel, Theoden, and now Arwen and Ciradan, there are some good options opening up.\n> \n> I can definitely run Glorfindel without Light, and he's still strong.   Light isn't what makes him so good,  not by a long shot.   It's Asfaloth.   Asfaloth is the single best thing about Glorfindel,   Asfaloth is IMO practically the entire reason to run Glorfindel outside of secrecy.  \n> \n> There is nothing currently in the game that can do what Asfaloth does even close to as well.  The only repeatable progress tokens on locations cards are The Riddermark's Finest with Gamling -which is difficult to set up and still expensive, even with Theoden helping, and Northern Tracker, which is far slower and more expensive than Asfaloth.  Asfaloth is also really easy to get out early because of Horse Breeder and possibly Mirror.  \n> \n> So if we had another card that could help to deal with locations in a repeatable fashion,  I think we would see a lot less Glorfindel.  But we don't,  so he's still almost too good to pass up.\n> \n> EDIT:  A little more to say.   Northern Tracker used to be good, but he just doesn't synergize well with anything.  Back when you could run a good card because it was a good card,  Tracker was great.   But his traits are only Ranger -which has almost no synergies, and Dunediain, which now has synergies but pretty much all of them are out of sphere.  Even then, there isn't anything amazing.  You can ready his middleing-good stats with Descendants of Kings,  you can reduce his cost with Heir of Varanil,  and that's about all.  I hardly ever see Tracker anymore because it's so hard to pay for him  (maybe Arwen will rekindle him?) and in a deck that is built around traits he just doesn't fit in anywhere.\n\n \n\n100% agree. Asfaloth MAKES Glorfindel. If it was not for Asfaloth I think the vast majority of decks would take someone like spirit merry, galadriel or the new arwen hero instead. I know I would.... the main issue I had when trying to substitute Galadriel into my decks in place of Glorfindel was the lack of Asfaloth, not the lack of willpower from turn 1 (but potentially more later on), not having one less awesome attacker, not light (light was actually great as it was going on Elrond instead who is great at questing and defending) and not even starting threat but purely Asfaloth. No Asfaloth more or less means no clearing locations in staging (unless you have a super expensive Northern Tracker out or some of the other location control cards and even then all of them don't come anywhere close to the cheap raw repeatable power of Asfaloth) which means location lock from time to time. \n\nLocation lock is most peoples most hated way of losing as well.... I know I get extremely frustrated when I lose more or less purely because of how many locations appeared in a particular game and because I haven't drawn Asfaloth yet. It has very little to do with your choices or skill at playing the game (yes you obviously need to decide just which location to travel to and sometimes this can save you but honestly most times you are location locked it doesn't matter which locations you travel to first, you are screwed either way) so its no surprise it can be so **** frustrating. \n\nCompound this with the fact that player cards that target locations are extremely few and incredibly weak when you compare them to player cards that affect threat or help with controlling enemies for example. \n\nYes recently we have gotten a few decent player cards to help deal with locations (Expert Trackers and Distant Stars) but even these are quite situational and incomparable to Asfaloth.\n\nNothing else in the game even comes close to replicating Asfaloths ability and I really wish that he allowed any hero to place two progress and perhaps only costs 1 instead of 2 if placing it on Glorfindel or something along those lines. \n\n \n\nHonestly as much as I am against house rules or doing anything that does not 100% follow the rules I think eventually I might just have to house rule Asfaloth to place 2 progress regardless of what hero he is attached to if I am ever going to escape using Glorfindel...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915434","commentId":1915434,"userName":"Dain Ironfoot","timestamp":1449036031,"content":">  \n> \n> > Sorry for any derailment possibilities. I have proof that John is not Trololo.\n> > \n> > So, please refrain yourself from making that mistake. They are not the same person.\n> \n> To me it was quite obvious even without a proof. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] Not sure why some folks are convinced that they're the same person...\n> \n>  \n> \n> Btw, what happened to trololo?\n> \n>  \n\nbecause he showed up right after Trololo was banned, makes the same kind of custom cards, posts the same kind of article summaries Trololo did, and engages in flame wars in much the same way.\n\n \n\nIf it's not the same person - it's Trololo's separated-at-birth twin. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nThough, John does have better grammar...\n\nEdited December 2, 2015 by Dain Ironfoot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915500","commentId":1915500,"userName":"Authraw","timestamp":1449041396,"content":"I agree with the sentiment that Asfaloth is part of what makes Glorfindel so ubiquitous, but it can't be just Asfaloth--otherwise we'd see the in-sphere Corefindel pretty often too. I think Spirit Glorfindel single-handedly solves so many problems all at once: low threat, high attack, high willpower, Asfaloth, easy readying through LoV, in-sphere access to Elrond's Counsel... Whatever you're missing, Spirit Glorfindel can provide it. He's the most splashable hero, so we see him everywhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915511","commentId":1915511,"userName":"John Constantine","timestamp":1449043564,"content":"> I agree with the sentiment that Asfaloth is part of what makes Glorfindel so ubiquitous, but it can't be just Asfaloth--otherwise we'd see the in-sphere Corefindel pretty often too. I think Spirit Glorfindel single-handedly solves so many problems all at once: low threat, high attack, high willpower, Asfaloth, easy readying through LoV, in-sphere access to Elrond's Counsel... Whatever you're missing, Spirit Glorfindel can provide it. He's the most splashable hero, so we see him everywhere.\n\nThe reason we are not seeing more of the Lore Glorfindel is because his ability is highly questionable at the very least, and when we look at high threat heroes - we expect something spectacular. Just a quick comparsion to other heavy threaters:\n\nAragorn can ready himself for a resource and is a sentinel, Gimli grows stronger with each wound and can dish out tons of damage with a right setup, Imrahil readies any time something leaves play, Boromir can ready as much as you want as long as you can show some threat, Dain buffs all the dwarves, Aragorn resets your threat completely, Elrond can pay for all allies and boosts the healing across the board... should I continue? Compared to all of this, Lorefindel is such a pushover, being able to only heal 1 health for 1 resource (most expensive heal 2014). The problem with the two versions is not just about spirit one being ultimately superior, but also about lore one being ultimately inferior."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915516","commentId":1915516,"userName":"soullos","timestamp":1449044346,"content":">  \n> \n> > LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> > \n> >  \n> > \n> > The guy is everywhere and it's annoying. He's just too easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n> \n>  \n> \n> Nope, he is pretty much mandatory for many decks which is why he is so ubiquitous. If you chose to play on easy mode you have the luxury of playing weaker heroes and have a more thematic experience, but if you want to play normal or nightmare Spirit Glorfindel should not be limit 0 per deck.\n> \n>  \n\n \n\nExactly, he's a crutch. If a card is so powerful it's mandatory, there's a problem. I personally ban the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915519","commentId":1915519,"userName":"Buhallin","timestamp":1449044878,"content":"The point isn't that the Lore version is better, or even equal - it's that if Asfaloth were the sole reason you saw Glorfindel as much as you do, you'd see both equally.  The Lore version isn't THAT inferior - the healing may not be the most efficient, but you have it from the very beginning, repeatably, without having to dedicate card slots. His stats are still solid (Willpower and Attack are both especially good for a Lore hero), and he makes an excellent (if high threat) combo with Elrond to really pump the healing.  He may not be absolutely amazing, but IMHO he's not so awful as to never be worth taking to get Asfaloth, especially since he provides the sphere match."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915534","commentId":1915534,"userName":"John Constantine","timestamp":1449045963,"content":"No one said Asfaloth was the sole reason, but he was one of the reasons for sure. Reducing the progress from non-Glorfindel heroes was a wrong thing to do, they should have just costed him 3 and lowered the price to play it on Glorfinderl by 1. The Lore version is THAT inferior. Yes, you have it from the very beginning, but it is extremely weak and a pure waste of resources (and it's not even in leadership). When you take lore Glorfindel, the chances are big that you won't triggered his ability at all, and when comparing a blank 12/3/3/1/5 hero to a 5/3/3/1/5 hero with a downside that can be mitigated with 1 card worth of 1 resource, the second one will always win. This \"combo\" with Elrond is very expensive threat-vise, and there are plenty of healing effects to rely on that combo. He is not absolutely amazing, and compared to the hero pool of his threat range - he is below average, and that's the reason why he is underplayed even while Asfaloth exists in the same sphere with him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915681","commentId":1915681,"userName":"PocketWraith","timestamp":1449063148,"content":"> > LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> > \n> >  \n> > \n> > The guy is everywhere and it's annoying. He's just too easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n> \n>  \n> \n> Nope, he is pretty much mandatory for many decks which is why he is so ubiquitous. If you chose to play on easy mode you have the luxury of playing weaker heroes and have a more thematic experience, but if you want to play normal or nightmare Spirit Glorfindel should not be limit 0 per deck.\n\nWhile I don't go so far in my aversion to Glorfindel as to ban him from my play entirely, placing a blanket ban on him would not be the end of the world. He's incredibly good, but he's not mandatory, especially with how much the card pool has advanced since his release. Pick any normal quest, I can beat it without Glorfindel (and probably have). Pick any nightmare quest, I'm still pretty confident I can.\n\nHe's definitely not mandatory, but he is a crutch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915776","commentId":1915776,"userName":"JTG81","timestamp":1449068564,"content":">  \n> \n> > > LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> > > \n> > >  \n> > > \n> > > The guy is everywhere and it's annoying. He's just too easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n> > \n> >  \n> > \n> > Nope, he is pretty much mandatory for many decks which is why he is so ubiquitous. If you chose to play on easy mode you have the luxury of playing weaker heroes and have a more thematic experience, but if you want to play normal or nightmare Spirit Glorfindel should not be limit 0 per deck.\n> \n> While I don't go so far in my aversion to Glorfindel as to ban him from my play entirely, placing a blanket ban on him would not be the end of the world. He's incredibly good, but he's not mandatory, especially with how much the card pool has advanced since his release. Pick any normal quest, I can beat it without Glorfindel (and probably have). Pick any nightmare quest, I'm still pretty confident I can.\n> \n> He's definitely not mandatory, but he is a crutch.\n> \n>  \n\n \n\nYou are right, he is not mandatory as this is a casual co-operative game and we can all chose to play as we wish with whatever heroes we wish. If this game was competitive though you would have to make a pretty sound argument why not to run him as he is one of the most powerful heroes in the game. I  take issue with the original comment that any deck using Spirit Glorfindel is automatically dismissed, some decks absolutely need his low threat (Gandalf, Elrond, Spirit Glorfindel for example).  I myself don't use him in every deck but when I do sleeve him up I don't want to be shamed into putting him into the binder because other posters think he should be banned and is boring to play or whatever."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1915866","commentId":1915866,"userName":"Slothgodfather","timestamp":1449072302,"content":"Don't like a card? Just don't build with it.   The group I play with hasn't used Glorfindel in at least 6 months and he hasn't been missed.  However, complaining about a card like him being used to often would be like complaining Ally Gandalf is in every deck.    Subsequently, we haven't been using him either since my trap deck uses Hero Gandalf.  Anyways, I don't think Glorfindel is broken.  Powerful, sure, but his little 3 attack isn't going to do much without weapons. and he still won't do much without ranged.  And I'm sure the tactics player wants to put those things on his own guys first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916731","commentId":1916731,"userName":"soullos","timestamp":1449103266,"content":"> You are right, he is not mandatory as this is a casual co-operative game and we can all chose to play as we wish with whatever heroes we wish. If this game was competitive though you would have to make a pretty sound argument why not to run him as he is one of the most powerful heroes in the game. I  take issue with the original comment that any deck using Spirit Glorfindel is automatically dismissed, some decks absolutely need his low threat (Gandalf, Elrond, Spirit Glorfindel for example).  I myself don't use him in every deck but when I do sleeve him up I don't want to be shamed into putting him into the binder because other posters think he should be banned and is boring to play or whatever.\n> \n>  \n\n \n\nEmphasis bold: You're putting too much stock into my opinion on whether or not I use a deck if spirit glorfy is present. I have very strong opinions that he is OP (I wouldn't bat an eye if he were nerfed or even banned), but don't let me stop you from using the guy. Play as you wish. And I do the same. As someone who exclusively net decks, I find it frustrating when I see him crop up more often than not. To me, personally, I avoid decks that use him because I'm getting tired of seeing the guy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916742","commentId":1916742,"userName":"Buhallin","timestamp":1449103589,"content":">  \n> \n> Emphasis bold: You're putting too much stock into my opinion on whether or not I use a deck if spirit glorfy is present. I have very strong opinions that he is OP (I wouldn't bat an eye if he were nerfed or even banned), but don't let me stop you from using the guy. Play as you wish. And I do the same. As someone who exclusively net decks, I find it frustrating when I see him crop up more often than not. To me, personally, I avoid decks that use him because I'm getting tired of seeing the guy.\n> \n>  \n\nI think the way you stated your original objection was far stronger than this.  Saying a card should be banned is not a \"Play and let play\" way to put things, which is what I think people found objectionable.\n\n \n\nIf you exclusively use other people's deck designs I can see how the overuse of the card could have some actual impact on you, but I think that is more your playstyle than anyone else's.  If you're tired of seeing people using a card you don't like in their decks, stop copying their decks and make your own.  I know that's a pretty obvious comeback there, but it really is the truth.  \"Stop using things I don't like in your decks that I'm copying\" is something I have a hard time generating sympathy for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916838","commentId":1916838,"userName":"soullos","timestamp":1449111615,"content":">  \n> \n> >  \n> > \n> > Emphasis bold: You're putting too much stock into my opinion on whether or not I use a deck if spirit glorfy is present. I have very strong opinions that he is OP (I wouldn't bat an eye if he were nerfed or even banned), but don't let me stop you from using the guy. Play as you wish. And I do the same. As someone who exclusively net decks, I find it frustrating when I see him crop up more often than not. To me, personally, I avoid decks that use him because I'm getting tired of seeing the guy.\n> > \n> >  \n> \n> I think the way you stated your original objection was far stronger than this.  Saying a card should be banned is not a \"Play and let play\" way to put things, which is what I think people found objectionable.\n> \n>  \n> \n> If you exclusively use other people's deck designs I can see how the overuse of the card could have some actual impact on you, but I think that is more your playstyle than anyone else's.  If you're tired of seeing people using a card you don't like in their decks, stop copying their decks and make your own.  I know that's a pretty obvious comeback there, but it really is the truth.  \"Stop using things I don't like in your decks that I'm copying\" is something I have a hard time generating sympathy for.\n> \n>  \n\n \n\n**** dude, do you always come out attacking? So what if I net deck to play the game? I don't have time to build my own decks so I look online. I understand there are limitations to that aspect of play, and I take that into account (i.e. ignoring spirit glorfy). I do what I can with my limited time, and for me, that time is better spent actually playing the game. And I'm not the only one here who is claiming the card is overpowered, overused, a crutch, etc. I feel like I'm being attacked for stating an opinion. Seriously, wtf?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916875","commentId":1916875,"userName":"Ecthelion III","timestamp":1449114758,"content":"I applaud the designers' decision to make Asfaloth lore instead of spirit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916915","commentId":1916915,"userName":"JTG81","timestamp":1449119117,"content":"> LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> \n>  \n> \n> The guy is everywhere and it's annoying. He's just easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n\n \n\nYour original post was a little bit harsh as I have posted decks in the deckbuilding strategy forum with Spirit Glorfindel as part of the strategy for people to use and to think that they were annoying to you is upsetting. There was a popular saying during the Heirs of Numenor cycle that friends don't let friends play Outlands. I say why not, you bought the cards play with whatever you want. About his current power level, at one point he was probably the best hero in the game but recently has been eclipsed, Galadriel, Erestor and Gandalf are all superior to Spirit Glorfindel IMO so I do not welcome any sort of ban or Errata. Lastly, this game is all about the thematic experience of questing through middle earth, there are no boring heroes only boring quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916930","commentId":1916930,"userName":"DukeWellington","timestamp":1449120924,"content":"I use Glorfindel constantly and without apology. As has been said before, he is not used because he is POWERFUL, but because his threat is crazy low without penalty (assuming LoV). I like to use big threat heroes and I basically have to combine that with a low threat hero or I threat out. Most low threat heroes totally suck. It's basically that simple. Recently, I have shifted to using Lore Pippen a lot instead for the card draw. I also like Galadriel's threat reduction. I have personally found Spirit Merry to be a bust, but I will keep trying. Basically, there a ton of big powerful heroes (Gandalf, Elrond, Treebeard, all versions of Aragorn, Boromir etc.) There are a ton of 9ish threat mid range heroes (Hama, Legolas, Galadriel, Gloin, Sam etc.) But there are like 2 low threat heroes, maybe 3 if you go mono green with Mirlonde. That's it. We need more low threat heroes, and good ones. Why is Glorfindel the only hero with low threat and a drawback? That is all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916987","commentId":1916987,"userName":"PsychoRocka","timestamp":1449127102,"content":"We really do need more low threat heroes that don't just completely suck. They need decent stat distribution and abilities we actually want to use. We have got an over abundance of mid range heroes that are absolutely fantastic and quite a few high cost heroes that are also fantastic but so few low threat heroes, especially ones that aren't garbage. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1916993","commentId":1916993,"userName":"danpoage","timestamp":1449127707,"content":"A couple of things:\n\n1. I was one of those during the Against the Shadow cycle joking about \"friends don't let friends use Outlands\". It was certainly a joke, though I can see how it would be misconstrued as a judgement of those who play Outlands. Far from it. People should play whatever they enjoy. I just happen to enjoy interesting mechanics and decks which require a bit more nuance to play. This can be my opinion and still not reflect poorly on those with other opinions or other styles of play. The worst thing to me about the forums (especially lately) is how many absolutes get thrown around. Things are allowed to be relative. I am allowed to never build or play Outlands/Dwarves/Spirit Glorfindel/New Archetype X without that having to be some kind of damnation of those who do. I can even strongly state my opinion about what I prefer to play without that implying that those with a different opinion are inferior. If everyone on the forums agreed all of the time, no one would be here because every thread would be incredibly boring. The important distinction (and one that somehow keeps getting lost) is that it is possible to respectfully disagree with someone without disparaging them. It actually gives your argument more merit when you don't need to resort to name-calling or other cheap tactics to get your point across.\n\n \n\n2. I have used and continue to use Spirit Glorfindel in decks, especially before Spirit Merry was released. This was partly by necessity to make certain strategies work (e.g. Secrecy), and party because I enjoy playing harder quests - including some Nightmare. Sad to say, but Core Set Glorfindel is not going to cut it as your marquee hero against certain more difficult quests. Light of Valinor and Asfaloth are so good that they combine with Spirit Glorfindel to form what remains one of the best archetypes in the game. That said, I am definitely feeling the Glorfindel fatigue and I go out of my way lately to find alternatives to using him in my decks.\n\n \n\n3. To me, this argument is a bit more complex than \"if you don't like him, don't use him\". The problem is a systemic one, and it has to do with the way that the metagame has formed around these cards for everything released since the Dwarrowdelf cycle. It's all well and good to say \"just stop using Glorfindel/LoV/Asfaloth\", but if new quests are designed around the assumption that low-starting threat, cheap readying/action advantage, and powerful location control are all available, then I am basically handicapping myself not to at least consider these cards for the harder quests. I can't speak for others, but I have found The Battle of Carn Dum solo to be very difficult. I want to try different decks, but the concern that I have with these more challenging quests is that they will push me right back to these same arguably-broken staples. Maybe there is another path, using cards like Thror's Map, threat control and questing via Galadriel, and other more interesting tricks. I certainly hope that there are alternatives, because even if they never again print something as broken as Spirit Glorfindel and his toys, he can still warp the metagame into an unwholesome shape.\n\nEdited December 3, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917004","commentId":1917004,"userName":"gandalfDK","timestamp":1449128530,"content":"> > > Sorry for any derailment possibilities. I have proof that John is not Trololo.\n> > > \n> > > So, please refrain yourself from making that mistake. They are not the same person.\n> > \n> > To me it was quite obvious even without a proof. ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] Not sure why some folks are convinced that they're the same person...\n> > \n> >  \n> > \n> > Btw, what happened to trololo?\n> \n> because he showed up right after Trololo was banned, makes the same kind of custom cards, posts the same kind of article summaries Trololo did, and engages in flame wars in much the same way.\n> \n>  \n> \n> If it's not the same person - it's Trololo's separated-at-birth twin. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n>  \n> \n> Though, John does have better grammar...\n\nStill, they are indeed not the same person. So, culture could be an explanation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917022","commentId":1917022,"userName":"danpoage","timestamp":1449130334,"content":"I just wanted to add that I absolutely agree with Duke and Psycho - we NEED more low threat heroes with good stats and useful traits/abilities. For example, a Leadership Gondor hero with a 7 or 8 threat cost and 2 willpower would be amazing. It would allow for much more interesting Gondor builds. As it is, I either include Balin as one of my heroes or have a mediocre but thematic deck with a starting threat in the 34 or 36 range. Same thing for Spirit Rohan where I can go with Dunhere as my third hero - who might fit thematically but makes no sense strategically - or I splash Galadriel/Glorfindel/Eleanor etc. so that my starting threat is not insane and the deck can actually function.\n\n \n\nTo be clear, I'm not arguing this from a \"slave to theme\" all of my decks have to be \"thematically perfect\" standpoint. But trait synergy is a thing - Spirit Rohan for example has multiple powerful effects that are more useful if all of my heroes are Rohan. It would be nice to actually be able to make use of these \"coaster\" cards like Astonishing Speed or We Do Not Sleep, but as long as I have to splash random heroes to make the deck work, these cards will continue to lose out to other more universally powerful alternatives.\n\n \n\nThis is not a criticism of the designers, the fact of the matter is that the card pool grows relatively slowly - even with the addition of Saga expansions. This is me adding my voice to those lobbying for some attention to 6-8 threat \"glue\" heroes. Before we get versions of every single marquee 11-13 threat cost hero in every other sphere, it would be nice to see a few more of these \"lesser\" heroes. It would certainly make deck-building a heck of a lot more interesting as there would be much less of a reason to \"splash\" Spirit Glorfindel into a Rohan super-questing deck.\n\nEdited December 3, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917028","commentId":1917028,"userName":"Buhallin","timestamp":1449131063,"content":">  \n> \n> **** dude, do you always come out attacking? So what if I net deck to play the game? I don't have time to build my own decks so I look online. I understand there are limitations to that aspect of play, and I take that into account (i.e. ignoring spirit glorfy). I do what I can with my limited time, and for me, that time is better spent actually playing the game. And I'm not the only one here who is claiming the card is overpowered, overused, a crutch, etc. I feel like I'm being attacked for stating an opinion. Seriously, wtf?\n> \n>  \n\nI never said anything against you for netdecking.  Netdecking is fine.  But \"I hate this card and people need to stop using it in the decks I copy\" is a pretty ****** attitude.  The nice thing about a co-op game is that you don't have to deal with what anyone else chooses to play.  You not wanting to make your own decks doesn't change that.\n\n \n\nSo again: Netdecking, fine.  Crying at people for building their decks with a card you don't want, not so fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917029","commentId":1917029,"userName":"Buhallin","timestamp":1449131164,"content":"> I just wanted to add that I absolutely agree with Duke and Psycho - we NEED more low threat heroes with good stats and useful traits/abilities. For example, a Leadership Gondor hero with a 7 or 8 threat cost and 2 willpower would be amazing. It would allow for much more interesting Gondor builds. As it is, I either include Balin as one of my heroes or have a mediocre but thematic deck with a starting threat in the 34 or 36 range. Same thing for Spirit Rohan where I can go with Dunhere as my third hero - who might fit thematically but makes no sense strategically - or I splash Galadriel/Glorfindel/Eleanor etc. so that my starting threat is not insane and the deck can actually function.\n> \n>  \n\nI've been running a Faramir/Boromir/Denethor leadership/lore deck with almost pure Gondor.  Appropriately thematic for Against the Shadow, and been doing relatively well.  It's a bit low on willpower at the start, but Visionary Leadership spikes that REALLY fast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917030","commentId":1917030,"userName":"John Constantine","timestamp":1449131393,"content":"I think the problem is that with such low production speed and such low hero count per pack/box, they just physically unable to cover all bases :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917033","commentId":1917033,"userName":"Buhallin","timestamp":1449131558,"content":"> ... if new quests are designed around the assumption that low-starting threat, cheap readying/action advantage, and powerful location control are all available, then I am basically handicapping myself not to at least consider these cards for the harder quests.\n\nI'm not entirely convinced this is the case, though.  I'll admit to still working my way through early Ringmaker, so maybe the new cycle is so awful you can't use anything but the best...  but while the assumption/knowledge of these cards is definitely active, I think we see it more in encounter effects than overall difficulty.  There are any number of examples of effects that limit staging progress, or punish you for it.  IMHO the reactions take the form of \"Asfaloth is very good, so limit his ability to function\" rather than \"Asfaloth is very good, so we're going to design every scenario so you fail without it\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917214","commentId":1917214,"userName":"soullos","timestamp":1449151807,"content":">  \n> \n> >  \n> > \n> > **** dude, do you always come out attacking? So what if I net deck to play the game? I don't have time to build my own decks so I look online. I understand there are limitations to that aspect of play, and I take that into account (i.e. ignoring spirit glorfy). I do what I can with my limited time, and for me, that time is better spent actually playing the game. And I'm not the only one here who is claiming the card is overpowered, overused, a crutch, etc. I feel like I'm being attacked for stating an opinion. Seriously, wtf?\n> > \n> >  \n> \n> I never said anything against you for netdecking.  Netdecking is fine.  But \"I hate this card and people need to stop using it in the decks I copy\" is a pretty ****** attitude.  The nice thing about a co-op game is that you don't have to deal with what anyone else chooses to play.  You not wanting to make your own decks doesn't change that.\n> \n>  \n> \n> So again: Netdecking, fine.  Crying at people for building their decks with a card you don't want, not so fine.\n> \n>  \n\n \n\nDude, stop putting words into my ****ing mouth. I think he should be nerfed, and yes, even banned, but that doesn't mean I think ill of anyone who uses him or has a different opinion on the card. Not once did I say people who build decks with him should stop using him. I choose not to use him. Simple as that. Are you telling me I can't play the way I want because I'm not using one card? Get off it!\n\n \n\n \n\n>  \n> \n> > LoV is fine. Instead, Spirit Glorfy should read: \"Limit 0 per deck.\"\n> > \n> >  \n> > \n> > The guy is everywhere and it's annoying. He's just easy to use and very boring too. The first thing I do when looking up a deck list is to see if he's in the line up or not. If he is, I immediately look elsewhere. Unfortunately, I do that more often than not.\n> \n>  \n> \n> Your original post was a little bit harsh as I have posted decks in the deckbuilding strategy forum with Spirit Glorfindel as part of the strategy for people to use and to think that they were annoying to you is upsetting. There was a popular saying during the Heirs of Numenor cycle that friends don't let friends play Outlands. I say why not, you bought the cards play with whatever you want. About his current power level, at one point he was probably the best hero in the game but recently has been eclipsed, Galadriel, Erestor and Gandalf are all superior to Spirit Glorfindel IMO so I do not welcome any sort of ban or Errata. Lastly, this game is all about the thematic experience of questing through middle earth, there are no boring heroes only boring quests. \n> \n>  \n\n \n\nSorry you took offense to that. My initial post wasn't to insult those who build decks with him. Players who use him is fine. I don't care if the guy across the table from me uses him. Their game, their preference, their fun. To me, he is OP and not fun to use so I don't use him. The guy is here to stay, I get that but it doesn't mean I have to use him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1917584","commentId":1917584,"userName":"Buhallin","timestamp":1449167742,"content":"> I think he should be nerfed, and yes, even banned.... Not once did I say people who build decks with him should stop using him.\n\nThese two statements are at odds.  Suggesting a card should be banned is pretty directly saying people shouldn't be able to use it.  I'm really not trying to put words in your mouth here, because your own are making the point for me just fine.\n\n \n\n>  \n> \n> My initial post wasn't to insult those who build decks with him.\n> \n>  \n\nAnd yet several people did take it as explicitly insulting, so at some point the problem is with the author rather than the listeners."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918090","commentId":1918090,"userName":"JonofPDX","timestamp":1449189374,"content":"For what it’s worth, I think Glorfindel is very powerful. He’s not the strongest hero in the game by any means but he’s at least near that power level and unlike many of those other very powerful heroes he requires very little deck-space (6 cards—3x Asfaloth and 3x Light of Valinor) and setup to begin seeing that power shape the board. But it’s not really his relative power or ease of setup that makes him so popular—it’s the fact that his 7 card set can be slipped into almost ANY deck including some spirit and lore (or a Song of Wisdom) and almost universally make that deck better without drawing any significant attention away from whatever else that deck is trying to do.\n\n \n\nHe’s just so easy. And because of that, he’s everywhere. And I really do get why that annoys people. His ubiquity makes him a nightmare second only to Gandalf when trying to coordinate a game with multiple players constructing decks; a problem that only gets worse when trying to get a pickup game going where players may not have had a chance to coordinate deck construction.\n\n \n\nAnd worse, his very common inclusion DOES shape the meta. And no, that doesn’t matter in the same way it would in a traditional competitive game. But his prevalence does affect the way the game devs design the quests. If 6/10 players are playing Spirit Glorfindel they have to make scenarios challenging for those players…even if that makes the brutal for other less powerful archetypes. People can always custom-build decks for the scenarios of course to get around this problem but many people (myself included here) hate that philosophy in deck-construction. Easy Mode is of course always an option but, as I said in my previous post, it’s hardly an appealing one.\n\n \n\nBut, for all that, I still think Glorfindel and the other “easy” combos and traits (and I would include Outlands here too) are necessary for this game. As a coop game, we cannot expect every player in a given game to be the same skill level and these easy to use, relatively powerful cards and sets of cards form a very necessary equalizer to allow less skilled players to play along with more skilled players without stripping down the quests the way Easy Mode does or dragging the other players down.\n\n \n\nUltimately I think it is more complicated than just: “if you don’t like him, don’t play him.” Glorfindel, and cards like him, do effect the game. I get the hate. But without those types of cards a lot of scenarios would simply be unbeatable when playing with less skilled players. Maybe that’s a deeper design issue with the game that needs to be addressed. Maybe the game always should have come out of the box with each quest having multiple difficulties and a better way of scaling those. Or maybe we as players need to self-police ourselves and just say “it’s okay to not use all the best cards and combos in every deck” so that the devs can design quests at a somewhat gentler difficulty that we can all enjoy and still be challenged by.\n\n \n\nI don’t know the right answer but I think it’s a tough design issue that’s deeper than just Glorfindel (or Steward of Gondor, or Dain, or UC, or Elrond, or old Ziggy, etc, etc, etc). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918104","commentId":1918104,"userName":"jjenks476","timestamp":1449190565,"content":"I agree with JonofPDX, in that Asfaloth, combined with Sp Glorfindel fundamentally altered the way the designers make the quests. It is impossible to dispute that locations have drastically changed in the number of quest points on them pre-Asfaloth and post-Asfaloth. Each quest the designers make they have to account for if Asfaloth is in play, this means that if the players don't use Asfaloth, they are at a slight disadvantage. Others are right when they say that Sp Glorfindel is probably the best spirit hero, and until Galadriel was almost irreplaceable, for solo players splashing spirit. About a year ago I stopped using Glorfy just because I used him in basically every quest. Playing all the NM quests without him can sometimes be difficult and I have been tempted a few times, but I have resisted and managed with careful deck construction. I have no gripe with people that do use him, but I believe he fundamentally altered the game for the worse since his appearance, and only with the introduction of Cirdan, Arwen, and Galadriel, will he finally diminish in value."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918107","commentId":1918107,"userName":"soullos","timestamp":1449190774,"content":">  \n> \n> > I think he should be nerfed, and yes, even banned.... Not once did I say people who build decks with him should stop using him.\n> \n> These two statements are at odds.  Suggesting a card should be banned is pretty directly saying people shouldn't be able to use it.  I'm really not trying to put words in your mouth here, because your own are making the point for me just fine.\n> \n>  \n> \n> >  \n> > \n> > My initial post wasn't to insult those who build decks with him.\n> > \n> >  \n> \n> And yet several people did take it as explicitly insulting, so at some point the problem is with the author rather than the listeners.\n> \n>  \n\n \n\nI took issue with you claiming this \"I hate this card and people need to stop using it in the decks I copy\". Just because I dislike the card, doesn't mean everyone needs to stop using the card for my sake so I can have a bevy of decks to choose from. That's a pretty ****ed up leap of logic and spin tactic there all based on my opinion for a ban.\n\n \n\nYes, my evil plan is to get the card banned so everyone is forced to build decks without him just for me. I'm the player people should cater to, you know? :rolleyes: [//content.invisioncic.com/Mfantflight/emoticons/default_rolleyes.gif]\n\n \n\nAnd yes, I can see how some people might take offense to my initial post. I could have worded it better. For that I apologize."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918124","commentId":1918124,"userName":"JonofPDX","timestamp":1449191850,"content":"> I agree with JonofPDX, in that Asfaloth, combined with Sp Glorfindel fundamentally altered the way the designers make the quests. It is impossible to dispute that locations have drastically changed in the number of quest points on them pre-Asfaloth and post-Asfaloth. Each quest the designers make they have to account for if Asfaloth is in play, this means that if the players don't use Asfaloth, they are at a slight disadvantage. Others are right when they say that Sp Glorfindel is probably the best spirit hero, and until Galadriel was almost irreplaceable, for solo players splashing spirit. About a year ago I stopped using Glorfy just because I used him in basically every quest. Playing all the NM quests without him can sometimes be difficult and I have been tempted a few times, but I have resisted and managed with careful deck construction. I have no gripe with people that do use him, but I believe he fundamentally altered the game for the worse since his appearance, and only with the introduction of Cirdan, Arwen, and Galadriel, will he finally diminish in value.\n\n \n\nAgree 100% that Glorfindel will reduce in value to better players once those other cards begin to disperse in the cardpool. They all require a little more skill than Glorfindel, but potentially offer some very interesting rewards as well (not least of which will be the ability to play the Glorfindel Ally when he arrives). And that will leave Glorfindel hopefully open to players that need a little bit of an easier play-experience. \n\n \n\nWe will still see him used a lot, though, until we see some more decent location control to at least somewhat replace Asfaloth. And some more low threat heroes with decent stats that don't require a very specific deck build (I'm looking at you, Mirlonde). \n\n \n\nYou know--all of this reminds me of when Ziggy first released(around the same time as Glorfindel). I remember one of the articles from the devs around that time straight up explained how to break the game with Ziggy and the devs were all like: \"okay, have fun!\"\n\n \n\nI really do think that at that time they just thought that if a card or combo was so good that it was making the game easy, people just wouldn't use it if they didn't want to--that players would self-regulate their own difficulty in their player decks. Then there was this huge backlash from the community and I think it scared them a bit. That's when the quests took a sharp up-turn in difficulty to balance out some of the very powerful cards we got in the Dwarrodelf cycle and I think the player cards have backed off a bit in power overall (with some obvious exceptions). But even the most powerful combos now seem to require a bit more setup than the powerful combos back then. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918128","commentId":1918128,"userName":"PsychoRocka","timestamp":1449192542,"content":"They desperately need to make some cards that can replace Asfaloth in decks. If they did I would INSTANTLY stop using Glorfindel. If they don't I'm stuck with him forever. Not losing every however many games to location lock, no thank you.\n\n \n\nI'm not talking stuff like Expert Trackers or Distant Stars, proper repeatable location control on an ally or attachment that isn't just far inferior to Asfaloth. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918151","commentId":1918151,"userName":"Gizlivadi","timestamp":1449195061,"content":"> For example, a Leadership Gondor hero with a 7 or 8 threat cost and 2 willpower would be amazing. It would allow for much more interesting Gondor builds. As it is, I either include Balin as one of my heroes or have a mediocre but thematic deck with a starting threat in the 34 or 36 range. Same thing for Spirit Rohan where I can go with Dunhere as my third hero - who might fit thematically but makes no sense strategically - or I splash Galadriel/Glorfindel/Eleanor etc. so that my starting threat is not insane and the deck can actually function.\n> \n>  \n\n \n\nI want to give you a big bear hug."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918159","commentId":1918159,"userName":"GrandSpleen","timestamp":1449195771,"content":"> They desperately need to make some cards that can replace Asfaloth in decks. If they did I would INSTANTLY stop using Glorfindel. If they don't I'm stuck with him forever. Not losing every however many games to location lock, no thank you.\n\n \n\nArod works, but obviously is only 1 progress instead of 2.  I don't think we'll ever see a location control card with the same level of power as Asafaloth -- regular action with no conditions, just slap it on and off you go.  But I do think we'll see a host of other cards more like Arod, conditional and less progress per use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918243","commentId":1918243,"userName":"JTG81","timestamp":1449204882,"content":"Actually Steed of Imladris is a really great location control card, almost as good as Asfaloth but since it can only work on the active location it is just not as flexible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918297","commentId":1918297,"userName":"PsychoRocka","timestamp":1449211207,"content":"yeah its really nowhere near as good man. You have to discard a card EACH time and it only targets the active location. \ngood card for sure but it is not almost as good as Asfaloth. Asfaloth is on a whole level of its own compared to anything else that targets locations. \n\n \n\nedit: Steed can also only be activated upon committing to the quest whereas Asfaloth is an action you can use at ANY time, after questing, during combat, during the planning phase whatever. This can be amazing to get rid of a detrimental location at a time you would not normally be able to. Also steed has restricted, Asfaloth does not.\n\nEdited December 4, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918335","commentId":1918335,"userName":"PsychoRocka","timestamp":1449215184,"content":">  \n> \n> > They desperately need to make some cards that can replace Asfaloth in decks. If they did I would INSTANTLY stop using Glorfindel. If they don't I'm stuck with him forever. Not losing every however many games to location lock, no thank you.\n> \n>  \n> \n> Arod works, but obviously is only 1 progress instead of 2.  I don't think we'll ever see a location control card with the same level of power as Asafaloth -- regular action with no conditions, just slap it on and off you go.  But I do think we'll see a host of other cards more like Arod, conditional and less progress per use.\n> \n>  \n\nYeah I agree that we will probably only see similar cards to Arod or the Steed which are definitely steps in the right direction but we need a couple of these cards all at once not stretched out across another 2 or 3 cycles and perhaps a little better and less situational than these two but not quite as good as Asfaloth.\n\nI just really want to not be so reliant on Asfaloth to be honest and I know plenty of people don't use him and get by just fine without but I personally just cannot deal with location lock and I already encounter it from time to time even with Asfaloth so to have it happen even more often I simply cannot allow. The worst is when you have awesome cards, have played well and just lose because almost only locations appear and you simply cannot get through them quickly enough and just get stuck and lose. Easily the least fun way to lose.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918359","commentId":1918359,"userName":"John Constantine","timestamp":1449217209,"content":"I'm afraid if they release something similar to Asfaloth, it would have to be extremely restricted to prevent players from abusing both it and Asfaloth together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918368","commentId":1918368,"userName":"Noccus","timestamp":1449218687,"content":"> I'm afraid if they release something similar to Asfaloth, it would have to be extremely restricted to prevent players from abusing both it and Asfaloth together.\n\n \n\nTrue.\n\n \n\nMaybe another version of Asfaloth? In the Spirit sphere, so it is easier to use with Glorfindel without lore, but a more restricted card.\n\n \n\n \n\nAlso, I like to use Asfaloth on other heroes; not just Glorfindel. That way it's a still a good card, but not as extreme as it is on Glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918372","commentId":1918372,"userName":"PsychoRocka","timestamp":1449218960,"content":"> I'm afraid if they release something similar to Asfaloth, it would have to be extremely restricted to prevent players from abusing both it and Asfaloth together.\n\nVery True....\n\nHow about a new version of Asfaloth himself to prevent using both? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nAsfaloth\n\nLeadership\n\nCost 3\n\nAttach to a Noldor or Silvan hero.\n\nAsfaloth costs 1 less if being attached to Glorfindel.\n\nAction: Exhaust Asfaloth to place 2 progress tokens on any location.\n\n \n\nObviously just being silly :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited December 4, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918396","commentId":1918396,"userName":"John Constantine","timestamp":1449221742,"content":"*Asfaloth (Lore)\n\nCost: 2\n\nMount.\n\n \n\nAttach to a Noldor or Silvan hero. Restricted.\n\n \n\nLimit 1 Mount per character.\n\n \n\nReduce the cost to play Asfaloth on Glorfindel by 1.\n\n \n\nResponse: After attached hero commits to a quest, exhaust Asfaloth to place 2 progress on any location.\n\n \n\n \n\nMy \"perfect\" version of Asfaloth. Still very strong and potent (not as strong as original, though). Is equally good on any hero, regardless of his name, but still cheaper for Glorfindel. And most important: provides plenty of room for the future potential progress placer cards.\n\nEdited December 4, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918412","commentId":1918412,"userName":"JanB","timestamp":1449223664,"content":"The \"Resticted\"-Keyword and the limitation \"Limit 1 Mount per character\" should apply to all Mounts currently in the game and for the future.\n\n \n\nOr.. do you remember Eomer above Firefoot and a Rohan Warhorse?\n\n \n\neomer.png?dl=1 [https://www.dropbox.com/s/qfddyrhhbznyyjy/eomer.png?dl=1]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918416","commentId":1918416,"userName":"NathanH","timestamp":1449223727,"content":"It even makes more thematic sense for Asfa to be just as good at progress for non-Glorfindel characters, because even when attached to Frodo it bore him away at a speed even the black steeds of the Enemy could not rival.\n\nEdited December 4, 2015 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918422","commentId":1918422,"userName":"PocketWraith","timestamp":1449224096,"content":"> The \"Resticted\"-Keyword and the limitation \"Limit 1 Mount per character\" should apply to all Mounts currently in the game and for the future.\n> \n>  \n> \n> Or.. do you remember Eomer above Firefoot and a Rohan Warhorse?\n> \n>  \n> \n> eomer.png?dl=1 [https://www.dropbox.com/s/qfddyrhhbznyyjy/eomer.png?dl=1]\n\nAs I recently mentioned in a different thread, it is theoretically possible to have a hero with 10 mounts. Several of them would be completely redundant, but you could do it if you chose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918445","commentId":1918445,"userName":"cmabr002","timestamp":1449227536,"content":"Let me preface this by saying that I think the reason so many people rely on Glorfindel is because of Asfaloth.  I also still think he would get a lot of use if Asfaloth did not exist simply due to his low threat and access to LoV, however people would not rely on him.\n\n \n\nI think making cards that are similar to Asfaloth is not exactly the right way to go.  They need to make something different than Asfaloth, but fulfills the same role of helping you clear locations more quickly.  For example, you could make an ally or an attachment that exhausts and allows you to travel to a second location [i understand that there would need to be some rules considerations in this respect - especially in scenarios that have \"x\" based effects where x is the value of something on the active location.  I also think this should only be allowed to trigger once per round, no matter how many of such a card was in play].  This would assist with location lock which makes people rely on Asfaloth (and, as a result, Glorfindel). \n\n \n\nNow, two things about the theoretical attachment/ally that would allow travel to two locations...These two questions need to be considered when attempting to make cards that would alleviate the need for Asfaloth...\n\n \n\n1.  Does it make the players less reliant on Glorfindel/Asfaloth? \n\n \n\nPersonally, I think that the clear answer here is yes.  Now, instead of relying on Asfaloth to assist with clearing locations, you can simply travel to two locations and clear them with high willpower.  The reason people feel like they \"have\" to use Glorfindel/Asfaloth is because people like making all-purpose decks and all-purpose decks have to have a way of reliably dealing with locations otherwise certain scenarios will punish you since simply outquesting them is not enough because of certain forced effects.\n\n \n\n2.  Would it be too powerful in conjunction with Asfaloth?\n\n \n\nI am not sure it would be too powerful, but I honestly think this would make people use Glorfindel less.  In the event that they wanted it to combo less effectively with Asfaloth, it could also have the text along the lines of \"While this card is in play, progress from player card effects cannot be placed on locations in the staging area\".  Granted, this text may need to be reworded to do precisely what is intended, but I think you get the gist of what I'm trying to say.\n\n \n\nRight now, the two most effective methods for clearing locations are Asfaloth and Northern Tracker (especially the latter in 3+ player games).  Legolas is also nice in this respect. \n\n \n\nIn my opinion, if you take away the reliance on Glorfindel/Asfaloth, you will see him less even though he will still remain a top-tier hero.\n\n \n\nEdit: I also think my theoretical card may not be the perfect solution as it may be too strong, in general, but I definitely think the route that needs to be taken is to give the players other ways of dealing with location lock that may not require placement of progress.\n\nEdited December 4, 2015 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918805","commentId":1918805,"userName":"JonofPDX","timestamp":1449248817,"content":">  \n> \n> > They desperately need to make some cards that can replace Asfaloth in decks. If they did I would INSTANTLY stop using Glorfindel. If they don't I'm stuck with him forever. Not losing every however many games to location lock, no thank you.\n> \n>  \n> \n> Arod works, but obviously is only 1 progress instead of 2.  I don't think we'll ever see a location control card with the same level of power as Asafaloth -- regular action with no conditions, just slap it on and off you go.  But I do think we'll see a host of other cards more like Arod, conditional and less progress per use.\n> \n>  \n\n \n\nThis. ^\n\n \n\nFFG has realized that player (understandably) want to use the best available cards and have become way more cautious about making cards at Asfaloths power-level without a lot more setup and/or drawback. \n\n \n\nThat said, I wish Arod was just a little better so that it could stand toe-to-toe w/ Asfaloth. Maybe something like: \"After attached character destroys an enemy, exhaust Arod to place one progress on a location OR ready attached character.\" Or add a progress to the quest. Or something--just an option so there is a reason to play it instead of Asfaloth, even though it is more restrictive. \n\nEdited December 4, 2015 by JonofPDX"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1918960","commentId":1918960,"userName":"danpoage","timestamp":1449252803,"content":"> Actually Steed of Imladris is a really great location control card, almost as good as Asfaloth but since it can only work on the active location it is just not as flexible.\n\n \n\nYes. The problem is that the designers are adding terrible travel costs to so many locations in the recent quests. Even with 3 West Road Travellers in my Spirit decks it is a real issue in 4 player games. Thror's Map is going to go back into these decks, but even with the the Map and the Steed you can still easily fill the staging area with locations when you are revealing ~6 cards per quest phase. There is also the issue of locations with negative effects while they are active - the map does not solve this, and since many of these locations have 5-6 quest points, the Steed alone won't solve them either. Targeted location control is so powerful because you never have to travel or deal with active location effects, and you can trigger it after staging. I agree with others that we will never again see a location control card approaching the power of Asfaloth on Glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1919528","commentId":1919528,"userName":"leptokurt","timestamp":1449271663,"content":"I'd like to see attachments similar to the ranger traps. Only that they work with locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1919893","commentId":1919893,"userName":"Slothgodfather","timestamp":1449293916,"content":"I haven't played with Glorfindel or Asfaloth in quite some time.  Sure, it is really powerful, but what we do instead is quest harder, make use of Northern Trackers, West Road Travellers and/or any other number of things that help manage locations.  As with the Light, I do see them as really powerful, and it did take me a very long time to build a spirit deck without Glorfindel/Light and if a Lore player joined the table I'd get them to add Asfaloth to their deck.   The only cards I've ever felt I HAD to run, regardless of the scenario, were spirit cancels.  Except just recently we've done rather well against quests just powering through them and taking the treachery/shadow cards in the face (Erestor Gondor deck paired with a mono-tactics).   To be certain, not bringing cancels has meant a very horrid and untimely death on a number of occasions, but we are each playing decks we want to play and are willing to take that risk.  \n\n \n\nAnyways, my suggestion is - just try other things anyways, even if you feel you can't do better than Glorfindel/Light/Asfaloth - because you can't really - but I wouldn't say it is necessary.\n\n \n\nI also agree with the others.  Creating a near equivalently powerful card to help others get away from using Asfaloth would likely just make you run both unless it is solved by being a different version of Asfaloth.  I'd like that since I never make use of the current version.  I'd like to see a version that puts 1 progress on up to 3 different locations.  Likely 3 cost.  Maybe dropping the \"restricted\" keyword and the cost by 1 if attached to Glorfindel.\n\nEdited December 5, 2015 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1920199","commentId":1920199,"userName":"zeromage","timestamp":1449326273,"content":"What's the problem with glorfindel being so powerful? I could understand if say if we were having this discussion about fatty Bolger, but going by the lore of tolkien glorfindel SHOULD be overpowered. I'm more mad that The lore version of glorfindel isn't super powerful. Then you'd make people have to make tough choices.\n\nIf I was the designers and I wanted to stop people from playing spirit glorfindel I'd make a neutral ally version of him that was a little less powerful than neutral gandalf. Then make people make the difficult decision of which one to include.\n\nJust a quick idea:\n\nGlorfindel\n\nNeutral: cost 4\n\n3 willpower\n\n3 attack\n\n1 defense\n\nGlorfindel does not exhaust to quest.\n\nWhen glorfindel enters play chose one of the following: play a card from your discard pile as if it were in your hand, draw one card, lower your threat by 2\n\nAt the end of the round discard glorfindel\n\nANYWAY...,\n\nPersonally, Boromirs overpoweredness bothers me more. His hero version is more powerful than glorfindel, treebeard, gandalf or elrond IMO. Which going by the source material makes absolutely no sense.\n\nEdited December 5, 2015 by zeromage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1923534","commentId":1923534,"userName":"DunedainLoreKeeper","timestamp":1449529269,"content":"I'm a 'don't like the card, just don't play it' type of player. I don't like super-powerful cards much. For me, Outlands at the time was just something for other players, no grudge, just not the cards designed for me. (Besides, if you're not removing the encounter deck from the encounter deck on turn 1, you're already limiting yourself!) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nGlorfindel is the card I dislike as the exception to the rule. I don't want to run him because on the one hand I find him too powerful and overshadowing my other heroes and deck choices which I don't like. On the other hand I DO want to use Asfaloth because it's imo, such a fundamental card in this game. You can compare Steed of Imladris, but Asfaloth is still one of the very few cards that let's you relyable explore more than 1 location per turn. So my preference not to use Glorfindel also bans me from using Asfaloth which I have always found annoying. There are alternatives of course, I could run Glorfindel without Light, or Asfaloth on another hero, or Lore Glorfindel. But while I don't mind using lesser heroes, I also feel bothered if I'm playing with cards where it's so in-your-face obvious that I'm hamstringing myself by not playing certain other cards. I cannot use Lore Glorfindel without being constantly reminded that the Spirit version is much better, especially if I then lose to something threat related. For that reason I have difficulty adding Asfaloth in a non-Glorfindel deck even though it's possible and would be a reasonable choice. And yes, I am aware how childish that is, but having a card so explicitly tell me I'm playing unnessecarily stupid just bothers me.\n\n \n\nNow obviously this is a result of my own crazy self-imposed challenges. And there's a positive side as well, for example I appreciate Idraen much more than somebody who isn't limiting their Glorfindel usage. Different cards for different people. That said, I personally HATE that a card as fundamental as Asfaloth was tied to only two heroes, one of which was really insanely good and the other actually fairly bad. \n\n \n\nGlorfindel is, in a way, actually indirectly responsable for me waiting to actually start collecting and really playing this game. I discovered the game just when he was released and it soon became clear that at that moment you where playing Dain, Glorfindel or Elrond or another similar power deck or you'd get hammered. Deckbuilding felt limited to me. Especially when Glorfindel just invalidated using most other heroes. But it's much easier now to build more off-the-beaten-track type of decks or make less super-powered heroes work than it was then. You can now make other heroes work in ways you couldn't then. Back then, I was afraid that with the release of cards like Glorfindel, most heroes before him would be wasted cardboard. For me seeing new options for synergies and the ability to 'use lesser heroes' succesfully was nessecary before I dared collecting this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1923554","commentId":1923554,"userName":"JonofPDX","timestamp":1449530147,"content":"> What's the problem with glorfindel being so powerful? I could understand if say if we were having this discussion about fatty Bolger, but going by the lore of tolkien glorfindel SHOULD be overpowered. I'm more mad that The lore version of glorfindel isn't super powerful. Then you'd make people have to make tough choices.\n> \n> If I was the designers and I wanted to stop people from playing spirit glorfindel I'd make a neutral ally version of him that was a little less powerful than neutral gandalf. Then make people make the difficult decision of which one to include.\n> \n> Just a quick idea:\n> \n> Glorfindel\n> \n> Neutral: cost 4\n> \n> 3 willpower\n> \n> 3 attack\n> \n> 1 defense\n> \n> Glorfindel does not exhaust to quest.\n> \n> When glorfindel enters play chose one of the following: play a card from your discard pile as if it were in your hand, draw one card, lower your threat by 2\n> \n> At the end of the round discard glorfindel\n> \n> ANYWAY...,\n> \n> Personally, Boromirs overpoweredness bothers me more. His hero version is more powerful than glorfindel, treebeard, gandalf or elrond IMO. Which going by the source material makes absolutely no sense.\n\n \n\nI never really understood why the new Glorfindel Ally was Spirit. Considering his place in the lore I would have thought we would get a combat-focused Tactics ally in a similar mold to the Leadership-Galadriel and Lore-Elrond allies (and the Neutral Glorfindel you're suggesting). Glorfindel bounces in @ a cost of 3 (to match Elrond and Galadriel), triggers a cool combat effect, attacks or defends and then bounces out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1925304","commentId":1925304,"userName":"zeromage","timestamp":1449617438,"content":"A really awesome tactics Glorfindel would be cool too, and also make the decision to play spirit glorfindel tough as well.  \n\n \n\nOne thing that has bothered me about spirit glorfindel is that thematically, his threat being low doesn't make a whole lot of sense.  If Glorfindel rode out towards Mordor, the enemy would definitely take notice.  \n\n \n\nAnother solution would be some very low threat spirit heroes, or at the very least other powerful spirit heroes that would make that spirit hero slot very hard to settle on just one.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1925436","commentId":1925436,"userName":"PsychoRocka","timestamp":1449624553,"content":">  \n> \n> > What's the problem with glorfindel being so powerful? I could understand if say if we were having this discussion about fatty Bolger, but going by the lore of tolkien glorfindel SHOULD be overpowered. I'm more mad that The lore version of glorfindel isn't super powerful. Then you'd make people have to make tough choices.\n> > \n> > If I was the designers and I wanted to stop people from playing spirit glorfindel I'd make a neutral ally version of him that was a little less powerful than neutral gandalf. Then make people make the difficult decision of which one to include.\n> > \n> > Just a quick idea:\n> > \n> > Glorfindel\n> > \n> > Neutral: cost 4\n> > \n> > 3 willpower\n> > \n> > 3 attack\n> > \n> > 1 defense\n> > \n> > Glorfindel does not exhaust to quest.\n> > \n> > When glorfindel enters play chose one of the following: play a card from your discard pile as if it were in your hand, draw one card, lower your threat by 2\n> > \n> > At the end of the round discard glorfindel\n> > \n> > ANYWAY...,\n> > \n> > Personally, Boromirs overpoweredness bothers me more. His hero version is more powerful than glorfindel, treebeard, gandalf or elrond IMO. Which going by the source material makes absolutely no sense.\n> \n>  \n> \n> I never really understood why the new Glorfindel Ally was Spirit. Considering his place in the lore I would have thought we would get a combat-focused Tactics ally in a similar mold to the Leadership-Galadriel and Lore-Elrond allies (and the Neutral Glorfindel you're suggesting). Glorfindel bounces in @ a cost of 3 (to match Elrond and Galadriel), triggers a cool combat effect, attacks or defends and then bounces out. \n> \n>  \n\nYeah I really would have preferred this too, especially as someone who loves Noldor and Silvan decks and characters but is not a big fan of the Erestor and discard mechanic.... (love the twins, elrond, glorfindel, galadriel etc) \n\nI really worry that the majority of noldor characters we see from this point on will be directly aimed at improving the erestor/discard theme and will not be very good in Noldor decks that do not utilize Erestor or discarding half your deck...\n\n \n\nArwen + Elven Light slightly remedies this however as you can implement a minor discard theme with just a few cards but not go the whole way with it. So long as new Noldor cards work well with her or Erestor it should be sweet. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1925437","commentId":1925437,"userName":"JonofPDX","timestamp":1449624576,"content":"> A really awesome tactics Glorfindel would be cool too, and also make the decision to play spirit glorfindel tough as well.  \n> \n>  \n> \n> One thing that has bothered me about spirit glorfindel is that thematically, his threat being low doesn't make a whole lot of sense.  If Glorfindel rode out towards Mordor, the enemy would definitely take notice.  \n> \n>  \n> \n> Another solution would be some very low threat spirit heroes, or at the very least other powerful spirit heroes that would make that spirit hero slot very hard to settle on just one.  \n\n \n\nIt would have run counter to Glorfindel's \"secrecy\"-enabling origins but I think the character would have been way more interesting if his ability was something like \"Glorfindel does not exhaust to commit to the quest. Forced: When Glorfindel commits to the quest, increase your threat by 2. Then you may lower another players threat buy 1.\"\n\n \n\nThematically it would make sense as others are less threatened as the enemy focuses on Glorfindel. Plus, as Spirit he would have had in-sphere access to effects like Elrond's Council for threat reduction so he would still be powerful. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1939692","commentId":1939692,"userName":"isthar","timestamp":1450297796,"content":"Jumping in... to leave my opinion here.\n\n \n\nI do think it would have been better, and I would not mind if it ever was errata'd, for Glorfindel to read that your threat goes up by one when he commits to the quest (regardless of exhaust). And leave Lights of Valinor alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1939734","commentId":1939734,"userName":"John Constantine","timestamp":1450298890,"content":"hrJ7NbCWdZ8.jpg [https://pp.vk.me/c628725/v628725009/29afe/hrJ7NbCWdZ8.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1939806","commentId":1939806,"userName":"13edl@m","timestamp":1450300723,"content":"I actually think Spirit Glorfindel and his repertoire is a perfect representation of the character.  If anything he should have ranger and the tactics sphere as well. Solo the nine on the river bruinen? Check.  Soloed a balrog in the first age?  Check.  Finds a wounded hobbit in the vast wilderness? Check. I think it was good that they gave him the warrior trait, but I really think he deserves the ranger trait as well.  Now... the healer trait didn't exist until recently but we all know that Glorfindel is a healer as well and if he hadn't of showed up when he did we'd all be eating under the presence of the all-seeing eye right now...Glorfindel is a heroes hero. Sorry folks I know some people hate to hear it.  \n\n \n\nHe's no more powerful than Dain though.  In fact Dain's power curve will overtake him in the later game  I have no problem with Dain mechanic-wise.  He is flat out one of the best defenders in the game, he has a passive that buffs wp and attack on ALL dwarves, he doesn't have a threat bump for the passive, his only weakness is choosing between having an awesome defender or having blanket attack buff.  He's great.  He's an enabler.  But he doesn't fit his lore.  He needs noble for a start.  I'd actually be pleased if they errata'd him for the trait, because it seems to me they're dissing Dain when they call him an un-noble king. Lore-wise I  think Thorin should have been this card though.  \n\n \n\nPersonally if I hear people complain about Glorfindel being overpowered but don't mention Dain being op I immediately dismiss them.  Really the whole thing is laughable.  The amount of people who spend time complaining about Glorfindel is weird and perhaps a little befuddled.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1940091","commentId":1940091,"userName":"PocketWraith","timestamp":1450310624,"content":"> Personally if I hear people complain about Glorfindel being overpowered but don't mention Dain being op I immediately dismiss them.  Really the whole thing is laughable.  The amount of people who spend time complaining about Glorfindel is weird and perhaps a little befuddled.  \n\nMentioning that one card is OP does not require one to mention every card that is OP. And the thing with Glorfindel is not just his power level, but also his ubiquitous nature. Dedicated Dwarf decks are nothing like as common as they used to be, but Glorfindel is still all over the place.\n\nAs far as your points about traits go, yes Dain should have the Noble trait, and so should Brand, since he's also a king. And Elrond should have the healer trait - the fact he doesn't kind of boggles my mind. I'm pretty sure they've never given a character more than three traits, but if they wanted to throw more traits at Glorfindel the way you suggest, they could've done with him what they did with Aragorn and varied the traits between different versions.\n\nEdited December 17, 2015 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1940260","commentId":1940260,"userName":"Bullroarer Took","timestamp":1450318311,"content":"I started the thread not complaining about Glorfindel's power, but the fact that he is still EVERYWHERE. You never see Dain outside of a dwarf deck, but Glory is all over the place. Hobbit Secrecy (with Glorfindel). Rohan Riders (with Glorfindel) etc. He is just so easy to slot in and he doesn't require that you build around him. I was looking for a simple way to increase his pain level. That's all.\n\nWe had the same problem with Eowyn in the first year and a half, but after the card pool grew (and Glorfindel came out) she dropped off to a reasonable rate. Glorifindel is still one of the most popular three years later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1940397","commentId":1940397,"userName":"Slothgodfather","timestamp":1450323755,"content":"I use Eowyn over Glorfindel more often than not simply because my spirit deck is typically focusing on fighting and G's extra action is wasted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1945559","commentId":1945559,"userName":"SauronTheGreat","timestamp":1450564213,"content":"This whole thing with eowyn is actually a really valid point.  We can sit here and say \"band glorfy cause he's OP!\" all we want but we don't understand how he affects the rest of the game.  Think about it.  Without Glorfy what is spirit.  Why would we use it except maybe test of will.  yes there are good spirit cards, but I would bet the hero in question is used in three fourths of spirit decks.  And anyway, you might just end up using slightly less OP eowyn three fourths of a time, and then what should we do, nerf her?  again, its the idea I brought up on my last post on this page:  There will be different levels of power of cards.  Again, if you thinks hes too OP, don't use him. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1945585","commentId":1945585,"userName":"PocketWraith","timestamp":1450566396,"content":"> This whole thing with eowyn is actually a really valid point.  We can sit here and say \"band glorfy cause he's OP!\" all we want but we don't understand how he affects the rest of the game.  Think about it.  Without Glorfy what is spirit.  Why would we use it except maybe test of will.  yes there are good spirit cards, but I would bet the hero in question is used in three fourths of spirit decks.  And anyway, you might just end up using slightly less OP eowyn three fourths of a time, and then what should we do, nerf her?  again, its the idea I brought up on my last post on this page:  There will be different levels of power of cards.  Again, if you thinks hes too OP, don't use him. \n\nYou what? Are you genuinely suggesting that without Glorfindel we wouldn't use the Spirit sphere? Because that's one of the craziest things I can recall ever reading on these forums. As far as the \"three fourths\" thing, admittedly I have a confessed bias against Glorfindel, but of my OCTGN decks which contain the Spirit sphere (discounting ones which splash it via Narvi's Belt or Celebrian's Stone), 8 contain Glorfindel, and 36 do not. I can't be bothered to count up the numbers for Eowyn right now, but I'm pretty sure without looking that she features in less than 27 of the 36 non-Glorfindel decks.\n\n \n\nI entirely agree with you on the point that if you don't like Glorfindel you should just not play him, and I follow this approach myself, but to suggest he's that much a keystone of the entire Spirit sphere is crazy talk."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1945658","commentId":1945658,"userName":"John Constantine","timestamp":1450569965,"content":"Don't talk bad things about my fav sphere :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1945875","commentId":1945875,"userName":"Bullroarer Took","timestamp":1450583067,"content":"He must be joking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1947213","commentId":1947213,"userName":"JohnGarrison1870","timestamp":1450670532,"content":"While arguments on both sides have their points, I'll just throw out my opinion that it's not too terrible to see the same heroes appear overly much.\n\n \n\nNot everyone is created equal, especially not in Arda. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nBut as far as a solution goes (for those who demand it), I wouldn't be surprised if they figure out some ways to hold him back, and others besides. For instance, I wouldn't be surprised if some future effect causes your threat to jump up for every character you have with the Noble trait, or for threat to jump for every character of a certain Willpower or higher. Just an idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1947933","commentId":1947933,"userName":"DunedainLoreKeeper","timestamp":1450710755,"content":"I think everyone's opinion on Glorfindel is influenced by the state of the Meta-game when he was released:\n\n \n\ngiphy.gif [https://media.giphy.com/media/d2Z0tMsPbCu1y276/giphy.gif] [https://media.giphy.com/media/d2Z0tMsPbCu1y276/giphy.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1948090","commentId":1948090,"userName":"Bullroarer Took","timestamp":1450714832,"content":"LOL\n\n \n\nBut it's still true!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1949361","commentId":1949361,"userName":"SauronTheGreat","timestamp":1450751555,"content":"looking back on my comment I realize that there was some unintentional exaggeration involved.  From videos I've seen and from personal decks almost all spirit decks (powerful ones anyway) include glorfy.  But my point is still valid in that every sphere has its perks.  Part of the reason this game is so good is that the spheres are mostly balanced.  Nerfy the hero in question would be like getting rid of sneak attack or dain for leadership.  Yes, it wouldn't kill the sphere totally but it just might upset the balance set up by the designers to keep the spheres balance.  Glorfinel was probably put there in the first place for that reason:  to make spirit, which hadn't gotten to many good card recently in the dwarrowdelf cycle.  So who knows, it just speculation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1949510","commentId":1949510,"userName":"PsychoRocka","timestamp":1450757789,"content":"> I think everyone's opinion on Glorfindel is influenced by the state of the Meta-game when he was released:\n> \n>  \n> \n> giphy.gif [https://media.giphy.com/media/d2Z0tMsPbCu1y276/giphy.gif] [https://media.giphy.com/media/d2Z0tMsPbCu1y276/giphy.gif]\n\nThis should have won that lotr lcg meme competition! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1949596","commentId":1949596,"userName":"Ecthelion III","timestamp":1450761652,"content":"I didn't play the game back in that day... what's the joke?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1950004","commentId":1950004,"userName":"DunedainLoreKeeper","timestamp":1450785327,"content":"> I didn't play the game back in that day... what's the joke?\n\nAs I mentioned in an earlier post. The annoying thing about Glorfindel was that for many decks he made the difference between working well or sucking. You HAD to include him to get, say, Secrecy or Caldara working. And in other decks he was just waay better than any alternative. Some people are mostly sour about the way he was force-fed to us or liked him initially but got bored that they always used him. In the current cardpool, there is no deck that NEEDS Glorfindel, so his dominance is over and ther eis no real reason to dislike him as much as many (myself included) still do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1950081","commentId":1950081,"userName":"Lepusek","timestamp":1450788957,"content":"I'm looking forward to get him for Christmas. will be great for solo play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1950087","commentId":1950087,"userName":"13edl@m","timestamp":1450789241,"content":"Actually, even though Spirfindel has good stats, low threat, good action advantage, and potentially great leverage on location heavy APs I think he's still less ubiquitous than Eleanor.  People who don't play multiplayer won't readily understand this statement.  But any group of three or four players know how much more important Eleanor is than Glorfindel to player success.  She may not have as much individual synergy in a given deck(in fact she very often has no synergy other than her sphere) but is necessary to keep treacheries from hosing the players EVERY turn.  Her threat is similarly low like Spirfindels, but the only thing you can readily spec her for is defense with a shield.  Beyond that she just kind of gets in the way of individual deck synergy. \n\n \n\nSay what you want about Spirfindel, but his ubiquity springs from his uber-synergistic qualities.  Not a statistical mandate of the encounter deck.  Playing with three people?  On average your going to get hit with a nasty quest disrupting global effect EVERY turn, unless you play Eleanor.  I was actually experimenting with spirit Pippin in a threat dropping deck, but I had forgotten that in three and four player one must carry the burden of Eleanor. \n\n \n\nLooking ahead to the coming AP, I know there's an emphasis on Unique allies.  I think an exact copy of Eleanor as an ally would do wonders for this issue.  Hell I'd be happy with a copy that had two hit-points and 0's in every stat so long as it kept the ability.  The only other multiplayer option I've seen is utilizing decks with scout ahead and the door is shut. I haven't tried it, but the limit one per deck rule makes it look like a very involved strategy if you want to use it for consistent treachery nullification.  Has anyone had success with this sort of strategy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1951601","commentId":1951601,"userName":"Fluke Starbucker","timestamp":1450829635,"content":"Guys, You are overthinking it.  Just give Glorfindel the card text... \"Limit one per deck\".  Problem solved!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1951605","commentId":1951605,"userName":"PsychoRocka","timestamp":1450829848,"content":"You mean Light of Valinor right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1951606","commentId":1951606,"userName":"Bullroarer Took","timestamp":1450829920,"content":"I don't think he does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1951627","commentId":1951627,"userName":"Fluke Starbucker","timestamp":1450830995,"content":"I was just being funny.  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1951663","commentId":1951663,"userName":"PsychoRocka","timestamp":1450833304,"content":"Edit: Ok that clearly went over my head  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited December 23, 2015 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1964204","commentId":1964204,"userName":"isthar","timestamp":1451578289,"content":"> A couple of things:\n> \n> \n> \n>  \n> \n> 3. To me, this argument is a bit more complex than \"if you don't like him, don't use him\". The problem is a systemic one, and it has to do with the way that the metagame has formed around these cards for everything released since the Dwarrowdelf cycle. It's all well and good to say \"just stop using Glorfindel/LoV/Asfaloth\", but if new quests are designed around the assumption that low-starting threat, cheap readying/action advantage, and powerful location control are all available, then I am basically handicapping myself not to at least consider these cards for the harder quests. I can't speak for others, but I have found The Battle of Carn Dum solo to be very difficult. I want to try different decks, but the concern that I have with these more challenging quests is that they will push me right back to these same arguably-broken staples. Maybe there is another path, using cards like Thror's Map, threat control and questing via Galadriel, and other more interesting tricks. I certainly hope that there are alternatives, because even if they never again print something as broken as Spirit Glorfindel and his toys, he can still warp the metagame into an unwholesome shape.\n\n \n\nExactly! That's my worry about the latest difficulty ramp. I feel somewhat obliged to play \"the only decks that can beat things\", and LoV Glorfindel w/ Asfaloth is sadly a big requirement these days... although I will point at \"Location Lock\" as being the root cause; I need glorfindel and his horse due to locations just piling up and spiraling out of control if you cannot quest enough... we need more progress-placing cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1964260","commentId":1964260,"userName":"NathanH","timestamp":1451579785,"content":"I guess the designers might feel they can't print another card with a big repeatable progress-placing effect because you'd just use both it and Asfaloth. Perhaps a new version of Asfaloth that is not as strong as current Asfaloth on Glorfindel but is more widely applicable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1964909","commentId":1964909,"userName":"JohnGarrison1870","timestamp":1451594494,"content":"To some extent problems such as this are inevitable when a game lasts for any length of time.\n\n \n\nThere will always arise some cards that are indisputably better than others in their category, and will forever after influence the game.\n\n \n\nThe only other option is to make sure every card ever produced is perfectly balanced. Even if this were humanly possible, it would result in a situation where there would be little reason to choose one strategy over another. It'd make for a rather dull game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1965355","commentId":1965355,"userName":"John Constantine","timestamp":1451613932,"content":"> To some extent problems such as this are inevitable when a game lasts for any length of time.\n> \n>  \n> \n> There will always arise some cards that are indisputably better than others in their category, and will forever after influence the game.\n> \n>  \n> \n> The only other option is to make sure every card ever produced is perfectly balanced. Even if this were humanly possible, it would result in a situation where there would be little reason to choose one strategy over another. It'd make for a rather dull game.\n\nLong story short, I don't agree with you. To keep game not dull is a quest's job, not player's card pool. What balanced card pool provides is not dullnes, but choice that you actually make, not the designer, who first create a powerhouse card and then balance their stuff around it, essentially forcing your choice (if you wanna succeed that is).\n\nEdited January 1, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1965562","commentId":1965562,"userName":"zeromage","timestamp":1451631240,"content":"I've succeeded with tons of spirt decks without glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1965591","commentId":1965591,"userName":"JohnGarrison1870","timestamp":1451633090,"content":"> Long story short, I don't agree with you. To keep game not dull is a quest's job, not player's card pool. What balanced card pool provides is not dullnes, but choice that you actually make, not the designer, who first create a powerhouse card and then balance their stuff around it, essentially forcing your choice (if you wanna succeed that is).\n> \n>  \n\n \n\nSo why even have a player's card pool at all? Is the only purpose of a varied player card pool to allow the designers the flexibility of creating quests? That suggests there will be only a few (or even only one) \"optimal\" player deck for each quest, which seems like a rather dull way of looking at the game. But to each their own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/194770-light-of-valinor/?do=findComment&comment=1965611","commentId":1965611,"userName":"John Constantine","timestamp":1451635474,"content":">  \n> \n> > Long story short, I don't agree with you. To keep game not dull is a quest's job, not player's card pool. What balanced card pool provides is not dullnes, but choice that you actually make, not the designer, who first create a powerhouse card and then balance their stuff around it, essentially forcing your choice (if you wanna succeed that is).\n> > \n> >  \n> \n>  \n> \n> So why even have a player's card pool at all? Is the only purpose of a varied player card pool to allow the designers the flexibility of creating quests? That suggests there will be only a few (or even only one) \"optimal\" player deck for each quest, which seems like a rather dull way of looking at the game. But to each their own.\n\nNo. Not flexibility for the designers to create quests (whch is a good thing too), but a flexibility for player to build a deck that will be viable to some extent. With unbalanced pool as current, there some cards that hurt you when you don't take them (because they are powerhouses, and when designers design quest, they keep those cards in mind, not the weaker ones), and there are cards that hurt you when you take them, because their power level and usefulness is significanlty below the power level quests are aimed to challenge, so you're literally handicapping yourself. In a perfect world with balanced card pool, that thing won't exist, and that would make for a much more diverse and enjoyable experience, not a dull one."}]}