{"url":"https://community.fantasyflightgames.com/topic/195213-every-time-i-play-this-game-another-question/","title":"Every time I play this game... another question...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/195213-every-time-i-play-this-game-another-question/?do=findComment&comment=1922794","commentId":1922794,"userName":"shosuko","timestamp":1449506560,"content":"I sometimes wonder if I'll ever really learn this game, or play it correctly lol.\n\n \n\nSo at the start of a game during setup, you are allowed to respond to things revealed from the deck.\n\n \n\nBut - I just noticed - you don't get resources during setup...\n\n \n\nIs this true?  You don't get any resources to respond to setup?\n\n \n\nbtw - all this time I also didn't realize I drew at the start of the game...  I wonder if that 7th card could have turned some games around <_< [//content.invisioncic.com/Mfantflight/emoticons/default_dry.png] lol\n\nEdited December 7, 2015 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195213-every-time-i-play-this-game-another-question/?do=findComment&comment=1922841","commentId":1922841,"userName":"GrandSpleen","timestamp":1449507993,"content":"Yep that's correct.  Although if you play \"easy mode\" you do get a resource (I forget the timing of it, whether you get that resources before or after following setup instructions).  Eleanor could help you respond to treacheries.\n\n \n\n\"Shadow effects,\" by the way, refers to the effects that are at the bottom of some encounter cards, under the skull icon, which you only resolve when they are dealt to an enemy during an attack.  You were probably referring to \"when revealed\" effects, like the ones on Treachery cards. Seems minor, but important distinctions in terminology for figuring out which card cancels what!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195213-every-time-i-play-this-game-another-question/?do=findComment&comment=1924696","commentId":1924696,"userName":"isthar","timestamp":1449598735,"content":"If you play easy mode, yes, you have resources before setup.\n\n \n\nPersonally I always play in easy mode setup (start with a resource on each hero); and I play with the gold encounter cards not removed for a few tries, and go easy-mode as needed if the quest is too bonkers hard."}]}