{"url":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/","title":"Escape from Dol Guldur setup question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1924752","commentId":1924752,"userName":"cpmorgan","timestamp":1449600231,"content":"When a \"when revealed\" effect appears during the setup in dol guldur (you reveal and add on card from the encounter deck) is it resolved normally? Do I have to reveal another card until an enemy or location appears? Or I just leave the objective empty? In addition if it is resolved can I play response actions from heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1924760","commentId":1924760,"userName":"DukeWellington","timestamp":1449600537,"content":"I assume you are talking about treachery cards. Yes treachery cards resolve normally. When revealing a treachery card to fulfill the \"guarded\" keyword, you just resolve the effect and discard the treachery. The guarded card does not require an enemy or location. Yes, you can use hero response abilities during setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1925889","commentId":1925889,"userName":"cpmorgan","timestamp":1449661067,"content":"ok this is clarified then.... how about the when revealed effects on the enemies... Do they resolve also?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1926000","commentId":1926000,"userName":"Lecitadin","timestamp":1449669138,"content":"Because the resource phase hapens after you setup the encounter deck and the quest cards, When revealed effects cannot be canceled by cards that cost resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1926033","commentId":1926033,"userName":"PocketWraith","timestamp":1449670723,"content":"> ok this is clarified then.... how about the when revealed effects on the enemies... Do they resolve also?\n\nYes. The guard cards for the objectives are revealed, and so any When Revealed effects will trigger (as will the Surge and Doomed keywords if relevant, though I can't recall off hand if Surge happens in Dol Guldur at all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1931934","commentId":1931934,"userName":"The Grand Falloon","timestamp":1449949886,"content":"I know there are some Surge effects, and I have a similar question.  As I was setting up, i had my three objectives, and started placing the three Quest cards.  The first was a location of some sort (not important right now), the second was a Treachery, \"Eyes of the Forest.\"  The third was Endless Caverns, with Doomed 1 and Surge.  Now, there are two ways I could see to play this.  The first would be that the Treachery resolves as it is placed, leaving the Objective open, then the Surge would trigger as the third card is placed, and the resulting band of orcs (the next card) is placed on the objective.  The other possibility is that all the cards trigger simultaneously, leaving the orcs on the side and the objective open for business."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1931952","commentId":1931952,"userName":"GrandSpleen","timestamp":1449951064,"content":"You'd end up with this:\n\n \n\n1st card reveal- location, it guards the first objective\n\n2nd card reveal - treachery, resolve it and discard.  This was the 2nd objective card's encounter, so this one is now unguarded and will not get attached to any other encounter cards.\n\n3rd card reveal- Endless Caverns, it will attach to the 3rd objective.\n\nSurge - reveal the next card but don't attach it to anything.  You surge into the orcs.\n\n \n\nYou now have 2 guarded objectives, both are guarded by locations.  You also have some orcs in the staging area, and one unguarded objective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1931954","commentId":1931954,"userName":"PocketWraith","timestamp":1449951111,"content":"The only cards which guard the objectives are the ones specifically revealed as guards for them. Any additional cards revealed, by Surge or other effects, are simply added to the staging area as normal with no regard for the objectives."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1932087","commentId":1932087,"userName":"TwiceBorn","timestamp":1449958387,"content":"I had previously asked a similar question of the Devs, and the answer was pretty much as GrandSpleen and PocketWraith explained. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/195331-escape-from-dol-guldur-setup-question/?do=findComment&comment=1932476","commentId":1932476,"userName":"The Grand Falloon","timestamp":1449987965,"content":"Okay, I completely misunderstood how Guarded worked.  I thought that when cards were played while an empty Guarded objective was in play, that they were played onto the objective."}]}