{"url":"https://community.fantasyflightgames.com/topic/195634-guarded/","title":"Guarded","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/195634-guarded/?do=findComment&comment=1931034","commentId":1931034,"userName":"Julia","timestamp":1449880315,"content":"Very quick question about how to resolve a Guarded card (sorry, I know it's kinda noobish as a question, but I was re-reading the rulebook today and I found two paragraphs that seem to be contradictory). Ref: pag 24 of the rules.\n\n \n\nSomewhere down the second paragraph of the keyword's description, we read:\n\n \n\nAn encounter card attached to a guarded objective is dealt with in the following method, depending on its card type:\n\nEnemy: The enemy leaves play, either by being defeated or as the result of a card effect.\nLocation: The location leaves play, either by being fully explored or as the result of a card effect.\nTreachery: The treachery’s effects resolve, or are canceled. (Treachery cards are immediately triggered when they are revealed.)\n\n \n\nThis seems to imply that in case of a Guarded card + Location, when you travel to that Location, you move the Location to the active location spot, and below the Location you have the Guarded card (same for Enemy + Guarded card, the enemy moves to your play area and the Guarded card follows). Once the Location is explored (the enemy defeated) the Guarded card is free from encounters.\n\n \n\n(this is the way we've been playing so far)\n\n \n\nBUT\n\n \n\nIn the first paragraph (emphasis mine) we read:\n\n \n\nThe objective cannot be claimed as long as any encounter card is attached. Once that encounter is dealt with, the objective remains in the staging area until it is claimed.\n\n \n\nThe \"remains\" is literally driving me crazy :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] How can it remain in the staging area if it moved with the enemy / the location? And if it's not to be moved with the enemy / location, then you need to remember which enemy was to protect which card if you have multiple Guarded in play?\n\n \n\n*confused*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195634-guarded/?do=findComment&comment=1931049","commentId":1931049,"userName":"cmabr002","timestamp":1449880979,"content":"The guarded card is not attached to the location.  The location is attached to the guarded objective so even if you travel to a location, the guarded objective would remain in the staging area.  Although, it is helpful, as a memory aid, to move the two cards together, so as to not forget which location is guarding the objective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195634-guarded/?do=findComment&comment=1931440","commentId":1931440,"userName":"Sin21","timestamp":1449911183,"content":"> The guarded card is not attached to the location.  The location is attached to the guarded objective so even if you travel to a location, the guarded objective would remain in the staging area.  Although, it is helpful, as a memory aid, to move the two cards together, so as to not forget which location is guarding the objective.\n\nI think this is right. There is no statement that the guarded objective does leave the staging area when you move its attached card.\n\nNow we should contact  FFG to provide special Tokens, so we dont become confusedif more guarded objectives are in play. Jay.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195634-guarded/?do=findComment&comment=1931490","commentId":1931490,"userName":"TwiceBorn","timestamp":1449917957,"content":"In this case, I just think \"remains\" = goes back to the staging area (I always played it like you, Julia, encounter/location card attaches to the guarded objective and the objective follows the location when it becomes the active location... I'm not convinced that a guarded objective does not leave staging when you move its attached card).\n\nEdited December 12, 2015 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195634-guarded/?do=findComment&comment=1931570","commentId":1931570,"userName":"Julia","timestamp":1449926591,"content":"Thanks guys. Yeah, I'm kinda thorn on how to play this as Twice said: if I leave the \"guarded\" in the staging, it's like I'm removing its attachment, and this feels a little unusual, since no attachment should mean you can claim it. Having an attachment that is not attached to the card looks at least unusual"}]}