{"url":"https://community.fantasyflightgames.com/topic/195835-pathless-country/","title":"Pathless Country","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/195835-pathless-country/?do=findComment&comment=1934275","commentId":1934275,"userName":"Imperitor","timestamp":1450106683,"content":"I just to clarify what happens when this card comes up as a shadow card to make sure I have it right. It seems very over powered and we often lose the game immediately because of it. Is what I have below correct for a 2-player game?\n\n \n\nPlayer 1 has two enemies engaged with him (enemy A and B), Player 2 has none.\n\n \n\n- Enemy A attacks player 1 (shadow card is Pathless Country) and resolves its attack.\n\n- Because of Pathless Country enemy A engages and attacks player 2 (with new shadow card) and resolves it's attack.\n\n- Enemy B attacks player 1.\n\n- Enemy A attacks player 2 (with new shadow card) and resolves its attack.\n\n \n\nAssuming all the other shadow cards have no effect, is this correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195835-pathless-country/?do=findComment&comment=1936999","commentId":1936999,"userName":"GrandSpleen","timestamp":1450191783,"content":"I do not think Enemy A will attack again.  I looked for an official answer and I'm pretty sure I've seen one before, but I couldn't find it.\n\n \n\nI think the official ruling went something like this: enemies get one attack each turn.  If the enemy has attacked and then changes engagement, it will not attack again (save through a card effect).  If it changes engagement before attacking, it will attack the new player.  \n\n \n\nCould be wrong!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/195835-pathless-country/?do=findComment&comment=1937249","commentId":1937249,"userName":"cmabr002","timestamp":1450197220,"content":"I believe this is what you are referring to GrandSpleen.\n\n \n\nFAQ:\n\n \n\n>  \n> \n> Q: When an enemy that has already made an attack engages a new player during the combat phase, does it make another attack?\n> \n>  \n> \n> A: Not unless it is directed to by card effect.\n\n \n\nHowever, I think they might have viewed the question as \"When an enemy that has already made an attack engages a new player during the combat phase, does it make another attack immediately following engaging\" so I'm not entirely sure how to interpret the part of the FAQ i quoted or if it is actually relevant or not to Imperitor's question.\n\n \n\nThe same question could be asked for Westfold Outrider.  If Player 2 triggers Westfold Outrider after an enemy already attacked Player 1, then would it also attack Player 2?  I think the FAQ is trying to make it clear that it would not attack again if you were to do this (obviously you could just wait until player 2's get attacked step is over, but maybe there is some scenario where you would want to do it)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195835-pathless-country/?do=findComment&comment=1937306","commentId":1937306,"userName":"GrandSpleen","timestamp":1450198220,"content":"Oh there it was, right in the FAQ.  Silly me.  Yep, that's what I was looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/195835-pathless-country/?do=findComment&comment=1938964","commentId":1938964,"userName":"Imperitor","timestamp":1450278615,"content":"Thanks! Missed that from the FAQ. That makes things a lot easier.\n\nEdited December 16, 2015 by Imperitor"}]}