{"url":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/","title":"Do Reanimated Dead enemies &quot;engage&quot; you?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=1945525","commentId":1945525,"userName":"GrandSpleen","timestamp":1450562650,"content":"The wording in the description of the Reanimated Dead in The Dread Realm seems to me to suggest that we should not trigger engagement effects (Mablung, Faramir) after reanimating a card.  What do think?  Here is the description from the rule sheet, my emphasis:\n\n \n\n----\n\nReanimated Dead\n\nMany encounter cards in The Dread Realm scenario instruct players to \"reanimate\" a card.  When a player is instructed to reanimate a card, place that card facedown in front of that player, as if it had just engaged that player from the staging area.  Facedown cards that have been reanimated are called \"Reanimated Dead\" and act as if they are Undead enemy cards with 0 engagement cost, 2 threat, 2 attack, 2 defense, and 2 hit points.  As a reminder, each quest card has the text: \"Reanimated Dead are Undead enemies with 2 threat, 2 attack, 2 defense, and 2 hit points.\"  If a Reanimated Dead is destroyed or leaves play for any other reason, it is placed in its owner's discard pile.\n\n-----\n\n \n\nIt is the part that says \"as if it had just engaged\" which makes me think we are not meant to reap the benefit from player card effects that trigger off of engagement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=1945563","commentId":1945563,"userName":"PocketWraith","timestamp":1450564792,"content":"Really? I would interpret that as meaning they do trigger them. When an enemy has just engaged you is when you trigger engagement effects, so if you place something as if it just engaged you, you are at the same point in the sequence of play. Pretty sure all player card engagement effects trigger after an enemy engages you rather than when in any case.\n\nAlso, though the wording is different (to account for the fact they're facedown player cards rather than regular enemies), it's effectively the same as an enemy which enters play engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=1945730","commentId":1945730,"userName":"GrandSpleen","timestamp":1450573603,"content":"Yeah... you're probably right. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=1945738","commentId":1945738,"userName":"cmabr002","timestamp":1450574026,"content":"> Really? I would interpret that as meaning they do trigger them. When an enemy has just engaged you is when you trigger engagement effects, so if you place something as if it just engaged you, you are at the same point in the sequence of play. Pretty sure all player card engagement effects trigger after an enemy engages you rather than when in any case.\n> \n> Also, though the wording is different (to account for the fact they're facedown player cards rather than regular enemies), it's effectively the same as an enemy which enters play engaged with you.\n\n \n\nI agree that you should trigger engagement effects.  It does not say \"they are considered to be engaged\" which is different than \"as if it had just engaged you\".\n\n \n\nSection (1.50) says the following:\n\n \n\n> In order for a player to engage an enemy, the enemy card must physically enter his play area.\n\n \n\nAnd based on your description of reanimate, it seems it at least meets that criteria.  Whether or not \"as if it had just engaged you\" meets true engagement criteria, I guess I can't be certain, but there are cards like Scroll of Isildur and the Raven deck that use the same text and I am not sure how those rules apply here. \n\n \n\nUnder the argument that it hasn't actually engage a player (and therefore you couldn't trigger engagement effects), you could also argue that the Spirit version of Scroll of Isildur could play Tale of Tinuviel or Lords of Eldar from your discard pile because even though the \"Scroll of Isildur\" says \"as if it were in your hand\" it wasn't actually from your hand and was still played from your discard pile.  I don't think that is intended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=1945909","commentId":1945909,"userName":"DukeWellington","timestamp":1450584659,"content":"I think the confusion is in the phrase \"as if it just engaged that player\" but I think the confusion is cleared up if you believe,as I do, that the intended meaning of the word order was to communicate that you are to treat them \"as if they just engaged you FROM THE STAGING AREA\". When you see the phase \"from the staging area\" included in the text I can see no way to interpret that without concluding that you trigger engagement effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196299-do-reanimated-dead-enemies-engage-you/?do=findComment&comment=2128919","commentId":2128919,"userName":"Denison","timestamp":1459191666,"content":"I searched for this topic because I was uncertain if Haldir's ability was disallowed in the first round or not. I was playing that Haldir could not snipe in round 1.  Starting round 1 with 4 resources in an all-Tactics deck featuring Mablung is a strategy I am going to try immediately against the Dread Realm."}]}