{"url":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/","title":"When will we received POD expansions? A request from Spain","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1945982","commentId":1945982,"userName":"ruferto","timestamp":1450590077,"content":"Dear FFG friends,\n\n \n\nToday is December 20th, 2015 and we, spanish players, feel abandoned by FFG. \n\n \n\nAll expansions published in english are available in spanish (at the same time that original edition), but POD expansions. \n\n \n\nWe cannot enjoy nightmare pod expansions of Dwarrowdelf, Against the shadow and The Ring-Maker Cycles yet, or POD gencon expansions of last two years.\n\n \n\nEdge, spanish editor of FFG games, replied to community on his official forums and it looks like there was a saturation problem with your printer system. It cannot release as quick as it is needed. \n\n \n\nI don't know if this issue is related to spanish edition or there is another foreign edition with the same issue. \n\n \n\nPlease, FFG guys, FFG friends, we love LOTR LCG and we want to play nightmare decks and POD aventures.\n\n \n\nThank you so much.\n\nEdited December 20, 2015 by ruferto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946027","commentId":1946027,"userName":"John Constantine","timestamp":1450593778,"content":"Um, let me get it straight. You, the guys who live in a country which gets LotR releases faster than any other country of the world (even before the official site posts the release article, hence the spanish spoilers before the english ones), feel \"abandoned\" by FFG because you don't get POD in your language? I'm not gonna talk about how long it takes for LotR stuff to reach the place I live and how there'll never be a version of it in my native language, I'll just ask: if you want to play those pods/nightmares so bad - why don't you simply order their versions in english?\n\nEdited December 20, 2015 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946076","commentId":1946076,"userName":"ruferto","timestamp":1450597363,"content":"Why should we have to do that? That's not the solution to this issue. All the POD pending to be released have been translated. It's FFG who is not releasing. And that's because POD system is different from normal printer system. They should improve POD system. There are many languages and many expansions to be released.\n\nEdited December 20, 2015 by ruferto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946078","commentId":1946078,"userName":"John Constantine","timestamp":1450597761,"content":"Because you want, as it may seem, pods for your game and currently they are not seem to be avialbale in the way you want them? Luxury spoils, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946082","commentId":1946082,"userName":"ruferto","timestamp":1450598353,"content":"It's easy. The way we want is not 10 months delayed. \n\nI don't understand why I should buy english edition if there is a local editor that is paying a license and making a great job translating the game.\n\nEdited December 20, 2015 by ruferto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946114","commentId":1946114,"userName":"koriakin97","timestamp":1450603160,"content":"Where I live (Poland) we don't have PODs from second half of Dwarrodelf and later plus Saga nightmare, barrows blue mountains and bree and we don't have 2 last packs of ring-maker and whole Eriador cycle. It's a delay of 13 months (and there are no signs that this cards will be released). So you are quite lucky in Spain :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946120","commentId":1946120,"userName":"John Constantine","timestamp":1450603728,"content":"> It's easy. The way we want is not 10 months delayed. \n> \n> I don't understand why I should buy english edition if there is a local editor that is paying a license and making a great job translating the game.\n\nIt's easy. Your local editor doesn't have the stuff you want in your language. The only thing you can do about it is buy the english version. Complaining on forums about it won't solve a thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946273","commentId":1946273,"userName":"Narwe","timestamp":1450617802,"content":"Hi, spanish player here. Ruferto and I have discussed this before in the boards of the spanish editor of the game (Edge), let me explain my view on this problem since it's a bit different (and shared by other players of the cummunity too).\n\n \n\n \n\nPart of the players in Spain have some complains about how Edge manage the game, but the only problem that had a proper justification is PoDs. Anytime we go to their message boards with a new item for our complains list, they just say they can do nothing due to the PoDs queue, but they do nothing about the things they could solve by themselves.\n\n \n\nWhat we desperately want now is that Edge updates the FAQ. Spanish FAQ is stuck in version 1.4, published in April 30th, 2013 (if capital numbers existed, I'd use them here). Since the game came out, we only have had 3 FAQ: 1.0, 1.2, and currently 1.4 (matching the USA versions). To make this problem worse, there are a lot of mistakes added to many cards when they were translated, for instance: \"Mirror of Galadriel\", sais \"Acttion: Exhaust Mirror of Galadriel to search the top 10 cards of your hand...\" instead of deck, types of cards changed from \"objective-location\"  to \"objective-ally\", or other cards reduce the defence of the player, instead of the character. This is very annoying, first you have to notice them, and then realize that there is something wrong, and then instead checking your FAQ for good, you need to have access to the Internet before continuing playing to check online for the correct version in english, translating medieval words, traits and term of the game.\n\n \n\nWe also have another complain about a tournament kit that was never announced (Q1 2014), recently sold in a touranment kits clearence.\n\n \n\nSo, instead pushing FFG for PoDs, I'd like that FFG pushes Edge to solve these issues. If anyone at FFG can let us know if they can help us, we would really appreciate it.\n\n \n\nP.S: Excuse my english if you find it hard to understand :/ I actually use it just to check lolcats and translation mistakes of my LCGs cards on the Internet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946703","commentId":1946703,"userName":"ruferto","timestamp":1450644077,"content":"I think I did not explain well.\n\n \n\nMy local editor (Edge Ent) sent spanish translation when it was requested by FFG. FFG has not print spanish cards yet. \n\nMy local editor explained in spanish official forums there is a big problem with printer queue for POD system. It's not only for spanish edition and it affects other foreign editions as well.\n\n \n\nI can buy english editions, of course. But this is not a solution. FFG should fix this issue with POD system, because there are foreign editors that are paying licenses and making translations.\n\n \n\nFFG should, at least, answer to community explaining when they will fix POD system. Not just for spanish players, but all players affected by this system.\n\n \n\nAnd yes, I could buy english editions, but I don't want. Because I have a local editor. It would be fun if I buy FFG english packs when FFG is not making his job releasing my local edition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1946744","commentId":1946744,"userName":"John Constantine","timestamp":1450646636,"content":"I can't see how this thread helps the matter. If you want to make a statement - contact them directly. They are barely reading the forums, and those who does read them - have 0 to do with the PoD stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1948616","commentId":1948616,"userName":"asfaloth","timestamp":1450729212,"content":"> Um, let me get it straight. You, the guys who live in a country which gets LotR releases faster than any other country of the world (even before the official site posts the release article, hence the spanish spoilers before the english ones), feel \"abandoned\" by FFG because you don't get POD in your language? I'm not gonna talk about how long it takes for LotR stuff to reach the place I live and how there'll never be a version of it in my native language, I'll just ask: if you want to play those pods/nightmares so bad - why don't you simply order their versions in english?\n\n \n\nTo put some things together:\n\n \n\nWe do not always get releases faster than anyone. Normally we get them at the same week than US. It is true that sometimes (very sporadic) we get some Adventure Packs one week faster but it is equally true that sometimes (very sporadic again) we get them one or two weeks afterwards or even more.\n\n \n\nThe problem that it is been discussed here is that FFG is directly in charge of the printer who prints the international Pod for other countries. The spanish distributor has nothing to do here because the solution is not in its hands. Is an FFG's issue. There is a delay of several months, even years I'd dare say. And we as players need a solution and some information on it, no matter what country we come from.\n\n \n\nEdited December 21, 2015 by asfaloth"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1948628","commentId":1948628,"userName":"John Constantine","timestamp":1450729895,"content":"I was just enraged, as someone who gets all the releases later by a couple of months on a regular basis without any translation or whatsoever and at an inflated cost, by claim of someone who gets most of releases ahead of time that they feel \"abandoned\" by the FFG. You don't know the bad side of it, mate :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1948630","commentId":1948630,"userName":"Bullroarer Took","timestamp":1450729969,"content":"FFG is almost no more.  It becomes Asmodee North America soon if it hasn't already."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1948663","commentId":1948663,"userName":"Gizlivadi","timestamp":1450730951,"content":"> I was just enraged, as someone who gets all the releases later by a couple of months on a regular basis without any translation or whatsoever and at an inflated cost, by claim of someone who gets most of releases ahead of time that they feel \"abandoned\" by the FFG. You don't know the bad side of it, mate :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nSame here. Only in the past few months one of our local stores decided to bring this lcg now that there is something of a community. All the years previous to that I had to order them personally, and translated versions of anything but the core set are faraway dreams to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1949474","commentId":1949474,"userName":"PsychoRocka","timestamp":1450756466,"content":"I have to say I agree with JohnConstantine.\n\nAs crappy as it is that you guys can't get POD in your native language the vast majority of people cannot get anything from this game in their native language and so are forced to get the entire game in english not JUST the POD's. \n\nAlso you guys do indeed seem to get most packs before anyone else including the US which just makes no sense whatsoever considering it is an american based company. \n\n \n\nI really wish this game came out in every country at the same time like MTG does. I usually have to wait between 2 and 4 weeks for a product to come out here in Australia after it becomes available in the US. Sometimes a product never makes it (certain nightmare quests or POD) and I then have to buy it online through the FFG website that charges like almost a hundred bucks for postage or whatever or from someone on ebay that has a spare copy or whatever. Pretty sure that pretty much everyone except those in the US has to go through hoops on occasion to get their hands on certain releases for this game, it sucks but the game is just not that big at the end of the day (at least compared to other card games like magic etc) and so we all have to just deal with these issues. \n\n \n\nThat being said I do hope your issue is resolved and that you do get POD scenarios in Spanish but there are many others in far worse situations for sure and FFG can sure take a while to get issues sorted so maybe don't hold your breath "},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1949975","commentId":1949975,"userName":"Lepusek","timestamp":1450783699,"content":"czech here. we have core set in native language and maybe dwarrowdelf max. I personally prefer the English version cuz i dont trust czech company (blackfire) to translate and deliver new stuff. so stop whine who cares "},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950001","commentId":1950001,"userName":"13nrv","timestamp":1450785216,"content":"> I think I did not explain well.\n> \n>  \n> \n> My local editor (Edge Ent) sent spanish translation when it was requested by FFG. FFG has not print spanish cards yet. \n> \n> My local editor explained in spanish official forums there is a big problem with printer queue for POD system. It's not only for spanish edition and it affects other foreign editions as well.\n> \n>  \n> \n> I can buy english editions, of course. But this is not a solution. FFG should fix this issue with POD system, because there are foreign editors that are paying licenses and making translations.\n> \n>  \n> \n> FFG should, at least, answer to community explaining when they will fix POD system. Not just for spanish players, but all players affected by this system.\n> \n>  \n> \n> And yes, I could buy english editions, but I don't want. Because I have a local editor. It would be fun if I buy FFG english packs when FFG is not making his job releasing my local edition.\n\n \n\nThe French player have exactly the same issue and complaint ... We have the same answer from Edge.\n\n \n\nJust one difference with spanish players : We have AP and deluxe between 2 weeks and one month after America.\n\nAs spanish players, we haven't the last two years of POD !\n\nEdited December 22, 2015 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950201","commentId":1950201,"userName":"asfaloth","timestamp":1450792872,"content":"> czech here. we have core set in native language and maybe dwarrowdelf max. I personally prefer the English version cuz i dont trust czech company (blackfire) to translate and deliver new stuff. so stop whine who cares \n\n \n\nAgain, the complaint is not about the distribution and the releasing dates in Spain when they are following the spanish distributor capacities and schedule.\n\n \n\nThe problem is that FFG is who must print the PODs in our language and they do not want to do it. We are getting everything we need from our local distributor in time and the only piece of the puzzle that is failing is that which must be managed exclusively by FFG. They have everything is needed to begin the printing process and they do not start it. So we are asking for some information and solutions here, at FFG´s home.\n\n \n\nI understand that some of you find this problem insignificant next to yours and you can live with the multiple delays you have got used to in your countries. But we prefer to make some noise to solve this issue instead of resigning ourselves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950218","commentId":1950218,"userName":"John Constantine","timestamp":1450793410,"content":"Making some noise to solve your problem is OK (if it reaches the target ears, which in this case I doubt). But making such statement: \n\n> Today is December 20th, 2015 and we, spanish players, feel abandoned by FFG. \n\nGiven the circumstances is absurd. You're the most supported country LotR LCG-vise. Not having PoD's in your native language is a minor disadvantage which I could totally live with if I were you and had all other privileges you're having. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950220","commentId":1950220,"userName":"asfaloth","timestamp":1450793537,"content":"> I have to say I agree with JohnConstantine.\n> \n> As crappy as it is that you guys can't get POD in your native language the vast majority of people cannot get anything from this game in their native language and so are forced to get the entire game in english not JUST the POD's. \n> \n> Also you guys do indeed seem to get most packs before anyone else including the US which just makes no sense whatsoever considering it is an american based company. \n> \n>  \n> \n> I really wish this game came out in every country at the same time like MTG does. I usually have to wait between 2 and 4 weeks for a product to come out here in Australia after it becomes available in the US. Sometimes a product never makes it (certain nightmare quests or POD) and I then have to buy it online through the FFG website that charges like almost a hundred bucks for postage or whatever or from someone on ebay that has a spare copy or whatever. Pretty sure that pretty much everyone except those in the US has to go through hoops on occasion to get their hands on certain releases for this game, it sucks but the game is just not that big at the end of the day (at least compared to other card games like magic etc) and so we all have to just deal with these issues. \n> \n>  \n> \n> That being said I do hope your issue is resolved and that you do get POD scenarios in Spanish but there are many others in far worse situations for sure and FFG can sure take a while to get issues sorted so maybe don't hold your breath \n\n \n\n \n\nWe get packs before US in very, very sporadic times and due to issues like avoiding a holiday or so. We are speaking of 1 adventure pack in some cycle, not in all of them.\n\n \n\nWe never get a Deluxe box before the people in US. Usually we get Deluxe boxes and most of Adventure Packs at the same time than US or 1 to 2 weeks after their release date."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950544","commentId":1950544,"userName":"ruferto","timestamp":1450801230,"content":">  \n> \n> > I think I did not explain well.\n> > \n> >  \n> > \n> > My local editor (Edge Ent) sent spanish translation when it was requested by FFG. FFG has not print spanish cards yet. \n> > \n> > My local editor explained in spanish official forums there is a big problem with printer queue for POD system. It's not only for spanish edition and it affects other foreign editions as well.\n> > \n> >  \n> > \n> > I can buy english editions, of course. But this is not a solution. FFG should fix this issue with POD system, because there are foreign editors that are paying licenses and making translations.\n> > \n> >  \n> > \n> > FFG should, at least, answer to community explaining when they will fix POD system. Not just for spanish players, but all players affected by this system.\n> > \n> >  \n> > \n> > And yes, I could buy english editions, but I don't want. Because I have a local editor. It would be fun if I buy FFG english packs when FFG is not making his job releasing my local edition.\n> \n>  \n> \n> The French player have exactly the same issue and complaint ... We have the same answer from Edge.\n> \n>  \n> \n> Just one difference with spanish players : We have AP and deluxe between 2 weeks and one month after America.\n> \n> As spanish players, we haven't the last two years of POD !\n> \n>  \n\n \n\nSo there are another countries in the same situation that Spain, and it looks we share the same issue. It is not fault of our distributor,  but FFG. \n\nThat is the reason because I open this thread. I'd like to know if there are more countries on the same situation.\n\n \n\nThank you for writing 13nrv :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950562","commentId":1950562,"userName":"13nrv","timestamp":1450801612,"content":"Belgium which share our language are in the same situation too ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1950919","commentId":1950919,"userName":"Narwe","timestamp":1450810730,"content":" \n\n> Making some noise to solve your problem is OK (if it reaches the target ears, which in this case I doubt). But making such statement: \n> \n> > Today is December 20th, 2015 and we, spanish players, feel abandoned by FFG. \n> \n> Given the circumstances is absurd. You're the most supported country LotR LCG-vise. Not having PoD's in your native language is a minor disadvantage which I could totally live with if I were you and had all other privileges you're having. \n\n \n\nHey con man, do you know how we can contact FGG/ANA? You can use Ruferto as offering to invoke them.\n\n \n\nI know they must be aware of the PoDs issue (they must know the demand of their products), but I'd like to ask them about the other things (FAQs and never announced tourment kits on clearance).\n\n \n\n \n\n>  \n> \n> > I think I did not explain well.\n> > \n> >  \n> > \n> > My local editor (Edge Ent) sent spanish translation when it was requested by FFG. FFG has not print spanish cards yet. \n> > \n> > My local editor explained in spanish official forums there is a big problem with printer queue for POD system. It's not only for spanish edition and it affects other foreign editions as well.\n> > \n> >  \n> > \n> > I can buy english editions, of course. But this is not a solution. FFG should fix this issue with POD system, because there are foreign editors that are paying licenses and making translations.\n> > \n> >  \n> > \n> > FFG should, at least, answer to community explaining when they will fix POD system. Not just for spanish players, but all players affected by this system.\n> > \n> >  \n> > \n> > And yes, I could buy english editions, but I don't want. Because I have a local editor. It would be fun if I buy FFG english packs when FFG is not making his job releasing my local edition.\n> \n>  \n> \n> The French player have exactly the same issue and complaint ... We have the same answer from Edge.\n> \n>  \n> \n> Just one difference with spanish players : We have AP and deluxe between 2 weeks and one month after America.\n> \n> As spanish players, we haven't the last two years of POD !\n> \n>  \n\n \n\n13nrv, Is french faq frequently updated?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1951439","commentId":1951439,"userName":"13nrv","timestamp":1450824015,"content":"@Narwe\n\nOur FAQ is up to date. The french version is the same than the english (1.7).\n\n \n\nThe new FAQ is quickly translate and available.\n\n \n\nI know (by Edge people) that all POD has been translated in French but the printing is blocked on FFG side.\n\nEdited December 23, 2015 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196323-when-will-we-received-pod-expansions-a-request-from-spain/?do=findComment&comment=1952127","commentId":1952127,"userName":"ruferto","timestamp":1450865966,"content":"It looks like FFG has a big issue related to POD system. They must improve this system, there is a big bottleneck, too much demand, and a very slow printing system."}]}