{"url":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/","title":"I love the game but...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1957365","commentId":1957365,"userName":"player1922162","timestamp":1451212143,"content":"I have to rant a bit and that is because I love the game. A fan-boy true and true.\n\n \n\nOk so I was bitterly disappointed by the first quest in the latest saga expansion. I felt it was a miss on so many levels.\n\n \n\nFirst the good, then the bad and lastly the ugly.\n\n \n\nI do like the Gollum/Sméagol double sided card and all of its features. Nice.\n\n \n\nThe mire mechanic was so so. I can live with that. The rest was soooo unthematic.\n\nThe passage of the marshes was not about fighting. The Nazgul was up in the sky. This quest was the perfect opportunity to give secrecy some love. Hiding and willpower. This was a story about two Hobbits on their own.\n\n \n\nHuge miss IMHO. Dead marshes would have been a better fit, even Emyn Muil\n\n \n\nI have played the quest three/four times and given up out of boredom on the third stage each time!\n\n \n\nI think FFG were playing it safe and that is a shame. They should have taken some inspiration from super quests such as Stone of Erech.\n\n \n\nThe enemies should have used the Spectral keyword, and I think they were too tough. As in this quest should not have been so focused on battles.\n\n \n\nThere were far too many questing points. I love difficult quests, but this was just boring.\n\nSomething that would have been very interesting would have been to make the total quest points need equal to the sum of the threat level of all heroes (of the player with the highest threat level). You could have picked Sam and needed 7 quest points or picked Treebeard, Gandalf and Elrond and needed 40...\n\n \n\nSome form of bonus for playing in Secrecy would have been a perfect match here.\n\n \n\nI also would have loved to see deck building limitations with regards to allies and a limitation on resources along the lines of Nightmare Druadan Forest.\n\n \n\nWhy am I writing this. I am hoping hoping that FFG will at least consider some of this for the last box. I want to be able to take Sam and Frodo, alone against Mt. Doom !\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1957478","commentId":1957478,"userName":"Calvadur","timestamp":1451223571,"content":"I haven't played the land of shadow quests, so I might be wrong with some things :unsure: [//content.invisioncic.com/Mfantflight/emoticons/default_unsure.png]\n\n \n\nThere are quite some times in this game, where \"unthematic\" things happen. I once had Merry go crazy and slaughter 3 Black-Riders in 1 turn, but in these cases you can use some tricks to \"explain\" the events:\n\n \n\n1. Don't see combat as a real fight. In my example you can imagine that Merry isn't killing the riders, but using his Hobbit skills and knowledge about the shire to escape or evade the riders and that his attack strength just shows his skills in these regards. Obviously it's easier to escape the riders with the help of your friends, what explains why Merry has more attack strength when paired with more hobbit heroes.\n\n \n\n2. See some allies/enemies as imagination or any other form of metaphysical appearence. Example: Playing Bilbo (ally) in a LotR-Saga can be explained by Frodo remembering good old times with uncle Bilbo, leading to the benefits ally Bilbo offers.\n\n \n\nWhat does this mean for the quest?\n\nFighting Nazguls in this quest Shows how your heroes try to withstand the force of the ring and the Horror the Nazgul brings. If you are strong enough the Nazgul will finally goes away (=is defeated) and looks somewhere else. Of course it would have been more thematic to fight with willpower in this case, so why not do this?\n\nBecause of Campaign-Mode. You can not Change your deck between each quest without a penalty. Making a quest that alters something so important for the game like what stat is used to determine combat damage requires a more specific deckbuilding than \"normal\" quests. If you alter your hero line-up to much for this specific quest you will have problems with the next quest (in this case it would be a very hard swing as the second quest seems like a very combat heavy one). An other example would be Helms Deep. Even though it isone of the most epic sieges of all time, you do not siege quest (=quest with defense), while a totally made up fight (siege of cair andros) used a combination of siege and combar questingand only one phase used normal questing, which many players tried to avoid at all costs. If Helms Deep would have been a real siege quest you would have been stuck with a deck that was made to survive many rounds with siege questing and would be in serious trouble once you try to do the next \"normal\" quest.\n\nTo avoid this all saga quests seem to have Standard questing and fighting Patterns, what in my opinion is totally fine. So I think it's safe to say that FFG is playing it save when it comes to campaign mode quests, as it is really hard to Change a quest once it's published. Imagine there is just one quest that Needs much different hero line ups than the others. It would ruin many campaigns as noone is happy to take the threat Penalty just because the quests Forces you as your well rounded deck that worked up to this Point now simply doesnt work anymore. Even when starting a new campaign you would think about how you should choose your heroes at the last \"free change point\". I don't think it is fun to have one quest being the main reason to build your deck one way or an other and then just chaging as much as needed to beat the other quests until you can Change again for free.\n\n \n\nTL;DR: Normal quest and combat structures are important to avoid frustration in campaign mode, but there are ways to imagine \"thematic events\".\n\n \n\nI dont think that dead marshes or Emyn Muil would have been a better fit for this quest. Both quests are (without nightmare decks) quite easy and boring and thats because there is next to no combat. While you explore Locations in emyn muil your only concerns are treacheries. That is neither very fun nor challenging. Nightmare mode fixes the Problem more or less, but only because it brings more and pretty strong enemies.\n\nDead marshes has the same problem. Few enemies and you aren't really punished for keeping your threat low and just quest through like a mad man. If I remember correctly this is one of the fastest quests in the game, as questing through is that easy, not quite what you want to create the tension of hiding from a Nazgul, right?\n\nWhat can we conclude from that? Sacrificing combat in a quest turns out boring quite fast. So it doesn't only prevent frustrating situations to Keep combat and questing in all quests the same, having both in a quest keeps the quest from becoming boring, too.\n\nOf course quests feel different for everyone and it's totally legit, that you disliked to fighting and got bored, but I think there are more people, who are bored of dead marshes/emyn muil than from this Saga quest.\n\n \n\nYour idea to scale the quest Points with a rising starting threat seems like a cool idea, as I don't see a balancing Problem for campaign mode and it would make sence that is easier to hide if you are 2 Hobbits than an ent, a wizard and an elf-Lord.\n\n \n\nHopfully you can enjoy the rest of the box more than the first quest, but I don't think FFG will change the basic quest concepts in any upcoming Saga quest to much, what in my opionion also isn't needed, as I enjoyed all the Saga quests I played so far.\n\nEdited December 27, 2015 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1957550","commentId":1957550,"userName":"Lecitadin","timestamp":1451230396,"content":"This is still a game, not an adaptation of the novels."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1957698","commentId":1957698,"userName":"Chris51261","timestamp":1451240023,"content":"Suggesting a quest be more like Emyn Muil? Bold move."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1957761","commentId":1957761,"userName":"Bullroarer Took","timestamp":1451244203,"content":"First, the quest is designed to be played in campaign mode for multiple players. Not easy for all players to switch to secrecy.\n\nSecond, I played that with Sam and Galadriel secrecy and it was really fun. Too many enemies? Sorry, quibbling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1958252","commentId":1958252,"userName":"JohnGarrison1870","timestamp":1451274931,"content":"\"I have a criticism.\"\n\n \n\n\"Your criticism is invalid.\"\n\n \n\nWash, rinse, repeat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1958756","commentId":1958756,"userName":"leptokurt","timestamp":1451315229,"content":"I wouldn't say that this quest is combat heavy. In fact most enemies have a threat level > 30, so with a low threat deck it's possible to avoid fighting them.\n\n \n\nI'm not sure about the theme. I think they did a good job with the mechanics of this quest, so I guess I can live with some enemies that never appeared in the original story."},{"commentUrl":"https://community.fantasyflightgames.com/topic/196921-i-love-the-game-but/?do=findComment&comment=1974544","commentId":1974544,"userName":"asfaloth","timestamp":1452090469,"content":"I am a little disappointed too. So far LOTR Saga Boxes had shown a very good balance between theme and playability. It was possible to use thematic heroes in every quest included in The black riders, The road darkens and Treason of Saruman at least with 2 players.\n\n \n\nBut now that trend is gone. You must play this box with a huge amount of licenses. I was expecting the Secrecy keyword renewed for The land of shadow box in order to provide an experience with one or two heroes (Frodo and Sam and even a Gollum hero).\n\n \n\nI understand this is a game and I have to admit that it is complex to adapt the game to the events related in this section of the book, but to me it was important to play at least the saga boxes thematically. For some players it is difficult to feel confortable when you have to play The crossroad in Ithilien with Theoden, Eowyn and Erkebrand.\n\nIn addition to this the rising difficulty in the game is exhausting. \"Losing\" in the first or second quest phase is boring and is getting very common. But this is another question to be discussed in other threads.\n\nEdited January 6, 2016 by asfaloth"}]}