{"url":"https://community.fantasyflightgames.com/topic/197538-adventure-pack-story-linkage/","title":"Adventure Pack story linkage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/197538-adventure-pack-story-linkage/?do=findComment&comment=1967295","commentId":1967295,"userName":"Hawkstrike","timestamp":1451745489,"content":"New player here, wondering about the story linkage through the various adventure pack expansions. Do the adventure packs for a cycle constitute a story, and is there an order they need to be played to have a coherent story?\n\nBackground: I've been playing the box sets and Saga expansions solo (single deck except for Escape from Dol Guldur). I've played through the Core set, and the two Hobbit saga expansion boxes, and just finished the three quests of the Khazad-dum box set.\n\nI have a couple of the Khazad-dum adventure expansion packs (specifically Redhorn Gate, Watcher in the Water, and Foundations of Stone) with the other three on the way. If I want to continue the basic storyline from Khazad-dum, what's the best order to deliver a good adventure story experience? Release order?\n\nI didn't do this for the core set/Mirkwood adventuress, because since those have been out of print I haven't been able to find any of those adventure packs, so I went with Khazad-dum instead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197538-adventure-pack-story-linkage/?do=findComment&comment=1967301","commentId":1967301,"userName":"NathanH","timestamp":1451745889,"content":"The Core Set forms a story more-or-less in order but it isn't much of a story.\n\n \n\nShadows of Mirkwood forms a constant story in order although packs 2 and 3 are asides and could be played individually/missed out.\n\n \n\nKhazad-Dum forms a story in order, independent of everything else.\n\n \n\nDwarrowdelf cycle forms a story in order, although episodes 1--2 form a \"side quest\" that could be treated independently of 3--6.\n\n \n\nHeirs of Numenor and Against the Shadow form one story that should be played in order.\n\n \n\nVoice of Isengard and Ring-Maker the same.\n\n \n\nLost Realm and Angmar Awakened the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197538-adventure-pack-story-linkage/?do=findComment&comment=1967386","commentId":1967386,"userName":"Hawkstrike","timestamp":1451750269,"content":"Cool, thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/197538-adventure-pack-story-linkage/?do=findComment&comment=1969453","commentId":1969453,"userName":"DunedainLoreKeeper","timestamp":1451864181,"content":"Also, based off your experience with Kazad-Dum, you can see that missing out a quest isn't exactly the end of the universe in terms of 'missing out on the story'. "}]}