{"url":"https://community.fantasyflightgames.com/topic/197728-timing-of-redhorn-gate-stage-3b/","title":"timing of Redhorn Gate stage 3B","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/197728-timing-of-redhorn-gate-stage-3b/?do=findComment&comment=1969799","commentId":1969799,"userName":"mewmartigan","timestamp":1451877840,"content":"So during the questing phase, I completed stage 2B. At this point, Caradhras becomes the active location and I flip stage 3A to 3B. 3B has a when revealed effect which I do now.  It also has another effect, on a separate line from the \"when revealed\"  that says \"Characters are discarded from play if their willpower is ever zero\".   When does this happen? I have a hero who will end up discarded...are they discarded immediately since their willpower is zero thanks to treachery? At any time during play someone ends up with zero willpower they are discarded immediately before resolving anything else?\n\n \n\nOn another note, if \"freezing cold\" is revealed during the quest phase, does the hero it attaches to not get to count his willpower for that round if he was already committed to the quest?\n\n \n\nThis is the first time I have played this scenario and didn't read the cards ahead of time. 3B had me discard two heroes so that was game over, haha. I was running Leadership/Lore but it seems like this is a scenario that almost requires A Test of Will. I did have the miner to removed conditions but he never showed. If I had known what was coming in 3B I would have tried to bide my time, haha.\n\n \n\nThanks!\n\nEdited January 4, 2016 by mewmartigan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/197728-timing-of-redhorn-gate-stage-3b/?do=findComment&comment=1969907","commentId":1969907,"userName":"Seastan","timestamp":1451883799,"content":"> At any time during play someone ends up with zero willpower they are discarded immediately before resolving anything else?\n\n \n\nCorrect.\n\n \n\n>  \n> \n>  \n> \n> On another note, if \"freezing cold\" is revealed during the quest phase, does the hero it attaches to not get to count his willpower for that round if he was already committed to the quest?\n\n \n\nI believe that your hero would have -2 WP and be unable to commit to any quests in the future. (But still count the hero's WP minus 2 for the current questing phase since he is already committed)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197728-timing-of-redhorn-gate-stage-3b/?do=findComment&comment=1970243","commentId":1970243,"userName":"mewmartigan","timestamp":1451907526,"content":"okay, thanks!"}]}