{"url":"https://community.fantasyflightgames.com/topic/197820-ranger-vs-dunedan-keywords/","title":"Ranger vs. Dunedan keywords","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/197820-ranger-vs-dunedan-keywords/?do=findComment&comment=1971479","commentId":1971479,"userName":"Hawkstrike","timestamp":1451943242,"content":"So opened two new adventure packs today getting the brothers Noldor Elladan and Elrohir and noticed the keyword differences in some of the cards -- Ranger vs Dunedan. What are the differences in play?\n\n\n\n> ‘Only a Ranger!’ cried Gandalf. ‘My dear Frodo, that is just what the Rangers are: the last remnant in the North of the great people, the Men of the West. They have helped me before; and I shall need their help in the days to come; for we have reached Rivendell, but the Ring is not yet at rest.’\n> \n> – Many Meetings, The Fellowship of the Ring\n\nand\n\n\n\n> 'And why do you call him Dunedan?' asked Frodo.\n> \n> 'The Dunedan,' said Bilbo. 'He is often called that here. But I thought you knew enough Elvish at least to know dun-adan\" Man of the West, Numenorean. But this is not the time for lessons!'\n> \n> - Many Meetings, The Fellowship of the Ring\n\nI've always more or less equated the two based on the above quotes, but I suppose one can be a little 'r' ranger without being a Dunedan; and not all Dunedan are big 'R' Rangers, but all big 'R' Rangers are Dunedan?\n\nor else:\n\n\n\n> 'I'm attacking the darkness!'\n> \n> - Picard the elven ranger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/197820-ranger-vs-dunedan-keywords/?do=findComment&comment=1971492","commentId":1971492,"userName":"John Constantine","timestamp":1451943580,"content":"Are you sure you're not mistaking keywords and traits here?\n\nRanged keyword means that character can attack enemies engaged with other players.\n\n \n\nRanger and Dunedain traits (as all traits of the game) do nothing on their own."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197820-ranger-vs-dunedan-keywords/?do=findComment&comment=1971498","commentId":1971498,"userName":"banania","timestamp":1451943636,"content":"Ranger is a \"job\", a skill, not a people.\n\nFor example the Rangers of Ithilien are Gondorians. So they have the Ranger and Gondor traits (yes those are \"traits\" and not \"keywords\")."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197820-ranger-vs-dunedan-keywords/?do=findComment&comment=1971549","commentId":1971549,"userName":"Gizlivadi","timestamp":1451945433,"content":"Most (if not all, it's not really clear) Dúnedain are Rangers, but not all Rangers are Dúnedain. Basically, Ranger is a \"profession\" based on small groups (and sometimes just one) of warriors/explorers/trackers, and in LOTR they have the role of hunting and patrolling forests and other wild areas in search of enemies. Gondor had a division of Rangers in Ithilien led by Faramir, and the Dúnedain of the North were mostly rangers secretly guarding the borders of Breeland and the Shire.\n\n \n\nDúnedain is a racial term, designating the men descended of the Númenoreans that founded the kingdoms of Gondor and (now lost) Arnor, and were characterized for being very long-lived, taller and more beautiful, and more skilled/wise than other races of men. By the end of the Third Age (LOTR), their pedigree was moslty lost in Gondor, but remained pure in the Rangers of the North, who were led by Aragorn."}]}