{"url":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/","title":"Record Attachment and Heavy Curse","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1971824","commentId":1971824,"userName":"Seastan","timestamp":1451957472,"content":"Tome-of-Atanatar.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Blood-of-Gondor/Tome-of-Atanatar.png]Heavy-Curse.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Lost-Realm/Heavy-Curse.jpg]\n\n \n\nIf Heavy Curse is in play, do you have to pay an extra resource if in your discard pile there is a single copy of the event you are trying to play with the Record?\n\n \n\nThe record specifically says to play the event as if it were in your hand. Does this mean it is not considered to be in your discard pile, and thus you pay the regular cost? Or is the \"as if it were from your hand\" text just there to clarify that you must pay for the event, and it doesn't mean that it is actually no longer in your discard pile?\n\n \n\nPossibly relevant rulebook text:\n\n \n\n>  An event card is played from a player’s hand, its text effects are resolved, and the card is then placed in its owner’s discard pile.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1971839","commentId":1971839,"userName":"shosuko","timestamp":1451957902,"content":"Do you pay the cost for a card you play with the record?  I imagine if you don't pay the cost, then it won't matter if the cost is increased.  I always assumed you didn't pay the cost, you just \"play\" the card.  Maybe I've been playing this wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1971907","commentId":1971907,"userName":"GrandSpleen","timestamp":1451961400,"content":"shosuko, you do pay the cost (that's been clarified before).  \n\n \n\nI would increase the cost, if Heavy Curse was in play.  I don't see the phrase \"as if it were in your hand\" as circumventing Heavy Curse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1972200","commentId":1972200,"userName":"DukeWellington","timestamp":1451976425,"content":"I agree with grandspleen. The key for me is that it is still in the discard. It is like an enemy in the staging area that is also engaged with each player. It is sort of two places at once. That is my thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1972303","commentId":1972303,"userName":"NathanH","timestamp":1451985311,"content":"I'd pay the extra resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1972641","commentId":1972641,"userName":"cmabr002","timestamp":1452005692,"content":"I would pay the extra resource simply because I would like to err on the side of caution, but to be honest I can see both interpretations.\n\n \n\nPlain and simple, if it were in your hand it would cost its printed cost (because it wouldn't be in your discard pile) so it seems the tome should bypass Heavy Curse so long as there is only one copy of the event you wish to play via Tome of Atanatar in your discard pile.  The other thing of note, is that the Tome of Atanatar specifically references the event you play so it is clearly not saying \"play a copy of said event\".  If it said you were playing a copy, then I could see paying an extra resource as being the clear interpretation here, but we don't have that.\n\n \n\nI think this is worth asking the developers as both interpretations are equally valid.\n\nEdited January 5, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1973875","commentId":1973875,"userName":"shosuko","timestamp":1452044760,"content":"> shosuko, you do pay the cost (that's been clarified before).  \n> \n>  \n> \n> I would increase the cost, if Heavy Curse was in play.  I don't see the phrase \"as if it were in your hand\" as circumventing Heavy Curse.\n\nThen you certainly pay the extra cost.  I agree, \"as if it were in your hand\" doesn't mean it's not really in the discard pile."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977170","commentId":1977170,"userName":"Seastan","timestamp":1452195285,"content":"From Caleb:\n\n \n\n>  \n> \n>  \n> \n> To play an event, you must first pay its cost. Tome of Atanatar allows you to play an event in your discard pile “as if it were in your hand” but it is not actually in your hand. It is still in the discard pile at the time you must pay its cost, so Heavy Curse would increase its cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977203","commentId":1977203,"userName":"cmabr002","timestamp":1452196822,"content":">  \n> \n> From Caleb:\n> \n>  \n> \n> >  \n> > \n> >  \n> > \n> > To play an event, you must first pay its cost. Tome of Atanatar allows you to play an event in your discard pile “as if it were in your hand” but it is not actually in your hand. It is still in the discard pile at the time you must pay its cost, so Heavy Curse would increase its cost.\n> \n>  \n\n \n\nI find his explanation strange because it seems to not truly fit the definition of \"as if it were\".  I think it makes more sense to say what you said in your original post that the text was only included to clarify that its cost must still be paid. \n\n \n\nIt seems it would be more appropriate for the tome to say \"play (and, as a result, pay for) any event card in your discard pile\".\n\n \n\nSince \"as if it were\" does not change the physical location of where the card is being played from you can use Map of Earnil to play Elven light, right?  So you trigger Map of Earnil, place Elven Light into your hand, draw a card, then place Elven Light onto the bottom of your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977272","commentId":1977272,"userName":"cmabr002","timestamp":1452199196,"content":"How do you resolve this:\n\n \n\nRaven Deck with A Test of Will\n\n \n\n> When a player is instructed to reveal a card from the Raven deck, resolve the staging of that card as if it was just revealed from the encounter deck.\n\n \n\n \n\nA Test of Will\n\n \n\nI thought if the card in the raven deck had a When Revealed effect you could cancel it.  Now I'm not so sure, because it was physically revealed from the Raven Deck (not the encounter deck) and since \"as if it were\" does not change its physical origin, I don't think A Test of Will can cancel anymore.  The reason it says \"as if it was just revealed from the encounter deck\" is there to just clarify that you should place the enemies in the staging area after.  It's not meant to allow cards like A Test of Will to trigger???\n\n \n\nThere is also more confusion now with \"as if it had just engaged\".  I used to think it was pretty clear that you could trigger effects (like Mablung's) off of this.  However, now it is less clear due to this redefinition of \"as if it\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977411","commentId":1977411,"userName":"Seastan","timestamp":1452202963,"content":"Good points. I think \"as if it were\" somehow makes the card in multiple places at once. So you may for the cost of the event because it's \"as if it were\" in your hand, but also pay the cost of the Heavy Curse because it is still in your discard \"in reality\".\n\n \n\nSimilarly you can cancel a When Revealed from the Raven Deck because the card is revealed \"as if it were\" from the Encounter deck, but in reality it is still being revealed from the Raven Deck. If, for example, they printed a card that said: \"Response: cancel an enemy card just revealed from a Raven Deck\", I'm pretty sure it would work even though the card is also considered to be revealed from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977422","commentId":1977422,"userName":"Seastan","timestamp":1452203220,"content":"As for \"As if it had just engaged from the staging area\", it doesn't matter. Mablung doesn't care where the enemy is coming from. But I'm pretty sure he would still work even if his ability included the words \"from the staging area\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977443","commentId":1977443,"userName":"Slothgodfather","timestamp":1452203628,"content":"I agree with Seastan.  Typically, events can only be played from your hand.  The \"as if from your hand\" is the phrase allowing you to play any event from the discard pile.  But you still pay the cost of playing the event.  The curse looks in your discard pile, finds a copy of the event you are trying to play, and increases the cost of that card by 1.  \n\n \n\nThe raven/cancel situation, the \"as if revealed from the encounter deck\" enables you to interact with the card in all the usual ways of interacting with revealed encounter cards so you will still be able to cancel those effects.  If it was an enemy, Thalin would still damage it, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/197836-record-attachment-and-heavy-curse/?do=findComment&comment=1977584","commentId":1977584,"userName":"shosuko","timestamp":1452209248,"content":"When a card is \"considered\" somewhere, it doesn't take the card away from where it is, it just adds another location.\n\n \n\nFor the Records the cards are both in the discard AND in the hand for the purposes of this action."}]}