{"url":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/","title":"West Quarter and Delay the Enemy","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979181","commentId":1979181,"userName":"NathanH","timestamp":1452284434,"content":"West-Quarter.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Assault-on-Osgiliath/West-Quarter.png] Delay-the-Enemy.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Across-the-Ettenmoors/Delay-the-Enemy.jpg]\n\n \n\nIf West Quarter is the active location and Delay the Enemy is the current quest, what do we do?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979187","commentId":1979187,"userName":"Delaric","timestamp":1452284634,"content":"The quest would then have both battle and siege keywords so you can quest using either attack or defense values. I don't think there is a prohibition against a quest card having both battle and siege.\n\n \n\nEdit: my earlier post made no sense as you can't quest using a character's Attack AND Defense added together\n\nEdited January 8, 2016 by Delaric"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979188","commentId":1979188,"userName":"cmabr002","timestamp":1452284636,"content":"I suspect West Quarter is similar to that location that needed an errata:\n \n\n> The Cross-roads:\n> Should read: “The current quest card gains siege (and loses Battle [if applicable]).”\n\n \n\nIt's possible we will get an errata for West Quarter.  If not, then I suppose you can choose the higher of the value of your defense or attack (or maybe you have to just choose one).\n\nEdited January 8, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979196","commentId":1979196,"userName":"NathanH","timestamp":1452284779,"content":"We played it as Siege, using Cross-roads as precedent. But there is also the card Trained for War that behaves in the opposite way, although this is a player card rather than an encounter card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979215","commentId":1979215,"userName":"cmabr002","timestamp":1452285510,"content":"> We played it as Siege, using Cross-roads as precedent. But there is also the card Trained for War that behaves in the opposite way, although this is a player card rather than an encounter card.\n\n \n\nI'm not sure I understand what you mean with respect to Trained for War.  Would you mind explaining it to me?  It seems a bit different to me since you could never use it on a quest with a keyword.\n\n \n\nAlthough, I just realized that Trained for War contradicts the \"until the end of the phase\" ruling where it constantly checks and updates the game state...\n\n \n\nAction: Until the end of the phase, if the current quest has no keyword it gains battle. (Characters quest using [Attack] instead of [Willpower].)\n\n \n\nExample: This means that you play the card and because of Trained for War the quest with no keyword gains Battle.  Now, since the current quest has Battle, Trained for War doesn't do anything, so the current quest would lose Battle.  But then because the current quest lost Battle, it would regain it again creating a never-ending loop :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979223","commentId":1979223,"userName":"Seastan","timestamp":1452285744,"content":"Perhaps it should be: Action: Until the end of the phase, if the current quest has no printed keyword it gains battle. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979232","commentId":1979232,"userName":"cmabr002","timestamp":1452285981,"content":"> Perhaps it should be: Action: Until the end of the phase, if the current quest has no printed keyword it gains battle. \n\n \n\nYeah, I think the intent of the card is clear enough.  I was just being silly :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nFor the sake of discussion, though, making Trained for War say \"printed\" wouldn't solve all the confusion.  If West Quarter was the active location and you played Trained for War then a similar dilemma that NathanH described occurs.  I really think it is fairly intuitive what Trained for War is supposed to do, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979284","commentId":1979284,"userName":"NathanH","timestamp":1452287531,"content":"If West Quarter is the active location when Trained for War is played, then Trained for War will see that the current quest has Siege and therefore not doing anything.\n\n \n\nMy reason for bringing up Trained for War was that it is an example of a card that changes the type of questing from Willpower to Attack but not from Defence to Attack. Contrast this with Cross-Roads, which changes questing from Willpower to Defence and from Attack to Defence. So we have examples of cards that work a bit differently. This suggests to me that it's not obvious which way West Quarter will end up being changed.\n\n \n\nIn any case, as long as I've not missed a prior ruling or obvious answer, I'll send a rules query."},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979331","commentId":1979331,"userName":"cmabr002","timestamp":1452288859,"content":"> If West Quarter is the active location when Trained for War is played, then Trained for War will see that the current quest has Siege and therefore not doing anything.\n\n \n\nIt is possible to play Trained for War before West Quarter is in play and then when West Quarter is revealed to use Strider's Path to make it the active location.  In this example, I'm not entirely confident what would happen.  I do think that West Quarter would override Trained for War because Trained for War uses the text \"until the end of the phase\", but then that makes my \"silly\" argument about Trained for War creating a never-ending loop not so silly after all.\n\n \n\nAll of this confusion, from your original question, to all the sub-questions I've brought up, goes away if West Quarter receives an errata that says \"[and loses Battle if applicable]\".  I'm hoping that's what they decide, otherwise I think it might open a can of worms with Trained for War contradicting the \"until the end of the phase\" ruling.\n\n \n\nI am certainly interested in hearing what the ruling on this is so I appreciate you sending the inquiry.\n\nEdited January 8, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979424","commentId":1979424,"userName":"NathanH","timestamp":1452291937,"content":">  \n> \n> Hi Nathan,\n> \n> Great question. Assault on Osgiliath was designed long before side quests were a part of the game, and while we tried to take existing scenarios into account when we created side quests there were bound to be a few odd interactions such as the one you found. In this instance, you should treat West Quarter as if it read: “While West Quarter is the active location, the main quest gains siege.”\n> Hope you’re enjoying the Against the Shadow cycle!\n> Cheers,\n> Caleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198273-west-quarter-and-delay-the-enemy/?do=findComment&comment=1979864","commentId":1979864,"userName":"Delaric","timestamp":1452312942,"content":"Well that makes sense"}]}