{"url":"https://community.fantasyflightgames.com/topic/198408-discard-a-random-card-or/","title":"Discard a random card or...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/198408-discard-a-random-card-or/?do=findComment&comment=1981105","commentId":1981105,"userName":"Nerdmeister","timestamp":1452392678,"content":"Hey there, have come a bit behind with my questing and am only now getting around to the Shelob-quest of the saga expansions; though my question is not unique to that quest, I guess.\n\n \n\nThe quest has alot of discarding effects like \"When Revealed: Either discard a random card from your hand or reveal an additional encounter card\" and \"Response: After Smeagol´s Secret Way is explored, discard 3 random cards from each player´s hand to discard each Nazgul enemy in the staging area\"\n\n \n\nThe question here is: can I choose to discard random cards from my hand even if I do not have any cards? In effect the game mechanics \"check\" my hand, shuffle it and discard as many cards as is possible (shuffle your hand of X cards and discard Y cards, where it is possible for X to be 0)\n\n \n\nI feel like I have run across something like this before and had it answered but I cannot for the life of me put my finger on when that was.\n\n \n\nAny and all opinions are welcome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/198408-discard-a-random-card-or/?do=findComment&comment=1981217","commentId":1981217,"userName":"GrandSpleen","timestamp":1452400540,"content":"I don't think so; if it said \"discard each card in your hand\" you'd be OK to choose that option, because you can satisfy it as written (\"each\" and \"all\" include the concept of 0).  But it says to discard a card, so something has to get discarded to satisfy the condition.  Like those locations that say 'The first player engages an enemy in the staging area to travel here.'  You can't travel to those if there is nothing in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/198408-discard-a-random-card-or/?do=findComment&comment=1981376","commentId":1981376,"userName":"Emilius","timestamp":1452414495,"content":"I agree with GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/198408-discard-a-random-card-or/?do=findComment&comment=1981540","commentId":1981540,"userName":"Nerdmeister","timestamp":1452433662,"content":"Thanks for the answer. I could see it go both ways but not certain of either possibility."}]}