{"url":"https://community.fantasyflightgames.com/topic/199242-keeping-count/","title":"Keeping Count","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994405","commentId":1994405,"userName":"Edheliad","timestamp":1452939435,"content":"\"Attached hero gets +1 Attack  for each resource token on another copy of Keeping Count that is above the current number of resource tokens on this card.\"\n\n \n\nIn my last game I had 3 copies of Keeping Count equipped on heroes. Glorfindel had 5 tokens, Elrohir had 3, and Elladan had 1.\n\n \n\nWhen Elladan attacks an Orc how much bonus attack does he get? \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994415","commentId":1994415,"userName":"DukeWellington","timestamp":1452940292,"content":"I have always played it as +6 attack. That's why the card rocks in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994418","commentId":1994418,"userName":"krokodiler","timestamp":1452940442,"content":"I'd say +6, as there are total 6 more resources on another copies of Keeping Count in play.\n\n \n\nedit: :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png] 'd\n\nEdited January 16, 2016 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994450","commentId":1994450,"userName":"Sin21","timestamp":1452942823,"content":"I would say 4 as it says *A*nother copy(singular) and not *other copies*(multiple)\n\nYou have to choose one.\n\nThis is especially true if you see the german version of the card that instructs you to definitely choose ONE other keeping count card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994486","commentId":1994486,"userName":"Edheliad","timestamp":1452946382,"content":"All \"another copy\" rather than \"other copies\" clarifies is that the subtraction for the heroes own copy takes place before adding them together. \"All tokens on other copies\" would result in 5 (Glorfindel + 3 (Elrohir) - 1 (Elladan) = +7 Attack.\n\n \n\n\"Each token on another copy\" suggests that you take 'each' instance into account.\n\n \n\nI played it as 6, though it didn't matter in that case as Elladan was only fighting an Orc guard at the end of Dol Guldur. If the German version is what was intended I'll be a little disappointed, but not really because Elrohir took out the Ringwratih with a +4 from comparison with Glorfindel a couple of turns earlier. It's a great card either way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994491","commentId":1994491,"userName":"cmabr002","timestamp":1452947640,"content":"> All \"another copy\" rather than \"other copies\" clarifies is that the subtraction for the heroes own copy takes place before adding them together. \"All tokens on other copies\" would result in 5 (Glorfindel + 3 (Elrohir) - 1 (Elladan) = +7 Attack.\n> \n> \"Each token on another copy\" suggests that you take 'each' instance into account.\n> \n> I played it as 6, though it didn't matter in that case as Elladan was only fighting an Orc guard at the end of Dol Guldur. If the German version is what was intended I'll be a little disappointed, but not really because Elrohir took out the Ringwratih with a +4 from comparison with Glorfindel a couple of turns earlier. It's a great card either way.\n\n\"Each\" only refers to the resource tokens. It is irrelevant to the question \"does 'another copy' include more than one copy?\"\n\nIf they wanted it to count all resource tokens on all copies they would have just said \"other copies\". The reason it still wouldn't add 7 attack is because it says \"that is above\". Nothing in the card text says you sum all the resource tokens of all copies before determining how many resource tokens there are. So you would still just Vet +4 and then +2 but it doesn't say 'other copies'.\n\nAlso, if you replaced 'another' with 'one more' which is the standard definition of another, would you still be making your argument?\n\nEdited January 16, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994575","commentId":1994575,"userName":"Edheliad","timestamp":1452953494,"content":"The argument that \"if they wanted you to do x, they would have said y\" doesn't hold water because there is a better way to say every interpretation of the rule that has been discussed so far. The English version of the rule is needlessly vague whatever you believe the intention to have been.\n\n \n\nThe card doesn't state that only one other copy of Keeping Count is taken into account, when that would have been easy to establish in the text.\n\n \n\nIn the above example, \"each resource token\" applies to 4 tokens on Glorfindel. It also applies to 2 on Elrohir. Nothing in the language prohibits the player from applying both 4 +1 bonuses and another 2 +1 bonuses. Both are copies of Keeping count other than the one on Elladan.\n\n \n\n\"Each token on one more copy\" is bad grammar."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994589","commentId":1994589,"userName":"shosuko","timestamp":1452954059,"content":"What feels right to me is that you would gain it from each other copy, but not a lump total.\n\n \n\nI feel this way because they aren't directly linked.  It's not like Support of the Eagles where you specifically pick another card to use.  So the way it is worded, I would think it would trigger from each copy.\n\n \n\nSo if you had your situation Glorfindel had 5 tokens, Elrohir had 3, and Elladan had 1 I would think that Elladan would have +6, and Elrohir would have +2.\n\n \n\nThis is what feels right, but I'm certainly no expert.  Has there ever been a clarifying rule on this card?\n\nEdited January 16, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994613","commentId":1994613,"userName":"cmabr002","timestamp":1452955036,"content":"I'm not sure where the confusion is coming from, but apparently everyone thinks it would add both.  I see no compelling reason that it would, however.\n\n \n\nRegardless, this card sucks and I have no intention of using it even if it is supposed to count \"another copy\".\n\nEdited January 16, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994622","commentId":1994622,"userName":"NathanH","timestamp":1452955571,"content":"I had never really thought about this card too much before. The sentence \"Attached hero gets +1 Attack  for each resource token on another copy of Keeping Count that is above the current number of resource tokens on this card\" is really horrible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994624","commentId":1994624,"userName":"cmabr002","timestamp":1452955943,"content":"> I had never really thought about this card too much before. The sentence \"Attached hero gets +1 Attack  for each resource token on another copy of Keeping Count that is above the current number of resource tokens on this card\" is really horrible.\n\n \n\nI think it is clunky and I think because it is clunky people are glossing over the word \"another\".  The word another here is referring to a single entity.  Once that is proven or refuted, the debate can move on.  Every definition of the word \"another\" I can find either explicitly refers to \"one\" or refers to \"a\" something which both refer to a single entity.\n\nEdited January 16, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994681","commentId":1994681,"userName":"Edheliad","timestamp":1452958908,"content":"Glorfindel's card is \"Another\" Keeping Count from Elladan's. He applies 4 x +1 Attack to Elladan.\n\n \n\nBut Elrohir's card is also \"Another\" Keeping Count from Elladan's. There are multiple single entities in play that invite comparison.\n\n \n\n\"Each resource token on another copy\" applies, so there's another 2x +1 Attack to apply to Elladan's attack.\n\n \n\n \n\nThe German card strongly implies that your definition is the intention. But strictly speaking the language does not support that. It's bad technical writing.\n\n \n\nCongratulations on deciding the card sucks, btw. I'll continue to enjoy no-cost, no-effort attack bonuses of 1/2/3/4+ in my decks that happen to make good use of it. It's proving far more efficient than Elven Spear and Fair And Perilous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994782","commentId":1994782,"userName":"cmabr002","timestamp":1452965273,"content":"I really think you misunderstand the word another. I am going to another house doesn't mean you are going to several houses simultaneously even if you could go to any house other than the one you are currently in...\n\nIt means you are going to a different house, but which house is undefined...and you choose which house.\n\nI could say I'm going to another house, and then another, and then another, then sure, each instance of another would refer to a different house but keeping count uses another, only once.\n\nIt doesn't matter that another could refer to both copies before you choose a copy. Once you've selected a copy (which is implied by the use of the word another) it can no longer refer to both simultaneously because of the definition of another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994817","commentId":1994817,"userName":"NathanH","timestamp":1452967441,"content":"It depends whether you think the \"each resource token\" or \"another copy of Keeping Count\" is the main subject of the sentence.\n\n \n\nConsider the simpler sentence \"Each princess in another castle\". When evaluating how many princesses this specifies, do I choose a particular other castle and count the number of princesses in it, or do I loop through every princess and check whether they have the property \"is in another castle\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994830","commentId":1994830,"userName":"Edheliad","timestamp":1452967995,"content":"Attached hero gets +1 Attack for each princess in another castle above the current number of princesses on this card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1994840","commentId":1994840,"userName":"Kakita Shiro","timestamp":1452968540,"content":"C'mon guys, Golden Rule of Middle Earth: Whatever works against the players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995050","commentId":1995050,"userName":"DukeWellington","timestamp":1452976330,"content":"If they wanted it to only refer to one other copy then they would have said, \"choose another copy of keeping count...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995263","commentId":1995263,"userName":"shosuko","timestamp":1452985887,"content":"Given this game's track record for needing errata I would say it could work either way, and just ask a developer which they rule it to be.\n\n \n\nSemantics are normally a great place to turn to when you have questions about meaning.  A technical write up of the rules would be great too...\n\n \n\nThis game fails with both haha.  Good thing it's fun, and co-op, so it doesn't matter if I occasionally play things wrong.  Because I do... all the time O_O"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995384","commentId":1995384,"userName":"Teamjimby","timestamp":1452992256,"content":"I'm with cmabr on this that it would only be +4.  How do you interpret Merry's response?\n\n \n\n\"Response: After Merry participates in an attack that destroys an enemy, ready another character that participated in that attack.\"\n\n \n\nCould he ready all characters that participated?  In English, another is singular.  For plural it would be each other.\n\nEdited January 17, 2016 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995443","commentId":1995443,"userName":"cmabr002","timestamp":1452995311,"content":"> I'm with cmabr on this that it would only be +4.  How do you interpret Merry's response?\n> \n>  \n> \n> \"Response: After Merry participates in an attack that destroys an enemy, ready another character that participated in that attack.\"\n> \n>  \n> \n> Could he ready all characters that participated?  In English, another is singular.  For plural it would be each other.\n\n \n\nThis applies to Balin, Fellowship Frodo, Nenya, Ravenhill Scout among many other cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995446","commentId":1995446,"userName":"cmabr002","timestamp":1452995358,"content":"> If they wanted it to only refer to one other copy then they would have said, \"choose another copy of keeping count...\"\n\n \n\nThey can, but they don't have to.  See all the Dunedain attachments.  None explicitly says to \"choose another hero\" but it is implied that you choose one because it says \"another hero\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995653","commentId":1995653,"userName":"DukeWellington","timestamp":1453006678,"content":"When you target something the choosing is embedded automatically so it can remain unstated. The text on keeping count does not, in any way, involve targeting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995670","commentId":1995670,"userName":"cmabr002","timestamp":1453007679,"content":"> When you target something the choosing is embedded automatically so it can remain unstated. The text on keeping count does not, in any way, involve targeting.\n\n \n\nIt does involve targeting.  It uses the word \"another\".  This is tiring :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nSee Mighty Prowess [http://hallofbeorn.com/Cards/Details/Mighty-Prowess-TDF].  This doesn't deal damage to all enemies.  It is only one enemy and how do you know which enemy you deal the damage to? Do you randomize it?  No, you choose it.  There are countless cards that if we decide to randomly change the definition of \"another\" that become completely and totally overpowered (Merry) and other cards that become completely useless (Balin).\n\nEdited January 17, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995687","commentId":1995687,"userName":"GrandSpleen","timestamp":1453009105,"content":"Agreed it is mildly vague.  But there are several ways to word this card if you want it to compare itself against all other copies:\n\n \n\n\"...for each resource token on each other copy...\"\n\n\"for each resource token on all other copies...\"\n\n\"for each resource token on other copies...\"\n\n \n\nAnd there are few ways to word it if you want it to compare itself against only one other copy:\n\n \n\n\"...for each resource token on one other copy...\" [could still be construed as vague, as \"another\" is, in this thread]\n\n\"...for each resource token on only one other copy\" [weird, kind of unnatural phrasing]\n\n\"...for each resource token on a second copy\" [again, this thread could still exist if they used this wording]\n\n \n\n \n\nBottom line, very easy to make this card unambiguously refer to \"all other\" copies of Keeping Count, but it takes a bit more perspective-taking skill to make it unambiguously refer to \"only one\" other copy.\n\n \n\nSo if your heart says \"all other,\" play it that way.  If your heart says \"only one,\" play it that way.\n\n \n\nBut your heart of hearts knows how it should play, wink wink.\n\nEdited January 17, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995721","commentId":1995721,"userName":"cmabr002","timestamp":1453013957,"content":"I dunno, GrandSpleen.  I'm trying hard to understand the other side, but in what way and in what context in English can \"another\" ever be defined as \"each other\", \"all other\", or \"on other copies\" other than misuse?  The word \"another\" actually means something in English and it never means one of those things you listed as far as I am aware.\n\n \n\nSure, it's possible for people to misuse words, but I can't just misuse the word \"and\"  and misinterpret it as \"and give each of your heroes 20 resources and\" and then proceed to give myself 20 resources whenever a card effect says \"and\". "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995752","commentId":1995752,"userName":"Ecthelion III","timestamp":1453015956,"content":"The effect doesn't say \"target another copy\", it says \"for each resource that is ON another copy.\" The direct object is resource, not copy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995800","commentId":1995800,"userName":"NathanH","timestamp":1453019658,"content":"> I dunno, GrandSpleen.  I'm trying hard to understand the other side, but in what way and in what context in English can \"another\" ever be defined as \"each other\", \"all other\", or \"on other copies\" other than misuse?  The word \"another\" actually means something in English and it never means one of those things you listed as far as I am aware.\n\n \n\nThere are three princess in my castle. There are two princesses in Bowser's castle. There is a princess in Wario's castle.\n\n \n\nYou're sitting in my castle. How many princesses are in another castle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995805","commentId":1995805,"userName":"DukeWellington","timestamp":1453020087,"content":"1. \"Whenever you are under the mistletoe with another person of the opposite sex, give that person a kiss.\"\n\nThe above sentence is an example where the word \"another\" does not refer to one and only one person.\n\n2. \"Give another person a kiss.\"\n\nThis second example uses the word to refer to one and only one target.\n\nSo, purely in terms of a grammatical discussion the word \"another\" is not conclusive; it can be used both ways.\n\nGrandspleen, as usual, has a reasonable and clear breakdown. I do disagree only in so far as the second set of examples he gave are not ambiguous at all.\n\nI would not be surprised if the official word came down that you have to choose only one copy of keeping count, but by strict language this is not a \"wink wink\" case where we know what it is supposed to mean. I can guarantee that in a logical treatise or legal document the strict meaning of the phrasing would, in fact, lead one to add the difference from each other copy of keeping count. This is just a game, so we don't need to be anal about it, but there is also no reason to simply dismiss those who disagree with you.\n\nAlso, there is no way that keeping count targets a second copy of keeping count. Why would it? Just because it uses the word \"another\"? That makes no sense, sorry. What if a dwarf card said \"If you control another dwarf ally, this card gains sentinel\". That card would not target the second dwarf card.\n\nI do agree this is tiring. So at least we can agree on something.\n\nEdited January 17, 2016 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995845","commentId":1995845,"userName":"Edheliad","timestamp":1453023075,"content":"> I dunno, GrandSpleen.  I'm trying hard to understand the other side, but in what way and in what context in English can \"another\" ever be defined as \"each other\", \"all other\", or \"on other copies\" other than misuse?  The word \"another\" actually means something in English and it never means one of those things you listed as far as I am aware.\n> \n>  \n> \n> Sure, it's possible for people to misuse words, but I can't just misuse the word \"and\"  and misinterpret it as \"and give each of your heroes 20 resources and\" and then proceed to give myself 20 resources whenever a card effect says \"and\". \n\n \n\nAs I have already pointed out, no one is disagreeing with your definition of \"another\" as a single article. The issue is that the sentence structure does not preclude the existence of multiple single articles in the count. \n\n \n\nHad they used 'other' instead of 'another' there we would be counting up each resource token in play before applying the subtraction for the subject hero's own Keeping Count. It's usage makes sense in both readings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1995849","commentId":1995849,"userName":"Edheliad","timestamp":1453023263,"content":">  \n> \n> > If they wanted it to only refer to one other copy then they would have said, \"choose another copy of keeping count...\"\n> \n>  \n> \n> They can, but they don't have to.  See all the Dunedain attachments.  None explicitly says to \"choose another hero\" but it is implied that you choose one because it says \"another hero\".\n> \n>  \n\n \n\nThere's also the small matter of those attachments being physical objects being transferred from one hero to another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996006","commentId":1996006,"userName":"cmabr002","timestamp":1453037020,"content":">  \n> \n> > I dunno, GrandSpleen.  I'm trying hard to understand the other side, but in what way and in what context in English can \"another\" ever be defined as \"each other\", \"all other\", or \"on other copies\" other than misuse?  The word \"another\" actually means something in English and it never means one of those things you listed as far as I am aware.\n> \n>  \n> \n> There are three princess in my castle. There are two princesses in Bowser's castle. There is a princess in Wario's castle.\n> \n>  \n> \n> You're sitting in my castle. How many princesses are in another castle?\n> \n>  \n\n \n\nI think this is a misuse of the word \"another\".  However, apparently many people misuse it (it seems) and that's why there is confusion.  The answer to your question is \"2 or 1\" depending on which castle.  I can't simultaneously choose both.  If you wanted me to choose both you would have to say \"each other\" or \"other castles\".  The reason I can't choose both is because \"another\" refers to a single entity once selected."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996035","commentId":1996035,"userName":"cmabr002","timestamp":1453039575,"content":"> 1. \"Whenever you are under the mistletoe with another person of the opposite sex, give that person a kiss.\"\n> \n> The above sentence is an example where the word \"another\" does not refer to one and only one person.\n> \n> 2. \"Give another person a kiss.\"\n> \n> This second example uses the word to refer to one and only one target.\n> \n> So, purely in terms of a grammatical discussion the word \"another\" is not conclusive; it can be used both ways.\n> \n> Grandspleen, as usual, has a reasonable and clear breakdown. I do disagree only in so far as the second set of examples he gave are not ambiguous at all.\n> \n> I would not be surprised if the official word came down that you have to choose only one copy of keeping count, but by strict language this is not a \"wink wink\" case where we know what it is supposed to mean. I can guarantee that in a logical treatise or legal document the strict meaning of the phrasing would, in fact, lead one to add the difference from each other copy of keeping count. This is just a game, so we don't need to be anal about it, but there is also no reason to simply dismiss those who disagree with you.\n> \n> Also, there is no way that keeping count targets a second copy of keeping count. Why would it? Just because it uses the word \"another\"? That makes no sense, sorry. What if a dwarf card said \"If you control another dwarf ally, this card gains sentinel\". That card would not target the second dwarf card.\n> \n> I do agree this is tiring. So at least we can agree on something.\n\n \n\nI think you give good examples, but when I said another only refers to a single entity I meant to say \"refers to a single entity at a time\".  I think I already showed that \"another\" can refer to multiple entities in the example where I was saying \"going from one place to another\".  \"Another\" doesn't define what other place I'm going to.  The only thing that defines \"another\" in my example is once the individual goes to a place, be it randomly, or by choice.\n\n \n\nIn your example, I guess you theoretically could kiss 20 people simultaneously.\n\n \n\nIs there any reason why you wouldn't deal the entire deck as shadow cards if you canceled the first with Balin's ability?\n\nEdited January 17, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996048","commentId":1996048,"userName":"shosuko","timestamp":1453041127,"content":"There is no point to this debate...  The wording is ambiguous and unless a dev comes in, there is no \"right\" answer.\n\n \n\nWhat we can do is choose\n\n1 - easy mode - count the difference of every Keeping Count for a higher possible total.\n\n2 - hard mode - count the difference of only 1 Keeping Count for a lesser advantage.\n\n \n\nChoose which path you want for your game, and know that it's your choice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996065","commentId":1996065,"userName":"cmabr002","timestamp":1453042266,"content":"> There is no point to this debate...  The wording is ambiguous and unless a dev comes in, there is no \"right\" answer.\n> \n>  \n> \n> What we can do is choose\n> \n> 1 - easy mode - count the difference of every Keeping Count for a higher possible total.\n> \n> 2 - hard mode - count the difference of only 1 Keeping Count for a lesser advantage.\n> \n>  \n> \n> Choose which path you want for your game, and know that it's your choice.\n\n \n\nThere is a point, though.  If we accept that the word \"another\" is ambiguous, then Merry, Nenya, Spare Hood and Cloak, Elrond's Counsel, Graive Cairn, and Small Target, become completely and totally overpowered.  I mean, I guess someone can submit a rules inquiry about every single card in the game that used the word another, but that seems ridiculous to me.\n\nEdited January 17, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996084","commentId":1996084,"userName":"cmabr002","timestamp":1453043565,"content":">  \n> \n> >  \n> > \n> > > If they wanted it to only refer to one other copy then they would have said, \"choose another copy of keeping count...\"\n> > \n> >  \n> > \n> > They can, but they don't have to.  See all the Dunedain attachments.  None explicitly says to \"choose another hero\" but it is implied that you choose one because it says \"another hero\".\n> > \n> >  \n> \n>  \n> \n> There's also the small matter of those attachments being physical objects being transferred from one hero to another.\n> \n>  \n\n \n\nNothing in the rules explicitly prohibits an attachment from being in a constant loop of being attached to various single characters.  It's just that when you attach it, it says \"attach to a hero, or character\" which are both singular.  This is obviously a ridiculous notion so there is no point in going down this rabbit hole.  Simply put, since they use the word another, apparently, it is no longer clear whether or not I can trigger the action once and then constantly loop who they are attached to.\n\nEdited January 17, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996135","commentId":1996135,"userName":"Edheliad","timestamp":1453046389,"content":">  \n> \n> > There is no point to this debate...  The wording is ambiguous and unless a dev comes in, there is no \"right\" answer.\n> > \n> >  \n> > \n> > What we can do is choose\n> > \n> > 1 - easy mode - count the difference of every Keeping Count for a higher possible total.\n> > \n> > 2 - hard mode - count the difference of only 1 Keeping Count for a lesser advantage.\n> > \n> >  \n> > \n> > Choose which path you want for your game, and know that it's your choice.\n> \n>  \n> \n> There is a point, though.  If we accept that the word \"another\" is ambiguous, then Merry, Nenya, Spare Hood and Cloak, Elrond's Counsel, Graive Cairn, and Small Target, become completely and totally overpowered.  I mean, I guess someone can submit a rules inquiry about every single card in the game that used the word another, but that seems ridiculous to me.\n> \n>  \n\n \n\nIf 'another' was the only definitive word on those cards prohibiting multiple actions you might have a semblance of a point. \n\n \n\nYour obsession with a single word means you're missing the forest for the trees. And sentences are forests, friend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996226","commentId":1996226,"userName":"Teamjimby","timestamp":1453050595,"content":"It's clear that our interpretations of the English wording are not going to reach a consensus.  I would then point to the German version, which according to an earlier poster \"instructs you to definitely choose ONE other keeping count card.\"  So unless you get an official ruling that says otherwise, you should be playing it that way (also because of the Golden Rule)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996289","commentId":1996289,"userName":"cmabr002","timestamp":1453053185,"content":"Technically, Merry says \"ready another character\".  Nothing prevents you from readying multiple \"another\" characters under this strange interpretation of the word another that you all are arguing. \n\n \n\nMerry attacks with 20 other characters and destroys an enemy.  I ready \"another\" character (different from Merry), and then I ready \"another\" character because it is also different from Merry and so on and so forth until I ready all 20 characters that participated in that attack.  Apparently it doesn't matter that \"character\" is singular or that another only refers to one entity once it is elected.\n\nEdited January 17, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996342","commentId":1996342,"userName":"DukeWellington","timestamp":1453055376,"content":"cmbar002, you have strange obsession with this debate, but also a strange method of debate. I don't understand how \"most of the time 'another' refers to only one thing but sometimes can refer to many examples of one thing\" becomes or must become, \"everytime you use the word 'another' it now refers to many examples of one thing\". As with every other word ever, the word can mean different things depending on the context. Do you struggle this much with every other word you use which has more than one definition or nuance of use? Using language must drive you crazy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996367","commentId":1996367,"userName":"cmabr002","timestamp":1453056477,"content":"> cmbar002, you have strange obsession with this debate, but also a strange method of debate. I don't understand how \"most of the time 'another' refers to only one thing but sometimes can refer to many examples of one thing\" becomes or must become, \"everytime you use the word 'another' it now refers to many examples of one thing\". As with every other word ever, the word can mean different things depending on the context. Do you struggle this much with every other word you use which has more than one definition or nuance of use? Using language must drive you crazy.\n\n \n\nIf it said \"each other\" then it would make sense to interpret the way you all are.  It doesn't and just because you CAN put those words there and have the sentence still make grammatical sense doesn't mean it has the same meaning.  \"Another\" should never mean \"each other\" even if people misuse it to mean that.  Eventually, because of misuse the word may change meaning to include \"each other\", but as far as I was aware, we hadn't reached that point.  Based on this discussion though, I'm hard pressed to argue that we haven't reached that point as it seems I am in the minority here.  If it can mean \"each other\" then I see no compelling reason why Merry can't ready each character that participated in the attack.  Unfortunately, that breaks the game and that is why it is important to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996391","commentId":1996391,"userName":"DukeWellington","timestamp":1453057622,"content":"Well, since you enjoy repeating yourself I will also repeat that context matters. When you target something the word \"another\" cannot mean that you repeat it endlessly. I have no clue why you insist that this consequence must necessarily follow. It makes no sense. It seems like you are just being a jerk. I don't like saying that, but that is how it comes accross."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996401","commentId":1996401,"userName":"cmabr002","timestamp":1453058036,"content":"> Well, since you enjoy repeating yourself I will also repeat that context matters. When you target something the word \"another\" cannot mean that you repeat it endlessly. I have no clue why you insist that this consequence must necessarily follow. It makes no sense. It seems like you are just being a jerk. I don't like saying that, but that is how it comes accross.\n\n \n\nI agree that context matters for the purposes of language, but in this context another cannot mean each other.  I'm pretty sure it can never mean each other unless it is misuse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996436","commentId":1996436,"userName":"DukeWellington","timestamp":1453059349,"content":"Correct, \"another\" does not mean \"each other\", it means \"another\". However, in the context in which several instances can be repeated hypothetically, as in the many examples given, then \"another\" can refer to multiple examples. Admitting this does not then necessitate that you must now use \"another\" to always refer to multiple instances, even in times when it does not fit context. Sorry, but this is always how language works. It is not misuse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996445","commentId":1996445,"userName":"cmabr002","timestamp":1453059798,"content":"> Correct, \"another\" does not mean \"each other\", it means \"another\". However, in the context in which several instances can be repeated hypothetically, as in the many examples given, then \"another\" can refer to multiple examples. Admitting this does not then necessitate that you must now use \"another\" to always refer to multiple instances, even in times when it does not fit context. Sorry, but this is always how language works. It is not misuse.\n\n \n\nI can't seem to articulate why you can't reference both copies for the benefit simultaneously well enough so it seems the conversation needn't continue.  I already tried articulating it, but was unsuccessful at conveying what I meant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996478","commentId":1996478,"userName":"Edheliad","timestamp":1453061478,"content":"> It's clear that our interpretations of the English wording are not going to reach a consensus.  I would then point to the German version, which according to an earlier poster \"instructs you to definitely choose ONE other keeping count card.\"  So unless you get an official ruling that says otherwise, you should be playing it that way (also because of the Golden Rule).\n\n \n\nNo one's arguing about the intention of the card any more. It's all about the one person who can't accept how there could possibly be any confusion about the English wording.\n\n \n\nIt's Team \"I can see how that can be read both ways\" against Team \"THE DICTIONARY DEFINES 'ANOTHER' AS...\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1996787","commentId":1996787,"userName":"shosuko","timestamp":1453074724,"content":"You're just running on a slippery slope argument now...\n\n \n\nTo say \"A card which references another card as a sort of comparison\" is the same as \"a card which targets and effects another card\" isn't arguing or proving anything.\n\n \n\nThe card may very well be intended to work the way you say...  That doesn't mean everyone else here is ignorant.\n\n \n\nOur opinion that this card could reference both has nothing to do with Marry or other \"target another\" type cards.\n\n \n\nImagine if I said \"Drive to work another way\" you would then pick a way and drive it.  We all understand this...\n\n \n\nBut if I said \"How much faster is this path than another path\" you could easily say \"It's t faster than yPath and t faster than zPath.\"\n\n \n\nAs has been said - context matters here.  If I direct an action to another card, it can certainly only effect one other card...  But if I draw a comparison to another card, and there are multiple valid targets... how is it wrong to compare to each of them?\n\n \n\nThe card is comparing the amount of resources, and says to get +1 attack for each resource on another copy above the number this one has.  By drawing a comparison rather than target or interact with any 1 version, it opens up the ambiguity to refer to both.  The core part of the sentence is the number of tokens too, which is why someone may even consider you add them all up rather than compare each card.\n\n \n\nNow - you've said your peace.  We understand your point of view...  You don't need to repeat it again for us to read it.  Simply saying the same things again isn't debating.\n\n \n\nAnd so you know - I do agree with you.  It's more likely intended to be compared to a single copy of Keeping Count than to pool the comparison together, but it isn't certain.  At least not in the English version.\n\nEdited January 18, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1997318","commentId":1997318,"userName":"JanB","timestamp":1453104641,"content":"I interpret Keeping Count as the scene in which Legolas and Gimli fight side by side and count their victims in comparison to each other. The card itself should give the character who is last (or behind the first) the opportunity to catch up by boosting his attack by the difference to the first person. So for me, it makes no sense to sum up the differences from different card copies in order to calculate the attack boost. Each character compare his counts with the one who has the most kills .. and then gets his attack boost out of the difference.\n\nEdited January 18, 2016 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1998969","commentId":1998969,"userName":"Seastan","timestamp":1453162878,"content":"> I interpret Keeping Count as the scene in which Legolas and Gimli fight side by side and count their victims in comparison to each other. The card itself should give the character who is last (or behind the first) the opportunity to catch up by boosting his attack by the difference to the first person. So for me, it makes no sense to sum up the differences from different card copies in order to calculate the attack boost. Each character compare his counts with the one who has the most kills .. and then gets his attack boost out of the difference.\n\n \n\nTook the words right out of my mouth.\n\n \n\nPeople are getting too bogged down in the language and missing the entire point of the card. It's \"Keeping Count\". Do the warriors feel motivated to catch up to the kill-count leader, or the combined kill count difference of all the other warriors in the battle? I think the answer is obvious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1999706","commentId":1999706,"userName":"Edheliad","timestamp":1453203959,"content":"If I'm third I'm going to try even harder than if I were in second.\n\nWhy is the card picture Boromir's shield if it's a Legolas & Gimli card, anyway?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=1999940","commentId":1999940,"userName":"shosuko","timestamp":1453212836,"content":"On that note Seastan:  When I play a multiplayer game like an FPS or such, I often DO compare myself versus the entire team.  Sometimes on a team of 8-16 a single person can be half the score...  I've been equal to 1/4th of a 128 member team before.\n\n \n\nThat said, after this thread debate I agree that Keeping Count makes sense to only compare to a single other copy.  If you had the example presented in this thread\n\n \n\n3 copies of Keeping Count equipped on heroes. Glorfindel had 5 tokens, Elrohir had 3, and Elladan had 1.\n\n \n\nElladan would receive +4, and Elrohir would receive +2.\n\n \n\nI fully support this position, and do not feel it is very ambiguous at this point.\n\nEdited January 19, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2000343","commentId":2000343,"userName":"Seastan","timestamp":1453223312,"content":"> Keeping Count only targets a single other copy of Keeping Count when calculating the attack bonus. So, if there were 3 copies of Keeping Count in play, one on Glorfindel with 5 tokens, one on Elrohir with 3 tokens, and one on Elladan with 1 token, then Elladan could get at most a total of +4 attack strength from Keeping Count (4 being the difference between his 1 token and Glorfindel’s 5). \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2000656","commentId":2000656,"userName":"Slothgodfather","timestamp":1453229822,"content":"> Why is the card picture Boromir's shield if it's a Legolas & Gimli card, anyway?\n\n \n\nThe same reason the hero Amarthiul looks like a lady to everyone but is supposed to be a guy.  Art isn't always \"right\" with the context or depiction of the ability/effect/person/etc.   Also, I'm admittedly not up that much on the lore, but why is this considered Boromir's shield?  Surely lots of soldiers would keep count in such a manor. \n\nEdited January 19, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001189","commentId":2001189,"userName":"Edheliad","timestamp":1453243501,"content":">  \n> \n> > Why is the card picture Boromir's shield if it's a Legolas & Gimli card, anyway?\n> \n>  \n> \n> The same reason the hero Amarthiul looks like a lady to everyone but is supposed to be a guy.  Art isn't always \"right\" with the context or depiction of the ability/effect/person/etc.   Also, I'm admittedly not up that much on the lore, but why is this considered Boromir's shield?  Surely lots of soldiers would keep count in such a manor. \n> \n>  \n\n \n\nIt looks like Boromir's outfit from the movies is all. I think his shield is round in the books as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001448","commentId":2001448,"userName":"cmabr002","timestamp":1453255440,"content":"> But if I said \"How much faster is this path than another path\" you could easily say \"It's t faster than yPath and t faster than zPath.\"\n> \n>  \n> \n> As has been said - context matters here.  If I direct an action to another card, it can certainly only effect one other card...  But if I draw a comparison to another card, and there are multiple valid targets... how is it wrong to compare to each of them?\n> \n>  \n> \n> The card is comparing the amount of resources, and says to get +1 attack for each resource on another copy above the number this one has.  By drawing a comparison rather than target or interact with any 1 version, it opens up the ambiguity to refer to both.  The core part of the sentence is the number of tokens too, which is why someone may even consider you add them all up rather than compare each card.\n\n \n\nI think this sentence (bold above) has helped me understand what is confusing to people about the wording on Keeping Count.  When something draws a comparison to \"another\" card, and there are multiple valid targets it is wrong to draw a comparison to each of them because the use of the word another in the first clause prohibits it (another cannot allow the comparison of each by definition).  You are forced to draw a comparison to one of them even if you are allowed to be the one that chooses which is more beneficial of the multiple targets.\n\n \n\nIf it said \"If I draw comparison to each card, and there are multiple valid targets...\" then it is not wrong to compare it to each."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001480","commentId":2001480,"userName":"DukeWellington","timestamp":1453258037,"content":"I really hope this thread can die now that we have official word. I stand by the analysis of the language. The use of the word \"another\" does not prohibit comparision with multiple valid examples, nor does it require it. The use of the word is vague. Now it has been clarified. That's all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001488","commentId":2001488,"userName":"GrandSpleen","timestamp":1453258543,"content":"Really what's going on here is that language is alive, and the dictionary definition of \"another\" might not hold up to its actual use in living language."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001555","commentId":2001555,"userName":"sappidus","timestamp":1453263342,"content":"Who are all you people managing to get three copies of Keeping Count out in the first place?!\n\n(Thank God for the Caleb ruling... Otherwise I had visions of Seastan figuring out some way of abusing the card by running 4 of the same mono-Tactics deck in conjunction... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001788","commentId":2001788,"userName":"Sin21","timestamp":1453280557,"content":">  \n> \n> > Keeping Count only targets a single other copy of Keeping Count when calculating the attack bonus. So, if there were 3 copies of Keeping Count in play, one on Glorfindel with 5 tokens, one on Elrohir with 3 tokens, and one on Elladan with 1 token, then Elladan could get at most a total of +4 attack strength from Keeping Count (4 being the difference between his 1 token and Glorfindel’s 5). \n> > \n> > Cheers,\n> > Caleb\n> \n>  \n\nI'm glad german translators seem to do a good Job... sometimes ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nThe Problem definitely evolves around the english language =D"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2001808","commentId":2001808,"userName":"Edheliad","timestamp":1453282691,"content":"> Who are all you people managing to get three copies of Keeping Count out in the first place?!\n> \n> (Thank God for the Caleb ruling... Otherwise I had visions of Seastan figuring out some way of abusing the card by running 4 of the same mono-Tactics deck in conjunction... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\n \n\nI use it in an Erestor/Arwen deck with Elven light. In my last two games I've ended up with all three in play pretty early."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2002340","commentId":2002340,"userName":"Slothgodfather","timestamp":1453307914,"content":"I would think you'd only want one out for awhile to give a good advantage to the others.  The problem I have with the card is it takes so many turns before it really is worth it.  By late game our boards are generally well established enough that the bonuses from KC are just overkill and unnecessary.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2002593","commentId":2002593,"userName":"Teamjimby","timestamp":1453314874,"content":"> Who are all you people managing to get three copies of Keeping Count out in the first place?!\n> \n> (Thank God for the Caleb ruling... Otherwise I had visions of Seastan figuring out some way of abusing the card by running 4 of the same mono-Tactics deck in conjunction... ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\nMy favorite method is Hama + Foe Hammer (+ optional Rohan Warhorse).  I've had a few games where I was able to get 2 kills per turn with Hama, then give someone a huge attack boost by turn 4-6.\n\nEdited January 20, 2016 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199242-keeping-count/?do=findComment&comment=2002722","commentId":2002722,"userName":"Edheliad","timestamp":1453318391,"content":"Playing solo it's probably more trouble than it's worth but multiplayer (or playing two-handed) there's usually enough fighting going on to rack up plenty of tokens on a main attacker.\n\n \n\nOn a quest like Journey Down the Anduin - where enemies can pile up at the end - it can be very welcome to see your least-capable warrior sitting on a +3/4/5 to attack."}]}