{"url":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/","title":"Deck power tiers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1994525","commentId":1994525,"userName":"DunedainLoreKeeper","timestamp":1452950095,"content":"Hey guys and gals. I'm interested in what everybody's opinions are on deck tiers. We all use phrases like 'viable' 'top tier' etc. but what does that mean to you?\n\n \n\nWhat tiers of decks do you have in your own mind, and what are the requirements to those? Is it beating certain quests with a certain win rate? If so, what quests and win rate? Or do you judge them on what the deck can put on the table in the first few turns and decide on that? Do you have a 'golden standard'?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1994886","commentId":1994886,"userName":"Fingolfin Fate","timestamp":1452970720,"content":"Elrond-Vilya-Gandalf and Celeborn-Galadriel-Silvan decks are two examples that can beat pretty much anything very reliably. Tactics Boromir Spirit Glorfindel would be another super deck. Then you have Dwarves and Outlands which I am sure are still very strong but I have not tried them in years now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1994983","commentId":1994983,"userName":"John Constantine","timestamp":1452974149,"content":"Broken Tier: Stuff that Seastan makes, you know. The one which wins the game on the planning phase of turn 1.\n\n \n\nGod Tier: Powerdecks which abuse every aspect of the game allowed and don't feel shy about it. \n\n \n\nGood Tier: Decks built based upon lucrative synergy, but rarely delve beyond that synergy, unlike previous tier. \n\n \n\nDecent Tier: Decks that lack any specific purpose, but still fiar overall well in at least some of the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1995082","commentId":1995082,"userName":"DukeWellington","timestamp":1452977566,"content":"Broken tier: Decks that utilize aspects of the game that everyone agrees should be nerfed.\n\nOverpowered tier: One deck to rule them all decks. Decks that play only to win, with no theme whatever. Such decks use extremely powerful cards and comboes that some say should be nerfed but most do not. Some players find this kind of deck distasteful and boring because it essentially works regardless of the quest and encounter deck, thus ignoring and destroying the story and flavor of the game.\n\nPower tier: Decks that the vast majority of people play most of the time. These decks are made to win more than made for theme. They can beat some quests, but lose to many others. Often they are decks with a central core of cards that gets tweaked and modified for the specific quest.\n\nThematic tier: Decks that are built with theme over winning in mind. They are often targeted for very specific quests, mostly the saga quests, and are played in easy mode (or half easy mode where resources are added, but cards are not removed from the encounter deck). Even if they lose a lot the games are always intense and if you beat a quest once you are satisfied."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1995842","commentId":1995842,"userName":"Fingolfin Fate","timestamp":1453022976,"content":"Well, I think thematic tiers can often be power tiers and sometimes ever overpowered ones. As I mentioned the Galadhrim, I have only Silvan allies and cards with Silvan themes (well maybe except A Very Good Tale but the deck can also do without) and I think I am not the only one thinking it is one of the strongest decks out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1995918","commentId":1995918,"userName":"PsychoRocka","timestamp":1453028962,"content":"I think you have more or less hit it on the head duke, except I would disagree and say certain types of power deck can take on the majority of quests released when run with a good sideboard. Everything else is spot on though and I agree that the majority of people most likely play this sort of tier of deck. I would also say pretty much any deck running Gandalf and his toys falls into the overpowered tier for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1998652","commentId":1998652,"userName":"DunedainLoreKeeper","timestamp":1453153375,"content":"Interesting answeres. I'm surprised everybody is talking about the deck-buildin philosophy when determining tiers rather than their achievements against the encounter deck. Although the concensus here is that Dwarfs, Outlands and Silvan can be build super thematically and still be top-tier decks.\n\n \n\nThat begs the question: how do you differentiate between Overpowered, Power and Thematic? Let's say you build a deck with Dunhere, and put a lot of stuff in there to make his 'attack into the staging area' effect work. Obviously this wouldn't constitute as a thematic deck, but how do you determine how good it is? Duke mentions 'beat some quests but lose to many others'. What winrates are you thinking about then? Is beating it 1in8 games enough or are you talking about 50%? \n\n \n\nOr if we are talking about theme, what about the upcoming 'scout' deck. Let's say I want to build a scout deck when the next cycle is out, how do you determine wether it sits next to the Silvan and Dwarfs or is more akin to a crafsmen deck? What about when you are building a new deck yourself, when are you satisfied with it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1999273","commentId":1999273,"userName":"Seastan","timestamp":1453176090,"content":"In academia there is something called an h-index to measure both an author's productivity and impact. It's the highest number \"h\" where you can truthfully say \"The author has h papers that have been cited at least h times.\" So if an author has 100 papers but each one only gets cited once, then they only have an h-index of 1. Similarly, if they only have one paper, but it is cited 100 times, they still only have an h-index of 1. To get an h-index of 100, you need 100+ papers where each one has been cited 100+ times.\n\n \n\nI would propose a similar metric for ranking decks, a so-called q-index, to measure both versatility and power. It's the highest percentage q where you can say \"The deck beats q% of the quests q% of the time.\" So if a deck beats 1% of the quests every time, it's not that great a deck and only has a q-index of 1. Similarly, if it beats 100% of the quests only 1% of the time, it also has a q-index of only 1. To get a q-index of 100 the deck needs to beat 100% of the quests 100% of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1999448","commentId":1999448,"userName":"wolframius","timestamp":1453188021,"content":"> In academia there is something called an h-index to measure both an author's productivity and impact. It's the highest number \"h\" where you can truthfully say \"The author has h papers that have been cited at least h times.\" So if an author has 100 papers but each one only gets cited once, then they only have an h-index of 1. Similarly, if they only have one paper, but it is cited 100 times, they still only have an h-index of 1. To get an h-index of 100, you need 100+ papers where each one has been cited 100+ times.\n> \n>  \n> \n> I would propose a similar metric for ranking decks, a so-called q-index, to measure both versatility and power. It's the highest percentage q where you can say \"The deck beats q% of the quests q% of the time.\" So if a deck beats 1% of the quests every time, it's not that great a deck and only has a q-index of 1. Similarly, if it beats 100% of the quests only 1% of the time, it also has a q-index of only 1. To get a q-index of 100 the deck needs to beat 100% of the quests 100% of the time.\n\n \n\nNice, the only problem to use it in practice would be to determine how much games at each quest do you need to determine the win-percentage.\n\nEdited January 19, 2016 by wolframius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=1999466","commentId":1999466,"userName":"John Constantine","timestamp":1453189291,"content":"How about 100? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2000169","commentId":2000169,"userName":"Authraw","timestamp":1453219463,"content":"Makes me want to do some sort of analysis to find a representative subset of the quest pool whose q-score approximates the entire pool.\n\nAnd then I remember that I still haven't played all of the quests of Angmar Awakened yet, and with The Grey Havens just around the corner it doesn't seem likely I'll ever find the time for such a project..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2000191","commentId":2000191,"userName":"Kakita Shiro","timestamp":1453219858,"content":"> In academia there is something called an h-index to measure both an author's productivity and impact. It's the highest number \"h\" where you can truthfully say \"The author has h papers that have been cited at least h times.\" So if an author has 100 papers but each one only gets cited once, then they only have an h-index of 1. Similarly, if they only have one paper, but it is cited 100 times, they still only have an h-index of 1. To get an h-index of 100, you need 100+ papers where each one has been cited 100+ times.\n> \n>  \n> \n> I would propose a similar metric for ranking decks, a so-called q-index, to measure both versatility and power. It's the highest percentage q where you can say \"The deck beats q% of the quests q% of the time.\" So if a deck beats 1% of the quests every time, it's not that great a deck and only has a q-index of 1. Similarly, if it beats 100% of the quests only 1% of the time, it also has a q-index of only 1. To get a q-index of 100 the deck needs to beat 100% of the quests 100% of the time.\n\nThat's....that's a lot of games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2000225","commentId":2000225,"userName":"Seastan","timestamp":1453220614,"content":"> Makes me want to do some sort of analysis to find a representative subset of the quest pool whose q-score approximates the entire pool.\n> \n> And then I remember that I still haven't played all of the quests of Angmar Awakened yet, and with The Grey Havens just around the corner it doesn't seem likely I'll ever find the time for such a project...\n\n \n\nThis is a good idea, maybe pick a set of quests that are especially difficult in a particular aspect of the game.\n\n \n\nEnemies: Massing at Osgiliath\n\nLocations: Emyn Muil Nightmare\n\nTreachery/Shadow cancellation: Road to Rivendell Nightmare\n\nWillpower: Redhorn Gate Nightmare\n\nAttack: Into Ithilien\n\nDefense: The Siege of Cair Andros\n\nAll of the above: The Battle of the Five Armies\n\n \n\n \n\n>  \n> \n> > In academia there is something called an h-index to measure both an author's productivity and impact. It's the highest number \"h\" where you can truthfully say \"The author has h papers that have been cited at least h times.\" So if an author has 100 papers but each one only gets cited once, then they only have an h-index of 1. Similarly, if they only have one paper, but it is cited 100 times, they still only have an h-index of 1. To get an h-index of 100, you need 100+ papers where each one has been cited 100+ times.\n> > \n> >  \n> > \n> > I would propose a similar metric for ranking decks, a so-called q-index, to measure both versatility and power. It's the highest percentage q where you can say \"The deck beats q% of the quests q% of the time.\" So if a deck beats 1% of the quests every time, it's not that great a deck and only has a q-index of 1. Similarly, if it beats 100% of the quests only 1% of the time, it also has a q-index of only 1. To get a q-index of 100 the deck needs to beat 100% of the quests 100% of the time.\n> \n> That's....that's a lot of games.\n> \n>  \n\n \n\nIt's more of a theoretical measurement. You would probably just play a handful of quests a handful of times and make a estimate of the q-index."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2000319","commentId":2000319,"userName":"Authraw","timestamp":1453222668,"content":"We could actually apply the index in reverse to encounter decks to get a more useful difficulty rating as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2005606","commentId":2005606,"userName":"DunedainLoreKeeper","timestamp":1453417089,"content":"I asked for a more detailed view and you guys did not dissapoint! Not sure if I have the time to play 100 games with each deck though. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] I really like the idea of using a few key quests to be representative of certain obstacle types the encounter deck can throw at you. Is Seastan's list a good representation of the various things the encounter deck can throw at us? I would probably add a direct damage quest as well. We could make a quest tier list, where say, for enemy management if you can consistantly beat 7th level, you are mid tier, but if you consistantly beat Wastes of Eriador you are high tier on that specific aspect.\n\n \n\n \n\nMeamwhile I took some time to think of my own tier list. I generally play through an entire cycle with a deck and small sideboard to see how it holds up against various challenges. So I'll use that format to rate decks in a 'one deck to rule them all' type of way.\n\n \n\nGod tier: uses broken mechanics to win any game almost garuanteed.\n\n \n\nTop tier: Can beat every quest of the cycle with more than 50% chance. Can beat several quests with almost 100% change.\n\n \n\nHigh tier: Can beat every quest in the cycle. Always puts up a good fight against the hardest quest(s) (Carn Dum) but generally loses. Can beat several quests almost 100% of the time.\n\n \n\nMid tier: Can beat most or al all of the quests in a cycle. Might repeatedly lose to one quest unless super-lucky but overall wins over 50% against the other quests.\n\n \n\nLow tier: Can beat most of the 'old' quests from the first two cycles, but struggles against most newer quests. Cannot beat strongest quests ever, and might also lose consistently to less tough but still hard quests (like Wastes of Eriador).\n\n \n\nBottom tier: Can only beat a few quests. Struggles even with 'old' quests. Can only compete against newer quests in easy mode\n\n \n\nSpecial tier: Specialty deck built against a specific quest (say Battle for Lake town). Results against other quests irrelevant.\n\n \n\n \n\nIn multiplayer it's harder to judge. Decks are a single team and it's more difficult to see which deck is underperforming when a group effort fails."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019006","commentId":2019006,"userName":"JonofPDX","timestamp":1454006476,"content":"> Elrond-Vilya-Gandalf and Celeborn-Galadriel-Silvan decks are two examples that can beat pretty much anything very reliably. Tactics Boromir Spirit Glorfindel would be another super deck. Then you have Dwarves and Outlands which I am sure are still very strong but I have not tried them in years now.\n\n \n\nOutlands is still Outlands. They've slipped a little with some of the harsher shadow and treachery effects we've been getting but can still absolutely beat any normal Quest if allowed to establish themselves. It's biggest weakness is what Outlands' weakness has always been--it can be slow to start and can struggle against Quests that start you against heavy opposition. That problem decreases as you add players, though. \n\n \n\nAnd for the record, I'm glad Outlands is still great as there isn't a replacement for it yet (a relatively self-contained group of cards that work together to form a powerful, easy-to-play and deck-build, easy to tweak set). Ents might get there but they aren't quite there yet. If you're going to continue to make Quests harder and harder you need this kind of set in the cardpool so that casual or new players that don't necessarily have the skill yet to take on some of  the harder challenges (or simply don't have the available cardpool to build other top-tier decks that require cards form a wider range of APs and Deluxes) can still play and enjoy the game without pulling any other players down or being forced to stay in the older, easier Quests.\n\n \n\nDwarves are another story. They are still powerful but no longer in that top-tier. Noldor-discard, Silvan-bounce, Elrond-Vilya engine and Hobbit Secrecy all surpass it. I would put current Dwarves more in line with...Gondor and Ranger decks? Good, but against a tough quest you can't be assured victory. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019064","commentId":2019064,"userName":"Gizlivadi","timestamp":1454007838,"content":"Hobbit secrecy better than Dwarves? Yeah, not seeing it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019146","commentId":2019146,"userName":"cmabr002","timestamp":1454009788,"content":"> Hobbit secrecy better than Dwarves? Yeah, not seeing it.\n\n \n\nYeah, my Dwarf deck has no problem handling the large majority of scenarios.  In fact, I've beaten nearly every scenario in the game using it in 2-player (alongside Elrond, Glorfindel, Bifur).  Most of the time we win on the first try unless we lose to something \"cheesy\" (like Sleeping Sentry) because we like to play the scenarios blind.  The two decks together really only struggle with quests where the first quest card is Siege.\n\n \n\nI admit, my Dwarf deck is nicely complemented by my friend's deck which has healing/location control/treachery and shadow cancellation, but including Will of the West in my deck makes healing, treacheries, and shadow cards less troublesome as you can just let all your Dwarves die and then recycle them.  With high willpower, outquesting all the locations/staging area is easy so you can ignore them unless the locations have text that punish you for leaving them in play (which I guess is sort of common).  Erebor Battlemaster + Erebor Record-keeper makes killing enemies a breeze.  Sneak Attack/Gandalf combo makes it very easy to keep threat low (which can be a problem for Dwarves if you're not running Nori) especially since you get to use Gandalf up to 12 times since you're going to Will of the West at some point anyway.\n\nEdited January 28, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019371","commentId":2019371,"userName":"JonofPDX","timestamp":1454014235,"content":">  \n> \n> > Hobbit secrecy better than Dwarves? Yeah, not seeing it.\n> \n>  \n> \n> Yeah, my Dwarf deck has no problem handling the large majority of scenarios.  In fact, I've beaten nearly every scenario in the game using it in 2-player (alongside Elrond, Glorfindel, Bifur).  Most of the time we win on the first try unless we lose to something \"cheesy\" (like Sleeping Sentry) because we like to play the scenarios blind.  The two decks together really only struggle with quests where the first quest card is Siege.\n> \n>  \n> \n> I admit, my Dwarf deck is nicely complemented by my friend's deck which has healing/location control/treachery and shadow cancellation, but including Will of the West in my deck makes healing, treacheries, and shadow cards less troublesome as you can just let all your Dwarves die and then recycle them.  With high willpower, outquesting all the locations/staging area is easy so you can ignore them unless the locations have text that punish you for leaving them in play (which I guess is sort of common).  Erebor Battlemaster + Erebor Record-keeper makes killing enemies a breeze.  Sneak Attack/Gandalf combo makes it very easy to keep threat low (which can be a problem for Dwarves if you're not running Nori) especially since you get to use Gandalf up to 12 times since you're going to Will of the West at some point anyway.\n> \n>  \n\n \n\nI might be willing to reconsider that.\n\n \n\nI definitely feel like Hobbit Secrecy is a bit stronger at this point in the game. And I think if you took a random quest and threw both a traditional Dwarf deck and a Hobbit Secrecy deck at it the Hobbits would fare a bit better on average (obviously, a lot of that would depend on the specific Quest).\n\n \n\nBut I might be biased. I love my Dwarf decks. I have a pair (designed to work together, obviously) that has beaten all but 1 quest in the first 4 cycles and the Hobbit Boxes (could not beat Into Ithilien with them even after, like, a dozen tries). As much as I love them though, they began to struggle in the last couple of cycles with a lack of defense and on-the-whole low HP and they have not continued to get a lot of support. Not to mention, Errata hurt them harder than most (Erebor Battle Master and Nori most notably).\n\n \n\nHobbit Secrecy, on the other hand, has gotten quite a bit of support from Bill, Hobbit cloak, etc.  Not to mention, the release of Spirit Merry now allows most of these decks to stay in Secrecy almost permanently making not only clutch Secrecy effects like Resourceful and Timely Aid more versatile but also boosting pseudo-secrecy cards like Courage Awakened.\n\n \n\nBut, and this is a big but, my view here is probably a bit skewed. For one, I do not modify my decks from Quest to Quest which means I probably over-value the flexibility of Hobbit Secrecy vs how some other people may rate them. More importantly, though, I build my decks with an eye towards theme. My Dwarf decks are Dwarf decks. No non-dwarf allies (other than Gandalf) and no Attachments that explicitly align with another faction (Steward of Gondor or Celebrian Stone, for instance). My Hobbit deck, on the other hand, is much more thematically happy with a more diverse pool of Attachments and Allies because of the way I see that deck (the little Hobbits sneaking along and being aided and covered for by the Great and Good of Middle-Earth).\n\n \n\nSo yeah—you are probably right. If you deck-build for it Dwarves can still probably be top-tier. But for flexibility Hobbit Secrecy can’t be ignored and I still think that Hobbit Secrecy will normally serve you better solo or in any situation where the two decks aren't constructed specifically to work together. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019411","commentId":2019411,"userName":"cmabr002","timestamp":1454014878,"content":">  \n> \n> >  \n> > \n> > > Hobbit secrecy better than Dwarves? Yeah, not seeing it.\n> > \n> >  \n> > \n> > Yeah, my Dwarf deck has no problem handling the large majority of scenarios.  In fact, I've beaten nearly every scenario in the game using it in 2-player (alongside Elrond, Glorfindel, Bifur).  Most of the time we win on the first try unless we lose to something \"cheesy\" (like Sleeping Sentry) because we like to play the scenarios blind.  The two decks together really only struggle with quests where the first quest card is Siege.\n> > \n> >  \n> > \n> > I admit, my Dwarf deck is nicely complemented by my friend's deck which has healing/location control/treachery and shadow cancellation, but including Will of the West in my deck makes healing, treacheries, and shadow cards less troublesome as you can just let all your Dwarves die and then recycle them.  With high willpower, outquesting all the locations/staging area is easy so you can ignore them unless the locations have text that punish you for leaving them in play (which I guess is sort of common).  Erebor Battlemaster + Erebor Record-keeper makes killing enemies a breeze.  Sneak Attack/Gandalf combo makes it very easy to keep threat low (which can be a problem for Dwarves if you're not running Nori) especially since you get to use Gandalf up to 12 times since you're going to Will of the West at some point anyway.\n> > \n> >  \n> \n>  \n> \n> But, and this is a big but, my view here is probably a bit skewed. For one, I do not modify my decks from Quest to Quest which means I probably over-value the flexibility of Hobbit Secrecy vs how some other people may rate them. More importantly, though, I build my decks with an eye towards theme. My Dwarf decks are Dwarf decks. No non-dwarf allies (other than Gandalf) and no Attachments that explicitly align with another faction (Steward of Gondor or Celebrian Stone, for instance). My Hobbit deck, on the other hand, is much more thematically happy with a more diverse pool of Attachments and Allies because of the way I see that deck (the little Hobbits sneaking along and being aided and covered for by the Great and Good of Middle-Earth).\n\n \n\nYeah, a Dain, Thorin, Ori deck without Steward of Gondor would be really lackluster."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019753","commentId":2019753,"userName":"PocketWraith","timestamp":1454022337,"content":"Yeah, no. Dwarves are still super-good, and Dain is still the most powerful hero in the game. My Dwarf deck still beats most quests blind on the first attempt, and it's not even that well built as Dwarf decks go.\n\nIf you block off certain cards for thematic reasons, that's fair enough, but it doesn't mean the archetype is less powerful, it means you're deliberately handicapping yourself, which obviously is not a good recipe for making your deck top-tier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019806","commentId":2019806,"userName":"JonofPDX","timestamp":1454024318,"content":"> Yeah, no. Dwarves are still super-good, and Dain is still the most powerful hero in the game. My Dwarf deck still beats most quests blind on the first attempt, and it's not even that well built as Dwarf decks go.\n> \n> If you block off certain cards for thematic reasons, that's fair enough, but it doesn't mean the archetype is less powerful, it means you're deliberately handicapping yourself, which obviously is not a good recipe for making your deck top-tier.\n\n \n\n...Which is why I said I was reconsidering before giving a basis for my initial statement. \n\n \n\nBeyond that I was just saying that Hobbit Secrecy was very flexible and that it might be the better choice in solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2019985","commentId":2019985,"userName":"Seastan","timestamp":1454032098,"content":">  \n> \n> > Yeah, no. Dwarves are still super-good, and Dain is still the most powerful hero in the game. My Dwarf deck still beats most quests blind on the first attempt, and it's not even that well built as Dwarf decks go.\n> > \n> > If you block off certain cards for thematic reasons, that's fair enough, but it doesn't mean the archetype is less powerful, it means you're deliberately handicapping yourself, which obviously is not a good recipe for making your deck top-tier.\n> \n>  \n> \n> ...Which is why I said I was reconsidering before giving a basis for my initial statement. \n> \n>  \n> \n> Beyond that I was just saying that Hobbit Secrecy was very flexible and that it might be the better choice in solo.\n> \n>  \n\n \n\nI'd love to see your Hobbit Secrecy deck. I can't imagine how they are anywhere in the same league as Dwarves. In fact, of all the races that are viable against a large number of quests, I'd rank Hobbits the lowest. How do Hobbits fare against recent quests like Wastes, Carn Dum, and Dread Realm?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2020245","commentId":2020245,"userName":"leptokurt","timestamp":1454048201,"content":"tier 1: decks that are fun to play\n\n \n\ntier 2: decks that are boring"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2022248","commentId":2022248,"userName":"JonofPDX","timestamp":1454118233,"content":">  \n> \n> >  \n> > \n> > > Yeah, no. Dwarves are still super-good, and Dain is still the most powerful hero in the game. My Dwarf deck still beats most quests blind on the first attempt, and it's not even that well built as Dwarf decks go.\n> > > \n> > > If you block off certain cards for thematic reasons, that's fair enough, but it doesn't mean the archetype is less powerful, it means you're deliberately handicapping yourself, which obviously is not a good recipe for making your deck top-tier.\n> > \n> >  \n> > \n> > ...Which is why I said I was reconsidering before giving a basis for my initial statement. \n> > \n> >  \n> > \n> > Beyond that I was just saying that Hobbit Secrecy was very flexible and that it might be the better choice in solo.\n> > \n> >  \n> \n>  \n> \n> I'd love to see your Hobbit Secrecy deck. I can't imagine how they are anywhere in the same league as Dwarves. In fact, of all the races that are viable against a large number of quests, I'd rank Hobbits the lowest. How do Hobbits fare against recent quests like Wastes, Carn Dum, and Dread Realm?\n> \n>  \n\n \n\nUm, I feel like it's a pretty standard Hobbit Secrecy deck:\n\n \n\nSam/Merry/Pippin and the Hobbit cards (Fast Hitch, obviously, Hobbit Pony, Bill)\n\n \n\nTry to get a Noldor out asap for Elrond's council and use Merry to try and stay in Secrecy.\n\n \n\nResourceful, Steward, Leaf brooch (though I'm not sure it's worth it--Good Harvest might be a better choice) and Sword-Thain (+Sneak Attack) for resource acceleration.\n\n \n\nAbuse Timely Aid, Elf Stone, Sneak Attack (again, +Sword-Thain) and A Very Good Tale for beefy allies (Gimli, Legolas, Gildor etc).\n\n \n\nHenamarth Riversong and Ravens of the Mountain to help avoid anything I really don't want to see come off the top of the encounter deck. Or Out of the Wild if you're still in Secrecy. Noiseless movement if something gets into staging and I have to avoid it for a turn or two. \n\n \n\nO Elbereth in case of emergency. \n\n \n\nI've broken up the deck so I don't have an exact card list right now but that's the short of it. Should say though that I haven't played it past Across the Ettenmoors so I can't honestly say how it would hold up in Carn Dum or The Dread Realm--might all fall apart there. I haven't played either of those Quests yet. \n\nEdited February 1, 2016 by JonofPDX"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2023826","commentId":2023826,"userName":"DunedainLoreKeeper","timestamp":1454237261,"content":"> tier 1: decks that are fun to play\n> \n>  \n> \n> tier 2: decks that are boring\n\n \n\nSeems legit. Since I don't play tier 2, does that make me a powerplayer? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm also curious about the newest Hobbit Secrecy deck. I've never played one. Maybe you can post a full decklist?\n\n \n\n \n\nOn a side note, as you can see in my own tier interpetation, only very few decks deserve 'top tier' status for me as such a deck would have to be able to consistantly beat a Carn Dum. \n\nEdited January 31, 2016 by DunedainLoreKeeper"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2026600","commentId":2026600,"userName":"zeromage","timestamp":1454362830,"content":"I think boromir is more powerful than dain by quite a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2026748","commentId":2026748,"userName":"Rajam","timestamp":1454366595,"content":"Hey guys, what about starting a new thread to log quests in there? The idea is to begin gathering information and then decks and quests can be ranked using some measure, but I think gathering info comes first; something like:\n\n \n\n\"Deck used: Rivendell Councilroom link [http://ddddirk.github.io/lotrdb/#/GUFMEMGcBdoDsC6ACAggJ2gcwPZZJoAS0ANgEbQ4AmmAtjfABYCWAruSADTADMPAKyCAjCj4BOHqNFCZE4AA4eAJgV8ADDwAs8-opUA2NYeGmtPAOyDVisfx08DUmaJMvQtXrcXbVVs72wvJ2fE6ivpZCgZ4qov6Kos5RwIGR0uKWqh6K8kryWcD+gp7aQol8Ypoqniai6mXOTmHA0vza4ihAA] (Seastan's Aragorn / Halbarad / Amarthiúl)\n\n \n\nQuest: Into Ithilien [Normal Mode]\n\nPlayers: 1\n\nResult: Success!\n\nScore: 106\n\n \n\nDetails / Strategy / Comments: Blah blah blah... etc.\"\n\nEdited February 1, 2016 by Rajam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2026994","commentId":2026994,"userName":"JonofPDX","timestamp":1454375669,"content":">  \n> \n> > tier 1: decks that are fun to play\n> > \n> >  \n> > \n> > tier 2: decks that are boring\n> \n>  \n> \n> Seems legit. Since I don't play tier 2, does that make me a powerplayer? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> I'm also curious about the newest Hobbit Secrecy deck. I've never played one. Maybe you can post a full decklist?\n> \n>  \n> \n>  \n> \n> On a side note, as you can see in my own tier interpetation, only very few decks deserve 'top tier' status for me as such a deck would have to be able to consistantly beat a Carn Dum. \n> \n>  \n\n \n\nSo like I said before I think it’s a pretty standard Hobbit Secrecy. Like I said though, I haven't run it past Across the Ettenmoors so I don't know how it would do in those later quests. Biggest problem I had was low-engagement enemies. \n\n \n\nI don’t have the exact card lineup/amounts since I took it apart but this should be pretty close off the top of my head. It was at 55 cards though so I gained a couple somewhere…probably a couple allies I cut last time I tweaked it.\n\n \n\nSam/Merry/Pippin (20)\n\n \n\nAllies:\n\n \n\nGandalf x2\n\nCeludan Traveler x2\n\nRivendell Guide x3\n\nIthilien Lookout x2\n\nDunedain Wanderer x2\n\nTreebeard x1\n\nBill x1\n\nHenamarth Riversong x3\n\nNorthern Tracker x1\n\nBeorn x1\n\nBoromir x1\n\nFaramir x1\n\nGildor Inglorion x1\n\nGimli x1\n\nHaldir x1\n\nLegolas x1\n\nErestor x1\n\nArwen x1\n\n \n\nAttachments:\n\n \n\nResourceful x3\n\nFast Hitch x1\n\nHobbit Pony x1\n\nSteward of Gondor x1\n\nElf-Stone x2\n\nSword-Thain x1\n\nProtector of Lorien x1\n\n \n\nEvents:\n\n \n\nSneak Attack x2\n\nDaeron’s Runes x3\n\nO Elbereth x1\n\nNeedful to Know x2\n\nTimley Aid x3\n\nElrond’s Council x2\n\nOut of the Wild x2\n\nNoiseless Movement x1\n\nA Very Good Tale x3\n\nRavens of the Mountain x1\n\nExpecting Mischief x1\n\n \n\nOther Thoughts:\n\n \n\nStrategy is pretty simple. It’s secrecy so you’re looking for resource acceleration and ally addition in your opening hand. Resourceful and Timely Aid are best (obviously) but since this is meant to stay in secrecy for the most part I wouldn’t ditch an otherwise great opening hand just because you don’t get them up front. \n\n \n\nKeep in Secrecy as much as possible (Merry, Elrond’s Council, Needful to Know, Gandalf). Then focus on getting Henamarth out to more reliably gauge when to play Needful to Know, Expecting Mischief, Out of the Wild and Ravens (personally, I don’t usually use any of these blind unless I’m desperate—and I use Ravens and Out of the Wild as removal more than their other effects). Get a Noldor on the board so you can use Elrond’s Council (Rivendell Guide is free in secrecy so he’s a great choice). EDIT: I was miremembering this--as pointed out below you need a unique Noldor for Elrond's Council, so Arwen, Erestor or Gildor.\n\n \n\nFrom there it’s just a matter of staying out of dodge and surviving until you can get your big allies out with A Very Good Tale (Dunedain Wanderer is a great exhaust for this), Elf-Stone and Timely Aid. Once you can afford it you can also get a character in using Sneak Attack+Sword-Thain (which isn’t really acceleration since you will still be paying 5 total resource but is great resource smoothing since 4 of them are neutral and you will be making one back per turn). Try to keep big enemies from piling up by bouncing them with Ravens and Out of the Wild and using Gandalf and Expecting Mischief to snipe when they get through to staging.\n\n \n\nNoiseless Movement and O Elbereth are pretty much “in case of emergency” cards I would probably leave out if I remade this deck. And if you were running this solo you might want to add some shadow or treachery cancelation, though the scrying can help. Would probably also ditch Hobbit Pony too—just didn’t find enough use for it. Maybe replace it with Celebrian Stone or Hobbit Cloak (or the Hobbit shadow-cancellation staff I can’t remember the name of). Or Ingold for some cost diversity for A Very Good Tale.\n\n \n\nLike I said, don’t have exact numbers of copies off the top of my head but it was 55 cards total. This should give you a decent idea though. \n\nEdited February 2, 2016 by JonofPDX"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2027756","commentId":2027756,"userName":"DurinVoronwe","timestamp":1454423692,"content":">  \n> \n>  \n> \n> Get a Noldor on the board so you can use Elrond’s Council (Rivendell Guide is free in secrecy so he’s a great choice).\n> \n>  \n\nIsn´t Elrond counsel needd to have a unique Noldor? Then the guide is not enough in terms of Noldor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2027843","commentId":2027843,"userName":"cmabr002","timestamp":1454425770,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > Get a Noldor on the board so you can use Elrond’s Council (Rivendell Guide is free in secrecy so he’s a great choice).\n> > \n> >  \n> \n> Isn´t Elrond counsel needd to have a unique Noldor? Then the guide is not enough in terms of Noldor.\n> \n>  \n\n \n\nYes, it needs to be unique in order for it to work so you would not be able to use Elrond's Counsel if Rivendell Scout was the only Noldor card you controlled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028376","commentId":2028376,"userName":"JonofPDX","timestamp":1454436941,"content":">  \n> \n> >  \n> > \n> >  \n> > \n> > Get a Noldor on the board so you can use Elrond’s Council (Rivendell Guide is free in secrecy so he’s a great choice).\n> > \n> >  \n> \n> Isn´t Elrond counsel needd to have a unique Noldor? Then the guide is not enough in terms of Noldor.\n> \n>  \n\n \n\n>  \n> \n> >  \n> > \n> > >  \n> > > \n> > >  \n> > > \n> > > Get a Noldor on the board so you can use Elrond’s Council (Rivendell Guide is free in secrecy so he’s a great choice).\n> > > \n> > >  \n> > \n> > Isn´t Elrond counsel needd to have a unique Noldor? Then the guide is not enough in terms of Noldor.\n> > \n> >  \n> \n>  \n> \n> Yes, it needs to be unique in order for it to work so you would not be able to use Elrond's Counsel if Rivendell Scout was the only Noldor card you controlled.\n> \n>  \n\n \n\nYou are both correct. Completely forgot about that. So Gildor, Arwen, Erestor.\n\n \n\nI know I knew that but I'm wondering how many times I may have forgotten it while playing now...Still, used Merry and Needful to know more often as I always tried to get Henamarth out asap.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028389","commentId":2028389,"userName":"Calyx","timestamp":1454437318,"content":"> From there it’s just a matter of staying out of dodge and surviving until you can get your big allies out with A Very Good Tale (Dunedain Wanderer is a great exhaust for this), Elf-Stone and Timely Aid. Once you can afford it you can also get a character in using Sneak Attack+Sword-Thain (which isn’t really acceleration since you will still be paying 5 total resource but is great resource smoothing since 4 of them are neutral). Try to keep big enemies from piling up by bouncing them with Ravens and Out of the Wild and using Gandalf and Expecting Mischief to snipe when they get through to staging.\n> \n>  \n\n \n\nWhat is this sneak attack + sword thain thing? Even if you attack sword thain, wouldn't you still need to discard at the end of the phase?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028397","commentId":2028397,"userName":"cmabr002","timestamp":1454437429,"content":">  \n> \n> > From there it’s just a matter of staying out of dodge and surviving until you can get your big allies out with A Very Good Tale (Dunedain Wanderer is a great exhaust for this), Elf-Stone and Timely Aid. Once you can afford it you can also get a character in using Sneak Attack+Sword-Thain (which isn’t really acceleration since you will still be paying 5 total resource but is great resource smoothing since 4 of them are neutral). Try to keep big enemies from piling up by bouncing them with Ravens and Out of the Wild and using Gandalf and Expecting Mischief to snipe when they get through to staging.\n> > \n> >  \n> \n>  \n> \n> What is this sneak attack + sword thain thing? Even if you attack sword thain, wouldn't you still need to discard at the end of the phase?\n> \n>  \n\n \n\nIt's because Sneak Attack has the text (paraphrasing) \"At the end of the phase, discard the ally from play\" and since Sword-thain changes the card to a hero it can no longer be discarded from play.\n\nEdited February 2, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028417","commentId":2028417,"userName":"Kakita Shiro","timestamp":1454438167,"content":">  \n> \n> >  \n> > \n> > > From there it’s just a matter of staying out of dodge and surviving until you can get your big allies out with A Very Good Tale (Dunedain Wanderer is a great exhaust for this), Elf-Stone and Timely Aid. Once you can afford it you can also get a character in using Sneak Attack+Sword-Thain (which isn’t really acceleration since you will still be paying 5 total resource but is great resource smoothing since 4 of them are neutral). Try to keep big enemies from piling up by bouncing them with Ravens and Out of the Wild and using Gandalf and Expecting Mischief to snipe when they get through to staging.\n> > > \n> > >  \n> > \n> >  \n> > \n> > What is this sneak attack + sword thain thing? Even if you attack sword thain, wouldn't you still need to discard at the end of the phase?\n> > \n> >  \n> \n>  \n> \n> It's because Sneak Attack has the text (paraphrasing) \"At the end of the phase, discard the ally from play\" and since Sword-thain changes the card to a hero it can no longer be discarded from play.\n> \n>  \n\nEven made it into the FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028425","commentId":2028425,"userName":"JonofPDX","timestamp":1454438264,"content":">  \n> \n> >  \n> > \n> > > From there it’s just a matter of staying out of dodge and surviving until you can get your big allies out with A Very Good Tale (Dunedain Wanderer is a great exhaust for this), Elf-Stone and Timely Aid. Once you can afford it you can also get a character in using Sneak Attack+Sword-Thain (which isn’t really acceleration since you will still be paying 5 total resource but is great resource smoothing since 4 of them are neutral). Try to keep big enemies from piling up by bouncing them with Ravens and Out of the Wild and using Gandalf and Expecting Mischief to snipe when they get through to staging.\n> > > \n> > >  \n> > \n> >  \n> > \n> > What is this sneak attack + sword thain thing? Even if you attack sword thain, wouldn't you still need to discard at the end of the phase?\n> > \n> >  \n> \n>  \n> \n> It's because Sneak Attack has the text (paraphrasing) \"At the end of the phase, discard the ally from play\" and since Sword-thain changes the card to a hero it can no longer be discarded from play.\n> \n>  \n\n \n\nThis. ^\n\n \n\nReally changed my mind on Sword-Thain in general. Never saw the value in it outside of this combo.\n\n \n\nLike I said, you're still spending 5 resources but allowing 4 of them to be neutral is a big help in a Tri-Sphere (or even a duo-sphere) deck. Plus it allows you to tailor your income a bit--have a hand full of Lore cards? Sneak+Sword-Thain in a Lore ally and you have one more resource of that type per turn. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199251-deck-power-tiers/?do=findComment&comment=2028427","commentId":2028427,"userName":"Calyx","timestamp":1454438357,"content":"Huh - very cool! The possibilities are quite interesting."}]}