{"url":"https://community.fantasyflightgames.com/topic/199347-orthanc/","title":"Orthanc","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199347-orthanc/?do=findComment&comment=1995883","commentId":1995883,"userName":"Veve7","timestamp":1453025603,"content":"Hello!I have a new question:when I should trigger Orthanc's effect?Before or after I put the progress tokens(does the new revealed card add its threat)?Also if it is before and let's say I have 2 willpower more before Orthanc's effect and I reveal a card with 4 threat I quested succcesfully or not(now the total threat is highter than my willpower)?I must rise my threat by 2 or put 2 progress?\n\n \n\nEdited January 17, 2016 by Veve7"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199347-orthanc/?do=findComment&comment=1995917","commentId":1995917,"userName":"PocketWraith","timestamp":1453028759,"content":"I believe that strictly speaking questing successfully and placing progress are two separate steps, so you trigger Orthanc before placing progress - however I also believe that when you determine whether or not you have quested successfully (or not) you also determine the amount of progress that is to be placed (or threat that is to be raised), and this is not changed by any subsequent alteration to the staging area or to your willpower. So in the example you give you would still place two progress.\n\n(I'm mostly just working on the basis that this is how I've always seen it done, so if anyone else has links to actual rulings on the subject that'd be nice)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199347-orthanc/?do=findComment&comment=1995923","commentId":1995923,"userName":"NathanH","timestamp":1453029489,"content":"FAQ 1.24\n\n \n\n>  \n> \n> Questing successfully and the physical placement of\n> \n> progress tokens are two separate game occurrences\n> that happen in sequence during the Quest Resolution\n> step. As soon as the players determine that the total\n> committed Willpower is greater than the total Threat in\n> the staging area, they are considered to have quested\n> successfully. Any Forced or passive effects initiated by\n> questing successfully resolve before physically placing\n> progress tokens.\n>  \n> Example: Tom has just successfully quested during\n> stage 1B of The Hunt Begins (SoM 11), and he will be\n> placing enough progress to advance to the next stage.\n> However, he must first resolve the Forced effect (which\n> resolves immediately upon the occurence of “questing\n> succesfully”)\n\n \n\nThe FAQ doesn't explicitly say that the amount of progress you do is unaffected by any of the consequences of questing successfully, but I think it's implicit in the example (the stage referenced does essentially the same thing as Orthanc). I think we can confidently state that the ordering is\n\n \n\n1) Determine the difference between Willpower and Threat, call this X\n\n2) Resolve any effects based on questing successfully\n\n3) Place X progress"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199347-orthanc/?do=findComment&comment=1996310","commentId":1996310,"userName":"GrandSpleen","timestamp":1453054239,"content":"I agree, the number of progress tokens shouldn't be affected.  Otherwise we would get weird rounds where you \"quest successfully\" but then end up raising your threat."}]}