{"url":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/","title":"A Good Harvest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000524","commentId":2000524,"userName":"Seastan","timestamp":1453226928,"content":"ffg_a-good-harvest-tsf.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_a-good-harvest-tsf.jpg]\n\n \n\nShould be called A \"Great\" Harvest to match how amazing this card is. I believe is is one of the most underrated cards currently, in the sense that even though people are using it, I believe it to be the best Neutral card in the game and should be in even more decks than Core Set Gandalf.\n\n \n\nI use it all the time in solo play to get out Steward of Gondor without a leadership hero. Resource generation is one of the best things about the leadership sphere, and you get access to its best card without even bringing a hero. It feels like cheating.\n\n \n\nI've also found it great for resource smoothing in tri-sphere decks. If you have Steward on one of your heroes, you might end up with a big resource imbalance. So you can use Good Harvest to spend that pile of resources on cards from the other spheres.\n\n \n\nA mono-spirit deck can get Asfaloth into play pretty easily. \n\n \n\nIt single-handedly opens up entire new deck archetypes. You can make a true solo tactics deck that does well in questing by using A Good Harvest to play Blade that was Broken onto Tactics Aragorn. This would basically be impossible with Song of Kings.\n\n \n\nIt allows you to mess with the cards that say \"Use resources from 3 different hero's resource pools to pay for this card\". You can throw A Good Harvest and Shadows Give Way into any deck and it can make a huge difference against Carn Dum, or any quest with bad shadow effects.\n\n \n\nWhat do people think of this card? Have people discovered other uses for it?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000541","commentId":2000541,"userName":"Delaric","timestamp":1453227375,"content":"It's really useful for the reasons you stated, but probably more so in true solo as you will necessarily have less spheres represented or less resources per sphere.  In two-handed play I haven't used it much except in Carn Dum where I wanted to have 2 Spirit heroes and one other hero but still wanted to use Shadows Give Way.  Still, you have to draw into it AND the card you want to play with it, and not everyone slots as much card draw in as you do ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\n \n\nIn a deck without the powerful card draw one of the two \"combo pieces\" could be a dead draw, leaving you waiting for the other one.  Otherwise yeah it's a great utility card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000547","commentId":2000547,"userName":"John Constantine","timestamp":1453227546,"content":"Gandalf hero in \"three\"-sphered deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000569","commentId":2000569,"userName":"flightmaster101","timestamp":1453228048,"content":"> I use it all the time in solo play to get out Steward of Gondor without a leadership hero. Resource generation is one of the best things about the leadership sphere, and you get access to its best card without even bringing a hero. It feels like cheating.\n\n \n\nIt is cheating.  The FAQ clearly says you still need a resource match.  I was using this card to get SoG on Tactamir in my tactamir, Galadriel, Glorfindel deck until it was pointed out that the FAQ clearly prohibits what I was doing.  Now I have subbed it out for three song of king attachments."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000583","commentId":2000583,"userName":"Estel Edain","timestamp":1453228354,"content":"Note that you can't use Gandalf's resources for A Good Harvest unless Gandalf has a song, since it says \"resources of any sphere.\"\n\n \n\nAccording to the FAQ, 0-cost cards require a resource match, but not other cards (so Steward of Gondor is fine).\n\n \n\nI enjoy it in a quad-sphere dwarf deck (Thorin, Balin, Ori), using Narvi's Belt and one Song of Travel. So much flexibility, especially in saga expansions where it can use Baggins/Fellowship resources to get key cards out quickly.\n\nEdited January 19, 2016 by Estel Edain"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000638","commentId":2000638,"userName":"John Constantine","timestamp":1453229481,"content":"> Note that you can't use Gandalf's resources for A Good Harvest unless Gandalf has a song, since it says \"resources of any sphere.\"\n\nOh man, this **** again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000645","commentId":2000645,"userName":"Seastan","timestamp":1453229565,"content":">  \n> \n> > I use it all the time in solo play to get out Steward of Gondor without a leadership hero. Resource generation is one of the best things about the leadership sphere, and you get access to its best card without even bringing a hero. It feels like cheating.\n> \n>  \n> \n> It is cheating.  The FAQ clearly says you still need a resource match.  I was using this card to get SoG on Tactamir in my tactamir, Galadriel, Glorfindel deck until it was pointed out that the FAQ clearly prohibits what I was doing.  Now I have subbed it out for three song of king attachments.\n> \n>  \n\n \n\n \n\nNo, it's not. I seem to see this misunderstanding a lot. The FAQ specifies that you still need a resource match for \"0-cost cards\" becuase A Good Harvest only helps you in \"paying\" for cards. You do not pay for 0-cost cards, hence the resource match requirement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000667","commentId":2000667,"userName":"Lecitadin","timestamp":1453229972,"content":">  I believe it to be the best Neutral card in the game and should be in even more decks than Core Set Gandalf.\n\n \n\nNow THAT'S a bold statement!!! But yes, I use it mainly for Steward, but I've used it sometimes to smooth resources. A great card indeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000709","commentId":2000709,"userName":"Jban","timestamp":1453230807,"content":"It is a great card and probably will be second ranked among all neutrals after Core Gandalf, just before Hobbit Sense. I don't like it that much for playing out of sphere cards since it's just stealing the best from other players in a 3/4p game (which I mainly play) but it speeds up 3-sphere decks a lot in the early game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000843","commentId":2000843,"userName":"Gizlivadi","timestamp":1453234161,"content":"I didn't start using this card until last year, and it is indeed a great card. I also wanna give a shoutout to the songs which are also pretty great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000903","commentId":2000903,"userName":"flightmaster101","timestamp":1453235297,"content":">  \n> \n> >  \n> > \n> > > I use it all the time in solo play to get out Steward of Gondor without a leadership hero. Resource generation is one of the best things about the leadership sphere, and you get access to its best card without even bringing a hero. It feels like cheating.\n> > \n> >  \n> > \n> > It is cheating.  The FAQ clearly says you still need a resource match.  I was using this card to get SoG on Tactamir in my tactamir, Galadriel, Glorfindel deck until it was pointed out that the FAQ clearly prohibits what I was doing.  Now I have subbed it out for three song of king attachments.\n> > \n> >  \n> \n>  \n> \n>  \n> \n> No, it's not. I seem to see this misunderstanding a lot. The FAQ specifies that you still need a resource match for \"0-cost cards\" becuase A Good Harvest only helps you in \"paying\" for cards. You do not pay for 0-cost cards, hence the resource match requirement.\n> \n>  \n\nI thought they went over this on the CotR podcast a while back.  They said that the ruling implied that \"A Good Harvest\" cannot be used for resource matching.  What you are saying is that \"A Good Harvest\" does provide a match as long as you are \"paying\" for something.\n\n \n\nhmm...\n\nI like your ruling better.  back in it goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2000945","commentId":2000945,"userName":"DukeWellington","timestamp":1453236241,"content":"Well one of my favorite cards is Derndingle warrior, play it as much as possible. I think it is worth it in green and blue decks to run good harvest to pay for Derndingle.\n\nAlso, it is a good card to run in tribal decks when there is one really good card in an off color. The new Eothain (or Warden of helm's deep), for instance, would be great in a Rohan deck, but Rohan never goes purple. You can build a very good dwarf deck without red (purple, green, blue) but still use harvest to get battlemaster out.\n\nFinally, when playing with Lore Aragorn/Frodo/Glorfindel or a similar deck, you can use harvest to drop the sword that was broken on Aragorn (and then use Aragorn to play SoG). In the same way you can drop ally Faramir in basically any deck to boost questing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001002","commentId":2001002,"userName":"Seastan","timestamp":1453237446,"content":"> Well one of my favorite cards is Derndingle warrior, play it as much as possible. I think it is worth it in green and blue decks to run good harvest to pay for Derndingle.\n> \n> Also, it is a good card to run in tribal decks when there is one really good card in an off color. The new Eothain (or Warden of helm's deep), for instance, would be great in a Rohan deck, but Rohan never goes purple. You can build a very good dwarf deck without red (purple, green, blue) but still use harvest to get battlemaster out.\n> \n> Finally, when playing with Lore Aragorn/Frodo/Glorfindel or a similar deck, you can use harvest to drop the sword that was broken on Aragorn (and then use Aragorn to play SoG). In the same way you can drop ally Faramir in basically any deck to boost questing.\n\n \n\nA lot of great uses here. I really like the Derndingle Warrior idea. In a mono lore deck with good healing and Ent Draught you can make these guys pretty much invincible. And A Good Harvest will be really easy to draw into as well.\n\n \n\nAnother use for A Good Harvest: In high-cost-ally A Very Good Tale decks, to help you play the allies that you draw into your hand.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001050","commentId":2001050,"userName":"leptokurt","timestamp":1453239022,"content":"It's certainly a good card, but I'd hardly call it the best neutral card. Gandalf is still better in both versions as is Treebeard, who is almost an auto include for me in any non-tactics deck.\n\n \n\nBut yeah, it is underrated. It's certainly more useful in power decks than in themed decks, and as I play the latter more often my opinion might be influenced by that.\n\n \n\nA Good Harvest might become even more useful with all these new cards that require to have two spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001063","commentId":2001063,"userName":"DukeWellington","timestamp":1453239488,"content":"The Derndingle example was not theory. I fell in love with the card first playing against Cairn Dum. At first I was using Treebeard to get him out and I realized it was too slow and I wanted Derndingle out sooner. I started using good harvest to get him out and, as said, with healing the ents are ridiculous. They fit perfectly in green decks that often struggle with defense."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001096","commentId":2001096,"userName":"PocketWraith","timestamp":1453240276,"content":"> Should be called A \"Great\" Harvest to match how amazing this card is. I believe is is one of the most underrated cards currently, in the sense that even though people are using it, I believe it to be the best Neutral card in the game and should be in even more decks than Core Set Gandalf.\n\nRating it above Core Gandalf, sure I can see that, in the right contexts at least - though as noted by Delaric, you need to have good card draw to make it worthwhile.\n\nBut best neutral card in the game? I'm not so sure. I'd hesitate to peg Good Harvest as better than Vilya or Treebeard. Playing out-of-sphere cards is nice, but in general for most decks I find there's enough good stuff in the spheres that are actually represented on the heroes that I don't feel like it's needed. Even less so in multiplayer when someone else is likely actually playing that sphere (and I don't play very much pure solo). For smoothing between multiple spheres it's definitely a good option. Seeing you using it has definitely caused me to consider it more often as an option, but more often I still prefer to ditch it for a card which actually does something rather than a card that smooths out resources to pay for something which actually does something.\n\n \n\nWith all that said, ideas:\n\nSpirit decks could add A Good Harvest to Stand and Fight to have more options for playing out of sphere allies.\n\nYou could have a mono-Spirit Dunhere deck and still be able to give him weapons.\n\nWhen comboing Leadership Faramir with Ents, it's another option for how to use his resources.\n\nNon-Spirit decks could use it for threat reduction, say if they want to stay in Secrecy for a while, or if they're using their threat as a resource with Doomed or Boromir.\n\nI had a few ideas a while back for effectively mono-sphere decks splashing other spheres via hero Gandalf, Good Harvest would be another way of getting the same effect, so I might look through my decks and see if I can find those ideas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001237","commentId":2001237,"userName":"Seastan","timestamp":1453245292,"content":">  \n> \n> > Should be called A \"Great\" Harvest to match how amazing this card is. I believe is is one of the most underrated cards currently, in the sense that even though people are using it, I believe it to be the best Neutral card in the game and should be in even more decks than Core Set Gandalf.\n> \n> Rating it above Core Gandalf, sure I can see that, in the right contexts at least - though as noted by Delaric, you need to have good card draw to make it worthwhile.\n> \n> But best neutral card in the game? I'm not so sure. I'd hesitate to peg Good Harvest as better than Vilya or Treebeard. \n\n \n\nWell, I always try to build my decks as strong as they can be while sticking to the idea of the deck, whatever that is. I find A Good Harvest making it into the deck more frequently than any other neutral card. There are certainly other ways of defining how \"great\" a card is but that's the one I was basing my comment on.\n\n \n\nI like your Dunhere idea quite a bit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001337","commentId":2001337,"userName":"Teamjimby","timestamp":1453249484,"content":"I agree Good Harvest is a nice card, but I wonder how much of its value is tied to Steward of Gondor.  How often do you think you would use it if Steward never existed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001349","commentId":2001349,"userName":"Seastan","timestamp":1453250173,"content":"> I agree Good Harvest is a nice card, but I wonder how much of its value is tied to Steward of Gondor.  How often do you think you would use it if Steward never existed?\n\n \n\nYou're right, Steward is certainly the biggest factor, but I think I'd still use it in almost every deck. Barring Nori/Amarthiul/Gandalf/Elrond, any deck you build is going to have a max of three spheres. And there is (almost) always something in a sphere that you're not using that will be worth splashing A Good Harvest for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001403","commentId":2001403,"userName":"Teamjimby","timestamp":1453252963,"content":"Maybe we just have different deck building styles or there is too much of a single/multiplayer divide, but I almost never feel the desire to have four spheres.  3 even feels like overkill in most instances.  There are few archtypes that really utilize all four spheres well.  Outlands and to some extent Dunedain come to mind, but that's about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001433","commentId":2001433,"userName":"Seastan","timestamp":1453254391,"content":"My point was that with 3 heroes it's a max of 3 spheres, meaning it can still be put to use. It still applies to mono or dual sphere decks that want to include something from a missing sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001471","commentId":2001471,"userName":"Teamjimby","timestamp":1453257382,"content":"Yeah, I get what you're saying.  I just rarely feel the need to splash a card from a missing sphere.  It's hard enough cutting to 50 cards with 1 sphere, let alone 2 (or 3, or 4).  I definitely agree that it is useful in many 3 sphere decks just for the resource smoothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001746","commentId":2001746,"userName":"Fingolfin Fate","timestamp":1453277693,"content":"I keep usually around six to eight decks at the time. And the three copies of A Good Harvest have been almost instantly in one of them, and at times I hesitated if I should buy the adventure pack again to have more. That said, I understand why some people shy away from it a little because it is one of those cards where the effect is very stealthy. I prefer to have it in a deck where it can both smooth and pay for out-of-sphere cards.\n\n \n\nAnd yes, the only thing it can't buy is an out-of-sphere 0-cost, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2001747","commentId":2001747,"userName":"Nickpes","timestamp":1453277798,"content":"I use it very often, mostly to play Steward of Gondor but some other cards maybe. I find it to be very helpfull in solo when playing two or three sphaire deck (I mostly use two shpaire decks) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2002773","commentId":2002773,"userName":"Mndela","timestamp":1453319555,"content":"How about 1 deck with 3 good harvest (+ Galadrhim minstrel?^^) + 2 Reinforcements + 2 Thicket spears + 2 Shadows Give way"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2002841","commentId":2002841,"userName":"leptokurt","timestamp":1453320698,"content":"> My point was that with 3 heroes it's a max of 3 spheres, meaning it can still be put to use. It still applies to mono or dual sphere decks that want to include something from a missing sphere.\n\nI'm always happy when the designers give us more opportunities to build our decks. In that regard, A Good Harvest is a true blessing. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nIt's thus quite understandable why you're so enthusiastic about this card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2003199","commentId":2003199,"userName":"Slothgodfather","timestamp":1453328442,"content":"I recently built a few thematic decks for taking on the Hobbit saga quests and came across this long forgotten card and I have to say, it is definitely an awesome card.  I'm using it in an Oin deck atm where he is my only tactics resource (after I get 2 dwarf allies out) and this card helps pay for the many dwarf weapons/armor that I have in the deck.   It's hard for me to agree that it is the absolute best neutral card in the game since it has obvious limitations, requiring you to draw it and the out-of-sphere/mismatch cards in the first place, but it is absolutely high on the list.  \n\n \n\nLooking at the neutral cards, I'd likely say that Gather Information is the best neutral card in the game since everyone can run it, it's only 4 progress for every player to search their deck for a card of choice, and it doesn't create any conflicts like Gandalf (hero or ally) does, nor does it have an play/deck building limitations like Good Harvest and Keen as Lances do.  And Favor of the Valar would make my top neutral card list but there are several deck builds and encounters where this is not ever an issue.  It is only an MVP some of the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2003757","commentId":2003757,"userName":"Nickpes","timestamp":1453350884,"content":"> How about 1 deck with 3 good harvest (+ Galadrhim minstrel?^^) + 2 Reinforcements + 2 Thicket spears + 2 Shadows Give way\n\nI used Good Harvest with Shadows give way on Carn Dum. It was a very important part of my strategy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199627-a-good-harvest/?do=findComment&comment=2005208","commentId":2005208,"userName":"DunedainLoreKeeper","timestamp":1453407355,"content":"It's certainly a card I should use more often, considering my love for tri-sphere. That said, considering how important the first few turns are relatively speaking, I don't think Harvest+Steward is the ultimate combo, because it takes some time to get starting like many combo's do and if you're running a deck that actually requires many resources, your early game will be even rougher.\n\n \n\nGood Harvest + Shadows give way is a combo I hadn't though of before! I should try that against flippin' Thaurdir some times!"}]}