{"url":"https://community.fantasyflightgames.com/topic/199625-brace-of-coneys/","title":"Brace of Coneys","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199625-brace-of-coneys/?do=findComment&comment=2000417","commentId":2000417,"userName":"mroni","timestamp":1453224952,"content":"Hi. I have simple question regarding Brace of Coneys. I am wondering if I think correctly: when I use Brace of Coneys in one scenario, will it be possible to use it later in campaign? I think yes, because there is no text on card, which can be see for example on Three Golden Hairs:\n\nAdd Three Golden Hairs to the victory display and remove it from the campaign pool. Is my dilatation correct?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199625-brace-of-coneys/?do=findComment&comment=2000467","commentId":2000467,"userName":"cmabr002","timestamp":1453225743,"content":"I think you can keep using it from one scenario to the next.  Take my opinion with a grain of salt, though, as I actually haven't opened my Land of Shadows yet, so I haven't had a chance to read the rules for this expansion.  Based on what you've posted, it seems you can reuse it.\n\nEdited January 19, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199625-brace-of-coneys/?do=findComment&comment=2000554","commentId":2000554,"userName":"Estel Edain","timestamp":1453227686,"content":"You are correct. The Campaign mode resolution card for Journey to the Cross-roads states: \"Each player who chose to shuffle a copy of Brace of Coneys into his deck during setup has earned that boon. Add each earned copy to the campaign pool.\" So it stays in the campaign pool (unless something from a later expansion explicitly removes it from the campaign pool). It's like the Old Bogey-stories boon from The Old Forest quest: it can (potentially) be used once each quest. (Questions like this would be better in the Rules Questions sub-forum.)\n\nEdited January 19, 2016 by Estel Edain"}]}