{"url":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/","title":"Elf-Stone + Long Defeat","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2004440","commentId":2004440,"userName":"Mndela","timestamp":1453390399,"content":"The-Long-Defeat.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Battle-of-Carn-Dum/The-Long-Defeat.jpg]Elf-stone.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Black-Riders/Elf-stone.png]\n\n \n\nIf Elf-stone is attached to active location and Long-Defeat to current quest, and... players explore all (active location and quest , advancing to the next quest card), what happens? what is first? Can you draw 2 cards by Long Defeat and after put into play one of them (if it is ally)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2004690","commentId":2004690,"userName":"GrandSpleen","timestamp":1453395383,"content":"You would explore the active location first, and then trigger its Response, before you finish the current quest card and are able to trigger The Long Defeat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2006335","commentId":2006335,"userName":"Nerdmeister","timestamp":1453459125,"content":"I think technically all exploration tokens are placed at the same time and thus resolving at the same time... however I agree with GrandSpleen if nothing else then for the logic of sequence and theme."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2006337","commentId":2006337,"userName":"shosuko","timestamp":1453459551,"content":"Page 14 in the rule book:  Note that if there is an active location (see page 15), progress tokens are placed on that location until it is explored, and the remainder are then placed on the current quest.\n\n \n\nThis hints that while the progress tokens are placed in a single swoop, that the location would still be cleared first, as you compare it's counters to it's total before placing the remaining amount on the quest.  So unless someone has a ruling otherwise... I'd say it's better to play location resolution before quest resolution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2006360","commentId":2006360,"userName":"NathanH","timestamp":1453461043,"content":"From http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/?p=139000 [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/?p=139000]\n\n \n\nwe have\n\n \n\n>  \n> \n> > Question 3.During the questing phase, I accumulated enough will power to put sufficient progress on both the active location and quest card.And an Ancient Mathom is attached to the active location, what happens?\n> > a)resolve the effect of Ancient Mathom first, first player draw three cards;or\n> > b)advance to the next stage and resolve any when revealed effect, then , resolve the effect of ancient mathom.\n> \n> (...)\n> \n> #3 - Advance to the next stage, resolve any passive, Forced or ‘when revealed’ effects, and then resolve the Response effect on Ancient Mathom.\n> Cheers,\n> Caleb\n\n \n\nThis doesn't exactly answer the question, but it does clarify some of the timing issues. I'd probably play that the quest is defeated and the location is explored at the same moment.\n\nEdited January 22, 2016 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2006580","commentId":2006580,"userName":"Nerdmeister","timestamp":1453471563,"content":"In that instance it seems the ruling is that ancient mathom is resolved after  the quest has advanced. To me that sounds like Long Defeat and Elf-Stone would share a trigger and the player being able to choose the order of resolution.\n\nIt still rubs me a bit the wrong way, I must admit.\n\n \n\n@Shosuko I am leaning towards that is due to a shortcoming in the phrasing/language-in-general... all progress are placed at the same time, though instead of thinking of them as going to the active location \"first\" then the mechanics of the game knows how many are going to the active location and how many are going to the quest and place them all at the same time.\n\nDid I mention that this keeps on rubbing me the wrong way, even though I can see some game mechanical logic to it? Cause it does :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2006596","commentId":2006596,"userName":"shosuko","timestamp":1453472053,"content":"> From http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/?p=139000 [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/?p=139000]\n> \n>  \n> \n> we have\n> \n>  \n> \n> >  \n> > \n> > > Question 3.During the questing phase, I accumulated enough will power to put sufficient progress on both the active location and quest card.And an Ancient Mathom is attached to the active location, what happens?\n> > \n> > > a)resolve the effect of Ancient Mathom first, first player draw three cards;or\n> > \n> > > b)advance to the next stage and resolve any when revealed effect, then , resolve the effect of ancient mathom.\n> > \n> > (...)\n> > \n> > #3 - Advance to the next stage, resolve any passive, Forced or ‘when revealed’ effects, and then resolve the Response effect on Ancient Mathom.\n> > \n> > Cheers,\n> > \n> > Caleb\n> \n>  \n> \n> This doesn't exactly answer the question, but it does clarify some of the timing issues. I'd probably play that the quest is defeated and the location is explored at the same moment.\n\nI think this answers it.  The location clearing and quest advancing happen at the same time, but it doesn't matter as the responses ALL wait until you have a moment to resolve them.\n\n \n\nYou advance to the next stage, complete any forced and when revealed of the next quest stage, and then you have both responses from the quest clearing and from the location clearing waiting...\n\n \n\nThen First Player chooses what order to resolve them in.\n\n \n\nSo I think that is pretty official.  You can choose to resolve Long Defeat first, and then use an ally drawn from it's effect with Elf Stone to put it into play.  Or the other way, and use elf stone to enter Quick Beam into play, and the Long Defeat to heal it ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nEdited January 22, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2009130","commentId":2009130,"userName":"sappidus","timestamp":1453592313,"content":"> So I think that is pretty official.  You can choose to resolve Long Defeat first, and then use an ally drawn from it's effect with Elf Stone to put it into play.  Or the other way, and use elf stone to enter Quick Beam into play, and the Long Defeat to heal it ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n> \n>  \n\n \n\nHaha, the Quickbeam idea is awesome, but can you actually do that? That is, you've done the following...\n\n \n\n1. Put Quickbeam into play using Elf-stone,\n\n2. Trigger Quickbeam's response to deal him 1 damage and ready him.\n\n \n\nHasn't The Long Defeat's Response trigger already expired by the time you do #2? i.e., if you want to use it, don't you have to do it at, like, step #1.5 or whatever?\n\n \n\nI can see how healing Quickbeam would be possible if either:\n\n \n\na. the game framework considers the Response triggers of Quickbeam and The Long Defeat to be simultaneous in this case, or\n\nb. we're allowed to \"nest\" Response triggers\n\n \n\n...but it's not clear to me that either of these is true.\n\nEdited January 23, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2009218","commentId":2009218,"userName":"shosuko","timestamp":1453598216,"content":"That's a good question.  This game definitely needs a comprehensive rules write up that can settle these timing questions more consistently.\n\n \n\nI would assume you can do this, because first player chooses the order of responses that are waiting, and the only other \"general guideline\" we have is this\n\n \n\n(1.37) Timing of effect resolution When resolving multiple effects with a shared condition, players should use this order of resolution: passive abilities first, Forced effects second, Response actions third. When determining the order of effect resolution among abilities within those categories, players should first resolve abilities that use the word “when” and then resolve abilities with the word “after”\n\n \n\nAnd all of these effects are \"after...\" so if you use one response to make Quickbeam enter play, giving you two responses left I would assume you can still resolve those piled up responses in any order.  As long as you haven't taken any \"action\" you are still in that pocket to resolve responses.\n\n \n\nThat's my take - I may be wrong, I often am ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2009512","commentId":2009512,"userName":"NathanH","timestamp":1453625187,"content":"Without a formal framework for LOTR, we base our rules on the Warhammer: Conquest approach for nested responses. The Response from Elf-Stone causes Quickbeam to enter play, which creates a new Response trigger (Quickbeam has entered play) which takes precedence over the previously-active Response trigger. Once this new Response trigger and all of its consequences are done, we'd go back to the first trigger.\n\n \n\nSo the way we play, there's in fact no choice: Quickbeam's response would always trigger before the Long Defeat's response. Also if there was also a Mathom on the active location, we would allow only the resolution orders (Mathom, Elfstone, Long Defeat), (Elfstone, Mathom, Long Defeat), (Long Defeat, Elfstone, Mathom), (Long Defeat, Mathom, Elfstone), not (Mathom, Long Defeat, Elfstone) or (Elfstone, Long Defeat, Mathom).\n\n \n\nThere's no official reason to do this as far as I know; you could also follow the shosuko approach of having all Response triggers active at the same time and go through them in whatever order you please."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2012284","commentId":2012284,"userName":"sappidus","timestamp":1453758012,"content":"> If the active location is explored and at the same time the players make enough progress to defeat the current quest, the rules require that the players immediately advance to the next stage. This rule puts priority on resolving effects tied to the current quest before resolving effects tied to the active location. As a result, players must resolve any effects that trigger from defeating the quest before resolving any effects that trigger from exploring the active location. Therefore, The Long Defeat must be resolved before Elf-stone can be resolved.\n> \n> Cheers,\n> \n> Caleb\n\nWe just got Caleb'ed!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2012317","commentId":2012317,"userName":"GrandSpleen","timestamp":1453759028,"content":"What the."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2012320","commentId":2012320,"userName":"GrandSpleen","timestamp":1453759102,"content":"I have figured it out.  All this stuff is Caleb's meta-strategy.  Give us rulings that create more questions than answers, and we will eventually stop asking for rulings.\n\nEdited January 26, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2012688","commentId":2012688,"userName":"Kakita Shiro","timestamp":1453768504,"content":"They desperately need to produce a revised ruleset."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2012920","commentId":2012920,"userName":"GrandSpleen","timestamp":1453777490,"content":"Yes, at this point, doesn't matter how many rulings get reversed.  Give us a 90 page document and we'll figure it out ourselves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2013021","commentId":2013021,"userName":"sappidus","timestamp":1453781190,"content":"I enjoy kvetching over the rules minutiae of this game as much as anyone, but I have to admit: in retrospect, this ruling seems semi-obvious to me. The implication of the Ancient Mathom ruling NathanH cited earlier is that, even if progress tokens are placed on the active location and quest all at once, anything that happens with the quest card must happen first. Thus, the quest resolution and the active location exploration aren't really \"Response-simultaneous\" at all.\n\n(Now, you can argue that the previous ruling is at heart about the resolution order of Responses vs. Forced/When Revealed/passives, but still. This new ruling is pretty consistent, I think.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2013045","commentId":2013045,"userName":"Ecthelion III","timestamp":1453782040,"content":"This subforum should be renamed to \"Rules Questions and Answers Which Just Require More Questions\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2013616","commentId":2013616,"userName":"shosuko","timestamp":1453815551,"content":"> Yes, at this point, doesn't matter how many rulings get reversed.  Give us a 90 page document and we'll figure it out ourselves.\n\nSo much this...  I love this game, and it's very challenging.\n\n \n\nEvery time I play since I bought this game I've learned a new thing I was doing wrong.\n\n \n\nHowever - I feel I understand the general rules well, but then we get these questions and there aren't answers... constant messages to caleb and then the answers don't always match other similar scenarios...\n\n \n\nI want a consistent system, a set of rules the game plays by, and the cards need to be written by those rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2014062","commentId":2014062,"userName":"13nrv","timestamp":1453825860,"content":"Ahahaha ! Caleb rules :angry: [//content.invisioncic.com/Mfantflight/emoticons/default_angry.png]\n\n \n\nSo if next stage have a \"When revealed effect\", we need to resolve the \"When revealed effect\" before exploring the active location ?\n\n \n\nWhy so complicated answer ...\n\nEdited January 26, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2014181","commentId":2014181,"userName":"sappidus","timestamp":1453828028,"content":"On the bright side, at least the Gather Information + Elf-stone combo still works to put into play an arbitrary ally in your deck for free.\n\n \n\n(Note to self: design super-jank deck that does this and uses Well-Equipped to Sword-Thain Brok Ironfist for free.)\n\nEdited January 26, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2014200","commentId":2014200,"userName":"13nrv","timestamp":1453828393,"content":"Ok cool combo but i have a lot of question with this ruling :\n\n \n\n1) So if next stage have a \"When revealed effect\", did we need to resolve the \"When revealed effect\" before exploring the active location ?\n\n2) If the current stage is the last one and the active location have victory point, The game end and the active location remain in play or the active location goes to victory display and the game end ?\n\n \n\nI will come back with other question ...\n\nEdited January 26, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2014277","commentId":2014277,"userName":"13nrv","timestamp":1453830386,"content":"ffg_the-capture-tdm.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-capture-tdm.jpg]ffg_the-heart-of-the-marshes-tdm.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_the-heart-of-the-marshes-tdm.jpg]\n\n \n\nSo i put 4 tokens on The heart of the marshes and 3 on The capture, i have to do an escape test with +1 escape for all card revealed ?\n\n \n\nI don't want to continue but this ruling will generate a lot of questions ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2014333","commentId":2014333,"userName":"blinky","timestamp":1453831991,"content":"> 1) So if next stage have a \"When revealed effect\", did we need to resolve the \"When revealed effect\" before exploring the active location ?\n\n \n\nLooking at Stage 2 for 'Road to Rivendell', side 2B says '... if there is no active location, Goblin Gate becomes the active location.'.\n\n \n\nI'm probably missing something, but wouldn't there only ever be an active location at that point if you had to resolve the 'When Revealed' effect on the quest before removing the explored location from play? There's no action window to quickly swap in another location, 'When Revealed' effects are a type of Forced effect so they get resolved before Responses can trigger and I can't find anything passive that might happen first.\n\nEdited January 26, 2016 by blinky"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2015031","commentId":2015031,"userName":"Mndela","timestamp":1453850885,"content":"I think the active location is gone yet (when you resolve the when revealed of the next step quest card), but the order of resolutions is: 1st quest card - 2nd active location"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199848-elf-stone-long-defeat/?do=findComment&comment=2015037","commentId":2015037,"userName":"Mndela","timestamp":1453851134,"content":"Curious, i never understood why text of 'Road to Rivendell', side 2B says '... if there is no active location,'. With Caleb answer it makes sense, otherway, never can happen it (so why it writes so?)\n\n \n\nWithout the Caleb's answer, in Cair andros, if you explore the last Cair Andros location as active, you would jump to, for example, 5b, and you could explore it before even resolving its 'when revealed' and win the game.\n\nThen Caleb's answer makes sense"}]}