{"url":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/","title":"What would you add to &quot;fix&quot; the games worst cards?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007455","commentId":2007455,"userName":"JonofPDX","timestamp":1453492739,"content":"Okay, so, we’ve all seen this thread before. Take old cards most people don’t use and make them playable/better in the current meta. But I wanted to throw in a little bit of a twist here.\n\n \n\n@awp832 started a thread a few days ago about Dori and how he’s not quite as terrible as most of us think he is. During that thread @dalestephenson made a really interesting comment that rather than imagining some kind of errata to the current, bad, card (FFG just doesn’t do positive errata for player cards) he thought about what kind of new cards could be added to the game to bring those underwhelming cards up to snuff.\n\n \n\nI thought that was a really cool idea and a cool twist on the traditional “fix this card” threads we see a lot of.\n\n \n\nSo what cards do you think really need some help and what would you guys like to see released to make them more viable?\n\n \n\nI’ll start us off with a couple cards that immediately spring to my mind when I think of terrible cards: Spirit Pippin and Beorning Beekeeper.\n\n \n\nFor Spirit Pippin, I would like to see some card(s) that can directly benefit from the player being able to push things into the staging area and effects that are powerful enough to offset that pretty big threat hit (even in Spirit). I envision something like this:\n\n \n\n“Sneaky Little Hobbitses” (or something)\n\nSpirit Event, [5-cost], Reduce the cost to play “Sneaky Little Hobbitses” by 1 for each Hobbit character you control. Action: Choose a non-unique enemy in the staging area and shuffle it into the encounter deck.\n\n \n\nI like this because it’s a very powerful effect—being able to push off any non-unique enemy without immediately replacing it is big. But it also has a big cost. The fact that an all Hobbit Hero deck can get it out earlier with a cost of 0-2 resources means that they can more effectively manage what engages them and when. That helps negate some of the bad side of the creeping threat increase from Pippin’s ability as well as setting up an enemy already engaged for the wipe.\n\n \n\nI do wonder if Lore may have been a better choice thematically for this but I figured that since this is about making Spirit Pippin more valuable I would leave it in Spirit.\n\n \n\nAs for Beorning Beekeeper…that was tougher. I didn’t want to make a custom card specifically just for him but there’s only one other Beorning and he’s immune to player card effects (or an ally usually only used with Sneak Attack). Here’s what I came up with:\n\n \n\n“Wrath of the Bear” (again, or something)\n\nTactics Event, [0-cost], Response: After an enemy is dealt damage by a Beorning character, deal 2 additional damage to that enemy.\n\n \n\nOr the very similar:\n\n \n\n“Beorn’s Hunt”\n\nTactics Event, [1-cost], Response: After an enemy is dealt damage by a Beorning character, deal 1 damage to up to 2 other enemies.\n\n \n\nSimple, cheap, and I think they both work well with all of the Beorning characters we currently have.\n\n \n\nSo what do you guys think? Would adding these cards make you consider playing the Beekeeper or Spirit Pippin? Do you have other suggestions? Any cards you guys would like to see “fixed” by the inclusion of additional options to the cardpool? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007717","commentId":2007717,"userName":"zeromage","timestamp":1453500544,"content":"Radagast: add 1 willpower and make him cost 1 less."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007721","commentId":2007721,"userName":"GrandSpleen","timestamp":1453500636,"content":"Like you suggested, you could make Spirit Pippin more viable with some effects that trigger off pushing an enemy back to the staging area.\n\n \n\n\"Response: After an engaged enemy is returned to the staging area, lower your threat by that enemy's threat.\"\n\n \n\n\"Response: When an enemy is returned to the staging area from a player's play area, exhaust [attachment] to choose that enemy.  That enemy does not make engagement checks until the end of the round.\" \n\nEdited January 22, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007763","commentId":2007763,"userName":"JonofPDX","timestamp":1453501935,"content":"> Like you suggested, you could make Spirit Pippin more viable with some effects that trigger off pushing an enemy back to the staging area.\n> \n>  \n> \n> \"Response: After an engaged enemy is returned to the staging area, lower your threat by that enemy's threat.\"\n> \n>  \n> \n> \"Response: When an enemy is returned to the staging area from a player's play area, exhaust [attachment] to choose that enemy.  That enemy does not make engagement checks until the end of the round.\" \n\n \n\nI can't believe I didn't think of that first one when I was brainstorming for Pippin--it's so simple but it totally makes his ability way less costly (or even a net gain)! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007775","commentId":2007775,"userName":"Kjeld","timestamp":1453502270,"content":"Experimenting with reviving several cards at once by making Radagast a better support character through use of a staff.\n\n \n\nRadagast's Staff.\n\n(Unique Neutral, cost: 1).\n\n \n\nItem. Artifact. Staff.\n\n \n\nAttach to Radagast.\n\n \n\nHealing Herbs may be attached to Radagast. While you control a Creature ally, Radagast gets +2 willpower.\n\n \n\nAction: Exhaust Radagast's staff to reduce the cost of Power in the Earth, Ever Vigilant, Radagast's Cunning, or Secret Paths by 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007789","commentId":2007789,"userName":"Authraw","timestamp":1453502689,"content":"A Dwarf hero that shuffles himself into your deck to fuel some ability. He comes back into play when you draw him or discard him off the top of your deck.\n\nBecause for some reason, I still haven't lost hope in poor old Brok Ironfist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007888","commentId":2007888,"userName":"zeromage","timestamp":1453505828,"content":"> Experimenting with reviving several cards at once by making Radagast a better support character through use of a staff.\n> \n>  \n> \n> Radagast's Staff.\n> \n> (Unique Neutral, cost: 1).\n> \n>  \n> \n> Item. Artifact. Staff.\n> \n>  \n> \n> Attach to Radagast.\n> \n>  \n> \n> Healing Herbs may be attached to Radagast. While you control a Creature ally, Radagast gets +2 willpower.\n> \n>  \n> \n> Action: Exhaust Radagast's staff to reduce the cost of Power in the Earth, Ever Vigilant, Radagast's Cunning, or Secret Paths by 1.\n\nLove this idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007911","commentId":2007911,"userName":"dalestephenson","timestamp":1453506918,"content":"I like the idea of a dwarf hero that enables Brok.  If there were an attachment that granted Dwarf status (\"Friend of the Vertically Challenged, neutral 1 attachment -- grant character \"Dwarf\" and \"Hobbit\" status) you could plop it on Caldara, but IIRC she'd lose the status when she left play, so poor Brok couldn't get in for free.\n\n \n\nAnother option would be a hero-sacrificing event for some dramatic effect, probably with a picture on Gandalf on it.  Use that event on a dwarf hero, play Brok for free.\n\n \n\nHow about power in the earth, the totally lame -1 threat attachment from the core set?  There are other location attachments that aren't lame, and all but Path of Need are pretty cheap.  What we need here is a card that repeatably benefits from location attachments (this could also mitigate location-attaching treacheries).  Except for Thror's key, all the other location attachments either involve the active location or reward you for exploring it, but if you have a character or attachment that benefits from location attachments, you could plop a  Power in the Earth on it (or better yet, more than one) *and ignore that location the rest of the game*.  Sort of like a forest-snared engaged enemy for a Dunedain enemy.  (Another spin on that would be a character or attachment that benefits from the number of locations in staging -- that might make Power in the Earth more attractive and as a bonus benefit players who are getting location-locked.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2007953","commentId":2007953,"userName":"DukeWellington","timestamp":1453508446,"content":"I vastly prefer fizing old cards by adding new cards to the card pool rather than changing old card text. This is a great idea for a thread.\n\nHere are a few ideas:\n\nIstari hat: attachment,cost 1 neutral\n\n\"Attach to an Istari character. Limit 1 per character.\n\nResponse: When playing an event card with a printed cost of X exhaust this card to resolve that event as though you spent an additional 4 resources.\"\n\nMaybe Gandalf's Search and/or The White Council would see use?\n\nHobbit Stealth: attachment, cost 1 blue\n\n\"Skill.\n\nAttach to a (spirit) hero.\n\nAs long as you control only Hobbit characters you qualify for Secrecy regardless of your threat level.\"\n\nSpirit Pippen, Fatty, and many secrecy cards would see new life.\n\nFierce Protector: event, cost 5 red\n\n\"Reduce the cost to play this card by 1 for each enemy in the staging area.\n\nPut a Beorning ally from you discard into play under your control. At the end of the round return that ally to your hand from play or from your discard.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008086","commentId":2008086,"userName":"JonofPDX","timestamp":1453514543,"content":"> A Dwarf hero that shuffles himself into your deck to fuel some ability. He comes back into play when you draw him or discard him off the top of your deck.\n> \n> Because for some reason, I still haven't lost hope in poor old Brok Ironfist.\n\n \n\nPersonally I think Brok is worth a 1x copy now but a new Hero could definitely make him better.\n\n \n\nA Spirit Balin or Thorin seem the obvious choice for a Dwarf Hero with a discard ability. Either could have an ability that did something like:\n\n \n\nAction: discard Balin/Thorin to ready all dwarf characters. All dwarf characters get +1 ATTACK and +1 DEFENSE until the end of the round.\n\n \n\nThat would, of course, also trigger Brok to bounce in and take Balin/Thorin’s place. And you could Fortune or Fate to bring your Hero back (which would also help that card find a home outside of Caldara decks). \n\n \n\n \n\n> Experimenting with reviving several cards at once by making Radagast a better support character through use of a staff.\n> \n>  \n> \n> Radagast's Staff.\n> \n> (Unique Neutral, cost: 1).\n> \n>  \n> \n> Item. Artifact. Staff.\n> \n>  \n> \n> Attach to Radagast.\n> \n>  \n> \n> Healing Herbs may be attached to Radagast. While you control a Creature ally, Radagast gets +2 willpower.\n> \n>  \n> \n> Action: Exhaust Radagast's staff to reduce the cost of Power in the Earth, Ever Vigilant, Radagast's Cunning, or Secret Paths by 1.\n\n \n\nPersonally don't know how I feel about calling out very specific cards like that but I love the idea of Radagast finally getting his staff. Hopefully we will see both a staff and spell (as well as a Radagast Hero) soon. \n\n \n\nWhat about something like:\n\n \n\n\"Radagast's Staff\"\n\nNeutral, [2-cost], Attach to Radagast. Action: Exhaust Radagast's Staff to put a Creature or Mount card into play from your hand. At the end of the round, if that card is still in play, shuffle it into your deck.  \n\n \n\nAn easy, \"free\" (other than the cost of the staff), repeatable way to get Eagles into play (to buff Eagles of the Misty Mountain and trigger Descendant of Thorendor or Landroval) is already great but it could also be used to drop a Rohan Warhorse or Firefoot into play outside of the Planning Phase if you underestimated the flop off the encounter deck. 2-cost may be too cheap for that effect though...\n\n \n\nAs for Radagast's spell...the big thing about him from the books is he's supposed to be a master of nature, healing and of illusion, so maybe something to do with the less-touched-upon illusionary side? Something like:\n\n \n\n\"Master of Form and Hue\"\n\nAction: Chose a character or attachment with an Action ability that requires a character to exhaust. Exhaust an Istari character instead to trigger that ability. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008143","commentId":2008143,"userName":"shosuko","timestamp":1453517806,"content":"> A Dwarf hero that shuffles himself into your deck to fuel some ability. He comes back into play when you draw him or discard him off the top of your deck.\n> \n> Because for some reason, I still haven't lost hope in poor old Brok Ironfist.\n\nI'd like a condition attachment \"You Shall Not Pass\"  When this Hero would be removed from play it is instead considered out of play for the next full turn before returning to play.\n\n \n\nThis would let a hero die without losing their equips.  The cost could be 5 colorless since it's a Gandalf type card, but should have a further cost such as \"Your threat is considered 50 during engagement checks while this equip is attached.\"\n\n \n\nThis would let Brok have a place, as well as Tactics Boromir using his suicide without ruining the rest of the game.  The Fall of Gil-Galad could also get some use out of this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008209","commentId":2008209,"userName":"GrandSpleen","timestamp":1453522018,"content":">  \n> \n> I can't believe I didn't think of that first one when I was brainstorming for Pippin--it's so simple but it totally makes his ability way less costly (or even a net gain)! \n> \n>  \n\n \n\nIt would breathe a bit of life into some other cards that don't see a lot of play too... A Light in the Dark from the Core set and Ithilien Archer.  I use the Archer sometimes in mono-Lore when I'm looking for a ranged character, or if I need rangers for Ranger Bow or something.  But I almost never use his ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008313","commentId":2008313,"userName":"dalestephenson","timestamp":1453531061,"content":"I like the idea of Radagast's staff, but I think we would only get one with a Radagast hero (a fine idea).  A \"Radagast's staff\" that is restricted to Istari would be possible, but how to make something that would make Radagast be considered instead of just being added to Gandalf's toys.\n\n \n\nThis would make Radagast better:\n\n \n\n0 cost neutral event -- for the rest of the game, Ents are also creatures.\n\n \n\nBut that might as well have Radagast's name written on it.  Not practical.  Maybe this would be better?\n\n \n\nEmissary of Yavanna -- 0 cost neutral attachment.  Attach to an Istari character.  May use his resources to pay for ents, and ents come into play ready.\n\n \n\nThat'd be used with Gandalf hero, of course, but this would make Radagast a welcome addition to any deck heavy on ents.  Like they need the help.\n\n \n\nSo what does Radagast do?  Collect resources, pay for Eagles, heal Eagles.  So to benefit Radagast, we need something that either has to do with resources, putting Eagles in play, or having healthy Eagles.  The latter two, unless carefully restricted, would buff Eagles decks in general, but that's not such a terrible thing, and in any case Eagles decks are the only decks that make Radagast worth having in the first place.\n\n \n\nHow about the resource angle?  If used outside an Eagles deck, Radagast would pile up resources.  He and Treebeard are the only allies to do this, and Treebeard can use his resources up by self-readying even in an ent-free deck.  So any resource buff would boost Radagast -- and of course, heroes with resource-generating attachments and abilities, which are already popular enough.  Blood of Numenor,  Gondorian Fire, and Lay of Nimrodel already boost based on resource, but they all specify heroes.  So with attack, defense, and willpower boosted, how can we do something interesting with resources that hasn't been done before, and let Radagast do it?\n\n \n\nWe have three different cards to boost W/A/D based on resources - 1.  Any hero is going to have an advantage in generating massive number of resources, while Radagast is stuck at one per turn, so a resource cost wouldn't help much.  So his resource boost needs to be no-cost.  How to do that to benefit Radagast more than heroes?  Easy -- require exhausting the character.  At 2/1/1, exhausting is a higher cost for ANY hero than for Radagast.  So maybe something like this:\n\n \n\nWill of the Istari -- 1 cost neutral attachment.  Exhaust attachment and attached character to give another character +1 willpower, defense, or attack (choose one) for each resource in the character's pool, until the end of phase.\n\n \n\nWhat about Eagles?  Is there something we could do to reward paying for Eagles?  I'm at a loss to how make this more beneficial to Radagast than to any old Tactics hero, which is a certainty in an Eagles deck.\n\n \n\nRewarding for healthy eagles has a different problem -- with cheap, 1-HP Eagles around, you don't need a specialized Eagle healer to have plenty roaming around.  A benefit based on healthy unique creatures (there's only 3, Gwaihir, Landroval, and Bill the Pony) has the problem that defense isn't the core strength for any of them, so they aren't terribly hard to keep healthy in the first place.\n\n \n\nSo I can't think of a way to buff Radagast for his main function that would actually justify using Radagast, without making the card only applicable to Radagast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008636","commentId":2008636,"userName":"Lecitadin","timestamp":1453562461,"content":"No more!\n\nSpirit event, costs 2 :\n\n''Response: Cancel the 'Surge' effects of a card that was just revealed from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008872","commentId":2008872,"userName":"Mndela","timestamp":1453578031,"content":"I'd create attachments for heroes and allies"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008938","commentId":2008938,"userName":"DukeWellington","timestamp":1453581266,"content":"Yes, surge cancelation please."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008962","commentId":2008962,"userName":"JonofPDX","timestamp":1453582172,"content":"> I like the idea of Radagast's staff, but I think we would only get one with a Radagast hero (a fine idea).  A \"Radagast's staff\" that is restricted to Istari would be possible, but how to make something that would make Radagast be considered instead of just being added to Gandalf's toys.\n> \n>  \n> \n> This would make Radagast better:\n> \n>  \n> \n> 0 cost neutral event -- for the rest of the game, Ents are also creatures.\n> \n>  \n> \n> But that might as well have Radagast's name written on it.  Not practical.  Maybe this would be better?\n> \n>  \n> \n> Emissary of Yavanna -- 0 cost neutral attachment.  Attach to an Istari character.  May use his resources to pay for ents, and ents come into play ready.\n> \n>  \n> \n> That'd be used with Gandalf hero, of course, but this would make Radagast a welcome addition to any deck heavy on ents.  Like they need the help.\n> \n>  \n> \n> So what does Radagast do?  Collect resources, pay for Eagles, heal Eagles.  So to benefit Radagast, we need something that either has to do with resources, putting Eagles in play, or having healthy Eagles.  The latter two, unless carefully restricted, would buff Eagles decks in general, but that's not such a terrible thing, and in any case Eagles decks are the only decks that make Radagast worth having in the first place.\n> \n>  \n> \n> How about the resource angle?  If used outside an Eagles deck, Radagast would pile up resources.  He and Treebeard are the only allies to do this, and Treebeard can use his resources up by self-readying even in an ent-free deck.  So any resource buff would boost Radagast -- and of course, heroes with resource-generating attachments and abilities, which are already popular enough.  Blood of Numenor,  Gondorian Fire, and Lay of Nimrodel already boost based on resource, but they all specify heroes.  So with attack, defense, and willpower boosted, how can we do something interesting with resources that hasn't been done before, and let Radagast do it?\n> \n>  \n> \n> We have three different cards to boost W/A/D based on resources - 1.  Any hero is going to have an advantage in generating massive number of resources, while Radagast is stuck at one per turn, so a resource cost wouldn't help much.  So his resource boost needs to be no-cost.  How to do that to benefit Radagast more than heroes?  Easy -- require exhausting the character.  At 2/1/1, exhausting is a higher cost for ANY hero than for Radagast.  So maybe something like this:\n> \n>  \n> \n> Will of the Istari -- 1 cost neutral attachment.  Exhaust attachment and attached character to give another character +1 willpower, defense, or attack (choose one) for each resource in the character's pool, until the end of phase.\n> \n>  \n> \n> What about Eagles?  Is there something we could do to reward paying for Eagles?  I'm at a loss to how make this more beneficial to Radagast than to any old Tactics hero, which is a certainty in an Eagles deck.\n> \n>  \n> \n> Rewarding for healthy eagles has a different problem -- with cheap, 1-HP Eagles around, you don't need a specialized Eagle healer to have plenty roaming around.  A benefit based on healthy unique creatures (there's only 3, Gwaihir, Landroval, and Bill the Pony) has the problem that defense isn't the core strength for any of them, so they aren't terribly hard to keep healthy in the first place.\n> \n>  \n> \n> So I can't think of a way to buff Radagast for his main function that would actually justify using Radagast, without making the card only applicable to Radagast.\n\n \n\nI really like the idea of making Ents work with Radagast but that 0-cost event might just be too OP. Heck, in a dedicated Ent deck I would probably pay 2 or 3 resources just to have them all come into play ready. What about splitting that effect over a couple of cards? Something like:\n\n \n\n\"Friend of Nature\" \n\nNeutral Attachment, [1-cost], Title, Attach to a Hero or Radagast. Attached character gains the Ent trait. Resources from attached character's resource pool may be spent to pay for all creature, mount and Ent cards. If attached to Radagast, Radagast's resources may also be spent to pay for Neutral cards. \n\n \n\nAnd: \n\n \n\n\"Roused to Action\"\n\nNeutral Attachment, [2-cost], Attach to an Ent character. While that character is ready, Ent character's come into play ready. \n\n \n\nBoth would definitely help Radagast but wouldn't be exclusive to decks running Radagast. Plus it would plug one of Radagast's biggest holes--not being able to spent his resources on Neutral cards. \n\n \n\n \n\n> Yes, surge cancelation please.\n\n \n\nYes, yes, a hundred times YES. Doesn't really help any other cards be better but is just something the game needs. \n\n \n\nThere are a few ways they could do it to. Just in events you could have:\n\n \n\n1) Spirit event, [1-cost], cancel all keyword effects on a card just revealed from the encounter deck. \n\n2) Spirit event, [2-cost], cancel the when revealed effect and all keyword effects on a card just revealed from the encounter deck (super-Test of Will). \n\nor 3) Event (Neutral?), [3-4-cost?], discard a card just revealed from the encounter deck without resolving any of its text. Then replace it with the next card from the encounter deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2008993","commentId":2008993,"userName":"Network57","timestamp":1453583904,"content":">  \n> \n> > I like the idea of Radagast's staff, but I think we would only get one with a Radagast hero (a fine idea).  A \"Radagast's staff\" that is restricted to Istari would be possible, but how to make something that would make Radagast be considered instead of just being added to Gandalf's toys.\n> > \n> >  \n> > \n> > This would make Radagast better:\n> > \n> >  \n> > \n> > 0 cost neutral event -- for the rest of the game, Ents are also creatures.\n> > \n> >  \n> > \n> > But that might as well have Radagast's name written on it.  Not practical.  Maybe this would be better?\n> > \n> >  \n> > \n> > Emissary of Yavanna -- 0 cost neutral attachment.  Attach to an Istari character.  May use his resources to pay for ents, and ents come into play ready.\n> > \n> >  \n> > \n> > That'd be used with Gandalf hero, of course, but this would make Radagast a welcome addition to any deck heavy on ents.  Like they need the help.\n> > \n> >  \n> > \n> > So what does Radagast do?  Collect resources, pay for Eagles, heal Eagles.  So to benefit Radagast, we need something that either has to do with resources, putting Eagles in play, or having healthy Eagles.  The latter two, unless carefully restricted, would buff Eagles decks in general, but that's not such a terrible thing, and in any case Eagles decks are the only decks that make Radagast worth having in the first place.\n> > \n> >  \n> > \n> > How about the resource angle?  If used outside an Eagles deck, Radagast would pile up resources.  He and Treebeard are the only allies to do this, and Treebeard can use his resources up by self-readying even in an ent-free deck.  So any resource buff would boost Radagast -- and of course, heroes with resource-generating attachments and abilities, which are already popular enough.  Blood of Numenor,  Gondorian Fire, and Lay of Nimrodel already boost based on resource, but they all specify heroes.  So with attack, defense, and willpower boosted, how can we do something interesting with resources that hasn't been done before, and let Radagast do it?\n> > \n> >  \n> > \n> > We have three different cards to boost W/A/D based on resources - 1.  Any hero is going to have an advantage in generating massive number of resources, while Radagast is stuck at one per turn, so a resource cost wouldn't help much.  So his resource boost needs to be no-cost.  How to do that to benefit Radagast more than heroes?  Easy -- require exhausting the character.  At 2/1/1, exhausting is a higher cost for ANY hero than for Radagast.  So maybe something like this:\n> > \n> >  \n> > \n> > Will of the Istari -- 1 cost neutral attachment.  Exhaust attachment and attached character to give another character +1 willpower, defense, or attack (choose one) for each resource in the character's pool, until the end of phase.\n> > \n> >  \n> > \n> > What about Eagles?  Is there something we could do to reward paying for Eagles?  I'm at a loss to how make this more beneficial to Radagast than to any old Tactics hero, which is a certainty in an Eagles deck.\n> > \n> >  \n> > \n> > Rewarding for healthy eagles has a different problem -- with cheap, 1-HP Eagles around, you don't need a specialized Eagle healer to have plenty roaming around.  A benefit based on healthy unique creatures (there's only 3, Gwaihir, Landroval, and Bill the Pony) has the problem that defense isn't the core strength for any of them, so they aren't terribly hard to keep healthy in the first place.\n> > \n> >  \n> > \n> > So I can't think of a way to buff Radagast for his main function that would actually justify using Radagast, without making the card only applicable to Radagast.\n> \n>  \n> \n> I really like the idea of making Ents work with Radagast but that 0-cost event might just be too OP. Heck, in a dedicated Ent deck I would probably pay 2 or 3 resources just to have them all come into play ready. What about splitting that effect over a couple of cards? Something like:\n> \n>  \n> \n> \"Friend of Nature\" \n> \n> Neutral Attachment, [1-cost], Title, Attach to a Hero or Radagast. Attached character gains the Ent trait. Resources from attached character's resource pool may be spent to pay for all creature, mount and Ent cards. If attached to Radagast, Radagast's resources may also be spent to pay for Neutral cards. \n> \n>  \n> \n> And: \n> \n>  \n> \n> \"Roused to Action\"\n> \n> Neutral Attachment, [2-cost], Attach to an Ent character. While that character is ready, Ent character's come into play ready. \n> \n>  \n> \n> Both would definitely help Radagast but wouldn't be exclusive to decks running Radagast. Plus it would plug one of Radagast's biggest holes--not being able to spent his resources on Neutral cards. \n> \n>  \n> \n>  \n> \n> > Yes, surge cancelation please.\n> \n>  \n> \n> Yes, yes, a hundred times YES. Doesn't really help any other cards be better but is just something the game needs. \n> \n>  \n> \n> There are a few ways they could do it to. Just in events you could have:\n> \n>  \n> \n> 1) Spirit event, [1-cost], cancel all keyword effects on a card just revealed from the encounter deck. \n> \n> 2) Spirit event, [2-cost], cancel the when revealed effect and all keyword effects on a card just revealed from the encounter deck (super-Test of Will). \n> \n> or 3) Event (Neutral?), [3-4-cost?], discard a card just revealed from the encounter deck without resolving any of its text. Then replace it with the next card from the encounter deck. \n> \n>  \n\n \n\nYour \"Roused to Action\" is a fantastic idea. Way better than what I would have come up with. I don't think Radagast is broken, but maybe a little weak in the cardpool now, as Creature hasn't gone anywhere except Bill the Pony - who's there for Sam Gamgee anyways. But I would love to see more love for Radagast and his ability. Of course, expanding him to pay for Ent allies basically duplicates Treebeard's ability, and who wants that?\n\n \n\nHere's what I envisioned:\n\n \n\nEnt-friend\n\nAttachment\n\nCost: 2\n\nSphere: Neutral\n\nAttach to a hero or to Radagast.\n\nResponse: After an Ent character takes damage, exhaust attached character to place that damage instead on the attached character.\n\n \n\nRadagast's Staff\n\nAttachment\n\nCost: 1\n\nSphere: Neutral\n\nAttach to Radagast. Radagast gains the Healer trait.\n\nAction: Exhaust Radagast and Radagast's Staff to (choose one): heal all damage from a Creature or Ent character, or move a Creature or Ent character from any player's discard pile to the top of that player's deck.\n\n \n\nAnd to get some more Ent-specific cards:\n\n \n\nDreams of Trees\n\nEvent\n\nCost: 0\n\nSphere: Lore\n\nAction: Exhaust X Ent characters to add X resources to Treebeard or to a hero's resource pool.\n\n \n\nWe Must Not Be Hasty\n\nEvent\n\nCost: 2\n\nSphere: Spirit\n\nQuest Action: Choose an Ent character committed to the quest. Remove that character from the quest and ready that character.\n\n \n\nI think the last would be a good generic event, too, kind of the opposite of Late Adventurer. If you see after staging that you've over-quested, or have too many enemies and need defenders, you can pull back a character for combat but at the expense of losing their willpower. Apologies if such a card already exists - I don't have the full cardpool yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009006","commentId":2009006,"userName":"JonofPDX","timestamp":1453584955,"content":"> Your \"Roused to Action\" is a fantastic idea. Way better than what I would have come up with. I don't think Radagast is broken, but maybe a little weak in the cardpool now, as Creature hasn't gone anywhere except Bill the Pony - who's there for Sam Gamgee anyways. But I would love to see more love for Radagast and his ability. Of course, expanding him to pay for Ent allies basically duplicates Treebeard's ability, and who wants that?\n> \n>  \n> \n> Here's what I envisioned:\n> \n>  \n> \n> Ent-friend\n> \n> Attachment\n> \n> Cost: 2\n> \n> Sphere: Neutral\n> \n> Attach to a hero or to Radagast.\n> \n> Response: After an Ent character takes damage, exhaust attached character to place that damage instead on the attached character.\n> \n>  \n> \n> Radagast's Staff\n> \n> Attachment\n> \n> Cost: 1\n> \n> Sphere: Neutral\n> \n> Attach to Radagast. Radagast gains the Healer trait.\n> \n> Action: Exhaust Radagast and Radagast's Staff to (choose one): heal all damage from a Creature or Ent character, or move a Creature or Ent character from any player's discard pile to the top of that player's deck.\n> \n>  \n> \n> And to get some more Ent-specific cards:\n> \n>  \n> \n> Dreams of Trees\n> \n> Event\n> \n> Cost: 0\n> \n> Sphere: Lore\n> \n> Action: Exhaust X Ent characters to add X resources to Treebeard or to a hero's resource pool.\n> \n>  \n> \n> We Must Not Be Hasty\n> \n> Event\n> \n> Cost: 2\n> \n> Sphere: Spirit\n> \n> Quest Action: Choose an Ent character committed to the quest. Remove that character from the quest and ready that character.\n> \n>  \n> \n> I think the last would be a good generic event, too, kind of the opposite of Late Adventurer. If you see after staging that you've over-quested, or have too many enemies and need defenders, you can pull back a character for combat but at the expense of losing their willpower. Apologies if such a card already exists - I don't have the full cardpool yet.\n> \n>  \n\n \n\nCool ideas all around. \n\n \n\nHonestly, Ents are already a powerful force so they really don't need that much help themselves but tying them to Radagast definitely helps him. \n\n \n\nI hope if and when we do get a Neutral Radagast Hero he will be able to pay for Ents as well as Creatures (and personally, I think they need to add Mount to that list too since they neglected to give the Mount attachments the Creature trait) even though horse allies have it...\n\n \n\nWe Must Not Be Hasty would be awesome. There are so many times where you wish you could pull someone with a couple good stats off the quest to do something else. 2 might be a little steep though. Think a cost of 1 would be too broken? Or Neutral cost-2 to make it more playable?\n\nEdited January 23, 2016 by JonofPDX"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009028","commentId":2009028,"userName":"PocketWraith","timestamp":1453586074,"content":">  \n> \n> We Must Not Be Hasty\n> \n> Event\n> \n> Cost: 2\n> \n> Sphere: Spirit\n> \n> Quest Action: Choose an Ent character committed to the quest. Remove that character from the quest and ready that character.\n> \n>  \n> \n> I think the last would be a good generic event, too, kind of the opposite of Late Adventurer. If you see after staging that you've over-quested, or have too many enemies and need defenders, you can pull back a character for combat but at the expense of losing their willpower. Apologies if such a card already exists - I don't have the full cardpool yet.\n\nIt does.\n\nhttp://hallofbeorn.com/Cards/Details/Don't-Be-Hasty-TAC [http://hallofbeorn.com/Cards/Details/Don%27t-Be-Hasty-TAC]\n\nEdited January 23, 2016 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009082","commentId":2009082,"userName":"dalestephenson","timestamp":1453588957,"content":"It occurs to me that the exhaust-and-discard for an Istari would be more beneficial to Radagast than Gandalf:\n\n \n\nSacrifice for Nature (0-cost neutral event) -- exhaust and discard an Istari to ready all creatures, mounts, and ents in play.\n\n \n\nOf course, that'd also be useful for Saruman, which would be highly unthematic.\n\n \n\nHow about this?\n\n \n\nRadagast's cloak (1-cost neutral attachment).  Restricted.  Attach to an Istari.  Exhaust character and Radagast's cloak to ready any creature, mount, or ent.\n\n \n\nThis would allow Radagast to use his action for more powerful ents and eagles, but also would work to get another use out of Asfaloth, Shadowfax, and Rohan Warhorse.\n\n---\n\nThinking further on Power of the Earth, it occurs to me we don't really need something that specifically keys off location attachments, it would be sufficient to key off attachments in the staging area.  That seems a natural extension of the traps deck.  Maybe something like this:\n\n \n\nCeledor Hero\n\n9 threat Spirit\n\n2/2/2/3\n\n \n\nRanger.  Gondor.\n\n \n\nExhaust Celador to do X damage to a non-unique enemy in the staging area, where X is the number of attachments in the staging area.\n\n \n\nMaking him spirit gives him a sphere match to Power in the Earth and Thror's Key, though he'd also obviously benefit from Ranger Spikes.  Wingfoot would be huge on him once you had a few attachments permanently in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009642","commentId":2009642,"userName":"player1922162","timestamp":1453639844,"content":"Steward of Gondor.\n\nCan ONLY be played on Gondor heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009675","commentId":2009675,"userName":"zeromage","timestamp":1453642513,"content":"The ent idea for radagast is cool, but I'm not sure it's very thematic as I'm not sure he ever had any contact with ents in the books (I could be wrong there).\n\nRadagast' staff:\n\n2 neutral resources\n\nAttach to radagast\n\nRadagast gains +1hp\n\nExhaust radagast's staff to return a creature from your discard pile to your hand.\n\nEdited January 24, 2016 by zeromage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2009755","commentId":2009755,"userName":"Lecitadin","timestamp":1453648775,"content":"> Steward of Gondor.\n> \n> Can ONLY be played on Gondor heroes.\n\n \n\nNoooo!!!!  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010012","commentId":2010012,"userName":"DurinVoronwe","timestamp":1453663721,"content":"Steward of Gondor: attach to a noble, Gondor hero, or Aragorn.\n\n \n\nThat would make Imrahil, Faramir, Boromir, Eleanor, Denethor and Aragorn the only options.\n\nOr just for noble Gondor heroes. Then I would make: King of Gondor (leadership). Attach to Aragorn. He gains the Gondor trait. Action: exhaust King of Gondor to add 3 resources to attached hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010015","commentId":2010015,"userName":"John Constantine","timestamp":1453663829,"content":"Oh, I would do a lot... and I am, actually :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited January 24, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010093","commentId":2010093,"userName":"DukeWellington","timestamp":1453667931,"content":"You can't have Steward of Gondor and King of Gondor in play at the same time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010336","commentId":2010336,"userName":"Gizlivadi","timestamp":1453679057,"content":"> You can't have Steward of Gondor and King of Gondor in play at the same time!\n\n \n\nActually you can. IIRC the Steward still existed during the days of the King, and even Faramir was named Steward after Aragorn was crowned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010407","commentId":2010407,"userName":"Nerdmeister","timestamp":1453681987,"content":"FFG just announced some fixes/updates to some of these broken cards here [https://www.youtube.com/watch?v=dQw4w9WgXcQ]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010698","commentId":2010698,"userName":"dalestephenson","timestamp":1453699365,"content":"> Steward of Gondor.\n> \n> Can ONLY be played on Gondor heroes.\n\nThis is pretty much exactly opposite of the premise of the thread, but does open up another theoretical design question -- can you release a card that weakens a \"too-strong\" card, but that would still get played?  Aside from hero/allies, where you can reduce incidence of using a strong hero but releasing a strong ally of the same name (or vice versa), nothing comes to mind.\n\n \n\nOf course, while FFG won't errata a card to make it useful, they have no qualms about errata-ing a card to prevent it from being broken -- even if the errata makes the card a coaster.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010707","commentId":2010707,"userName":"dalestephenson","timestamp":1453699677,"content":"> The ent idea for radagast is cool, but I'm not sure it's very thematic as I'm not sure he ever had any contact with ents in the books (I could be wrong there).\n\n \n\nNo known contact with ents, but we know from Tolkien that Radagast was a Maia of Yavanna, and that he was concerned with plants as well as beasts.  He'd have a lot in common with ents, and there's certainly nothing in the books to rule out previous contact with ents.  I think the Yavanna connection is enough to provide a thematic link."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2010799","commentId":2010799,"userName":"Bellator Sardel","timestamp":1453705966,"content":"> FFG just announced some fixes/updates to some of these broken cards here [https://www.youtube.com/watch?v=dQw4w9WgXcQ]\n\nOh, you're good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2011075","commentId":2011075,"userName":"DurinVoronwe","timestamp":1453724997,"content":">  \n> \n> > You can't have Steward of Gondor and King of Gondor in play at the same time!\n> \n>  \n> \n> Actually you can. IIRC the Steward still existed during the days of the King, and even Faramir was named Steward after Aragorn was crowned.\n> \n> e\n\nBut steward generates only one resource if king is in play.\n\n \n\nForgot: king is cost Three.\n\nEdited January 25, 2016 by DurinVoronwe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2011131","commentId":2011131,"userName":"Lecitadin","timestamp":1453727353,"content":"> FFG just announced some fixes/updates to some of these broken cards here [https://www.youtube.com/watch?v=dQw4w9WgXcQ]\n\n \n\nLOLOL!! This made my morning!!!!  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2011717","commentId":2011717,"userName":"opethwindowpane","timestamp":1453743682,"content":"To me, a fix is different from a redesign.  Some cards seem to only work in certain situations, and fail completely in others as an apparent side effect.  Here are some I have thought of recently:\n\n \n\nBilbo Hero: Instead of the first player getting the draw every time, you get to decide which player gets the draw.  PROBLEM FIXED: bad in multiplayer because other players often did not need the card draw.\n\n \n\nDori Hero: Increase Hit Points from 5 to 6, so he gets a bonus HP like Bifur.  PROBLEM FIXED: he depended too much on his situational ability.\n\n \n\nGrima Hero: Add text: \"Other players do not raise threat as a result of this doomed effect\".  PROBLEM FIXED: much worse in multiplayer for no apparent reason.  For this one, I should mention that I didn't like the design to begin with since he cannot realistically use many doomed cards which seem to be designed thematically with him in mind; I would have simply replaced his existing ability with the ability: \"Raise your threat elimination level by 1 for each card in your discard pile with the doomed keyword. Forced: When a card with the doomed keyword enters your discard pile, if you did not just play the card from your hand shuffle that card into your deck.\".\n\n \n\n \n\nAnd also some overpowered cards that need fixing:\n\n \n\nSteward of Gondor: Reduce resources generated from 2 to 1.  PROBLEM FIXED: was way overpowered.  Even 1 resource per turn is great.\n\n \n\nOutlands Allies: Add text to the allies which buff other Outlands cards: \"Multiple copies of this effect only count once\". PROBLEM FIXED: the power of the allies grew exponentially rather than linearly. Especially noticeable in a deck with lots of card draw.  Unlike PVP games, the encounter deck is not reactive enough to counter this exponential growth.\n\nEdited January 25, 2016 by opethwindowpane"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2012066","commentId":2012066,"userName":"Kjeld","timestamp":1453751846,"content":"Bilbo is an interesting challenge. In keeping with the goal of this thread, which is to improve old cards not through errata but through adding additional cards to the pool that can \"cover\" for the glaring weaknesses, here's my idea.\n\n \n\nTo start, what is the problem with the Bilbo hero? Primarily, lackluster stats given a high starting threat of 9, especially for such a flimsy hero; at 2 hit points, a strong breeze will take out our favorite burglar/scholar!\n\n \n\nSo, we need to find a way to either boost stats or lower threat for Bilbo. We also want to target Bilbo primarily, as the other hobbits are already quite strong enough and we want to give people a reason to play Bilbo. The latter seems a more thematic choice for hobbits, who really should be all about secrecy and avoiding enemies. Willpower boosting makes sense to me as well, though. So here's my suggestion:\n\n \n\nMore than Meets the Eye\n\nLore. Attachment. Cost: 2.\n\n \n\nCondition.\n\n \n\nAttach to a hobbit hero. Limit 1 per hero.\n\n \n\nResponse: After an enemy is revealed, give attached hero +1 willpower (+2 willpower if attached hero is Bilbo). Then, if each hero you control has the Hobbit trait, reduce your threat by 1. (Limit once per round)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2012264","commentId":2012264,"userName":"Rajam","timestamp":1453756677,"content":"\"Power of the powerless [Attachment]\n\n \n\nAttach to a hero. Restricted\n\nAll Allies with blank text (no abilities) gain +1 WP +1 ATK +1 DEF\"\n\n \n\nEither Leadership or Tactics sphere. 2 Cost I guess"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2012275","commentId":2012275,"userName":"Rajam","timestamp":1453757797,"content":"\"A decent fellow [Attachment]\n\n \n\nAttach to hero Nori.\n\n \n\nAction: Remove Nori from the game. You can replace him with some other hero\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2012692","commentId":2012692,"userName":"JonofPDX","timestamp":1453768884,"content":"> \"A decent fellow [Attachment]\n> \n>  \n> \n> Attach to hero Nori.\n> \n>  \n> \n> Action: Remove Nori from the game. You can replace him with some other hero\"\n\nSo..obviously this is a joke but why the Nori hate? Is he thought of as a bad card? I've always thought he was awesome in a dedicated dwarf deck...\n\nAlso, regarding Ourlands...it's not super relevant to this thread but I feel like it's worth mentioning that I absolutely support us having some self-contained \"over-powered\" card sets. I think it's necessary for a coop game this hard when you simply can't assume that every player is going to be at the same skill level or has access to a full cardpool of the best cards. Outlands let's new players play harder quests with experienced players.\n\n> Bilbo is an interesting challenge. In keeping with the goal of this thread, which is to improve old cards not through errata but through adding additional cards to the pool that can \"cover\" for the glaring weaknesses, here's my idea.\n> \n>  \n> \n> To start, what is the problem with the Bilbo hero? Primarily, lackluster stats given a high starting threat of 9, especially for such a flimsy hero; at 2 hit points, a strong breeze will take out our favorite burglar/scholar!\n> \n>  \n> \n> So, we need to find a way to either boost stats or lower threat for Bilbo. We also want to target Bilbo primarily, as the other hobbits are already quite strong enough and we want to give people a reason to play Bilbo. The latter seems a more thematic choice for hobbits, who really should be all about secrecy and avoiding enemies. Willpower boosting makes sense to me as well, though. So here's my suggestion:\n> \n>  \n> \n> More than Meets the Eye\n> \n> Lore. Attachment. Cost: 2.\n> \n>  \n> \n> Condition.\n> \n>  \n> \n> Attach to a hobbit hero. Limit 1 per hero.\n> \n>  \n> \n> Response: After an enemy is revealed, give attached hero +1 willpower (+2 willpower if attached hero is Bilbo). Then, if each hero you control has the Hobbit trait, reduce your threat by 1. (Limit once per round).\n\nI really like the idea of buffing Bilbo this way. He needs it. That threat is just SO high..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2014312","commentId":2014312,"userName":"player1922162","timestamp":1453831229,"content":"What about this?\n\nEvent: Lower your threat by 3 for each Hobbit hero you control. Then remove this card from the game.\n\nNeutral, cost 2\n\nOnly one copy allowed in deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2014428","commentId":2014428,"userName":"JonofPDX","timestamp":1453834649,"content":"> What about this?\n> \n> Event: Lower your threat by 3 for each Hobbit hero you control. Then remove this card from the game.\n> \n> Neutral, cost 2\n> \n> Only one copy allowed in deck.\n\n \n\nBy three is probably way to OP. Maybe by 2?\n\n \n\nI like the idea, though, since Hobbits like having minimal threat. What about a new version of Fatty? Something like:\n\n \n\n\"Fatty Bolger\"\n\nSpirit Ally, [2-cost], 1/0/2/2, Hobbit, Action: discard Fatty Bolger to lower each players threat by 1 for each Hobbit character they control. \n\n \n\nThat would be pretty thematic and serve the same function and help Bilbo not cost so much in threat. Would also help Spirit Pippin and Spirit Frodo as both abilities raise threat. And he could take a single, weak, attack (if you want to risk him on a bad shadow draw) and still trigger his discard as it does not require him to exhaust. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2015488","commentId":2015488,"userName":"Distractionbeast","timestamp":1453871621,"content":"To fix my personal fave, Power in the Earth:\n\n \n\nFamiliar Lands\n\nSpirit Attachment, cost 2:\n\n \n\nAttach to a location.  Attached location gets -1 (threat).  \n\nAction: Discard attached location if it's (threat) is less than 1.\n\n \n\n-----------------------------------------------------------------------------\n\n \n\nFor hero Dori:\n\n \n\n \n\nDurin's Plate\n\nTactics Attachment, cost 1:\n\n \n\nAttach to a Dwarf hero.  Restricted.  Attached hero gets +1 (defense) for each exhausted Dwarf hero you control.\n\n \n\n-----------------------------------------------------------------------------------------------------\n\n \n\nParrying Knife\n\nTactics Attachment, cost 2:\n\n \n\nAttach to a hero.  Restricted.\n\nResponse: After the attached hero takes damage from an undefended attack, reduce that damage by 1 and ready him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016063","commentId":2016063,"userName":"dalestephenson","timestamp":1453906500,"content":"Bilbo's strength is card draw.  Bilbo's weakness is too high threat.  So I think a natural fix would be something like this:\n\n \n\nBilbo's Pipe (neutral cost 1 attachment, pipe).  Attach to a hobbit hero, limit 1 per hero.  Action: Discard a card and exhaust Bilbo's Pipe to reduce threat by one (two if on Bilbo).\n\n \n\nThis would be generally useful for Hobbit secrecy decks, which don't often have Bilbo, but with Hero Bilbo you could have a deck that has threat actively declining without reducing effective hand size, useful for all sorts of shenanigans.  It's unfortunate that the designated pipe fetcher is Bilbo ally, but I think the effect is strong enough to overcome it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016196","commentId":2016196,"userName":"Kakita Shiro","timestamp":1453909760,"content":"> Bilbo's strength is card draw.  Bilbo's weakness is too high threat.  So I think a natural fix would be something like this:\n> \n>  \n> \n> Bilbo's Pipe (neutral cost 1 attachment, pipe).  Attach to a hobbit hero, limit 1 per hero.  Action: Discard a card and exhaust Bilbo's Pipe to reduce threat by one (two if on Bilbo).\n> \n>  \n> \n> This would be generally useful for Hobbit secrecy decks, which don't often have Bilbo, but with Hero Bilbo you could have a deck that has threat actively declining without reducing effective hand size, useful for all sorts of shenanigans.  It's unfortunate that the designated pipe fetcher is Bilbo ally, but I think the effect is strong enough to overcome it.\n\nSomething like this would just get attached to Ally Bilbo and reduce threat to single-digits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016208","commentId":2016208,"userName":"TipsyGamer","timestamp":1453910118,"content":"> Something like this would just get attached to Ally Bilbo and reduce threat to single-digits.\n\nHis card says 'Attach to a Hobbit Hero', so Ally Bilbo doesn't work, unless you Sword Thain him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016214","commentId":2016214,"userName":"Kakita Shiro","timestamp":1453910189,"content":"> > Something like this would just get attached to Ally Bilbo and reduce threat to single-digits.\n> \n> His card says 'Attach to a Hobbit Hero', so Ally Bilbo doesn't work, unless you Sword Thain him.\n\nMissed that Hobbit Hero part."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016293","commentId":2016293,"userName":"DukeWellington","timestamp":1453911495,"content":"The problem is they already have Hobbit pipe. It's not distinct enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016344","commentId":2016344,"userName":"Kakita Shiro","timestamp":1453912320,"content":"> The problem is they already have Hobbit pipe. It's not distinct enough.\n\nName it \"There And Back Again\", a Unique Lore attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016762","commentId":2016762,"userName":"dalestephenson","timestamp":1453920718,"content":"> The problem is they already have Hobbit pipe. It's not distinct enough.\n\nIf it's a \"pipe\", it's pretty forgone that pipe needs to be in the name, and \"Bilbo's\" pipe seems to me as distinct from Hobbit pipe as Wizard Pipe.  But I'm not at all attached to the name.\n\n \n\nOr is it that the effect is not distinct enough?  It shares the Hobbit pipe trait of being only attached to hobbits, but in this case it's restricted to hobbit heroes.  Hobbit pipe also has to do with threat and cards, but the effect is reversed -- if you reduce threat with an event, you get a card.  That's the opposite of what would benefit Bilbo hero.  Bilbo's Pipe wouldn't enable the Hobbit Pipe, because it doesn't lower threat via event.\n\n \n\nGiven that the lore has dwarves and dunedain (Aragorn) as pipe smokers, I assume there will be more pipes someday that can attach to them.  This is not that pipe.\n\nEdited January 27, 2016 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2016786","commentId":2016786,"userName":"dalestephenson","timestamp":1453921335,"content":">  \n> \n> > Something like this would just get attached to Ally Bilbo and reduce threat to single-digits.\n> \n> His card says 'Attach to a Hobbit Hero', so Ally Bilbo doesn't work, unless you Sword Thain him.\n> \n>  \n\nSword Thain/Bilbo/Bilbo's pipe would be a sweet combo, since Bilbo ally can fetch the pipe, but I don't think it'd reduce threat to single-digits without throwing Silver Harp in the mix, because of the discard cost.  Sweet combo, but it takes four cards, four spirit resources, and five neutral resources.  Meanwhiile, Hero Bilbo needs one card and one resource to use his extra card every turn (solo) for continual threat reduction.  Not that Silver Harp (and Song of Travel)  wouldn't make him even better...\n\n \n\nIf the card existed, I think you'd definitely see Hero Bilbo become much more popular.\n\nEdited January 27, 2016 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2018002","commentId":2018002,"userName":"DukeWellington","timestamp":1453976138,"content":"I don't have a problem with a card named \"Bilbo's Pipe\", great idea (but a card named \"There and Back Again\" with a trait \"manuscript\" would be even more cool). I have a problem with Hobbit Pipe and Bilbo's Pipe being too similar in theme, like you could mix them up. That is just my opinion, not a huge criticism."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2018777","commentId":2018777,"userName":"JonofPDX","timestamp":1454001372,"content":"I think the two are similar (Pipe Attachments dealing with card draw/discard and threat reduction) but I think that's the point. Similar effects on similar cards makes sense thematically.\n\n \n\nAs for confusion between the cards (especially considering that mechanically you would probably want Bilbo's Pipe to be Spirit) I can see it happening the first couple games your playing with it but some diverse artwork could probably fix most of that. \n\n \n\nI actually do like the idea of a Lore Manuscript with the same effect but it then becomes none fetchable and no longer interacts as a Pipe (for things like Smoke Rings). And now that I think about it--Bilbo's Pipe actually makes that underused card better too.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2023455","commentId":2023455,"userName":"PsychoRocka","timestamp":1454204593,"content":"> To fix my personal fave, Power in the Earth:\n> \n>  \n> \n> Familiar Lands\n> \n> Spirit Attachment, cost 2:\n> \n>  \n> \n> Attach to a location.  Attached location gets -1 (threat).  \n> \n> Action: Discard attached location if it's (threat) is less than 1.\n> \n>  \n> \n> -----------------------------------------------------------------------------\n> \n>  \n> \n> For hero Dori:\n> \n>  \n> \n>  \n> \n> Durin's Plate\n> \n> Tactics Attachment, cost 1:\n> \n>  \n> \n> Attach to a Dwarf hero.  Restricted.  Attached hero gets +1 (defense) for each exhausted Dwarf hero you control.\n> \n>  \n> \n> -----------------------------------------------------------------------------------------------------\n> \n>  \n> \n> Parrying Knife\n> \n> Tactics Attachment, cost 2:\n> \n>  \n> \n> Attach to a hero.  Restricted.\n> \n> Response: After the attached hero takes damage from an undefended attack, reduce that damage by 1 and ready him.\n\nI love parrying knife. The idea of an attachment (or an event would work too really) that can help you turn around taking an undefended attack which can carry a lot of risk with the shadow effect potentially boosting that attack to kill whoever takes the undefended damage is fantastic. I would love to see a card in the near future that does something similar to this.\n\n \n\nHere is an alternative event card version:\n\n \n\nBattle Fury/Blood Rage\n\n1/2 cost tactics\n\nAfter a hero you control takes damage from an undefended attack, so long as that hero is not discarded, ready it and it gets +1 attack until the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/199998-what-would-you-add-to-fix-the-games-worst-cards/?do=findComment&comment=2023927","commentId":2023927,"userName":"Distractionbeast","timestamp":1454246369,"content":">  \n> \n> > To fix my personal fave, Power in the Earth:\n> > \n> >  \n> > \n> > Familiar Lands\n> > \n> > Spirit Attachment, cost 2:\n> > \n> >  \n> > \n> > Attach to a location.  Attached location gets -1 (threat).  \n> > \n> > Action: Discard attached location if it's (threat) is less than 1.\n> > \n> >  \n> > \n> > -----------------------------------------------------------------------------\n> > \n> >  \n> > \n> > For hero Dori:\n> > \n> >  \n> > \n> >  \n> > \n> > Durin's Plate\n> > \n> > Tactics Attachment, cost 1:\n> > \n> >  \n> > \n> > Attach to a Dwarf hero.  Restricted.  Attached hero gets +1 (defense) for each exhausted Dwarf hero you control.\n> > \n> >  \n> > \n> > -----------------------------------------------------------------------------------------------------\n> > \n> >  \n> > \n> > Parrying Knife\n> > \n> > Tactics Attachment, cost 2:\n> > \n> >  \n> > \n> > Attach to a hero.  Restricted.\n> > \n> > Response: After the attached hero takes damage from an undefended attack, reduce that damage by 1 and ready him.\n> \n> I love parrying knife. The idea of an attachment (or an event would work too really) that can help you turn around taking an undefended attack which can carry a lot of risk with the shadow effect potentially boosting that attack to kill whoever takes the undefended damage is fantastic. I would love to see a card in the near future that does something similar to this.\n> \n>  \n> \n> Here is an alternative event card version:\n> \n>  \n> \n> Battle Fury/Blood Rage\n> \n> 1/2 cost tactics\n> \n> After a hero you control takes damage from an undefended attack, so long as that hero is not discarded, ready it and it gets +1 attack until the end of the phase.\n> \n>  \n\n \n\nI like it.  I thought about Parrying Knife maybe being a bit powerful, but I threw it out there for discussion anyway  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png].   btw, I think you can shorten it to:  \"Response: After a hero you control takes damage from an undefended attack, ready it and it gets +1 attack until the end of the phase\".  If it gets discarded, the rest of the card would have no effect anyway.\n\n \n\nThe idea is that something like this would allow Dori to exhaust to trigger his ability more freely without such a big action penalty.  I had some other ideas as well, but some of them got a little to complicated to word efficiently on a card.  I don't like complicated or overly wordy cards."}]}