{"url":"https://community.fantasyflightgames.com/topic/200358-blood-thirsty-warg-timing-at-start-of-night/","title":"Blood Thirsty Warg timing at start of Night","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/200358-blood-thirsty-warg-timing-at-start-of-night/?do=findComment&comment=2012832","commentId":2012832,"userName":"JYoder","timestamp":1453773933,"content":"This is in Wastes of Eriador quest...\n\n \n\nNight comes and says, \"Forced: When it becomes Night, reveal an encounter card.\"\n\n \n\nI reveal Blood-Thirsty Warg, which says, \"While Blood-thirsty Warg is in the staging area, it gains, 'Forced: When it becomes Night, Blood-thirsty Warg engages the first player and makes an immediate attack.'\"\n\n \n\nSo... has it already \"become Night\", so he stays put? Or is the affect ongoing at this moment, and he immediately engages?\n\n \n\nI really hate timing issues in this game -- completely jars me from the game. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/200358-blood-thirsty-warg-timing-at-start-of-night/?do=findComment&comment=2012916","commentId":2012916,"userName":"GrandSpleen","timestamp":1453777415,"content":"I think in my own games when this came up, I did not have the Warg engage.  But let's see if I can talk myself out of that by looking at other similar situations.\n\n \n\nA recent ruling tells us that Overcome by Grief [http://hallofbeorn.com/Cards/Details/Overcome-by-Grief-RD] attaches to a hero the first time a character leaves play, but you do not have to trigger its Forced effect at this time.  The card needs to be already attached at the time the trigger is activated:\n\n \n\n\"Forced effects do not trigger unless they are in play at the time that they would trigger. This is true for Response effects as well.\n\nCheers,\nCaleb\" (source [https://community.fantasyflightgames.com/topic/187963-when-is-overcome-by-grief-first-triggered/])\n\n \n\nBased on that, the Warg would not engage.\n\n \n\nAnother similar situation: Goblin Archer [http://hallofbeorn.com/Cards/Details/Goblin-Archer-KD] does trigger off itself.  He has a Forced effect that places a damage on a hero when an enemy is revealed from the encounter deck.\n\n \n\n\"Yes, the Goblin Archer will trigger its own effect after it is revealed.\n\nCheers,\nCaleb\" (source [https://community.fantasyflightgames.com/topic/125830-goblin-sniper-triggers-for-itself/?hl=%2Bgoblin+%2Barcher])\n\n \n\nIn this case we have another timey-wimey issue.  The sequence for revealing a card goes:\n1-enemy is revealed\n\n2-enemy is added to the staging area\n\n \n\nSo the Forced effect on that Sniper... is it eligible to be triggered at point 1, or not until point 2?  I guess the answer must be point 1 (otherwise it couldn't trigger of itself).  So then we have a card which is in play at the time its trigger occurs (these are simultaneous I suppose, since the Archer is revealed and comes into play at the same moment).  This would not have an impact on the Warg thing and we would be consistent if we did not allow the Warg to engage.\n\n \n\nIf the Forced effect is not eligible to be triggered until point 2, I don't think the current ruling on the Archer makes sense.  \n\n \n\nAnyway, long story short, I favor not having the Warg engage.  It seems most like the Overcome by Grief example.\n\nEdited January 26, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/200358-blood-thirsty-warg-timing-at-start-of-night/?do=findComment&comment=2013011","commentId":2013011,"userName":"Delaric","timestamp":1453780763,"content":"No, the Warg does not trigger it's ability since it has already \"become\" night before it was revealed.  It becomes night, then an encounter card is revealed.  The \"becomes night\" trigger has already passed before the new card is revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/200358-blood-thirsty-warg-timing-at-start-of-night/?do=findComment&comment=2015368","commentId":2015368,"userName":"JYoder","timestamp":1453863313,"content":"Thanks much!"}]}