{"url":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/","title":"[Custom Hero Expansion] Travelers of Middle Earth: The Nine Walkers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025262","commentId":2025262,"userName":"dwjmeijer","timestamp":1454323236,"content":"I'm proud to announce my first (of hopefully more) custom hero expansion!\n\n \n\nYou can find it here. [http://dataflux.nl/nine-walkers/]\n\n \n\nEnjoy! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025274","commentId":2025274,"userName":"Fingolfin Fate","timestamp":1454324300,"content":"I hope you will excuse my rush thoughts. I just want to give immediate response to seeing these.\n\n \n\nGandalf. Too strong.\n\n \n\nGimli. Great. Very balanced, and thematic.\n\n \n\nBoromir. Excellent. Even better than the above.\n\n \n\nSam. Not sure.\n\n \n\nPippin. Very intriguing.\n\n \n\nMerry. Nice but perhaps too strong. These sort of abilities are no brainers, I like those where you have to (at least sometimes) make some decision. As it is Merry will always quest and he will make some other hero very strong. I like he has a Rohan trait, but not if Pippin doesn't have Gondor trait. I think these be better saved for ally versions.\n\n \n\nLegolas. Interesting, but not sure.\n\n \n\nAragorn. Too strong. I know there are not many artifacts yet, but just with Sword that was Broken, this would make up for an ultra-powerful opening. Just like with your version of Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025290","commentId":2025290,"userName":"dwjmeijer","timestamp":1454325723,"content":"Thank you for your thoughts, I'll reply to some of these!\n\n \n\n>Gandalf. Too strong.\n\n \n\nAt the cost of not using any other version of Gandalf though! I'll agree he is very strong, but because this is his only ability, it has to be strong for him to be worth it. In play-testing, I never felt he was *too* good.\n\n \n\n>Merry. Nice but perhaps too strong. These sort of abilities are no brainers, I like those where you have to (at least sometimes) make some decision. As it is Merry will always quest and he will make some other hero very strong. I like he has a Rohan trait, but not if Pippin doesn't have Gondor trait. I think these be better saved for ally versions.\n\n \n\nwhich is exactly why I gave him another attack and threat, so this wouldn't be his only use. Questing successfully is also not something you can always do (though his ability helps).\n\nRegarding Rohan and Gondor, Pippin is not meant to represent the Hobbit in Gondor's service, or his ability would have been different.\n\n \n\n>Aragorn. Too strong. I know there are not many artifacts yet, but just with Sword that was Broken, this would make up for an ultra-powerful opening.\n\n \n\nWith 3 copies of Sword that was Broken, there's only about a 55% chance of drawing it in your opening hand, and that's if you mulligan for it. (Edit: 78% percent if using my new Gandalf hero as well.) And like with Gandalf, you're not using another version of Aragorn, which are all very powerful. At best, he saves you 10 resources over the course of 5 turns, and he definitely takes some setup.\n\n \n\n \n\nI encourage you to try it, and hopefully you'll find they are not as broken as they seem :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nBut your feedback is very welcome!\n\nEdited February 1, 2016 by dwjmeijer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025302","commentId":2025302,"userName":"John Constantine","timestamp":1454326753,"content":"Where did you find that Keen-eyed Took art? @_@"},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025311","commentId":2025311,"userName":"dwjmeijer","timestamp":1454327634,"content":"> Where did you find that Keen-eyed Took art? @_@\n\nI cropped it out of the card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025396","commentId":2025396,"userName":"Lecitadin","timestamp":1454332466,"content":"Never thuught of a neutral Aragorn!! Genious!!\n\nGood ideas in here, nice work!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025430","commentId":2025430,"userName":"Calvadur","timestamp":1454334528,"content":"Impressions just from reading the cards:\n \n\nGandalf:  Looks good. We don't have that many characters that have strong starting effects and then do less/nothing for the rest of the game (Spiritfindel with his low threat and Beorn come to mind). And having a character draw 5 Cards doesn't seem that broken. Berevor, Pippin (lore), Galadriel and others have the potential to draw more more Cards, obviously that takes longer, but few games end that quick. And for the rest of the game you just have a threat heavy bag of stats (with Gandalfs toys, but the pipe isn't that great without top Card Manipulation).\n\n \n\nGimli: Hello combat Sam :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Jokes aside I like the never exhausted dwarf as long as there are enemies to slay idea for Gimli.\n\n \n\nBoromir: Cool idea! Best thing about the Card would be for me to use his ability in the last round of quests where it's just about cleaning up all enemies as he wouldn't be added to the victory display before you win.\n\n \n\nSam: Good his ability isn't limited once per Phase. With a Little healing, Spirit Frodo and fast hitches a real Hobbit wall would be possible and with Spirit you even have willpower boosts for Sam.\n\n \n\nPippin: I don't really see where he would fit into my Hobbit deck, as he would block Pippin (lore) and imo is worse than Sam (Leadership). Ofc when you Play tatics Sam this Pippin could make up for the loss of 1 willpower. He needs quite some testing before the final judgement.\n\n \n\nMerry: Solid hero. Nothing special. His ability with his low threat makes him \"Spiritfindel-like\" just use a hero with good willpower and an other usefull ability/stat and make him do both just with running Merry.\n\n \n\nFrodo: Somewhat a better Fatty Bolger. I would have liked to swap 1 defense for 1 hitpoint, as Frodo otherwise really needs a healer to make use ofhis ability. But if you have that and threat Control you can completly stop the encounterdeck from ever adding an enemie/location to the staging area. The Combo with the Spirit Merry Comes to mind: Reveal enemy, lower threat, raise threat shuffle back into deck.\n\nLooks broken in solo play for me.\n\n\n\nLegolas: Lore has so much draw, why would I use a 1 willpower hero to quest just to draw 1 Card? And the tactics hero and ally version of Legolas are very good. Don't think this guy would see much Play, he feels somewhat like Thalin: His ability only works when you work around his weak stat :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nAragorn: I like that he is neutral and gets his icons through the artifacts he has, but I feel he is borderline strong. By playing the artifacts for free he generates ressources like crazy: A free broken sword in the first turn means 3 ressources, completly free! Of course this is the best case and only celebrian stone does cost more than 1 outside of campaign-mode (counting the playable Cards with Aragorns ability), but I would prefer a wording like:\n\n\"Aragorn may pay for any artifact in your hand. Reduce the cost to play an artifact on Aragorn by 2 \"\n\n \n\nThis way you can still get the sword out first turn, but have to use Aragorns ressource.\n\n \n\nAll in all: Mostly cool heroes, some tend to the stronger side, but nothing that couldn't be fixed easily, if it really turns out to strong. Boromir looks like he is your best designed one, while I really don't see Legolas ever quest for 1. Gandalf (as usual) and Aragorn look like they will be the most controversal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025454","commentId":2025454,"userName":"dwjmeijer","timestamp":1454335491,"content":"Thanks for the feedback, again I'd like to respond and clarify some things!\n\n \n\n \n\n>Pippin: I don't really see where he would fit into my Hobbit deck\n\n \n\nHe's not intended to be better, just for you to have more choice ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nAlso, quad-sphere hobbits are pretty sweet.\n\n \n\n \n\n>Frodo: ... Looks broken in solo play for me.\n\n \n\nYou won't believe how much playtesting it took to get this right. But right now, I don't think he is.\n\n- He *requires* dedicated healing and probably a hit point increase.\n\n- Having him be committed to the quest adds to the danger, a lot of treacheries can damage him, there's no action window to heal him until after staging.\n\n- Shuffling the card back in only delays the problem.\n\n- He doesn't save you against Surge or treacheries.\n\nAll in all, it is an ability that is dangerous to use, and using it for more than the worst enemies, locations or side quests is not recommended.\n\n \n\n \n\n>Legolas: Lore has so much draw, why would I use a 1 willpower hero to quest just to draw 1 Card?\n\n \n\nBecause in 4 player, you might reveal 4 enemies, and draw four cards. Or have 4 players draw one card. Working around his \"weak stat\" is very much intentional, you either use him as a great attacker, or use him for card draw. Not recommended for games with less than 3 players.\n\n \n\n \n\n>All in all: Mostly cool heroes, some tend to the stronger side, but nothing that couldn't be fixed easily, if it really turns out to strong.\n\n \n\nThanks! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2025634","commentId":2025634,"userName":"Lecitadin","timestamp":1454339796,"content":"I might proxy hero Bilbo. Too cool!..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2026095","commentId":2026095,"userName":"Seastan","timestamp":1454350360,"content":"Hey Dirk, very creative ideas here.\n\n \n\nPippin is my favourite. I love the idea of one of the hobbits getting an extra icon so that you can make a quad-sphere Hobbit deck.\n\n \n\nFrodo though.... hands down the strongest hero ever. Putting him with Lorefindel meas you can start cancelling encounter cards from turn 1 for the cost of 1 resource (and some threat, but who cares about threat when there are no enemies). Enemies that surge are typically very weak, so effectively Frodo turns the encounter deck into a pile of crows, treacheries, and cards that raise 2-3 threat and then get discarded. In a 4 player game he basically turns it into a 3 player game by providing a constant Gildor's council every turn (except better, because you can wait to use him to cancel particularly difficult cards). \n\n \n\nLegolas has ranged and 3 attack but an ability for questing, that might not even trigger? And he only contributes 1 willpower. Hmm, I don't see him being used over a competitor like Haldir. Or just giving up the 1 willpower and uncertain cards for 2 guaranteed cards (Beravor).\n\n \n\nAragorn's ability is very creative, but I agree with others that it is too powerful. Maybe a 1-cost reduction on artifacts, and Aragorn's pool can pay for any artifact.\n\n \n\nSam is a really well designed card. It makes me think about a lot of different deck ideas. I like him a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2026449","commentId":2026449,"userName":"dwjmeijer","timestamp":1454358522,"content":"Hey Chris,\n\n \n\nThanks for the thoughts!\n\n \n\nFrodo in solo play might very well be broken, but in multiplayer, I definitely don't think he is. I've not felt comfortable using him every turn, because of things like Necromancer's Reach and the fact that you can't heal during staging. And you shouldn't *have* to get rid of every enemy, any player can easily handle one per turn. It's the Marsh Adders that need to avoided, so that's when you use his ability. Then again, you're probably an authority on what's broken and what's not! \n\n \n\n \n\nRegarding Legolas, the relation to Beravor is exactly as intended, you can go for 2 guaranteed cards and well-rounded stats, or you can go for a possible higher reward (3+ cards, divided amongst players in various ways) and a a strong attacker when you need one. It really depends on the quest, you obviously shouldn't use him in a quest with too few enemies.\n\n \n\n \n\nAt 1 resource reduction, would you every pick this Aragorn over one of the other ones? At 2, I can see it work, Sword that Was Broken being the only one to still cost a resource, but at 1 resource, you're just missing out on one of his other possible abilities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/201046-custom-hero-expansion-travelers-of-middle-earth-the-nine-walkers/?do=findComment&comment=2027030","commentId":2027030,"userName":"Seastan","timestamp":1454377134,"content":"Maybe you could introduce another powerful cost 3 artifact that gives Aragorn a Tactics icon (as there are none yet). I think you could reliably get an artifact down every turn, especially with access to the Daggers of Westernesse. Note that his ability is not just the cost reduction, but the fact that he can pay for artifacts of any sphere using his pool. That itself is powerful. I really like the idea here though, maybe you can think of a better way of balancing it.\n\n \n\nIn multiplayer, the way I see it is that if each player can take care of 1 encounter card per turn on average, they are pulling their weight. Frodo does that with very little cost, and anything else you do goes above and beyond your expected contribution of 1 card/turn. You can always cancel the last card revealed if you are that concerned about the Necromancer's reach.  Then again you could just build a Frodo/Sam/Treebeard deck with 3x Ent Draught, Bill the Pony, and Boots from Erebor, ensuring Frodo starts with a big health buffer.\n\n \n\nBut anyway, being broken in solo play is enough to want to rework it a little I would think."}]}