{"url":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/","title":"Noldor Archetype ... Initial thoughts mainly on solo one hand (but general discussion too)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046102","commentId":2046102,"userName":"Nickpes","timestamp":1455178337,"content":"Since when I first entered the world of Tolkien, some 20 years back, the faction I most loved where the Noldor.\n\nSillmarillion was always my favourite book and their story, their fate and doom, the Curse of Feanor, Fingolfins duel with Morgoth, Luthien, Gondolin, Glorfindels clash with Balrog ... anything that had to do with them fascinated me.\n\n \n\nWhen I started playing this game I always wanted to be able to make Noldor deck, pure Noldor deck, with Noldor heroes and Noldor allies only. It was not viable till now. Grey Havens has opened a new door and since yesterday I try to exploit it. I have not offcourse the cards thus cannot test anything, I just try to think ...\n\n \n\nWhile doing this I came upon the following conclusions, especially when playing as a solo one handed like I do. \n\n \n\nFirst thing I noticed is that there is a need for a Tactics and maybe a Leadership Noldor hero. There are only two, one each sphaire, the brothers, who work well together BUT must be together, or else they lose much of their power. From whatever spoilers we have there does not seem we are going to get any soon. \n\nBoth sphaires are important, especially tactics since they give Noldor allies, weapons etc ... and while you can have a Leadership hero sideways -Cirdan with his ring- and both Elrond and Galadriel can have a second sphaire, there is nothing like that for tactics. When playing two handed this can be arranged, but one hand ...\n\n \n\nSo the decks are mostly Spirit and Lore. \n\n \n\nHere comes the second part of my thoughts. With the cards that exist, these two sphaires combined can quest and defend very well.\n\nThere are heroes and allies that can do that. Imagine Gildor with Burning brand and cloak of Lorien questing for 3, then Cirdan with his ring ready him, +1 def, so he defends with 5, no shadows and if Arwen is there this can become a 6 ... One ally doing two things in the same round better than lots of heroes. Some might say that Gildor is expensive, but the new \"To the sea\" attachment can handle that. There are other examples too.  \n\n \n\nBut when it comes to attacking there are only two cards that might help. \"Lords of the Eldar\" and \"Fair and Perillous\". Killing enemies might prove a big problem then\n\n \n\nWith the discard mechanism that helps the Noldor to play -\"Lords of the Eldar\" must be on your discard pile, \"To the sea\" attachment discards cards and there are many examples- the problem that your deck will run out quickly and maybe with some of your needed cards there is a possibility, and you will need it to run out cause you have to discard cards to make it a strong deck. You could always not include everything, yet it seems that 50 card deck might not be able to handle the challenge that good. Will of the West will be certainly needed yet again when there are so many cards needed, you reach more that 50 easily.   \n\n \n\nStill I have not bring anything to the table, but while interesting, it seems very challenging and difficult to make it work ...\n\n \n\nHas any one tried to think of decks and possibilities that I might be missing?\n\nEdited February 11, 2016 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046151","commentId":2046151,"userName":"Fingolfin Fate","timestamp":1455183378,"content":"The last few days I have been playing Erestor, Arwen, Círdan heroes. To the Sea, to the Sea! makes the deck, really. No need for Love of Tales any more. Put three copies of Gildor and Galdor each, and if you mulligan for the To the Sea, you are almost guaranteed to have a really strong ally out first round. Glorfindel ally is also superb. And then Narya, of course, just have Light of Valinor attached to Círdan, and then ready the strong allies. Gildor or Warden of the Havens (Narya pays for him) make for great defenders. The attack is also not bad, even the cheaper Noldor have 1 attack strength. Lords of the Eldar win it, of course, it is almost always useful to save money for them.\n\n \n\nA good trick with Lindon Navigator, Sailor of Lune and Warden of the Havens. You quest with the first two, making sure you've got an event on top (Elrond's Counsel, Elwing's Flight or Elven-light are easy candidates), then when the questing is over, discard an attachment to keep the Navigator in play and boost the Warden.\n\n \n\nI do not even use Fair and Perilous here (the timing was a problem), I keep it for hero Glorfindel in a different deck.\n\n \n\nElwing's Flight is another favourite, a superb card. I have sometimes even played the first copy, but with one in the discard pile, it is already a must. Gildor and Glorfindel are best targets (beside Círdan before he has the Light, if he has the Ring).\n\n \n\nThe resources may still be a problem sometimes but Arwen and the song are great.\n\n \n\nA really fun deck to play, for me.\n\nEdited February 11, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046179","commentId":2046179,"userName":"Fingolfin Fate","timestamp":1455185385,"content":"ps: I thought more about the need for Tactics. As I said many times, I mostly play two-player, but there certainly without Tactics it is possible to beat very hard quests with the deck above as one of the pair. I have tried some of them solo, too. Do you have any particular in mind, so I could try that? I think Narya is immense help to both attack and defense.\n\npps: Noldor has always been my favourite trait in the game, as I too am a big fan of the Silmarillion, and the First Age, though I read other passages more often. But even in the book I of the LotR, my most-read literature, the two of the four stand-out characters are Noldor: Gildor and Glorfindel (the other two being Gandalf and Bombadil, of course), and in the deck above, both play a very substantial part, just like they do in my reading experience."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046190","commentId":2046190,"userName":"Nickpes","timestamp":1455185806,"content":"Thanks for posting.\n\n \n\nNever thought of Arwen to be honest, I was thinking of her as an ally so that to add +1 def. Maybe I should change that. With Cloak of Lorien and Naryas ability he will be able to defend for 5, with a Burning Brand it would be more than enough. Do you use any kind of healing?\n\n \n\nI was thinking of a deck Cirdan, Galdor (to have the mulligan trick) and Galadriel or Erestor. My problem is that I have never used Erestor till now and with his cards discarded at the end of round it seems tricky for me.\n\nOn the other hand Galadriel adds in questing and maybe threat reduction as if you have her with UC you do not raise threat in reality. Also the mirror helps getting cards ... But she cannot attack or defend.\n\n \n\nGlorfindel ally is not on Grey Havens right?\n\n \n\nPS: For me too my best parts are the ones with Gildor and Glorfindel  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited February 11, 2016 by Nickpes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046196","commentId":2046196,"userName":"Edheliad","timestamp":1455186165,"content":"I've been using Will of the West in Noldor/Erestor decks to ensure I don't run out of cards, but with the new abundance of cards that become more powerful with every copy in the discard pile I'm wondering if just making the whole deck bigger might be a better idea.\n\nUnlike the Elves in Tolkien, Noldor decks can become far more powerful over time when the discard pile is large enough. Shuffling it back into the deck can be a major drawback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046258","commentId":2046258,"userName":"Fingolfin Fate","timestamp":1455190940,"content":"Oh, sorry about Glorfindel, I am always terrible with spoilers. I see a card from a future expansions and I play it right away. He has been spoiled in the Storm-caller preview (with the full text).\n\n \n\nWill of the West is a bit tricky to use here. I have usually ended up discarding it, but for longer quests solo, it may be necessary. 2-player games are really no problem -- even on the longest ones, like A Journey in the Dark, I just about run through the whole deck, and it is fine.\n\n \n\nYes, Arwen ally is great, but the hero is a must with Erestor hero, I feel. He is fun to use, I recommend. But tricky, most definitely. To the Sea made the deck really fast, as you can get a really strong ally for 1 resource round 1, no problem. You just always need to mulligan for the song. And then, even if you don't get it on the mulligan, you still have 5 extra cards to get it. I have not done the math, but I think it is close to 67% (I know it is something like 58% with just the mulligan).\n\n \n\nI have considered Cloak of Lórien but have not tried it yet. It may be good, because I usually have green resources to spare. Not sure A Burning Brand is worth it, in Erestor deck, I mean. The whole timing issue is really messing some combos up.\n\n \n\nI have used Elrond ally as a healer. He goes well with Narya to get 2 very solid actions out of him. However, he sees play in about every third game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2046261","commentId":2046261,"userName":"Fingolfin Fate","timestamp":1455191012,"content":"> I've been using Will of the West in Noldor/Erestor decks to ensure I don't run out of cards, but with the new abundance of cards that become more powerful with every copy in the discard pile I'm wondering if just making the whole deck bigger might be a better idea. Unlike the Elves in Tolkien, Noldor decks can become far more powerful over time when the discard pile is large enough. Shuffling it back into the deck can be a major drawback.\n\nI have considered that. Certainly, as I said above, the Will of the West can be counter-productive. But making the deck bigger lowers your chances on the opening hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047053","commentId":2047053,"userName":"Gizlivadi","timestamp":1455215800,"content":"This is the exact thread I needed to see what others have thought of the archetype and how to run it besr. Cirdan Erestor and Arwen are also the heroes I want to run in solo. Still haven't read every post but thanks for starting the discussion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047350","commentId":2047350,"userName":"Seastan","timestamp":1455224412,"content":"I think my Noldor deck might make friends with Theodred...\n\n \n\nFor a Noldor deck, card draw is king. Theodred + Steward gets you an extra three resources a turn, which thanks to Elven Light means an extra 3 discard effects and an extra three card draw every turn. And you don't have to discard them all at the end of the turn. Theodred just leaves Erestor in the dust. \n\n \n\nFor a thematic deck, I think Elrohir is a better choice than Erestor for this reason, even without Elrohir in play. I just with there was another Noldor leadership option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047450","commentId":2047450,"userName":"Narsil0420","timestamp":1455227654,"content":"Well, Matthew Newman's Elven Siblings [https://www.fantasyflightgames.com/en/news/2015/12/17/the-fate-of-the-north/] deck works really well solo. You could pair it with a Cirdan Erestor deck for two players. I think ally Glorfindel will go a long way to making a Spirit/Lore Noldor deck able to handle combat. But Fair and Perilous and Narya really help a lot"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047468","commentId":2047468,"userName":"Slothgodfather","timestamp":1455228125,"content":"Elf-Friend!  Every leadership hero is Noldor if you want it bad enough!    "},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047469","commentId":2047469,"userName":"Fingolfin Fate","timestamp":1455228150,"content":"> I think my Noldor deck might make friends with Theodred...\n> \n>  \n> \n> For a Noldor deck, card draw is king. Theodred + Steward gets you an extra three resources a turn, which thanks to Elven Light means an extra 3 discard effects and an extra three card draw every turn. And you don't have to discard them all at the end of the turn. Theodred just leaves Erestor in the dust. \n> \n>  \n> \n> For a thematic deck, I think Elrohir is a better choice than Erestor for this reason, even without Elrohir in play. I just with there was another Noldor leadership option.\n\nAren't you a bit bored playing a very similar deck every time?\n\nI really like Théodred, unlike many I feel, but I wouldn't want him in a Noldor deck.\n\nI think we might get one Leadership Noldor in the next cycle though. And Círdan becomes Leadership with Narya.\n\nEdited February 11, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2047668","commentId":2047668,"userName":"chrsjxn","timestamp":1455237502,"content":"> I think my Noldor deck might make friends with Theodred...\n> \n>  \n> \n> For a Noldor deck, card draw is king. Theodred + Steward gets you an extra three resources a turn, which thanks to Elven Light means an extra 3 discard effects and an extra three card draw every turn. And you don't have to discard them all at the end of the turn. Theodred just leaves Erestor in the dust. \n> \n>  \n> \n> For a thematic deck, I think Elrohir is a better choice than Erestor for this reason, even without Elrohir in play. I just with there was another Noldor leadership option.\n\n \n\nShhh. Seastan, don't let everyone in on the cult of Theodred.\n\n \n\nBasically this, though. If you have a way to dump cards, and a way to generate resources, Elven Light gets you comparable draw to Erestor without the drawbacks. You could even splash Beravor instead of him for early draw if you need it, since Noldor cards aren't as trait focused as others.\n\n \n\nAnother thematic option to fuel your draw engines:\n\n \n\nCirdan and ally Galdor of the Havens. You draw 2, discard 1 (of those two), draw 1 every resource phase.\n\n \n\nAnd if you want thematic combat, Elrohir and Eladan are pretty solid fighters, and Elrond's family is pretty closely tied to at least one Dunedain. (Though I'll admit that my Elrohir decks all use Steward of Gondor and Gondorian Shield to beef up his defenses.)\n\n \n\nHard to fit all in one deck and still be solid for most quests, if you're a true solo player, but all of the pieces for thematic Noldor awesomeness are there, imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2048076","commentId":2048076,"userName":"Fingolfin Fate","timestamp":1455264130,"content":"Galdor hero is also fun. But there are three questions immediately rising (for me) with his inclusion. I feel like two Lore heroes is two much, so it is either him or Erestor. And Galdor ally is really good for the archetype. Finally, the second ability might be a bit hard to trigger without Erestor hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2048097","commentId":2048097,"userName":"Bellator Sardel","timestamp":1455265218,"content":"Nah.  That second ability is pretty easy to trigger since a single copy of Protector of Lorien can get 21 cards out of your hand in one round since it's 3 times per phase.  You just have to not want the cards in your hand more than you want to get a different set of six cards.\n\n \n\nThe Noldor theme is pretty interesting, I think.  It certainly has it's own trickiness to get used to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2048125","commentId":2048125,"userName":"Edheliad","timestamp":1455267930,"content":"> Basically this, though. If you have a way to dump cards, and a way to generate resources, Elven Light gets you comparable draw to Erestor without the drawbacks.\n\n \n\nWhy not use both?\n\n \n\nMy current second hand deck is Arwen/Erestor/Elladan/Master of the Forge and is crammed full of cheap attachments (for itself and the main deck it accompanies). Elven Light, Protector of Lorien, Elven Spear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2048281","commentId":2048281,"userName":"Narsil0420","timestamp":1455279231,"content":"I feel like the new Galdor is just a good all around hero, not necessarily for a Noldor deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2048782","commentId":2048782,"userName":"Calyx","timestamp":1455294438,"content":"I think the best lore hero to fit in with Noldor might actually be beravor. Excellent card draw, solid all-around stats, and in an emergency can be used with Tale of Tinuviel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2049061","commentId":2049061,"userName":"Davachido","timestamp":1455301258,"content":"With the talk of the Elf brothers, I'm kind of holding out for an ally Eladan and Elrohir with some sort of ability similar to the dwarf brothers but instead retrieving the elves from the discard pile. Though I guess that might be quite powerful unless only one of them each were allowed per deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2049559","commentId":2049559,"userName":"Rajam","timestamp":1455317958,"content":"> I think the best lore hero to fit in with Noldor might actually be beravor. Excellent card draw, solid all-around stats, and in an emergency can be used with Tale of Tinuviel.\n\nIsn't the problem with Noldors the Leadership/Tactics spheres though? Amarthiúl is probably the best option there, and he is a Dunedain so he can work with Tale of Tinuviel too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2049568","commentId":2049568,"userName":"John Constantine","timestamp":1455318195,"content":"I just felt weird when you refered to Amarthiul as a \"he\", but then I remembered he is actually a \"he\" :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2049590","commentId":2049590,"userName":"Fingolfin Fate","timestamp":1455319453,"content":"Ok, so I got quite a few games today replacing Erestor for Galdor (heroes). It is obviously a more traditional game. I would say safer. Still fun, though. The respective allies also got swapped. I kept Erestor and Warden of the Havens as the only Leadership cards. I could only play them once I got Narya (didn't bother with songs or Harvest) but the dead cards are never a big problem in such a Noldor deck. And you really want Narya. Oh, I like the card: such fun readying Gildor and Glorfindel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2049643","commentId":2049643,"userName":"Rajam","timestamp":1455320698,"content":"Actually I think is mostly Tactics. With Cirdan and his ring, plus A Good Harvest, there shouldnt be much issues to play Steward of Gondor, and then idk if more Leadership cards are worth a spot in a Noldor deck. If you want Tactics for the weapons, I think Tactigorn is a good option: Makes it easier to kill enemies, and has the Dunedain trait if you really want to run Tale of Tinuviel (Note that Arwen hero can share resources with Aragorn, although with Cirdan around you'd lose Lore)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202199-noldor-archetype-initial-thoughts-mainly-on-solo-one-hand-but-general-discussion-too/?do=findComment&comment=2050040","commentId":2050040,"userName":"Fingolfin Fate","timestamp":1455348380,"content":"I think Lore beats Tactics every time in a Noldor deck, unless you are only going for a support."}]}