{"url":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/","title":"Iron Shackles &amp; drawing additional cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2048072","commentId":2048072,"userName":"JanB","timestamp":1455263844,"content":"Hi folks,\n\n \n\ni had in mind that there was a thread about Bilbo and Iron Shackles where you do not draw your normal 1 card instead you discard Iron Shakles and then draw your additional card from Bilbo. \n\nBut... i do not find this thread, so i opened a new one.\n\n \n\nFirst  i'm confused about the text of these cards:\n\n \n\nBilbo: The first player draws 1 additional card in the resource phase.\n\n \n\nCirdan the Shipwright: Draw 1 additional card at the beginning of the resource phase.\n\n \n\nErestor: Draw 3 additional cards at the beginning of the resource phase.\n\n \n\nOri: If you control at least 5 Dwarf characters, draw 1 additional card at the beginning of the resource phase.\n\n \n\nCirdan, Erestor and Ori let me draw cards before i draw my normal one, while Bilbo let me draw after i draw my normal one. Right?\n\nIf i'm right, Cirdan's Forced-Effect does not make sense.\n\n \n\nSo my intention is, that \"at the beginning of the resource phase\" is equal to \"in the resource phase\".\n\nEdited February 12, 2016 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2048220","commentId":2048220,"userName":"NathanH","timestamp":1455273659,"content":"I have always assumed that all of these effects all do essentially the same thing: replace the \"1\" in the \"draw 1 card\" part of the resource step with a different number."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2048238","commentId":2048238,"userName":"JanB","timestamp":1455275118,"content":"I think you are right with your assuming, but the phrase \"at the beginning of X phase..\" says clearly that it happens before something else in this phase .. so confusingly you draw first \"additional cards\" and than your regular one ... seems weird to me. All these phrases has to be worded like Bilbo's passive ability, right?\n\n \n\nIf the phrase \"at the beginning of X phase\" does not mean that you can use \"Mariner's Compass\" after you have travelled to a new location [it let you switch a location in the staging area with one from the encounterdeck at the beginning of the travelphase]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2048253","commentId":2048253,"userName":"NathanH","timestamp":1455276096,"content":"It's a good point. The rulebook is even clear that adding resources happens before drawing the card, so \"at the beginning of the resource phase\" is not a good way to describe this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2048287","commentId":2048287,"userName":"JanB","timestamp":1455279636,"content":"now you see my confusion :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2058710","commentId":2058710,"userName":"JanB","timestamp":1455784940,"content":">  \n> \n> Hi Jan,\n> \n> If you look at the timing chart on page 30 of the core rules, players gain resources and draw cards at the beginning of the resource phase. Cirdan’s ability causes you to draw 1 additional card at that time.\n> Cheers,\n> Caleb\n\n \n\nSo the initial intention that you simply draw more cards during the resource phase is correct, but i think the description \"at the beginning ...\" is bad.\n\nEdited February 18, 2016 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2059161","commentId":2059161,"userName":"GrandSpleen","timestamp":1455808502,"content":"Yeah, elsewhere in the rules \"beginning\" is used intentionally for something that is supposed to happen right as you start a phase, before you do anything else.  Sailing tests in the new Grey Haven box happen at the \"beginning\" of the quest phase.  You also select an active quest or side quest at the \"beginning\" of the quest phase.  If he just directed you to look at the timing chart,  I wonder if he understood the question?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2059369","commentId":2059369,"userName":"PocketWraith","timestamp":1455814133,"content":"And collecting resources and drawing cards are done right as you start the Resource phase, before you do anything else. I don't see the problem here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2059389","commentId":2059389,"userName":"cmabr002","timestamp":1455814643,"content":"> And collecting resources and drawing cards are done right as you start the Resource phase, before you do anything else. I don't see the problem here.\n\n \n\nTypically if an effect happened \"at the beginning\" of a phase, it would happen before any of that phase's required actions such as collecting resources and drawing cards.  That's what makes the wording on Cirdan awkward.  Regardless, we know how we are supposed to resolve it 100% because of the clarification received.\n\n \n\nEdit: Ori, Cirdan, and Erestor are all worded the same way.  Bilbo is the only one that I think is properly worded for the intended effect.\n\nEdited February 18, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2059562","commentId":2059562,"userName":"PocketWraith","timestamp":1455819146,"content":"> > And collecting resources and drawing cards are done right as you start the Resource phase, before you do anything else. I don't see the problem here.\n> \n> Typically if an effect happened \"at the beginning\" of a phase, it would happen before any of that phase's required actions such as collecting resources and drawing cards.\n\nThat's your own interpretation you're imposing on the game rather than how it actually works. In fact, most of the things which happen at the beginning of a phase I can think of are the phase's required actions, like collecting resources, drawing cards, dealing shadow cards, assigning archery damage, raising threat, readying cards and passing the first player token.\n\nThe examples GrandSpleen gave were for the quest phase, which don't really tell us anything as nothing happens at the beginning of the quest phase, there's just an action window before committing to the quest.\n\nThe Mariner's Compass triggers at the beginning of the Travel phase, but that I think is different as it's a Response and thus interrupts the usual flow of play in any case.\n\nAnd finally, in Blood of Gondor: \"At the beginning of the combat phase, each player must either turn each of his hidden cards faceup or take 1 hidden card.\" And this one we know for a fact does not supersede other \"beginning of the phase\" stuff, because Caleb made a ruling [https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/] that you could deal shadow cards first, then flip hidden cards so the flipped enemies wouldn't get shadows.\n\n \n\nIf you can think of any examples which would support your view of how such effects are typically resolved, please say so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2059580","commentId":2059580,"userName":"cmabr002","timestamp":1455819722,"content":">  \n> \n> > > And collecting resources and drawing cards are done right as you start the Resource phase, before you do anything else. I don't see the problem here.\n> > \n> > Typically if an effect happened \"at the beginning\" of a phase, it would happen before any of that phase's required actions such as collecting resources and drawing cards.\n> \n> That's your own interpretation you're imposing on the game rather than how it actually works. In fact, most of the things which happen at the beginning of a phase I can think of are the phase's required actions, like collecting resources, drawing cards, dealing shadow cards, assigning archery damage, raising threat, readying cards and passing the first player token.\n> \n> The examples GrandSpleen gave were for the quest phase, which don't really tell us anything as nothing happens at the beginning of the quest phase, there's just an action window before committing to the quest.\n> \n> The Mariner's Compass triggers at the beginning of the Travel phase, but that I think is different as it's a Response and thus interrupts the usual flow of play in any case.\n> \n> And finally, in Blood of Gondor: \"At the beginning of the combat phase, each player must either turn each of his hidden cards faceup or take 1 hidden card.\" And this one we know for a fact does not supersede other \"beginning of the phase\" stuff, because Caleb made a ruling [https://community.fantasyflightgames.com/topic/96446-rule-questions-regarding-the-blood-of-gondor-quest/] that you could deal shadow cards first, then flip hidden cards so the flipped enemies wouldn't get shadows.\n> \n>  \n> \n> If you can think of any examples which would support your view of how such effects are typically resolved, please say so.\n> \n>  \n\n \n\nThe Blood of Gondor example is pretty telling, isn't it? \n\n \n\nThe rules in the rulebook state this as well:  \"At the beginning of the combat phase, the players deal 1 shadow card to each engaged enemy.\"\n\n \n\nIn the example of playing Blood of Gondor and entering the combat phase, the players can choose to deal shadow cards or resolve the passive effect from Blood of Gondor first because each effect includes the text \"at the beginning of\".\n\n \n\nWhat you will notice, is \"At the beginning of\" is noticeably absent from the rule book when talking about gaining resources and drawing cards during the resource phase.  If the intent is that these happen \"At the beginning of\" the resource phase, then it needs to be clearly laid out in the rule book and at which point the players could choose whether they gain resources or draw their card first.  Unfortunately, they can't do that because the rule book specifically states that collecting the resource comes BEFORE drawing the card.  This means that drawing the card definitely does not happen \"At the beginning\" of that phase.  If anything, collecting resources does.\n\n \n\nEdit: \"At the beginning of\" is absent from all of the effects you mentioned in the Core Set rulebook excluding dealing shadow cards based on a quick glance (perhaps some of them I overlooked).  Dealing shadow cards is explicitly mentioned as something that happens \"At the beginning of\" the phase.  Also, I wouldn't be surprised if the developers decided that each of these effects does happen \"At the beginning\" of their respective phases, but without the rulebook stating \"At the begining of\" before them, I see no reason to interpret them as such.\n\nEdited February 18, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2060051","commentId":2060051,"userName":"GrandSpleen","timestamp":1455832510,"content":"> The examples GrandSpleen gave were for the quest phase, which don't really tell us anything as nothing happens at the beginning of the quest phase, there's just an action window before committing to the quest.\n> \n>  \n\n \n\nThat's why I think they are good examples...\n\n \n\nSounds like you're interpreting \"the beginning\" of the phase to mean \"the red action that comes first on the timing chart.\" And you are considering green blocks NOT to occur \"at the beginning of the phase\" (hence, you wrote \"nothing happens at the beginning of the quest phase).  So then the wording \"draw an additional card at the beginning of the resource phrase\" is simply describing that red timing block.  In my opinion, that is exactly what the designers intend when they wrote Bilbo, Cirdan, whatever.  All supposed to be happening within that time window that you would typically be drawing a card whether they use the word \"beginning\" or not.  However, I think they also use the word \"beginning\" in a different way elsewhere.  \n\n \n\nThe Blood of Gondor example is a great one.  In that case \"beginning\" does actually supercede the dealing of shadow cards, if you want it to.  Both of those effects (flipping hidden cards or dealing shadow cards) are described as happening \"at the beginning\" of the phase.  Since they happen at the same time, the first player may choose the order in which to resolve them (that was Caleb's ruling).  This is an example of the word \"beginning\" being used to mean \"before doing anything else in the phase that is written on the timing chart.\"  \n\n \n\nIf you apply that meaning of the word to Cirdan, you will draw 1 \"additional\" card, be forced to discard it, then do your regular card draw and resource.  Obviously this is not intended. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2060095","commentId":2060095,"userName":"cmabr002","timestamp":1455833594,"content":">  \n> \n> > The examples GrandSpleen gave were for the quest phase, which don't really tell us anything as nothing happens at the beginning of the quest phase, there's just an action window before committing to the quest.\n> > \n> >  \n> \n> If you apply that meaning of the word to Cirdan, you will draw 1 \"additional\" card, be forced to discard it, then do your regular card draw and resource.  Obviously this is not intended. \n\n \n\nBut hilarious :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited February 18, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/?do=findComment&comment=2060678","commentId":2060678,"userName":"NathanH","timestamp":1455866430,"content":"The game is just a bit awkward with \"beginning\" and \"end\" of phases and turns. Intuitively we think of these as moments, but for this game they have to be thought of as sub-phases in which many things can happen sequentially."}]}