{"url":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/","title":"Foundations of Stone Stage 4 Quest Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/?do=findComment&comment=2059940","commentId":2059940,"userName":"cmabr002","timestamp":1455829273,"content":"This topic is a result of this thread here [https://community.fantasyflightgames.com/topic/202315-iron-shackles-drawing-additional-cards/].  I felt it was different enough to warrant its own thread.  Let me say I agree with JanB when he says he thinks the description of \"at the beginning\" in Caleb's ruling below is bad...if we assume that all framework effects listed in the back of the rule book happen at the beginning of their respective phases then we get the problem I posted below which I believe is an unintended consequence of this ruling.\n\n \n\nQuote from JanB/Caleb's ruling from other thread:\n\n \n\n>  \n> \n> >  \n> > \n> > Hi Jan,\n> > \n> > If you look at the timing chart on page 30 of the core rules, players gain resources and draw cards at the beginning of the resource phase. Cirdan’s ability causes you to draw 1 additional card at that time.\n> > Cheers,\n> > Caleb\n> \n>  \n> \n> So the initial intention that you simply draw more cards during the resource phase is correct, but i think the description \"at the beginning ...\" is bad.\n> \n>  \n\n \n\nJoining Another Player (Foundations of Stone Rules)\n\n \n> On stage 4B players are instructed to “join another player” after completing their current quest card. Joining another player happens at the beginning of the travel phase. The joining player(s) must add any encounter cards in his own staging area to the staging area of the player(s) he is joining with, keeping any enemies engaged with him and discarding any active location in the staging area being left. If multiple players complete their current quest card during the same phase, they join quests starting with the First Player and proceeding clockwise around the table. If there is no player to join, then players must continue to stage 5.\n\n \n\nI believe the primary reason that the rules here state that you \"[discard] any active location in the staging area being left\" is because of the location in the Foundations of Stone encounter deck Mithril Lode.\n \nMithril Lode\n \n> While Mithril Lode is the active location, it gains: 'Refresh Action: Exhaust a character you control to place X progress tokens on the current quest card, bypassing any active location. X is the exhausted character's Willpower. (Limit once per round.)'\n\n \nNow, when we put it all together...in a 4 player game you could have 3 players complete their stage 4 quest card during the same quest phase.  Then, the Forced effect on each stage 4 quest card initiates.  This Forced effect creates a passive effect that happens \"at the beginning of the Travel Phase\".  Due to Caleb's ruling we know that the passive effect where the players decide if/where to travel happens \"at the beginning of\" the Travel Phase due to the timing structure in the back of the Core Set rule book.  Naturally, the players choose the most beneficial option so each player who completed his/her stage 4 quest card chooses to travel to one location in his/her staging area.  Now, the joining players each discard an active location...for free.\n \nIn reality, I am fairly certain the players are definitely supposed to join together first, then as a group decide where to travel.\nEdited February 18, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/?do=findComment&comment=2060003","commentId":2060003,"userName":"Teamjimby","timestamp":1455830970,"content":"> if we assume that all framework effects listed in the back of the rule book happen at the beginning of their respective phases\n> \n>  \n\n \n\nThat seems like a very large assumption to make from one Caleb email answering a question about a specific phase.  The rulebook on page 15 says you travel \"During\" the phase.  The joining effect happens at the beginning of the phase, which would be before traveling (even though the travel decision is the first thing listed in the chart).\n\n \n\nIf your point is just that the use of the word \"beginning\" has been inconsistent, at least with respect to drawing cards, then I think we are all in agreement.  It seems like most of the time, beginning just means \"before players get to do anything\".\n\nEdited February 18, 2016 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/?do=findComment&comment=2060013","commentId":2060013,"userName":"cmabr002","timestamp":1455831250,"content":">  \n> \n> > if we assume that all framework effects listed in the back of the rule book happen at the beginning of their respective phases\n> > \n> >  \n> \n>  \n> \n> That seems like a very large assumption to make from one Caleb email answering a question about a specific phase.  The rulebook on page 15 says you travel \"During\" the phase.  The joining effect happens at the beginning of the phase, which would be before traveling (even though the travel decision is the first thing listed in the chart). \n> \n>  \n\n \n\nHis justification for why we resolve Cirdan the way we do was because of the back of the rule book timing structure.  It would follow that all timing structures should follow the same rules unless stated otherwise.  Maybe I'm just too hopeful for consistency, but really I think the justification for Caleb's ruling is whack.\n\n \n\nBesides, there are other potential issues, albeit, less game-breaking that occur with Huorn enemies in the Resource Phase.  I was pretty sure Huorn enemy effects triggered before you got to collect resources and draw your next card, but this ruling states the opposite.  Forced effects on Huorns come after the passive draw if drawing does indeed happen \"at the beginning of the resource phase\".  This means you have a chance to draw a card like Gondorian Discipline to save yourself from Deadly Huorn which I did not originally think you could do.\n\n \n\n> Caleb: If you look at the timing chart on page 30 of the core rules, players gain resources and draw cards at the beginning of the resource phase.\n\n \n\nThe Core Set rules also avoid using the words \"At the beginning of\" for the Resource Phase just like the Travel phase avoids it so it seems strange to me that Caleb is stating collecting resources and drawing cards happens at the beginning of the resource phase.\n\n \n\nCore Set Rules on Resource Phase:\n\n \n\n> Each player simultaneously adds 1 resource token to each of his heroes’ resource pools. A resource pool is a collection of resource tokens stored near a hero card. These tokens belong to that hero’s pool, and can be used to pay for cards that belong to that hero’s sphere  of influence. Each hero has 1 resource pool.\n> \n>  \n> \n> After collecting resources, each player draws 1 card from his player deck and adds it to his hand.\n\n \n\nEdit: Also, I agree with you in that I think that \"at the beginning of\" effects should always supersede the timing structure in the back of the rule book unless the rules for that particular timing structure also state \"at the beginning of\" [like with dealing shadow cards \"at the beginning of the combat phase\"].\n\n \n\nThis thread was only posted as a result of the other ruling, which seems to go against what the rules are.  Any effect that happens \"at the beginning of the resource phase\" should supersede the collecting resources and drawing of a card because the Core Set rules don't state that these two things happen \"at the beginning of the Resource Phase\".\n\nEdited February 18, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/?do=findComment&comment=2060081","commentId":2060081,"userName":"Teamjimby","timestamp":1455833146,"content":"The most consistent solution would be errata cards like Cirdan so that they are worded like Bilbo.  I'm not sure it's major enough to warrant official errata, but I could understand the argument.\n\n \n\nCaleb's response was an email, not an FAQ, so I wouldn't read it quite so literally.  He was describing drawing cards as happening \"at the beginning\" of a phase relative to other aspects of the phase, like player actions.  His email wasn't intended to redefine the entire framework of the turn.\n\n \n\nBasically, it's an imperfect answer to a minor discrepancy.  But we all know what his intent is (that you should draw extra cards when you would normally draw cards).  There are just differences of opinions regarding how much official clarity/consistency is required for these sorts of matters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203012-foundations-of-stone-stage-4-quest-cards/?do=findComment&comment=2060083","commentId":2060083,"userName":"cmabr002","timestamp":1455833196,"content":"Really, I just think it is poor wording on Cirdan, Erestor, and Ori\n\n \n\nJust saw your reply.  I agree.\n\nEdited February 18, 2016 by cmabr002"}]}