{"url":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/","title":"Random progression series","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2062757","commentId":2062757,"userName":"NathanH","timestamp":1455960463,"content":"I was thinking of trying a progression-style playthrough, but everyone has done this and written about it so it is not so interesting. I thought that a very silly, probably non-feasible, but unusual approach would be to do the progression randomly. Every quest I pick at random from the full selection, and then I get to use forever the cards in that pack (or in the deluxe expansion, if such a quest is chosen). To make life a bit more plausible, I will allow myself to choose the number of players to use each quest, and give myself as many core sets as I want.\n\n \n\nFirst up I randomly selected Flies and Spiders. This is a decent first choice. It gives me a full box of player cards, although most are not that useful at present because of lack of dwarfs. Still, Balin is a handy hero. More importantly, the quest doesn't require any monster-killing, so I can make up for the lack of attack strength in the core set by questing hard. My chosen deck was solo Eowyn/Beravor/Theodred, using 50 cards all from the Core Set. With a swift Forest Snare and a Gandalf killing Old Tom Noddy, I got through the first section with no active enemies. From there it was just a matter of freeing heroes, questing hard, and using Bilbo to defend everything I couldn't chump. With all the uses of the Magic Ring I ended up winning on 49 threat with loads of enemies engaged and ignored.\n\n \n\nThe next quest that has been selected for me is the Druadan Forest. The player cards for this set encourage mono-sphere, but I'm not sure that is the best idea. I quite like the Leadership event though, so I'll try one deck with Aragorn/Theodred/Balin (using Celebrian's Stone to add a few more cancels and Unexpected Courages) and put in Denethor into the other deck to provide a bit of defence and more Lore resources to play healing cards to counteract Archery. I am not convinced, but we'll see how it goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2063028","commentId":2063028,"userName":"Lecitadin","timestamp":1455983760,"content":"Lore mono sphere, with traps and/or rangers could be cool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2063221","commentId":2063221,"userName":"NathanH","timestamp":1455996264,"content":"Well, the mono-leadership deck turned out to be not so useful, it still didn't have enough attack power to deal with the enemies in this quest. Since I had plenty of healing in my other deck, it seemed like a good idea to try a Gloin/Gimli/Legolas combat and resource-generation deck. This performed much better, and I was able to win the quest relatively comfortably. I was surprised to notice that the boss is not immune to attachments, this was helpful.\n\n \n\nNext selected quest is Assault on Osgiliath. I don't have Tactics Boromir, but I'm still going to try a solo Harbour shenanigans deck, using Denethor to try to stop any other Osgiliath locations from appearing, and trying for a turn-2 win. Other heroes are Eowyn (for a turn-2 Unexpected Courage) and Aragorn (who can quest if I want to). A full 3 Henamarths are in my deck to provide some extra scrying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2063376","commentId":2063376,"userName":"alexbobspoons","timestamp":1456004524,"content":"I like your random idea it's very nice. Some quests seem to assume you have access to earlier cards so it will be really interesting to see you invent new strategies if the standard isnt available to you.\n\nLooking forward to reading."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2063918","commentId":2063918,"userName":"NathanH","timestamp":1456047763,"content":"Not much to say about Assault On Osgiliath except I played 3 times and won each time on turn 2...\n\n \n\nNext up was Into Fangorn, giving me Grima, Eomer, and a bunch of Doomed cards. I have never really used Grima so I went for a solo deck Grime/Eowyn/Theodred that concentrated on heavy questing, with Sneaky Gandalfs ensuring I didn't have to engage any of the dangerous Huorns. This is another adventure that cares only about swift questing, so this deck setup worked very well. I won once in four turns and once in three turns.\n\n \n\nAnd now the RNG has chosen Battle of Carn Dum. And so the adventure ends..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2112940","commentId":2112940,"userName":"NathanH","timestamp":1458419764,"content":"Well, I tried a few things and even tried Easy Mode but even then such a restricted card pool doesn't seem to be able to beat Card Dum. So I rolled a different quest and got the much more manageable Conflict at the Carrock.\n\n \n\nI used Eowyn, Theodred, Frodo to have a low-threat deck that could control the questing and provide some support. This was paired with a mono-tactics deck: Eomer, Legolas, Gimli. With things like Citadel Plate to get Gimli's attack up, Dwarven Axe, Black Arrow, Eomer's effect, I was confident of being able to slaughter the trolls. As the game progressed it looked like I'd be able to do a ridiculous turn where the combat deck would engage all four trolls, use Thicket of Spears, and kill at least three at once. Unfortunately Legolas proceeded to get Sacked and then Roasted, so Thicket of Spears was no longer an option. Fortunately Gandalf showed up just in time to reduce the combat deck's threat so it only had to take one Troll.\n\n \n\nI took the unusual step of choosing Louis as the first troll to kill. This raised the combat deck's threat so that the other 3 would attack next turn---at this point, I had enough defences, Eomer and Gimli had huge attacks and readying, and so the trolls did not last too long.\n\n \n\nThe next quest that has been chosen is Shadow of the Past. I am very happy to see the Black Riders box appear because it has some nice player cards and a collection of heroes that go together very nicely.\n\n \n\nCurrent card pool: Core Set, On The Doorstep, The Black Riders, Voice of Isengard, Conflict at the Carrock, The Druadan Forest, Assault on Osgiliath.\n\nEdited March 19, 2016 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2114116","commentId":2114116,"userName":"Calvadur","timestamp":1458500646,"content":"And I thought you abandonned your run after rolling Carn Dum^^ Glad you didn't^^\n\n \n\nSad to hear you weren't able to bring it down in any way. At least you were rewarded with some cool Moments at your take on carrock :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I assume Carn Dum is back in the random pool?\n\n \n\nI would like to see Seastan take on Carn Dum in his Minimum purchase series :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2114208","commentId":2114208,"userName":"sappidus","timestamp":1458505213,"content":"> I would like to see Seastan take on Carn Dum in his Minimum purchase series :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nMinimum purchase: card pool up to Carn Dum.\n\nAlso, you need an alt-art Legolas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2114273","commentId":2114273,"userName":"NathanH","timestamp":1458508229,"content":"I played a couple more scenarios today. I played Black Riders rather badly. My decks were a standard Hobbit deck paired with Eowyn/Dunhere/Balin with the intention of keeping threat low and killing the Nazgul with Dunhere. It started well, with key attachments appearing, but then the original Nazgul got a horse and so refused to stay in the staging area, and another one showed up, and a hide test was failed, and oh dear. Fortunately the horseless Nazgul got a shadow sending him back into the staging area so Dunhere could kill him (I think Dunhere took out 3 Nazgul over the course of the game) but not before Merry had been killed. This made life somewhat difficult but eventually I got through, although Balin got discarded after a failed Hide test later on. The encounter deck did its usual \"one location every round so you can never get to the Ferry\" trick. Eventually I managed to get there.\n\n \n\nThe next quest selected was Siege of Cair Andros, a hard quest but giving me a few useful cards. In particular some strong defenders, which I was lacking. I took on this quest with two mono-sphere decks, which was probably a mistake. One was Gimli, Legolas, Beregond; the other was Balin, Aragorn, Boromir. The main reasoning for these was a good mixture of Battle and Siege powers. I wasn't too worried about losing the Banks because I could just Trained for War through the second stage, which in the end is what I did on the winning game (I lost twice quickly before). Legolas and Balin both died after I fell 1 progress short on the last stage. The final position featured 7 engaged enemies and 2 in the staging area. I particularly enjoyed the moment when one of the Orc Rabble chained about 12 shadow cards together.\n\n \n\nNext up is the rather more relaxed Road to Rivendell---a fairly pointless pack for player cards at the moment, but does provide Rivendell Blade which I was really missing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2114380","commentId":2114380,"userName":"Calvadur","timestamp":1458512746,"content":">  \n> \n> > I would like to see Seastan take on Carn Dum in his Minimum purchase series :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n> Minimum purchase: card pool up to Carn Dum.\n> \n> Also, you need an alt-art Legolas.\n> \n>  \n\nI'm sorry, but I fear you are wrong. The Card pool up to Carn Dum would be playing Progression style.\n\n \n\nAs he explains in his Videos he uses just the Player cards from the sets nessecary to build the Encounter set. For Carn Dum that would be: Core + Lost Realm + Carn Dum. And I would really like to see how that goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2114468","commentId":2114468,"userName":"sappidus","timestamp":1458517447,"content":"It was a joke. :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2116390","commentId":2116390,"userName":"NathanH","timestamp":1458592809,"content":"I can't remember much about my Road to Rivendell playthrough except that I got two Sleeping Sentries during setup, which is weird, and makes the rest of the game a bit trivial once the first turn was survived.\n\n \n\nNext up is Flight from Moria, so now I have all of the standard deluxe expansions before Lost Realm, as well as two saga boxes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2116736","commentId":2116736,"userName":"NathanH","timestamp":1458602179,"content":"Here are some \"fun\" ways to lose this quest on the first turn!\n\n \n\n- 24 threat in the staging area, oh yes and a Sudden Pitfall too!\n\n \n\n- Blocked by Shadow kills both players!\n\n \n\n- Sudden Pitfall as a shadow card!\n\n \n\n- Blocked by Shadow kills both players!\n\n \n\nI don't really like this quest. One deck was Eowyn Beregond and Thalin, designed to deal with all the little critters. The other deck was Gloin, Sam, Frodo. Balin would have been a better dwarf but I've been using him a lot. It all worked very smoothly once I didn't die immediately and I decided not to pursue Blocked by Shadow under any circumstances. Quest takes ages though, and it tends to be easy sprinkled with sudden deaths.\n\n \n\nNext up is To Catch An Orc, which sadly doesn't provide any more player cards.\n\nEdited March 21, 2016 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2122235","commentId":2122235,"userName":"Calvadur","timestamp":1458825767,"content":"Ah Blocked by Shadow...\n\n \n\nThe first three times I played the quest I tried to go for it after revealing it (solo play) an died each god **** time.\n\nNever tried again...\n\n \n\nI'm glad things like sudden pitfall are really rare. This random punishment if you dared to defend with a hero (+an undefended attack ontop!) is nothing the game needs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2123468","commentId":2123468,"userName":"NathanH","timestamp":1458856792,"content":"For the next quest, I reverted to a Beravor/Theodred/Eowyn solo deck, constructed to quest well and get Northern Trackers into play to deal with locations, so I would quest successfully every time on the first stage. Mugash would be handled by Sneaky Gandalfs. I added some Ranger Spikes so that I didn't have to engage much, because the deck lacks combat power. As long as an enemy wasn't revealed in the first turn, this worked nicely.\n\n \n\nNext up is Return to Mirkwood, which happily gives me Dain to help out if I roll a really hard quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2124155","commentId":2124155,"userName":"NathanH","timestamp":1458894350,"content":"Bizarre game. I chose a pair of dwarf decks, but the composition is pretty irrelevant since I drew two treacheries in staging and two treacheries in the first quest phase, so I zoomed through the first stage and then mostly got locations, winning in 4 turns.\n\n \n\nNext one is Passage of the Marshes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2124283","commentId":2124283,"userName":"NathanH","timestamp":1458908084,"content":"Well, this quest really sends your threat racing up! I was using a three-hobbit deck and even with four uses of the same Gandalf ended up on 39 threat. I think if I hadn't misread how Ambush works I would have won rather more comfortably. I also forgot it was a Fellowship quests so didn't put any Frodo's Intuition in!\n\n \n\nThe rather tricky Morgul Vale is next on the list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2125846","commentId":2125846,"userName":"NathanH","timestamp":1458986191,"content":"I went with two mono-sphere decks, one Tactics so I had access to various direct damage effects to hit the Nazgul, Thalin to deal with the Bats, Legolas and Gimli for fighting. The other deck was Spirit, with Eowyn to handle questing, Frodo to take any attacks that had to come that side's way, and Dunhere to do a bit of damage into the staging area where possible. I even took an event to send an enemy back into the staging area for this.\n\n \n\nThings didn't exactly work to plan, I never drew any Dwarrowdelf axes or Gondorian Spearmen or Spears of the Mark, and a treachery in the first turn increased my threat so Murzag would engage one turn before I'd planned, and then the shadow card sent him back without being damaged. Fortunately not too many nasty enemies showed up, except for the penultimate round where a Spider and a Vanguard appeared, with Nazgul already in play. This lead to poor old Spirit deck losing everything but Dunhere and the Nazgul still had one health left. Fortunately I drew Quick Strike next turn and finished him of with Legolas.\n\n \n\nThe next quest is Into The Pit, so no new player cards, but not a particularly bad quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2127441","commentId":2127441,"userName":"NathanH","timestamp":1459103254,"content":"I decided to take advantage of the low hp of most enemies in this quest, using Thalin and Beregond, together with Gondorian Spearman, Spears of the Citadel, and Swift Strikes, with the hope to kill most things quickly. The third hero I chose for the first deck was Sam, just to add a little bit of questing power.\n\n \n\nOn the other side I kept the same heroes as last game: Eowyn for questing, Frodo for unexpected damage, and Dunhere to help out if the staging area got clogged up thanks to East Gate. As it turned out, this didn't happen and Dunhere didn't use his ability much, although he took out a couple of Goblin Scouts so that's not the worst result. Everything else went more or less as planned and I didn't really have any problems, although I did end up with six locations in the staging area at the end, but even that wasn't enough to stop my willpower winning through.\n\n \n\nThis quest hasn't really aged well; there aren't many enemies and none of them pack a punch. Fortunately the Nightmare deck improves things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2145136","commentId":2145136,"userName":"NathanH","timestamp":1459539914,"content":"The next quest I rolled was The Three Trials. I chose an Eowyn/Corefindel/Idraen deck to provide questing power and cancellation. Obviously Eowyn is an easy choice for such a deck; Glorfindel has 3 willpower and provides on-demand healing (I didn't need much, but I always like the option) as well as access to Elf-Stone (lots of locations to stick it on), and Idraen can quest and fight most turns in this quest. I paired it with a Bard/Legolas/Beregond deck designed to deal with the fact that big enemies appear on either side of the board.\n\n \n\nIn the end it was slightly lacking in Willpower but this didn't really matter because it completely crushes the Guardians in combat, allowing me plenty of time to plod through the quests that need progress. Elf-Stones were very handy, giving me Beorn and Rumil. Beregond performed excellently, especially in one turn where a combination of readying effects saw him defend 4 times without damage. Legolas and Bard slaughter anything on the other side of the board, especially once they get powered up with Daggers of Westernesse. I even completely forgot the use Legolas's 2 progress through the whole quest and it was still comfortable. Domination."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203162-random-progression-series/?do=findComment&comment=2229737","commentId":2229737,"userName":"NathanH","timestamp":1463925331,"content":"It has been some time since I updated this. Partly because I rolled two quests with no new cards in a row (Escape from Dol Guldur and then Lonely Mountain) and I didn't feel too enthusiastic about this.\n\n \n\nFor Escape from Dol Guldur I used a mono-spirit deck featuring Eowyn, Frodo, and Dwalin to provide questing, cancellation, and threat reduction. I used Thalin, Tactics Theoden and Beregond to deal direct damage, defend, and quest. Everything went pretty much according to plan, although Dwalin was fairly useless. Not sure who'd be better with this pool though. This quest is always entertaining, because Threat is a constant danger.\n\n \n\nI played around a bit with a dwarf deck for Lonely Mountain trying to win very quickly but couldn't. I wasn't having any fun with the quest, so I decided to skip it.\n\n \n\nNext up was The Ring Goes South, so I had to include Gandalf. Accompanying him were Eowyn and Pippin. In the first version of my deck there wasn't enough combat strength, nor any combat tricks, so I added some Feints and some Sarumans in the second attempt. I also used Self Preservation for the first time in a long time. This went very smoothly. A solo deck doesn't really give the encounter deck chance to get going, but on the other hand it makes the combat quite hard. I think I was helped a lot by getting Zigil Miner, Wizard's Pipe and 3 Hidden Caches in my starting hand, for a boost of 3 resources per turn for 3 turns. if I did it again I would probably use Tactics Merry instead of Pippin for more attack strength.\n\nEdited May 22, 2016 by NathanH"}]}