{"url":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/","title":"Help with Custom Card Set For Single Hero Decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2068092","commentId":2068092,"userName":"wizerdrea","timestamp":1456266154,"content":"I thought it would be fun to design cards for use with single hero decks that embodied the ideas of a hero standing alone against overwhelming odds knowing they are probably going to die but still doing what needs to be done and protecting others.  I put everything as spirit because I felt that that sphere encompassed these concepts.  The Attachments are meant to represent the resolve and will of these heroes.  The reason they are immune to encounter and shadow card effects is because this resolve cannot just betaken away.\n\n            The Bard the Bowman card is meant to represent Bard as he stands against Smaug attacking him again and again until he finally defeats him even as everyone else in the city flees and his city burns around him.  The Boromir card is meant to be him when he fights at the last moments of his life, desperately trying to save Merry and Pippin alone.  (Remember when readying Boromirs ability that a player can only declare one attack against each enemy every round.)  The Sam Gamgee card is meant to be him as he keeps trying even after he thinks Frodo has died.  And last but not Least the Gandalf card is meant to be Gandalf as he faces the Balrog alone.  I know the cards are powerful but that is because they are supposed to help make a single hero deck viable and fun.  Let me know what you think. Any advice you could offer or ideas of how to improve some cards or other cards would be incredibly appreciated.  These cards are going to be hard to balance but I think they would be really fun to use upon occasion, so I would really like all the help you are able and willing to give.  \n\n \n\n(Oh and sorry about the format of the cards.  I don't really know how to get artwork for them.)\n\n \n\nCard name: Bard the Bowman\n\nCard type: Hero\n\nSphere: Spirit\n\nThreat cost: 11\n\nWillpower: 2\n\nAttack: 3\n\nDefense: 2\n\nHit points: 4\n\nTraits: Esgaroth. Warrior.\n\nCard abilities: Ranged.  Response: After Bard the Bowman attacks alone and fails to destroy an enemy, immediately perform another attack against the target of the original attack with Bard the Bowman as the only attacker. (Use this ability only if Bard the Bowman is the only hero you control.)\n\n \n\nCard name: Boromir\n\nCard type: Hero\n\nSphere: Spirit\n\nThreat cost: 11\n\nWillpower: 1\n\nAttack: 3\n\nDefense: 2\n\nHit points: 5\n\nTraits: Gondor. Warrior. Noble.\n\nCard abilities: Response: After Boromir receives damage while defending or deals damage while attacking alone, ready Boromir.  (Use this ability only if Boromir is the only hero you control.)\n\n \n\nCard name: Sam Gamgee\n\nCard type: Hero\n\nSphere: Spirit\n\nThreat cost: 8\n\nWillpower: 3\n\nAttack: 1\n\nDefense: 1\n\nHit points: 3\n\nTraits: Hobbit\n\nCard abilities: If Sam Gamgee is the only hero you control ready him at the beginning of each phase.\n\n \n\nCard name: Gandalf\n\nCard type: Hero\n\nSphere: Spirit\n\nWillpower: 3\n\nAttack: 3\n\nDefense: 3\n\nHit points: 5\n\nTraits: Istari\n\nCard ability: Gandalf does not exhaust to defend.  Reduce the attack of the first enemy Gandalf defends against each round to 0.  Force:  When you control another hero discard Gandalf from play.\n\n \n\nCard name: Need to Survive\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Response: After attached hero readies heal one damage from attached hero.  Forced: when you control more than one hero discard Need to Survive from play.\n\n \n\nCard name: Endurance of the Last\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Attached hero gets +3 hit points.  Forced: when you control more than one hero discard Endurance of the Last from play.\n\n \n\n \n\nCard name: Strength of the Last\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Attached hero gets +2 attack.  Forced: when you control more than one hero discard Strength of the Last from play.\n\n \n\n \n\nCard name: Will of the Last\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Attached hero gets +3 willpower.  Forced: when you control more than one hero discard Will of the Last from play.\n\n \n\n \n\nCard name: Need to Last\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Action: Exhaust need to last, ready attached hero.  Forced: when you control more than one hero discard Need to Last from play.\n\n \n\nCard name: The Last Standing\n\nCard type: Attachment\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Limit one per Hero.  Immune to encounter and shadow card effects.  Response: After attached hero is damaged, cancel the damage and instead raise your threat by the amount of damage the attached hero would have received.  Forced: when you control more than one hero discard The Last Standing from play.\n\n \n\nCard name: Resolve\n\nCard type: Event\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Search your deck for one card with the resolve trait and add it to your hand.\n\n \n\nCard name: Hope of the Last\n\nCard type: Event\n\nSphere: Spirit\n\nCard cost: 0\n\nTraits: Resolve.\n\nCard Abilities: Action if you control only one hero reduce your threat by 5.\n\n \n\nCard name: Last Stand\n\nCard type: Event\n\nSphere: Spirit\n\nCard cost: 0\n\nTraits: Resolve\n\nCard abilities: Limit one per game.  Response: After your last hero is destroyed, put that hero back into play with all resolve attachments that were attached to it when it was destroyed attached to it.\n\nEdited February 23, 2016 by wizerdrea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2069850","commentId":2069850,"userName":"Calvadur","timestamp":1456348287,"content":"You did a good job at choosing thematic characters for a one-against-all-deck and I agree they could be fun to use once in a while, but I have quite some problems with your design.\n\n \n\n1. They are ALL spirit heroes/cards. Every sphere should have a solo hero, if you design custom cards for them (I see that spirit makes sense, as it takes a strong will to fight alone, but excluding 3/4 of the card-pool without the use of songs, seems very limiting in deckbuilding). You even have the heroes to fit the spheres, like Bard tactics, to show is great skill with bow and arrow o defeat smaug, leadership Boromir as the one, who gives his life for \"the weak\", lore or spirit for Sam and the other one for Gandalf (both would fit I think).\n\n \n\n2. In my opinion many cards aren't very good designed or outstanding, with most of them being massive power boosts, negating what makes less than 3 hero decks special: The lack of a powerhouse right from the start in exchange for a lower threat. Of course you can combat that with insanly strong cards, but it's not what I would want most of the time if I choose less than 3 heroes (again it can surly be fun once or twice).\n\n \n\n3. I'm unsure if you want to build a solo or multiplayer deck (or both). In solo I see the Problem, that ressourceful is a must include, as you are in secrecy range 100% of the time at the beginning of the game and the lack of ressources is one of the biggest Problems when you have few heroes.\n\nIn Multiplayer I would say it's actually much better to have a Player with 3 heroes put your cards in his deck to pump out as many of them as quickly as possible. In a 4 Player game 1 Player could put 3 copies of all your Cards in and include MASSIVE Card draw. A triple Spirit deck with galadriel could use her mirror (+possibly silver harp) to grap at least one of These Cards every round. The other 3 could use all the secrecy Cards (which are pretty insane if you get all their effects FOR SURE, what you do if you start with a max. of 11 threat and have a Card that Drops your threat by 5 for free).\n\nAs I write this I realised this isn't that easy to pull of as many secrecy Cards are not Spirit and all your heroes are, but that should be changed in my opinion as I said above.\n\n \n\n4. Making all attachments effectivly impossible to discard by the Encounter deck is bad design in my opinion, you should create allys to work in a 1 hero deck to compensate for the potential loss of attachments.\n\n \n\nNow that I mentioned all my Problems with the current design (only Spirit, simply OP-Cards at the Moment, ressource Problems, possibly easy to abuse in multiplayer), let's look a the Cards:\n\n \n\n1. Bard: Could be tactics. His ability is nice, as it isn't always very good, as it gets countered by armor. Just 2 armor reduce his damage by a lot, but in quests with low armor enemies he is king. Ofc dagger of westernis and your attack boost Card pretty much make this guy a mid/lategame killer as there isn't much, that survives a 9 attack double hit. Reading effects on him clear the board super quick. There are so many ways to make him a damage powerhouse, but most are tactics. And I really Thing this is what you should bard make: A super solo attacker.\n\n \n\n2. Boromir: Not much to say, very similar to his ally Version. Should be Leadership or tactics.\n\n \n\n3. Sam: Could be lore. The effect sounds better than it is. Most of the times you don't Need a ready hero in the refreshment, planning, ressource Phase; traval and Engagement Phase might have some uses (exhaust to travel, instant attack...) only quest and combat Need him ready and in 50% of this cases he should be already. Given fast hitch is already an insane readying effect for Hobbits, this might be ok, bu tthen Sam as Close to no effect. He also doesn't have much else then willpower to use. I actually woud say that Leadership Sam is a better hero than this Version, as he readys when an nemie engages with a higher threat (easy when starting with only 8).\n\nHe requires a complete redesign in my opinion.\n\n \n\n4. Gandalf: Has no threat cost (hurray 0! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]). Could be lore. OP as **** (sorry) in multiplayer. Get him sentinel, a burning brand and as much armor as possible (quite easy when 3 Players look for this stuff) and no Need to ever kill something (exaggerating there are still enemies you wanna take out). A always not exhausting Defender immune to shadow effects with esayly up to 7 defense (and remeber dunandain warning isn't restricted so you could get up to 15 defense just by stacking These) with sentinel, makes any other Defender unnessecary. Better have him not exhaust to quest.\n\n \n\n5. Need to survive: I like the Card, no reason for changes here.\n\n \n\n6. Endurance of the last: Similar to the campaign boon, nothing to Change here.\n\n \n\n7. strength of the last: Not restricted, so free +2 attack on top of everything else. Not unique so multiple copies per table possible.\n\n \n\n8. Will of the last: Same with willpower, but mass willpower is easier to achive anyway.\n\n \n\n9. Need to last: Fast hitch for everyone! Same as above, reading across the table. Especially good on bard.\n\n \n\n10. The last Stand: Anybody can be Frodo! Even though the effect is taken from an other Card trading, I really like trading your starting Advantage of the low threat for an easy defense solution.\n\n \n\n11.Resolve: When focussing on attachments that much I guess this Card is needed.\n\n \n\n12. Hope of the last: Auto-include.\n\n \n\n13. If you only have one hero I would say you are better of not letting him die and most of the time, if you die once, you will die again next turn most of the time. Wouldn't use it.\n\n \n\nSummary:\n\n1. Use all spheres available.\n\n2. Sam and Gandalf have to be remade. Sam I think is just worse than his Leadership form, Gandalf overpowered in multiplayer.\n\n3. Better make your attachments unique, otherwise you allow multiple copies of (too) strong Cards on the table.\n\n4. Make allies.\n\n \n\nI am sorry I have so much criticism for your design. Me not liking to go the power attachment route is personal and I would suggest you go this route, if you like it, but still: you should use some allies^^."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2071788","commentId":2071788,"userName":"wizerdrea","timestamp":1456440567,"content":"Okay thanks for all of your help.  I am not very good at making cards but I have fun trying so thank you far all of your advice.  I really appreciate it.  \n\n \n\nI think you are right about the spheres.  I will defiantly switch those.  I also really like your idea of making the attachments unique to prevent overuse in multiplayer games.  I also see what you mean about Gandalf and Sam.  I will remake them.  I will also work on altering the attachments they are a little too powerful and protecting them from shadow and event cards is too much.  \n\n \n\nThanks again for all of your advice.  I am personally a great appreciator of constructive criticism, so thank you.  \n\n \n\nDo you have any recommendations or ideas for some good thematic allies?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2075644","commentId":2075644,"userName":"Calvadur","timestamp":1456681511,"content":"I don't know how good you know Tolkien's universe, but unlike FFG you are free to use any character there is and there are many cool characters outside of lotr/Hobbit you could use.\n\n \n\nAnyway, for allies I would suggest to go the unique allies road. If I remember correctly you wanted to create a \"one against all\" feeling and swarms of allies don't really fit for this.\n\n \n\nChoosing characters for unique allies doesn't differ to much from choosing the ones for heroes. Let's take Sam for example:\n\n \n\nI think he fits the role of an ally in a one hero deck and could have a supportive effect, as he helps out Frodo a ton in the books.\n\n \n\nCost: 2\n\nWillpower: 2\n\nAttack: 0\n\nDefense: 0\n\nHit Points: 3\n\nText: Sam collects ressources during the ressource Phase. If you Play Sam from your Hand add one ressource to his pool. ACTION: Exhaust Sam to add all of Sam ressources to a hero you Control. Only trigger this Action if you control only 1 hero.\n\nSphere:Leadership\n\n \n\nSam's greatest strength is his willpower, which is his best stat in every incarnation we know, so not changing that. As he isn't a good fighter I didn't gave him any attack or defense. Even though he fought a few times in the book, it is more characterristic for him to support your quest and make sure you Progress. Also, I wanted him to cost 2 ressources so you can Play him turn 2 if you scip the first one, and having a 2 cost ally with 5 stat Points is already pretty much the max. you can give them (compare to Arwen). To Focus an his \"I will help you get the Job done\"-character I think it's Fitting, that Sam helps you solve the ressource Problems you face in a one hero line-up (and ONLY in a one hero line-up), but I think you might Play one copy of this design if you want willpower for your deck and some hitpoints for archery, treacheries etc.\n\nAnyway, Sam shouldn't be obvious to put in every deck for the extra ressources and not a Play for turn one (without the use of other Cards), so he costs 2, what Forces you to:\n\n \n\n1) wait a turn or more\n\n2) Combo him with a 0 cost ressource Generator or\n\n3) Dont Play him at all and stick to 1 ressource stuff\n\n \n\nDepending on quest and deck one or another Option might be better. To compensate for the Trouble to put him into Play he gets an extra ressource if you really Play him and don't \"cheat\" him in.\n\n \n\nThe biggest Problem is his sphere. I would say he could be neutral, but on the other Hand he fits Leadership (with all those ressource-generators) very well too and not giving every sphere a potential ressource solution. Making him leadership leads\n\n to another Problem: Steward of Gondor. For the cost of 2 it gives double the ressources and Combos very well into Sam himself, making this a turn 2 Powerplay granting you 5 ressources if you exhaust Sam next turn. But this is more of a Problem in solo Play, than multiplayer, as Steward can be used by everyone and Sam only by you. Adding to this having a 2 Card Combo in Hand on turn two is not very likely and I would be fine with it Happening once in a while.\n\n \n\nGreat \"Solo-allies\" should, in my opinion:\n1) Fit Theme-wise (but everyone feels differently about what is thematic and what not)\n\n2) Have a theoretical use outside of a 1 hero deck (but that shouldn't take priority if you have a great idea, which works only solo)\n\n3) Fit into the Overall Balance of the game, solo and multiplayer.\n\n \n\nI am sure if my idea for Sam isn't without flaws, but this would be the road I would go with \"solo allies\".\n\n \n\nIn any case finding out if something works or not is best tested by playing with the Cards you come up, but this takes a lot of time :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2080672","commentId":2080672,"userName":"wizerdrea","timestamp":1456936449,"content":"Thanks for the advice on allies.  I am thinking of some that would be fun to make.  In the mean time I have altered a couple of my previous cards an attempt to make them more balanced.  I am still working on some of the others but here is what \nI have so far.\n\n \n\nCard name: Strength of the Last (unique)\n\nCard type: Attachment\n\nSphere: Tactics\n\nCard cost: 1\n\nTraits: Resolve\n\nCard abilities: Attach to a hero.  Quest action: exhaust Strength of the Last, attached hero gets +2 attack until the end of the phase.  Response: after attached hero is declared as an attacker and is attacking alone exhaust Strength of the Last, attached her gets +2 attack for the duration of the attack.  Forced: when you control more than one hero discard Strength of the Last from play.\n\n \n\nNow the card can only be used once a turn; either to help in the quest phase or for a single attack.  This prevents players from using the card to for multiple attacks and forces more thought into how it is used.  \n\n \n\nThe other card I altered is\n\n \n\nCard name: Hope of the Last\n\nCard type: Event\n\nSphere: Spirit\n\nCard cost: 1\n\nTraits: Resolve.\n\nCard Abilities: Limit 3 copies of Hope of the Last in the victory display.  Action: if you control only one hero add Hope of the Last to the victory display to reduce your threat by 3.\n\n \n\nIt cost a resource now which can be a fairly big deal in a single hero deck and it can only be used three times per game.  I also lowered the amount of threat it can reduce.\n\n \n\nHow do these alterations look?  Are the cards more balanced now?\n\nEdited March 2, 2016 by wizerdrea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203496-help-with-custom-card-set-for-single-hero-decks/?do=findComment&comment=2081480","commentId":2081480,"userName":"Calvadur","timestamp":1456959515,"content":"I like your changes, defently brings the Cards more in line with what we currently have.\n\n \n\nStrength of the last seems very good to me, for not being restricted stll allows for a strong hit, but limiting it to one attack per rounds is good. And you even kept the synergy for battle questing (if desparetly needed)!\n\n \n\nHope of the last also looks more balanced. In comparison to elronds council it may Look weak, but council Needs 2 characters in Play (at least) one having to be noldor. Not too easy of a condition in a single hero deck! And adding another 0 cost Event to this would be way to much, I would say. Low starting threat is one of the greatest strength, but also being able to Keep it low to easy is something that should be avoided. I guess you would run council if you have a noldor hero or lots of noldor allies, but hope if you don't.\n\n \n\nLooking forward to more :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}