{"url":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/","title":"Questions regarding Attack (and Destroy) definition.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2069434","commentId":2069434,"userName":"xchan","timestamp":1456336333,"content":"Hello everyone! I have been troubles interpreting the word attack in the game. The first doubts arised when reading Legolas (Core set) skill. I asked the cardgamesdb community about it, but it seems we are missing on the official word to solve the problem, so I hope I can find the answer I need here.\n\n \n\nFrom my research of the card data base, the word \"Attack\" when used as a noun describes each of the individual combats that happens during the combat phase, initiated by either the enemies or allies. All combats start by declaring the attacker who is the character that will deal the damage (is the one attacking), but allies can participate in them as attackers or defenders. This can be substituted by combat.\n\n \n\nWhile the word \"Attack\" used as a verb refers to the action by the active character of the combat, the one initiating the combat (declared as the attacker) and dealing the damage. This could be substituted by strike.\n\n \n\nEx. 1 (Baleful Shade): \"When Baleful Shade attacks (strikes), the defending player discards the top card of his deck. If the discarded card is an ally, Baleful Shade gets +2 [Attack] for this attack (combat).\"\n\nEx. 2 (Bilbo's Magic Ring): \"After Bilbo Baggins exhausts to defend an attack (combat), exhaust Bilbo's Magic Ring and raise your threat by 3 to cancel all damage from this attack (combat).\"\n\nEx. 3: (Brutal Uruk): \"After Brutal Uruk attacks (strikes) and destroys a character, that character's controller turns all hidden cards in his play area faceup. Deal a shadow card to each enemy turned faceup by this effect and resolve their attacks (combats) as normal.\n\n \n\nI checked all the cards and this is true for every instance of said words; meaning when the word is a noun, it refers to a combat, no matter which side of the combat are the allies; but when it's a verb it refers to the action the character is doing during the combat phase (initiating an attack and hence being the one who will deal the damage).\n\n \n\nI don't know if you agree with me so far, but if that is the case (and no rule has proven it wrong so far), then Legolas text (and lots of other heroes and enemies similar wordings) could work during an enemy attack too.\n\n \n\nLegolas card says: \"After Legolas participates in an attack (a combat) that destroys an enemy, place 2 progress tokens on the current quest.\" The word attack is used here as a noun while the verb is participate. So \"attack\" could/should be substituted by the word combat, and hence it refers to each individual combats that happens in the combat phase. The verb in Legolas text is \"participate\" which means he has to be part of the attack/combat somehow, not necesarily the attacker.\n\n \n\nBy that interpretation, the questions I have to answer to trigger Legolas reaction are: \n\n- Is Legolas participating in the combat (attack)? Yes, he is the defender.\n\n- Is that combat (attack) the one that destroys the enemy? Yes, during that combat, the enemy was destroyed (by an event - basically I was using Swift Strike to destroy the attacking enemy after Legolas was declared as the defender). I explain this further below.\n\n \n\nSince both requirements were fullfilled, I thought the response could be triggered.\n\n \n\nHowever, the community answered me that in order to fullfill the requirements, Legolas had to be the attacker and the damage should be done by his strenght alone. This interpretation equates the noun attack to the verb (ignoring the real verb, which is participate), forcing Legolas to be exclusivelly the attacker.\n\n \n\nI need an official word regarding that as I can't make that jump in meaning by myself. There's no other cards that sustain that interpretation (there are cards using the noun attack that refer to defenders too, so a character doesn't need to be the attacker to be considered participating in an attack). Also, there's another wording already in the game that does exactly that (forcing the character to be the attacker), which is the \"After X attacks and destroys Y\" wording (which I do think it works like the community says it works, aka the character having to be the attacker and the one that destroys the enemy with his strenght).\n\n \n\nWhat would be the reason to have both wordings if they work exaclty the same? I don't think it's a case of weird wording due to a big card pool, as both wordings appear in the Core Set and are sustained through multiple packs since then. It's then not an isolated case, as there are plenty of cards with both wordings, which makes me think there's a reason behind it.\n\n \n\n \n\n \n\nOn another hand, there's the word \"destroy\", which in this case is heavily related to the \"attack\" one. When the destroy part refers clearly to a character (as in \" when X attacks and destroys Y\", where the character is the subject of the verb), the official FAQ states that the character X needs to be the one to destroy Y by dealing enough damage to it with attack strength.\n\n \n\nHowever, there are instance when the subject of the destroy is the attack itself and not the attacker (Legolas being one example, but multiple heroes and attachments have similar wording). If \"attack\" is equal of combat (as defined before), then this would mean that the opposing character needs to be destroyed during said combat, no matter how the final damage is dealt, as there's no explicit reference to the character attacking or his strenght. This means that an event could and should be enough to fullfill it.\n\n \n\nIf this is not true, cards with shadow effects like \"Shadow: If this attack destroys a character, .....\"  could never be fullfilled as the cards are not the ones attacking hence can't be the ones comparing their strenght. Someone else destroys the character for them (during said attack/combat).\n\n \n\nThanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2075052","commentId":2075052,"userName":"PsychoRocka","timestamp":1456627979,"content":"Look I really don't want to be rude or unhelpful with this matter but to me it is very clear why the cards do not work together the way you think that they do. Much of what you have said has nothing to do with the actual thing you are confusing as you simply do not get how swift strike and player attacks work and there is no issue with the rules regarding the definitions of destroy or participate in an attack.\n\n \n\nLook at the framework of the rules. There are very clearly defined rules for defending and attacking.\n\nWhen you play Swift Strike you are defending against enemy attacks and the damage you deal to the enemy is a direct damage effect that the card Swift Strike is dealing to an enemy. Legolas as the defender is not dealing this damage, the event card is dealing the damage. Even if it was Legolas dealing the damage (like for example Gondorian Spearman or spear of the citadel) while defending, he would still be doing the damage while you are defending enemy attacks not while you are making attacks against enemies so it would still not be damage dealt by \"attacking\".\n\nAttacking enemies takes place after defense and you can declare attackers against each engaged enemy. If Legolas is involved in an attack on an enemy that is destroyed (not on his own, it can be with other attackers) his ability triggers.\n\nIt does not trigger when an enemy is destroyed during the defense part of the combat phase whether they are dealt damage with Swift Strike or not because Legolas is not in any way shape or form attacking an enemy... swift strike is merely a direct damage event card that deals the damage itself, the damage does not come from the defending hero and even if it did it would not be damage dealt from an attack and rather damage dealt during and from a defense (like Spear of the Citadel and Gondorian Spearman, these effects are not attacks but rather deal direct damage during defense).\n\nIt is extremely clear from the language used and relevant rules that damage dealt via Swift Strike is not in any way an \"attack\" and neither is it damage that is being dealt by the defending hero but it is damage being dealt by the event itself.\n\n \n\nLegolas's ability can only be triggered when he makes an ATTACK against an enemy during the part of the combat phase that allows you to attack engaged enemies AFTER you perform your defense against all engaged enemies.\n\n \n\nCards like Hands Upon the Bow or Quick Strike are different however, because unlike Swift Strike (which symbolises the defender making a pre emptive strike or attack but is not an actual \"attack\" per say) they specifically state that the character is being DECLARED as an ATTACKER and to RESOLVE that attack. These are attacks so Legolas's ability would trigger in these cases as he is not defending and it is he that is doing the actual damage via an attack that the card is allowing him to make.\n\n \n\nThe only way that Swift Strike would trigger Legolas's ability is if it read as following: After a character is declared as a defender, the defending character makes an immediate ATTACK against the attacking enemy. This would be an ATTACK that the card is allowing Legolas to make and it would be damage from him during an attack which would trigger his ability if the enemy was destroyed by this attack.\nSwift strike does not do this at all however and simply does 2 damage to an enemy after a character is declared as a defender against it.\n \n\nIf you still disagree perhaps someone will be able to explain this better for you or perhaps you should send in a rules question to Caleb.\n\nEdited February 28, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2075101","commentId":2075101,"userName":"GrandSpleen","timestamp":1456631545,"content":"Well that's quite a post and I applaud your effort. Here is an official ruling that may help from the thread here [https://community.fantasyflightgames.com/topic/181319-difference-between-participates-in-an-attack-and-attacks/?hl=participate#entry1674159]:\n\n \n\n\"The Response effect on both Legolas and Blade of Gondolin work the same way. It is not necessary for a character equipped with a Blade of Gondolin to attack alone in order to trigger its effect.\n\nCheers,\nCaleb\"\n\n \n\nSince your question seems to hinge upon the word \"partcipate,\" I looked this one up.  The question in that thread was whether \"participates in an attack\" and \"attacks\" are different.  The answer is that they are not.  They mean the same thing.\n\n \n\nYou seem to be saying that the use of the word \"participate\" suggests that the definition of the word \"attack\" is actually \"an entire defense and attack against an enemy\" (defend and then attack against an enemy).  As you can see from the above clarification, there is no functional difference between \"attacks\" and \"participates in an attack,\" so there is no reason to assume that the word \"attack\" also includes a defense.  That's a monumental leap (you mentioned needing an official ruling to help you make a \"jump\" in reasoning, but really you are making significant assumptions without a rules base already).\n\n \n\nIn my opinion, the use of the word \"participate\" was originally meant to clarify that Legolas does not need to be the only character who is attacking, he can team up with other characters and still trigger his effect.   You also mentioned that some people on CardgameDB suggested that Legolas needs to attack alone in order to trigger his effect; the ruling I cited above tells us that this is not true."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2075134","commentId":2075134,"userName":"PsychoRocka","timestamp":1456634494,"content":"Oh wow it was me that actually asked Caleb in that old thread!\ntumblr_n1f710bUMX1rp382io5_500.gif [http://45.media.tumblr.com/c8ead573ba0d7b250ed76de035e8b8bd/tumblr_n1f710bUMX1rp382io5_500.gif]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2075437","commentId":2075437,"userName":"PocketWraith","timestamp":1456666227,"content":"I'm just going to focus in on one particular misconception you've got here:\n\n> From my research of the card data base, the word \"Attack\" when used as a noun describes each of the individual combats that happens during the combat phase, initiated by either the enemies or allies. All combats start by declaring the attacker who is the character that will deal the damage (is the one attacking), but allies can participate in them as attackers or defenders. This can be substituted by combat.\n> \n>  \n> \n> While the word \"Attack\" used as a verb refers to the action by the active character of the combat, the one initiating the combat (declared as the attacker) and dealing the damage. This could be substituted by strike.\n\nThis is not quite right. There is no 'active character' in an attack. All the characters you declare as attackers are attacking/participating in the attack. Which character or characters deal/s the damage most of the time doesn't matter, but if it does (the only instance I can think of is Heavy Stroke) you choose in which order to apply characters' attack values against the defence and then hit points of the enemy.\n\nCharacters declared as defenders are not participating in an attack, they are defending against one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2080135","commentId":2080135,"userName":"Nerdmeister","timestamp":1456915332,"content":"Defending against an attack is not the same as participating in an attack. In order for a character to “participate in an attack” it must be attacking an enemy.\nCheers,\nCaleb\n\n \n\nNot much of a surprise there"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2081568","commentId":2081568,"userName":"PsychoRocka","timestamp":1456963137,"content":"Hopefully this convinces xchan considering no one on the cardgamedb forums or these forums was able to! \nhttp://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/legolas-core?st=25#commentsStart [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/legolas-core?st=25#commentsStart]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203570-questions-regarding-attack-and-destroy-definition/?do=findComment&comment=2085236","commentId":2085236,"userName":"Nerdmeister","timestamp":1457129491,"content":"Yeah I posted the answer there as well; literally walls of text everywhere and now sudden silence :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"}]}