{"url":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/","title":"What is holding the Flame of the West?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072381","commentId":2072381,"userName":"Fingolfin Fate","timestamp":1456478489,"content":"Ok, please excuse a typical addict in the withdrawal period. I am just wondering why we still haven't seen the announcement of the Flame of the West. It has been a while since we learned the title...\n\n \n\nAs for the predictions:\n\n \n\nA) When is the announcement going to hit?\n\nB) What shall we see in it? If the past is anything to go by, the first saga preview never had a non-saga hero, and only one or two player cards (none for the Land of Shadow I recall)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072407","commentId":2072407,"userName":"John Constantine","timestamp":1456480258,"content":"A) Tomorrow.\n\nB) Something player card related, I hope."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072463","commentId":2072463,"userName":"Phlegethontia","timestamp":1456484714,"content":"Come on Leadership Denethor hero.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072466","commentId":2072466,"userName":"DurinVoronwe","timestamp":1456484878,"content":"Tactics Imrahil please"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072487","commentId":2072487,"userName":"Fingolfin Fate","timestamp":1456487189,"content":"> A) Tomorrow.\n> \n> B) Something player card related, I hope.\n\nThat would be nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072489","commentId":2072489,"userName":"Fingolfin Fate","timestamp":1456487284,"content":"> Come on Leadership Denethor hero..\n\nI doubt a Denethor hero because there is one in the core set. But it would make most sense to have him in Leadership, and if Leadership, then as a hero. It is yet to be to have two version of an ally within a single sphere, even though saga and cycles are two different organisms. I really wonder now as I am contradicting myself..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072490","commentId":2072490,"userName":"Fingolfin Fate","timestamp":1456487412,"content":"> Tactics Imrahil please\n\nImrahil hero for sure. I think that is the safest bet about all the player cards in the box (unless you count saga Aragorn). But the sphere? Well, thematically I think Spirit fits well but it is the least of Gondor spheres by a long shot. Lore seems totally unlikely. And we have a Leadership hero Imrahil, so just as the above, either there will be something we haven't seen before, or… well Tactics Imrahil."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2072493","commentId":2072493,"userName":"Fingolfin Fate","timestamp":1456487555,"content":"Also, the saga hero counts per sphere thus far:\n\nLeadership 2\n\nTactics 1\n\nSpirit 2\n\nLore 3\n\nPrediction for the future sagas:\n\n1 Leadership\n\n2 Tactics\n\n1 Spirit\n\n0 Lore\n\nAccording to that and some more (feeble) logic, we might get Leadership & Tactics now and Tactics & Spirit in the last box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2073119","commentId":2073119,"userName":"midwestborn86","timestamp":1456511140,"content":"Still waiting for SpearAgorn. How can you have 4 Aragorns and not spirit after a Dunadain cycle?\n\nI think we'll get Leadership Denethor with some sort of amazing ability or stats but also a negative ability and Imrahil will be an Ally or a Tactics Hero\n\nEdited February 26, 2016 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2073138","commentId":2073138,"userName":"Fingolfin Fate","timestamp":1456511709,"content":"Oh, and I totally got one thing wrong, I still think Imrahil is a safe bet but Éomer hero is a much safer bet yet.\n\nI really hope there is no Aragorn beside the saga version, there have been too many of him already. If there is to be one more, I hope it is an ally -- and not in the saga."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2073264","commentId":2073264,"userName":"banania","timestamp":1456515806,"content":"Imrahil Tactics and Eomer Leadership will be the heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2073317","commentId":2073317,"userName":"Estel Edain","timestamp":1456517901,"content":"FFG likes to release a saga expansion at Gen Con. The Road Darkens was announced in early February 2014 and they clearly intended to have a limited release at Gen Con (in Christian Petersen's InFlight report, he incorrectly said that it was available). At Gen Con 2014, perhaps in reaction to yearlong wait between Black Riders and Road Darkens (and also because they were announcing Helm's Deep and the shift from Frodo to  Aragorn), they also announced Treason of Saruman, which came out on April 23 2015. The Land of Shadow was announced a week later, three months before its limited release at Gen Con 2015. My guess is that The Flame of the West will have a limited release at this year's Gen Con, and they don't want to announce too early, especially since the full release is usually a couple of months after Gen Con. On the other hand, we're currently in the relatively dead period between a deluxe release and the start of a cycle. I expect to see, within the next month, announcements for the fifth and probably sixth APs of the Dreamchaser cycle, announcements for Nightmare decks (for either the second half of the Ringmaker cycle or The Road Darkens), and the announcement for The Flame of the West.\n\n \n\nPlayer cards would be cool, but my biggest hope for the the announcement article is that it lets us know what the quests are. The Paths of the Dead and the battle of Pelennor Fields are obvious choices, but will Flame of the West include the battle of the Morannon, or will that be saved for the sixth box, perhaps in a quest that combines Mount Doom and the battle? If Flame of the West doesn't include the battle of the Morannon, what will the third quest be? If the battle of Pelennor Fields is the final quest, there could be a preparatory quest. The Siege of Gondor might work, although Aragorn's not present for that (The Road to Isengard mostly avoided this problem, since the quest was more focused on the confrontation with Saruman than on the Ents destroying Isengard). The Ride of the Rohirrim has the same problem, and the raid on the Corsairs is outside of Tolkien's narrative and doesn't feel epic enough for a whole quest (possibly a quest stage, though). The Pyre of Denethor also seems like it wouldn't be a whole quest: perhaps it'll be represented by a treachery (condition attachment?) in the Battle of Pelennor Fields. The Battle of Pelennor Fields could be the second quest, but a third quest where the armies just march to the Black Gate seems anti-climactic. Of course Flame of the West could include the Battle of the Morannon, but then there's not much material to draw on for the last box. One quest would be Cirith Ungol, but it seems difficult to stretch the Ringbearer traveling through Mordor and up Mount Doom into two quests without the battle of the Morannon. The sixth box might then have to include Scouring of the Shire, which seems like it would work better as a POD quest. Any other ideas on possible quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074087","commentId":2074087,"userName":"Fingolfin Fate","timestamp":1456556962,"content":"Oh yeah, the quest selection is a tricky one. My guess is that the Black Gates Open will be saved for the last box -- you gotta have one battle there, right? I feel the Pellenor will be the climax of the Flame. Perhaps Siege of Gondor being a part of the second quest? Well, probably not because Aragorn is not present during that. Hmm...\n\n \n\nRe-reading the above, you basically said it all Estel. Scouring of the Shire fits perfectly within the lines of the Battle of Lake-town, Old Forest or Fog on Barrow Downs. I think Mount Doom will indeed finish the story of the Box VI.\n\nEdited February 27, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074121","commentId":2074121,"userName":"NathanH","timestamp":1456560872,"content":"You could have the acquisition of the Oathbreakers as the first quest, and in the second quest you race to Pelargir in a blitz quest where enemies are only a minor inconvenience (maybe featuring very powerful Oathbreaker objective allies) but getting through the stages quickly is vital."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074218","commentId":2074218,"userName":"PsychoRocka","timestamp":1456573028,"content":"A fair while ago I started this similar thread: https://community.fantasyflightgames.com/topic/134436-scenarios-in-the-remaining-saga-boxes/ [https://community.fantasyflightgames.com/topic/134436-scenarios-in-the-remaining-saga-boxes/]\n\n \n\nAs you can see back in that thread there was a fair bit of discussion about whether or not scouring would be included, I guess we will have to wait and see!\n\n \n\nI agree that it seems a little anti climactic going from Mount Doom to the scouring of the shire but thematically it is extremely appropriate and what's more I cannot for the life of me think of what the 3rd quest in the last box would otherwise be unless the siege of Minas Tirith and Battle of Pelennor fields are broken up into two quests.\n\nEdited February 27, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074233","commentId":2074233,"userName":"Fingolfin Fate","timestamp":1456575456,"content":"There is no doubt that the Scouring of the Shire was a major theme for Tolkien. I think one of his most important episodes, as a war veteran. It is a tragic and powerful chapter in the book; however, just as I understood its omission in the movies, I would understand it in the game, and feel a bonus quest would be most appropriate for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074245","commentId":2074245,"userName":"DurinVoronwe","timestamp":1456576544,"content":"My ideas for the Flame of the West:\n\n \n\nHeroes: tacic Imrahil, Leadershp Eomer (fellowship Aragorn)\n\nAllies: Leadership Denethor, Tactic Eowyn. lore Elladan, Spirit Elohir\n\nQuests: paths of dead, some kind of quest when you travel from Erech to Minas Tirith (inlcuding the battle at Pelargir), the Battle of Pelennor Fields.  \n\n \n\nMy ideas for the last one:\n\nHeroes: tactic Gwahir, Spirit Aragorn (fellowship Frodo)\n\nAllies: Leadership Pippin, tactics Meneldor, lore Merry, spirit Sam\n\nQuests: Cirith Ungol, the Black Gate opens, Mount Doom\n\n \n\nPod quest scouring of the Shire.\n\n \n\nThat leaves only a couple of problems.\n\n1. Ally Beregond or Halbarad would be a good choise, but not as good as the others. Maybe instead of Elladan/Elrohir?\n\n2. There will be no fellowship Aragorn at the Black Gate opens.\n\nAny characters missed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074271","commentId":2074271,"userName":"Fingolfin Fate","timestamp":1456578461,"content":"I think it leaves a few more problems. Don't you find Merry and Pippin play much more prominent roles in the Book V than VI? And also much bigger roles than Elladan and Elrohir? One can argue they are already represented by their Black Riders versions though.\n\nBeregond is a prominent character in the Book V for sure.\n\nDenethor Leadership ally would make perfect sense, if not for the fact there is a Leadership ally version of him already -- though neither in the core set nor in the saga boxes.\n\n \n\nI agree about the problem of no Aragorn for the Black Gate Opens. A very good point. Thus we might have a perfect collection of Paths of the Dead, Pelennor Fields, and Morannon for Box V, making a great story line, and a perfect sense (however leaving us with very little to do in the Box VI).\n\nEdited February 27, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074469","commentId":2074469,"userName":"Fingolfin Fate","timestamp":1456591153,"content":"ps: But I would love to get Elladan and Elrohir allies, because I am (quite unlike others here, I think) totally underwhelmed by their hero versions. I have tried and tried to make a good deck with them but never succeeded once to my satisfaction. However, I feel we shall get them in the new cycle, as expensive allies had been announced (and some previewed already).\n\nEdited February 27, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074505","commentId":2074505,"userName":"PsychoRocka","timestamp":1456593254,"content":"I am the opposite and love the strength of the brothers but would still really love some new versions, allies or hero. It would definitely open up more options when building a deck with them by a fair bit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074511","commentId":2074511,"userName":"John Constantine","timestamp":1456593508,"content":"In a perfect world, there would be 4 differently colored versions of each brother :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited February 29, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074577","commentId":2074577,"userName":"DurinVoronwe","timestamp":1456597331,"content":"I also want new versions of the brothers, and that is why I put them in instead of Beregond/Halbarad. Leadership Denethor already exists... a problem. Maybe lore instead?\n\nMerry and Pippin is more important in book V, I know, but they do play a role in book VI, when the others do not. Simply a matter of card space, and I like the idea of new ally versions of the hobbits in the last one, as the heroes in the first. As Gandalf says, the have learned for the scouring of the Shire of their journey. He doesn´t need to help them (or something similar, I don´t have the book available right now). Then we NEED that horn Merry gets from Éowyn. Some hobbit/Rohan synergy.\n\n \n\nI want FIVE versions of both brothers. Do not forget neutral.\n\nEdited February 27, 2016 by DurinVoronwe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074809","commentId":2074809,"userName":"Fingolfin Fate","timestamp":1456611738,"content":"> I am the opposite and love the strength of the brothers but would still really love some new versions, allies or hero. It would definitely open up more options when building a deck with them by a fair bit.\n\nI know both. And I will not argue. I know people find their use, I just struggle with it -- some of those enigmas in life, I guess, haha.\n\nThe allies would really make things interesting though, not just having have to put them both together. Even if I play mostly 2-player, I still want to have each deck workable solo, so I wouldn't spread them. I would love if the allies went Elladan Leadership and Elrohir Tactics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2074814","commentId":2074814,"userName":"Fingolfin Fate","timestamp":1456611920,"content":"> I also want new versions of the brothers, and that is why I put them in instead of Beregond/Halbarad. Leadership Denethor already exists... a problem. Maybe lore instead?\n> \n> Merry and Pippin is more important in book V, I know, but they do play a role in book VI, when the others do not. Simply a matter of card space, and I like the idea of new ally versions of the hobbits in the last one, as the heroes in the first. As Gandalf says, the have learned for the scouring of the Shire of their journey. He doesn´t need to help them (or something similar, I don´t have the book available right now). Then we NEED that horn Merry gets from Éowyn. Some hobbit/Rohan synergy.\n> \n>  \n> \n> I want FIVE versions of both brothers. Do not forget neutral.\n\nI think if we are going to see a Denethor ally, then yes, he will be Lore. It actually fits the theme even better, as you can imagine Denethor sort of abandoning his Stewardship in favour of deep knowledge which leads to his doom.\n\nAnd yes, I think we may very well get the Hobbits in the last box. They already had Snowmane and Skinbark in Box IV just because of the space. It would make more sense with Merry and Pippin. And yes, the symbolism of their journey from the beginning till the end would indeed be neat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075023","commentId":2075023,"userName":"Finduin","timestamp":1456626612,"content":"I think, that we will have the following Heroes. Please give us 4+1 of them!\n\nAragorn (Fellowship)\nÉowyn (Tactics)\nDenethor (Leadership)\nImrahil (Lore)\nHalbarad (Spirit)\n\n\nFor Allies we will have:\nBergil (Tactics)\nIoreth (Spirit)\nGhan-buri-ghan (Lore)\nHirgon (Leadership)\n\nBecause we need to put this characters now! or never!. In the next expansiones we can have more Twins, or the Hobbits.\n\nI believe that the last adventure of the box will be Pelennor, meanwhile the first two will be something to prepare the great Battle. The Heroes will put their help to defend the city. Aragorn and the Path of the Dead, Faramir in Osgiliath, and the Rohirrim.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075317","commentId":2075317,"userName":"banania","timestamp":1456651015,"content":"No, no, and no. It's been said so many times. Saga expansions are designed outside the mainframe of the game and there is no duplicate of heroes from the core set in the saga expansions, except for Fellowship heroes. No way we get a Denethor or Eowyn hero. I still could be mistaken, but I'm pretty sure I'm not. Eomer and Imrahil t'will be. It's a possibility we get Denethor and Eowyn as allies though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075855","commentId":2075855,"userName":"JohnGarrison1870","timestamp":1456693243,"content":"Hopefully they are not delaying Saga releases because of a near-imminent end of the game. :/\n\n \n\nSay, for argument's sake, the Dreamcatcher cycle will be the last. Then once they're done with the LotR Sagas the game is wrapped up. In such a scenario, it behooves them to stretch out the Saga releases as much as they can, in order to keep people playing and buying. As long as something \"must have\" is still coming (as are the rest of the saga boxes to many players) then sales of all LotR LCG products will continue. As soon as no new releases are on the horizon, interest in the game will likely drop quickly and sales of previous APs and deluxe expansions will drop. Even though it doesn't necessarily make logical sense (you can enjoy buying packs you don't have yet, regardless of whether or not the game is still being expanded) it's just a fact of human psychology. But by keeping the Sagas strung out, people stay more emotionally invested in the game and are more likely to buy their missing packs, even if they never get the latest and newest stuff.\n\n \n\nI have zero reason to believe the game is ending anytime soon. Just a random disturbing thought I had. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075931","commentId":2075931,"userName":"Calvadur","timestamp":1456697318,"content":"> No, no, and no. It's been said so many times. Saga expansions are designed outside the mainframe of the game and there is no duplicate of heroes from the core set in the saga expansions, except for Fellowship heroes. No way we get a Denethor or Eowyn hero. I still could be mistaken, but I'm pretty sure I'm not. Eomer and Imrahil t'will be. It's a possibility we get Denethor and Eowyn as allies though.\n\nUp to this Point I would say this made sense, as there were many possible choices for heroes, that didn't had a hero Version of themself, but in my opinion they should break with this rule for flame of the west, as new incarnations of specific core set characters (Denethor, Eowyn) fit so PERFECT into this box.\n\n \n\nFlame of the west:\n\n \n\nIf they decide to break this \"rule\" I bet on Eowyn (T) and Denethor (S or L).\n\nIf they Keep it, Imrahil (T) and Eomer (L) would be my votes\n\n \n\nFor Quests:\n\nNo way they don't do the path of the dead, so this would be NR:1\n\nThe Siege of Minas Tirith is sure to follow, so we have NR.2\n\n \n\nQuestion is: Is Minas Tirith big enough of a battle to make 2 quests out of it and make the ride and attack of the rohirim and the death of the witch-king the third quest? If not, only the destruction of the corsairs could give enough \"material\" for another quest. I would say yes and would be very interessted how FFG combines the ride, Arrival and attack together. Only defending Minas Tirith \"Helm's Deep Style\" and having the last queststage be the cleanup doesn't give this battle enough credit.\n\n \n\nThe Last Saga Box:\n\n \n\nHeroes:\n\nSam (S), every Hobbit has a Spirit hero form and even though Sam gets a Spirit ally form in he near future iirc, the \"willpower\" sphere fits perfect for a Hobbit who is climbing Mount Doom^^\n\nAragorn (S) To make the Quartette complete and again it fits into the Story.\n\nJust realised I vote for double Spirit heroes :rolleyes: [//content.invisioncic.com/Mfantflight/emoticons/default_rolleyes.gif] surely never going to happen... So i must be Gollum hero :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nQuests:\n\nCirith Ungol must be the first one, you can't scip that...\n\nThe Battle at the black gate and the climb of Mount doom have to be one quest, but really one, to Show how the army draws Sauron Attention and struggles to survive (what makes the Player hurry to destroy the ring), while Frodo and Sam climb the mountain.\n\nLast one should be the scourging of the shire. It is very important for Tolkien and unlike barrow downs or the old forest gives the Story a complete new Twist\n\n \n\nYou can just cut forest and downs and nothing in the Story changes, see the movies, but by scipping the scourging the end of the Story gets a complete different Feeling; I have the Feeling that FFG won't do another pod saga quest. they just did that, because the first book had so much stuff to make a quest of they had to choose the 3 most important  Things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075952","commentId":2075952,"userName":"John Constantine","timestamp":1456698450,"content":"Didn't Denethor went nuts at this point? I would expect him to be an enemy, not a hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2075993","commentId":2075993,"userName":"PsychoRocka","timestamp":1456700698,"content":"I hope the battle of the morannon and the destruction of the ring are in the one quest as well Calvadur\n\nIt should be like breaking of the fellowship with separate staging areas and the black gate section should be incredibly hard so that you can barely survive and are eagerly awaiting the rings destruction to end the onslaught.\n\nThere should be armoured trolls, heaps of archery, Ringwraith's (even on foot though this is somewhat unthematic) and gnarly Mordor Uruks, heavy Harad troops and Easterlings and it should just be a blood bath, the quest stage should have some horrible effect like making you discard an ally at the end of each round but doing damage to an enemy in play equal to the discarded allies attack strength. The enemies should be strong and this should only help minimally but should represent the great sacrifice and charge the Free People made at the black gate. The enemy vastly outnumbered them and many were slain but they persevered until the ring was destroyed.\n\nI have no idea what the staging area or mechanics of the mount doom section would be though or how to represent Sam and Frodo's trek to Mount Doom, climb up it and then the final test within. Gollum would need to be an enemy at the end obviously but something other than just defense and attack should be involved.\n\nPerhaps after you do enough damage to him he has an effect that makes him make an immediate boosted attack and take the ring attachment from Frodo, at this point perhaps there could be some cool test you have to make to see whether or not Frodo in desperation follows Gollum to his demise to try and get the ring for himself and also dies or whether he is able to resist the pull of the ring and merely watch as Gollum falls to his death.\n\n \n\nI agree that Denethor should 100% be an enemy or even quest stage/treachery card rather than an ally or hero.\n\nEdited February 28, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076010","commentId":2076010,"userName":"Gizlivadi","timestamp":1456701661,"content":"I agree with John Constantine. I could see Lore ally Denethor at most, but most definitely not as hero. Tactics Eowyn, on the other hand...\n\nEdited February 28, 2016 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076047","commentId":2076047,"userName":"Calvadur","timestamp":1456703903,"content":"John Constantine, on 28 Feb 2016 - 11:27 PM, said:\n\nDidn't Denethor went nuts at this point? I would expect him to be an enemy, not a hero.\n\n \n\nYeah that's right. He might really not fit into a hero role for the box.\n\nI wouldn't like him being an enemy though. Denethor was despared as he thought the end of mankind was sure to come and killed himself. Only \"evil\" Thing was he tried to burn Faramir with him. The whole \"Denethor goes mad plot\" seems hard to fit into the quest, as it distracts very much from the siege itself. A sidequest, which is brought into Play by revealing a specific queststage (e.g. 3A), which gives the Players an Explanation why Denethor is suddenly a danger for them and the Option to save Faramir. If you don't solve the sidequest (I would say give it time 4 or something like that) a burden should be brought into Play, which will ofc stick for the rest of the (not so Long anymore) campaign. If you solve the quest you just dodge the burden (FFG really reduced the boons you can get the further the campaign advances, just the burden can add up).\n\n \n\nPsychoRocka, on 29 Feb 2016 - 12:04 AM, said:\n\nI hope the battle of the morannon and the destruction of the ring are in the one quest as well Calvadur\n\nIt should be like breaking of the fellowship with separate staging areas and the black gate section should be incredibly hard so that you can barely survive and are eagerly awaiting the rings destruction to end the onslaught.\n\nThere should be armoured trolls, heaps of archery, Ringwraith's (even on foot though this is somewhat unthematic) and gnarly Mordor Uruks, heavy Harad troops and Easterlings and it should just be a blood bath, the quest stage should have some horrible effect like making you discard an ally at the end of each round but doing damage to an enemy in play equal to the discarded allies attack strength. The enemies should be strong and this should only help minimally but should represent the great sacrifice and charge the Free People made at the black gate. The enemy vastly outnumbered them and many were slain but they persevered until the ring was destroyed.\n\nI have no idea what the staging area or mechanics of the mount doom section would be though or how to represent Sam and Frodo's trek to Mount Doom, climb up it and then the final test within. Gollum would need to be an enemy at the end obviously but something other than just defense and attack should be involved.\n\nPerhaps after you do enough damage to him he has an effect that makes him make an immediate boosted attack and take the ring attachment from Frodo, at this point perhaps there could be some cool test you have to make to see whether or not Frodo in desperation follows Gollum to his demise to try and get the ring for himself and also dies or whether he is able to resist the pull of the ring and merely watch as Gollum falls to his death.\n\n \n\nI agree that Denethor should 100% be an enemy or even quest stage/treachery card rather than an ally or hero\n\n \n\n \n\nThat is how I want the quest to be, too.\n\nTo Show the Separation of the two parts od the quest I think the Players should split up their heroes to either Support Frodo or Aragorn (there should be Fellowship Aragorn as well as Fellowship Frodo, just for this quest). This way you would end up with 2 seperate staging Areas and both will have their own quest and Encounter decks. While the one would be a defense ala \"Helms Deep\" the other would be the race to the top of Mount Doom where Gollum awaits you (with all These annoying stuff you can give a character like him: undefended damage on Frodo, attacks Frodo every now and then, no attachments, indestructable) he could sit in the staging area and you would have to quest through the last stage while keeping him away from frodo, if you manage that before you loose at the other side of the table you win.\n\nAs you effectivly Play two quests in one, the campaign Card could even allow you a 4th hero just for this quest (must be alive) so every Player could have 2 heroes in each area. You would still Play with 1 deck.\n\nSo much stuff you can do for this quests, really, I am really excited how it will look like in the end.\n\n \n\nWhile dreaming about how epic the destruction of the ring could be made, it came to my mind that it wouldn't be Fitting to Control Frodo with the ringbearer trait after this quest (he is more of a ex-ringbearer), what makes scourging of the shire interesting (if it Ends up being a quest): Do you have another Frodo? Do you have no Fellowship hero? Does FFG not care and just let's you use Frodo, who wouldn't have an ability as you can't attach the ring to him?\n\nEdited February 28, 2016 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076059","commentId":2076059,"userName":"Gizlivadi","timestamp":1456704641,"content":"With all the stuff happening at the same time in the first part of ROTK, I wouldn't be surprised to see side quests (non-randomized) make a return."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076125","commentId":2076125,"userName":"Rob_Oz","timestamp":1456708309,"content":"I've mentioned this before, but I'll say it again. Eowyn's role in ROTK is so prominent that I'd be rather surprised if she isn't included as a hero. Yes, that totally breaks the model that the designers have set forth in the Saga boxes. They aren't in any way required to strictly adhere to that model. As has been well-noted above, there aren't many hero options in Flame of the West. Eowyn is one such option. Moreover, currently every single female hero in LOTR:LCG is either Lore or Spirit. What better time to break some molds then by giving us a Tactics or Leadership Eowyn in Flame of the West to represent her defeat of the Witch King."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076126","commentId":2076126,"userName":"Phlegethontia","timestamp":1456708392,"content":"This is the only book where Denethor's a main character. First as a protagonist and later as an antagonist. If he were to be included in the saga expansions, surely the flame of the west would be it. I personally hope to see a Leadership Denethor hero to strengthen the Gondorian army archetype. Though a Tactics Imrahil is intriguing and could do something similar. I just think we're more likely to get a Tactics Eowyn. Only time will tell."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2076211","commentId":2076211,"userName":"soullos","timestamp":1456714577,"content":"I just want some news... >_>"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079060","commentId":2079060,"userName":"Fingolfin Fate","timestamp":1456855962,"content":"> I've mentioned this before, but I'll say it again. Eowyn's role in ROTK is so prominent that I'd be rather surprised if she isn't included as a hero. Yes, that totally breaks the model that the designers have set forth in the Saga boxes. They aren't in any way required to strictly adhere to that model. As has been well-noted above, there aren't many hero options in Flame of the West. Eowyn is one such option. Moreover, currently every single female hero in LOTR:LCG is either Lore or Spirit. What better time to break some molds then by giving us a Tactics or Leadership Eowyn in Flame of the West to represent her defeat of the Witch King.\n\nYeah, this is a bit of a dilemma for me too. On hand I feel the set model makes sense. You know, the people who only buy the core and saga, they probably want as many options as they can get, and in that logic, an ally Éowyn would make more sense (though the unique problem thus remains just the same). On the other hand, Éowyn is indeed the heroin of the climax of the Battle on the Pelennor Fields. Tactics would fit her either way.\n\n \n\nOn a side note, my favourite solution would be Dernhelm (the name she used as a disguise riding to the battle) attachment but I doubt it will happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079062","commentId":2079062,"userName":"Fingolfin Fate","timestamp":1456855996,"content":"> I just want some news... >_>\n\nIt is really taking so long this time. I remember Land of Shadow came almost out of the blue (at least for me)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079220","commentId":2079220,"userName":"Slothgodfather","timestamp":1456860926,"content":"Do we know who the fellowship hero will be already?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079288","commentId":2079288,"userName":"John Constantine","timestamp":1456863173,"content":"I'm afraid there is yet no official info on this box. I hope I wrong though, but I don't remember any intel slipping on this box like at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079327","commentId":2079327,"userName":"banania","timestamp":1456864582,"content":"You're right.\n\nThey may be holding it off for a GenCon release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079347","commentId":2079347,"userName":"Slothgodfather","timestamp":1456865695,"content":"What if we get two fellowship type heroes this time and one is Denethor and half way through he turns into an enemy?  They've already done similarly with other objective-allies and Golem as well as the new pirate captains in the latest expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079352","commentId":2079352,"userName":"John Constantine","timestamp":1456865988,"content":"That's the point. The examples you've mentioned are no fellowship heroes, they're objectives. To me, the thing you've described is more likely to appear as an objective than as a two-sided fellowship player card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079362","commentId":2079362,"userName":"Estel Edain","timestamp":1456866332,"content":"> Do we know who the fellowship hero will be already?\n\n \n\nPalantir of Orthanc (which can only be obtained after the last quest in Treason of Saruman) say attach to Fellowship Aragorn. So we're definitely getting Fellowship Aragorn. Theoretically we could get another fellowship hero for a \"Siege of Gondor\" quest, but that doesn't seem to fit with campaign mode's emphasis on keeping the same heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079386","commentId":2079386,"userName":"Calvadur","timestamp":1456867477,"content":">  \n> \n> > Do we know who the fellowship hero will be already?\n> \n>  \n> \n> Palantir of Orthanc (which can only be obtained after the last quest in Treason of Saruman) say attach to Fellowship Aragorn. So we're definitely getting Fellowship Aragorn. Theoretically we could get another fellowship hero for a \"Siege of Gondor\" quest, but that doesn't seem to fit with campaign mode's emphasis on keeping the same heroes.\n> \n>  \n\nPalantir of Orthanc doesn't proof 100% it will be Aragorn, but honestly FFG wasn't very surprisiing with the Fellowship heroes (3x Frodo, 1x Aragorn) so I am sure it will be Aragorn, too.\n\nTh reason I would say it doesn't have to be Aragorn is, that you already have a Fellowship Version of Aragorn, IF you can grap the palantir. If you Play campaign (and only then you get the palantir) you should have an aragorn Version to use the palantir with, even if in falme of the west is no other Version of him. Again very unlikely (just look at the Name of the box :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]), but possible. Yes, I like hypothetical Scenarios, which almost never gonna happen :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\n> What if we get two fellowship type heroes this time and one is Denethor and half way through he turns into an enemy?  They've already done similarly with other objective-allies and Golem as well as the new pirate captains in the latest expansion.\n\n \n\nI doubt something like this is going to happen and agree with John, that this idea fits best for objective allies. To add to this: Denethor isn't important enough to become a Fellowship hero, he would even ruin the Name of the sphere in my opinion if he should be in it, as he has nothing in common with the characters that are part of the Fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2079394","commentId":2079394,"userName":"John Constantine","timestamp":1456867901,"content":"> > Do we know who the fellowship hero will be already?\n> \n> Palantir of Orthanc (which can only be obtained after the last quest in Treason of Saruman) say attach to Fellowship Aragorn. So we're definitely getting Fellowship Aragorn. Theoretically we could get another fellowship hero for a \"Siege of Gondor\" quest, but that doesn't seem to fit with campaign mode's emphasis on keeping the same heroes.\n\nAt first, when I started reading, I thought it was going to be \"Palantir of Orthanc is the next fellowship hero\" joke... :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095708","commentId":2095708,"userName":"Tiberius the Killer","timestamp":1457672046,"content":"Hi, I'm still brand new to the forum, and fairly new to the game.  I am really hoping these last saga boxes can make a serious Gondor deck viable, which I have always wanted and never succeeded in.  I suppose Tactics Imrahil could possibly pair with Beregond?  But I would love to be able to play Leadership Boromir and keep some theme.  Or even something to boost a Ranger deck.  I suppose we'll see, but I can't wait for the day that Gondor gets itself some loving.  Hopefully that day is soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095715","commentId":2095715,"userName":"Gizlivadi","timestamp":1457672366,"content":"I can't agree with you more, Tiberius."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095863","commentId":2095863,"userName":"Fingolfin Fate","timestamp":1457686432,"content":"I think, and hope (or perhaps the latter more than the former) that not only Flame of the West but also the upcoming cycle will reinforce both the Leadership Gondor but also Lore Gondor (as seen in some previews). The trap decks got a great boost with Damrod hero but if you make the deck pure Gondor it can still only fare well against very specific scenarios. Leadership Gondor is one of my favourite decks, I have had it built with only minor changes for over two years (whilst changing my other decks constantly and drastically, safe perhaps the Galadhrim for about a year), it is a decent deck now, but it still needs support to get where it should be (in my opinion), challenging the strength of Silvan and Noldor (not to mention Outlands which I do not play).\n\nEdited March 11, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095900","commentId":2095900,"userName":"John Constantine","timestamp":1457689796,"content":"I wish for them to revisit Isengard and Doomed stuff. They barely scratched them, and abandoned them too fast :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095906","commentId":2095906,"userName":"DurinVoronwe","timestamp":1457690173,"content":"I guess you havent changed your dwarf deck a lot... I want more dwarves!\n\n \n\nAnd I want tacitc Gondor to be a viable deck (the warriors/Knights of Minas Tirith), like Beregond, Boromir, Imrahil, Swan Knights, Knights of Minas Tírith, Defender of Rammas, and not the numerus armies of non-warriors or the rangers, who avoid combat. Like a\n\nGondorian Swordsman\n\ncost 3\n\n0 will\n\n2 atk\n\n2 def\n\n3 Hit Points\n\n \n\nAction: Spend 1 resource from a Gondor hero´s resource pool to add 1 atk of def to all copies of Gondorian Swordsman (they forming some numenorian battle formation).\n\n \n\nThat would be great.\n\nAnd SARUMAN hero!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095936","commentId":2095936,"userName":"Fingolfin Fate","timestamp":1457692809,"content":"Battle formations would be great. And again, I hope we will get some of it. There was a preview to benefit decks built out of Scout characters, I really think they should do the same for Rangers and Warriors (at least)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2095950","commentId":2095950,"userName":"John Constantine","timestamp":1457693821,"content":"> Gondorian Swordsman\n> \n> cost 3\n> \n> 0 will\n> \n> 2 atk\n> \n> 2 def\n> \n> 3 Hit Points\n\n \n\nMEC30_115.jpg [http://www.cardgamedb.com/forums/uploads/lotr/MEC30_115.jpg]\n\n \n\nGets pretty close."},{"commentUrl":"https://community.fantasyflightgames.com/topic/203753-what-is-holding-the-flame-of-the-west/?do=findComment&comment=2096093","commentId":2096093,"userName":"DurinVoronwe","timestamp":1457703907,"content":"Yes, but it's the ability who is intruging."}]}