{"url":"https://community.fantasyflightgames.com/topic/204005-dealing-shadow-cards-outside-combat-phase-with-empty-encounter-deck/","title":"Dealing Shadow Cards outside combat phase with empty Encounter deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204005-dealing-shadow-cards-outside-combat-phase-with-empty-encounter-deck/?do=findComment&comment=2076156","commentId":2076156,"userName":"JYoder","timestamp":1456710238,"content":"Anytime you deal a shadow card outside the combat phase, if the encounter deck is empty, do you not deal a shadow card? Or do you re-shuffle the discard pile and deal a shadow card?\n\nEdited February 29, 2016 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204005-dealing-shadow-cards-outside-combat-phase-with-empty-encounter-deck/?do=findComment&comment=2076194","commentId":2076194,"userName":"GrandSpleen","timestamp":1456713627,"content":"If the encounter deck is empty and you have to deal a shadow card, you just won't have a shadow card.  So if an enemy like Gollum attacks during the Refresh phase and the deck is empty, you don't have to deal a card to him.\n\n \n\nIf this is coming during the quest phase, however, know that you reshuffle the deck immediately once it has been depleted, so any attacks happening during the quest phase will have shadow cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204005-dealing-shadow-cards-outside-combat-phase-with-empty-encounter-deck/?do=findComment&comment=2076417","commentId":2076417,"userName":"JYoder","timestamp":1456727860,"content":"Thanks. So I'm playing against The Battle of Carn Dum -- tough quest! At the end of the round during 1B, when Thaurdir is on his Champion side, he flips to his Captain side. His card says to deal 1 shadow card to each enemy in play, but the encounter deck is empty. He and the other enemies aren't attacking, so I admit, it seems a bit odd that none of them get a shadow card, but I won't complain, especially with this quest."}]}