{"url":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/","title":"Does anyone like the Campaign rules?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2076631","commentId":2076631,"userName":"Ketermuls","timestamp":1456749739,"content":"I'm dreading starting the campaign since it doesn't seem like fun replaying the same mission in order to make sure that no heroes die. Do they actually expect people to continue the campaign with 2 heroes, or is the +1 threat (for the entire campaign!) the intended choice?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2076758","commentId":2076758,"userName":"Calvadur","timestamp":1456755861,"content":"I love campaign mode.\n\nHaving to keep all heroes alive adds so much tendion, You don't have otherwise (except for the score...)\n\nAnd Not every quest is that hard, that You will struggle to survive, just a good Challenge once in a while.\n\nOfc it depends On how good You are at the game, I have rarely a dead Hero, if I win any quest in this Game, so Not much trouble in CM. I had to replay like 1 or 2 quest so far.\n\nYou should feel free to alter the rules to your liking. Just Wanne have boons and burdens? Go ahead. No interesr in +1 threat? Scip that rule. The beauty of a coop Game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nBut yes, if a Hero dies (what shouldn't Happen SO often), it is intended to use fewer Heroes or Raise your starting threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2076799","commentId":2076799,"userName":"Thanatopsis","timestamp":1456757202,"content":"Don't forget that you can change your deck as much as you want in campaign. Only the heroes have restrictions and you can tailor the contents of your deck after each quest to give you a better chance at winning (ex/ you don't really need attack/engage the staging area effects in the first Black Riders quest, but in the second you want to make Bill Ferny a priority.)\n\n \n\nLast of all, play your first campaign on easy mode.\n\nEdited December 10, 2018 by Thanatopsis\ntypo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2076913","commentId":2076913,"userName":"cmabr002","timestamp":1456760929,"content":"> I'm dreading starting the campaign since it doesn't seem like fun replaying the same mission in order to make sure that no heroes die. Do they actually expect people to continue the campaign with 2 heroes, or is the +1 threat (for the entire campaign!) the intended choice?\n\n \n\nPersonally, I don't like the rules much.  It feels much too restrictive, but I still play all of them by the rules because it is how it was designed.  I often dread playing the campaign, though.\n\n \n\nOnce I'm done with the campaign, I do think it will be quite fun to go back and play the scenarios with different decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2076996","commentId":2076996,"userName":"Lecitadin","timestamp":1456763914,"content":"If you play alone, nobody will know if you change your heroes without the penalty. Or you could allow yourself one heroes mulligan..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077076","commentId":2077076,"userName":"Teamjimby","timestamp":1456765802,"content":"The rules basically mean you need to win without losing any heroes.  Maybe you can lose one or two non-critical heroes at most over the course of the campaign.  If you keep banging your head against the same scenario, don't be afraid to play that one on easy mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077230","commentId":2077230,"userName":"Nickpes","timestamp":1456769967,"content":"In my campaign I lost only once a hero, Gandalf, in order to kill Balrog - very thematic indeed, I could not resist to do it  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] - whenever I lose a camapign quest it is out of threat, not of a dead hero.\n\nGeneraly I like the rules, it is just that on Treason of Saruman I would prefer to have the option to change heroes in each quest\n\n \n\nAnyway, the game is not competitive, it is mostly for players to have a good time, make your changes as you like in order to have fun  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077264","commentId":2077264,"userName":"Thanatopsis","timestamp":1456770665,"content":"It depends on what kind of a player you are too.\n\nDo you have to win at all costs always under the best of circumstances? (perfectly valid)\n\nDo you want an unexpected narrative to unfold?\n\n \n\nTake a step back and ask yourself: is it really that bad to lose a hero? Think or the story you'll tell, the future challenges you're putting yourself under, the very unique story you're creating for your LotR adventure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077410","commentId":2077410,"userName":"DukeWellington","timestamp":1456775328,"content":"I must admit, I am not super thrilled about the campaign. The reason, however, is that it is not complete. I hate waiting g for the next box to come out and just saving the campaign progress. I plan to play the quest's in non campaign mode for now. Then, once the entire campaign is complete I plan to do the entire thing g in one go. That way I can plan out all my hero moves and boon selection and placement, etc. I think it will be more fun that way. If I want to play hard core style, where each quest only gets one try, I can do that too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077447","commentId":2077447,"userName":"Lecitadin","timestamp":1456776557,"content":"> I must admit, I am not super thrilled about the campaign. The reason, however, is that it is not complete. I hate waiting g for the next box to come out and just saving the campaign progress. I plan to play the quest's in non campaign mode for now. Then, once the entire campaign is complete I plan to do the entire thing g in one go. That way I can plan out all my hero moves and boon selection and placement, etc. I think it will be more fun that way. If I want to play hard core style, where each quest only gets one try, I can do that too.\n\n \n\nYep. When Land of shadows came out, I started all over again with new player cards and new heroes. I do this each time a new saga box comes out... makes you play more LOTR LCG!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2077860","commentId":2077860,"userName":"PsychoRocka","timestamp":1456790298,"content":"Haha I do that too Lecitadin!\n\nI also usually start a new campaign whenever I change a hero in my decks! I actually still haven't played Land of Shadow because I knew I was about to make some big changes right after I bought the deluxe box and so I want to get back up to Land of Shadow with my new decks before attempting it! I just got Grey Havens though so need to finish that before starting the campaign again....!\n\nSo I personally love the campaign rules and am not sure why there is so much hate for them from some of you....\n\n \n\nHow many games do you guys actually have hero deaths in and in those games how many do you still win?\n\nI personally concede pretty much any time a hero dies (campaign rules or not) playing any quest or scenario unless I am right at the very very end and a victory is like a turn away. Even in those cases I am likely to replay the quest to get a victory without a hero death as a win with a dead hero really doesn't seem like a win at all...\n\nI am going to be honest here I think A LOT of people on the forums and communities play like this and don't really have regular or accepted hero deaths in their games, obviously many people don't care about this but I really think that many people (possibly even the majority) play like me and avoid hero deaths altogether. Losing a hero can severely cripple you, especially certain deck types or heroes that decks are built around. So for normal play although it is ideal not to have any hero deaths, you can still win with them but just cop a bad score for that victory.\nIn campaign however, which is a long drawn out story and reimagining of the War of the Ring, you cannot let heroes die at any point in the story as if you do they have fallen and are dead....\n\nsimple as that, that hero is now dead....\n\nIt gives a bit more bite to the campaign (on top of boons and burdens) and properly simulates consequences for not keeping someone alive... the most obvious consequence? THAT HERO IS DEAD AND CANNOT BE USED ANYMORE.\n\nRemember that you can bring a hero back with Beyond All Hope and that you can substitute in a new hero for a permanent +1 threat which is nasty but better than running only 2 heroes (in a deck designed for three at least, two hero decks are quickly becoming a thing) for the rest of the campaign!\n\n \n\nDon't let your heroes die, if they do replay the quest. If its really that difficult to keep them alive maybe play easy mode, choose more defensive boon rewards or simply make/use a better hero line-up or deck....\n\nPersonally I think the Campaign would have been extremely lack-lustre and unthematic if you could continue to use heroes that have died during a particular part of the story on a harder quest. Many tragic deaths that shape the fate of Middle Earth take place in the narrative of LOTR and so why should that be any different in the game. \n\nEither don't let heroes die or make the most of their sacrifice and have backup heroes to replace them with!\n\nIf you don't like these highly thematic, appropriate and challenging rules then simply do not follow them, ignore the whole fallen heroes log and play how you want to. That is the beauty of this game, you can be a stickler for the rules and have immense fun or your can ignore the rules and still have immense fun. I personally think the rules (inclusive of campaign rules) are what MAKE the game so great so follow them to an absolute tee but at the same time can see how people would want to play with custom rules (that new errata on horn of gondor is just insanity... completely ruins that card and I will probably never ever run it again now) so if you have that much of an issue with the campaign rules just change them a bit to suit your play style or to get what you want to get out of the game  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2078100","commentId":2078100,"userName":"soullos","timestamp":1456800436,"content":"I find it too restrictive. I will swap out heroes and \"revive\" them without penalty. Besides, the biggest draw is the Boon and Burden cards. That is why I play campaign mode. I'm just here to have fun and don't care about the hero continuity issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2078266","commentId":2078266,"userName":"banania","timestamp":1456810499,"content":"I can vouch that at least 273 players like Campaign Rules :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2078324","commentId":2078324,"userName":"Raven1015","timestamp":1456815492,"content":"Personally, I really like campaign mode. The restrictions are what make it fun for me, otherwise it would essentially be the same as non-campaign mode. The tension of potentially losing a hero raises the stakes. I'm willing to let a hero die and stay dead if it makes for a good story and it's usually not too crippling to overcome."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2079831","commentId":2079831,"userName":"Ecthelion III","timestamp":1456889683,"content":"There is no shame in Easy Mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2082438","commentId":2082438,"userName":"Sevordo","timestamp":1457019014,"content":"The way my Brother and I play is that we don't restrict our Heroes every game and freely use Decks and Heroes we want to (because when you own everything currently released, it's not very fun to use the same cards over and over...) but we don't take Boons and rewards when we win. We basically sacrifice the permanent bonus to Heroes to keep flexible decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2084300","commentId":2084300,"userName":"Distractionbeast","timestamp":1457106518,"content":"I don't mind the rules regarding the heroes.  It forces some hard choices about deckbuilding which you don't have otherwise.  The problem I have is the level of complexity that creeps in as the campaign goes on.  Boons, burdens, rings, and ringbearers...  I spend more time setting up the scenario than playing it sometimes.  It's good for capturing the feel of the story and giving the players a bit of control over the course of the game, but if you're tight on time like I am, it's tough to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2084396","commentId":2084396,"userName":"Ketermuls","timestamp":1457109437,"content":"If I lose a hero to the balrog and then another hero is fallen into evil, is the third taken taken captive and the campaign straight up lost?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204043-does-anyone-like-the-campaign-rules/?do=findComment&comment=2084590","commentId":2084590,"userName":"Kakita Shiro","timestamp":1457114147,"content":"> If I lose a hero to the balrog and then another hero is fallen into evil, is the third taken taken captive and the campaign straight up lost?\n\nYou can select new Heroes but you must permanently raise your starting threat by 1 for each replaced hero, unless the campaign tells you not to."}]}