{"url":"https://community.fantasyflightgames.com/topic/204436-core-game-reprint/","title":"Core game reprint?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204436-core-game-reprint/?do=findComment&comment=2083307","commentId":2083307,"userName":"Babyblue","timestamp":1457044740,"content":"Does anyone know when this will be reprinted? Got into this last month and was thinking of getting it for a friend. Norway is a very small country and since this was an \"older\" game silly me though it wasn't in any danger of selling out. Turns out the 3 copies in stock sold out in a week...\n\n \n\nEdit: out of curiosity, has this game always been popluar or is there a recent increase in new players? This game is on the BGG hotness list, but don't know if that is usual, because of something announced or what.\n\n \n\nI got into it because of Ashes. I loved Dead of Winter so when PHG came out with Ashes I gave it a look, but wasn't sure if it was for me. Nostalgia hit and I started missing deckbuilding. Not wanting to buy blind packs an LCG was the logical choise. Going through the options and there was LOTR, a coop deckbuilder of all things. Bought the core and here I am.  \n\nEdited March 3, 2016 by Babyblue"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204436-core-game-reprint/?do=findComment&comment=2083364","commentId":2083364,"userName":"alexbobspoons","timestamp":1457047251,"content":"I got into this game a year ago and it's been in the BGG hot list all that time. It seems very popular, and with very very good reason! !!\n\nEdited March 21, 2016 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204436-core-game-reprint/?do=findComment&comment=2113545","commentId":2113545,"userName":"Babyblue","timestamp":1458463235,"content":"Looks like it's back in stock. It just went from \"out of stock\" to buy it now. Never saw it go throught \"awaiting reprint\" or anything. Hopefully retailers will have it in stock soon :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"}]}