{"url":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/","title":"Werewolf of Angmar is my friend","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/?do=findComment&comment=2086263","commentId":2086263,"userName":"Nerdmeister","timestamp":1457198353,"content":"My 3-man group is a bit behind on our questing duties. Thus we just recently arrived at Battle for Carn Dûm... and boy is that quest tough for 3 people: 20+ games and half a dozen deck revisions and still we only make minimal progress; we have a habit of not reading how other people do things, wanting to figure them out on our own.\n\n \n\nDuring our latest session today a thought occured: what if we get Werewolf of Angmar engaged with a player, put Forest Snare on him and just plow through events like there´s no tomorrow? To clarify: Forest Snare prevents an enemy from attacking normally and Werewolf of Angmar gets a shadow card each time an event is played. Combined with the quest instructing us to not discard unresolved shadow cards and suddenly it is possible to have the entire encounter deck be locked in shadowcard-mode and thus no cards to reveal during the quest phase.\n\n \n\nWould this be possible? Has it already been thought of and discussed? (again we stay out of discussions about quests we haven´t beaten yet) Is there indeed anything really preventing it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/?do=findComment&comment=2086280","commentId":2086280,"userName":"Kakita Shiro","timestamp":1457199109,"content":"Totally possible. People have built decks specifically to exploit Forest Snare in this scencario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/?do=findComment&comment=2086287","commentId":2086287,"userName":"GrandSpleen","timestamp":1457199801,"content":"You also need Favor of the Valar to make sure you don't all instantly threat out on stage 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/?do=findComment&comment=2086294","commentId":2086294,"userName":"Nerdmeister","timestamp":1457200030,"content":"> You also need Favor of the Valar to make sure you don't all instantly threat out on stage 2.\n\nActually we never made it to stage 2 and we don´t do spoilers :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nGood to know this is a possibility... I do try to avoid munchkiny decks but at this point we really just want to get it done"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204623-werewolf-of-angmar-is-my-friend/?do=findComment&comment=2086377","commentId":2086377,"userName":"Nickpes","timestamp":1457204977,"content":"You might don't do spoilers, but do not try this with high threat before going to stage two ... better kille the werewolf before you progress"}]}