{"url":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/","title":"Poll: Which quests are the most fun for 3-4 Players?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2086415","commentId":2086415,"userName":"Kjeld","timestamp":1457207373,"content":"Although we recently had a quest championship here on the forums, I don't think it was very useful for deciding what quest(s) to play when you get three to four players together at the table. For some of us (maybe most of us), it is an uncommon occurrence to get a group together for a game, and it would be nice not to muck up these rare opportunities by choosing a lousy quest to play!\n\n \n\nThus, the current poll:\n\n \n\nWhich quests are the most fun for 3-4 Players?\n\n \n\nName your top five, in order. If you can't get to five, list as many as you can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2086420","commentId":2086420,"userName":"John Constantine","timestamp":1457207812,"content":"Define \"fun\". Different people put different meanings into this word.\n\nEdited March 5, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2086446","commentId":2086446,"userName":"Mndela","timestamp":1457209333,"content":"For some people fun is = easy quests; for some people fun is = insane hard quests ^^\n\n \n\nOne of my favourite quest in 4 players is:\n\nAnduin nightmare\n\n7th level\n\nReturn to Mirkwood\n\nFoundations of Stone\n\nAssault on Osgiliath\n\nTo Catch an Orc\n\nBreaking of the Fellowship"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2086683","commentId":2086683,"userName":"Teamjimby","timestamp":1457223341,"content":"Split staging areas shine with more players, so Foundations of Stone, Escape from Mt Gram, and Breaking of the Fellowship are all good.   I've enjoyed my 4p games of Helm's Deep because it's quite challenging and epic.  Similarly, 4p Battle of 5 Armies is great.  Also, all of the POD quests are great with 3-4p because they were designed for it.\n\nOther quests I like with 3-4 are:\n\n7th Level\n\nFords of Isen\n\nThree Trials\n\nEncounter at Amon Dim (dead villagers can pile up in 4p)\n\nTreachery of Rhudaur\n\nAnything from Grey Havens\n\n \n\nI think the better question is which quests should you not play 4 player, because there are quite a few that are insane.  I would avoid:\n\nDruadan Forest (Archery 40 on the first turn is possible)\n\nAnything with the Mordor elite encounter set (Master's Malice, Orc Vanguard, Power of Mordor can all be game enders)\n\nShadow of the Past (soooo many hide tests, and if you fail you might get 4 nazgul on you).\n\nWastes of Eriador (the never-ending night)\n\nBattle of Carn Dum (gg wp)\n\nSteward's Fear (too many locations)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2087841","commentId":2087841,"userName":"Hannibal_pjv","timestamp":1457303448,"content":"Branching Path?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2090295","commentId":2090295,"userName":"Bellator Sardel","timestamp":1457420159,"content":"Gotta agree with Teamjimby.  Escape from Mount Gram, Three Trials, and Breaking of the Fellowship are all great in four player, and the Grey Havens quests have all been good with 2-4 players.\n\n \n\nIf I had to put them in order:\n\n1. Breaking of the Fellowship (I'm a sucker for anything from Campaign mode.)\n\n2. The Fate of Numenor (The Lost Island mechanic is too cool.  I'm definitely looking forward to more of it.)\n\n3. Escape from Mount Gram (A radically different play experience from most quests.)\n\n4. Voyage Across Belegaer (Boats!)\n\n5. Three Trials (A nice build as the quest progresses.)\n\nHonorable mention: Raid on the Grey Havens (The burning mechanic kinda puts a clock on you, pushing the game a little faster than I care for usually)\n\n \n\nI'll also throw in Journey Down the Anduin.  It has a variety of effects and enemies which is nice, and it doesn't really have many special rules.  I think it makes for a great relaxed game, particularly with people that don't play super often and are just looking for some simple LotR-themed fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2091710","commentId":2091710,"userName":"FeloniusBard","timestamp":1457478992,"content":"I almost play exclusively 3 and 4 player, so I don't have much room for comparison for some these for 2 players or solo, but my group's favorite 3-4 player scenarios, in no particular order: \n\n \n\n * Battle of Five Armies -- Really liked this one, really had an \"epic\" feeling.\n * Wastes of Eriador -- Super fun quest if you enjoy strategic play. A bit on the long side, and hard, but fun.\n * Intruders in Chetwood -- A pretty \"straight up\" quest, nothing fancy, but a fun one with a nice balance of challenge. \n * Knife in the Dark -- Fun more for the thematics than for the difficulty, but still a blast. \n * Flight to the Ford -- Same as Knife in the Dark.\n * The Ring Goes South -- This is a great, fun, balanced quest, possibly my favorite quest in the game other than Knife in the Dark. It's just tough enough to make you think every step of the way.\n * Redhorn Gate -- Fairly easy if you build your decks for it, but fun.\n * Foundations of Stone -- It's almost impossible to lose, as long as you accept that one of your players is probably going to die when their staging area gets split. \n * Nightmare Journey Down the Anduin -- We have yet to beat this one in 4 tries, but it's fun trying. \n * The Three Trials -- This was really fun for the theme, not super difficult with 4 players.  \n * Steward's Fear --- You've got to get insanely lucky to beat this scenario with four players, but even when you lose it's a blast to play.\n * Return to Mirkwood --- This was a really fun game. We beat it on our first try, but all four of us had AT LEAST 47 threat when we won.\n * The entire Treachery of Saruman Saga expansion is great with four players. \n\n \n\nScenarios that just didn't seem to work with 4 players: \n\n \n\n * Fog on the Barrow Downs -- I don't recall why exactly, but this one always felt like you were behind the eight ball with no real way to get over the hump. I'm trying to remember, maybe it was because there were so many \"surge\" encounter cards?\n * Into Ithilien --- Three different tries across two different sessions, and we never made it past three turns in any of them.\n\n \n\nI just picked up Grey Havens and my group is getting together Thursday, so I may have more to report in a few days.\n\nEdited March 8, 2016 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204633-poll-which-quests-are-the-most-fun-for-3-4-players/?do=findComment&comment=2091959","commentId":2091959,"userName":"divinityofnumber","timestamp":1457492921,"content":"A few that I really like:\n\n \n\nThe Steward's Fear\n\nEncounter at Amon Din\n\nMurder at the Prancing Pony\n\nFog on the Barrow Downs\n\nFoundations of Stone\n\nThe Watcher in the Water (Dwarrowdelf cycle)\n\nCore Set nightmare decks\n\nKhazad-dum nightmare decks\n\n \n\nThe Fellowship scenarios have been really awesome. The designers know and expect that they'll be played heavily with 3-4 players, and my suspicion would be that those scenarios get a lot of 3-4 player playtesting. "}]}