{"url":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/","title":"Cirdan and Dawn Star + card draw timing in general","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090285","commentId":2090285,"userName":"donkler","timestamp":1457418723,"content":"When a card says to draw cards \"at the beginning of the resource phase\" like Cirdan the Shipwright, does that always happen at the same time as effects like Dawn Star, that just instruct you draw a card during the resource phase without specifically using the word \"beginning\"?\n\n \n\nSo if  you had Cirdan and Dawn Star, at the start of the resource phase do you draw 3 cards and then discard 1, or do you draw 2, discard 1 (for Cirdan), and then draw the extra one for Dawn Star?\n\n \n\nI am leaning towards the easier ruling where everything is always drawn at once, but it seems weird they would word Dawn Star's ability without specifying the beginning, when newer cards like Cirdan and Erestor are all worded this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090313","commentId":2090313,"userName":"NathanH","timestamp":1457422382,"content":"All the \"additional cards\" should be drawn at the same time you draw your usual 1 card.\n\n \n\nSource: this is the only sensible way it could work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090509","commentId":2090509,"userName":"Nerdmeister","timestamp":1457438368,"content":"Don´t have the cards in front of me but the Cardgamedb version of Dawn Star does specify \"at the beginning of the resource phase\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090706","commentId":2090706,"userName":"GrandSpleen","timestamp":1457447254,"content":"> Don´t have the cards in front of me but the Cardgamedb version of Dawn Star does specify \"at the beginning of the resource phase\"\n\n \n\nThe person who typed in the card text at Cardgamedb added \"beginning,\" but the card image itself does not have that text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090747","commentId":2090747,"userName":"cmabr002","timestamp":1457448382,"content":"> All the \"additional cards\" should be drawn at the same time you draw your usual 1 card.\n> \n>  \n> \n> Source: this is the only sensible way it could work.\n\n \n\nI'm inclined to agree with you, but when I asked Caleb about which effects in the back of the rulebook in the timing structure occur \"at the beginning\" or not at the beginning of their phase, I was told about all but one of the effects.  I will list them here...\n\n \n\n1. Resource Phase: Drawing cards and gaining resources both occur at the beginning of the phase\n\n2. Travel Phase: Deciding whether to travel or not does not happen at the beginning of the travel phase\n\n3. Encounter Phase: Have not received an answer as to whether or not choosing to optionally engage happens at the beginning or not.\n\n4. Combat Phase: Dealing shadows cards happens at the beginning of the phase\n\n5.  Refresh Phase: Refreshing all cards, raising threat, and passing first player token do not happen at the beginning of the refresh phase.\n\n \n\nJustifications:\n\n \n\n1. Developers said so.\n\n2. Says \"During\" in the rule book.\n\n3. N/A\n\n4. Core Set Rule book explicitly states this happens at the beginning of the combat phase\n\n5. Says \"During\" in the rule book.\n\n \n\nSo, if we take this ruling about the word \"during\" then that would mean that Bilbo, Amarthiul, and Dawn Star seem to get their benefit (card or resource) at a timing different than the effects that happen \"at the beginning\" of the Resource Phase.\n\n \n\nNow, this is just dumb and was not the intent of what Caleb's ruling was in my opinion.  Simply put, I think the justifications for why #2 and #5 do not happen at the beginning is in no way related to the use of the word \"during\" but instead is simply because the developers said so and the word \"during\" may or may not happen \"at the beginning\".\n\n \n\nSo basically, in my opinion, the word \"during\" in Dawn Star's text could mean that it happens at the beginning or it could mean that it does not happen at the beginning and we sadly need the developers to clarify in order to ensure we are doing it correctly even if I believe we can assume it is supposed to all happen at once.\n\nEdited September 8, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204887-cirdan-and-dawn-star-card-draw-timing-in-general/?do=findComment&comment=2090976","commentId":2090976,"userName":"donkler","timestamp":1457455246,"content":"I probably would not have questioned this if not for my experience with the X-Wing rules where the \"beginning\" of phase specification is important for certain special abilities. I could not help but wonder if this was a similar distinction. LotR has a much finer grained turn structure with the numerous phases though so it would make sense if the distinction is unnecessary.\n\n \n\n \n\nI'll also point out that there are both potential positive and negative implications for either ruling. Like Bilbo Baggins hero would potentially be good for triggering encounter cards like Iron Shackles or extremely bad for some of those Dunland or Saruman encounter cards that punish you for whenever you draw cards."}]}