{"url":"https://community.fantasyflightgames.com/topic/204990-engagement-question/","title":"Engagement question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092153","commentId":2092153,"userName":"Kako K.","timestamp":1457508857,"content":"Hi guys,\n\nI´ve been playing this great game for a while now. But suddenly I started wondering if I was doing something wrong:\n\nI play the german version, so the wording might not be exactly the same. Is there a difference between the following text in terms of rules?\n\n- \"When the enemy engages you trigger his ability\" (Blue Pippin for example or different enemies)\n\n- \"When you engage an enemy... (Green Pippin for example)\"\n\n \n\nI play it like this:\n\nWhen I chose an enemy from the staging area, I engage him. When I didn´t chose him but he comes to me anyway, because my thread is higher than his, he engages me.\n\n \n\nThis sounds logic to me but while playing a hobbit deck for example most of the time you engage enemies and by doing so most of the enemyskills wont hurt you. That seems a little bit too easy to me.\n\n \n\nThanks for your help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092156","commentId":2092156,"userName":"NathanH","timestamp":1457509347,"content":"The two phrases mean the same thing. At any point where an enemy has moved from the state \"not engaged with you\" to the state \"engaged with you\", then you have engaged that enemy and that enemy has engaged you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092158","commentId":2092158,"userName":"Teamjimby","timestamp":1457510050,"content":"Any time an enemy goes from not engaged to engaged, that triggers all engaged effects, no matter what caused it.  This is also in the FAQ.\n\n \n\n(1.49) Engaging enemies vs being engaged\nWhen a player engages an enemy, that enemy has also\nengaged him, and when an enemy engages a player, that\nplayer has also engaged that enemy. There is no difference\nbetween engaging an enemy and being engaged by an\nenemy. Effects that trigger “after an enemy engages you”\nwill trigger at the same time as effects that trigger “after\nyou engage an enemy.”"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092212","commentId":2092212,"userName":"PsychoRocka","timestamp":1457515469,"content":"Inclusive of when it is taken straight from the encounter deck or discard pile and put into play directly engaged with you.\n\nSo any time any enemy goes from not engaged to engaged whether it is from the staging area or anywhere else!\n\nEdited March 9, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092243","commentId":2092243,"userName":"Kako K.","timestamp":1457519493,"content":"Thank you guys alot! Mh.. that means I have to replay all those adventures again... At least some more fun ahead ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nSo for example Sams skill also triggers when, lets say during the flight to the ford (2) I put a witch king from outside the game into play directly engaged with me!?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092268","commentId":2092268,"userName":"Nerdmeister","timestamp":1457522204,"content":"Correct... though be also aware that if an enemy is in the staging area but \"considered to be engaged...\" then it has at no point actually engaged you and thus will not trigger any abilities or responses"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092861","commentId":2092861,"userName":"Slothgodfather","timestamp":1457544934,"content":"@Nerdmeister - are you sure that's correct?   As soon as it is considered to be engaged with you, that is a clear change in game-state from you not being engaged with that enemy to you being engaged with that enemy.  Why wouldn't you be able to react to it?   Is there a ruling on that?\n\nEdited March 9, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092878","commentId":2092878,"userName":"Teamjimby","timestamp":1457545384,"content":"(1.50) “Considered to be engaged” vs actual engagement\nAn enemy that does not leave the staging area but is\nconsidered to be engaged with a player does not actually\nengage that player, nor does that player engage it. In order\nfor a player to engage an enemy, the enemy card must\nphysically enter his play area.\n\nEdited March 9, 2016 by Teamjimby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/204990-engagement-question/?do=findComment&comment=2092884","commentId":2092884,"userName":"Slothgodfather","timestamp":1457545626,"content":"Thanks! I guess I'm going to have to go reread that thing again...  forgotten too much of it apparently.\n\nEdited March 9, 2016 by Slothgodfather"}]}