{"url":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/","title":"Ruins of Belegost - Flooded Hall","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/?do=findComment&comment=2095502","commentId":2095502,"userName":"JYoder","timestamp":1457660999,"content":"Flooded Hall has...\n\n \n\nForced: When resolving the Discover keyword on Flooded Hall, the first player reveals an additional looked at Hazard card for each other player in the game.\n\n \n\nWhat exactly does this mean? The card has \"Discover 4\" so you look at the top 4 cards. But the forced affect... do I keep revealing additional cards until X-1 extra Hazard cards show up? (X being # of players.) Of those additional cards that aren't Hazards, if any are Loot, can they be selected for the Loot card? Or are any extra non-Hazard cards discarded? Or are they shuffled back in the deck because they aren't considered revealed unless they were a Hazard?\n\n \n\nSeems overly confusing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/?do=findComment&comment=2095526","commentId":2095526,"userName":"JYoder","timestamp":1457661742,"content":" \n\nNever mind. After re-reading it 3 more times, I now understand -- reveal is different than looked at, so it can potentially reveal more than 1 Hazard of the \"looked at\" cards.\n\n \n\nSomeone can delete this thread if they have the authority.\n\nEdited March 11, 2016 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/?do=findComment&comment=2095527","commentId":2095527,"userName":"PsychoRocka","timestamp":1457661783,"content":"nah so essentially if you are playing 1 player, discover 4 and put one hazard and one loot card into play.\n\nif you are playing 2 player, discover 4 and put two hazards and one loot card into play. \n\n3 player, discover 4, put 3 hazards into play and one loot.\n\n4 player, discover 4, put 4 hazards into play and one loot.\n\n \n\nSo essentially for each additional player you reveal an additional hazard but only from the 4 looked at cards.\n\nSo essentially only if there actually are additional hazards in those four cards you look at will this forced effect do anything.\n\nYou definitely don't reveal more than 4 cards it just forces you to reveal multiple hazards from those 4 cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/?do=findComment&comment=2095552","commentId":2095552,"userName":"PsychoRocka","timestamp":1457662985,"content":"Haha nevermind you figured it out =) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/205163-ruins-of-belegost-flooded-hall/?do=findComment&comment=2117421","commentId":2117421,"userName":"JYoder","timestamp":1458648737,"content":"So if a hero with Loot card is destroyed, does the Loot card go into the encounter discard pile?\n\nEdited March 22, 2016 by JYoder"}]}