{"url":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/","title":"A question regarding activation limits","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097418","commentId":2097418,"userName":"3dfiend","timestamp":1457755899,"content":"Hello, just a couple of quick questions regarding the rulings on how many times cards with a limit of per round or per phase can be played. The specific cards I am going to be referring to will be Heavy Stroke, Protector of Lorien, and Desperate Alliance. Each of the cards have a limit placed on how many times they can be played/activated per phase. As I understood the rules for Protector of Lorien, if you had 2 copies of the card on 2 different heroes you could discard 6 cards in one phase (3 to each copy of the card). So in regards to Heavy Stroke if a dwarf dealt 2 damage to an enemy, could each player play a copy of Heavy stroke as a response in order to deal an additional 8 damage (in a 4 player game)? In the rules it says that the limitation on activations is per card. Does that mean each instance of that card, or the name of that specific card? Meaning, am I playing Protector of Lorien wrong by activating it more than 3 times per phase even though I have more than one in play? Is the restriction per card PER PLAYER, or just per card period? The real reason for the question is because of the card Desperate Alliance. Our group was trying to figure out if you could play it on a Hero and give it to someone else, then have that player play Desperate Alliance on that same Hero and give it back to its original owner, then at the end of the phase have the 1st player stack the returns of the Hero such that the 2nd player gains a permanent 4th Hero? It has a limit of 1 per phase, so it became unclear as to if we have been playing other cards wrong, or did the trick work as we thought it did? Sorry for the long post, but I thought framing the question might help explain why or why not these interactions were being played correctly. Any help would be much appreciated, Thank you.\n\n-3dfiend"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097472","commentId":2097472,"userName":"Teamjimby","timestamp":1457760969,"content":"In general, limits are per card per player.  So 2 protectors of Lorien would give you up to 6 activations, and multiple people could play Heavy Stroke off of the same attack.\n\n \n\nCaleb (the designer) has specifically commented [https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?p=1664213] on Desperate Alliance that the players as a group are only allowed to play one per phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097488","commentId":2097488,"userName":"3dfiend","timestamp":1457762415,"content":"> In general, limits are per card per player.  So 2 protectors of Lorien would give you up to 6 activations, and multiple people could play Heavy Stroke off of the same attack.\n> \n>  \n> \n> Caleb (the designer) has specifically commented [https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/?p=1664213] on Desperate Alliance that the players as a group are only allowed to play one per phase.\n\nAwesome, thanks for the link. This clarifies a lot. So now another thought I had while typing up this reply was: What if the original player who played Desperate Alliance dies during the phase due to Threat elimination? Does the Hero die at the end of the phase because he tries to go back to a dead player, or does he stay with the new owner?\n\n-3dfiend"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097518","commentId":2097518,"userName":"Teamjimby","timestamp":1457767188,"content":"I can't find an official ruling on this.  But, I know that you aren't eliminated if your other heroes die while your last hero is under someone else's control.  So I think for the purposes of player elimination, you are still tied to your heroes.  Therefore, threating out should discard all of your heroes from the game, including a hero that is under someone else's control via Desperate Alliance. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097803","commentId":2097803,"userName":"PocketWraith","timestamp":1457796896,"content":"> In general, limits are per card per player.  So 2 protectors of Lorien would give you up to 6 activations, and multiple people could play Heavy Stroke off of the same attack.\n\nPretty sure this is not the case - limits are simply per card. If a card somehow changes control mid-phase it could still only be activated once (or whatever its limit is) total, not once each. On those grounds I would guess that Heavy Stroke is intended to be like Desperate Alliance, the players as a group can only play one copy per phase otherwise the restriction doesn't make sense in the context of the usual rules about such limits.\n\nThe only limits that are by player are 'Limit once per game', and they're purely by player, not by card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097869","commentId":2097869,"userName":"Teamjimby","timestamp":1457800857,"content":"Yeah, I'm not totally sure about Heavy Stroke tbh.  The people in the thread I linked seemed convinced that Caleb's comment only applied to Desperate Alliance, so that's what I went with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097873","commentId":2097873,"userName":"GrandSpleen","timestamp":1457801055,"content":"The thread that Teamjimby linked asks the same questions but it didn't get asked offically.  Desperate Alliance is limit once per phase by card title: no other copies of that card (or recurrence of the same card) can be played within that same phase.  In Caleb's ruling, it did look to me like he was trying to limit the power of Desperate Alliance, rather than make a statement about the \"limit\" wording.\n\n \n\nNow, this is nitpicky, but Desperate Alliance says \"Limit 1 per phase,\" [not: \"Limit 1 time per phase\"] whereas Heavy Stroke says \"Limit once per phase.\"  It could be that we are meant to understand \"Limit 1\" as \"Limit 1 copy of this card per players as a group,\" while \"Limit once\" means \"Limit one time for this copy of the card.\" \n\n \n\nThe limit on Heavy Stroke is weird, since it is an event and you'd have to recur it to play it again.  Hama is your best way to recur it, and he was released just before Heavy Stroke, so it does seem pretty possible that the developers specifically had Hama in mind when they wrote this limit.\n\n \n\nI write all this because I really don't think \"Limit three times per phase,\" \"Limit two times per phase,\" \"Limit once per phase\" are meant to apply to all copies of the card in a four-player game.  If that were the case, Protector of Lorien could only be triggered 3 times among 4 players.  Elven Spear would have the same problem.  You could only use one Rider of the Mark per round, even if you have 12 in play.  Longbeard Sentry could only be used once per phase, even if there are a bunch of them in play.\n\n \n\nBasically I interpret Heavy Stroke's \"Limit once per phase\" as a way to prevent it from being recurred by Hama (it's not even that great of a card anyway, I think they were just trying to be careful).  Other than that, the text is pretty meaningless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097878","commentId":2097878,"userName":"PocketWraith","timestamp":1457801536,"content":"The thing is though, we've had rulings on this subject to the effect that if something leaves play and then comes back, the game doesn't 'remember' that it's the same copy (So if e.g. you trigger Beravor, then she dies and you bring her back with Fortune or Fate you can trigger her a second time that round because as far as the gamestate is concerned it's an entirely new and different Beravor). This would apply to any event recursion as well and thus make the restriction (and any other similar restrictions on event cards) completely meaningless unless it's supposed to be like Desperate Alliance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2097914","commentId":2097914,"userName":"GrandSpleen","timestamp":1457802980,"content":"Seems to be a problem then... I'll go ahead and submit a rules question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2098341","commentId":2098341,"userName":"3dfiend","timestamp":1457838123,"content":"> I can't find an official ruling on this.  But, I know that you aren't eliminated if your other heroes die while your last hero is under someone else's control.  So I think for the purposes of player elimination, you are still tied to your heroes.  Therefore, threating out should discard all of your heroes from the game, including a hero that is under someone else's control via Desperate Alliance. \n\nI dont think this part would be correct if the rules are the same as attachments or allies given to other players. When you die you only take the things you control at the time with you, the other players have control of anything you played on them or gave to them. I would think that the Hero would stay in play if the original owner threated out, but I was unsure about Desperate Alliance's trigger at the end of the phase.\n\n-3dfiend"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2098423","commentId":2098423,"userName":"Teamjimby","timestamp":1457845279,"content":"It's conceivable that the hero would stay, but doubt that was an intended possibility. Grandspleen sent in a question to Caleb, so we'll get an official ruling probably on Monday."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2098481","commentId":2098481,"userName":"GrandSpleen","timestamp":1457850887,"content":"I sent a question about limits though, not about what happens to a Desperate Alliance-d hero when their owner is eliminated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2098839","commentId":2098839,"userName":"sappidus","timestamp":1457883731,"content":"> I sent a question about limits though, not about what happens to a Desperate Alliance-d hero when their owner is eliminated.\n\n \n\n \n\nI'm pretty sure someone in the CotR Discord chat asked Caleb this one directly, and the response was that at the end of the phase the hero returns to its owner and is immediately discarded. As entertaining as it would be to get one player to control six heroes (seven with Sword-thain!), this is probably the sane ruling. (Don't argue it too hard! I don't want Desperate Alliance getting nerfed. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\nEdited March 13, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2103850","commentId":2103850,"userName":"GrandSpleen","timestamp":1458094524,"content":"An answer today:\n\n \n\n\"Item 1.51 in the FAQ addresses “Limitations on card effects” as follows:\n\nWhen a card with a trigger effect has a limit on the number of times that effect can be triggered (i.e. ‘Once per round,’ ‘Limit 3 times per phase,’ etc.), the limit is specific to that card. However, if a card has a limit of ‘once per game,’ that limitation is specific to the player who triggered it.\n\nThis ruling is pretty straight forward, so I think it’s the wording on Desperate Alliance and Heavy Stroke that creates the confusion. The “Limit 1 per phase” on Desperate Alliance was meant to limit the number of times a group could play the event each phase. Unfortunately, it doesn’t really do that the way it is printed. It should have been written: “No more than 1 copy of Desperate Alliance can be played each phase.” \nThe same is true for Heavy Stroke: “No more than 1 copy of Heavy Stroke can be played each phase” would be the correct way to limit its use to once per phase, and that is how it should be played.\nCheers,\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2104433","commentId":2104433,"userName":"cmabr002","timestamp":1458131146,"content":"> An answer today:\n> \n>  \n> \n> \"Item 1.51 in the FAQ addresses “Limitations on card effects” as follows:\n> \n> When a card with a trigger effect has a limit on the number of times that effect can be triggered (i.e. ‘Once per round,’ ‘Limit 3 times per phase,’ etc.), the limit is specific to that card. However, if a card has a limit of ‘once per game,’ that limitation is specific to the player who triggered it.\n> \n> This ruling is pretty straight forward, so I think it’s the wording on Desperate Alliance and Heavy Stroke that creates the confusion. The “Limit 1 per phase” on Desperate Alliance was meant to limit the number of times a group could play the event each phase. Unfortunately, it doesn’t really do that the way it is printed. It should have been written: “No more than 1 copy of Desperate Alliance can be played each phase.” \n> \n> The same is true for Heavy Stroke: “No more than 1 copy of Heavy Stroke can be played each phase” would be the correct way to limit its use to once [one copy] per phase, and that is how it should be played.\n> \n> Cheers,\n> \n> Caleb\"\n\n \n\nI'm a bit confused by this ruling.  Desperate alliance says \"Limit 1 [one copy] per phase\" whereas Heavy Stroke says \"Limit once [one time] per phase\". \n\n \n\nDoesn't that make Heavy Stroke more like Protector of Lorien and would fall in line with the bold portion of the ruling quoted?  I will play as if Heavy Stroke is only supposed to refer to one copy due to the ruling, but I honestly think that this didn't need to be limited as \"once\" by definition means \"one time\" not \"one copy\".\n\n \n\nFor example, none of these effects can be used by multiple players (or even a single player with multiple copies) if this ruling is correct:\n\n \n\n1. Longbeard Sentry\n\n2. Gondorian Fire\n\n3. Blood of Numenor\n\n4. Isengard Messenger\n\n \n\nEdit: I see PocketWraiths comment now.  Heavy Stroke was simply incorrectly worded and should have the text \"Limit 1 per phase\" instead of \"once\".  Essentially, any event that says \"once per X\" should be worded to say \"one per X\" since \"once per X\" is entirely meaningless with respect to events.\n\nEdited March 16, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2104515","commentId":2104515,"userName":"GrandSpleen","timestamp":1458134153,"content":"It means you should treat Heavy Stroke as errata'd."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2104750","commentId":2104750,"userName":"Slothgodfather","timestamp":1458141139,"content":"> It means you should treat Heavy Stroke as errata'd.\n\n \n\nwithout errata?!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205277-a-question-regarding-activation-limits/?do=findComment&comment=2104901","commentId":2104901,"userName":"GrandSpleen","timestamp":1458144079,"content":"That's basically what he said...\n\n \n\n\"Unfortunately, it doesn’t really do that the way it is printed\"  \n\n \n\nand\n\n \n\n\"'No more than 1 copy of Heavy Stroke can be played each phase' would be the correct way to limit its use to once per phase, and that is how it should be played.\""}]}