{"url":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/","title":"Voice of Isengard/Ringmaker cycle theme question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2100406","commentId":2100406,"userName":"tnewman772","timestamp":1457972813,"content":"We are just now getting to these quests in our household (we play with two players) as we are purchasing all the expansions in the original order in which they were released. We are attempting to play thematically, but we are having trouble figuring out who the designers were intending to go on these quests. We originally started in the Voice of Isengard quests with Eomer/Eowyn/Mablung and Aragorn/Erkenbrand/Imrahil. However, after the third quest in this series, the heroes winter in Isengard and Saruman says he knows they wish to return north to Rivendell where they have been assisting Gandalf, but he has other tasks for them. Why would Rohan heroes be based out of Rivendell? Also, according to the Tale of Years people, who have done some nice work laying out the dates and available characters for each quest (https://drive.google...FdjdHp1T1U/view [https://drive.google.com/file/d/0B97EGklBluOnUWpxeFdjdHp1T1U/view]), at the time these quests take place, Eowyn is about 5 years old and Eomer is 9. Well, that seems odd, unless they got the dates wrong? So then we switched to elf decks for the Ring-Maker cycle, but they do not really fit thematically either. Galadriel/Glorfindel/Legolas and Elrond/Celeborn/Haldir get captured by the hill men? Really? The Dunedain seem most fitting, but we don’t have those cards yet because we are doing the expansions in the order they were released. Looking at the player cards that came with the expansion, we received Rohan, ents, and Noldor/Silvan characters, which is why we chose the decks we have used so far. It just doesn't feel like it fits the theme, though, and it is troubling. We typically like to play through the whole cycle with the same heroes, but we still can’t figure out who would be on these quests who is not a child at this time and would be based in Rivendell while pursuing Gandalf’s machinations, as Saruman relates. Can anyone assist my understanding? What was the intent of the designers when they were writing these quests?\n\n\n \n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2100455","commentId":2100455,"userName":"John Constantine","timestamp":1457973965,"content":"I think their understanding was that players will not throw away heroes just because of their potential age or likeness to be captured by the men of Dunland during those quests. It's a card game, not an accurate hystorical interpretaion of the middle-earth. Things happen there that never would, and it's completely fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2100795","commentId":2100795,"userName":"Network57","timestamp":1457981729,"content":"I totally get wanting the deck to thematically fit the cycle. That's almost always how I play. But it's impossible without stretching things a little bit. For Khazad-dum and Dwarrowdelf, your heroes discover the Balrog and the fate of Balin before the Fellowship does. Seems strange that would happen and Gandalf not know about it. The thing is to choose what fits best, not perfectly. I take Thorin into the Mines even though he was dead when that cycle takes place. Eowyn helps Hunt for Gollum even though she was a child. It still doesn't seem as thematically broken to me as a bunch of Ents on ponies, or eagles with bows and arrows, or Faramir delivering a message to Faramir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2101303","commentId":2101303,"userName":"TwiceBorn","timestamp":1457995400,"content":"Think of the LotR LCG as an alternate reality version of Middle-Earth (a \"what if\" kind of universe), and that should stop the thematic/historical inconsistencies from driving you nuts. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2102244","commentId":2102244,"userName":"Raven1015","timestamp":1458052082,"content":"Placing the exact year of any of these cycles is somewhat tricky, but if I'm remembering correctly, the Against the Shadow cycle story flows directly into the Ring-maker story, which flows into the Angmar story and then the Grey Havens story. Against the Shadow does take place a year or two before the war, so all of the recent cycles (including Ring-maker) should be taking place around the same time, which is roughly a year or two before the war starts. So people like Eowyn or Eomer should be fine if that kind of thematic incongruity bothers you.\n\nEdited March 15, 2016 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2104215","commentId":2104215,"userName":"Daft Blazer","timestamp":1458117726,"content":"So you only put Steward of Gondor on Denethor?\n\nYou don't put two Rohan Warhorses on one hero ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2109316","commentId":2109316,"userName":"tnewman772","timestamp":1458257460,"content":"Thanks for all the replies! Of course it's an alternate universe and we take liberties with the characters and events, but usually we can at least guess what the designers had in mind. But in this cycle, we were baffled and it was niggling at us. We are excited about getting some Ent cards, but there just hasn't been anywhere sensible to use them yet, so we are hoping that comes in a future scenario. We have only just finished the Three Trials and don't play that often, because my daughter is in college so we have to wait for the times when she and I can be in the same location to play.\n\n \n\nRaven1015, the Tale of Years guide that we have been going by (which is a bit dated at this point but still works for where we are) places the Ring Maker cycle before the Hunt for Gollum. They have it around 3000, with the Hunt for Gollum in 3017 and Against the Shadow in 3018, just before the war starts. I'll have to investigate my lore at some point to see if this is reasonable.\n\n \n\nDaft Blazer, of course a single hero can have two warhorses. People did that all the time in practice. That's what a string of remounts is for! And Steward of Gondor is too good to not use on other characters. We do laugh a lot at who ends up being Steward and who has the Horn of Gondor.\n\n \n\nWe aren't fanatics, but the theme and narrative is what makes it so fun for my daughter and I. My son likes the deck building and sometimes gets frustrated when we limit what he can and can't put in a deck. And sometimes you just have to look the other way and include cards that are silly thematically (Miner of the Iron Hills, anyone?) when they are needed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2109797","commentId":2109797,"userName":"DukeWellington","timestamp":1458280074,"content":"I think it is a legitimate line of discussion. The heroes (which is obviously just a generic term for the player controlled characters) are just wandering about, helping Gandalf. This is similar to how Aragorn is described in the books as helping Gandalf when they hunted for Gollum. The reason they are based out of Rivendell is because that is where their travels took them. So, they could be Rohan or Gondor. Obviosly, a dwarf is more of a stretch, but a dwarf is possible as well. The main reason we use Eowyn or a similar character, is because the lifespan of humans prohibits them from playing major roles in events separates by too much time. We would have to have a ton of non Tolkien original characters. You could think of it as a character close to Eowyn from the proper time frame."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2109834","commentId":2109834,"userName":"banania","timestamp":1458282451,"content":"Well, being the one who placed the Ring Maker in 3000, I can tell you it's a bit arbitrary. I just found it thematically matched a sentence in the chronology of Professor Tolkien saying \"Saruman is ensnared by Sauron and become a traitor to the Council\". If figured the events of RM would happen before this, but that's debatable, considering Saruman's attitude in the RM."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2110528","commentId":2110528,"userName":"Raven1015","timestamp":1458310980,"content":">  \n> \n>  \n> \n> Raven1015, the Tale of Years guide that we have been going by (which is a bit dated at this point but still works for where we are) places the Ring Maker cycle before the Hunt for Gollum. They have it around 3000, with the Hunt for Gollum in 3017 and Against the Shadow in 3018, just before the war starts. I'll have to investigate my lore at some point to see if this is reasonable.\n> \n>  \n> \n>  \n\n \n\nLet me expand a bit more. Against the Shadow is placed around 3017/3018, which seems right, because it's dealing with events that we know happen roughly in that time period. If you look at the story inserts for Against the Shadow, Ring-maker, Angmar Awakened, and Dream-chaser, they detail a progression of travel by the same heroes, starting out in Gondor, then traveling up to Rohan and taking on Saruman's tasks, then up to Eriador, and finally to the Grey Havens. This would imply that they are taking place in chronological order, meaning that Ring-maker would be taking place somewhere in 3017/3018 as well.\n\n \n\nThis could work in terms of story as it seems pretty clear that Saruman is already a traitor during the events of the Ring-maker, when he is basically manipulating the heroes to accomplish some nefarious ends, but he is not revealed as a traitor until he takes Gandalf prisoner in July 3018. It seems logical that Saruman would have made his ring (the focus of the cycle) just before the events of the war, so this fits as well.\n\n \n\nAt this point, the main incongruity is just fitting the events of all the cycles in what is a pretty short period, but that's where suspension of disbelief comes in.\n\nEdited March 18, 2016 by Raven1015"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2113961","commentId":2113961,"userName":"tnewman772","timestamp":1458492438,"content":"Ah, I had forgotten that at the end of Against the Shadow, the heroes rode off toward the Gap of Rohan, making it continuous with Voice of Isengard. That makes it even more nonsensical that it would be a party of elves. We used Gondor decks for Against the Shadow and then laughed when one of the narratives described reporting back to Boromir, since Boromir was one of our heroes. Doh! Ah well. We enjoy trying to make our decks fit in with the story. If we ever manage to catch up and own all of the expansions, we will play through the entire set in one giant campaign, and work out who our heroes should be at each stage. Something to look forward to!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2113999","commentId":2113999,"userName":"TwiceBorn","timestamp":1458493811,"content":"Yeah, I must admit that it annoys me when the flavour text inserts and quest cards refer to particular characters in such a way that it would make it illogical for them to be heroes or allies in the quest (i.e., Faramir and Boromir in particular in AtS... have yet to play beyond that)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2114028","commentId":2114028,"userName":"Authraw","timestamp":1458494928,"content":"This is an interesting question. I've been thinking about how one might be able to make the story text make perfect sense with the hero selections all along the way.\n\n \n\nThe fact that the story suggests that it's the same heroes from Heirs of Numenor all the way through The Grey Havens is problematic because there are only a few heroes I can imagine actually remaining for that entire journey: Aragorn, Gandalf, maybe some of the FFG-created heroes. Furthermore, it would probably get boring trying to use the same handful of heroes for 36+ quests in a row.\n\n \n\nI think you might be able to resolve the problem by replacing one or two heroes every few quests, so that it's still the \"same\" heroes throughout (in the same way that Theseus' ship [https://en.wikipedia.org/wiki/Ship_of_Theseus] remains Theseus' ship) but you can make continual thematic adjustments as you go.\n\nThat way you can bring in characters like Eowyn and Theoden somewhere in the middle of the Ringmaker cycle, but have them leave the party again by the cycle's conclusion. So long as you don't change everyone at once, you can still use most of your cardpool and maintain the story's continuity at the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2114059","commentId":2114059,"userName":"divinityofnumber","timestamp":1458496128,"content":"I'm going to paste a post that I made in another forum a while back regarding theme:\n\n \n\n \n\nPeople need to be more creative and open-minded with respect to what counts as thematic. The card can represent an essence, not merely the literal name on it. A card can represent a presence, a will, a force, and influence. Many would say that including three heroes that never met in the book(s) is off-theme. But, we can easily see how the actions of those heroes and their narratives intertwined to form the composite that is the beautiful LOTR universe.\n\n \n\nThis comes up a lot in the AGOT LCG as well; \"How can this character combat that character? This character was dead before that character was even born.\" I think that people should not take the cards so literally. The cards represent an essence, a presence, a force that at some time made an impact on the universe in question. True, person X would never have been able to actually fight person Y; but, you can understand how the actions and presence of person X could run up against the essence of person Y.\n\n \n\nThink of the LOTR narrative as a coherent whole, and all of the characters as a sort of symbiosis, a constellation of moving parts, some closer together than others, with the real beauty of the universe dependent on the gestalt. It could be thought of as even more beautiful to play a deck with characters that had little or no contact in the book, thinking of the beauty of their different lives and experiences, but how they both played a specific role in bringing about the climactic events of the overall narrative. It can be beautiful to think of a deck as a collection of unique lives and stories, with the ending to the story dependent on the actions of all of them, to greater and lesser degrees. If you really love the LOTR universe, it can be really cool and beautiful to play a deck and wonder what two characters might have said to each other, had they ever met, or entertain the \"what if's\" in our minds.\n\n \n\nI encourage people to think about things as a whole, and not just say something like, \"Those two never met. This is unthematic.\" -- not saying that anyone on these boards does that, but I have heard people in card-gaming over the years say many such things.\n\n \nEdited March 20, 2016 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2114114","commentId":2114114,"userName":"Authraw","timestamp":1458500534,"content":">  \n> \n> I'm going to paste a post that I made in another forum a while back regarding theme:\n> \n>  \n> \n>  \n> \n> People need to be more creative and open-minded with respect to what counts as thematic. The card can represent an essence, not merely the literal name on it. A card can represent a presence, a will, a force, and influence. Many would say that including three heroes that never met in the book(s) is off-theme. But, we can easily see how the actions of those heroes and their narratives intertwined to form the composite that is the beautiful LOTR universe.\n> \n>  \n> \n> This comes up a lot in the AGOT LCG as well; \"How can this character combat that character? This character was dead before that character was even born.\" I think that people should not take the cards so literally. The cards represent an essence, a presence, a force that at some time made an impact on the universe in question. True, person X would never have been able to actually fight person Y; but, you can understand how the actions and presence of person X could run up against the essence of person Y.\n> \n>  \n> \n> Think of the LOTR narrative as a coherent whole, and all of the characters as a sort of symbiosis, a constellation of moving parts, some closer together than others, with the real beauty of the universe dependent on the gestalt. It could be thought of as even more beautiful to play a deck with characters that had little or no contact in the book, thinking of the beauty of their different lives and experiences, but how they both played a specific role in bringing about the climactic events of the overall narrative. It can be beautiful to think of a deck as a collection of unique lives and stories, with the ending to the story dependent on the actions of all of them, to greater and lesser degrees. If you really love the LOTR universe, it can be really cool and beautiful to play a deck and wonder what two characters might have said to each other, had they ever met, or entertain the \"what if's\" in our minds.\n> \n>  \n> \n> I encourage people to think about things as a whole, and not just say something like, \"Those two never met. This is unthematic.\" -- not saying that anyone on these boards does that, but I have heard people in card-gaming over the years say many such things.\n> \n>  \n> \n>  \n\nThanks for this insight, divinityofnumber. Wall of text incoming!\n\n \n\nI like the idea of thinking of the various characters a little more abstractly. In any game, there is necessarily a layer of abstraction between the game's mechanics and the narrative that the game is meant to represent. It's good to leave some leeway in the interpretation in any given game action, because it allows for more dynamic and richer stories.\n\n \n\nExhausting a hero to attack an enemy can be interpreted in many ways, for instance. It might be literally a single strike at the enemy in close combat, or it might be a protracted battle between the two characters lasting hours or even days, the two characters matching wits and tactics as much as combat prowess until one finally gets the better of the other.\n\n \n\nYou don't even have to interpret it as a literal battle, but rather a contest of some sort between the two parties. Perhaps Merry didn't kill the Nazgul, but through his courage and wily prowess he led them so far away from his party's path as to render them no longer a threat. Perhaps Aragorn didn't kill off the entire Orc Host, but arranged his rangers in such an intimidating display of physical force that he frightened them off.\n\n \n\nI think imagining the heroes of your deck as not all being physically present with one another, but instead taking individual actions that end up helping one another achieve their goals is a beautiful (and useful) tool in a player's interpretive toolbox. It opens up a lot of room for broader narratives and a greater diversity of deck types, which is always a good thing.\n\n \n\nThat being said, it's also a difficult tool to use well. As I play a quest, I like to imagine the narrative that emerges as the game unfolds. There are only so many times I can declare Theoden as an attacker against Thaurdir before I start to wonder what exactly that action represents. When I make some awesome play and Theoden lands the killing blow, I want that to have an equally epic interpretation in my game's narrative--but if we go with the interpretation that Theoden is still back in Rohan, and not actually present at the battle, it's a little difficult to imagine just how he did something so epic as to cause Thaurdir's downfall.\n\n \n\nFurthermore, the narrative text directly references the heroes (although, obviously, just as \"the heroes\" so you can substitute in any character you like). They are described as speaking with one another, clapping each other on the shoulder, and interacting with the various other characters who are delivering the plot. Imagining more than a few of the characters as not physically present for the adventure at hand requires some mental gymnastics. It's often just easier to contrive a reason why Theoden might travel to Carn Dum with a group of Rangers than continually try to justify his contributions without his physical presence.\n\n \n\nSo I think this question is a valid one. It's an interesting challenge to try to come up with sets of heroes who can form a cohesive narrative while playing through the game. While I don't typically restrict myself to this sort of play, I do find the game most gratifying when the heroes I picked help me to form a concrete and believable narrative as I play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2119164","commentId":2119164,"userName":"tnewman772","timestamp":1458687694,"content":"> I think you might be able to resolve the problem by replacing one or two heroes every few quests, so that it's still the \"same\" heroes throughout (in the same way that Theseus' ship [https://en.wikipedia.org/wiki/Ship_of_Theseus] remains Theseus' ship) but you can make continual thematic adjustments as you go.\n> \n> That way you can bring in characters like Eowyn and Theoden somewhere in the middle of the Ringmaker cycle, but have them leave the party again by the cycle's conclusion. So long as you don't change everyone at once, you can still use most of your cardpool and maintain the story's continuity at the same time.\n\n \n\nI like this idea a lot, and it is essentially what we plan for when we do the entire campaign someday. I think the Dunedain would be some logical heroes to persist throughout the quests, but we don't have most of those cards yet. We are very excited about some of the newer cycles, but so far we have managed to restrain ourselves and purchase them \"in order\" (of release)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205474-voice-of-isengardringmaker-cycle-theme-question/?do=findComment&comment=2119175","commentId":2119175,"userName":"tnewman772","timestamp":1458687902,"content":"I really like divinityofnumber's and Authraw's ideas and will have to mull over some of these concepts while awaiting the next time I can play with my daughter! Darn kids, growing up and moving away and such. Sheesh.\n\nEdited March 22, 2016 by tnewman772"}]}