{"url":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/","title":"The Size of Your Deck","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105280","commentId":2105280,"userName":"The Thing In The Attic","timestamp":1458151928,"content":"Hi there\n\nI'm a relatively new player to this game. I noticed at the end of the rule book is the deck building rules and they set out the deck size of 50 cards minimum for tournament play.\n\nSo for casual play does any one play with a deck that contains less than 50 cards? Would reducing the size of your deck help focus your strategy against some of the tougher quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105316","commentId":2105316,"userName":"John Constantine","timestamp":1458152252,"content":"Dunno. I usually find myself wanting to put more than 50 cards into my deck because there is so much awesome and useful stuff around :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nReducing your deck size below 50 could help some combo heavy decks that require a lot of key components, however I would advise you against this houserule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105420","commentId":2105420,"userName":"Teamjimby","timestamp":1458153250,"content":"Playing with less than 50 generally makes your deck stronger, which is why they have the minimum.  If you're new and only have a core set plus maybe a few APs, I think you can justify playing with less than 50 cards because there just aren't enough good cards in your pool yet and anything you add is just diluting your deck.  But once you have at least a cycle worth of cards, you should be playing with 50."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105452","commentId":2105452,"userName":"Delaric","timestamp":1458153760,"content":"I usually only put in over 50 cards if I am playing a deck with lots of card draw, typically Lore.  The lack of card draw and a deck limit of 50 can already make your deck very inconsistent, and when you add more cards in you can only hope to see the cards you want in a game that lasts 6-10 rounds if you don't lose too early."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105519","commentId":2105519,"userName":"Kakita Shiro","timestamp":1458155064,"content":"If you're not playing Erestor, then that minimum should also be considered a maximum.\n\n \n\nErestor gives you a little more flexibility, but it should still be close to 50.\n\nEdited March 16, 2016 by Kakita Shiro"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105543","commentId":2105543,"userName":"The Thing In The Attic","timestamp":1458155653,"content":"I've been playing fifty card decks and have had many games where most of the deck goes unused. It was just something I noticed that they specified a card minimum only for tournaments and got to thinking that perhaps the games concept design was for no min or max limit.\n\nIt would be silly to have a ten card deck, for example, but a thirty or forty card deck where you have very little or no card draw mechanics in your deck might be more suited.\n\nI have 1 core set, Mirkwood AP cycle, khazad-dum duluxe and all of the saga deluxes. I'm about to start the Dwarrowdelf APs"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105582","commentId":2105582,"userName":"John Constantine","timestamp":1458156501,"content":"Sounds like you have everything you need to build a decent 50-carded deck to me. Maybe try to work on your deckbuilding? Read some articles regarding the matter, or ask Seastan for help? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2105612","commentId":2105612,"userName":"Kakita Shiro","timestamp":1458156909,"content":"> I've been playing fifty card decks and have had many games where most of the deck goes unused. It was just something I noticed that they specified a card minimum only for tournaments and got to thinking that perhaps the games concept design was for no min or max limit.\n\nDeck size minimum is instituted to create variance between games. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2106055","commentId":2106055,"userName":"alexbobspoons","timestamp":1458164806,"content":"> Dunno. I usually find myself wanting to put more than 50 cards into my deck because there is so much awesome and useful stuff around :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n>  \n> \n> Reducing your deck size below 50 could help some combo heavy decks that require a lot of key components, however I would advise you against this houserule.\n\nGotta agree here. I understand how the mathematics works for 50 card decks being more reliable than say 60 cards, but **** theres always so many cards you want to include against a scenario... Im rarely at 50.. usually 55"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2106508","commentId":2106508,"userName":"Seastan","timestamp":1458173934,"content":"One thing you could do is go over to Love of Tales [http://seastan.github.io/]. Click on the \"Sets\" Tab, and select all the sets you have, and the number of core sets. Then go to the \"Community\" Tab, click the check box that says \"Deck only uses cards from sets I've selected\". This will limit the search to only decks that you can build. There aren't too many right now, but more are being added each day."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2106743","commentId":2106743,"userName":"Network57","timestamp":1458181378,"content":"I try to always use 50, no more nor less. I've rarely gone up to 53 or so, but only if I'm tuning a deck. If you find yourself unable to get down to 50, really consider which cards are the Wants vs Needs. But once you have enough cards in your personal pool to fill out a full deck, going below 50 is a personal choice. But bear in mind most people's advice comes from the perspective of a 50-card deck, so you'd be setting yourself up for a lack of community support.\n\nI've never seen Seastan's deck builder... Expect me to upload a few of my favorites! I only have one Core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2106831","commentId":2106831,"userName":"Ecthelion III","timestamp":1458183760,"content":"There is no tournament, so I just consider the 50 card minimum as a basic game rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2107742","commentId":2107742,"userName":"dalestephenson","timestamp":1458223541,"content":"My decks are always ballooning past 50 because I put in interesting cards to try out without taking existing stuff out, then I cull back down after a quest stomps me.  Even then I'm likely to just not count cards like Daeron's Rune.\n\n \n\nFor new players with a limited cardpool I'd recommend not worrying about the 50 card deck minimum.  As long as you're wondering \"what other useful cards could I possibly put in this deck to get to 50\", don't sweat it.  Put everything in you think might be useful, and if it's less than 50 so be it.  Once you get to the \"what else am I going to cut to get down to 50\" stage I'd treat the tournament rule as a permanent rule.  Constructing a smaller deck at that point for competitive reasons would result in a deck of no interest to anyone else, and a play experience not comparable to anyone else.  So why bother?  If the quest is too tough for your deck and you don't want to remake it, try semi-easy (1 extra resource at start) or easy mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2108506","commentId":2108506,"userName":"Ecthelion III","timestamp":1458238655,"content":"> My decks are always ballooning past 50 because I put in interesting cards to try out without taking existing stuff out, then I cull back down after a quest stomps me.  Even then I'm likely to just not count cards like Daeron's Rune.\n> \n>  \n> \n> For new players with a limited cardpool I'd recommend not worrying about the 50 card deck minimum.  As long as you're wondering \"what other useful cards could I possibly put in this deck to get to 50\", don't sweat it.  Put everything in you think might be useful, and if it's less than 50 so be it.  Once you get to the \"what else am I going to cut to get down to 50\" stage I'd treat the tournament rule as a permanent rule.  Constructing a smaller deck at that point for competitive reasons would result in a deck of no interest to anyone else, and a play experience not comparable to anyone else.  So why bother?  If the quest is too tough for your deck and you don't want to remake it, try semi-easy (1 extra resource at start) or easy mode.\n\n100% agree. Deckbuilding with a small card pool is so vastly different than with a large one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2108644","commentId":2108644,"userName":"Calvadur","timestamp":1458241130,"content":"> I've been playing fifty card decks and have had many games where most of the deck goes unused. It was just something I noticed that they specified a card minimum only for tournaments and got to thinking that perhaps the games concept design was for no min or max limit.\n> \n> It would be silly to have a ten card deck, for example, but a thirty or forty card deck where you have very little or no card draw mechanics in your deck might be more suited.\n> \n> I have 1 core set, Mirkwood AP cycle, khazad-dum duluxe and all of the saga deluxes. I'm about to start the Dwarrowdelf APs\n\nWith the stuff you have, it should be possbile to build a decent 50 Card deck, a Hobbit deck (mainly with the black riders) or a dwarf deck (as you have all 3 \"big dwarf boxes\") come to mind. If you aren't sure try to get some help/Inspiration, usually Google finds something useful :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIirc both types (Hobbits and dwarfs) will get some useful Cards if you choose to get the dwarrowdelf APs, so you will have the pleasure to alter and boost your deck while you Progress (that's something I really love while playing through a new cycle).\n\n \n\nPersonally I try to stay Close to 50 Cards, but I am fine putting up to 5 Cards more into my decks. If you don't go mad about putting in Cards, it is much more important how many COPIES of a Card you use (for example 2 Tests of will instead of 1), than how many CARDS your deck uses. There is a good article on tales from the Cards about that Topic:\n\nhttps://talesfromthecards.wordpress.com/2014/03/20/a-note-on-probability/ [https://talesfromthecards.wordpress.com/2014/03/20/a-note-on-probability/]\n\n \n\nWhen playing solo I don't think it is actually possible or even a good idea to go below 50 Cards as you have to take care of so much (combat, questing, ressources, threat...), while in multiplayer it can look different.\n\nIt COULD end up broken if you allow a Player to only go with 30 or less Cards. He could decide to go with a 3 Spirit hero deck just running cancels, threat reduction and high willpower allies (and from that only the best of the best). You can just use only 1 copy of Arwen and would be able to get her into Play most of the time as you draw Close to 25% of your deck in the first turn when using only 30 Cards.\n\n \n\nAnd as some already mentioned having to use 50 Cards more or less guarantees you won't be able to draw the same Cards twice in a row making the game more exciting and forcing you to adapt to the Situation (I just want to stress this Point as I think it might be even more important than possible abuse)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2109551","commentId":2109551,"userName":"Bellator Sardel","timestamp":1458267781,"content":"Currently (and for about a year...and maybe a few months), I've been playing a Gandalf/Elrond deck that has gone as low as 53ish to as high as 88 cards in the deck.  Gandalf + Expert Treasure Hunter can be a lot of card 'draw' (not technically draw since it's discarded then added to hand), and added to a Vilya play and playing events off the top of my deck, I still frequently end games with fewer cards remaining in my deck than the other players.\n\n \n\nAs a group, we typically try to keep most decks between 50-55 cards, not counting things like daeron's runes.  It's simply the math of 'the fewer cards you have in your deck, the more likely you'll draw what you want out of it.'"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2109616","commentId":2109616,"userName":"PsychoRocka","timestamp":1458270660,"content":"51 so you can include Gather Information but not have it dilute your pool of 50!\n\n \n\nWith Erestor, Arwen, Cirdan though you could easily run a deck far more than 50 cards and still see everything you need to quite regularly. \n\nIf I wasn't running at least two of those heroes though I would definitely limit myself to 50/51"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2109737","commentId":2109737,"userName":"divinityofnumber","timestamp":1458275938,"content":"I always use 50, unless playing with Erestor. With Erestor, while adding in even more card draw too (e.g., deep knowledge, Daeron's ruins), I have had great luck with even 70-80 cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2110384","commentId":2110384,"userName":"PigsAreOurEquals","timestamp":1458308308,"content":"I can only add to the choir. 50 is best, resit the urge to not count things like Daeron's rune. A 50 card deck with 3 Daeron's runes will be (on average) better than a 53 card deck with 3 Daeron's runes.\n\nDeck building is all about making tough choices. I have a similar card pool as you (core set + Khazad Dum(+watcher+foundations+shadow and flame) + black riders+ road darkens + treason of Saruman) and have sofar managed to beat every quest (although Escape from Dol Guldur took many tries and tweaks)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2110468","commentId":2110468,"userName":"soullos","timestamp":1458309636,"content":"My mind was in the gutter when I read the thread title. @_@ *ahem*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2110559","commentId":2110559,"userName":"dalestephenson","timestamp":1458311572,"content":"I'll agree that a 50 card deck with Daeron's Runes is tighter than a 53 card deck without it.  Same goes for using Gather Information as the 51st card.\n\n \n\nOn the other hand, pretending Daeron's Runes is \"free\" allows me to put another 1-3 cards in that wouldn't be in the deck without it, so for a tiny decrease in efficiency I can get a significant bump in interestingness.  IMO, deck building really doesn't have to be all about making the tough choices to construct the maximum efficiency deck.  It's really about making the tough choices to construct the deck that's the most fun for you personally to play.  Bloat can work against that by making the cards you are most interested in playing less likely to come up during the actual game.  But rigidly adhering to maximum deck efficiency can keep you from playing some interesting cards at all.\n\n \n\nOf course, that also means you lose more, but I love that as a solo player (either one-handed or two-handed) I can fall back on semi-easy or easy mode if my deck concept just isn't good enough to take the quest down in normal.  I can also choose to avoid quests that I know will be a poor fit.  (Let's take a trisphere leadership-lore-tactics deck against Morgul Vale!  What could possibly go wrong?)  I also play DiceMasters, and it can be a little demoralizing in constructed play to bring a team with an interesting concept, but in practice more efficient teams grind it to powder before it gets a chance to do its thing.\n\n \n\nFor those who play LotR with other real players, there's also a constraint of building the kind of deck your partners would like to see (carry it's own weight without hogging the fun), but I unfortunately don't have to deal with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2110613","commentId":2110613,"userName":"NathanH","timestamp":1458312661,"content":"If I'm sitting at 50 + a few I'm usually happier to accept a small reduction in the probability of drawing any given card to balance the high probability that if I remove something it'll turn out to be better than something I've left in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2111069","commentId":2111069,"userName":"The Thing In The Attic","timestamp":1458321969,"content":"Thanks for your replies. My reason for posting this thread wast because I was struggling to build a 50 card deck or struggling to beat quests due to a small card pool; I've always made 50 card decks and have beat all of the quests from core set to khazad-dum deluxe through trial and error (exept Dol Guldur and I've yet to start on the sagas). I was simply curious about the intended style of play as envisioned by the designers.\n\nThe rule book is the designers chance to tell us how to play the game as they intended us to. Most card games of this nature probably set out a deck size or limit within the rules frame work and the tournament play adopts that format as an extention of the rules. At least all of the collectable card games I've played over the last twenty years have followed that format. Here in this game however, the designers have only set out a deck limit for tournament play. So either the designers intended for there to be no limit or they forgot to write one in the rules. As the FAQ doesn't specify any errata or clarification on the subject it would suggest that for casual play you can play what you like.\n\nTo me this makes sense especially when the rules state that you can play with up to three heroes (we all play three right? Maybe that's because we have fifty card decks) but if you want to play one hero then surely a thirty card deck would be better than fifty. This makes the game more of a sandbox game surely\n\nI'm writing all this without actually testing this theory but I might have a go with fewer heroes and a smaller deck see how it pans out. Smaller decks mightwell get crushed due to being too small but I think the designers want us to experiment with deck design and smaller decks and fewer heroes may allow for more themed and focus decks and allow us to manipulate threat and card draw by using external mechanics as well as card effects. It might also explain why some of the difficulty levels are way off.\n\nI understand the need for a limit in tournaments which levels the playing field and standard for all competitors but I also like thinking out of the box and exploring the full potential of a game such as this so when I pour over the rules for the tenth time to make sure I'm doing everything right I do find it oddly curious that the core rules don't set a deck size, and gives you a choice as to how many heroes to play: one, two or three...\n\nThanks for reading and posting\n\nEdited March 18, 2016 by The Thing In The Attic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2111184","commentId":2111184,"userName":"PocketWraith","timestamp":1458324581,"content":"While in the vast majority of cases people will use 3 heroes in their decks, there are exceptions, where people may go down to two heroes, most likely to make use of Secrecy. I've never heard of anyone playing a one hero deck as anything other than a gimmicky challenge, but two-hero Secrecy is very much a thing, and indeed a thing which is going to be receiving support in the upcoming cycle. The 50 card deck minimum however is something I've never really seen people disregard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/205702-the-size-of-your-deck/?do=findComment&comment=2112354","commentId":2112354,"userName":"NathanH","timestamp":1458378736,"content":"If a player has a very small card pool I don't think they should feel obliged to stick to 50 if the alternative is putting in cards that are plain bad or too expensive for the deck.\n\n \n\nI would expect though that anything more than 1 Core Set + a few APs (especially if the APs are bought by-cycle) should be enough to build a 50 card deck without any bad cards. It might include some cards that are noticeably weaker than others but each card ought to be playable."}]}