{"url":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/","title":"Lost Realm or Grey Havens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112383","commentId":2112383,"userName":"Crusaderlord","timestamp":1458383264,"content":"I have reached the point where i can delve into a new expansion. I am a solo player with one support deck and like more story questing than deck trickery.\n\n \n\nI own the Mirkwood Cycle, Khazad-dum and Dwarrowdelf cycle, Voice of Isengard and Ringmaker cycle and the two Hobbit boxes and the Black Riders. My favourite expansion so far was Khazad dum and Dwarrowdelf. I dont have that much interest in continuing the Saga series - i got Black Riders for the hobbits mainly and the quests are good but am more into the new quests based on the story rather than the actual saga again, although some of the famous ally cards in Road Darkens and Treason of Saruman i will painfully miss out on. I am not that interested in Heirs of Numenor which i skipped - it was always flagged as hard to solo and the more human enemy focus i dont find as much fun. Voice of Isengard and the Ringmaker was the last natural choice as i really wanted the Silvan deck it provided. \n\n \n\nSo I am unsure whether to go next for Lost Realm or Grey Havens. Usually there is something that draws me to start a box, If i look ahead at the cycle, which is important i quite like the look of the undead in The Dream Realm and the Escape from Mount Gram but then i also love the more adventure story style look of Temple of the Deceived and Drowned Ruins. The ships theme is not one that would beat the Rangers. However i think i am 50/50 on which set to get next.\n\n \n\nBased on what is out so far is there anything for a solo player that should sway my decision. Anyone got any real preferences between the two expansion boxes ?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112386","commentId":2112386,"userName":"John Constantine","timestamp":1458383973,"content":"The thing you might want to consider is that Lost Realm has full set of AP's already released, while Grey Havens have none, plus it'll be ages before APs for it even start coming out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112396","commentId":2112396,"userName":"Crusaderlord","timestamp":1458384962,"content":"Thanks - i am not too worried about the timescales.\n\n \n\nThe core expansion box would keep me going for a bit and i am happy to wait for the cycle to come out. I suspect the right answer is to wait and see the whole Grey Havens cycle first. I could always buy Fog on Barrow Downs and Ruins at Belegost just to have something new and wait.\n\n \n\nEarly on i think you buy sets more to get player cards, now that i have a decent choice of Dwarf, Silvan, Hobbit and maybe Rohan support (ive not built a Rohan deck yet) i seem to want to buy more on the quest themes instead than new player deck cards. However its still nicer to get both.\n\n \n\nBut i am interested to know what people think of the three quests from these two expansion boxes.\n\nEdited March 19, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112419","commentId":2112419,"userName":"Nickpes","timestamp":1458386749,"content":"If i just focus on the three quests of each pack, i liked the Grey Havens more but Lost Realm was harder which is a good thing for me. I play solo one handed"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112425","commentId":2112425,"userName":"alexbobspoons","timestamp":1458386965,"content":"Also check your stores for availability. Lost Realm APs will go out of print sooner or later and while will be reprinted, you could get stuck waiting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112439","commentId":2112439,"userName":"NathanH","timestamp":1458388529,"content":"If you prefer your enemies to be non-human then Lost Realm is a better choice. Two out of the three Grey Havens quests are battles against corsairs and I think at least 2 of the APs will be as well, probably more. In the Lost Realm and Angmar Awakened your enemies will be orcs, wargs, giants, trolls, werewolves, and undead. but no humans."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112594","commentId":2112594,"userName":"Gizlivadi","timestamp":1458400726,"content":"If you want to build a Noldor deck of any sort, or make the best use of the heroes and player cards in The Grey Havens, you pretty much need Lost Realm & Angmar Awakened."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112620","commentId":2112620,"userName":"Calvadur","timestamp":1458402673,"content":"I recommand you the grey havens. Imo it fits your favor for story questing better than the lost realm.\n\n \n\nWhile personally I prefer the lost realm, as I like pretty much everything about the design and story of the quests, the quests themself were \"standard\". Quest a little here and there, in this phase please hury, otherwise you loose, oh yeah here have a nasty playercard immun Location and for the end we have a (very cool^^) boss for you. Mean treacheries are just the icing on the cake.\n\n \n\nGrey Havens has the more creative mechanics and just bigger quest decks (lost realm has max 2 stages per quest!), giving more room for Exploration and storytelling. Personally I think it is a Little easier, too. Introducing the ships is another \"creative Advantage\" over realm.\n\n \n\nIf you care for the Player Cards in that regard, I would suggest this box. Both boxes have mighty characters from the books (None of them is a let down like Dori in the Ettenmoors pack), but the rest of the playercards in realm dosn't really shine and Needs much Support from the following cycle, while many Cards from havens work on their own. Ironically they work really well with Cards released in the last 2 angmar packs :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nThe 2 AP from Angmar you mention. I found all AP from Angmar great and was really hyped for Mount Gram. In the end it was very  easy (for me), but non the less fun as hell and I like replaying it with many different starter heroes and ombinations, sadly the set up takes some time :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] . Dread realm is a though quest.\n\n \n\nAnyway, I suggest The Grey Havens. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2112652","commentId":2112652,"userName":"Thanatopsis","timestamp":1458404383,"content":"There is something to say about being part of the hype of a new deluxe and cycle. It has nothing to do with game play and everything to do with immersing yourself in the community: waiting for spoilers, discussing on the forums, anxiously tracking the shipping, getting swan tokens from team covenant, etc.\n\nIf you find those sorts of things amazing, go for Grey Havens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2113167","commentId":2113167,"userName":"awp832","timestamp":1458433217,"content":"Go for Lost Realm.   I like Grey Havens just fine but Lost Realm is a really good cycle.  Lost Realm introduces sidequests which are amazing, and has some really excellent cards in general.   Grey Havens is Noldor, Noldor, and more Noldor.   So there isn't much out there to play with if you're playing anything except Noldor.  \n\nAnd if you *are* playing Noldor,  still go for the Lost Realm anyway because of Arwen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2117315","commentId":2117315,"userName":"Crusaderlord","timestamp":1458642839,"content":"i will go for Lost Realm - it is a close call but the theme is great and i like rangers\n\nalso the quests have variety from what i can see including - wargs, escape, trolls & giants, undead, orcs and a big battle\n\nplus there are one or two nice silvan cards which is my favourite support deck\n\n \n\ni sometimes have concerns that solo play one deck doesn't always work well for some quests but no-one is raising these concerns for this set\n\nEdited March 22, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2118007","commentId":2118007,"userName":"Calvadur","timestamp":1458663023,"content":"> i will go for Lost Realm - it is a close call but the theme is great and i like rangers\n> \n> also the quests have variety from what i can see including - wargs, escape, trolls & giants, undead, orcs and a big battle\n> \n> plus there are one or two nice silvan cards which is my favourite support deck\n> \n>  \n> \n> i sometimes have concerns that solo play one deck doesn't always work well for some quests but no-one is raising these concerns for this set\n\nNo Lost Realm Quest is to hard for solo 1 deck Play. Only Carn Dum and dread realm (last 2 quests of the cycle) can really cause Trouble as their mechanics/difficulty can be really punishing/annoying. But that is the case in multiplayer, too (you could argue even more in multiplayer as multiple Encounter Cards make (surge) Combos easier).\n\n \n\nIf you like theme, Cards and quests better go for it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206051-lost-realm-or-grey-havens/?do=findComment&comment=2118048","commentId":2118048,"userName":"John Constantine","timestamp":1458663807,"content":"A wise choice."}]}