{"url":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/","title":"What are your thoughts on Noldor Decks?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2114565","commentId":2114565,"userName":"cmabr002","timestamp":1458522799,"content":"I've been having a lot of fun toying around with the Noldor trait.  I personally feel this trait to be the most complex and the hardest to play efficiently.  I often find myself trying to determine how I should utilize my discarding for the most gain.  As far as strength goes, Noldor is definitely up there, in my opinion.  It's kind of insane just how much they can churn out.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2114636","commentId":2114636,"userName":"GrandSpleen","timestamp":1458526896,"content":"Yeah, it's brought exactly what I wanted it to bring.  I can make a questing deck that isn't boring now.  Most willpower decks just dump allies on the table and quest all-in every turn, sleeping through the other half of the game.  With Noldor I have some more fun with the Cirdan/Gildor combo, putting the right things on top of discard, and Cirdan/Narya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2114700","commentId":2114700,"userName":"Seastan","timestamp":1458530163,"content":"I think it's the most flexible trait yet in terms of the decks you can build, and I love how pretty much every Noldor hero could be a solid choice in a deck that has nothing to do with Noldor as well, making the deckbuilding options incredibly interesting. I second GrandSpleen's opinion about making questing decks more interesting. I think we will see that even more though with a certain upcoming hero.\n\n \n\nErestor, while he's been around for a while now, is still amazing in his ability to make decks work that otherwise shouldn't. Recently I've put him with Beregond in a deck with a bunch or weapons and armour, and it isn't rare to have him start the first turn off with Gondorian shield, Raven Winged Helm, Song of Wisdom, and Burning Brand.\n\n \n\nI'm warming up to Galdor quite a bit. Putting in an Elven Spear of a Protector of Lorien lets you easily dump your hand and get a huge surge of cards.\n\n \n\nCirdan, while I haven't been too impressed yet with his ability, is great for his Willpower and Narya. Just tried him in a deck that uses Trollshaw scouts with Rivendell Blades, Rivendell Bows, and Narya, to wipe out the whole board. Very fun.\n\n \n\nArwen is starting to replace her grandmother in most of my decks. Providing reliable resource generation in spirit is pretty great, and she can contribute to the quest from turn 1. I still think Galadriel is one of the most powerful heroes though. We'll see if Arwen has starying power or if I just like her because she's new.\n\n \n\nElven-light in particular is a game changer. It's single-handedly turned some of my games from one turn away from losing to a crushing victory just by drawing it.\n\n \n\nTo the Sea has been very strong so far, but I'm most excited because it means each Noldor ally to come out in the future should be automatically viable if you can play it for 1. Just look at how it managed to bring back Gildor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2114858","commentId":2114858,"userName":"Fingolfin Fate","timestamp":1458540385,"content":"Yes, To the Sea! is a great card to revive Gildor. Well, he was still amazing with Vilya, but now there is another reliable way (Elf-stone not quite up there, though not a bad card either).\n\n \n\nInteresting to see Arwen and Galadriel compared. I never counted the Galadriel hero among the Noldor strategies, since she has always occupied a spot in a Silvan deck. I know it is a bit obvious but from day one I never put her anywhere else, just because it is the one deck that seems perfect (the Silvan one with Celeborn) though I keep meddling with the third hero all the time.\n\n \n\nI see why Elven-light is the thing, but it only really shines whilst you have another resource acceleration, and from the thematic/mechanic point of view, Arwen and To the Sea! seem to be enough. Arwen is great, naturally, it is one of those heroes you really cannot perceive otherwise, just the threat/willpower ratio makes her amazing; the ability being a (very substantial) bonus.\n\n \n\nGaldor vs Erestor heroes, there lies some question. Both very interesting. I like Erestor for his hurray factor, an easy Gildor/Glorfindel ally round 1 with To the Sea! You can also have both of those heroes together and run Love of Tales -- it will be effective even after errata (and feel less like cheating perhaps).\n\n \n\nNarya is amazing. Círdan seems a better choice than Gandalf for me because of how Light of Valinor combos with the card. And also because that Círdan's combat actions are much less valuable than Gandalf's. Love readying Gildor and Glorfindel with it. Makes also Elrond and Galadriel allies much more useful.\n\n \n\nI do not see Lords of the Eldar mentioned too much. For me it is the one card making the decks great. The three Spirit resources never seem spent better than for this card, especially with their new readying tools: Elwing's Flight and (again) Narya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2114985","commentId":2114985,"userName":"cmabr002","timestamp":1458551638,"content":"> Yeah, it's brought exactly what I wanted it to bring.  I can make a questing deck that isn't boring now.  Most willpower decks just dump allies on the table and quest all-in every turn, sleeping through the other half of the game.\n\n \n\nThese are definitely my thoughts as well.  As much as I love my mindless Dwarf spam deck (and as strong as it is), Noldor is really fun to play and actually feels like there are choices.\n\n \n\n> Galdor vs Erestor heroes, there lies some question. Both very interesting. I like Erestor for his hurray factor, an easy Gildor/Glorfindel ally round 1 with To the Sea! You can also have both of those heroes together and run Love of Tales -- it will be effective even after errata (and feel less like cheating perhaps).\n> \n> \n> \n>  \n> \n> I do not see Lords of the Eldar mentioned too much. For me it is the one card making the decks great. The three Spirit resources never seem spent better than for this card, especially with their new readying tools: Elwing's Flight and (again) Narya.\n\n \n\nI actually included 3x Hope Rekindled and 3x Love of Tales in my Erestor, Galdor, Arwen Noldor deck.  It would be stronger if it was just 3x Steward of Gondor and 3x A Good Harvest, but I opted not to use those because of other players likely wanting to use Steward of Gondor.  Still, being able to occasionally generate 2 extra resources is great when you would otherwise be discarding your hand for no benefit.\n\n \n\nI haven't had much success with Lords of the Eldar becase with my deck I only have Arwen for Spirit resources and it's very difficult to get enough.  Again...Steward of Gondor/A Good Harvest would remedy this problem.  The few times I've gotten enough resources to use Lords of the Eldar, I can't tell if the game was already won and it just made me win faster, or if it was what caused me to win.  Regardless, the card seems good to me, but perhaps not a good fit in my deck without Steward of Gondor.  I need to do some more play testing.\n\nEdited March 21, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2115132","commentId":2115132,"userName":"Lecitadin","timestamp":1458562548,"content":"Now, we need more Leadership and Tactics Noldor heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2115191","commentId":2115191,"userName":"Fingolfin Fate","timestamp":1458564993,"content":"Well, there are two ways I have put Lords of the Eldar in a great use. In the deck you are running, with Love of Tales, but also Song of Travel (not to mention Song of Eärendil). It had been before the errata but I was almost never short on Spirit resources.\n\n \n\nThe other being two Spirit heroes: Círdan and Arwen. And that makes more sense to me now that we have To the Sea! and Narya."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2115195","commentId":2115195,"userName":"Fingolfin Fate","timestamp":1458565078,"content":"Oh, yes, I think we shall get more Noldor allies, I am especially looking forward to Elladan and Elrohir. I hope they are either Lore and Spirit, or match the brother's hero version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206203-what-are-your-thoughts-on-noldor-decks/?do=findComment&comment=2115440","commentId":2115440,"userName":"Authraw","timestamp":1458571987,"content":"My wife and I have both been playing different Noldor decks since Silver Harp came out. You can build everything from tricksy experimental decks all the way up to solid power decks, all with a lot of nuance and whilst staying \"within theme\".\n\n \n\nOne thing I've noticed is that I think Noldor is the first tribe to be able to make good use of Love of Tales, since it has so many songs that you're likely to put in anyway that you're not diluting your deck trying to make it work. To the Sea, To the Sea!, Tale of Tinuviel, Lay of Nimrodel, all go well with Noldor, not to mention the fact that many Noldor decks could end up using Song of Battle or Song of Kings to splash in Noldor cards from other spheres.\n\n \n\n \n\n> Now, we need more Leadership and Tactics Noldor heroes.\n\nWe definitely do. The brothers are great, but you don't feel like you're getting a good deal when you play them by themselves. I've long been hoping to get ally versions of Elladan and Elrohir so that we can play one as a hero without having to include the other. That alone would greatly expand the possible sphere combinations within Noldor."}]}