{"url":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/","title":"Is consistency without card draw possible?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116042","commentId":2116042,"userName":"cmabr002","timestamp":1458584465,"content":"I've never made a strong deck without card draw...or what I would consider a strong deck.  I know there are consistent decks that don't include any Lore heroes like Seastan's Boromir/Galadriel/Glorfindel deck and that's mainly because of the use of the mirror and card draw from Galadriel.\n\n \n\nWhen I'm trying to make decks without card draw (so as to not conflict with my other decks), I often find them to be unreliable since, occasionally, I am unable to find important cards in my deck.  Even if I have multiple good options, occasionally, you won't draw any of them and you'll just lose because of it.  I hate that feeling...and usually results in my scrapping the deck if it happens too much.\n\n \n\nI suppose the one other type of strong deck I've seen, although have not created myself is playing from the top of your deck with Vilya or A Very Good Tale.  It is quasi card draw and works just fine, but unfortunately I already have a Vilya deck created since that is what my friend created to use with my card pool.\n\n \n\nIs card draw just a must have if you want consistency?  In Tactics, it's Foe-hammer (and sometimes recycling it with Hama), in Spirit it's Galadriel/Elven-light, in Lore it's everything, and Leadership it's Sneak Attack/Gandalf and you can always include 3x We Are Not Idle to effectively reduce your deck size.\n\n \n\nSo basically, without card draw (or with minimal card draw) are there any sorts of recommendations you have that make your decks consistent if it is even possible?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116095","commentId":2116095,"userName":"Teamjimby","timestamp":1458586036,"content":"Like you mentioned, I think the best decks I've made without much/any card draw have used A Very Good Tale and 30+ allies, preferably expensive allies.  In that case, you have enough allies that the deck will be fairly consistent, as long as you aren't too dependent on any particular ally.  And if your allies have an average cost of around 3, then you'll be able to use all of your resources without any additional card draw.\n\n \n\nThe main deck I have in mind is a leadership/spirit deck with Santa Theoden, so you get the reduction on allies.  In that deck if you have Gamling, you can effectively get extra cards by returning the allies to your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116101","commentId":2116101,"userName":"cmabr002","timestamp":1458586274,"content":"> Like you mentioned, I think the best decks I've made without much/any card draw have used A Very Good Tale and 30+ allies, preferably expensive allies.  In that case, you have enough allies that the deck will be fairly consistent, as long as you aren't too dependent on any particular ally.  And if your allies have an average cost of around 3, then you'll be able to use all of your resources without any additional card draw.\n> \n>  \n> \n> The main deck I have in mind is a leadership/spirit deck with Santa Theoden, so you get the reduction on allies.  In that deck if you have Gamling, you can effectively get extra cards by returning the allies to your hand.\n\n \n\nYeah, maybe that's something I should look into. I used to have Theoden in my Rohan deck until they nerfed the deck into oblivion with the Horn of Gondor errata.  I'm not currently using A Very Good Tale either.  What do you do if you don't draw A Very Good Tale, though?  I'm assuming it uses Steward of Gondor as a back up plan?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116112","commentId":2116112,"userName":"awp832","timestamp":1458586504,"content":"Rohan is a good choice for this, whether you're LD/SP or SP/T I think it's possible.  One thing I did was just to include tons of mount cards and 3x Westfold Horse Breeder,  possibly 3x Stand and Fight as well.  Stand and Fight generally goes on the Horse Breeder, who comes in lets you search 10 cards for a mount and probably chump blocks and dies.  So if you have your deck built around mounts you can make it fairly consistent.\n\nBut that's basically another form of card draw.  If you mean without doing any tricks at all to draw more than the single card per turn...  I  would say it's not probably possible.  As Robert from team covenant always says;  it's a card game,  you need to draw cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116128","commentId":2116128,"userName":"cmabr002","timestamp":1458586874,"content":"> Rohan is a good choice for this, whether you're LD/SP or SP/T I think it's possible.  One thing I did was just to include tons of mount cards and 3x Westfold Horse Breeder,  possibly 3x Stand and Fight as well.  Stand and Fight generally goes on the Horse Breeder, who comes in lets you search 10 cards for a mount and probably chump blocks and dies.  So if you have your deck built around mounts you can make it fairly consistent.\n> \n> But that's basically another form of card draw.  If you mean without doing any tricks at all to draw more than the single card per turn...  I  would say it's not probably possible.  As Robert from team covenant always says;  it's a card game,  you need to draw cards.\n\n \n\nNo, this is exactly what I'm looking for.  I used Westfold Horse-breeder in my Rohan deck and quite enjoyed it. It's certainly something I had overlooked and I love the card.  I might have to look into this as an option since my most underutilized spheres are Spirit and Tactics.\n\n \n\nAlthough, my Rohan deck that I had didn't really work without Arwen/Elven-light/Horn of Gondor and I've decided to use Arwen/Elven-light in a Noldor deck for the time being.  And as mentioned in my other post, Horn of Gondor isn't particularly useful in the deck anymore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116168","commentId":2116168,"userName":"Rajam","timestamp":1458587886,"content":"mmm probably you'd need to use x3 of all the cards you want to use, and make a deck that doesn't rely on a specific card to work. This would mostly mean you need strong heroes right from the beginning, which don't need a bunch of attachments, and maybe this deck would need more allies than normal...\n\n \n\nHonestly, at the current state, I don't think it's possible to build decent decks without card draw power. It's either that or make a house-rule that allows you to build decks with less than 50 cards. I believe this card-draw issue is one of the reasons of why solo-mono-tactics decks (and to a lesser extent, solo-mono-leadership decks) are subpar when compared to their Spirit and Lore counterparts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116239","commentId":2116239,"userName":"ricedwlit","timestamp":1458589859,"content":"Provided the quest allows it, a deck that is designed to turtle can work without direct card draw. I say without direct card draw, since what you are relying on is to survive through enough rounds to enable getting the cards you need with the ordinary card draw.  Most recent quests are designed so that turtling will not work, however it did work with earlier quests.  The key is to have some very strong heroes and add in threat reduction in case the game lasts too many rounds.\n\n \n\nPostscript:  To get consistency in this case (when you naturally draw over a third of your deck) is to also include 3x of everything as others have noted.\n\nEdited March 21, 2016 by ricedwlit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116245","commentId":2116245,"userName":"Slothgodfather","timestamp":1458589986,"content":">  As Robert from team covenant always says;  it's a card game,  you need to draw cards.\n\n \n\nCouldn't agree more.   Without at least some form of search/draw, you just stall out with only one card per turn.\n\n \n\nFor multiplayer settings - don't forget the power of the Victory Display manipulation cards and Keen As Lances.  \n\n \n\nIf you go for Silvans, Tree People is a form of card-advantage and there is the Silvan that lets you search for an event.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116255","commentId":2116255,"userName":"Seastan","timestamp":1458590205,"content":"One of my first posts [https://community.fantasyflightgames.com/topic/128345-wsolo-deck-that-can-beat-escape-from-dol-guldur-nightmare/] on these forums was actually for a deck designed to beat Nightmare Escape from Dol Guldur, featuring no card draw. Unfortunately, it does use Vilya, and it pretty much relies on getting Vilya in your opening hand, so although it's really powerful when it works, you couldn't exactly call it consistent. But the idea was make sure 99% of the deck would be a good Vilya play so that you could start triggering it blind from Turn 1. I think It could be improved now with newer allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116639","commentId":2116639,"userName":"danpoage","timestamp":1458599354,"content":"Another alternative to card draw is card search [http://hallofbeorn.com/Cards/Search?SetType=OFFICIAL&Category=Card+Search]. While not technically card draw, it will certainly make your deck more consistent. This can include effects like Bofur [http://hallofbeorn.com/Cards/Details/Bofur-THOHaUH], The Eagles Are Coming! [http://hallofbeorn.com/Cards/Details/The-Eagles-Are-Coming-THfG], Entmoot [http://hallofbeorn.com/Cards/Details/Entmoot-ToS] and the underrated Westfold Horse-breeder [http://hallofbeorn.com/Cards/Details/Westfold-Horse-breeder-VoI]. While these effects do add cards to your hand, they are more targeted than blind card draw and are sure to improve the consistency of a deck. Other than ally Legolas, The Eagles Are Coming! remains one of the most efficient means to improve the consistency of a pure Tactics deck (assuming you include enough Eagles). Also, it is worth mentioning that any deck which relies on one or two cards key can benefit from Gather Information [http://hallofbeorn.com/Cards/Details/Gather-Information-TLR] to act as a \"fourth copy\" of sorts.\n\nEdited March 21, 2016 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116647","commentId":2116647,"userName":"PocketWraith","timestamp":1458599559,"content":"I would say yes, if the purpose of the deck is simple and straightforward. So this particularly applies to Spirit and Tactics for questing and combat respectively. Build a focused questing deck and odds are most of the time even without card draw you'll get a good amount of willpower on the table. Build a focused combat deck and most of the time you'll get a good amount of combat power. It doesn't matter what 2-willpower questing allies or 2-4 attack/defence combat allies you draw so long as you draw some of them. Add to that the presence of heroes like Eowyn and Beregond and the cards you actually draw start looking less significant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116891","commentId":2116891,"userName":"GrandSpleen","timestamp":1458609781,"content":"When I won in my thematic campaign against Journey in the Dark, I had a mono-tactics build with Merry, Gimli, and Legolas.  Not a lot of card draw, certainly no consistent card draw, but I made up for it by... making a deck with like 35 allies.  It was certainly consistent!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2116955","commentId":2116955,"userName":"Network57","timestamp":1458613397,"content":"I've tried resource acceleration machine decks with no card draw that struggled after the early game. Conversely, my mono-Lore Ranger deck with no acceleration but insane card draw has crushed every quest I've run against it. I haven't tested Dol Guldur, nor Return to Mirkwood, nor any of the Dread Realm/Angmar, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2117243","commentId":2117243,"userName":"PsychoRocka","timestamp":1458636768,"content":"I came into the game and did not put much importance or value into card draw (even though I came from MTG... in which card draw is more or less king) and only in the last maybe 6 months or so since Arwen was revealed have I started playing with repeatable and strong card draw in my decks. I have also started using Core set Gandalf's card draw ability far more often, sometimes even when another effect is more useful for my current situation as the cards you draw may solve that issue in another way.\n\n \n\nThe difference is honestly immeasurable.\n\nI rarely threat out anymore because I can draw into more threat reduction so much faster and I am almost never stuck with empty hands and even when this does happen I quickly draw into more cards anyway.\n\nUnique cards or key cards can be dropped down to x2 instead of x3 if you have plenty of card draw which allows you to include a larger variety of cards in your decks or include more copies of other potentially more important key cards.\n\nTaking just a single turn longer to get something like healing or threat reduction set up can often lead to a loss and drawing extra cards gives you far more chance to get what you need faster.\n\n \n\nCombining card draw with card search (that Beorn discussed) is even better and can make a deck extremely efficient and fast.\n\nI actually really wish I realised just how important card draw is and how powerful repeatable card draw can be much earlier.\n\nYou can definitely make some great decks without card draw but I think it makes almost any deck (except for one built specifically not to rely on card draw of course) better instantly and makes it run far more efficiently.\n\nI have to say I think repeatable card draw effects are about a million times better than one time card draw effects regardless of cost or situation and the two are almost incomparable.\n \n\nEdited March 22, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2117281","commentId":2117281,"userName":"13nrv","timestamp":1458639892,"content":"> I have to say I think repeatable card draw effects are about a million times better than one time card draw effects regardless of cost or situation and the two are almost incomparable.\n> \n>  \n\n \n\nIt's why Elven-light is one of the most powerfull card recently released ...\n\n \n\nFor Rohan, Eowyn is now a draw machine with Elven-light ... Hama too.\n\nFor Eowyn, if other player play Elven-light, they can use Eowyn discard capacity for drawing ...\n\n \n\nI have recently use Elven spear with Elven-light ... So powerfull !!\n\nEdited March 22, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2117458","commentId":2117458,"userName":"cmabr002","timestamp":1458650258,"content":"> You can definitely make some great decks without card draw but I think it makes almost any deck (except for one built specifically not to rely on card draw of course) better instantly and makes it run far more efficiently.\n> \n>  \n\n \n\nI pretty much agree with this statement.  I made a Silvan deck that excluded Sneak Attack/Gandalf to avoid conflicts with my other decks.  It worked, but was just okay.  I put in Sneak Attack/Gandalf and it made it like 10x better just because of additional access to card draw.  I just have to decide if knowingly running a sub par deck is worth not having conflicts.  It might just frustrate me by not having card draw and so maybe proxies are just the answer.  Or maybe I should buy more Core Sets lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2117667","commentId":2117667,"userName":"Slothgodfather","timestamp":1458656036,"content":">  \n> \n> > You can definitely make some great decks without card draw but I think it makes almost any deck (except for one built specifically not to rely on card draw of course) better instantly and makes it run far more efficiently.\n> > \n> >  \n> \n>  \n> \n> I pretty much agree with this statement.  I made a Silvan deck that excluded Sneak Attack/Gandalf to avoid conflicts with my other decks.  It worked, but was just okay.  I put in Sneak Attack/Gandalf and it made it like 10x better just because of additional access to card draw.  I just have to decide if knowingly running a sub par deck is worth not having conflicts.  It might just frustrate me by not having card draw and so maybe proxies are just the answer.  Or maybe I should buy more Core Sets lol.\n> \n>  \n\n \n\nKeen as Lances can make for a great substitute for Gandalf in a group setting since everyone can run it and it can become free - provided you or someone else uses the Victory Display manipulation events.  and remember they don't have to be used with Rossiel.  So you don't have to change heroes to include it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206284-is-consistency-without-card-draw-possible/?do=findComment&comment=2117811","commentId":2117811,"userName":"Bullroarer Took","timestamp":1458658619,"content":"During the Isengard cycle I took Ancient Mathom out of my favorite deck. That was fine because the quests made you draw and penalized you for having too many cards. When we got to the north I noticed my deck wasn't working right and had to go back and look at my old lists to see where I had gone wrong. The answer was simple of course.\n\nAfter playing AGoT2 for a time now I wish that we drew two cards a turn, got two resources per hero AND the quest cards had a reserve value on them that we had to discard to at the end of turn. (This would also require an expanded resource curve.)\n\nI would also like to see the game structure change, but that's a different matter."}]}