{"url":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/","title":"Wingfoot Discarded / Wingfoot + Sword Thain Discarded","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125066","commentId":2125066,"userName":"cmabr002","timestamp":1458933205,"content":"This was talked about a bit in another thread, but my question here is a bit different.\n\n \n\n> Wingfoot\n> \n>  \n> \n> Attach to a Ranger hero. Response: After attached hero commits to a quest, name enemy, location, or treachery. If a card of the named type is revealed during this quest phase, ready attached hero.\n\n \n\n1.  What happens if you use Wingfoot (name enemy), Wingfoot gets discarded by some effect, and then you reveal an enemy?  Does the word \"attached\" refer to the character at the time of activation or at the time the enemy is revealed?\n\n \n\nI assume the former, but want to know if others agree.\n\n \n\n2.  Similarly, if you have Sword-thain attached to a Ranger ally (now hero due to Sword-thain) and attach Wingfoot to that character and Sword-thain gets discarded after activating Wingfoot.  After Sword-thain gets discarded the named card type for Wingfoot gets revealed.  Does Wingfoot whiff since the character is no longer a hero (similar to Sword-thain Sneak Attack combo, but backwards)?\n\nEdited March 25, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125106","commentId":2125106,"userName":"Slothgodfather","timestamp":1458934260,"content":"no clue about the first one, but I would agree that Wingfoot no longer works while attached to an Ally, even if they were a hero at the time of the trigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125108","commentId":2125108,"userName":"cmabr002","timestamp":1458934344,"content":"> no clue about the first one, but I would agree that Wingfoot no longer works while attached to an Ally, even if they were a hero at the time of the trigger.\n\n \n\nWell, I agree you can't activate Wingfoot while it is an ally, but what if you activate it while the character is still a hero and in that same quest phase Sword-thain gets discarded and then you reveal a card of the named type?\n\n \n\nEdit: I reworded my original post as I realized my sentence structure was pretty confusing.  It's still confusing cuz I suck at wording things but it is a bit more clear now.\n\nEdited March 25, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125114","commentId":2125114,"userName":"Teamjimby","timestamp":1458934497,"content":"I think that's a question for Caleb.  You're in Sneak Attack/Sword-Thain territory, and I didn't find that ruling to be very intuitive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125122","commentId":2125122,"userName":"cmabr002","timestamp":1458934757,"content":"> I think that's a question for Caleb.  You're in Sneak Attack/Sword-Thain territory, and I didn't find that ruling to be very intuitive.\n\n \n\nYeah, I actually think our conversation the other day regarding Saruman and my example of Wingfoot being similar made me question the Sneak Attack/Sword-thain ruling but didn't realize it until I was making this post about Wingfoot getting discarded (and thus, no longer being \"attached\").  It just doesn't make sense.  These (let's call them) \"hanging\" effects seem to happen at the time of activation for things to be intuitive.  However, the Sneak Attack/Sword-thain ruling seems to be the opposite of that...\n\n \n\nIf \"hanging\" effects are determined at the time of activation (like lasting effects), then in my two examples it would be:\n\n \n\n1.  Ready character\n\n2.  Ready character\n\nEdited March 25, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125161","commentId":2125161,"userName":"DukeWellington","timestamp":1458935999,"content":"I will take a stab at it.\n\n1. I say no because there is no attached hero. There is a hero, but not an attached hero.\n\n2. I say no because there is no attached hero. There is an attached character that used to be a hero, but no attached hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125210","commentId":2125210,"userName":"Slothgodfather","timestamp":1458937802,"content":"I'm in agreement with Duke. Similar to how Sneak+Thain work, losing Thain means they are no longer the \"attached hero\".  So it has no effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125352","commentId":2125352,"userName":"cmabr002","timestamp":1458942869,"content":"> I will take a stab at it.\n> \n> 1. I say no because there is no attached hero. There is a hero, but not an attached hero.\n> \n> 2. I say no because there is no attached hero. There is an attached character that used to be a hero, but no attached hero.\n\n \n\nNumber 1 can't be right because of Black Arrow.  Black Arrow would do absolutely nothing if this logic is correct.\n\n \n\n>  \n> \n> Black Arrow:\n> \n>  \n> \n> Response: After attached hero declares an attack, add Black Arrow to the victory display to give attached hero +5 [Attack] for this attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125357","commentId":2125357,"userName":"DukeWellington","timestamp":1458943181,"content":"Black Arrow adds 5 attack when the attached hero declares an attack. The hero is attached at that time and the 5 attack then persists through the attack.\n\nWingfoot sets up a delayed effect that triggers when an enemy is revealed. In your scenario the effect triggers at a time when the hero is not attached."},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125375","commentId":2125375,"userName":"cmabr002","timestamp":1458943847,"content":"> Black Arrow adds 5 attack when the attached hero declares an attack. The hero is attached at that time and the 5 attack then persists through the attack.\n> \n> Wingfoot sets up a delayed effect that triggers when an enemy is revealed. In your scenario the effect triggers at a time when the hero is not attached.\n\n \n\nNot sure I follow, \"add Black Arrow to the victory display to give \"attached hero\" (there is none because Black Arrow has already been added to the victory display) +5 Attack for this attack\n\n \n\nSay Wingfoot is attached to Aragorn.  Perhaps this is how we are supposed to interpret such cards.\n\n \n\n> Attach to a Ranger hero. Response: After attached hero (from hereon out \"attached hero\" is Aragorn) commits to a quest, name enemy, location, or treachery. If a card of the named type is revealed during this quest phase, ready attached hero (Aragorn).\n\n \n\nEdit: If that is the way we are supposed to interpret such cards, then it seems to contradict the Sword-thain Sneak Attack ruling.  Because Sneak Attack would be interpreted as such if it were consistent:\n\n \n\nAction: Put 1 ally (from hereon out the \"ally\" is Gandalf) card into play from your hand. At the end of the phase, if that ally (Gandalf) is still in play, return it to your hand.\n\n \n\n \n\nI will have to email Caleb when I can.\n\nEdited March 25, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/206780-wingfoot-discarded-wingfoot-sword-thain-discarded/?do=findComment&comment=2125416","commentId":2125416,"userName":"DukeWellington","timestamp":1458945715,"content":"The black Arrow has a response. The response is not resolved in stages. It is resolved at the same point in time. The specific time is when the hero is declared as an attacker. Adding the black Arrow to the victory display is part of paying the cost. You have to write it the way it is written. If you prohibit writing it that way then you can never discard or add to the victory display anything as part of the cost if the ability is written on the card that leaves play. For instance, you can say that the black Arrow does nothing because as soon as it leaves play it's text no longer applies. It should say \"while this card is in the victory display the formerly attached hero has +5 attack\" or whatever.\n\nThe Wingfoot ability adds a delayed effect that is resolved long after the original ability. When the delayed effect triggers the hero is no longer attached. Even if we interpret the text exactly the way you described (and I would) it would not trigger later.\n\nEdited March 25, 2016 by DukeWellington"}]}