{"url":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/","title":"New to the game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/?do=findComment&comment=2129627","commentId":2129627,"userName":"Yepesnopes","timestamp":1459227050,"content":"Hello to everybody!\n\n \n\nI am new to the game, me and my girlfriend have played the three scenarios from the core set a couple of times and we have found that when we play with four decks (each of us controls two decks), the game is easier than when we play with only two decks, either pure or mixed sphere decks.\n\n \n\nAlthough we only have the core set, we own three copies of each card and 12 Gandalf ally cards. When we play with four decks we beat the encounter deck systematically, even on the \"Escape from Dol Guldur\" quest. On the other hand, with two decks, we have to struggle a lot even to beat the \"Journey along the Anduin\" quest.\n\n \n\nIs it just a false impression due to the lack of experience that the game is easier with four decks? or it is truly like this?\n\n \n\nCan someone recommend us which spheres to mix in order to have two decent competitive decks to play the core quest? or give a link where I can read about it?\n\n \n\nKind regards,\n\nYepes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/?do=findComment&comment=2129726","commentId":2129726,"userName":"John Constantine","timestamp":1459235983,"content":"That depends on a quest. Some quest strive on many players, some quests destroy soloers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/?do=findComment&comment=2130089","commentId":2130089,"userName":"cmabr002","timestamp":1459259084,"content":"Yeah, some quests are easier solo and some are easy with more players.  Escape from Dol Guldur is definitely easier with more players.\n\n \n\nI personally think that two player is the ideal number of players for most quests, although there are exceptions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/?do=findComment&comment=2130104","commentId":2130104,"userName":"Seastan","timestamp":1459259530,"content":"If you take a look at the core set quests, they do not scale up as well for 4 players as more recent quests do.\n\n \n\nPassage through Mirkwood: There is not \"Reveal 1 card per player\" during setup. You start with the same staging area regardless of the number of players, so adding more players makes the start easier.\n\n \n\nJourney Along the Anduin: In stage 2, you have to reveal 1 additional encounter card per round. Going from 1 card/turn to 2 cards/turn is a lot harder on a solo player than going from 4 cards/per turn to 5 cards/turn is for 4 players.\n\n \n\nEscape from Dol Guldur: Same as Passage through Mirkwood - it's a static setup with 3 objectives. Additionally, only one hero gets taken regardless of the number of players. You almost don't even notice it in 4 players but in solo it crushes you.\n\n \n\nI think overall the Core Set is most balanced for 2 players, but as you keep buying new scenarios you will find some that favor 4 players and some that are nigh-impossible with 4 players. Same goes for solo play. That being said, these are the two decks I would use when playing through the Core Set (assuming only 1 copy):\n\n \n\nhttp://ringsdb.com/decklist/view/337/two-player-core-set-1-2-1.0 [http://ringsdb.com/decklist/view/337/two-player-core-set-1-2-1.0]\n\nhttp://ringsdb.com/decklist/view/338/two-player-core-set-2-2-1.0 [http://ringsdb.com/decklist/view/338/two-player-core-set-2-2-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/207085-new-to-the-game/?do=findComment&comment=2130939","commentId":2130939,"userName":"Yepesnopes","timestamp":1459288249,"content":"Thanks for the replies, and Seastan, thanks a lot for the deck ideas!"}]}