{"url":"https://community.fantasyflightgames.com/topic/215988-new-player-question-on-action-windows/","title":"New player, question on action windows","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/215988-new-player-question-on-action-windows/?do=findComment&comment=2145343","commentId":2145343,"userName":"manoftomorrow010","timestamp":1459548288,"content":"In the chart in the rulebook, combat goes as:\n\n \n\nDeal shadow cards.\n\nPlayer Actions.\n\nResolve enemy attacks on 1st player.\n\nResolve enemy attacks on other players in order, etc.\n\n \n\nAre there any opportunities to play events or take actions during/between those resolve enemy attack steps? Asking because I thought I found a good combination with Common Cause. Also, because my partner and I have just strictly been following that chart on when we can take actions only during the printed action windows on that chart.\n\n \n\nSo, my partner takes care of our combat with Tactics, and I do most of the questing. Let's say I'm using Aragorn, and he quests, but then, at the end of the quest phase, uses his ability to spend a resource and ready.\n\n \n\nIn combat, she has enemies engaged with her. They are dealt their Shadow cards, the action window passes, and she declares Gimli as a defender for an attack.\n\n \n\nAfter that attack resolves, can I play Common Cause to exhaust Aragorn, allowing her to ready Gimli for an attack later when we get to strike back at enemies?\n\n \n\nAlso, any other general comments about action windows can be helpful, too.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/215988-new-player-question-on-action-windows/?do=findComment&comment=2145449","commentId":2145449,"userName":"PocketWraith","timestamp":1459553089,"content":"Yes, there are action windows while resolving attacks - indeed while the chart at the back doesn't mention them I believe in the section specifically on combat it mentions that there is an action window after each step of resolving an attack.\n\n \n\nThe one thing which is wrong with your stated scenario is that Aragorn cannot spend a resource to ready at the end of the quest phase - his ability is a Response, so you have to choose to trigger it or not immediately when you commit him to the quest and before staging.\n\nThat aside, yes, if Aragorn was ready you could use Common Cause to exhaust him and ready Gimli in any of the action windows after declaring him as a defender, after revealing the shadow card, or after calculating combat damage.\n\nEdited April 1, 2016 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/215988-new-player-question-on-action-windows/?do=findComment&comment=2145612","commentId":2145612,"userName":"manoftomorrow010","timestamp":1459565221,"content":"> Yes, there are action windows while resolving attacks - indeed while the chart at the back doesn't mention them I believe in the section specifically on combat it mentions that there is an action window after each step of resolving an attack.\n> \n>  \n> \n> The one thing which is wrong with your stated scenario is that Aragorn cannot spend a resource to ready at the end of the quest phase - his ability is a Response, so you have to choose to trigger it or not immediately when you commit him to the quest and before staging.\n> \n> That aside, yes, if Aragorn was ready you could use Common Cause to exhaust him and ready Gimli in any of the action windows after declaring him as a defender, after revealing the shadow card, or after calculating combat damage.\n\n \n\n \n\nAhh thanks! Sorry, yes I definitely misstated when Aragorn would ready. I normally do it correctly in-game :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nCool, this makes that card more interesting than I originally thought."}]}