{"url":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/","title":"What to buy next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2159642","commentId":2159642,"userName":"beregrew","timestamp":1460231600,"content":"This is one of the big questions when newer players start playing the game. I've played for a while now and i have HoN(Heirs of Numenor) and Steward's Fear. I was planning to go through the against the shadow cycle pack first but then i decided that i probably should've gotten one of the easier and earlier sets like shadows of Mirkwood. So now i'm stuck here trying to decide what to buy next:P I'm considering mainly either continue with the against the shadow(and get them traps:)) or go back and get easier packs.\n\n \n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2162505","commentId":2162505,"userName":"Mndela","timestamp":1460385445,"content":"You started with HoN? You crazy?\n\n \n\nSure both options you tell are good: 1st cycle or something easier (i add: something much more easier)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2162612","commentId":2162612,"userName":"Authraw","timestamp":1460387766,"content":"I'd go back and get Shadows of Mirkwood packs if you can find them. They provide a pretty good entry point for the game as far as the quests go. Failing that, you could probably buy just about any other deluxe box and it would be okay, although the earlier boxes will be easier because they were designed with a smaller cardpool in mind. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2162664","commentId":2162664,"userName":"John Constantine","timestamp":1460389125,"content":"I wonder, how did it go for you, having only Core, HoN and Stewards Fear?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2164887","commentId":2164887,"userName":"DurinVoronwe","timestamp":1460464690,"content":"Hej proably bought for outlands."},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2164939","commentId":2164939,"userName":"Eldainorn","timestamp":1460466208,"content":"Heirs of Numenor is pretty okay if you own at least the eagles from the Mirkwood cycle. At least for Into Ithilien (love that quest) and Siege of Cair Andros. I had Core + Mirkwood cycle (except THOEM) and then went straight into HoN. I would probably buy Khazad-Dum instead, but it was out of stock everywhere at that time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2170050","commentId":2170050,"userName":"Serazu","timestamp":1460662665,"content":"For a starting player, my piece of advice would be to focus on the first two cycles and then jump to the sagas. Heirs, Voice, the Realm and the Havens can wait.\n\n \n\nAs far as the APs of those cycles are concerned, I'd say that Foundations of Stone and Shadow and Flame are the absolutely essential, since they provide loads of excellent cards and fun quests. Return to Mirkwood is also necessary if one wants to build a powerful Dwarf deck once he jumps into the Hobbit boxes. From then on, it depends. The Hunt for Gollum, the Conflict at the Carrock, The Dead Marches and the Watcher in the Water contain many useful player cards and very powerful heroes, save Bilbo who is... controversial. If I was starting the game anew, my first steps would be:\n\n \n\n1. Core Set\n\n2. The third copy of all the X2 cards in the CS. This bundle is modestly priced on the ebay and very useful to have.\n\n3. The Hunt for Gollum\n\n4. Conflict at the Carrock\n\n \n\n(With all the above, all the quests in the CS and the two in the APs are beaten with a Spirit / Lore / a splash of Leadership deck without much hassle. The Dol Guldur would be impossible solo, however. It's ok. It's meant to be very difficult for solo play)\n\n \n\n5. Khazad Dum\n\n \n\n(Its three quests will be beaten with the above sphere combination and the cards collected till then, though the 7th level will be a toss-up most of the time)\n\n \n\n6. Foundations of Stone\n\n7. Shadow and Flame\n\n \n\n8. Enter the LotR saga.\n\n \n\nIf money was really tight, I'd drop \"3\" and \"4\",  though I suspect I wouldn't be able to finish any quest save the very first one till FoS and SaF were entered into the equation.\n\n \n\nBut really, \"1,5,6,7\" are mandatory. I also cannot recommend \"2\" enough.\n\nEdited April 14, 2016 by Serazu"},{"commentUrl":"https://community.fantasyflightgames.com/topic/216821-what-to-buy-next/?do=findComment&comment=2170359","commentId":2170359,"userName":"beregrew","timestamp":1460674478,"content":"..i didnt realize that this post actually got shown today so, i guess ill try to answer all the posts right now.\n\n \n\n@mndela it was pretty cheap when i was buying so i just bought it anyway:P Surprisingly (after a few months..) i beat it yesterday somehow, i got lucky i guess.\n\n@ john Constantine it wasnt too painful because i avoided HoN alot.(i did take a break from the game to for a while)\n\n@Durin i actually didnt know how powerful outlands were until i bought it\n\n \n\n@Serazu, Mndela and Authraw Thanks for your replies, i'll buy the mirkwood cycle next and Khazad-Dum. After that i'll go rest of HoN, then probably Havens.\n\n \n\n \n\nThanks to everyone who answered. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] "}]}