{"url":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/","title":"If we had a new Hobbit hero...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170720","commentId":2170720,"userName":"GrandSpleen","timestamp":1460695051,"content":"We just got a new Hobbit hero fairly recently with Spirit Merry, but if we were to get a new one what would you hope for, particularly in terms of sphere and hero ability?\n\n \n\nI've got an answer of my own but I'll wait a bit to give it, so I don't influence the direction of the thread.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170725","commentId":2170725,"userName":"Nickpes","timestamp":1460695226,"content":"I would go for a Lore Old Gaffer ... ok I admitt that a hero would be too much but this is what I would like none the less. \n\n \n\nYou could play for free Spirit Sam ally and have an ability to raise Questing Power"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170742","commentId":2170742,"userName":"John Constantine","timestamp":1460697019,"content":"Tactics Sam to pwn some n00b orcz and rescue himself some master Frodo from da tower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170747","commentId":2170747,"userName":"donkler","timestamp":1460697323,"content":"Whatever it is, would be nice to have another hobbit in Tactics or Leadership. This was my submission to a recent Hallofbeorn contest (with gratuitously stolen Pathfinder art :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]).\n\n \n\nnob-by-sam-cook.jpg [https://hallofbeorn.files.wordpress.com/2015/11/nob-by-sam-cook.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170767","commentId":2170767,"userName":"DukeWellington","timestamp":1460698207,"content":"I strongly desire a leadership version of Frodo that has a secrecy enabling ability. We need a secrecy hero in purple and Frodo is perfect. Then we can run Frodo/Sam mono leadership secrecy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170808","commentId":2170808,"userName":"alexbobspoons","timestamp":1460701109,"content":"a Neutral sphere Sam, to represent his ability at general helping out..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2170871","commentId":2170871,"userName":"legolas18","timestamp":1460703897,"content":"I just desperately want a Farmer Maggot hero. Give him his dogs as allies, and some ability to go along with when he kills an enemy with his dogs. Like, \"After Farmer Maggot and a Dog ally both participate in an attack that defeats an enemy, add a resource to any hero's resource pool.\" He would have to be Tactics. Or Leadership maybe?\n\nOR give him high defense to represent his vigilance with which he guards his crops haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171021","commentId":2171021,"userName":"sepher32","timestamp":1460716819,"content":"I don't think Frodo fits in leadership. I wouldn't really attribute that quality to him. Spirit is the best fit, possibly the only one. He wasn't particularly learned nor combative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171109","commentId":2171109,"userName":"joezim007","timestamp":1460723033,"content":"I agree with Donkler. I don't particularly care who it is, but I'd love another hero in Leadership or Tactics with 7 or less threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171125","commentId":2171125,"userName":"Lecitadin","timestamp":1460723671,"content":"Tactics Fatty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171213","commentId":2171213,"userName":"Mndela","timestamp":1460727241,"content":"My leadership hobbit:\n\n \n\n65FM9tt.jpg [http://i.imgur.com/65FM9tt.jpg]\n\n \n\nIt is powerful with Small Target.\n\n \n\nPD: don't ask me why the name, i still don't know\n\nEdited April 15, 2016 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171262","commentId":2171262,"userName":"Calvadur","timestamp":1460728727,"content":"I feel every \"main\" hobbit should have a spirit hero incarnation as we are nearly there (Sam is missing and maybe Bilbo). But these two have or will have spirit ally versions, so that might never happen :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nApart from the spirit versions I would like a leadership hobbit, representing the leader(s) of the revolt during the scourging of the shire.\n\n \n\nI would go with Frodo (as he became mayor of the shire for a short time, if I remember correctly), but if I am not mistaken Merry played a much bigger role during the revolt, so I think Merry should be (the first) leadership hobbit.\n\n \n\nAs Hobbits are the made to be played in secrecy I think that should be supported:\n\n \n\nIf all heroes you Control have the Hobbit trait... (Note: I would want to ignore Fellowship/Baggins-sphere heroes, but I don't know how to word it)\n\nand you are at 20 threat or lower Merry gets an extra ressource during the ressource Phase.\n\nand you are above 20 threat lower your threat by 1 for every ressource spent from Merrys ressource pool.\n\nStats would be 6 threat, 1 willpower, 2 attack, 1 Defense and 2 hitpoints.\n\n \n\nThis Merry would make it possible to stay below 20 threat for most of the game (maybe a littler easier than Spirit Merry), but you have to use only Hobbit heroes to show that Merry leads the People of the shire not some other force.\n\nEdited April 15, 2016 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171346","commentId":2171346,"userName":"dalestephenson","timestamp":1460731008,"content":"> I don't think Frodo fits in leadership. I wouldn't really attribute that quality to him. Spirit is the best fit, possibly the only one. He wasn't particularly learned nor combative.\n\nDefinitely not combative.  But I'd say he was easily the most learned of the four fellowship hobbits.  He had learned to speak Quenya while still a minor, and he was also the recorder of the entire LOTR in the Red Book.  Leadership is also justifiable for Frodo, as he was the clear leader of the hobbits before Aragorn joined the expedition.\n\n \n\nFarmer Maggot could also be a candidate for Lore, since he's no less than Bombadil's source for knowledge of the Shire.  \"There's earth under his old feet, and clay on his fingers; wisdom in his bones, and both his eyes are open.\"\n\n \n\nMerry's leadership skills are apparent in the scouring of the shire, but Tom Cotton also distinguishes himself as the Hobbiton leader in that revolt and could fit in leaders.  Armed conflict with Sharkey's men had actually been started by Thain Paladin Took, who I think would make a reasonable tactics character.\n\n \n\nA problem with all the well-known hobbits is that none were actually active outside the Shire between the Hobbit and the Lord of the Rings.  The geneological tables include only one possible hobbit who was, Hildifons Took who \"went off on a journey and never returned\".  But as the older brother of Belladonna Took, he would've been over 90 when Bilbo went on his adventure, and dead before many of our current heroes were born.  Still, there's undoubtedly Tooks not on the chart who journeyed away from the Shire in the game's period, so FFG could certainly invent one.  The Bree hobbits were not as insular as the Shire hobbits, so could also be a viable source for invented heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171369","commentId":2171369,"userName":"GrandSpleen","timestamp":1460731785,"content":"We have two kinds of Hobbit heroes at present, I think.  One type is those that sneak and keep low threat, with mechanics built up around engaging enemies with an engagement cost higher than your threat.  Sam, Pippin (Lore), and a slew of player cards support that mechanic.  Threat-reducing Hobbit-themed cards such as Hobbit Pipe synergize with this for support it further, as well as the Secrecy keyword.\n\n \n\nThe other type is those that treat threat as currency and raise it for beneficial effects.  Frodo, Pippin (Spirit), and Fatty fit here.  Their abilities work directly against the main Hobbit strategy of the other type, since you never want to be raising your threat with Sam & Pippin (Lore). In theory this creates a balancing act that makes the deck more tense to play, but in practice nobody includes these guys in Hobbit decks.  There's no good reason to do it.\n\n \n\nSo I'd like to see a hero (and more player cards) that support this second mechanic.  It could breathe life into Pippin and Fatty.  Frodo already gets plenty of play because his ability is so good, but he's usually not in theme decks.  You could give the ability to a minor named character, but I'd like to see it on a new version of Bilbo maybe.\n\n \n\nWhat would it do?  Wording it is kind of card.  I thought about the phrasing \"When you raise your threat as the result of a player card effect,\" but that synergizes perfectly with Doomed cards.  Those are powerful enough already.  You could exclude them with \"...as the result of a player card effect with the Hobbit trait,\" but that makes it very limited and makes for very limited design space.  Anyway, someone clever could come up with a better way to do it, but I think it'd be cool to see mechanics that key off of raising your threat for Pippin (Spirit), Fatty, and Frodo's abilities.\n\n \n\nAfter raising your threat, maybe let you draw card, add stats to some ally or hero, ready a character... all kind of standard game effects. If we want to make it more unique we could do something like,\n\n \n\n\"Response: After raising your threat by X as the result of a player card effect with the Hobbit trait, pay X resources to put an attachment into play from your hand and attach it to a character you control.\"\n\n \n\nFatty would become a resource engine, we'd see more use of Frodo's ability outside of emergency situations, and it would support the idea of building up Hobbit decks around attachments instead of allies.  It'd let you play attachments outside of the planning phase, essentially, and at a potential (but not guaranteed) discount."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171414","commentId":2171414,"userName":"Slothgodfather","timestamp":1460733526,"content":"I'd much rather prefer they make a playable hobbit hero  - particularly in leadership or tactics, but mostly leadership - instead of trying to breath life into Pippin and Fatty.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171443","commentId":2171443,"userName":"PocketWraith","timestamp":1460734195,"content":"Fatty can actually be pretty good already, slot in some threat reduction and go nuts with your repeatable Radagast's Cunning; or he can make an OK defender as well. SPippin is a lost cause."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171452","commentId":2171452,"userName":"GrandSpleen","timestamp":1460734383,"content":"Spirit Pippin would be great if there were mechanics that worked off of returning enemies to the staging area.  That would take too much development just to support one card, though, when we already have a very good Pippin alternative.\n\n \n\nFrodo is lonely out there in outlier land, he works against the existing Hobbit meta.  Would love to see him included in some way, and since raising threat to trigger abilities is already a theme on 3 existing Hobbit heroes, why not support it more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171489","commentId":2171489,"userName":"DukeWellington","timestamp":1460735440,"content":"I don't think we need to breath life into one of the best heroes in the game. I understand the desire to include Frodo in a Hobbit theme deck. It is the same kind of desire to have an Aragorn/Gimli/Legolas hero lineup. So I get it. I just think a better solution is new versions of heroes that enable those themes directly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171607","commentId":2171607,"userName":"Teamjimby","timestamp":1460738412,"content":"I don't think we need another tactics hobbit hero.  It doesn't really make sense thematically, and Merry already fills that role perfectly. \n\n \n\nMy vote would be for a new version of Bilbo, since the original is very rarely played.  Ideally 6 threat in either the leadership or lore sphere.  Bilbo's stories encourage Frodo, so maybe he could be like \"Action: Exhaust Bilbo to give each Hobbit you control +1 Willpower until the end of the phase (limit once per phase).\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171736","commentId":2171736,"userName":"dalestephenson","timestamp":1460741855,"content":"> I'd much rather prefer they make a playable hobbit hero  - particularly in leadership or tactics, but mostly leadership - instead of trying to breath life into Pippin and Fatty.  \n\nI'd rather breath life into Pippin and Fatty, since one hero that works well with Pippin and Fatty gives you three viable heroes for the price of one.  But I'd rather it works on its own rather than have such a narrow ability that it only works with Pippin and Fatty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171761","commentId":2171761,"userName":"dalestephenson","timestamp":1460742425,"content":"> Spirit Pippin would be great if there were mechanics that worked off of returning enemies to the staging area.  That would take too much development just to support one card, though, when we already have a very good Pippin alternative.\n\nWe do at least have some mechanics that benefit from enemies being in the staging area.  Unfortunately Haldir won't work with SpPippin because he puts an enemy back after it has engaged, but both Dunhere and LoFaramir want enemies in staging, and for ambush enemies SpPippin could push an enemy back into an unfilled trap.\n\n \n\nThe best use I think would be in conjuction with an enemy-hungry combat deck without ranged power.  SpPippin could make sure the occasional enemy that comes to the non-combat deck gets pushed back so the combat deck can take it.  If used with SpMerry, the occasional threat increase from pushback should be compensated by regular threat removal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171804","commentId":2171804,"userName":"Slothgodfather","timestamp":1460743524,"content":"Note that for Pippin to work you have to run all hobbits, so Dunhere or LoFaramir would have to be ran by a companion deck anyways.  I don't see the SpPippi and PsMerry combination bringing much to the table.   Granted, that is where you are going with wanting to see some additional effect/hero/support.   I feel in this case it would have to be a Lore hobbit so you'd have access to Fast Hitch.  Maybe if it had an ability to add progress to a location based on the number of enemies in the staging area? Perhaps restricted to requiring all hobbits like Pippin does?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2171900","commentId":2171900,"userName":"dalestephenson","timestamp":1460746651,"content":"It's the all-hobbit restriction that makes SpPippin so spectacularly useless.  Dunhere and LoFaramir can benefit from it, but can't benefit with him, and that means that SpPippin's deck and their deck alike need to avoid engagement.  So we do indeed need another Hobbit.\n\n \n\nThe SpPippin and SpMerry combination is that SpMerry's ability can work against SpPippin's threat increase.  In order for an enemy to engage, it typically must first be revealed, and with SpMerry's ability that can reduce threat.  So even in the case where SpPippin's ability has to be used, the net threat increase would be minimal.  And in cases where it doesn't have to be used (other deck prevents engagement) SpMerry can keep threat low.  SpMerry allows SpPippin to be used in a secrecy deck.\n\n \n\nDoes the third hobbit need to be lore?  That doesn't help SpPippin, but can come in handy for SpMerry to quest and reduce, or even reduce more than once.  However, since SpPippin needs a companion deck, the companion deck could certainly be Lore as well.  We've got quite a lot of support for being engaged with those with higher than engagement, which synergizes greatly with Sam/LoPippin/TaMerry.  But unfortunately, there's little support for hobbit/secrecy primarily aimed at non-combat prowess, which is what the SpPippin deck needs to be.  However, I think such support would be useful for secrecy decks in general, besides making SpPippin more useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2172024","commentId":2172024,"userName":"Slothgodfather","timestamp":1460749652,"content":"If you are using SMerry in the first place, it's unlikely that you are going to be engaged anyways since it is easy to get and maintain secrecy with hobbits.  With that in mind, how often are you actually engaging an enemy with so low threat?  And if you aren't utilizing Spippen very often, why not just include 3x of A Light in the Dark and then bring a hero who actually brings something useful to the table?\n\n \n\nA Light is actually better for both companions mentioned earlier (Dunhere and LoFaramir and even Haldier) considering it keeps the enemy in the staging area since you can play it in the Combat phase (or any phase).  Unlike SPippen's ability where your companion deck will surely get engaged with it and it doesn't remain in the staging area.\n\n \n\nSo as is, you can quest for 4 from your heroes, keep relatively low threat through use of fast hitch and SMerry, and can make sure you don't have to fight anyone.  Since SPippin's ability has to go off when you engage them, meaning you are never engaged with them during combat, the things that buff you for engaging things with higher engagement cost don't matter.\n\n \n\nI'm not sure what it would take really to make this combination of things to be worth it to me and to feel like I was really contributing to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2172080","commentId":2172080,"userName":"dalestephenson","timestamp":1460751983,"content":"With low threat, it's not likely you'll be engaging very often at all.  Ambushers and low-threat heroes, basically.\n\n \n\nWith that said, if you *never* want an engaged enemy, SpPippin is better than A Light in the Dark, since he doesn't cost resources and is always available, which isn't true even of a 3x event card.  He only costs threat, which you have plenty of.\n\n \n\nNow, it's true that A Light in the Dark would work better for controlling the timing, which benefits Haldir/Dunhere/LoFaramir who wants enemies in stagings.  However it's not better for a companion deck that doesn't mind engaging enemies, such as Dunedain or a tactics deck with Mablung.  Because there's no good way to have a SpPippin solo deck, he needs to be paired with fighters, not staging attackers.\n\n \n\nSo if SpPippin's ability is only an emergency hatch for a total non-combat deck, what does SpPippin offer?  2 wp for 6 threat, which by itself isn't bad at all.  You could pair him and SpMerry with any hobbit but Bilbo, and SpMerry could drive them into secrecy easily with Bilbo.  The trouble is that only Bilbo would really have a useful ability to pair with SpPippin and SpMerry.  If Fatty weren't such a poor quester, he wouldn't make a bad third.\n\n \n\nNow what could you do with a deck that doesn't worry about combat at all?  Fill 50 spots with interesting cards that don't have to do with combat.  Enough to \"feel like you were really contributing\"?  Maybe not for you, and I'm not advocating that you bring a SpMerry/SpPippin/Fatty deck to a meetup event.  But I think that it might be an interesting deck to play two-handed solo combined with a nice Dunedain deck.  Maybe it'd never be better than a deck that replaces SpPippin with SpGlorfindel and 3x Light of Valinor, but that's not the point.  The point is that SpPippin allows you to do something that ordinarily isn't done -- never be in combat.  If there aren't enough cards to make a total-non-combat deck interesting to play, then we clearly need more cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2172166","commentId":2172166,"userName":"Authraw","timestamp":1460754817,"content":"SpPippin would be more interesting if we had a Hobbit hero that did something to enemies in the staging area. For instance:\n\nResponse: When a non-unique enemy enters the staging area, deal 1 damage to it. Deal 2 damage instead if its engagement cost is higher than your threat.\n\n \n\nor\n\n \n\nAction: Exhaust this hero to choose a non-unique enemy in the staging area. Deal 1 damage to that enemy.\n\n \n\nI still say it's a pity you can't use Spirit Pippin in conjunction with Lore Pippin--they'd make a great team, trading threat for card draw."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2173434","commentId":2173434,"userName":"Hawkstrike","timestamp":1460849372,"content":"Rosie Cotton. (Spirit?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2173486","commentId":2173486,"userName":"Network57","timestamp":1460853684,"content":"> Rosie Cotton. (Spirit?)\n\nPlease have all my likes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2173896","commentId":2173896,"userName":"Mazarbul","timestamp":1460897858,"content":"Lobelia Sackville Baggins.\n\nLore Hero.\n\nThief trait.\n\nAction: Look at the top 10 cards of another Hobbit hero's deck, and chose one attachment card. Attach that card to Lobelia Sackville Baggins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2173920","commentId":2173920,"userName":"zeromage","timestamp":1460899974,"content":"Rose Gardner (Spirit)\n\nStarting Threat: 3\n\nWillpower: 1\n\nAttack: 0\n\nDefense: 0\n\nHP: 2\n\n \n\nWhile Rose is in play, Samwise Gamgee gets +1 willpower \n\n \n\nI'd like to see a hero with super low threat just to give us some secrey options.\n\n \n\nHamfast Gamgee (Lore)\n\nStarting Threat: 4\n\nWillpower: 2\n\nAttack: 0\n\nDefense: 0\n\nHP:2\n\n \n\nHamfast can't quest, attack or defend. \n\n \n\nDraw one extra card every turn\n\n \nExhaust Hamfast to add his willpower to target hobbits willpower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2174389","commentId":2174389,"userName":"joezim007","timestamp":1460935794,"content":"Interesting options. Practically a 2 hero deck when you include someone with such low Threat, but you still start with the extra resource generation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2175278","commentId":2175278,"userName":"Calyx","timestamp":1460996382,"content":"> With low threat, it's not likely you'll be engaging very often at all.  Ambushers and low-threat heroes, basically.\n> \n>  \n> \n> With that said, if you *never* want an engaged enemy, SpPippin is better than A Light in the Dark, since he doesn't cost resources and is always available, which isn't true even of a 3x event card.  He only costs threat, which you have plenty of.\n> \n>  \n> \n> Now, it's true that A Light in the Dark would work better for controlling the timing, which benefits Haldir/Dunhere/LoFaramir who wants enemies in stagings.  However it's not better for a companion deck that doesn't mind engaging enemies, such as Dunedain or a tactics deck with Mablung.  Because there's no good way to have a SpPippin solo deck, he needs to be paired with fighters, not staging attackers.\n> \n>  \n> \n> So if SpPippin's ability is only an emergency hatch for a total non-combat deck, what does SpPippin offer?  2 wp for 6 threat, which by itself isn't bad at all.  You could pair him and SpMerry with any hobbit but Bilbo, and SpMerry could drive them into secrecy easily with Bilbo.  The trouble is that only Bilbo would really have a useful ability to pair with SpPippin and SpMerry.  If Fatty weren't such a poor quester, he wouldn't make a bad third.\n> \n>  \n> \n> Now what could you do with a deck that doesn't worry about combat at all?  Fill 50 spots with interesting cards that don't have to do with combat.  Enough to \"feel like you were really contributing\"?  Maybe not for you, and I'm not advocating that you bring a SpMerry/SpPippin/Fatty deck to a meetup event.  But I think that it might be an interesting deck to play two-handed solo combined with a nice Dunedain deck.  Maybe it'd never be better than a deck that replaces SpPippin with SpGlorfindel and 3x Light of Valinor, but that's not the point.  The point is that SpPippin allows you to do something that ordinarily isn't done -- never be in combat.  If there aren't enough cards to make a total-non-combat deck interesting to play, then we clearly need more cards.\n\n \n\nThis sounds like a fine idea... but there are now many quests where enemies that are immune to player card effects forcibly engage you, or you have to take an attack from an enemy in the staging area. You could compensate for this using chump blockers, maybe... including ranged characters is also probably a good idea (so you can help out with combat even if nothing engaged you).\n\n \n\nStill, it would be best to pair with a deck that is strong on defense, and one that hopefully has sentinel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2176388","commentId":2176388,"userName":"joezim007","timestamp":1461037715,"content":"I don't know how you would include Ranged allies in a mono spirit deck, since there are no spirit allies with Ranged and only 1 neutral ally with Ranged and he requires a leadership card to be played just to shuffle him into the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2184386","commentId":2184386,"userName":"Hawkstrike","timestamp":1461521297,"content":"Bring on Tom Cotton for Leadership or Tactics, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2184426","commentId":2184426,"userName":"GrandSpleen","timestamp":1461524801,"content":"Here's an event I'd like to see and would work well in a Hobbit deck:\n\n \n\nCost: either 1 or 0\n\nSphere: Spirit\n\nResponse: After you lower your threat by X, choose a hero you control.  That hero gets +X willpower until the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2203063","commentId":2203063,"userName":"GrandSpleen","timestamp":1462495985,"content":"Put together a couple of ideas based on my own wishlist and some ideas in this thread...\n\n \n\nFrodo-Baggins-Front-Face_zpsuzwby96v.jpg [http://i503.photobucket.com/albums/e440/grandspleen/Frodo-Baggins-Front-Face_zpsuzwby96v.jpg]\n\n \n\nFarmer-Maggot-Front-Face_zpsggwq6j4f.jpg [http://i503.photobucket.com/albums/e440/grandspleen/Farmer-Maggot-Front-Face_zpsggwq6j4f.jpg]\n\nEdited May 6, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2203086","commentId":2203086,"userName":"Rajam","timestamp":1462497742,"content":"Farmer Maggot is broken haha, the ability is awesome. Why is it a response though? Shouldn't it be a once-per-round action?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2203175","commentId":2203175,"userName":"GrandSpleen","timestamp":1462502806,"content":"Oops, that should be an action.  Just an error.\n\n \n\nedit: there, fixed it.\n\n \n\nI wondered if people would think it's too powerful.  I could make X the number of players in the game, then it's really quite limited.  But I wanted him to help you fish for Tom Bombadil somehow...  In his current form you're only ever getting scry on the top card, and you *have* to pick one of the cards that you see, even if they are all terrible.  But yeah, definitely a powerful effect.\n\n \n\nAlso considered having him pull a card out of the discard pile at some cost, or maybe limit once per game.\n\nEdited May 6, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2203400","commentId":2203400,"userName":"DukeWellington","timestamp":1462517491,"content":"Back in the day before the mirror of Galadriel came out that was the ability (on Farmer Maggot) I predicted for the mirror. I think it is a great ability. I'm just not sure how it fits thematically on that character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2203427","commentId":2203427,"userName":"DukeWellington","timestamp":1462519649,"content":"Also, I just remembered it while reading the comments, but I have always wanted a tactics Bilbo with some kind of combat bonus connected to spiders. I personally love the Dwalin hero, for those who don't know, and Bilbo could be like the Dwalin of spiders. I realize this would be a garbage hero only used in like 2 scenarios, but something like that would appeal to me because of strong theme."},{"commentUrl":"https://community.fantasyflightgames.com/topic/217404-if-we-had-a-new-hobbit-hero/?do=findComment&comment=2204865","commentId":2204865,"userName":"GrandSpleen","timestamp":1462570138,"content":"> I'm just not sure how it fits thematically on that character.\n\n \n\nAs for that, I've been re-reading Fellowship lately and that is what got me thinking about Farmer Maggot in the first place.  He is described by Tom Bombadil as having \"both eyes open\" and \"wisdom in his bones,\" and Merry says he has a \"reputation for knowing a good many strange things.\"  He very nearly guesses why Frodo has fled Hobbiton (he does guess that Frodo is being pursued for something to do with Bilbo's treasure).  After all that, he seemed to belong in Lore and a scrying ability followed reasonably."}]}