{"url":"https://community.fantasyflightgames.com/topic/217765-gamer-selling-entire-collection-with-rare-extras/","title":"Gamer selling entire collection with rare extras","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/217765-gamer-selling-entire-collection-with-rare-extras/?do=findComment&comment=2177048","commentId":2177048,"userName":"Gandolf","timestamp":1461078936,"content":"Hello,\n\nI'm a long time player of this game, however, over the last year or so I haven't had the time to keep up with it so I would like to pass on my full collection to another gamer at a considerable discount of it's value.\n\n(In the UK)\n\nHUGE collection of The Lord of The Rings LCG (The Living Card Game) Collection + Very Rare Extras\n\nHere is a huge collection of the game, up to and over The Voice of Isengard expansion, with a lot of extras thrown in, some you cannot even buy anymore. There are literally thousands of cards here, it is an immediate collection for anyone who buys this, so its worth buying even if you have a few packs already as youre saving a lot of money here rather than buying them one by one.\n\nThe cards range from excellent to like new, some of the very early packs (these are all first edition printings) are a little curved from play (not bent, curved...if you play cards you know what i mean) but this doesnt distract from them.\n\nHere is a full run down of what you get.\n\n2 x Core Set (so you can have up to 4 players and more copies of cards to use)\n\nKhazad dum deluxe Expansion + All 6 following cycle packs\n\nHeirs of numenor deluxe expansion + all 6 following cycle packs\n\nBoth The Hobbit Saga expansion boxes\n\nThe Black Rider and The Road Darkens (LOTR Main Book) saga expansions\n\nVoice of Isengard deluxe expansion + the first two following expansion packs (dunland trap and three trials)\n\nMassing at Osgilliath, the stone of erech, the old forest, and the fog on the barrow downs gaming event packs\n\nNightmare packs for core set (one of the sets has no cover though this doesnt matter) and 6 x nightmare expansion packs for the first cycle (for making the game harder for experienced players or more players)\n\n2 x rare Aragorn alternate hero art cards\n\n4 x VERY RARE playmats (i think you could only get these at certain events in the US)\n\n5 x artwork sleeves ( 250 sleeves in total) (for protecting carsd whilst playing)\n\n2 x gaming event memorabilia from popular blog (coin and card padded sleeve)\n\n1 x card box VERY RARE\n\nCards will be shipped in a large protected box. I have organised the player cards together into their respective spheres and catagories, and the enemy cards are in their respective packs.\n\nTwo of the deluxe expansion boxes do not have card inserts. (This is only to keep cards in place, nothing to do with the game)\n\nWould like to sell the as a whole collection ands not split them up.\n\nThank you\n\n£300"}]}