{"url":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/","title":"Campaign mode heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2195177","commentId":2195177,"userName":"Ghost Dancer","timestamp":1462107606,"content":"After a bit of a break from the game, I've finally got round to starting the Road Darkens.\n\n \n\nI completed the Black Riders with a Hobbit deck, but I would like to continue the saga using the new Gandalf hero that came with the set. However, according to the campaign rules I have to take a threat hit if I change heroes.\n\n \n\nIt seems odd that I'm penalised for using the new hero in the saga expansion. Have I missed something somewhere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2195183","commentId":2195183,"userName":"dalestephenson","timestamp":1462107814,"content":"Campaign mode for the first quest in the Road Darkens states:\n\n \n\nSetup: Each player may change hero cards he controls without incurring the +1 threat penalty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2195214","commentId":2195214,"userName":"Ghost Dancer","timestamp":1462109039,"content":"Ah thanks, didn't think to check the cards, I was scouring the rule book."},{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2210750","commentId":2210750,"userName":"Calvadur","timestamp":1462907093,"content":"> Ah thanks, didn't think to check the cards, I was scouring the rule book.\n\n \n\nYeah I think it should be mentioned in the rules, too! I only check out the playercards to have a Little of a surprise when playing the quests (sadly only 1 of a time effect :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]). Ans usually I build the deck before looking at the quest cards^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2218567","commentId":2218567,"userName":"Sevordo","timestamp":1463336483,"content":"If it helps at all, an alternate way my brother and I played the Campaign was forgoing the +1 threat per changed Hero and simply never adding the reward Boons to Heroes to balance it out. We found it much more fun to be able to use the array of Heroes and decks we have (from owning everything) than restricting ourselves to the same cards every game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/218804-campaign-mode-heroes/?do=findComment&comment=2218600","commentId":2218600,"userName":"GrandSpleen","timestamp":1463339038,"content":"Another variant that keeps to theme is to not make a list of heroes for your campaign, but instead to make a list of unique characters.  Then any versions may be swapped between quests without penalty, but you can't subtract or add any unique heroes or allies (without a threat penalty) unless the campaign cards say you can change heroes without a threat penalty.  At the end of a quest, a character is considered dead if all copies are in the discard pile.  Or something stricter if you prefer.\n\n \n\nThis way you can use ally Legolas in one quest and hero Legolas in another, staying nicely thematic and giving yourself a lot more flexibility in deckbuilding to match the unique challenges of each quest.  You'd still be limited to using Permanent boons with heroes, so if you put Intimidation on hero Gimli but swap him out for ally Gimli in a subsequent quest, you'd lose the benefit of that boon.\n\nEdited May 15, 2016 by GrandSpleen"}]}