{"url":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/","title":"Custom made cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2199174","commentId":2199174,"userName":"Valdemart","timestamp":1462352855,"content":"Recently I have returned to playing LotR LCG with a new passion and although I am still trying to catch up with adventure packs and expansions based on my budget and interest as well, I could not help but notice that some of the iconic characteres of Middle Earth are still missing (naturally, there are ton of personalities, time is a thing).\n\n \n\nAfter a quick discussion with my better half, we decided that the King of the Elves, Thranduil, does deserve to appear in the game as soon as possible. Therefore, I set to design an appropriate card that bears the mark of the Elvenking and is actually balanced and suited for play. So without further ado, here is the final result of a lot of brainstorming, character research and fail-testing:\n\n \n\n \n\nPkmzAgG.jpg [http://i.imgur.com/PkmzAgG.jpg]\n\n \n\n \n\nThis card is for personal use only, image taken from DeviantArt artist Valyavande (Julia Metzger) - go check her out, her creations are beyond awesome: http://valyavande.deviantart.com/ [http://valyavande.deviantart.com/]\n\n \n\nI hope you like the final result. Feel free to post your home-made cards as well, comments and suggestions are welcome as well! Should I think of another character/item/event from the Middle Earth lore that deserves to enter the game, you will find it here as well.\n\n \n\nHappy playing!\n\nEdited May 4, 2016 by Valdemart"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2199297","commentId":2199297,"userName":"Flrbb","timestamp":1462364972,"content":"Probably you should specify if it is also allowed to return that ally from discard pile (or just allies from \"in game\")."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2199400","commentId":2199400,"userName":"Valdemart","timestamp":1462369516,"content":"> Probably you should specify if it is also allowed to return that ally from discard pile (or just allies from \"in game\").\n\n \n\nYou are right, the part \"you control\" seems to have dropped from the final text clipping. It is \"Return a Silvan ally you control to your hand.\"\n\n \n\nI have fixed the card to display the proper text. Thank you for the hint!\n\nEdited May 4, 2016 by Valdemart"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2201074","commentId":2201074,"userName":"joezim007","timestamp":1462424397,"content":"Does \"that resource\" refer to the additional resource or to the original one you placed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2201100","commentId":2201100,"userName":"John Constantine","timestamp":1462425582,"content":"I think, the proper wording would be \"After Thranduil collects resources during the resource phase\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2201191","commentId":2201191,"userName":"Valdemart","timestamp":1462432217,"content":"> Does \"that resource\" refer to the additional resource or to the original one you placed?\n\n \n\nFor me the wording seems correct because it is part of the either... or statement, so the text following \"or\" should be related to the statement prior \"either\".\n\n \n\nRegarding the first part - I agree with John's suggestion that it should be \"after he collects resources\" because otherwise resource giving effects may be triggered during the Resource phase and allow him to trigger his Response additional times, which is not intended. I had great trouble finding the proper wording AND fitting it on the card. Does this sound more correct:\n\n \n\nResponse: After Thranduil collects resources during the resource phase instead of drawing a card you may discard that resource to either add 2 resources to his pool or draw 2 cards.\n\n \n\nIt is still a little obscure, but I checked again the current card pool and I found no contradictions - effects like Bilbo, Erestor and Cirdan's additional draw happen at the beginning of the Resource phase, which I believe should be before resource collection.\n\n \n\nThank you all for the suggestions and corrections."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219037-custom-made-cards/?do=findComment&comment=2201278","commentId":2201278,"userName":"PsychoRocka","timestamp":1462439336,"content":"Great concept! Really like the design, good luck in the competition ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}