{"url":"https://community.fantasyflightgames.com/topic/219373-dunland-trap-timing-of-forced-effects/","title":"Dunland Trap Timing of Forced Effects","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/219373-dunland-trap-timing-of-forced-effects/?do=findComment&comment=2205956","commentId":2205956,"userName":"cmabr002","timestamp":1462645391,"content":"Stage 3 Quest Card: Forced: After the last time counter is removed from this stage, the players make engagement checks. Then, each engaged enemy makes an attack. If no heroes are destroyed by these attacks, the players win the game.\n\n \n\nIn Need of Rest (Condition Attachment): Forced: After a time counter is removed from the current quest, attached hero takes 1 damage.\")\n\n \n\nOkay so Chief Turch is obviously in play and during the encounter phase we choose to optionally engage two enemies removing the final 2 time counters from the quest. \n\n \n\nBoth the Forced effect on the Stage 3 quest card and the condition attachment trigger after a time counter is removed from the quest stage.  Since they are both forced effects, can we trigger them in the order we want?\n\n \n\nThis matters significantly because, in this game I just played, if we survive these attacks we would win before the Forced effect on the Condition attachment can trigger, killing one of our heroes (causing us to lose as a result due to the other requirement that no heroes can be destroyed on the final stage)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219373-dunland-trap-timing-of-forced-effects/?do=findComment&comment=2206156","commentId":2206156,"userName":"GrandSpleen","timestamp":1462658753,"content":"I didn't see any hints about an order to resolve these in the Voice of Isengard rules, so I suppose it falls under the rubric of the 'simultaneous effect timing' entry in the FAQ, and you can choose the order.  So, you can win,\n\n \n\nIf there is indeed a 'preferred' order, I would assume the card losing the time counter would trigger first, and you would win anyway.  Either way, you're good.  But since there is no support that I know of for a particular order of resolution when a time counter causes multiple effects to trigger, I think you can select the order."}]}