{"url":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/","title":"Galadriel + Galdhrim Healer + Text Box Blanking","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2210656","commentId":2210656,"userName":"cmabr002","timestamp":1462904764,"content":"1) Cold from Angmar is attached and Galadriel is damaged\n\n \n\n2) Play Galadhrim Healer to fully heal Galadriel\n\n \n\n3) Does Galadhrim Healer exhaust to quest?\n\n \n\n> Cold from Angmar: Attach Cold from Angmar to the current quest. (Counts as a Condition attachment with the text: “Treat each damaged character’s printed text box as if it were blank, except for keywords and Traits.”)\n\n> Galadhrim Healer:  Response: After Galadhrim Healer enters play, choose a player. Heal 1 damage from each hero controlled by that player.\n> \n>  \n\n> Galadriel: Allies you control do not exhaust to quest during the round they enter play.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2210666","commentId":2210666,"userName":"Kakita Shiro","timestamp":1462905070,"content":"I say quests-without-exhausting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2210680","commentId":2210680,"userName":"Calvadur","timestamp":1462905360,"content":"Pretty sure it does not.\n\nGaladriel's effect is passive an therefore always active (if not blank ofc). It is still the round the ally entered play so as soon as Galdriels text is active it does not exhaust. Would be different if it was an Action you would have to trigger after you played the ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2210706","commentId":2210706,"userName":"cmabr002","timestamp":1462905867,"content":"> Pretty sure it does not.\n> \n> Galadriel's effect is passive an therefore always active (if not blank ofc). It is still the round the ally entered play so as soon as Galdriels text is active it does not exhaust. Would be different if it was an Action you would have to trigger after you played the ally.\n\n \n\nYeah, this is what I think too.  But what's interesting about this is that it means that each card that enters play is basically sending out a constant signal saying \"I entered play this round\" looking for any effects that will boost it.  I wonder if it will be relevant for future card design\n\nEdited May 10, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2213112","commentId":2213112,"userName":"Teamjimby","timestamp":1463018962,"content":"I think the healer would be able to quest without exhausting.  It reminds me of the situation with Leaf Brooch where if you play an event, then play leaf brooch, you have already missed your opportunity for the round.  So I think passive effects have a retroactive memory."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2213354","commentId":2213354,"userName":"Nerdmeister","timestamp":1463039048,"content":"Wouldn´t this fall under the new FAQ?\n\n \n\n(1.55) Lasting Effects\nThere are two classes of lasting effects in the game: those created by player cards and those created by encounter cards. Each class is handled differently as follows:\nA lasting effect created by a player card ability must be calculated at the time that the ability is triggered, and that effect is not recalculated if the game state changes.\nFor example: If a player triggers the Quest Action on Nenya (RM 121) to add Galadriel’s (RM 112) 4 willpower to another hero until the end of the phase, that +4 willpower bonus will not be recalculated if Galadriel’s willpower is increased later that phase.\nA lasting effect created by an encounter card ability, is recalculated if the game state changes.\nFor example: Part of the ‘when revealed’ ability on Poisoned Vapour (ToS 61) reads: “Until the end of the combat phase, treat each damaged character’s text box as if it were blank (except for Traits).” If Aragorn (ToS 1) had 1 damage at the time Poisoned Vapour was revealed, his text box would be treated as if it were blank. However, if that damage was healed, his text box would no longer be considered blank. If he was damaged again, his text box would be treated as if it were blank until the end of the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2213953","commentId":2213953,"userName":"PocketWraith","timestamp":1463063641,"content":"No, because passive effects (such as allies not exhausting to quest in their first round with Galadriel) are not triggered at any point, they're always active. They're different to lasting effects in that respect.\n\nEdited May 12, 2016 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2215457","commentId":2215457,"userName":"Nerdmeister","timestamp":1463128310,"content":"> No, because passive effects (such as allies not exhausting to quest in their first round with Galadriel) are not triggered at any point, they're always active. They're different to lasting effects in that respect.\n\nMaybe this has been discussed or clarified somewhere but this makes me curious as to the precise definition of when something is considered a lasting effect or a passive effect"},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2215534","commentId":2215534,"userName":"cmabr002","timestamp":1463135743,"content":"> > No, because passive effects (such as allies not exhausting to quest in their first round with Galadriel) are not triggered at any point, they're always active. They're different to lasting effects in that respect.\n> \n> Maybe this has been discussed or clarified somewhere but this makes me curious as to the precise definition of when something is considered a lasting effect or a passive effect\n\nI can tell you a passive effect is just one without a bold trigger like Action, Forced, or Response etc. However, \"lasting effects\" are not well defined. I believe a lasting effect is anything that says \"until the end of X\", but can't say for certain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2215612","commentId":2215612,"userName":"Nerdmeister","timestamp":1463140585,"content":"Seems to me that both effects have the absense of a bold trigger in common.\n\nIs it outside the realm of possibilities that \"until the end of X\" simply creates a passive effect for the duration and that both would be treated the same way?\n\nWould love to see a clear definition."},{"commentUrl":"https://community.fantasyflightgames.com/topic/219625-galadriel-galdhrim-healer-text-box-blanking/?do=findComment&comment=2215761","commentId":2215761,"userName":"NathanH","timestamp":1463147315,"content":"Passive effects are effects that don't have a trigger, they are just written on a card.\n\n \n\nA lasting effect is an effect that originated from a Forced or Response trigger but persists beyond the instant the effect is triggered.\n\n \n\nIn the past, lasting effects essentially functioned the same as passive effects once they were triggered, in that you could imagine there's a \"lasting effects card\" in the game that would record all the currently active lasting effects and have them function as passive effects, but this lead to problems with a few cards.\n\n \n\nEffectively, a Lasting Effect from an encounter card can be treated simply as a Passive Effect with exactly the same wording. A Lasting Effect from a player card, however, can be treated as a Passive Effect in which all relevant calculations have already been done.\n\nEdited May 13, 2016 by NathanH"}]}