{"url":"https://community.fantasyflightgames.com/topic/220870-complete-tutorial-and-how-to-play-video-for-lotr-lcg/","title":"Complete Tutorial and How to Play Video for LOTR LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/220870-complete-tutorial-and-how-to-play-video-for-lotr-lcg/?do=findComment&comment=2234018","commentId":2234018,"userName":"TheHiveTyrant","timestamp":1464179508,"content":"A fond hello to you, member of the LOTR LCG community! Today, I'm honored to announce the that the reboot of a re-envisioned version of the Lord of the Rings: the Card Game Progression Series has officially begun.\n \nOver the coming months, my co-host Matthew and I will begin with the CORE set, evaluate all of the cards, play through each quest or scenario in sequence, and then together we intend to re-experience the entire lifespan of the game thus far, opening, assessing, and playing through each individual expansion product in the chronological order of its original release; we intend to always limit our card pool when deck-building as if we were playing through all of this cooperative LCG content for the very first time.\n \nAfter an over 15-month hiatus from producing Lord of the Rings videos, this brand-new iteration upon the original Progression Series begins with a piece of beginner-friendly content, though I hope you enjoy all of my upcoming Lord of the Rings videos. Particularly important for new players, we begin with an in-depth, Complete Tutorial and How to Play Guide!\n \nSo enjoy, and be sure to spread this video to anyone you know interested in learning how to play LOTR LCG! The Progression Series has returned, and I could scarcely be more excited to again consider myself part of this LCG community. Take care!\n \nThe Lord of the Rings: the Card Game - Complete Tutorial and How to Play Guide [https://youtu.be/t-4vfI39Ahk]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/220870-complete-tutorial-and-how-to-play-video-for-lotr-lcg/?do=findComment&comment=2234046","commentId":2234046,"userName":"FetaCheese","timestamp":1464180902,"content":"IT BEGINS."}]}