{"url":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/","title":"When encounter cards force you to discard attachments . . .","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2234465","commentId":2234465,"userName":"1mperia1Aces","timestamp":1464193732,"content":"This question recently came up while a group of friends was playing the Old Forest.  If a condition attachment is attached to one of your heroes from the encounter deck (like the \"sleep\" treachery card in this set) but does not have the word \"objective\" printed on it - and then an encounter card forces you to discard a non-objective attachment (like after you engage the flies) - can you discard the \"sleep\" condition attachment from your hero since it does not have the word \"objective\" printed on it and counts as a condition attachment?\n\n \n\nIt seems shady to me, since discarding an attachment is not supposed to help a player, but the treachery card does not have the word \"objective\" printed on it.  I guess thematically this could represent the flies being loud enough to wake the hero from his/her sleep?  On the other side, would every attachment that comes from the encounter deck be treated as an \"objective\" attachment?\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2234535","commentId":2234535,"userName":"cmabr002","timestamp":1464195710,"content":"For others wondering what the precise card text is on the cards 1mperialAces is referencing:\n\n \n\nSong of Sleep:  ...and attach Song of Sleep to that hero.  Counts as a Condition attachment with the text: \"Limit 1 per hero.  Treat attached hero's text box as if it were blank (except for Traits).  Attached hero cannot ready.\n\n \n\nArmy of Flies: Forced: After Army of Flies engages a player, that player discards a non-objective attachment he controls.\n\n \n\nSo, to answer your question, no, you cannot discard Song of Sleep when Army of Flies engages you.  This is because you do not control that attachment.  This is actually answered in the FAQ:\n\n \n\n> (1.06) Control of Non-objective Encounter Cards\n> \n>  \n> \n> Players do not gain control of encounter cards unless control of the card is explicitly granted by a card effect. When an encounter card (such as Caught in a Web, CORE 86) becomes an attachment and attaches to a character, that character’s controller does not gain control of the attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2234536","commentId":2234536,"userName":"dalestephenson","timestamp":1464195760,"content":"That's why most recent attachment discarders specify \"an attachment you control\".  Without the \"you control\", it's certainly legal to discard an obnoxious condition attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2234545","commentId":2234545,"userName":"PocketWraith","timestamp":1464196200,"content":"I think the only encounter card effect which can discard encounter card attachments is the Black Uruks, from one of the Khazad-Dum encounter sets, which don't specify that you have to control the attachment you choose to discard.\n\nEdited May 25, 2016 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2234550","commentId":2234550,"userName":"sappidus","timestamp":1464196609,"content":"[Edited for slowness.]\n\nBlack-Uruks.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Khazad-dum/Black-Uruks.png]\n\nEdited May 25, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/220897-when-encounter-cards-force-you-to-discard-attachments/?do=findComment&comment=2235640","commentId":2235640,"userName":"1mperia1Aces","timestamp":1464261543,"content":"Okay, that makes sense. I can't say I even noticed the language about an attachment \"you control\". Thanks!"}]}