{"url":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/","title":"Another one of these... Interested, how to get started?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2244166","commentId":2244166,"userName":"Engine25","timestamp":1464797478,"content":"X wing and Imperial Assault player looking to get into his first card game. Its really intriguing to me that this game is coop only, and I love the universe. If o were to go with LOTR, which sets in addition to core would you recommend, assuming that a completionist approach isn't a possibility."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2244190","commentId":2244190,"userName":"GrandSpleen","timestamp":1464798103,"content":"The best advice is to read the New Player Buying Guide [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] over at the Tales from the Cards blog.  \n\n \n\nFrom a player card perspective, My personal picks: in addition to the Core set, if you get both the Hobbit expansions (Over Hill and Under Hill + On the Doorstep) and the Return to Mirkwood adventure pack (which includes the hero Dain), you would then have the ability to make some very capable dwarf decks and could beat all of the scenarios you have now bought.  You'd be able to participate in player meetups with some decent decks, although you'd be missing some cards to make them as strong as they could be.  I'd recommend Watcher in the Water (for the Legacy of Durin card) and The Long Dark (for Warden of Healing and Erebor Battle Master).  To play those two scearios, however, you'd also need to buy the Khazad-dum deluxe expansion.  But it has some very good player cards in it as well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2244218","commentId":2244218,"userName":"Vicaroth","timestamp":1464799173,"content":"Here is a topic [https://community.fantasyflightgames.com/topic/203889-a-video-for-new-players-solo-core-set/] about it as well. Hope this helps ya!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2244221","commentId":2244221,"userName":"FetaCheese","timestamp":1464799222,"content":"As above, then go for Foundations of Stone. Leave Heirs of Numenor for much later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2244653","commentId":2244653,"userName":"Ecthelion III","timestamp":1464812383,"content":"I am a fellow X-Wing player (you may have seen me over on the forums a little bit). Welcome to the game!\n\nIf you go with the first 2 LOTR saga expansions (The Black Riders, The Road Darkens) you can make a quite powerful Gandalf deck, though for new players Gandalf may be kind of hard to use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2246614","commentId":2246614,"userName":"FeloniusBard","timestamp":1464891045,"content":"I think the others have pretty well covered it. \n\n \n\nDwarf decks are by far the easiest way to get up to speed with high-powered decks that will handle just about everything. So the Hobbit expansions + Khazad-Dum would get there quickly. \n\n \n\nMy problem is, I don't like dwarves. I much prefer playing Noldor/Dunedain.\n\n \n\nIf I was going to pick and choose specifically to get a variety of good player cards, regardless of the quality of the quests: \n\n \n\nCore\n\nConflict at the Carrock (good hero with Spirit Frodo + Burning Brand)\n\nReturn to Mirkwood (for Dain. Pretty much nothing else)\n\nKhazad-Dum (mostly to unlock the other cycle packs, but some good Dwarf stuff too)\n\nWatcher in the Water (Lore Aragorn + Ally Arwen)\n\nFoundations of Stone (for Spirit Glorfindel)\n\nShadow and Flame (for Elrond)\n\nThe Lost Realm (because nearly every expansion in this cycle has great player cards)\n\n \n\n \n\nIf I was only interested in getting the best, most interesting quests, regardless of what player cards were available:\n\n \n\nCore\n\nBlack Riders (Knife in the Dark is widely regarded as one of the best, if not THE best quest in the game)\n\nThe Road Darkens (It's not on many people's lists, but The Ring Goes South is one of my all-time favorite quests. Near perfect balance of fun and challenge for me)\n\nOn the Doorstep (Battle of Five armies is a great quest)\n\nTreason of Isengard (The Helm's Deep quest alone makes this worth purchasing)\n\nThe Lost Realm (These are reasonably good quests on their own, but you have to have this expansion to later pick up the Wastes of Eriador . . . which is also one of my top 5 quests)\n\nThe Grey Havens (I really like all 3 of these quests)\n\nEdited June 2, 2016 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2248436","commentId":2248436,"userName":"Rajam","timestamp":1464957192,"content":"Watcher in the Water, Foundations of Stone, and StewardsFear are a must. Best 3 APs imo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2248560","commentId":2248560,"userName":"Supertoe","timestamp":1464960796,"content":"https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\nThe definitive article on buying packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2248792","commentId":2248792,"userName":"Kakita Shiro","timestamp":1464965695,"content":"> Here is a topic [https://community.fantasyflightgames.com/topic/203889-a-video-for-new-players-solo-core-set/] about it as well. Hope this helps ya!\n\nThis is not about buying at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2250508","commentId":2250508,"userName":"alexbobspoons","timestamp":1465028834,"content":"Awesome advice here on player cards which I cant really add to so I will drop a bit in on adventure cards.\n\nThe 3 core set adventures have reputations.\n\n1, mirkwood is easy and teaches the game mechanics well and is fun.\n\n2, anduin is pretty hard for beginners especially with core only cards. It's very fun and very thematic with very different stages, the stage travelling on the raft is very fun, but it is quite hard so don't get discouraged.\n\n3, dol guldur, is still considered one of the hardest in the game, I didn't beat it at all.\n\nSo in all quite hard, things calm down during the adventure packs, so don't get discouraged by the difficulty.\n\nThen, it's worth noting that the first saga, the mirkwood saga, can be seen as an extended tutorial. Each adventure seems to centre on one main adventure type, eg: big combat, healing escort quests, location management, objectives etc so for me it was a very nice introduction to major game mechanics even if not the top-tier player cards (still good).\n\nHope you enjoy, awesome game.\n\nEdited June 4, 2016 by alexbobspoons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2263903","commentId":2263903,"userName":"Vicaroth","timestamp":1465767187,"content":"> > Here is a topic [https://community.fantasyflightgames.com/topic/203889-a-video-for-new-players-solo-core-set/] about it as well. Hope this helps ya!\n> \n> This is not about buying at all.\n\nDoh.. totally posted the wrong topic. Derp.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2265716","commentId":2265716,"userName":"beregrew","timestamp":1465874332,"content":"The new player buying guide by tftc is highly recommended(as mentioned above)  but personally i would say buy them in order of release, mirkwood cycle is good place for starters, or khazad-dum or sagas.\n\n \n\n \n\nI know you probably heard this so many times now but DON'T do what i did and buy Heirs of Numenor. It is VERY difficult with core set only cards. \n\nAlso getting what appeals to you is also kinda important but get some of the earlier expansions first if getting voice of isengard, Lost realm, etc..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2265919","commentId":2265919,"userName":"Edheliad","timestamp":1465899783,"content":"The Mirkwood cycle quests are extremely gimmicky and reward building a deck specifically for each one. They're also pretty tedious and not much fun, ending either with a anti-climatic whimper or a long, drawn out grind to inevitable victory after the biggest challenge has been beaten.\n\n \n\nI would definitely recommend skipping them unless you feel you have to have certain player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2266082","commentId":2266082,"userName":"Ecthelion III","timestamp":1465909705,"content":"DO NOT START WITH HEIRS OF NUMENOR!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2273430","commentId":2273430,"userName":"Hawkstrike","timestamp":1466342573,"content":"Welcome to the LotR LCG! I'm also primarily an X-winger, but got into the game about six months ago to have something I could play solo (my dream of coopting my wife into coop play was sadly not to be).\n\n \n\nI got a lot of help from the Tales from the Cards buying guide, and also the Beorn's Path [https://hallofbeorn.wordpress.com/category/beorns-path/] series to help me learn how to play.\n\n \n\nI'm still figuring the game out, so I'm a long way from mastery, but I have enjoyed the Khazad-dum series and the Hobbit Saga boxes the most so far ... probably because the Hobbit is my favorite book and Moria was my favorite sequence in LotR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221464-another-one-of-these-interested-how-to-get-started/?do=findComment&comment=2317140","commentId":2317140,"userName":"RightasRainn","timestamp":1468943968,"content":"Oh god I just bought Heirs of Numenor because it looked awesome from the artwork xD\nAnd I just got the hang of the core set introduction xD"}]}