{"url":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/","title":"Passage thru Mirkwood 3B - Snared Spider","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2245225","commentId":2245225,"userName":"Randyman","timestamp":1464845178,"content":"In part 1B of this quest, I've got Ungoliant's Spawn captured in a Forest Snare so by the time I get to 3B he's damaged but still in the snare.  If I draw \"Don't Leave the Path\" for 3B, it says I must find and defeat him to win the game -- since he's already in play (albeit ensnared), do I just need to finish him off for the win?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2245273","commentId":2245273,"userName":"krokodiler","timestamp":1464849846,"content":"Yes, you just need to finish it off to win.\n\nBut remember, that after revealing Don't Leave the Path, you still have to pick and add to the staging area a Spider enemy - not the Spawn in this case, as it is already in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2245528","commentId":2245528,"userName":"Randyman","timestamp":1464868085,"content":"Thanks, that makes sense now -- I am also having trouble deciphering the Son of Arnor card -- is the response mandatory or optional?  Also, it seems nearly impossible to engage an enemy alone with this card since he has a zero defense and will die quickly -- can other heroes and Allies join in the combat?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2245603","commentId":2245603,"userName":"krokodiler","timestamp":1464869666,"content":"Firstly, as this one is simple: Responses are always optional, so you just have an option to engage an enemy when Son of Arnor enters play.\n\nSecond: engaging an enemy and defending against it or attacking it are separate game activities and usually occur in specific phases in round sequence - Encounter and Combat, respectively. In general, engagement goes first in round sequence, then enemies attack you (you defend) and then you can attack enemies (cards effects can alter these general rules and sequence). Generally you defend with one character (you can also take undefended attack, but this usually hurts more ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]  ) and using this character to defend means exhausting it. When character is exhausted, it cannot be used for another puprpose, like attacking or defending again (it must be ready again to do so). But when you attack enemies, you can do it with more than one character and sum up their attack strength. And using a character to attack also means exhausting it, so all characters that are intended to attack an enemy must be ready before this attack.\n\nAnd taking Son of Arnor's option to engage an enemy DOES NOT mean that only he can be used to defend or attack that enemy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 2, 2016 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2246034","commentId":2246034,"userName":"Randyman","timestamp":1464879581,"content":"Thanks for the clarification -- I think I will get the hang of this quickly -- sorry for so many questions, but once Son of Arnor engages an enemy in the Staging area, would that enemy remain in the staging area?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2246049","commentId":2246049,"userName":"Kakita Shiro","timestamp":1464879814,"content":"> Thanks for the clarification -- I think I will get the hang of this quickly -- sorry for so many questions, but once Son of Arnor engages an enemy in the Staging area, would that enemy remain in the staging area?\n\nNo; once engaged, enemies leave the staging area and are engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2246787","commentId":2246787,"userName":"zeb","timestamp":1464894608,"content":"Also, engaging is symmetrical: there is no difference between being engaged and engging the enemy. Once engaged, the enemy has the opportunity to attack first.\n\nEdited June 2, 2016 by zeb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2301967","commentId":2301967,"userName":"ravepig","timestamp":1468042860,"content":"I've only got one game under my belt and so far love it- just to clarify- if I were to draw and defeat Ungoliant's Spawn during the earlier part of the adventure, and then must defeat him for the win during the final quest, I assume I have to defeat him a second time for the victory?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2304625","commentId":2304625,"userName":"987654321","timestamp":1468265461,"content":"Yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2305960","commentId":2305960,"userName":"rmunn","timestamp":1468333036,"content":"Yes -- but since stage 3 instructs you to search the encounter deck and discard pile for one spider per player, that's your opportunity to go fetch Ungoliant's Spawn out of the discard pile and face it again right away, when you're (hopefully) ready for it. If you don't do it right then, then you're going to have to wait until the encounter discard pile gets shuffled again, and wait for Ungoliant's Spawn to turn up -- and hope that it doesn't get dealt as a shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/221518-passage-thru-mirkwood-3b-snared-spider/?do=findComment&comment=2312580","commentId":2312580,"userName":"Gorkil","timestamp":1468654302,"content":"I like to use Son of Arnor when we are playing in 2 players and use 1 \"qeusting\" deck and 1 combat - my partner has lower threat, which means she can get engaged by enemies with low threat (such as Forest spiders, who, with 3 attack after engaging are pretty dangerous to her heroes). After they engage her and she defends (barely or by losing some low-cost ally), in the next phase I engage the spider with Son of Arnor and kill it myself."}]}