{"url":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/","title":"Finalist voting for hero re-skin contest! Please do not post here until poll is open.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256252","commentId":2256252,"userName":"Supertoe","timestamp":1465329116,"content":"So just to lay the rules down.\n\n \n\nThematic abilities are most important, followed by interesting abilities, followed by balanced card. Please take all three categories into consideration when voting. How much backstory or reasoning they gave is irrelevant to voting. Only the card shall be judged. I just included the backstory on the cards that needed rules clarification or some more explanation of their abilities.\n\n \n\nTHIS IS JUST A SUGGESTION POLL. I HAVE FINAL SAY ON THE MATTER!\n\n \n\nTHE POLL IS NOW OPEN. YOU MAY POST NOW.\n\n \n\nThese are the finalists!\n\n \n\n \n\nHave fun!\n\n \n\nJust opened voting. Voting will be done by liking the posts. You will need FFG accounts. You may vote for multiple. Vote for the ones that you feel are the strongest, even if this is multiple ones. Thanks! Enjoy! Voting closes when it closes, so vote soon! No spam accounts please.\n\nEdited June 10, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256261","commentId":2256261,"userName":"Supertoe","timestamp":1465329387,"content":"galadriel-wanderingtook.png?w=700&h=&cro [https://talesfromthecards.files.wordpress.com/2016/06/galadriel-wanderingtook.png?w=700&amp;h=&amp;crop=1]\n\nI wanted a version of Galadriel that focused on her persona as a giver of gifts, while still retaining that feel of subtlety and power that we got with the official hero version.\n\nLike the official version, she influences from afar. She still cannot directly quest, attack, or defend, and in this way can still make full use of Nenya.\n\nIn this version, I went a step further and prohibited Galadriel from spending resources. This was very important in curbing the power of her innate ability: Galadriel is considered to have the printed resource icons of all 4 major spheres.\n\nWhile she can't directly spend resources, her influence from all 4 main spheres still provides some advantages:\n- She can slot into any multi-sphere deck and still satisfy the requirements for mono-sphere cards.\n- She enables play of 0-cost cards, regardless of whether or not your other heroes have the appropriate resource match.\n\nBetter still is that her resources don't go to waste. Once per turn, she can gift her resources (plus a bonus) to any other hero; after all, she will support heroes from all races, dwarves included! This ability not only lends itself to her gift-giving image, but also, like the official version, competes with the action provided by Nenya.\n\nWith these abilities, she can pull off some amazing tricks:\n- Resource-smoothing when appropriate\n- Bulking up a hero for Gondorian Fire without the need for Steward of Gondor\n- Daeron's Runes without a lore hero; Dunedain Hunter without a tactics hero...\n\nOne final design point: It was imperative that the resource icons be explicitly detailed in the card text, rather than being shown in the usual sphere slot; otherwise, encounter cards that blank hero text would have completely broken her!\n\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256266","commentId":2256266,"userName":"Supertoe","timestamp":1465329432,"content":"alex-h-hero-contest-double-sided-beorn-h [https://talesfromthecards.files.wordpress.com/2016/06/alex-h-hero-contest-double-sided-beorn-hero.jpg?w=1000&amp;h=&amp;crop=1]\n\n \n \nFor my Hero submission I thought it would be fun to be able to play Beorn as more of a dynamic skinchanger, rather then as a static version of his two depicted forms. So I thought of a double sided hero card with Beorn the Man on the Front and Beorn the Bear on the back.\n \n \nAs the Man, Beorn shows his hospitality by sharing his resources with the other heroes. As the Bear, Beorn demonstrates his wrath when his allies are in danger, especially if they are threatened by Orcs (Goblins). \n \nI tried to find quotes from the Hobbit that conveyed these two side of Beorn. When Thorin and Company found refuge at Beorn's home and was given supplies and resources, I took this quote for Beorn the Man:\n \n\"Little bunny is getting nice and fat again on bread and honey,” he chuckled. “Come and have some more!”.\n \nand after Thorin was slain during the battle of five armies, Beorn the bear went into a frenzy:\n \n“..his wrath was redoubled, so that nothing could withstand him, and no weapon seemed to bite upon him. ”\n \nHere is the link to the file on my Google Drive, I have also attached the file if the link doesn't work.\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256267","commentId":2256267,"userName":"Supertoe","timestamp":1465329438,"content":"bilbo-baggins-front-face4.jpg?w=700&h=&c [https://talesfromthecards.files.wordpress.com/2016/06/bilbo-baggins-front-face4.jpg?w=700&amp;h=&amp;crop=1]\n\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256268","commentId":2256268,"userName":"Supertoe","timestamp":1465329444,"content":"misterbilbo.png?w=700&h=&crop=1 [https://talesfromthecards.files.wordpress.com/2016/06/misterbilbo.png?w=700&amp;h=&amp;crop=1]\n\nI wanted to capture Bilbo as he was when he was younger. The current edition of Bilbo captures the wise, old hobbit, but doesn't capture the younger version. And as this game spans such a long timespan, I thought it would be thematic to have a younger Bilbo in the game.\n\nTHIS CAN BE USED OUTSIDE OF THE HOBBIT SAGAS!\n\nThe first thing that you will notice is that he is Baggins. This is intentional. Outside of The Hobbit, Baggins could not be used. Not with this guy. He is allowed to include Baggins cards in his deck, and does count against the hero limit. Essentially, he is a normal hero, but Baggins. This is thematic in that it allows him to use his burglar skills that he obtained during the era of the Hobbit in future quests. It is said that he was quite adventurous after his first quest, so why shouldn't he come along to rescue a prisoner from the Necromancer?\n\nHis second ability allows him to use his resources to pay for other spheres, and is quite strong in it's own right. He can save resources to then pay off a big ally like Landroval. It is also thematic in that it shows how he can work with anyone, from the wise Elvenking to the fierce Dwarves.\n\nHis final ability is meant to capture his growth as a character. Bilbo has a tendency to learn, and to adapt, and the experiences that he faces will give him courage and skills to win out in the end. Thus, wise Bilbo can choose from three effects every time he defends. Even the fact that this ability is quite useless early on is thematic in that he takes time to truly shine (even if the reason he starts to shine is that he has received a nice treasure of some ring mail. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] I suppose that fits too. Bilbo does like his treasure.). I decided not to incorporate the Ring into this edition of Bilbo, as the ring is Frodo's burden (Frodo Baggins, Conflict at the Carrock edition), and not Bilbo's.\n\nEdited June 15, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256269","commentId":2256269,"userName":"Supertoe","timestamp":1465329450,"content":"denethor-front-face.png?w=700&h=&crop=1 [https://talesfromthecards.files.wordpress.com/2016/06/denethor-front-face.png?w=700&amp;h=&amp;crop=1]\n\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256270","commentId":2256270,"userName":"Supertoe","timestamp":1465329455,"content":"fatty-bolger.png?w=700&h=&crop=1 [https://talesfromthecards.files.wordpress.com/2016/06/fatty-bolger.png?w=700&amp;h=&amp;crop=1]\n\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256271","commentId":2256271,"userName":"Supertoe","timestamp":1465329461,"content":"bilbo-baggins-front-face.png?w=700&h=&cr [https://talesfromthecards.files.wordpress.com/2016/06/bilbo-baggins-front-face.png?w=700&amp;h=&amp;crop=1]\n\nEdited June 7, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2256275","commentId":2256275,"userName":"Supertoe","timestamp":1465329556,"content":"aragorn_v2.jpg?w=700&h=&crop=1 [https://talesfromthecards.files.wordpress.com/2016/06/aragorn_v2.jpg?w=700&amp;h=&amp;crop=1]\n\nEdited June 10, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2262229","commentId":2262229,"userName":"GrandSpleen","timestamp":1465611042,"content":"Definitely I vote for that Fatty!  Damage cancellation on a hero is cool and it's a neat way to represent his small part in the narrative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2262355","commentId":2262355,"userName":"John Constantine","timestamp":1465627587,"content":"Oh yeah, Mr. Krabs!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2262634","commentId":2262634,"userName":"Authraw","timestamp":1465656800,"content":"Definitely Fatty.\n\nSeems the community is ready for a new Bilbo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2262695","commentId":2262695,"userName":"Supertoe","timestamp":1465659777,"content":"Just a reminder, you can vote by liking the post.\n\n \n\nYeah, that Fatty is one of my personal favorites."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263412","commentId":2263412,"userName":"Mikelius4ru","timestamp":1465732481,"content":"As the author of Aragorn I would like to make some remarks about him.\n\n \n\nFirst of all, I always wanted to have spirit version of Aragorn, the most iconic hero in The Lord of the Rings saga. Despite he has many advantages (especially attachments) in our LCG, the fourth sphere version of him will be cool.\n\nThe key thing I considered while designing this hero was theme. I wanted to make Aragorn very thematic and, if I can, provide useful ability. Currently Aragorn has 3 (except Fellowship) versions which represent different sides of his life and his abilities. My version of Aragorn represents him as the leader of men at Pelennor Fields and Morannon. The Grey Company joins the battle alongside Gondorians (and Rohan) so each Dunedain gets Gondor trait. This ability not only thematic, it can significantly upgrade Dunedain decks. In my opinion, currently pure dunedain decks are very specific as they require many engaged enemies and we have a limited number of cards which can prevent enemies from attack. So, this ability allows Dunedain to gain Gondor buffs and some other abilities thus Dunedain decks can get some versatility. Of course, Aragorn himself gets Gondor trait too which is also useful. Considering balance, this ability is useful in Dunedain-Gondor decks, but outside such decks it isn’t so powerful. \n\nSo, Aragorn needed a universal second ability which can benefit in every deck, but don’t be very powerful (we remember his attachments, yes). And be thematic. As the leader of men, Aragorn often has to face challenges from Sauron, and, as he is true leader, he gets benefits from these challenges. The more cunning Sauron uses against Aragorn, the more battle-readiness Aragorn and his army gets. More over, as this is spirit sphere, Aragorn will often has to make choices - whether to cancel “When revealed” effect or let it pass and ready himself or any other character (which can also benefit in multiplayer.) As we remember, in books Aragorn actually made choices, for example - whether to follow Sam and Frodo or pursue orcs  which catched Merry and Pippin. Another cool thing about this ability - it triggers not only from treachery card but from any card in any phase. This was made to let players trigger this ability more often. Usually, player have maybe one or two “when revealed” effects per round or even zero. In most cases, “when revealed” effects has only one desire from players - to cancel it. This ability represent slightly different approach to the game - “ok, ok, I won’t cancel this nasty effect, but I’ll ready a key character!” I had to add limit to this ability for balance - trigger once per round can be too weak, twice seems ok. While thinking how to make this ability I had many options - I thought to offer players choice - whether to ready someone or to gain resource at Aragorn, but finally I decided to make this ability pure. Gaining resources can make this ability too versatile and powerful.\n\nI also removed Ranger trait from him because he is not hiding in woods anymore (and also can't be additionally readied by Wingfoot) and removed Sentinel as he also is not protecting hobbits in the wild anymore (also due to balance).\n\n \n\nAfter I saw all other heroes here I thought that my Aragorn’s abilities maybe lack a little fantasy, they don't breake game frameworks or represent some mechanics we’ve never seen before, but, in the end, in my opinion they fit the game and the theme. \n\nEdited June 12, 2016 by Mikelius4ru"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263574","commentId":2263574,"userName":"Edheliad","timestamp":1465746043,"content":"Celeborn is the renowned giver of gifts in the books."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263647","commentId":2263647,"userName":"Supertoe","timestamp":1465751246,"content":"Why no votes for any of the three Bilbos?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263798","commentId":2263798,"userName":"Calvadur","timestamp":1465760533,"content":"I vote for the Baggins Bilbo Baggins.\n\n \n\nI think it could be very cool to use the baggins Cards, especially the lucky number, but even burglar baggins has a touch as even other Players could rrun it and pay with your ressources :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nHis Action is good for ressources smoothing and you can always pay for neutral Cards, which are getting more and more common (rings, Songs etc.)\n\n \n\nI love that his Response is not limited and there are some great ways to boost his defense and fast hitch.\n\n \n\nOthers heroes are great too, but this Bilbo was the one that made me think the most which decks I could try.\n\n \n\n \n\nLooks like a new Bilbo/Hobbit hero would be much loved, looking at the number of entries"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263805","commentId":2263805,"userName":"Kjeld","timestamp":1465761160,"content":"> Why no votes for any of the three Bilbos?\n\nWhile all of them have a decent idea behind them, they all need work.\n\n \n\nTaking them in turn, the lore Bilbo is perhaps the most ready for prime-time. The ability to help with either questing or combat through the play of songs is potentially very versatile, and with only 6 threat he can be a utility hero. That said, his stat line is mostly useless, and there aren't any Songs (a) in the Lore sphere or (b) that combo with the hobbit archetype. So you're splashing in Bilbo to another kind of deck solely for his ability, not his stats or trait, and that's pretty inefficient.\n\n \n\nNext up is the Baggins-sphere Bilbo. In theory, I love this idea, but in practice it's really lackluster. In exchange for losing access to every other sphere (unless you pay!), you get access to Burglar Baggins [http://hallofbeorn.com/Cards/Details/Burglar-Baggins-THOHaUH] and The Lucky Number [http://hallofbeorn.com/Cards/Details/The-Lucky-Number-THOtD], which are essentially inferior versions of cards already existing in other spheres: Halfling Determination/Durin's Song, or Tale of Tinuviel. His final ability would be good... if he didn't have 1 defense and 3 hit points. Without significantly boosting those base stats, it's likely a suicide mission to use that ability. The card has potential, but really needs more revision to address these problems, I feel.\n\n \n\nLastly, the leadership Bilbo is, conversely, too strong. While, as with the Lore version, I like the idea of a Bilbo that interacts with Songs, it seems thematically weird to make him leadership. Also, his ability effectively starts every player in the game with a free Love of Tales. That's just OP, even without the added option of instead drawing a card! Oh, and a +2 free willpower as well? Yeah, way too powerful.\n\n \n\nSo, on the whole, while the three Bilbo entries have potential and are motivated by some interesting ideas, none quite live up to, say, the simple elegance and thematic satisfaction of tactics Fatty or even the Spirit Aragorn entry (which is also a bit too powerful on the second ability -- should be limited to once per round, I think)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2263942","commentId":2263942,"userName":"Supertoe","timestamp":1465769706,"content":">  \n> \n> > Why no votes for any of the three Bilbos?\n> \n> While all of them have a decent idea behind them, they all need work.\n> \n>  \n> \n> Taking them in turn, the lore Bilbo is perhaps the most ready for prime-time. The ability to help with either questing or combat through the play of songs is potentially very versatile, and with only 6 threat he can be a utility hero. That said, his stat line is mostly useless, and there aren't any Songs (a) in the Lore sphere or (b) that combo with the hobbit archetype. So you're splashing in Bilbo to another kind of deck solely for his ability, not his stats or trait, and that's pretty inefficient.\n> \n>  \n> \n> Next up is the Baggins-sphere Bilbo. In theory, I love this idea, but in practice it's really lackluster. In exchange for losing access to every other sphere (unless you pay!), you get access to Burglar Baggins [http://hallofbeorn.com/Cards/Details/Burglar-Baggins-THOHaUH] and The Lucky Number [http://hallofbeorn.com/Cards/Details/The-Lucky-Number-THOtD], which are essentially inferior versions of cards already existing in other spheres: Halfling Determination/Durin's Song, or Tale of Tinuviel. His final ability would be good... if he didn't have 1 defense and 3 hit points. Without significantly boosting those base stats, it's likely a suicide mission to use that ability. The card has potential, but really needs more revision to address these problems, I feel.\n> \n>  \n> \n> Lastly, the leadership Bilbo is, conversely, too strong. While, as with the Lore version, I like the idea of a Bilbo that interacts with Songs, it seems thematically weird to make him leadership. Also, his ability effectively starts every player in the game with a free Love of Tales. That's just OP, even without the added option of instead drawing a card! Oh, and a +2 free willpower as well? Yeah, way too powerful.\n> \n>  \n> \n> So, on the whole, while the three Bilbo entries have potential and are motivated by some interesting ideas, none quite live up to, say, the simple elegance and thematic satisfaction of tactics Fatty or even the Spirit Aragorn entry (which is also a bit too powerful on the second ability -- should be limited to once per round, I think).\n> \n>  \n\nAll very good points.\n\n \n\n \n\nSpirit Aragorn has taken the lead from Fatty Bolger! And all but the two Song Bilbo's and Denethor have votes! It's shaping up to be an interesting race folks!\n\n \n\n \n\nYeah, I kind of wish that Spirit Aragorn said to ready an ally, or was once per round. But it still isn't too OP\n\nEdited June 12, 2016 by Toenail"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2265328","commentId":2265328,"userName":"Sorcerious","timestamp":1465851200,"content":"I absolutely LOVE this version of Galadriel. While I really like the one they put in the LCG, the one that got submitted her here really takes the cake in terms of theme and playability. She would be a welcome addition to any deck, and pair her with a couple of resource-generating attachment (like Resourceful), she could become an absolute powerhouse where you're never short of that particular resource to pay for the game-winning card...\n\n \n\nShe gets my vote :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2265410","commentId":2265410,"userName":"Supertoe","timestamp":1465854991,"content":"You know it's funny, I threw in the Spirit Aragorn into the pool right before making the poll. I wasn't going to originally, because even though I liked it I figured it wouldn't get any votes. Boy was I wrong."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2265596","commentId":2265596,"userName":"Ryodu","timestamp":1465866403,"content":">  \n> \n> > Why no votes for any of the three Bilbos?\n> \n> While all of them have a decent idea behind them, they all need work.\n> \n>  \n> \n> Taking them in turn, the lore Bilbo is perhaps the most ready for prime-time. The ability to help with either questing or combat through the play of songs is potentially very versatile, and with only 6 threat he can be a utility hero. That said, his stat line is mostly useless, and there aren't any Songs (a) in the Lore sphere or (b) that combo with the hobbit archetype. So you're splashing in Bilbo to another kind of deck solely for his ability, not his stats or trait, and that's pretty inefficient.\n> \n>  \n> \n> Next up is the Baggins-sphere Bilbo. In theory, I love this idea, but in practice it's really lackluster. In exchange for losing access to every other sphere (unless you pay!), you get access to Burglar Baggins [http://hallofbeorn.com/Cards/Details/Burglar-Baggins-THOHaUH] and The Lucky Number [http://hallofbeorn.com/Cards/Details/The-Lucky-Number-THOtD], which are essentially inferior versions of cards already existing in other spheres: Halfling Determination/Durin's Song, or Tale of Tinuviel. His final ability would be good... if he didn't have 1 defense and 3 hit points. Without significantly boosting those base stats, it's likely a suicide mission to use that ability. The card has potential, but really needs more revision to address these problems, I feel.\n> \n>  \n> \n> Lastly, the leadership Bilbo is, conversely, too strong. While, as with the Lore version, I like the idea of a Bilbo that interacts with Songs, it seems thematically weird to make him leadership. Also, his ability effectively starts every player in the game with a free Love of Tales. That's just OP, even without the added option of instead drawing a card! Oh, and a +2 free willpower as well? Yeah, way too powerful.\n> \n>  \n> \n> So, on the whole, while the three Bilbo entries have potential and are motivated by some interesting ideas, none quite live up to, say, the simple elegance and thematic satisfaction of tactics Fatty or even the Spirit Aragorn entry (which is also a bit too powerful on the second ability -- should be limited to once per round, I think).\n> \n>  \n\nHey! Leadership Bilbo guy here and I just wanted to chime in on some of the thinking behind my choices (not pining for likes, just like having an honest discussion :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  ). The decision to make him Leadership came more so from the mechanics I wanted him to have and the ability felt weird putting it in Lore. I liked the idea of Bilbo in his later years could have easily represented the Leadership Sphere. Bilbo became quite confident after his journey to the lonely mountain and became more of a decision maker at the end of it all. Age catching up to him aside, I could see Bilbo having an interesting dynamic if he was allowed to partake in the fellowship. As for his +1 willpower and questing advantage I thought his stat line was pretty weak and wanted to beef it up somehow. Perhaps the action advantage can be removed. As for his final ability being OP I would have to disagree as many decks I have played (or play along with) rarely use songs. Sure, it can be taken advantage of but it would require very specific deckbuilding to do so. As it stands, I like having an ability that helps all the players at the table (similar to how the Lore version does). Being in leadership, card draw and resource advantage seemed the correct path. What would you suggest (not a sarcastic question, by the way).\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2265704","commentId":2265704,"userName":"Mikallo","timestamp":1465873704,"content":"I like the unique theme of Denethor. He starts out strong but as the Eye turns towards him and things heat up...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2265888","commentId":2265888,"userName":"Mikelius4ru","timestamp":1465895213,"content":">  \n> \n>  \n> \n> Yeah, I kind of wish that Spirit Aragorn said to ready an ally, or was once per round. But it still isn't too OP\n\n \n\nWell, I had many thoughts about balancing this ability. First of all, I wished to add limitation \"choose and ready any other character than Aragorn\" to prevent Aragorn from reading himself (which probably will be the most common case as Aragorn usually the most powerful hero in fellowship). But I decided this will only complicate this ability and made it heavy. My next thought was about allies as you mentioned. If this ability will ready an ally I think it won't need any limitation at all because if players managed to survive 3+ \"when revealed\" effects without cancellation they probably are really tough guys or something is wrong with scenario. Additionally they need 3 exhausted allies on the table. But non-limited abilities sadly can be abused in some rare scenarios and decks (hey, Seastan :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ), and as I'm not an expert in all scenario's mechanics I decided to choose more stable version.\n\n \n\nAnother my thought was - if I add some additional limitations (like only allies) this ability can be useless in many cases. If there is no \"When revealed\" effect at all in, lets say, two rounds, then Aragorn's ability is totally neglected. If there is no exhausted allies (rare, but possible) - the same. And if players often cancel \"when revealed\" effects - ability also doesn't trigger. More over, a situation when treachery with \"when revealed\" effect reveals means there is no additional enemy added so in some cases reading a character can be useless. Too many possible limitations even without worded per round limit.\n\n \n\nBut I'm agree there are options considering balance. I think this case need actual playtests for more valuable feedback."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2267247","commentId":2267247,"userName":"Mikelius4ru","timestamp":1465977806,"content":"My quick view on other heroes.\n\n \n\nI liked Galadriel when I saw her but eventually I changed my mind. She seems to be some variation of Gandalf hero. He also provides all printed icons (not in such straightforward way, but nevertheless) and can fit in mono-sphere deck. Сoncerning resource generation and moving - that's not unique ability at all, we have plenty of them.\n\n \n\nThe first question about Beorn - what happens to Lore-Beorn attachments when he flips. Attachment's check for conditions to be attached occurs only when card is played, so the bear can get a mount, a plate and a bow  :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]  I think bear side need something like \"treat Beorn's attachment text as blank\". And resource moving without any limit seems too good to be true.\n\n \n\nBilbo and Songs? Seems very deck-specific ability. Someone want Songs to work better, I see  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nBurglar Bilbo - very specific because can only be used in Hobbit saga. And response seems too good. Straightforward tactic is to give him attachments, sentinel and defend all attacks.\n\n \n\nI don't get this Denethor. He gets 3 willpower with 20-29 threat - 3 willpower not unique or even very good. And at 40 threat he is discarded... More over second ability to watch shadow is weak. I don't want to watch it (especially at such cost), I want to cancel or discard it.\n\n \n\nFatty is good and thematic, but damage cancellation at this stage of the game is not uncommon. Watchman, Dori, Honor guard, Close call, Raven-winged Helm, Gondorian discipline, Barliman.\n\n \n\nSecond song-oriented Bilbo seems a little strange in final. With Love of Tales this ability is powerful, but there is no strong deck around songs. There is just too few songs and they are too specific."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222057-finalist-voting-for-hero-re-skin-contest-please-do-not-post-here-until-poll-is-open/?do=findComment&comment=2267409","commentId":2267409,"userName":"Supertoe","timestamp":1465992711,"content":"The burglar Bilbo can be used in any scenario. Read the description."}]}