{"url":"https://community.fantasyflightgames.com/topic/222104-how-do-i-remove-time-counter/","title":"How do i remove time counter ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/222104-how-do-i-remove-time-counter/?do=findComment&comment=2257078","commentId":2257078,"userName":"13nrv","timestamp":1465383896,"content":"The question seems simple but is actually important and can change the course of a scenario.\n\nHow do we remove the time counters ?\n\nCase - 1 All and then I apply any associated time effects.\nCase - 2 I removed one by one and I apply the associated effects (if necessary) between each removed counters\n\nIn this case below , it changes many things , including the difficulty of a scenario:\n\n \n\nffg_boar-s-guardian-the-three-trials-40. [http://www.cardgamedb.com/forums/uploads/lotr/ffg_boar-s-guardian-the-three-trials-40.jpg]ffg_wild-tenacity-the-three-trials-55.jp [http://www.cardgamedb.com/forums/uploads/lotr/ffg_wild-tenacity-the-three-trials-55.jpg]\n\n \n\nWe are in a 4-player game and there is only one time counter on the enemy. Treachery comes out, I have to remove 4 counters.\n\nCase - 1 I remove the single time counter on the enemy. I finished the effect of treachery card. I make the forced time effect of the enemy, I discard an ally and I put two time counters on the enemy. At the end of the refresh phase, I remove a time counter.\n=> One ally discarded in turn by the time effect of the enemy.\n\nCase - 2 I remove one time counter. I make the forced time effect of the enemy, I discard an ally and I put two time counters on the enemy. I remover a time counter and then another. I make the forced time effect of the enemy, I discard an ally and I put two time counters on the enemy. I remove one time counter. I finished the effect of treachery card. At the end of the refresh phase, I remove a time counter. I make the forced time effect of the enemy, I discard an ally and I put two time counters on the enemy.\n=> Three allies discarded in turn by the time effect of the enemy.\n\nHow time counters are removed completely changes the course of a party and especially its difficulty. This is not necessarily the only scenario that cycle where it can be the case.\n\nPersonally, I have always made the case - 2.\n\nFrench community are divided on this subject. Someone have an official answer on that ?\n\nEdited June 8, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222104-how-do-i-remove-time-counter/?do=findComment&comment=2257399","commentId":2257399,"userName":"987654321","timestamp":1465395694,"content":"The treachery says \"remove Time counters\" which suggests you that all the Time counters are removed once. Since the Time counters of \"put 2 Time counters on\" didn't exist at that moment, my bet is that 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222104-how-do-i-remove-time-counter/?do=findComment&comment=2257407","commentId":2257407,"userName":"Slothgodfather","timestamp":1465395919,"content":"I would agree.  Because the effect says to remove a number of tokens, you remove as many as you can, all at once.  If you only have 1 available, then you just remove the 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222104-how-do-i-remove-time-counter/?do=findComment&comment=2257765","commentId":2257765,"userName":"Ecthelion III","timestamp":1465407426,"content":"I agree with both users. Effects such as that one remove tokens all at once."}]}