{"url":"https://community.fantasyflightgames.com/topic/222263-riddles-and-action-windows/","title":"Riddles and action windows","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/222263-riddles-and-action-windows/?do=findComment&comment=2260402","commentId":2260402,"userName":"Authraw","timestamp":1465516797,"content":"So I'm playing through the Nightmare Hobbit saga right now and I've gotten stuck on the riddle quest. One of the thoughts I have is to try to use some sort of shenanigans with hero Gandalf to help me guess correctly.\n\nNow I'm pretty sure his ability to see the top card of the deck doesn't help me much, since you have to guess before shuffling your deck and discarding cards. What I'm not clear on is whether or not there's an action window somewhere that I could use Wizard Pipe to put something from my hand on top of my deck.\n\nNormally I would think no, but the effect on Bilbo's Magic Ring that allows you to spend resources to discard extra cards during a riddle test is an action. So when can I trigger that action? And can I trigger other actions during a riddle as well?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222263-riddles-and-action-windows/?do=findComment&comment=2260671","commentId":2260671,"userName":"GrandSpleen","timestamp":1465531058,"content":"Seeing as how that Ring effect is an Action as you pointed out, I suppose you could use any other Action before you use the Ring-- it's not a Response, it just has to be used \"when answering a riddle.\"  So I guess you could (1) guess, (2) shuffle and discard, (3) use Wizard Pipe to swap something out from your hand on to the top of your deck, (4) use Bilbo's Magic Ring to discard the card that you just put on top of your deck.  This certainly would make answering riddles a lot easier.\n\n \n\nThe only question is: when are you considered to not be \"answering a riddle?\"  Once you decide to reveal the next encounter card (or end the staging step of the quest phase)?  Or once you take any action not related to riddling?  This is not answered in the rules as far as I can see.  In the example in the rules insert they have a player triggering the Ring two times for a single riddle, which I guess is why they have it as an Action instead of a Response.  But it leaves the riddling open to shenanigans like the Pipe thing you noticed.  I say go for it, looks legal."}]}