{"url":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/","title":"Everything but playing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2266581","commentId":2266581,"userName":"tripecac","timestamp":1465930698,"content":"Hi, I read this forum daily, listen to the podcasts, download the Progression series videos, and collect all the cards... But I don't do much actual playing.  Maybe once every few months I play a couple games, and then stop.\n\n \n\nThere are a couple reasons for this, which are closely related:\n\n \n\nThe first is a lack of a save feature on OCTGN.  The second is the game's re-learning curve.\n\n \n\nSince I play infrequently, and the game isn't exactly \"easy\" (for me at least), each time I do play there is a re-learning curve, so it takes me a while to get through a scenario: maybe 1 to 1.5 hours per game.  Because OCTGN lacks a save feature, this means I need to find at least 1 hour of uninterrupted time in order to have a chance of finishing a game.  It's hard to find a consistently free hour these days.\n\n \n\nWhat would help me immensely is a computer version of the game, which would handle the encounter deck, errata, counter placements, threat movements, etc.  OCTGN does its best, but the plugin can only go so far: we still have to interpret and enforce the rules ourselves, which requires time, especially when constantly looking up errata and FAQs for rulings.  Anyway, a full-fledged computer version (with a save feature of course), would be awesome.  However, I haven't heard any news about one being in development, so I don't have much hope.\n\n \n\nSo my question is this: for those of you in a similar position (wanting to use OCTGN but without large amounts of time to play), how do you force yourself to get around to actually playing? \n\n \n\nDo you switch to Lackey (which can save) or actual tabletop play? \n\nDo you try to play with friends, so that each of you pressures the other to follow through? \n\nDo you pick an hour, put a \"no interruptions\" sign on your door, and lock it? \n\nDo you play on Easy Mode, single-handed, and not worry about errata?\n\n \n\nOr, like me, do you keep lurking and collecting, hoping something will change which will make playing the game easier (on a meta-level)? \n\n \n\nWhat do you do? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2266673","commentId":2266673,"userName":"Ecthelion III","timestamp":1465933262,"content":"First off, OCTGN does have a save feature. You just have to be a subscriber ($3 a month).\n\n \n\nWhat's keeping you from using the physical cards to play? What I do is setup a cardtable or other flat area in my room and get the decks prepared, and whenever you have 10-20 minutes go and sit down and play through a round or two. Just use a die or the other threat tracker to record what phase you're on when you get called away. Most of my games are played out in 2-3 sit down sessions. No need to block out whole hours.\n\n \n\nI don't play Easy Mode (though there's no shame in doing it if you need to) but I do ignore errata; I just go with what's printed on my card for simplicity."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2266690","commentId":2266690,"userName":"tripecac","timestamp":1465933727,"content":"Wow, does OCTGN save now?  I subscribed for about a year, but the save feature never materialized.  Funding was at around 60% but the save feature was at 100%.  Are you *sure* OCTGN can save games now?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2266701","commentId":2266701,"userName":"Bullroarer Took","timestamp":1465934075,"content":"I have a small table in our living room that is *mine*.  I have a game going on there nearly all the time.  After a lot of experimentation I've found that the most logical break point in the LOTR LCG game is just after the planning phase heading into the quest phase.\n\n \n\nJust what works for me.  I've played games on OCTGN and Lackey, but I really like having the physical cards in my hand.  (And I play double fisted more and more lately.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2267099","commentId":2267099,"userName":"soullos","timestamp":1465960197,"content":"hmm... I might have to try that table idea. Like the OP, I own everything and keep up to date on podcasts, forums, previews etc etc, but rarely play myself. I started a blog to motivate myself to keep at it, but life got in the way and my time is limited (most of my free time is studying Vietnamese). But sometimes I'm just too lazy to get the cards out haha and I don't like playing on OCTGN (it's a useful program but I prefer to play with actual cards). But playing in sessions vs dedicating whole block of my limited time in one go sounds like a much more efficient use of time. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2267275","commentId":2267275,"userName":"DukeWellington","timestamp":1465980602,"content":"I greatly dislike OTCGN. Playing with real cards is tough because I don't keep them sleeved so I have to do it every time. When testing a deck it can be difficult to go through several iterations and swap cards around, even with minor changes. I have switched to playing the same quest over and over many times so that I only need to change player cards. I design a deck to master the quest. Unfortunately, this has gotten to be pretty easy for me. The game used to be insanely hard, but now the many broken comboes have made it too easy. It's tough to get as motivated. I try to win with lower quality decks intentionally, which is fun, but when they don't work you just want to pull out the faithful go to power deck. The struggle is real :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2267814","commentId":2267814,"userName":"1mperia1Aces","timestamp":1466008719,"content":"I have a weekly game night with my friends where I provide all of the decks that everybody uses.  It can be frustrating at times, but it allows me to always have several pre-constructed decks on hand to use when I want to play solo.  All of my quests are organized into individual storage units by cycle, and all of my cards are sleeved, so whenever I want to play, I just go to the cabinet, pull out one of the player decks, and then pull out the cycle that has the quest I want to play.  I find it hard to have time to frequently try rebuilding decks and making new ones, but this set up at least allows me to start playing with relatively little setup and clean up.  I find having all of my cards sleeved and not using binders really saves time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2267851","commentId":2267851,"userName":"tripecac","timestamp":1466009786,"content":"Can anyone confirm whether OCTGN has game saving?  Ecthelion mentioned it, but I'm wondering if he was mistaken... or if OCGTN finally got around to doing it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/222636-everything-but-playing/?do=findComment&comment=2268275","commentId":2268275,"userName":"Ecthelion III","timestamp":1466026620,"content":"I could be mistaken--I'm not a subscriber but I could have sworn I saw the feature in the game menu."}]}