{"url":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/","title":"A couple of question regarding the Thing of the Depths","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274537","commentId":2274537,"userName":"philkav","timestamp":1466432568,"content":"Here's 2 questions that came up while playing that scenario.\n\n \n\n1. The quest's 1B says 'Progress cannot be placed on this stage unless Helm of the Stormcaller is in the victory display.' What's the timing on quest resolution and explored locations leaving play ? i.e. what happens when the players quest successfully with Helm of the Stormcaller as the active location (assuming there's more progress then necessary to clear it)? Is it\n\nA) You place enough progress tokens to clear Helm of the Stormcaller to explore it. It goes to the victory display, allowing you to place what left of your progress on 1B.\n\nor\n\nB) You place enough progress tokens to clear Helm of the Stormcaller to explore it. You would put the rest on the quest as normal but the text on 1B prevents you to do it. Now that placing progress tokens is done, Helm of the Stormcaller is explored and goes to the victory display, allowing you to place progress on 1B only next round.\n\n \n\n2. The rules of the scenario tell us that grappling tentacles are detached and added to the staging area when the attached location becomes the active location or it is explored. What happens when grappled locations leave the staging area in some other way (for example, with Mariner's Compass) ? I'm guessing the tentacles are also detached and added to the staging area, but it isn't clear imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274686","commentId":2274686,"userName":"GrandSpleen","timestamp":1466438293,"content":"1 - it would be scenario (A).  You quest successfully, then determine how many progress tokens are to be placed.  Then you place them on the current quest.  If there is an active location, you'll place some of those tokens on the active location first, then place the remaining ones on the quest (questing successfully never \"assigns\" progress tokens to the active location -- it \"assigns\" them to the quest, and the active location \"steals\" them, if you will).\n\n \n\nIf Helm of the Stormcaller is not in the victory display, you can still calculate how many progress tokens *should* be placed on stage 1, but when it comes to actually placing them on the quest card itself, you will not do it.  If Helm of the Stormcaller is the active location, you'll calculate, then just go through the process as per usual.  When it comes time to place progress tokens on the quest, Helm of the Stormcaller will be in the victory display so you'll be free to place progress tokens.\n\n \n\n2 - good question.  I don't have the rules handy... if they only say that tentacles go to the staging area when the location is explored or when it becomes the active location, then I would just discard them if they leave play from the staging area without actually being explored (e.g. with Mariner's Compass).  I would make sure the rules don't mention locations \"leaving play\" though, even in a sidebar like an example text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274778","commentId":2274778,"userName":"Seastan","timestamp":1466441533,"content":"> If Helm of the Stormcaller is not in the victory display, you can still calculate how many progress tokens *should* be placed on stage 1, but when it comes to actually placing them on the quest card itself, you will not do it.  If Helm of the Stormcaller is the active location, you'll calculate, then just go through the process as per usual.  When it comes time to place progress tokens on the quest, Helm of the Stormcaller will be in the victory display so you'll be free to place progress tokens.\n\n \n\nIs this not at odds with the recent FAQ that states when you place enough progress on the active location and quest stage to complete both, you must advance the quest before resolving the active location?\n\n \n\n>  \n> \n> Q: If there is an active location with a Response effect that triggers when it is explored and the players make enough progress to explore the location and advance to the next stage, when do the players resolve the location’s Response effect?\n> \n>  \n> \n> A: The players should advance to the next stage immediately and resolve any ‘when revealed’ effects on the next stage, then resolve the Response effect on the active location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274834","commentId":2274834,"userName":"cmabr002","timestamp":1466443684,"content":">  \n> \n> > If Helm of the Stormcaller is not in the victory display, you can still calculate how many progress tokens *should* be placed on stage 1, but when it comes to actually placing them on the quest card itself, you will not do it.  If Helm of the Stormcaller is the active location, you'll calculate, then just go through the process as per usual.  When it comes time to place progress tokens on the quest, Helm of the Stormcaller will be in the victory display so you'll be free to place progress tokens.\n> \n>  \n> \n> Is this not at odds with the recent FAQ that states when you place enough progress on the active location and quest stage to complete both, you must advance the quest before resolving the active location?\n> \n>  \n> \n> >  \n> > \n> > Q: If there is an active location with a Response effect that triggers when it is explored and the players make enough progress to explore the location and advance to the next stage, when do the players resolve the location’s Response effect?\n> > \n> >  \n> > \n> > A: The players should advance to the next stage immediately and resolve any ‘when revealed’ effects on the next stage, then resolve the Response effect on the active location.\n> \n>  \n\n \n\nI don't think it is at odds with what GrandSpleen said.  The ruling only states that the location's Response triggers after quest advancement.  It doesn't say that the location is not explored (and discarded/added to the victory display) before advancement.\n\n \n\nThe rule book states that \"...an active location acts as a buffer for the currently revealed quest card. Any progress tokens that would be placed on a quest card are instead placed on the active location\".  This is actually interesting because while Helm of the Stormcaller is in play no progress would ever placed on the quest card thus, it would be impossible to ever clear Helm of the Stormcaller and would as a result be impossible to beat the quest.\n\n \n\nThis is why I agree with this statement from GrandSpleen:\n\n \n\n> If Helm of the Stormcaller is not in the victory display, you can still calculate how many progress tokens *should* be placed on stage 1, but when it comes to actually placing them on the quest card itself, you will not do it.\n\n \n\nThis part of GrandSpleen's statement is a lot less clear to me though even if I am inclined to agree:\n\n \n\n> If Helm of the Stormcaller is the active location, you'll calculate, then just go through the process as per usual.  When it comes time to place progress tokens on the quest, Helm of the Stormcaller will be in the victory display so you'll be free to place progress tokens.\n\n \n\nI think there are a few possible alternate interpretations as to how you resolve it here that I am having trouble wrapping my head around, but I think GrandSpleen's is the intended one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274899","commentId":2274899,"userName":"Seastan","timestamp":1466446001,"content":"I have no doubt GrandSpleen answer is the intended one. But I am just having trouble reconciling it with the rules.\n\n \n\nAccording to GrandSpleen's answer, when you complete an active location with victory points and a quest at the same time, you place the progress one by one onto the active location first, then you move the location to the victory display, then you start placing progress on the main quest, then advance the quest.\n\n \n\nBut this means when you complete an active location with a Response effect and a quest at the same time, you place the progress one by one onto the active location first, then it leaves play as an explored location. This is the trigger for the response, but you can't trigger the response yet because you know you are going to have enough progress to complete the active quest. So you place progress on the main quest, then advance the quest. Then advance the quest, then resolve the When Revealed on the quest, then trigger the response on the location. This just seems odd. Responses are supposed to interrupt the flow of the game and trigger whenever their conditions are met.\n\n \n\nSo I guess I was under the impression that the FAQ ruling made the assumption that you place the progress all at once, and is telling you to resolve the passive condition of flipping the quest card before the response condition on the active location. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2274937","commentId":2274937,"userName":"cmabr002","timestamp":1466447451,"content":"> So I guess I was under the impression that the FAQ ruling made the assumption that you place the progress all at once, and is telling you to resolve the passive condition of flipping the quest card before the response condition on the active location. \n\n \n\nI think that is a fair assumption given the ruling.  I also thought that, but when you cited the ruling I noticed that it doesn't explicitly say it.  It only heavily implies it...\n\n \n\nAlthough, due to this scenario, it does seem that progress placement is broken up to some extent.  1) Determine total progress to be placed, 2) place X progress on active location where X is active location's remaining quest points, 3) discard/add that location to victory display, and 4) immediately place any remaining progress onto the quest card (before resolving any effects that would trigger).\n\n \n\nIt does seem like the an active location with a \"when explored\" effect is supposed to be able to trigger in between steps 3 and 4, but due to the FAQ ruling, I guess it doesn't (even if I'm not sure why).\n\n \n\nAlternatively, it may be correct to play this scenario as interpretation B that philkav presented.\n\n \n\nBoth would follow the FAQ ruling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2275204","commentId":2275204,"userName":"GrandSpleen","timestamp":1466456398,"content":"> But this means when you complete an active location with a Response effect and a quest at the same time, you place the progress one by one onto the active location first, then it leaves play as an explored location. This is the trigger for the response, but you can't trigger the response yet because you know you are going to have enough progress to complete the active quest. So you place progress on the main quest, then advance the quest. Then advance the quest, then resolve the When Revealed on the quest, then trigger the response on the location. This just seems odd. Responses are supposed to interrupt the flow of the game and trigger whenever their conditions are met.\n\n \n\nYup, this is how I understand it.  1-place progress tokens, 2-advance quest, including resolution of any 'when revealed' effects, 3-resolve 'response' effects off the active location leaving play.  It was a weird ruling.  I remember when that ruling (advance quest card before resolving active location \"response\" effects) was added to the FAQ, I thought it was done specifically to deal with some otherwise broken card combo, but now I can't remember what it was.  But that is neither here nor there.\n\n \n\nCurrently I'm understanding it like this: anything that takes place \"immediately,\" such as a location leaving play as an explored location, or quest advancement, should happen immediately when that card has enough progress tokens (or other criterion is met, such as the encounter deck getting reshuffled after running out of cards).  \"Immediately\" needs to be fulfilled before \"Response\" or \"forced,\" so if you for example run out of encounter cards while revealing a treachery card during staging, you'll reshuffle the deck before you can trigger \"A Test of Will.\"  Likewise you'll advance the quest before you can trigger a \"Response\" effect on a location card.  But that card still got its progress tokens and left play before you advanced the quest (so Helm of the Stormcaller is in the victory display before you start to put tokens on the quest card -- it leaves play immediately upon getting enough progress tokens)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2275548","commentId":2275548,"userName":"Seastan","timestamp":1466474594,"content":">  \n> \n> > But this means when you complete an active location with a Response effect and a quest at the same time, you place the progress one by one onto the active location first, then it leaves play as an explored location. This is the trigger for the response, but you can't trigger the response yet because you know you are going to have enough progress to complete the active quest. So you place progress on the main quest, then advance the quest. Then advance the quest, then resolve the When Revealed on the quest, then trigger the response on the location. This just seems odd. Responses are supposed to interrupt the flow of the game and trigger whenever their conditions are met.\n> \n>  \n> \n> But that card still got its progress tokens and left play before you advanced the quest (so Helm of the Stormcaller is in the victory display before you start to put tokens on the quest card -- it leaves play immediately upon getting enough progress tokens).\n> \n>  \n\n \n\nThat statement in parentheses only follows if we place progress one at a time rather than all at once. But is that the case?\n\n \n\nSide note:\n\n \n\n>  \"Immediately\" needs to be fulfilled before \"Response\" or \"forced,\" so if you for example run out of encounter cards while revealing a treachery card during staging, you'll reshuffle the deck before you can trigger \"A Test of Will.\"\n\n \n\nI think this is incorrect. From the FAQ:\n\n \n\n>  \n> \n> Q: When I reveal the last card of the encounter deck, do I immediately reset the quest deck before resolving the staging of the revealed card?\n> \n>  \n> \n> A: No. Resolve the staging of the revealed card, including any ‘When Revealed’ effects, before resetting the quest deck, if able. If you are unable to completely resolve the staging of the card because it instructs you to interact with the encounter deck in some manner, then reset the quest deck and finish resolving the effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2275651","commentId":2275651,"userName":"GrandSpleen","timestamp":1466481474,"content":"You're right about that encounter deck reshuffling, my bad. As for progress tokens, you definitely don't place them one at a time, or you would be repeatedly triggering Forced effects that key off of placing tokens.  But perhaps you will resolve the active location and the quest card's progress tokens in discrete chunks?  That would look like this:\n\n \n\n1- calculate how much progress is to be placed\n\n2- aim to place progress tokens on the quest,\n\n3- wham! the active location siphons some of those progress tokens away\n\n4- place progress tokens on the quest\n\n \n\nWhere 3 and 4 are not done simultaneously, and neither are the progress tokens placed one at a time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2275889","commentId":2275889,"userName":"Seastan","timestamp":1466508952,"content":"> You're right about that encounter deck reshuffling, my bad. As for progress tokens, you definitely don't place them one at a time, or you would be repeatedly triggering Forced effects that key off of placing tokens.  But perhaps you will resolve the active location and the quest card's progress tokens in discrete chunks?  That would look like this:\n> \n>  \n> \n> 1- calculate how much progress is to be placed\n> \n> 2- aim to place progress tokens on the quest,\n> \n> 3- wham! the active location siphons some of those progress tokens away\n> \n> 4- place progress tokens on the quest\n> \n>  \n> \n> Where 3 and 4 are not done simultaneously, and neither are the progress tokens placed one at a time.\n\n \n\n5 - trigger effects based on the active location leaving play.\n\n \n\nWhile this seems to satisfy the FAQ, it doesn't sit right with me. If, as you say, 3 and 4 are not simultaneous, then there should be no ambiguity in resolving the \"leaves play\" effects of the active location. It should be after step 3.\n\n \n\nLet's say the developers wanted to make another quest with the same effect, but with a non-victory display location. How could it be done? You could make 1B say \"Progress cannot be placed here\" and the Location say \"Forced: once this leaves play as an explored location, stage 1B loses the text 'Progress cannot be placed here'\"\n\n \n\nBut according to steps 1-5 this would not work the same, since you don't trigger forced effects until after placing progress."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223075-a-couple-of-question-regarding-the-thing-of-the-depths/?do=findComment&comment=2276480","commentId":2276480,"userName":"hon","timestamp":1466532416,"content":"Here's a related question that may or may not help clarify this. Let's say you're on the first turn of Carn Dum with Accursed Battlefield as your active location, making all quest cards in play gain Battle. You quest enough to clear out the location and place some progress. If locations left play before you placed progress on the quest, wouldn't that mean the quest loses Battle and you would have to recalculate the quest will willpower, not attack? I really doubt this is the intent, so the ruling that quest progress is determined before discarding the active location makes sense to me, and would make me think that you can't place progress until the turn after the Helm of the Stormcaller enters the victory display, assuming you clear it out during the quest stage and not at some other time with some other effect.\n\n \n\nI'm not as familiar with the rulebook and FAQ as some others, so not sure how this holds up with a literal interpretation of the rules (or if it's even helpful), but it helped me conceptualize it and understand why it (kind of) has to be this way."}]}