{"url":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/","title":"Sailing Heading Off Course","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2275586","commentId":2275586,"userName":"player2090081","timestamp":1466476930,"content":"When playing Grey Havens for the first time (2 of us have played of hundreds of games), we completely disagreed on how to react to some of the encounter cards when it gives a choice of going off-course.\n\n \n\nExample:\n\n \n\nThrown Off-course\n\nCard Text:\nWhen Revealed: Either remove all progress from the current quest and raise each player’s threat by 4, or shift your heading off-course.\nShadow Text:\n\nShadow: If this attack destroys a character, shift your heading off-course.\n\n \n\nIn either case, if the heading is already set at Worst Case (lighting bolt) - can a choice me made to \"shift your heading off-course\" and then not move the heading since it's already at worst? or since it is already at Worst that option cannot be chosen and thus the player has to choose one of the other options?  I contend that choosing to shift heading is an action but since it's already at Worst then nothing happens, but partner doesn't think that's what FF intended - so what do you think?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2275643","commentId":2275643,"userName":"GrandSpleen","timestamp":1466481085,"content":"The rules are clear about this:\n\n \n\nGrey Havens rule insert pg 5\n\n\"If you are instructed to shift your heading off-course, you must rotate the Heading card 90 degrees counterclockwise so that your current Heading is one step closer to the worst setting.  If it is already at the worst setting, it cannot shift off-course.\"\n\n \n\nThe word \"cannot\" is always used deliberately in the rules.  If you're at the worst heading, you have to choose the other option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2275671","commentId":2275671,"userName":"player2090081","timestamp":1466483074,"content":"Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2275672","commentId":2275672,"userName":"player2090081","timestamp":1466483149,"content":"GrandSpleen where in WA do you live, and are you a member of Puget Sound LOTR FB?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2275721","commentId":2275721,"userName":"GrandSpleen","timestamp":1466488291,"content":"Yeah, I come to the meetups at Uptown sometimes, but haven't been out in a couple of months I think, as we've just had an addition to the family!  I live in Redmond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2278241","commentId":2278241,"userName":"Calvadur","timestamp":1466634152,"content":"This choose Cards are always hard to understand for me :S\n\n \n\nIf I have Zero Progress on a quest can I remove all progress from the quest (so I don't have to go off-course)? Or in General does the word all include Zero?\n\n \n\nIf I CAN'T, am I free to choose which Option to pick if I am at the worst Setting as I can't fully resolve any Option completly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2278270","commentId":2278270,"userName":"Kakita Shiro","timestamp":1466635867,"content":"Removing progress from the quest doesn't require you to have progress on the quest, so in this situation you can always completely fulfill that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223120-sailing-heading-off-course/?do=findComment&comment=2278401","commentId":2278401,"userName":"GrandSpleen","timestamp":1466645398,"content":"Well, if it said \"remove 1 progress token\" and you had 0, you couldn't choose that option.  But if you had 0 on the card and it said \"remove all,\" you could choose that option because yes, \"all\" includes 0 in our rules mechanics."}]}