{"url":"https://community.fantasyflightgames.com/topic/223572-black-riders-clarifications/","title":"Black Riders Clarifications","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/223572-black-riders-clarifications/?do=findComment&comment=2283723","commentId":2283723,"userName":"Edheliad","timestamp":1467021875,"content":"1) When a shadow card says that an enemy engages \"the next player\" and makes an immediate attack, what happens if you are playing solo? Another attack against you, or no effect?\n\n \n\n2) How does Ring-bearer Frodo interact with card that state \"If you control two or fewer heroes\"? The Ring-bearer \"does not contribute to the hero limit\", but I assume that doesn't mean \"does not contribute to the hero count\".\n\n \n\nBonus Lost Realm question) When counting \"Quest cards in play\" does that include the standard quest card, all stages of standard quest cards yet to be defeated, just the side quests in play in the staging area..?\n\nEdited June 27, 2016 by Edheliad"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223572-black-riders-clarifications/?do=findComment&comment=2283933","commentId":2283933,"userName":"GrandSpleen","timestamp":1467036074,"content":"1) No attack.  I don't know why \"next player\" doesn't seem to be defined in the Black Riders rule book, but here is the definition from The Long Dark, which I think is the first time the phrase was used:\n\n \n\n\"Next Player The next player is the player sitting directly to the left of the player referenced by the card effect. If there are no other players in the game, there is no next player.\"\n\n \n\n2) He still counts as a hero for card effects.\n\n \n\n3) The main quest (that is, the currently visible stage of the main quest) and all side quests care in play.  The rest of the quest deck doesn't count as 'in play' as it is still in the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223572-black-riders-clarifications/?do=findComment&comment=2284045","commentId":2284045,"userName":"PocketWraith","timestamp":1467040790,"content":"A note on question 2, if I remember rightly one of the designers (I think it was Matt Newman) has said that they don't tend to account for elements of the saga quests when designing cards for the main cycles, and as such he would absolutely give his blessing to anyone who wanted to play it as \"if you control two or fewer non-Fellowship heroes,\" even though that's not what the card actually says."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223572-black-riders-clarifications/?do=findComment&comment=2285473","commentId":2285473,"userName":"Edheliad","timestamp":1467125355,"content":"Thanks. I hadn't seen the clarification in The Long Dark, and had been playing it the other way (apart from one \"cheat\" moment against an annoying Ringwraith).\n\n \n\nMight have to use the fudged rules for \"two heroes\" if playing solo, but in multiplayer when passing Frodo back and forth it makes sense not to be able to play Vanish From Sight or get the Strider bonus when babysitting the Ringbearer."}]}