{"url":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/","title":"Side Quest Clarification","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2288436","commentId":2288436,"userName":"tnewman772","timestamp":1467268042,"content":"I am still trying to wrap my head around the side quest mechanic. I feel it will come clear when we play a scenario, but until then I am wondering - do the player side quests belong to a specific scenario, or can they be included in the player deck for any scenario desired? I am kind of wondering where to store the side quests in my box. The encounter side quests belong to specific encounter decks, but are the player ones generic and therefore should maybe get their own divider and be kept separate, to be included in any scenario that seems appropriate?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2288491","commentId":2288491,"userName":"Edheliad","timestamp":1467275801,"content":"Player side quests (with standard player card backing) are added to your decks like any other player card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2288794","commentId":2288794,"userName":"GrandSpleen","timestamp":1467295620,"content":"You can use them with any scenario, the player side quests are not stored to a particular one.  I have them stored separately from other player cards, with their own divider."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2288987","commentId":2288987,"userName":"Slothgodfather","timestamp":1467301925,"content":"> You can use them with any scenario, the player side quests are not stored to a particular one.  I have them stored separately from other player cards, with their own divider.\n\n \n\nI have each sphere separated and within each sphere (and neutral) is characters, attachments, events and side quests.  Sorted in that order.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2289566","commentId":2289566,"userName":"GrandSpleen","timestamp":1467319781,"content":"Almost same.  I have each sphere separated, then organized into heroes, allies, attachments, events, and then side quests in that order.  They fill two 650 card boxes (and everything is sleeved) and part of one smaller box (which has the neutral cards in it).\n\n \n\nOK, I'm officially discussing the organization of my card collection.  Again.  \n\n \n\nBut I love it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2289626","commentId":2289626,"userName":"tnewman772","timestamp":1467321652,"content":"Thanks, everyone! I see how it works now. I didn't know they would be classified by sphere because the first one was neutral and I had not opened the other packs yet. I am now making dividers for each sphere (plus neutral) for side quests, to be stored behind the Allies, Attachments, and Events for each sphere. I just bought a new box and made my own insert for it, as we have outgrown the two core set boxes. The new box contains all the player cards, and one core set box contains the encounter cards (with a Broken Token insert). That box is almost full but can now expand to the second Core Set box. I spend way too much time organizing, but I love the results!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2289638","commentId":2289638,"userName":"JJ48","timestamp":1467322173,"content":"I have my cards separated by sphere, except side quests.  Side quests I put together as the very last category of player cards, because I didn't feel there were enough in any given sphere to justify breaking them out separately.\n\n \n\nAnd I hate having to juggle multiple boxes, so I bought one of the big, 5000 card boxes with 5 rows.  The first row holds player cards, then 2 1/2 rows of encounter decks (still working on the nightmare decks, even though I'll probably never be able to beat them!  lol), and the last row holds the tokens and dials.  Definitely a handful, but I like being able to take everything together in one box.  Just don't drop it!  XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2289699","commentId":2289699,"userName":"tnewman772","timestamp":1467324954,"content":"JJ48, do you have any of your cards sleeved? We sleeve the player cards but not the encounter cards. It makes storage a little tricky sometimes because the sleeved cards take up more room."},{"commentUrl":"https://community.fantasyflightgames.com/topic/223817-side-quest-clarification/?do=findComment&comment=2289709","commentId":2289709,"userName":"JJ48","timestamp":1467325588,"content":"I don't.  It looks like the rows are wide enough to handle sleeves, but player cards would probably take up a bit more than a single row at that point."}]}