{"url":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/","title":"Dol Guldur Newbie Questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2292223","commentId":2292223,"userName":"SuperData","timestamp":1467472139,"content":"all i can say is wow.  in my experience of gaming, im not sure i can say ive ran into such a difficult game aspect in the \"core\" set.  My wife and i attempted to pass dol goldur for the first time last night and it became a very powerful negative play experience (my wife got the prisoner, then both caught in a web).  I had read it was tough, but yikes.  oh well, we'll practice some more and maybe get away from the base solo-sphere starter decks before attempting this mission again.\n\n \n\nbut, moving past my initial reactions to the level, we ran into some rules questions.  i am sure these have all been asked before so im sorry for the repetitiveness of the questions.  \n\n \n\nfirst one is more of a reaffirmation of what i read on here, you cant use caught in a web on the prisoner, correct?  once the hero is face down, you can't use the \"hero\" aspect of that card for caught in a web, right?  \n\n \n\nin regards to an objective with a location attached to it.  the rules talk about the location being removed from the objective once it is fully explored.  however, i didnt see in the rules where it confirms that you can \"travel\" to a location that is attached to an objective card.  but if you can't \"travel\" there, i couldnt figure out how you'd fully explore it since it's not active.  so we played it that you can travel to the location, thus removing the location and the objective from the staging area.  was that correct?  if not, how are you supposed to explore those attached locations?  \n\n \n\ndungeon jailer questions: is a tie an example of \"quested unsuccessfully\"?  also, i am assuming that the jailer can shuffle an objective card that has an attachment (thus shuffling the attachment as well) back in the deck for an unsuccessful quest attempt, is that correct?  or is it only unclaimed objectives with no attachments?  \n\n \n\nThanks for the help and clarification.  That is a tough mission, no doubt.  the frustrating part is i dont think there was anything we could have done differently (other than not playing the game) that would have changed the outcome.  time to travel back down the anduin for a little more practice.  \n\nEdited July 2, 2016 by SuperData"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2292246","commentId":2292246,"userName":"NathanH","timestamp":1467473639,"content":"1) I am unsure about the official status of the Captured Hero, but it makes sense to treat it as if it's out of play and therefore can't be Webbed.\n\n \n\n2) Cards that are guarding objectives function entirely as normal, so enemies can be engaged and locations can be traveled to.\n\n \n\n3) If you tie with the staging area's threat then you have neither quested successfully nor quested unsuccessfully. Thus, you would not trigger the jailer's effect.\n\n \n\n4) Guarded objectives can be affected by Dungeon Jailer. If the objective is guarded, then I believe the guarding card would remain in play, but can't find an explicit rule about this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2292292","commentId":2292292,"userName":"flightmaster101","timestamp":1467476420,"content":"> 1) I am unsure about the official status of the Captured Hero, but it makes sense to treat it as if it's out of play and therefore can't be Webbed.\n> \n>  \n> \n> 2) Cards that are guarding objectives function entirely as normal, so enemies can be engaged and locations can be traveled to.\n> \n>  \n> \n> 3) If you tie with the staging area's threat then you have neither quested successfully nor quested unsuccessfully. Thus, you would not trigger the jailer's effect.\n> \n>  \n> \n> 4) Guarded objectives can be affected by Dungeon Jailer. If the objective is guarded, then I believe the guarding card would remain in play, but can't find an explicit rule about this.\n\n1. Captured heroes cannot suffer/benefit from card effects so caught in a web will not attach to them. As far as core cards go the best defense for caught in a web is the iron hills miner.\n\n2. Concur.\n\n3. FAQ 1.24 only if your committed willpower is greater than staging area threat are you considered to have quested successfully. So I think DJ does trigger.\n\n4. FAQ page 9: DJ will shuffle any unclaimed objective, whether or not it's guarded.\n\nThis quest is a beast especially with a single core set. I recommend easy mode to get through the game the first few times until you really understand how to manipulate the encounter deck. Also the core set gives you a \"flavor\" of the game without any real specialization or combos to draw from. The only core set combo that stands the test of time is sneak attack+Gandalf. Don't feel bad if you consistently lose this quest, I've never beaten it with just core set cards on normal, and I have 3 core sets. I don't think I beat it w/o house rules until the khazad dum/Dwarrodelf stuff came out and you could build amazing dwarf decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2292356","commentId":2292356,"userName":"GrandSpleen","timestamp":1467479342,"content":"Welcome to the community!  Dol Guldur is hard, hard, yes, and hard.  I didn't get a win in 2-player until we had built our card pool up a little through the Mirkwood cycle (the adventure packs immediately following the core set, starting with The Hunt for Gollum).\n\n \n\nAs for that Dungeon Jailor, NathanH is correct that a 'tie' is not considered questing successfully or unsuccessfully.  I don't really see an official document that says so explicitly, but the core manual defines 'questing successfully' and 'questing unsuccessfully' and then talks about a tie in a different paragraph."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2292798","commentId":2292798,"userName":"SuperData","timestamp":1467504088,"content":"well its two to one on the jailer, a tie does not trigger is how we'll play it until i see otherwise.  in regards to dumping a guarded objective card, so those cards that \"attach\" to the objective dont really attach like an attachment?  i guess i figured they were attached to the objective card, so it the objective card gets shuffled in, then so does the card that is attached to it.  sounds like that is not true, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2293222","commentId":2293222,"userName":"987654321","timestamp":1467536799,"content":"A card effect which discards an attachment don't discard the character, so only the objective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224016-dol-guldur-newbie-questions/?do=findComment&comment=2293440","commentId":2293440,"userName":"GrandSpleen","timestamp":1467559098,"content":"Yeah it's different from player card atttachments.  Objective cards stay in play if the attached encounter card is discarded (otherwise you would lose them if they end up being guarded by a treachery!).  And likewise, the attached encounter card stays in play if the objective gets discarded through some card effect.  Objectives, or the scenario's other cards, will tell you how to 'claim' them and under what condition they can get discarded.  You can think of the Objective as being an attachment for the encounter card Guarding it though (rather than the other way around).  Here are some relevant entries from the official rules FAQ:\n\n \n\n\"(1.17) Unclaimed Objectives An unclaimed objective is one that is not currently claimed and under the control of a player. An unclaimed objective can be guarded or unguarded. A guarded objective is treated like an attachment if guarded by an enemy or location, and remains attached to that card until it leaves play, at which point it will return to the staging area. Any unclaimed objective in the staging area that is not attached to a card is considered to be unguarded. If an objective is claimed at one point, and then returns to the staging area, it regains the status of unclaimed.\"\n\n \n\n\"(1.23) Attachments Any objective card that attaches to another card is treated as an attachment in addition to its other card types. Any non-objective card that attaches to another card loses its original card type and gains the attachment card type. The “Attach to...” rules text on an attachment is only a play restriction, and is not taken into account after the card is already attached.\"\n\n \n\n\"(1.39) Staging objective cards When a player reveals an objective from the encounter deck, he adds it to the staging area unless that objective instructs the player to do something different.\"\n\n \n\n\"Q: Does Dungeon Jailer (CORE 101) shuffle guarded objectives back into the encounter deck? A: Yes. Dungeon Jailer will shuffle any unclaimed objective, whether or not it is guarded.\"\n\n \n\nThat FAQ can be found here [https://images-cdn.fantasyflightgames.com/filer_public/64/ee/64ee44ca-825d-4c14-b77b-b0ad7581ee31/lotr_faq_18.pdf]."}]}