{"url":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/","title":"Wow and cor blimey!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2292795","commentId":2292795,"userName":"Euph3m1sm","timestamp":1467504042,"content":"I have just got hold of this game after watching and reading reviews, going through tales from the cards and reading some areas of the forums.\n\nFirst have to say I am enjoying this game. I currently only have 1 core set and have only been trying the suggested decks from the rulebook; I don't think I've had such a good time getting beaten.\n\nIt's probably a reflection of my (in)ability but if Passage through Mirkwood is easy, then I'm doomed to perpetual failure! I've not managed to get through quest 1b yet (7 progress is my best). I have tactics to try and then I'll have a play around with deck building.\n\n3 of the first cycle adventure packs on the way!\n\nGreat game :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2292817","commentId":2292817,"userName":"joezim007","timestamp":1467505343,"content":"Don't bother using the suggested decks. The only thing they are good for is giving you a taste of all the cards if you take the time to test them all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2293337","commentId":2293337,"userName":"1mperia1Aces","timestamp":1467551186,"content":"Yeah, what joezim007 said. The core set decks can be fun if you're playing four player and they give you a good sense of each spheres strength, but especially in solo they are not very good. I suggest making your own deck using denethor, legolas, and eowyn. You could also do something pretty good with aragorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2293426","commentId":2293426,"userName":"Kakita Shiro","timestamp":1467557837,"content":"Theodred, Beravor, Eowyn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2293846","commentId":2293846,"userName":"alexbobspoons","timestamp":1467583865,"content":"It's a truly fantastic game, welcome.\n\nIt's great strength is how fun it is while you are losing. Just great fun, and I lose far more often than I win.\n\nDon't worry about your loss ratio, the game has a very steep learning curve.\n\nWith Passage through mirkwood, I managed to beat it with leadership, only just (with repeated tries) beat with lore and just no chance with spirit or tactics.\n\nBut when you start adventure 2 (journey along the anduin) you will get absolutely massacred, BUT will start to get the first ideas on combining spheres and designing a deck to beat a scenario. It's slow going but your skills will increase nd you'll feel great about it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnduin beat me so so many times but what an experience in those early days learning.\n\nI'm still a pretty rubbish player, yet with persistence and experimenting I've managed to beat all quests through the first two cycles and standalone exps up to part way through the first Hobbit box (not counting Escape from Dol Guldur which is just toooo hard).\n\nEnjoy the game and accept how hard it is but still enjoy ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224047-wow-and-cor-blimey/?do=findComment&comment=2293981","commentId":2293981,"userName":"Ecthelion III","timestamp":1467591588,"content":"Solid core set deck, courtesy of Beorn:\n\nhttp://ringsdb.com/decklist/view/305/beorn-s-path-2-journey-along-the-anduin-1.0 [http://ringsdb.com/decklist/view/305/beorn-s-path-2-journey-along-the-anduin-1.0]"}]}