{"url":"https://community.fantasyflightgames.com/topic/224149-attacking-an-enemy-twice/","title":"Attacking an enemy twice?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224149-attacking-an-enemy-twice/?do=findComment&comment=2294285","commentId":2294285,"userName":"JanB","timestamp":1467613614,"content":"Hi Folks,\n\n \n\nassuming that my heroes are all tactic heroes and i play Ritter aus Minas Tirith (Knight of Minas Tirith) [http://deckbauer.telfador.net/card.html&id=2844] in the planning phase and i engage an enemy and attack with the knights. The enemy isn't killed and in the combat phase i want to attack him normally .. is this legal?\n\n \n\n>  \n> \n>  \n> \n> If each of your heroes has a printed lotr-icon-tactics.gif [http://deckbauer.telfador.net/assets/cardgames/icons/lotr-icon-tactics.gif] resource icon, Knight of Minas Tirith gains: \"Response: After Knight of Minas Tirith enters play, choose an enemy in the staging area. Engage that enemy and exhaust Knight of Minas Tirith to delcare it as attacker (and resolve its attack) against that enemy\"\n\n \n\nDoes the limitation of attacks against one enemy take effect in the planning phase?\n\nEdited July 4, 2016 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224149-attacking-an-enemy-twice/?do=findComment&comment=2294377","commentId":2294377,"userName":"987654321","timestamp":1467621915,"content":"You can only attack each enemy once, but card effects ignore this limits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224149-attacking-an-enemy-twice/?do=findComment&comment=2294579","commentId":2294579,"userName":"Lecitadin","timestamp":1467638520,"content":"And you can even Sneak attack Ritter and attack an enemy during the combat phase after or before you attack enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224149-attacking-an-enemy-twice/?do=findComment&comment=2294825","commentId":2294825,"userName":"sappidus","timestamp":1467652863,"content":"> You can only attack each enemy once, but card effects ignore this limits.\n\nI believe it is more precise to say: the game framework allows for each player, in the combat phase, to declare up to 1 attack against each enemy with which he is engaged. And then, as you say, player card effects can allow for many kinds of extra-framework attacks.\n\nPrecise wording is necessary for understanding what the heck happens with Ranged characters, who can be declared (by their controllers) as attackers against enemies engaged with others OR participate in attacks declared by other players. Note that the 2nd possibility does not involve the Ranged character's controller declaring an attack! This allows for a Ranged character to attack the same enemy (engaged with another player) twice in one Combat phase if there's some way for said character to ready (or, in the case of a Trollshaw Scout with a Rivendell Bow, avoid exhausting in the first place), even in the absence of Quick Strike or other card effects granting an extra-framework attack.\n\n(Also see FAQ 1.11.)\n\nEdited July 4, 2016 by sappidus"}]}