{"url":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/","title":"King Under the Mountain and Ered Luin Miner","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301058","commentId":2301058,"userName":"Slothgodfather","timestamp":1467993784,"content":"King Under the Mountain:\n\nAction: Exhaust King Under the Mountain to look at the top 2 cards of your deck. Add 1 to your hand and discard the other.\n\n \n\nEred Luin Miner:\n\nResponse: After Ered Luin Miner is discarded from the top of your deck, put it into play under your control. \n\n \n\n \n\nDoes this work if you discard the Miner and draw the other card?  I'm pretty sure the answer is yes but someone else is questioning that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301062","commentId":2301062,"userName":"Kakita Shiro","timestamp":1467993901,"content":"Yes. King Under The Mountain doesn't move the cards off the top of your deck until you make your choice, so they are still on the top of your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301094","commentId":2301094,"userName":"Slothgodfather","timestamp":1467994583,"content":"That's what I was thinking.   Still doesn't make me too exited about this guy, but at least it is something.  But the fear of actually drawing him makes me really reconsider actually including him in the deck.   I'd almost just want to include Gandalf so he could get hit by Expert Treasure Hunter as well, or even Piped back onto the top of the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301098","commentId":2301098,"userName":"donkler","timestamp":1467994738,"content":"I think this is a good question since it specifically says \"top of your deck\" on Ered Luin Miner when Hidden Cache does not specify. With King Under the Mountain, I guess you could argue that after you take the one card in your hand, there is a brief period where the other card will be on top of your deck, even if originally it was the second card down. I think there is a similar ambiguity with using it with Zigil Miner. With his ability, do you discard the 2 cards one at a time, thus making the 2nd card also count as on the top of your deck before it is discarded? Or are they both discarded simultaneously?\n\n \n\nIt seems to me the intent was to make Ered Luin Miner synergize well with the other Dwarf related discard abilities, but to me it is not clear why they changed the wording on it compared to the Cache."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301111","commentId":2301111,"userName":"Slothgodfather","timestamp":1467995133,"content":"Honestly, when anything tells me do whatever with X cards from the top of my deck, I would consider all those cards to be the \"top of my deck\".   I don't think it's so much a symantic issue with what single card is on top of my deck.   Zigil Miner is messing with the 2 cards on top of my deck.  Same with King Under the Mountain.   A Very Good Tale is using 5 and I bet no one questions that Erin works in that regard.\n\nEdited July 8, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301121","commentId":2301121,"userName":"Slothgodfather","timestamp":1467995565,"content":"I hadn't reread Hidden Cache.   I would say that is an interesting choice for them to change the wording, except they are kind of known for using different wording for the same ability/intention throughout several of their games - here's looking at you GoT 1.0.   \n\n \n\nIf that Arkham Horror game is real, I sincerely hope they establish legitimate templates for the effects they create.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301142","commentId":2301142,"userName":"donkler","timestamp":1467996391,"content":"So would you say if you only had a single copy of Ered Luin Miner as your deck, and it was discarded from Throngs of Unfaithful, You could not put him into play since the effect refers to as the bottom of the deck and not the top of the deck?\n\n \n\nhttp://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH [http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301235","commentId":2301235,"userName":"Kakita Shiro","timestamp":1468000395,"content":"> So would you say if you only had a single copy of Ered Luin Miner as your deck, and it was discarded from Throngs of Unfaithful, You could not put him into play since the effect refers to as the bottom of the deck and not the top of the deck?\n> \n>  \n> \n> http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH [http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH]\n\nBy my off-the-cuff understanding, that is correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301423","commentId":2301423,"userName":"Slothgodfather","timestamp":1468009870,"content":"That is an odd scenario for sure.  I'd say that it is indeed both the top of the deck and the bottom of the deck.  And I'm sure we can rationalize it either way.  The discarding effect says to discard the bottom card, so you shouldn't be able to trigger the ability.  However, it IS the top card of the deck, and Erin doesn't care how he was discarded - just that he functionally came from the top of the deck.  This is why I'd think you can.\n\n \n\nNow sure, I am specifying that the top of the deck does consist of a single card with that statement.  And that seems to be your stance as well - except that you seem to be saying that only the top card is consider the top of the deck.   Then how on earth do you draw the top 2 cards from the deck when there is only 1 possible card on the top of the deck?  The effect in question is what is determining what constitutes the \"top\" of the deck.  That is how I see it, functionally.\n\n \n\nSide note - in all sincerity, thank you for linking the card.  Because I had no idea which one that was!\n\nEdited July 8, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2301550","commentId":2301550,"userName":"donkler","timestamp":1468015362,"content":"I think I might just send in a rules question for it, especially for the odd Throngs of the Dead case. Like I said earlier, I think it was intended for this card to work when discarding multiple cards off the top of the deck with Zigil Miner, King Under the Mountain, A Very Good Tale, etc., I'm just really curious what the distinction in the specific wording is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2304166","commentId":2304166,"userName":"Slothgodfather","timestamp":1468249074,"content":"let me know what you find out please!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2304461","commentId":2304461,"userName":"Valdemart","timestamp":1468260780,"content":"> So would you say if you only had a single copy of Ered Luin Miner as your deck, and it was discarded from Throngs of Unfaithful, You could not put him into play since the effect refers to as the bottom of the deck and not the top of the deck?\n> \n>  \n> \n> http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH [http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH]\n\n \n\nJust to say really quick that if we look at a conceptual algorithm for how this process would be implemented in a program code, when Throngs of Unfaithful targets the bottom card of the deck (an indexed database) will return that the needed card is indexed as 1. Then, when Ered Luin Miner tries to check for Response trigger, it will ask for the card on index 1, where it will find the Miner and the trigger condition will be fulfilled.\n\n \n\nTL,DR: The Response will trigger. \"Top\" and \"Bottom\" are just pointers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2304538","commentId":2304538,"userName":"donkler","timestamp":1468262780,"content":">  \n> \n> > So would you say if you only had a single copy of Ered Luin Miner as your deck, and it was discarded from Throngs of Unfaithful, You could not put him into play since the effect refers to as the bottom of the deck and not the top of the deck?\n> > \n> >  \n> > \n> > http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH [http://hallofbeorn.com/Cards/Details/Throngs-of-Unfaithful-TGH]\n> \n>  \n> \n> Just to say really quick that if we look at a conceptual algorithm for how this process would be implemented in a program code, when Throngs of Unfaithful targets the bottom card of the deck (an indexed database) will return that the needed card is indexed as 1. Then, when Ered Luin Miner tries to check for Response trigger, it will ask for the card on index 1, where it will find the Miner and the trigger condition will be fulfilled.\n> \n>  \n> \n> TL,DR: The Response will trigger. \"Top\" and \"Bottom\" are just pointers.\n> \n>  \n\n \n\nThat's sort of my main question though: is it based on an index of the specific card or the method itself that discarded the card? It could be both! I really like the Dwarf deck milling mechanic, and hope they explore it with more cards in the future.\n\n \n\nI just submitted a Rules clarification, so hopefully we'll have an official answer soon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2306535","commentId":2306535,"userName":"rsdockery","timestamp":1468352126,"content":"My guess is that the intended trigger is anything that says \"Discard [X] card from the top of your deck.\" Thus, you wouldn't get a free Miner from the bottom-deck shenanigans of the Numenor quest (nor from some hypothetical future effect that makes you \"Search your deck for the highest-cost Ally and discard it\")."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2307889","commentId":2307889,"userName":"donkler","timestamp":1468420251,"content":"Just heard back! So the method matters more than the actual location of the card. Good to know!\n\n \n\n \n\nFrom Me:\n\nMy question is related to Ered Luin Miner and when his Response triggers. Basically is the \"top of your deck\" referring to the method that discards him, or his specific location as the very top card of your deck? For example, when A Very Good Tale discards him, and he is the 5th card from the top of the deck, does that allow you to put him into play even though he was not the very top card of your deck? Or let's say that he is the only card in your deck and is discarded when the Throngs of Unfaithful enemy is defeated. Does his Response trigger? He is the top card of your deck but you technically discarded him from the bottom of your deck.\n\n \n\n \n\nCaleb:\n\nEred Luin Miner’s ability will trigger anytime he discarded by an effect that discards cards from the top of your deck. That does allow you to put him into play in the manner you describe in your example with A Very Good Tale. The Miner’s ability does not trigger when it is discarded from the bottom of your deck, even if it is the only card in your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2307906","commentId":2307906,"userName":"Slothgodfather","timestamp":1468420880,"content":"Thanks!  Except it still sort of leaves a question about the King Under the Mountain.  Does looking at the cards mean they are no longer considered part of the top of the deck?\n\nEdited July 13, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2308158","commentId":2308158,"userName":"donkler","timestamp":1468428212,"content":"I see no reason to think that it wouldn't work. You are still discarding it from the top of your deck, you just get to look at it first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2308713","commentId":2308713,"userName":"Slothgodfather","timestamp":1468447011,"content":"I agree, but someone else was questioning it on the Cardgamedb site, so that's why I brought the discussion here in the first place.   I did get an answer from Caleb, and it does work as expected:\n\n \n\n\"If you discard Ered Luin Miner with King Under the Mountain you can trigger the Miner's effect to put it into play because you are discarding it from the top of your deck. “Looking” at the top 2 cards of your deck does not move them from the top of your deck.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/224550-king-under-the-mountain-and-ered-luin-miner/?do=findComment&comment=2309290","commentId":2309290,"userName":"NathanH","timestamp":1468477485,"content":"My initial response to the ruling that discard-location matters was that it was really weird and silly, but then I remembered the treachery\n\n \n\n> When Revealed: Each player must discard a random card from his hand. Each player then searches his deck for each other copy of the card he discarded, and discards those as well. Shuffle each searched deck. \n\n \n\nIt would be odd to get a free Miner simply because he happened to be on top of your deck when this happens, so I think the rule is sensible after all.\n\nEdited July 14, 2016 by NathanH"}]}