{"url":"https://community.fantasyflightgames.com/topic/224516-helms-gate-card-in-helms-deep-saga-quest/","title":"Helm&#039;s Gate card in Helm&#039;s Deep saga quest","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224516-helms-gate-card-in-helms-deep-saga-quest/?do=findComment&comment=2300482","commentId":2300482,"userName":"JYoder","timestamp":1467953128,"content":"The wording on this card is rather odd. It says: \"While Helm's Gate is the active location, if any player is not engaged with an enemy, the first player reveals an encounter card at the end of each staging step.\"\n\n \n\nIt's the \"each\" word before \"staging step\" that's odd to me. Shouldn't it be \"the staging step\"? Otherwise, \"each staging step\" sounds as if after each player reveals a card, the first player may need to draw another card. So in a 4 player game, if only 1 person isn't engaged with an enemy, you'd have to draw 8 cards total, which sounds absurd. I take \"each staging step\" to mean each round, but then why not say \"the staging step\" as that's implied?\n\n \n\nI can't find anything in the rules to suggest there are multiple staging steps each round (one per person). Or is there?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224516-helms-gate-card-in-helms-deep-saga-quest/?do=findComment&comment=2300513","commentId":2300513,"userName":"Kakita Shiro","timestamp":1467955920,"content":"Yes, Saga quests do staging a little differently because of the Peril keyword; each player reveals a card from the encounter deck and that card is fully resolved, with any effects targeting that player if one player is singled out.\n\nFollowing from that, each encounter card is a staging step and if the player revealing the card is not engaged with an enemy another card is revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224516-helms-gate-card-in-helms-deep-saga-quest/?do=findComment&comment=2300527","commentId":2300527,"userName":"GrandSpleen","timestamp":1467957524,"content":"I think calling each player's card reveal a separate \"staging step\" is a mighty leap.  The saga expansion rules inserts only mention the Staging Step but simply say that, in turn order, each player reveals one card during the Staging Step.  \n\n \n\nI do not know why they chose the wording \"each staging step,\" but I would treat this card as if it said \"the staging step,\" because I see nothing to indicate that there is more than one staging step."}]}