{"url":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/","title":"Dol Guldur in solo only with Core Set?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2302161","commentId":2302161,"userName":"Rajam","timestamp":1468071539,"content":"I want to know if someone has managed to beat Dol Guldur in solo and only with cards from the Core Set. Which decks are the closest to be considered \"reliable\" decks?\n\n \n\nI'm guessing there is no deck even close to \"reliable\", and no matter what, you'll need a lot of attempts and plenty of luck. Still I wonder what's the best approach: mono-deck, 2-sphere, 3-sphere, ...? My guess is that you need Leadership, both for Steward and Sneak Attack - Gandalf (I'm foreseeing getting lucky with this combo is crucial), although I'm clueless about what else to add, considering the risks of adding more spheres in this particular scenario"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2302198","commentId":2302198,"userName":"John Constantine","timestamp":1468074641,"content":"I did. Pure luck though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2302214","commentId":2302214,"userName":"Qaanaaq","timestamp":1468075583,"content":"Nowhere near consistent but can be done. Aragorn is crucial so he can be readied. Eowyn is useful for beating the first stage fast."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2302993","commentId":2302993,"userName":"Calvadur","timestamp":1468153931,"content":"No way to beat it reliably with only the core set.\n\n \n\nI would suggest you build your deck around a specific captive hero (just restart the quest if you loose the wrong one). In theory that results in a 67% loses right off the bat, but you save a lot of time.\n\nOnce you have the right hero gone, pray for a nice set-up. When I beat it I got double necromancer's reach. Something like caught in a web Ends your run pretty much instantly.\n\nAfter surviving the set-up and first few rounds, it's more or less only the nazgul as questing through shouldn't be that hard. Without tactics he can be though especially if a shadow effect resolves (hasty stoke or feint that).\n\nThe last stage is pretty much a joke compared to the rest :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI would suggest a three sphere Spirit (Eowyn)-Leadership(Aragorn)-tactics(Gimli/Legolas) deck. That way you get the stewert and sneak attack+gandalf, the Spirit cancels and a few combat tricks. Stating threat is pretty high and you have to hope for few enemies in the first rounds, but luck is at least half the way to victory here :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nAlso I would say Speed is the name of the game. Get over the first stage quick and get your 3rd hero and throw everything on the nazgul.\n\n \n\nPersonlly I only grap the objectives when I Need them (map on eowyn), but you have to fear the dungeon jailor :S A Nice but risky trick is to pick the key up with Gimli so you get some extra attack strength for the nazgul"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2302997","commentId":2302997,"userName":"PigsAreOurEquals","timestamp":1468154422,"content":"I think Glaurung has a video on it but I 'm not sure.\nWith core set it's very difficult. I'd say with today's cardpool it has become do-able though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2303084","commentId":2303084,"userName":"Kakita Shiro","timestamp":1468164152,"content":"> I think Glaurung has a video on it but I 'm not sure.\n> \n> With core set it's very difficult. I'd say with today's cardpool it has become do-able though.\n\nThat video isn't Core-only, but impressive none the less."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224612-dol-guldur-in-solo-only-with-core-set/?do=findComment&comment=2313676","commentId":2313676,"userName":"TwiceBorn","timestamp":1468738167,"content":"For what it's worth, this thread documents my experiences against Escape from Dol Guldur using Core set cards only. I have managed to defeat it a handful of times... but the defeats by far outnumber the victories.\n\n \n\nhttps://community.fantasyflightgames.com/topic/124429-escape-from-dol-guldur-using-core-set-cards-only-straight-solo-and-2-handed/?hl=guldur [https://community.fantasyflightgames.com/topic/124429-escape-from-dol-guldur-using-core-set-cards-only-straight-solo-and-2-handed/?hl=guldur]\n\nEdited July 17, 2016 by TwiceBornh"}]}