{"url":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/","title":"Forth Eorlingas! and &quot;Immune to player card effects&quot; enemies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2308826","commentId":2308826,"userName":"sappidus","timestamp":1468450967,"content":"I'm just logging this here for the record...\n\nThis came up after someone realized it's possible to have maps in Temple of the Deceived that are impossible to win (fantastically unlikely but a cool little discovery, check it out here [https://www.reddit.com/r/lotrlcg/comments/4sby9y/impossible_map_for_temple_of_the_deceived/]). In brainstorming ways to get around the map lock, someone else brought up using Forth Eorlingas! to attack the Temple Guardian, which says:\n\n \n\nCombat Action: Each Rohan hero can be declared as an attacker against enemies in the staging area this phase.\n\nIt kind of seemed like Forth shouldn't work, as the Temple Guardian is Immune to player card effects, but it wasn't actually completely clear to me that Forth Eorlingas! doesn't work the same way that Quick Strike does: make some sort of modification to the declaration of \"framework\" attacks. Since Immune enemies are (of course) still susceptible to framework attacks, maybe Forth could work...? (As per the FAQ, Hands Upon the Bow cannot be used against Immune enemies because it forces targeting/choosing of the enemy. Note that this bars Dunhere and Haldir too.)\n\n \n\nI sent in an official query to get the final word, and here's what I got:\n\n \n\n\n\n> The distinction between Quick Strike’s effect and other similar effects is very subtle, so I understand the confusion around the different rulings. Basically, Quick Strike only works because it allows you to attack an enemy that you could typically attack. It just changes the time at which that attack takes place. The reason that effects like Hands Upon the Bow and Forth Eorlingas! do not work against enemies that are immune to player card effects is because you can’t typically attack an enemy in the staging area.\n\n \n\nSo all remains sane. (Except perhaps the fact that Quick Strike does work at all against Immune enemies, but that's another discussion...)\n\nEdited July 13, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2479749","commentId":2479749,"userName":"JanB","timestamp":1477696704,"content":"Mmm, what about Haldirs action?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480066","commentId":2480066,"userName":"NathanH","timestamp":1477726282,"content":"Basically what you have to remember that one use of Immune to Player Card Effects is to stop enemies being attacked until the designers want you to be able to. Therefore it'll be immune to any shenanigans effects like Haldir, Dunhere, Hands upon the Bow. Quick Strike is an exception because it isn't a shenanigans effect, it just lets you strike first when you're already in combat with someone.\n\n \n\nYou can try to wrangle the rules mess into something that makes sense to you if you want, but I don't see any point, because the designers will just rule in this way every time. Even if they secretly agreed your logic was correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480128","commentId":2480128,"userName":"JanB","timestamp":1477739222,"content":"> Basically what you have to remember that one use of Immune to Player Card Effects is to stop enemies being attacked until the designers want you to be able to. Therefore it'll be immune to any shenanigans effects like Haldir, Dunhere, Hands upon the Bow. Quick Strike is an exception because it isn't a shenanigans effect, it just lets you strike first when you're already in combat with someone.\n> \n>  \n> \n> You can try to wrangle the rules mess into something that makes sense to you if you want, but I don't see any point, because the designers will just rule in this way every time. Even if they secretly agreed your logic was correct.\n\n \n\nI think Dunhere is a legal option to attack an enemy in the staging area which is immune to player card effects. Because Dunhere only expands his attack-area, when he attacks alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480203","commentId":2480203,"userName":"sappidus","timestamp":1477747386,"content":"> I think Dunhere is a legal option to attack an enemy in the staging area which is immune to player card effects. Because Dunhere only expands his attack-area, when he attacks alone.\n\n \n\nThe surest way to remain quasilegitimate when pulling off shenanigans in this game is to never ask for a ruling, heh.\n\n \n\nThat said, Immunity specifically prohibits Dunhere's ability...\n\n \n\n> Additionally, cards that are immune to player card effects cannot be chosen as targets of player card effects. This means that any player card that uses a form of the words “target” or “choose” cannot choose a card that is immune to player card effects as its target.\n\n\n\n(In fact, I believe that at the time this was added to the FAQ, the only player card that used the word target as a verb at all was Dunhere.)\n\n \n\nHaldir, on the other hand, is an interesting question. Staging-area attack is out, but personally I assumed you just couldn't use his ability even if an Immune enemy was engaged with another player. Then it was pointed out that in that case, Haldir's Action could be seen as just declaring a Ranged framework attack slightly out of sequence (cf. Quick Strike), which the Immune enemy should still be vulnerable to. While it seems a touch against the spirit of Immunity to me, I can't see anything wrong with that logic -- never submitted an official query about it, though.\n\nEdited October 29, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480244","commentId":2480244,"userName":"Lecitadin","timestamp":1477750571,"content":"So any Immune to player effects card is also immune againts a player card that mention any eligible target or ennemy?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480253","commentId":2480253,"userName":"JanB","timestamp":1477750795,"content":"> Haldir, on the other hand, is an interesting question. Staging-area attack is out, but personally I assumed you just couldn't use his ability even if an Immune enemy was engaged with another player. Then it was pointed out that in that case, Haldir's Action could be seen as just declaring a Ranged framework attack slightly out of sequence (cf. Quick Strike), which the Immune enemy should still be vulnerable to. While it seems a touch against the spirit of Immunity to me, I can't see anything wrong with that logic -- never submitted an official query about it, though.\n\nSo making a ranged attack against an immune enemy is legal? I think 'ranged' is only a word for an effect, which allows the character to target an enemy engaged with another player (same as Dunhere in the staging area) ... im confused?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480254","commentId":2480254,"userName":"Lecitadin","timestamp":1477750906,"content":"I don't think Haldir's ability is legal against immune to player cards effect..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480283","commentId":2480283,"userName":"sappidus","timestamp":1477752661,"content":"> So any Immune to player effects card is also immune againts a player card that mention any eligible target or ennemy?\n\n \n\nRemember, Quick Strike works against Immune enemies, despite being worded \"Exhaust a character you control to immediately declare it as an attacker (and resolve its attack) against any eligible enemy target.\" So the presence of the word \"eligible\" is not a good heuristic to evaluate for a card's applicability in Immune situations. As the FAQ puts it for this situation (p. 13), \"...the chosen enemy's immunity does not factor.\" (Again, I consider this one of the most counterintuitive rulings in the game.)\n\n \n\nNow consider the wording of Haldir: \"Combat Action: If you have not engaged an enemy this round, exhaust Haldir of Lórien to declare him as an attacker (and resolve his attack) against an enemy not engaged with you.\" This is very, very similar to Quick Strike -- if you can come up with an argument that separates the two in this situation, I would love to hear it.\n\n \n\nOtherwise, let's take the FAQ again:\n\n \n\n\n\n> Q: What counts as a “ranged” attack?\n> \n> A: A ranged attack is an attack made by a character with the ranged keyword against an enemy engaged with another player.\n\n \n\nAnd elsewhere:\n\n \n\n\n\n> A card that is immune to player card effects can still be affected by normal framework effects such as placing progress from questing successfully, engaging an enemy during the encounter phase, or dealing damage through an attack made by a character.\n\nLet's throw in the Core's definition of ranged:\n\n\n\n> A character with the ranged keyword can be declared by its controller as an attacker against enemies that are engaged with other players.\n\nSo this is the putative reasoning:\n\n \n\n* Trigger Haldir's action, declaring him as an attacker against an Immune enemy engaged with someone else.\n\n* Per the above FAQ Q/A, this counts as a ranged attack.\n\n* (???) Per the Quick Strike stuff, it counts as a \"normal framework effect\" even though a player card Action is involved. To wit: look at Caleb's explanation in the OP of this thread: \"Basically, Quick Strike only works because it allows you to attack an enemy that you could typically attack. It just changes the time at which that attack takes place.\" Haldir's ability, when used against an engaged enemy, can be also be viewed as simply changing the time when a typical attack takes place.\n\n* Thus, per FAQ 1.47, the Immune enemy can still be damaged by it.\n\n \n\nThe question-marked step is the vulnerable point to me, but I do think it works.\n\n \n\n\n\n> So making a ranged attack against an immune enemy is legal? I think 'ranged' is only a word for an effect, which allows the character to target an enemy engaged with another player (same as Dunhere in the staging area) ... im confused?\n\nThis highlights the only other weakness in the above argument I can see: someone contending that Immune enemies are even immune to ranged attacks. Are you actually arguing for this, though?\n\nEdited October 29, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480309","commentId":2480309,"userName":"JanB","timestamp":1477754260,"content":"> This highlights the only other weakness in the above argument I can see: someone contending that Immune enemies are even immune to ranged attacks. Are you actually arguing for this, though?\n\nIf Dunhere is not allowed to target immune enemies in the staging area ... yes, then ranged should be handled the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480332","commentId":2480332,"userName":"Lecitadin","timestamp":1477755276,"content":"This is confusing....  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480624","commentId":2480624,"userName":"dalestephenson","timestamp":1477774806,"content":"I'm not sure how \"ranged\" factors into this discussion.  I agree Haldir's ability wouldn't work against an immune enemy, but Haldir's ability does not say it is a ranged attack, nor would it fit the core definition of a ranged attack against an enemy in staging and engaged with no one.  Any ranged character, Haldir included, should be able to use the ranged keyword to attack immune enemies engaged with a different player, just as any sentinel character could defend against immune enemies engaged with a different player..\n\nEdited October 29, 2016 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480652","commentId":2480652,"userName":"shosuko","timestamp":1477777204,"content":"I don't think Ranged matters, since that is part of a standard type of attack.  Ranged doesn't create an extra attack, or extend attacks.  Just like Quick Strike, Ranged simply lets that character participate in another player's engaged attack.  You still only get 1 attack per enemy, so Ranged doesn't create a 2nd opportunity, it just allows them to participate in the attack of another player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2480771","commentId":2480771,"userName":"RichardPlunkett","timestamp":1477790703,"content":"I am thinking that Caleb's distinction between QuickStrike and Hands Upon the Bow/Forth Eorlingas is dubious at best. This feels like a bad ruling/policy.\n\n \n\nThese cards modify the Player capabilities, but the player is still making an attack, and attacks work on immune characters. I think the cards should work.\n\n \n\nNote, Quick Strike changes when we can attack, but not who (and works on immune).\n\nRanged changes who we can attack (and works on immune).\n\nHands Upon the Bow changes who we can attack and when, but for some reason cannot work?\n\nForth Eorlingas just changes who we can attack, but for some reason cannot work?\n\n \n\nThat set comes across as somewhat incoherent. In all cases, the change seems to be made to the player or player-cards, not the immune card. This should go down fine (much the same way that you can prevent damage to immune characters, because the thing being affected isn't the immune thing).\n\n \n\nI think life would be much better if they both worked just fine (and if deemed necessary were errata'd to preserve 'current' behaviour/limitations).\n\nAlternatively, I would be content with a rule/ruling that attacks initiated by card effects are considered card effects (which stops QuickStrike as well as Hands/Forth).\n\n \n\nBut the current arrangement is making me sad.\n\nEdited October 30, 2016 by RichardPlunkett"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2481023","commentId":2481023,"userName":"sappidus","timestamp":1477825162,"content":"It's worth noting that the original ruling was that Quick Strike and Hands Upon the Bow both worked on Immune enemies. Caleb only later reversed his ruling to the one active today. So he actually switched into this state of affairs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2481118","commentId":2481118,"userName":"Lecitadin","timestamp":1477836663,"content":":blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482071","commentId":2482071,"userName":"JanB","timestamp":1477926013,"content":"Got a long mail form Caleb - will attach it later, when home.\n\n \n\nShort abstract ... Ranged and Sentinel work as normal against/with immune enemies. Effects, which let you attack an immune enemy in the staging area are illegal .. such as Haldir, Hands upon a Bow, Forth Eorlingas and probably Dunhere (Dunhere wasn't directly mentioned in the mail..)\n\n \n\nSo, if Haldirs effect, when attacking an enemy engaged with another player is illegal .. i don't know, haven't asked this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482118","commentId":2482118,"userName":"Lecitadin","timestamp":1477927417,"content":"Thanks for the clarification! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482154","commentId":2482154,"userName":"sappidus","timestamp":1477928543,"content":"Looking forward to JanB's full response. Meanwhile, here's what I got from Caleb:\n\n> The ranged and sentinel keywords are abilities that affect the character they appear on, so an enemy'S immunity to card effects does not prevent you from using those keywords. You can use a sentinel character to defend an enemy that is immune to player card effects when it is attacking another player, and you can use a ranged character to attack an enemy engaged with another player too.\n\n(For reference, even though the FAQ nowadays makes his case clear, Dunhere is explicitly mentioned in this ruling: https://boardgamegeek.com/thread/1086021/official-ruling-dunhere-hands-upon-bow-and-enemies [https://boardgamegeek.com/thread/1086021/official-ruling-dunhere-hands-upon-bow-and-enemies] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482255","commentId":2482255,"userName":"cmabr002","timestamp":1477932007,"content":"> I'm just logging this here for the record...\n> \n> This came up after someone realized it's possible to have maps in Temple of the Deceived that are impossible to win (fantastically unlikely but a cool little discovery, check it out here [https://www.reddit.com/r/lotrlcg/comments/4sby9y/impossible_map_for_temple_of_the_deceived/]). In brainstorming ways to get around the map lock, someone else brought up using Forth Eorlingas! to attack the Temple Guardian, which says:\n> \n>  \n> \n> Combat Action: Each Rohan hero can be declared as an attacker against enemies in the staging area this phase.\n> \n> It kind of seemed like Forth shouldn't work, as the Temple Guardian is Immune to player card effects, but it wasn't actually completely clear to me that Forth Eorlingas! doesn't work the same way that Quick Strike does: make some sort of modification to the declaration of \"framework\" attacks. Since Immune enemies are (of course) still susceptible to framework attacks, maybe Forth could work...? (As per the FAQ, Hands Upon the Bow cannot be used against Immune enemies because it forces targeting/choosing of the enemy. Note that this bars Dunhere and Haldir too.)\n> \n>  \n> \n> I sent in an official query to get the final word, and here's what I got:\n> \n>  \n> \n> > The distinction between Quick Strike’s effect and other similar effects is very subtle, so I understand the confusion around the different rulings. Basically, Quick Strike only works because it allows you to attack an enemy that you could typically attack. It just changes the time at which that attack takes place. The reason that effects like Hands Upon the Bow and Forth Eorlingas! do not work against enemies that are immune to player card effects is because you can’t typically attack an enemy in the staging area.\n\n \n\nYou can't typically attack an enemy engaged with another player either.\n\n \n\n>  \n> \n> > The ranged and sentinel keywords are abilities that affect the character they appear on, so an enemy'S immunity to card effects does not prevent you from using those keywords. You can use a sentinel character to defend an enemy that is immune to player card effects when it is attacking another player, and you can use a ranged character to attack an enemy engaged with another player too.\n\n \n\n \n\nThose two rulings seem contradictory.  Ranged and Forth Eorlingas! both definitely affect the card and not the enemy and neither uses a form of the verb target.\n\n \n\nI'm just going to assume cards like Forth Eorlingas! and Hands Upon the Bow do use a form of the word target and call it a day.\n\nEdited October 31, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482294","commentId":2482294,"userName":"Seastan","timestamp":1477933065,"content":"> You cannot attack enemies in the staging area that are \"immune to player card effects\", even if you think some card or ability is letting you. And if you try to bring up the \"Golden Rule\", I will punch you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482315","commentId":2482315,"userName":"shosuko","timestamp":1477933718,"content":">  \n> \n> > I'm just logging this here for the record...\n> > \n> > This came up after someone realized it's possible to have maps in Temple of the Deceived that are impossible to win (fantastically unlikely but a cool little discovery, check it out here [https://www.reddit.com/r/lotrlcg/comments/4sby9y/impossible_map_for_temple_of_the_deceived/]). In brainstorming ways to get around the map lock, someone else brought up using Forth Eorlingas! to attack the Temple Guardian, which says:\n> > \n> >  \n> > \n> > Combat Action: Each Rohan hero can be declared as an attacker against enemies in the staging area this phase.\n> > \n> > It kind of seemed like Forth shouldn't work, as the Temple Guardian is Immune to player card effects, but it wasn't actually completely clear to me that Forth Eorlingas! doesn't work the same way that Quick Strike does: make some sort of modification to the declaration of \"framework\" attacks. Since Immune enemies are (of course) still susceptible to framework attacks, maybe Forth could work...? (As per the FAQ, Hands Upon the Bow cannot be used against Immune enemies because it forces targeting/choosing of the enemy. Note that this bars Dunhere and Haldir too.)\n> > \n> >  \n> > \n> > I sent in an official query to get the final word, and here's what I got:\n> > \n> >  \n> > \n> > > The distinction between Quick Strike’s effect and other similar effects is very subtle, so I understand the confusion around the different rulings. Basically, Quick Strike only works because it allows you to attack an enemy that you could typically attack. It just changes the time at which that attack takes place. The reason that effects like Hands Upon the Bow and Forth Eorlingas! do not work against enemies that are immune to player card effects is because you can’t typically attack an enemy in the staging area.\n> \n>  \n> \n> You can't typically attack an enemy engaged with another player either.\n\nA character with Ranged is typically able to attack an enemy engaged with another player.  That other player does not need to initiate, or participate in the attack.  It is still only 1 attack per enemy, but a player with ranged could initiate the attack on an enemy engaged with another player and this is by the framework of the game allowing a ranged character to attack an enemy engaged with a different player, not by any ability.  Which I think is the distinction here.\n\n \n\nIf it is a framework attack, then you can do it.  So you can use Quick Strike to make an attack against an enemy who is immune to card effects so long as that attack goes by the game's framework for attacks (engaged with you, or ranged engaged with another player) but no card ability such as Dunhere, Haldir, or Forth Eorlings would work because they are changing the nature of the framework attack.\n\n \n\nOf course - if the card is not immune to card effects, you can use Quick Strike to have Dunhere attack an enemy in the staging area during the Quest phase.\n\nEdited October 31, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482322","commentId":2482322,"userName":"cmabr002","timestamp":1477934272,"content":">  \n> \n> >  \n> > \n> > > I'm just logging this here for the record...\n> > > \n> > > This came up after someone realized it's possible to have maps in Temple of the Deceived that are impossible to win (fantastically unlikely but a cool little discovery, check it out here [https://www.reddit.com/r/lotrlcg/comments/4sby9y/impossible_map_for_temple_of_the_deceived/]). In brainstorming ways to get around the map lock, someone else brought up using Forth Eorlingas! to attack the Temple Guardian, which says:\n> > > \n> > >  \n> > > \n> > > Combat Action: Each Rohan hero can be declared as an attacker against enemies in the staging area this phase.\n> > > \n> > > It kind of seemed like Forth shouldn't work, as the Temple Guardian is Immune to player card effects, but it wasn't actually completely clear to me that Forth Eorlingas! doesn't work the same way that Quick Strike does: make some sort of modification to the declaration of \"framework\" attacks. Since Immune enemies are (of course) still susceptible to framework attacks, maybe Forth could work...? (As per the FAQ, Hands Upon the Bow cannot be used against Immune enemies because it forces targeting/choosing of the enemy. Note that this bars Dunhere and Haldir too.)\n> > > \n> > >  \n> > > \n> > > I sent in an official query to get the final word, and here's what I got:\n> > > \n> > >  \n> > > \n> > > > The distinction between Quick Strike’s effect and other similar effects is very subtle, so I understand the confusion around the different rulings. Basically, Quick Strike only works because it allows you to attack an enemy that you could typically attack. It just changes the time at which that attack takes place. The reason that effects like Hands Upon the Bow and Forth Eorlingas! do not work against enemies that are immune to player card effects is because you can’t typically attack an enemy in the staging area.\n> > \n> >  \n> > \n> > You can't typically attack an enemy engaged with another player either.\n> \n> A character [affected by Forth Eorlingas!] with Ranged is typically able to attack an enemy [in the staging area] engaged with another player.  That other player does not need to initiate the attack.  It is still only 1 attack per enemy, but a player with ranged could initiate the attack on an enemy engaged with another player allowing their enemy to be killed before it would be their turn to initiate their attack against it.\n> \n>  \n\n \n\nI'm not sure it is worthwhile to argue what a character can and cannot typically do.  That's a mess.  But I'm curious...\n\n \n\n1.  Would you say Eowyn could typically attack an enemy that is immune to player card effects and engaged with another player?\n\n2.  Would you say Eowyn with a Dunedain Cache could typically attack an enemy that is immune to player card effects and engaged with another player? \n\n3.  Would you say Eowyn with Forth Eorlingas! could typically attack an enemy that is immune to player card effects and is in the staging area?\n\n \n\nBonus (and I'll even answer this one for you :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]): Can one typically understand LOTR LCG rulings surrounding immunity to player card effects?  No!\n\n \n\nEdit: The truth is, we know how they are supposed to interact now, because we've asked, so that's good.  But it is seemingly contradictory based on the current rules we have.  They could easily come out and say why Ranged is different and why it is special, but it doesn't matter why in my opinion.  The why will most certainly be something arbitrary (like what you've stated regarding what a character can and cannot do \"typically\").  Arbitrary/one-off rulings are not helpful for players because they cannot be applied to future, similar situations.\n\nEdited October 31, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482388","commentId":2482388,"userName":"dalestephenson","timestamp":1477936850,"content":"If we changed \"ordinarily attack\" to \"make an ordinary attack\", I think a clear distinction can be made between ranged and Forth Eorlingas!  A ranged character makes ordinary attacks against engaged enemies, they can combine with other players, there is no distinction made by kind and number.  With Forth Eorlingas! they are not ordinary attacks, they are attacks against enemies not engaged and they are restricted to Rohan Heroes only.\n\n \n\nHowever, Quick Strike is also enabling a non ordinary attack, since it's restricted to a single individual.  So it's not just a matter of being an \"ordinary attack\" which would exclude Haldir/Dunhere/Great Yew Bow.\n\n \n\nSo I think the invisible \"target\" is the most coherent explanation.  Engaged enemies can be attacked, immune or not, which means that anyone who can attack an enemy engaged with player A (which includes all ranged characters for B/C/D) can attack an immune enemy.  Enemies in the staging area (who aren't considered to be engaged) can't ordinarily be affected, so any cards that lets you attack them necessarily requires using a card effect to target that enemy -- and that's where the immune kicks in.\n\n \n\nI think it necessarily follows that if there is an immune enemy in the staging area *that is considered to be engaged* with the Dunhere player, that Dunhere can get his +1 attack if he attacks alone, since the bonus affects only Dunhere and is conditional solely on where the attacked enemy is.  Given the defense on such immune enemies, that's probably not very useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/224931-forth-eorlingas-and-immune-to-player-card-effects-enemies/?do=findComment&comment=2482429","commentId":2482429,"userName":"sappidus","timestamp":1477938215,"content":"> I think it necessarily follows that if there is an immune enemy in the staging area *that is considered to be engaged* with the Dunhere player, that Dunhere can get his +1 attack if he attacks alone, since the bonus affects only Dunhere and is conditional solely on where the attacked enemy is.  Given the defense on such immune enemies, that's probably not very useful.\n\nWhile I essentially agree with cmabr002 that it is often fruitless to quibble about any effects surrounding Immune enemies, I still want to register disagreement on this point. Dúnhere is worded:\n\n\"Dúnhere can target enemies in the staging area when he attacks alone. When doing so, he gets +1 Attack.\"\n\ni.e., he only gets his bonus when \"targeting\", which the FAQ says he cannot do to the Immune enemy."}]}