{"url":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/","title":"Soft Mires location question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/?do=findComment&comment=2310825","commentId":2310825,"userName":"JYoder","timestamp":1468556804,"content":"In Land of Shadow saga exp, first quest called \"The Passage of the Marshes\", there is a Soft Mires location. At the end of the round, any card with Mire keyword gets 1 resource token and is discarded (I assumed into discard pile, not victory display). \"Soft Mires\" has \"Mire 1\" so at end of round, I put 1 token on it and discard. It's trigger is to draw another encounter card. When I do, the new card also has a \"Mire\" keyword.\n\n \n\nDo I put a token on it, or has the \"place 1 resource token on each mire location\" step passed? I'd normally say it's passed, except the rules say when a card has an X mire resources, you immediately discard it, which maybe hints you do each location one at a time. So maybe the step hasn't passed yet and it should get 1 resource token? Not sure.\n\nEdited July 15, 2016 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/?do=findComment&comment=2310841","commentId":2310841,"userName":"Kakita Shiro","timestamp":1468558157,"content":"Don't place it on the new one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/?do=findComment&comment=2310850","commentId":2310850,"userName":"JYoder","timestamp":1468558857,"content":"What's your reasoning? Has it been ruled this way? Or is there precedence for it in some other ruling?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/?do=findComment&comment=2310879","commentId":2310879,"userName":"GrandSpleen","timestamp":1468562271,"content":"It's previously been ruled that you do not resolve a Forced effect if its trigger occurred while the card with the Forced effect was not in play. So, say at end of round you are forced to reveal a card, then the revealed card has a Forced effect which triggers at the end of the round.  You wouldn't trigger it because the revealed card was not in play when the trigger occurred.\n\n \n\nMire is not a Forced effect, but I imagine it would follow the same logic.  The Time keyword, as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225023-soft-mires-location-question/?do=findComment&comment=2311325","commentId":2311325,"userName":"JYoder","timestamp":1468591061,"content":"Ah, perfect! Thanks!"}]}