{"url":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/","title":"makes sense a future cicle with eagles?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2320648","commentId":2320648,"userName":"Mndela","timestamp":1469124923,"content":"i have just thought about it. what do you think?\n\nour heroes must go to the climb of the high mountains, to help the locations of the eagles. the eagles sometimes help the heroes too, allowing ridding on them, and a lot of more possible ideas.\n\ni think it is reasonable, eagle trait is the most abandoned trait in this moment, in fact. and we still haven't seen any big enemy criature flying (leaving dragons aside) as in the peter jackson film, when bolgo just arrives. only eagles could combat them. (and legolas, ridding one, but lego is lego ).\n\nEdited July 21, 2016 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321266","commentId":2321266,"userName":"JsBingley","timestamp":1469146295,"content":"Meneldor wil be in the last saga I guess.\n\n \n\nMaybe there will be some eagle event and attachment interact with location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321313","commentId":2321313,"userName":"Lecitadin","timestamp":1469148362,"content":"Love the idea!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321428","commentId":2321428,"userName":"Finduin","timestamp":1469156493,"content":"Mndela, quiero hablar contigo, te escribí a tu Face, pero sin respuesta.\n\nSaludos!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321492","commentId":2321492,"userName":"Gizlivadi","timestamp":1469162504,"content":"A possible Northern Rhovanion cycle could have a pack that takes place or even in the Eagle's Eyrie. A revival of the eagles would fit right in such a cycle along with Mirkwood, Esgaroth and the Withered Heath."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321533","commentId":2321533,"userName":"Finduin","timestamp":1469167288,"content":"We need to enter and attack Mount Gundabad!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321620","commentId":2321620,"userName":"Fingolfin Fate","timestamp":1469174269,"content":"Yes, I had previously thought the Grey Havens would be the last cycle (just like it is the last chapter of the book), but since it is not the case, the road will likely turn from Harad to Rhun (bypassing Mordor) and further to Erebor/Mirkwood or even as far as Gundabad, turning to the west again.\n\n \n\nSide question, how many more cycles do you think? Will it go so long after the saga has finished?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321621","commentId":2321621,"userName":"Crabble","timestamp":1469174314,"content":"I would love to see an eagle tactic hero! Eagles is up until now still one of my favorite archetype to play ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321761","commentId":2321761,"userName":"alexbobspoons","timestamp":1469184224,"content":"Where do the eagles dwell? Can it be a snowy region :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I need a snowy cycle and Eagles would be great too.\n\nI have fond memories of Journey to Rhosgobel I thought it was a good quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321821","commentId":2321821,"userName":"987654321","timestamp":1469188568,"content":"> Where do the eagles dwell? Can it be a snowy region :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I need a snowy cycle and Eagles would be great too.\n> \n> I have fond memories of Journey to Rhosgobel I thought it was a good quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI think that too but prepare for a lot of hate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2321964","commentId":2321964,"userName":"soullos","timestamp":1469195264,"content":"I'd be down with more eagles and tamed beasts. Effectively, more Creatures to play with, give ol' Radagast a reason to be relevant for once. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2322007","commentId":2322007,"userName":"Edheliad","timestamp":1469196757,"content":"> I'd be down with more eagles and tamed beasts. Effectively, more Creatures to play with, give ol' Radagast a reason to be relevant for once. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nA relevant, useful Radagast wouldn't be true to the books."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2322271","commentId":2322271,"userName":"dalestephenson","timestamp":1469205876,"content":"Edheliad is channeling Saruman, but Gandalf had a different opinion.  Our exposure to Radagast is somewhat limited, but we know from Gandalf's account the following details:\n\n \n\n1) He brought word from Saruman that the Nine were abroad and seeking the shire, finding Gandalf and giving him this warning at the end of June -- adequate time for Frodo and the ring to safely go to Rivendell, had Barliman a better memory.\n\n \n\n2) After delivering the message he immediately rode off and created an information network among his Mirkwood friends to actively gather information, including the Eagles of the Mountains.  The eagles gathered information about the nine's movements, orcs and wolves mustering, and Gollum's escape.\n\n \n\n3) And following Radagast's instruction, Gwaihir himself brought the information to Gandalf at Orthanc, and was able to rescue him when no one else could.\n\n \n\nWithout Radagast, the quest would've failed.  Saruman's contempt cost him dearly.\n\n \n\nGandalf says \"Radagast is, of course, a worthy Wizard, a master of shapes and changes of hue; and he has much lore of herbs and beasts, and birds are especially his friends\".  By \"master of shapes and changes of hue\" I presume that Radagast had Beorn-like skin-changing capabilities, and also effective means of disguise.  It would be good to see a Radagast hero with some neat power that has some cool power appropriate for a \"master of shapes and changes of hue.\"\n\n \n\nI also find in Radagast's behavior an indication that he had some active plan to work against Sauron's forces.  A disinterested observer who is kind enough to deliver a message has no need to immediately mount and \"turn back at once\", nor to ride \"as if the Nine were after him.\"  Although he does not appear further in the text, there is no reason to suppose he spent the rest of the book relaxing with his animal buddies.  With his association with Eagles, it's quite possible he played a role in sending the collected Eagles to the final battle, and not unreasonable to suppose his intelligence gathering around Mirkwood continued, and perhaps that helped both Celeborn and Thranduil in repulsing attacks during the War of the Ring.  Like the kinsmen of Gimli and Legolas, Radagast had no need to come to Gondor to participate in the War of the Ring.\n\n \n\nThe timing of the Eagles appearance in the last battle may also be instructive in this regard.  Here's the battles around Mirkwood from Appendix B:\n\n \n\nMar 11--First assault on Lorien repelled\n\nMar 15--Second assault on Lorien repelled, Thranduil attacked and victorious\n\nMar 22--Third assault on Lorien repelled\n\nMar 25--Eagles appear at Morannon\n\n \n\nThe Eagles didn't make an appearance in the South until after the last battle in Mirkwood.  (There was still an easterling army besieging Erebor, but that was no longer a battle situation since Mar 17th.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225499-makes-sense-a-future-cicle-with-eagles/?do=findComment&comment=2322510","commentId":2322510,"userName":"Fingolfin Fate","timestamp":1469215686,"content":"mr stephenson, if that is the name, i really, really like your posts"}]}