{"url":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/","title":"Prince Imrahil (The Flame of the West, Ally) and Caldara","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2325945","commentId":2325945,"userName":"Slothgodfather","timestamp":1469462312,"content":"It was brought up in a few different threads about the spoiled Prince Imrahil from the Flame in the West box and how his ability works/doesn't work with Caldara.  Figured instead of hunting those threads I'd just start a new one in the proper spot.\n\n \n\n \n\nPrince Imrahil is an ally with the conditional passive text: While there is a hero card in your discard pile, Prince Imrahil loses the ally card type and gains the hero card type.\n\n \n\nCaldara has the action ability: Discard Caldara to put 1 spirit ally from your discard pile into play for each other hero you control with a printed spirit resource icon.\n\n \n\nI went ahead and asked Caleb how these two interact with the scenario that my 3 starting heroes have the printed spirit icon, one is Caldara, the Prince Imrahil ally is in play and is still an ally.  Then, I trigger Caldara's ability.  How many allies do I get out of the discard pile?    And here is his response:\n\n \n\nHi Benjamin,\nPrince Imrahil’s text is a passive effect that is constantly checking the game state to see if there is a hero in your discard pile, so the instant that Caldara is placed in your discard pile he becomes a hero. As for Caldara, the cost to trigger her effect is to place her in the discard pile, and you cannot trigger an effect without paying the cost first. So, you must discard Caldara before you can resolve the rest of her effect. That means Imrahil is a hero at the time that you calculate how many allies you put into play, which means you can get up to 3 allies into play with Caldara’s effect (or even 4 if you make a unique spirit ally a hero with Sword-thain first).\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2325992","commentId":2325992,"userName":"Teamjimby","timestamp":1469463789,"content":"Wow.  That is so broken.  Thanks for getting clarification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2326024","commentId":2326024,"userName":"Slothgodfather","timestamp":1469464691,"content":"> Wow.  That is so awesome.  Thanks for getting clarification.\n\n \n\nFixed that for you.   :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2326094","commentId":2326094,"userName":"cmabr002","timestamp":1469467310,"content":"Holy smokes...even though I was hoping it would work this way, I didn't expect this ruling.  I figured we'd either receive a ruling that simply said \"The intention is that you only get two allies\" without providing justification so we couldn't take the ruling outside of this one interaction or we would receive an errata.\n\n \n\nBut here we are, discarding a hero for 4 allies (with Sword-thain) and then generating 4 resources the following turn.  Assuming one of your heroes is Arwen, one simple discard lets you generate enough resources in a single turn to pay for Fortune or Fate in order to repeat the process.\n\nEdited July 25, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2326099","commentId":2326099,"userName":"987654321","timestamp":1469467500,"content":"There's a fanmade scenario where you start with an additional hero. 5 allies here I come!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2327066","commentId":2327066,"userName":"NathanH","timestamp":1469512120,"content":"This initially surprised me but to be fair it makes sense when you compare with Gondorian Fire. For that attachment, the resource is clearly spent before the effect kicks in. So Caldara must be in the discard pile when the effect kicks in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2327556","commentId":2327556,"userName":"Slothgodfather","timestamp":1469540659,"content":"Yea, I'm glad it works this way,not from a power level, but from an understanding of the rules level.   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2327558","commentId":2327558,"userName":"Kakita Shiro","timestamp":1469540731,"content":"So sick, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2346241","commentId":2346241,"userName":"danpoage","timestamp":1470426066,"content":"This ruling was relevant for me just last night, in an epic second round that saw me bring 4 allies into play with Caldara. I figured I'd post this here as it is relevant to this discussion:\n\nhttps://hallofbeorn.wordpress.com/2016/08/05/the-might-of-caldara/ [https://hallofbeorn.wordpress.com/2016/08/05/the-might-of-caldara/]\n\nEdited August 5, 2016 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2363590","commentId":2363590,"userName":"DaeMord","timestamp":1471103326,"content":"This ruling has brought about some interesting thoughts.\n\nSo Me and my friend are currently playing The Wastes of Eriador, there is an encounter card that functions as a condition attachment with the text : \"treat each damage character's printed text box as if it were blank, except for keywords and traits.\"\n\nFine so far.\n\nSo Treebeard and Derndingle Warrior both have effects where you \"pay a cost\" of dealing damage in order to receive a buff, this ruling proves there is a internal game window if nothing else between paying costs and game state updating so here is the question\n\nDo they pay cost get buff or pay cost dont get buff because now text is blank, or can they pay cost not get buff because text is blank, get healed then get buff because now text is back again or do we forget we have effectively forgot paying the cost.\n\n \n\nThoughts gentlemen?\n\n \n\n(As an extended both characters have limits, is the limit also blanked and therefore ignored or not??)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2364045","commentId":2364045,"userName":"PocketWraith","timestamp":1471129482,"content":"> This ruling has brought about some interesting thoughts.\n> \n> So Me and my friend are currently playing The Wastes of Eriador, there is an encounter card that functions as a condition attachment with the text : \"treat each damage character's printed text box as if it were blank, except for keywords and traits.\"\n> \n> Fine so far.\n> \n> So Treebeard and Derndingle Warrior both have effects where you \"pay a cost\" of dealing damage in order to receive a buff, this ruling proves there is a internal game window if nothing else between paying costs and game state updating so here is the question\n> \n> Do they pay cost get buff or pay cost dont get buff because now text is blank, or can they pay cost not get buff because text is blank, get healed then get buff because now text is back again or do we forget we have effectively forgot paying the cost.\n> \n>  \n> \n> Thoughts gentlemen?\n> \n>  \n> \n> (As an extended both characters have limits, is the limit also blanked and therefore ignored or not??)\n\nI've asked about this before.\n\n \n\nThe question I asked was: \"My question is about triggering an ability where paying the cost would invalidate the ability. I realise that's very vague so an example: Cold from Angmar is attached to a quest card and I play Quickbeam. If I trigger his response, dealing a damage to ready him, his text box becomes blank because he's damaged. Do I get to finish resolving the response since I already started doing it, or does his blank text box cut in so as soon as I deal the damage the rest of the response is no longer there to be resolved. This would apply similarly to triggering a Derndingle Warrior, hero Treebeard or Erkenbrand with Cold from Angmar in play. A more extreme example could arise where the interfering factor is the game framework rather than even a passive on a card - if I deal damage to Beechbone for his ability, and that damage is enough to kill him, does he die instantly, or do I still get to finish the response and deal damage to the enemy? Or does he die, then I get to finish resolving the ability but it does nothing since he's dead and has no damage?\"\n\n \n\nAnd Caleb's response was: \"If a character's ability is part of the same sentence as the trigger, such as Quickbeam’s, then you should resolve the ability before treating that character’s text box as blank.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2365803","commentId":2365803,"userName":"DaeMord","timestamp":1471260499,"content":"See now am i the only one who sees these 2 rules as being at odds with each other, and not quite lining up, one would suggest you are constantly checking the game state for passive effects and triggering them the second you can, the other would suggest you follow out the entire line before then updating the game.\n\n \n\nI put forward another theoretical issue\n\n \n\nCursed Dead\n\nthis card reads\n\nWhen revealed : Put each copy of Cursed Dead in the discard pile into play in the staging area. \n\n \n\nThe rule book states (page 14)\n\nIf the encounter deck is ever empty during the quest phase, the encounter discard pile is shuffled and reset back into the encounter deck.\n\n \n\nSo using the imrahil ruling we could have a window where the rule book effect triggers between \"pulling the card off the top of the encounter deck\" and \"resolving the card\" in this window if the cursed dead is the last card pulled you would shuffle the encounter deck meaning no cursed deads are returned as there is an empty discard pile, if however we do the whole action as one thing as has been suggested in the past you would return the cursed dead from the discard pile.\n\n \n\nIn the past i have always played this returning cursed deads to the staging area, these rulings now make me question this interperatation, any thoughts to clarify this, or am i missing something that makes all of this consistent with each other?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225784-prince-imrahil-the-flame-of-the-west-ally-and-caldara/?do=findComment&comment=2365976","commentId":2365976,"userName":"cmabr002","timestamp":1471269234,"content":"> See now am i the only one who sees these 2 rules as being at odds with each other, and not quite lining up, one would suggest you are constantly checking the game state for passive effects and triggering them the second you can, the other would suggest you follow out the entire line before then updating the game.\n> \n>  \n> \n> I put forward another theoretical issue\n> \n>  \n> \n> Cursed Dead\n> \n> this card reads\n> \n> When revealed : Put each copy of Cursed Dead in the discard pile into play in the staging area. \n> \n>  \n> \n> The rule book states (page 14)\n> \n> If the encounter deck is ever empty during the quest phase, the encounter discard pile is shuffled and reset back into the encounter deck.\n> \n>  \n> \n> So using the imrahil ruling we could have a window where the rule book effect triggers between \"pulling the card off the top of the encounter deck\" and \"resolving the card\" in this window if the cursed dead is the last card pulled you would shuffle the encounter deck meaning no cursed deads are returned as there is an empty discard pile, if however we do the whole action as one thing as has been suggested in the past you would return the cursed dead from the discard pile.\n> \n>  \n> \n> In the past i have always played this returning cursed deads to the staging area, these rulings now make me question this interperatation, any thoughts to clarify this, or am i missing something that makes all of this consistent with each other?\n\n \n\nI do not disagree with you that the rulings may perhaps be at odds with each other.  There may still be a difference though since the developers never provided a justification for the Quickbeam ruling.\n\n \n\nRegarding your Cursed Dead example, the developers clarified that you resolve the staging of the encounter card before shuffling the encounter deck.  So you would return all copies of Cursed Dead, then you would shuffle any remaining cards in the discard pile back into the deck.\n\n \n\n>  \n> \n> Q: When I reveal the last card of the encounter deck, do I immediately reset the quest deck before resolving the staging of the revealed card?\n>  \n> A: No. Resolve the staging of the revealed card, including any ‘When Revealed’ effects, before resetting the quest deck, if able. If you are unable to completely\n> resolve the staging of the card because it instructs you to interact with the encounter deck in some manner, then reset the quest deck and finish resolving the effect."}]}