{"url":"https://community.fantasyflightgames.com/topic/225730-solo-play/","title":"Solo Play","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2324960","commentId":2324960,"userName":"Doom Hammer","timestamp":1469396191,"content":"HI,\n\n \n\nJust started playing with the core set and have had a number of solo games, I've not played two player yet. I started with the first introduction quest and found it easy so moved on to the second quest. Not had much luck with this one and after 4 games I have failed each time, on all occasions the staging area gets overrun with location cards, and I don't have enough willpower amongst characters to be able to beat the threat.\n\n \n\nI've had a mooch over the forum and seen a few posts from peeps having the very same issue. Most advice is that solo play is more challenging and some will play with two decks (imitating a two player game) and some advise to build decks around this problem. I don't think I can cope running two decks, or like the idea of a deck tailored to beat the location overspill, it might be over focused on adding cards with lots of willpower, or those that add progress but I was thinking along the lines that the problem exists because in a two player game you have 3 extra heroes that provide a big amount of willpower to the game and when a quest is attempted you are only adding 1 extra card to the staging area. which is like 6 heroes combined willpower of  9-12 points of willpower against 3-5 average threat. and in a solo game willpower of 4-6 verses average threat of 1-3 just from the drawn cards.\n\n \n\nI was thinking of ways to try and keep the deck building element for solo play in line with the two player games and thought for my next game I play, to give my questing a little more chance when playing solo, I would try adding a hero from a  sphere that I don't have any matching cards in my deck and not give it any resources during the resource phase. In that case the hero could quest,attack and defend but its sphere would have no input in the game, it would be like a neutral ally that you just happen to begin the game with and give attachments to.\n\n \n\nWhat do you reckon, would this be a fair house rule to try and correct the balance? or am I just completely missing something?\n\n \n\nI have very little experience with the game and this is all based upon my 5 games played so far, however if I don't do something positive I can see me losing interest in this game and moving on.\n\n \n\nLook forward to any constructive feedback\n\n \n\nThanks in advance"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2324969","commentId":2324969,"userName":"alexbobspoons","timestamp":1469397091,"content":"For housevrules, always do what you enjoyvwith the game, its yours, you bought it and its your time, so enjoy how you want to :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] house rule as much as you need.\n\nAs for the quest, yes thats a real tough one. The game is intended to create problems for you with the encounter deck that you then have to work your way out of by designing a deck that will beat it, so deck design is a big aspect. Those that dont like deck building get builds from others online :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nFor me, the best introduction on how to evaluate a quest and design a deck for it is beorns path :\n\nhttps://hallofbeorn.wordpress.com/beorns-path/ [https://hallofbeorn.wordpress.com/beorns-path/]\n\nAwesome read!! Lots to learn from it!!\n\nIts an amazing game dont lose hope!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2324974","commentId":2324974,"userName":"Edheliad","timestamp":1469397451,"content":"Solo play is generally very difficult without tailoring decks specifically for each quest.\n\n \n\nWhich is annoying and the main reason I sold off half the expansions I own. I don't really need them if they're only fun in multiplayer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2325655","commentId":2325655,"userName":"dalestephenson","timestamp":1469451685,"content":"Anduin is harder in solo than multiplayer, but still is very beatable with a general-purpose solo deck as long as you have a workable plan for taking down the hill troll.  The troll doesn't contribute much threat, so as long as you have a starting threat under 30, you can leave the troll in staging initially and just deal with what comes out of the deck.  Most later quests aren't tied so strongly to having a specific starting threat level.\n\n \n\nWith regards to your house rule, I would recommend instead trying the official \"easy mode\".  By starting with six resources instead of three, the extra cards you put into play will provide a bonus similar to the extra hero you propose, while still operating under the normal rules.  By removing the gold-rimmed cards from the encounter deck, you reduce the chances that the more brutal encounter cards will give you a no win situation.  You could also go in-between by adopting one of the benefits but not the other (I usually add resources for unofficial \"semi-easy\" mode.)\n\n \n\nI echo the recommendation to read Beorn's Path and try the suggested decks there.  That was my starting point, and after following it through the Mirkwood cycle, I continued to use and tweak those decks to go through all the quests available through Grey Havens, plus the saga quests through Land of Shadow, usually separately, and rarely having to resort to semi-easy or easy to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2327842","commentId":2327842,"userName":"Doom Hammer","timestamp":1469549742,"content":"Thanks for all the advice, I have started reading Beorn's Path and will try out some custom decks :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2335233","commentId":2335233,"userName":"Glaurung","timestamp":1469944781,"content":"The game is brutal for begin but after a, while you will learn how to win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2337075","commentId":2337075,"userName":"Lecitadin","timestamp":1470071742,"content":"> The game is brutal for begin but after a, while you will learn how to win.\n\nYep, and Glaurung has a lot of great videos on Youtube that you can watch!  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2342299","commentId":2342299,"userName":"Gorkil","timestamp":1470318614,"content":"You just have to build your deck better mate, there is no way around it. I personally enjoy the deck building and strategising the same as actualy playing the game. Try and experiment, there are some builds that work better (duh), but you just have to know the quest, the encounter cards and build your deck accordingly. Or recruit a player two :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  \n\n \n\nCheers and good luck in your adventures!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/225730-solo-play/?do=findComment&comment=2342523","commentId":2342523,"userName":"evilidler","timestamp":1470322783,"content":"Not building your decks to suit a challenge is like never taking a break to visit town or an inn. Adventurers have to resupply at times, and you are allowed to do the same. You're not breaking the rules by deckbuilding in a game that involves a meta-game of deckbuilding."}]}