{"url":"https://community.fantasyflightgames.com/topic/226384-pressing-needs-outside-quest-phase/","title":"Pressing Needs outside quest phase?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/226384-pressing-needs-outside-quest-phase/?do=findComment&comment=2337346","commentId":2337346,"userName":"midwestborn86","timestamp":1470080169,"content":"Pressing Needs reads \n\n \n\nDoomed 2.\n\nWhen Revealed: Either search the encounter deck and discard pile for an encounter side quest and reveal it, or choose a different quest card in play to be the current quest until the end of the phase. Shuffle the encounter deck. \n\n \n\nIf there are 2 quests in play and this is revealed outside the quest phase can you pick a different quest to be the current quest until the end of the phase even though technically there is no current quest? Or would you be forced into the search option because if an \"either or\" effect happens you still must pick one that is possible to do.\n\n \n\nIn other words is the main quest considered the current quest in all phases of the game? If it is then you would be able to pick another quest if say this popped in the combat phase.\n\n \n\nThis is important as one might want to let this card wiff if able and take the doomed 2 and save that precious cancel for a worse treachery.\n\nEdited August 1, 2016 by midwestborn86"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226384-pressing-needs-outside-quest-phase/?do=findComment&comment=2338280","commentId":2338280,"userName":"alogos","timestamp":1470129644,"content":"If it use \"Either\" then you must choose one that is possible (remember that all can be none in this general case).\n\n \n\nI don't remember if there is a ruling about side quest being able to be the current quest outside of the quest phase, that's something new I think. The only ruling I found is this : https://community.fantasyflightgames.com/index.php?/topic/164372-side-quests-vs-legolas-gondolin-blade-in-combat-phase/?p=1587208 [https://community.fantasyflightgames.com/index.php?/topic/164372-side-quests-vs-legolas-gondolin-blade-in-combat-phase/?p=1587208]where \"they remain the main quest until the end of the quest phase\" which seems to either be a re wording of \"until the end of the quest\" or a ruling \"cannot be the main quest outside of the quest phase\"...\n\n \n\nSomeone should ask just to be sure..."}]}