{"url":"https://community.fantasyflightgames.com/topic/226544-removing-burdens-probably-a-dumb-question/","title":"Removing burdens: probably a dumb question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/226544-removing-burdens-probably-a-dumb-question/?do=findComment&comment=2340446","commentId":2340446,"userName":"monkeyrama","timestamp":1470226113,"content":"I have a question that I've only just realised I needed to ask about burdens in the saga campaigns.\n\n \n\nIn the Treason of Saruman quests, you are instructed to remove from the encounter deck certain burdens. This instruction is then repeated (but with different encounter deck symbols) in the Land of Shadows quests.\n\n \n\nNow, for Boons, the instruction was to remove them from the campaign pool, but the Burdens are only removed 'from the encounter deck'. Does this mean that the Burdens that we can ignore in the Treason of Saruman quests return to the encounter deck in the Land of Shadows quests?\n\n \n\nIf so, how did I miss that?? That means that I had two more Burdens to contend with in the Land of Shadows (not particularly nasty ones, mind you, and I doubt they'd have made a difference...). Argh!! Please tell me I'm just being stupid, and you slowly lose Burdens.\n\n \n\nIt would make sense that some Burdens follow Frodo, and others follow Aragorn, but I honestly didn't see it that way. Doh! And I got no Burdens during Treason of Saruman, so I'm only gaining them. Sigh. So many years playing, and still learning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226544-removing-burdens-probably-a-dumb-question/?do=findComment&comment=2340448","commentId":2340448,"userName":"cmabr002","timestamp":1470226222,"content":"You only remove the burdens from the campaign pool if you are instructed to do that.  Removing them from the encounter deck will only remove them from that particular scenario.  I made the same mistake initially.\n\nEdited August 3, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226544-removing-burdens-probably-a-dumb-question/?do=findComment&comment=2340502","commentId":2340502,"userName":"monkeyrama","timestamp":1470227909,"content":"Doh. That's what I thought, or at least do now. Well, it only affects one scenario so far. Thank you for clarifying that."}]}