{"url":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/","title":"Best quests to introduce new players","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2344910","commentId":2344910,"userName":"Fantasty","timestamp":1470413588,"content":"So I have a friend with whom I regularly play this game and between the two of us we have every expansion released for this game. Tomorrow we're having another friend over who's also interested in playing, but we're unsure which quests would be the best way to introduce him to the game.\n\nWe don't really like the core set as a starting point, so any suggestions would be more than welcome :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] In general, I think quests that are highly thematic and show off all the different aspects of the game would make good candidates, so on my personal shortlist would be:\n\n- Murder at the Prancing Pony (maybe a bit too difficult though)\n\n- Journey Along the Anduin\n\n- Massing at Osgiliath\n\n- Watcher in the Water\n\n- Into the Pit\n\n- Into Ithien\n\n- Foundations of Stone\n\nEdited August 5, 2016 by Fantasty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2344935","commentId":2344935,"userName":"John Constantine","timestamp":1470414186,"content":"Passage through Mirkwood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2344951","commentId":2344951,"userName":"flightmaster101","timestamp":1470414612,"content":"Well Mirkwood is obviously the most straight forward quest released so far, but it sounds like the core set is out.\n\nI would say Encounter at Amon Din is a fun quest where you're competing with the encounter deck for objectives with a great thematic integration. \n\nThe Stewards fear is really a good test for a deck and has a great random boss fight element to it.\n\nI really do like to show people Mirkwood first though, just because there are no quest specific mechanics to confuse new players that really arent sure how this game is played and how they should play their deck against the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2345799","commentId":2345799,"userName":"DukeWellington","timestamp":1470422324,"content":"Seventh Level: simple, fast, easy, fun\n\nAmon Din\n\nTrouble in Tharbad\n\nEscape from Mt. Gram"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2345867","commentId":2345867,"userName":"Kjeld","timestamp":1470422868,"content":"Conflict at the Carrock for a classic boss fight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2346184","commentId":2346184,"userName":"CaffeineAddict","timestamp":1470425615,"content":"How about Battle of Five Armies? Has the various quest mechanics that will crop up elsewhere, and not really any quest-specific mechanics, while being thematic and fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226758-best-quests-to-introduce-new-players/?do=findComment&comment=2346936","commentId":2346936,"userName":"danpoage","timestamp":1470434085,"content":"Journey Along the Anduin is a great introduction to the game - just don't hand them a deck with high starting threat and be surprised when they hate it.\n\n \n\nBattle of Five Armies is one of my favorite quests, but it might be a bit much (especially with all of the passive quest effects based on quest progress) for a new player to wrap their mind around.\n\n \n\nI also really like Trouble in Tharbad, but it is so different than traditional quests that it might be a bit odd as an introduction.\n\nSpeaking of truly unique quests, I absolutely love Temple of the Deceived from the latest cycle. It too might be an awkward introduction to the game, but it has the most important ingredient for me: fun. Also, the location layout makes it more like a board game so that could make it a great introduction for players who are less familiar with card games and come from a more casual (Catan, etc.) board game background.\n\nI will stress that whatever you pick, make sure it is a quest which you actually enjoy playing. At its best, this game is a blast to play, so it makes sense to present one of its best sides so that new players leave with a positive first impression."}]}