{"url":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/","title":"Quick Strike Beorn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2347074","commentId":2347074,"userName":"Pinsther","timestamp":1470436027,"content":"After seeing the new preview for Battle-Fury, I immediately started thinking of good combos with it. Dunhere came to mind first, especially since he could use his own resources to add himself to the quest if we so wished. Then I got to thinking about my favourite hero - good old Beorn. I knew that Beorn was able to combo with Quick Strike, and since Battle-Fury is essentially Quest Phase Quick Strike, I thought it might be good to use for him, as well.\nThen I realized... I couldn't find any topics that explicitly stated that Beorn COULD be used with Quick Strike. I could have sworn I had read it was legal somewhere, but can't find a definitive answer.\nSo, my questions are:\n1) Can Beorn legally be exhausted with Quick Strike, since it is not explicitly targeting him? Has there ever been an official ruling on this?\n2) If the answer to 1) is yes, then can we also trigger the extra Spirit resource ability on Battle-Fury for Beorn to add him to the quest? (I am thinking of Battle questing shenanigans.)\n\nThank you in advance for your answers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2347592","commentId":2347592,"userName":"rmunn","timestamp":1470447076,"content":"Where is this \"new preview for Battle-Fury\" you mentioned? I haven't seen it yet.\n\n \n\n1) Pretty sure that \"Immune to player card effects\" also means you can't use him to pay a cost of another card's effect, like \"Exhaust a character you control to ...\".\n\n \n\n2) Since I haven't seen Battle-Fury, I can't say for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2347846","commentId":2347846,"userName":"GrandSpleen","timestamp":1470455866,"content":"The Battle-Fury spoiler is here [https://community.fantasyflightgames.com/topic/226666-temple-of-the-deceived-and-drowned-ruins-available-at-gen-con/page-1].  It won't work with Beorn, for the same reason that Beorn doesn't work with Quick Strike: From the FAQ:\n\n \n\n\"Additionally, cards that are immune to player card\n\neffects cannot be chosen as targets of player card\neffects. This means that any player card that uses a\nform of the words “target” or “choose” cannot choose\na card that is immune to player card effects as its\ntarget. This includes the “attach to...” text of any player\nattachment. Player cards that do not use the word\n“target” or “choose” but force the player to choose a\nspecific card cannot choose a card that is immune to\nplayer card effects.\"\n \nQuick-Strike.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Core-Set/Quick-Strike.png]\n \nBut Ambush works just fine (no character is chosen as a part of the card's effect):\nAmbush.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Land-of-Shadow/Ambush.jpg]\nEdited August 6, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2353012","commentId":2353012,"userName":"danpoage","timestamp":1470674744,"content":"Just to clarify, hero Beorn can be used to pay the cost of effects like Hail of Stones [http://hallofbeorn.com/Cards/Details/Hail-of-Stones-RtR]. The card is not targeting him or otherwise affecting him directly and his immunity does not prevent him from being used to pay the cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2378637","commentId":2378637,"userName":"Benoit Poulin","timestamp":1471877731,"content":"But can you use Hero Beorn to exhaust as part, say, of a necessary travel cost? Some location cards have conditions like \"Exhaust a hero to travel to X\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/226846-quick-strike-beorn/?do=findComment&comment=2378658","commentId":2378658,"userName":"cmabr002","timestamp":1471878304,"content":"> But can you use Hero Beorn to exhaust as part, say, of a necessary travel cost? Some location cards have conditions like \"Exhaust a hero to travel to X\"\n\n \n\nCertainly.  Beorn is immune to player card effects, not all card effects."}]}