{"url":"https://community.fantasyflightgames.com/topic/227211-siege-of-annuminas-gen-con-post-analysis/","title":"Siege of Annuminas Gen Con Post-Analysis","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/227211-siege-of-annuminas-gen-con-post-analysis/?do=findComment&comment=2355019","commentId":2355019,"userName":"1mperia1Aces","timestamp":1470752892,"content":"So now that those who attended Gen Con have gotten to play Siege (probably several times), what does everybody think? Was it what we expected? What things helped you succeed? Did you like it more or less than other Gen Con quests?\n\nMy group of twelve got to play it twice on Sunday. I definitely enjoyed it more than I thought I would, and I've even enjoyed playing it solo. I especially like how the first stage of the quest is time counter based rather than quest point based. It really lends to the feel that the siege is upon you, and you can't delay it by questing slowly. In fact, you want to quest hard so that you can help ready the city's defences for the assault. We found that questing is definitely important and that it is pretty easy to get location locked if you're not careful (those locations generally have high threat). There can be alot of combat, but we actually seem to have managed that part pretty well. I really enjoyed the quest. I might still like the Ruins of Belegost more, but that one is nearly impossible solo, whereas this one can actually scale to 1-12 players like it claimed. Great job Caleb!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227211-siege-of-annuminas-gen-con-post-analysis/?do=findComment&comment=2356413","commentId":2356413,"userName":"awp832","timestamp":1470786329,"content":"I thought it was allright,  I am going to try it again sometime this week probably and just do a standard 2 player game and see how that is.  I like the idea of a 12 player quest but to me it just didn't really work out.\n\nSo for anyone who doesnt know; you're split into 3 groups of 4 players each and each group has a different aspect of the quest they focus on.  So one problem is that you have to stay on the same turn as each other group because during the quest it really matters.  So inevitably a lot of your time is spent waiting for other groups to catch up to you, and there just isn't much you can do in the downtime other than go get a snack.  \n\nThe bigger problem I had with the quest was that it was hard to help others.  This is a co-op game so for 12 players you want it to be REALLY co-op.  And sometimes when you resolve your stage of the quest successfully than the other tables can get a minor boon, but it's rare.   There needed to be a LOT more of this going on.   There needed to be a lot more ways to help other tables out.   Because even if your table is doing really well,  if another table gets in trouble you just sort of look helplessly on at them while they lose the scenario for you.  "}]}