{"url":"https://community.fantasyflightgames.com/topic/227416-where-to-next/","title":"Where to next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360034","commentId":2360034,"userName":"Supertoe","timestamp":1470942452,"content":"After the Harad cycle, where should we go next?\n\n \n\n \n\nI'm personally hoping Erebor/Dale, but the Iron Hills would be fun, and we never really got a proper Mirkwood cycle. The Shire could be cool, or maybe those empty lands along the Greenway between Bree and Isengard?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360068","commentId":2360068,"userName":"Network57","timestamp":1470943132,"content":"I'm thinking Dale/Esgaroth/Rhun first, and then north to the Iron Hills and over to Forochel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360075","commentId":2360075,"userName":"dalestephenson","timestamp":1470943266,"content":"Here's some places I'd like to visit\n\n \n\n1) Gray Mountains/Withered Heath\n\n2) Rhun\n\n3) Iron Hills\n\n4) Erebor/Esgaroth/Dale\n\n5) Khand\n\n6) White Mountains\n\n7) Forlochel\n\n \n\nI also don't think the existing cycles have exhausted all the possibilities in Mirkwood, the Misty Mountains, Gondor, Ithilien, or Eriador."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360101","commentId":2360101,"userName":"Edheliad","timestamp":1470943863,"content":"> Here's some places I'd like to visit\n> \n>  \n> \n> 1) Gray Mountains/Withered Heath\n> \n> 2) Rhun\n> \n> 3) Iron Hills\n> \n> 4) Erebor/Esgaroth/Dale\n> \n> 5) Khand\n> \n> 6) White Mountains\n> \n> 7) Forlochel\n> \n>  \n> \n> I also don't think the existing cycles have exhausted all the possibilities in Mirkwood, the Misty Mountains, Gondor, Ithilien, or Eriador.\n\n \n\n4 is the only option I would find interesting enough to invest in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360137","commentId":2360137,"userName":"Kjeld","timestamp":1470944674,"content":">  \n> \n> > Here's some places I'd like to visit\n> > \n> >  \n> > \n> > 1) Gray Mountains/Withered Heath\n> > \n> > 2) Rhun\n> > \n> > 3) Iron Hills\n> > \n> > 4) Erebor/Esgaroth/Dale\n> > \n> > 5) Khand\n> > \n> > 6) White Mountains\n> > \n> > 7) Forlochel\n> > \n> >  \n> > \n> > I also don't think the existing cycles have exhausted all the possibilities in Mirkwood, the Misty Mountains, Gondor, Ithilien, or Eriador.\n> \n>  \n> \n> 4 is the only option I would find interesting enough to invest in.\n> \n>  \n\n \n\nThere's no particular reason that they couldn't do 1, 3 and 4 all together. Many of the cycles have the heroes moving around quite a bit from the deluxe through the 6th expansion pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2360187","commentId":2360187,"userName":"Mndela","timestamp":1470945940,"content":"I think a new cycle focused on eagles could be able. The location would be high anonymous mointains, unknown climbs... and the idea is to help something of eagles, like rhosgobel, when heroes had to bring wilyador alive.\n\nAnother new cycle could be around the shire. The defense of the Shire. Orcs didnt arrive to it, but it was thanks to our heroes, they could avoid some attacks and ambushes.\n\nAnother new cycle could be about some places together, even one cycle about all the middle earth. The idea could be to explore the presence of orcs, if it is true that orcs are around all the earth. 1 scenario could be mirkwood, 2nd rohan, 3rd gondor, 4th rivendel, 5th erebor, 6th....etc"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2362089","commentId":2362089,"userName":"Calvadur","timestamp":1471023336,"content":"After Harad I only really miss the north east (Erebor/Dale + Rhun, maybe with a little mirkwood) and Forochel.\n\nAs I think of it, did we have a quest that is set in Rohan outside of Sagas (Rohan, not Dunland)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2362178","commentId":2362178,"userName":"CaffeineAddict","timestamp":1471025826,"content":"What about a cycle where were doing reconnaissance into mordor?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2362575","commentId":2362575,"userName":"Trialus","timestamp":1471035669,"content":"> What about a cycle where were doing reconnaissance into mordor?\n\n \n\n \n\nThat could be pretty cool...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2362582","commentId":2362582,"userName":"Network57","timestamp":1471035793,"content":"> After Harad I only really miss the north east (Erebor/Dale + Rhun, maybe with a little mirkwood) and Forochel.\n> \n> As I think of it, did we have a quest that is set in Rohan outside of Sagas (Rohan, not Dunland)?\n\nA little bit Hunt for Gollum. But I'd be game to go back. The White Mountains, Dunharrow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2381735","commentId":2381735,"userName":"Benoit Poulin","timestamp":1472005158,"content":">  \n> \n> Another new cycle could be around the shire. The defense of the Shire. Orcs didnt arrive to it, but it was thanks to our heroes, they could avoid some attacks and ambushes.\n> \n>  \n\n \n\nWhy not some new cycle after the destruction of the One Ring? A cleansing of the shire, washing of mordor, etc... of course, some characters would no longer make sens (Boromir), then again..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2382001","commentId":2382001,"userName":"PsychoRocka","timestamp":1472023622,"content":"Iron Hills and the Withered Heath! Would be great to have a dwarf oriented cycle (thematically not the player cards!) where we are helping out one of the four clans that went east (Ironfists! We already have Brok Ironfist so this would be the best one for FFG to explore), maybe even helping them with a Drake or Dragon problem? \n\nWe haven't seem much of Rohan at all outside of Saga boxes but I honestly struggle to think of any quests or enemies we would encounter there prior to Saruman massing forces and setting loose Uruk and Dunlendings througout Rohan. \n\nAs much as it would be cool to visit Forochel I similarly cannot think of very much we would do or fight there as well... \n\nLike others I agree we haven't seen enough/much of Mirkwood Forest, Dale and Erebor and they could do a really cool cycle there. Mirkwood itself has only recently undergone all of its changes (from the necromancer staying in Dol Guldur and tainting the forest) so we could easily be performing tasks for Thranduil to make his kingdom and lands safer and less infested with spiders and agents of Sauron. We haven't seen spiders in a long time with the exception of Shelob so a return to them in a quest or two would be really neat especially if they are given a new mechanic and great art pieces. This would also be a perfect cycle for Thranduil to finally appear as a hero in. They could also expand upon the Dale trait if they wanted to. \n\nWe know that a large host of Haradrim assaulted Dale and Erebor during The War of the Ring. We could have an earlier force appear in a cycle set there similar to how we had a resurgence in Angmar during the Angmar Awakened cycle. They could be trying to take out Erebor and Dale preemptively to secure another fortified position for the Dark Lord during the battles to come. \nA return to Dol Guldur if they were able to come up with a good enough reason as to why we would explore there would also be pretty neat. Have always loved the overall imagery and concept of evil ruins in the middle of a forest.\n\nWe are getting Harad already so why not Rhun as well at some point. The inland Sea of Rhun could be a focal point and considering how huge it is we could even have a sailing quest on it if the designers wanted to go this way. There could even be some huge nasty sea monster (a serpent would be nice as we have already gotten a few kraken or octopus like creatures; The Watcher, Ancient Marsh Dweller and The Thing in the Depths) and we could visit the island in the middle of the Sea of Rhun!\n\nWe could also see Kine and other wildlife that doesn't exist in other parts of Middle Earth which would be really neat. \n\n \n\nFinally I think Mordor would make a really great setting for a cycle as well but the thematic reason would need to be a very fitting and appropriate one. Others have suggested reconnaissance which honestly is the only thing I can think of as well.\n\nI mean part of the very concept of Mordor however is a whole \"none return\" vibe. The air itself contains poisonous gasses, there is little to no vegetation which is also probably poisonous and the place is just generally awful and extremely detrimental to your health and wellbeing. Even reconnaissance doesn't really entirely add up because it would be considered a foolish suicide mission no one would ever return from. Oh and the entire place is of course swarming with Orcs, fell beasts and various other creatures as well. Maybe if we had a really good reason for being stuck there and needing to escape Mordor it would make sense? Any cycle or quests set here would need to be fairly difficult as well... having a pushover difficulty quest in Mordor would make zero thematic sense.. \n\nOn the flipside we could see some really cool stuff in Mordor, the lands of Mordor itself are actually not very fleshed out at all so they could get really creative and give us some really cool enemies and areas. Sauron could have a few vampires or werewolves left floating around in Mordor so we could see either of these. Would be great to have more Black Numenorian enemies and I would love to finally see some armoured trolls or Olog-hai as well (STOP GIVING US ENDLESS FERAL/WILD ONES FFG SAURON USED TROLLS IN ALL OF HIS HOSTS).\n\n\nOf these suggestions I think I'd want to go to Mirkwood, Dale, Erebor etc most as this area really doesn't feel fleshed out enough in previous cycles and I think we could get some really great quests AND player cards in a cycle set here. \n\nThat being said I do hope we get a cycle in Mordor eventually but it needs to be a thematic home run, perhaps we SOMEHOW end up there and have to escape rather than journeying into Mordor. Wanting to escape makes more sense... \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2384337","commentId":2384337,"userName":"Benoit Poulin","timestamp":1472137993,"content":"> Finally I think Mordor would make a really great setting for a cycle as well but the thematic reason would need to be a very fitting and appropriate one. Others have suggested reconnaissance which honestly is the only thing I can think of as well.\n> \n> I mean part of the very concept of Mordor however is a whole \"none return\" vibe. \n\n \n\nand it could be just that : a terrible, doomy, bleak ending of cycle, which everyone dies in mordor, trying to figure out what's going on... Sharing the fate of, say, the Bothans (\n\n\n)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2386894","commentId":2386894,"userName":"Lecitadin","timestamp":1472245704,"content":"I want a cycle in Hobbiton."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2387063","commentId":2387063,"userName":"kvltmaster","timestamp":1472254782,"content":"It'd be hard to do without a full story/game reset, but a First or Second age setting would be kind of killer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2389956","commentId":2389956,"userName":"Benoit Poulin","timestamp":1472485744,"content":"> It'd be hard to do without a full story/game reset, but a First or Second age setting would be kind of killer.\n\n \n\nThis is fan-made, but I've heard this is great : https://talesfromthecards.wordpress.com/first-age/ [https://talesfromthecards.wordpress.com/first-age/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2391011","commentId":2391011,"userName":"dr00","timestamp":1472518522,"content":"> As much as it would be cool to visit Forochel I similarly cannot think of very much we would do or fight there as well...\n\nthere's so much though!\n\nThe Grey Havens was a launching point for lots of lore-based exploration of Numenor from the second age.\n\nthe Forodwaith, and Forochel included in that, has a lot of stuff that can be explored in a similar way:\n\nthere's a lot of speculation about the actual location of the ruins of Utumno [http://lotr.wikia.com/wiki/Utumno]. regardless of where it actually was in Tokien's mind or where the designers speculate, Forodwaith is a very large area and a likely location for it, even if it isn't Forochel specifically.\n\nsimilar to the exploration of ancient Numenorian relics, the quests wouldn't have to explicitly find Utumno itself, but rather some kind of relic from it, fighting ancient enemies, etc.\n\nthe Palantiri of Annuminas and Amon Sul were lost in the Ice-Bay of Forochel when King Arvedui attempted to flee the forces of Angmar after they had sacked Fornost. he also had help from Cirdan, who sent a ship. this could bring back possible sailing quests, as the heroes attempt to find evidence of the Palantiri, and maybe pique the interest of forces of Angmar who want to find it as well\n\nthe Lossoth themselves. they were reluctant after first, but eventually helped Arvedui to escape and warned against his leaving with the Palantiri into the Ice-Bay. but in this time, they could be allies or enemies (or both). or even like the Wose from The Druadan Forest, who are aggressive at first but later realise that you pose no threat to them.\n\nArvedui left the king of the Lossoth the Ring of Barahir as a gift for their help. it was later bought by some rangers of the north who gave it to Elrond (and then Aragorn), so i think it likely that they would be reluctant allies, but allies nontheless, but that's another aspect that could be explored.\n\nthey also had primitive ice skates made of bone, sleds, and travelled quickly along the ice. the Lossoth aren't as fleshed out as some other peoples of Middle-Earth, but there's still a bit there to explore in a game like there was a few liberties can be made (and not everything has to be explicitly spelled out)\n\nthere's also part of the range of the Iron Mountains, most of which was lost in the sinking of Beleriand, but part of it remains and runs into Forochel. there could be some exploration of ancient Dwarven relics and kingdoms and such"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227416-where-to-next/?do=findComment&comment=2392889","commentId":2392889,"userName":"ljusetsriddare","timestamp":1472630768,"content":"I´d say Mirkwood and/or Lorien, perhaps joined in a kind of \"Battle of the Forests\" delux expansion\n\n \n\nHere's my why:\n\n \n\n- The theme of the story arc could be The Battles of Lorien: http://lotr.wikia.com/wiki/Battles_of_L%C3%B3rien_and_invasion_of_eastern_Rohan [http://lotr.wikia.com/wiki/Battles_of_L%C3%B3rien_and_invasion_of_eastern_Rohan]and/or the Battle of Mirkwood: http://lotr.wikia.com/wiki/Battle_of_Mirkwood [http://lotr.wikia.com/wiki/Battle_of_Mirkwood]. The story could follow the progress of Celeborn/Galadriel and Thranduil in their defensive battles and then end in a grand finale with the Battle of Dol Goldur. Perhaps even using Vampires and/or Werewolves as enemies to fight?\n\n- Thranduil and Radagast Heroes, we want them and we need them! And please let Thranduil be a Tactics hero - right now we only have 1½  elf tactics heroes (the ½ is Elladan who you don't wanna use without Elrohir who is Leadership, so right now we only have 1 complete Tactics elf, and thematically it fits well with Thranduil fighting next to his son as a Tactic hero). And Radagast - he should of course be a Neutral Hero just like Gandalf.  \n\n- Perhaps introducing creatures of the forest as allies (foxes, bears, rabbits etc) built to work well in unison with Radagast both as Hero and Ally.\n\n- Continuing the until now quite rarely used Dale and Woodman trait.\n\n- Continuing the Eagle trait (so you can build a whole pure deck around it - right now its almost possible but takes a lot of different expansions).\n\n- Continuing the very rarely used Beorning trait.\n\nEdited August 31, 2016 by ljusetsriddare"}]}