{"url":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/","title":"Halbarad and Sam","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/?do=findComment&comment=2365053","commentId":2365053,"userName":"DukeWellington","timestamp":1471208816,"content":"I'm surprised nobody has asked this yet, but this seems like an obvious area in need of official clarification.\n\nIf you control the Halbarad ally does his ability affect Sam's ability to ready?\n\nBased on the ruling with Caldara and ally Imrahil I have to say that I think it does. First, you engage the enemy, then you activate Sam's response. When checking the game state to verify whether or not Sam readies, the enemy is engaged and thus has 10 higher engagement cost. So, if that extra 10 pushes it above your threat level Sam readies. Am I right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/?do=findComment&comment=2365087","commentId":2365087,"userName":"monkeyrama","timestamp":1471210737,"content":"I'm sure that others can rule on this more precisely, but Sam is a response, whereas Halbarad is a passive effect. So the second the enemy engages it is up 10 engagement cost, and Sam's response must trigger after you engage an enemy. It seems to me that Sam must get to activate his response with Halbarad's engagement cost increase counted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/?do=findComment&comment=2365577","commentId":2365577,"userName":"Finduin","timestamp":1471236062,"content":"Halbarad is a great addition to the \"Surprise\" deck with the Hobbits, and all their abilities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/?do=findComment&comment=2368740","commentId":2368740,"userName":"Teamjimby","timestamp":1471370386,"content":"FYI, I checked with Caleb because I wasn't 100% sure that this worked.  But, he confirmed that Halbarad ally legally combos with Sam/Pippin because passive effects occur instantly and you check responses after the trigger occurs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227654-halbarad-and-sam/?do=findComment&comment=2368743","commentId":2368743,"userName":"DukeWellington","timestamp":1471370477,"content":"I was confident it worked that way but it's comforting to have official word. Thanks"}]}