{"url":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/","title":"Thoughts on tactics Eowyn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2369905","commentId":2369905,"userName":"DukeWellington","timestamp":1471412022,"content":"I don't get a lot of interaction from my decklists, but you all seem to respond to my more \"game philosophy\" type posts. I enjoy writing out my musings, so I hope you all do as well.\n\nI knew that tactics Eowyn was going to be a radically different hero as soon as I saw her first spoiler. Now, I haven't played with her a ton, but my suspicions have already been confirmed. Her release will be a signpost of a significant shift in LOTR, and I don't think we fully grasp it yet.\n\nSome people will complain that Eowyn is the posterchild of color bleed. Do the colors even mean anything anymore? So, before I talk about Eowyn specifically I want to address the subject of color identity. It all started with Magic the Gathering. The idea of the color wheel in Magic was that the game needed some kind of boundary or obstacle that prevented players from just putting 4 copies of the best 15 cards into their deck. By introducing colored mana players were forced to either put less powerful cards in their deck (to keep consistent color cost) or fill precious deckspace with color fixing cards that might not come out when needed, making the deck more potentially powerful, but less consistent. Not only was the color wheel a brilliant design feature, but it added limitations to players in a fun way, so that those players never felt cheated. To this day the color wheel remains one of the most influential aspects of design introduced by Magic the Gathering.\n\nHowever, color is not the only type of boundary to limit player deck design. There are also tribal requirements. For instance, the new card Golden Shield is limited by being red, but far more so by only going on Rohan heroes (and not characters). Right away I can say that over the history of this game, the tribal limitations have been far more important and interesting than the colors in LOTR. This is true, in my opinion, because the focus on tribes connects the game mechanics to the source material in a more flavorful and satisfying way. In fact, the colors work best when they serve the tribal identities, not the other way around. There is something interesting about the fact that eagles are only red. Gondor feels right at home in purple (primarily) and ents are obviously green.\n\nThe problem with the color wheel, in both Magic and LOTR, is that the designers had to designate various game elements as strengths and weaknesses without really knowing which of those elements would end up mattering more. Not all advantages are created equal. So if red gets all the ranged characters while green gets all the healing, how will the game balance out? Each color should feel like a four legged chair with one leg missing. You can make it work if you lean in the right direction, but if you try to do too much you may come crashing down. In early Magic, the blue part of the color wheel got too many of the most important game elements as strengths while green was basically unplayable because all their advantages turned out to be meaningless garbage. In a case of history repeating irself, blue also started out as OP in LOTR, while it was red that ended up as nearly unplayable crap. Red was a four legged chair with 2 legs missing while blue seemed to have 5 legs.\n\nOne example of why this happened is attack power. The game desingers realized the obvious fact that attack power was so essential to game success that they had to give it out to all colors. This made red less important because even though it was supposed to be the color of combat, it was not significantly better at attack. In contrast willpower was not recognized as essential, even though it was just as important, if not more important, than attack power. As a result, blue became a power house by being the best at questing while still being able to attack almost equally as well as red. Red, which had almost no willpower, became unplayable garbage.\n\nThe solution to the problem of the color wheel is to recognize the difference between core essential game elements, those required for success, and marginal elements, which can be important or powerful, but can also be left out without garenteed defeat. Willpower is essential. Healing is marginal. I could go on, but that is a debate for another post. Then, even if you put a game element in all colors you can still force each color to access it by a different path, so red, for instance, has to gain resources by engaging enemies as with Mablung.\n\nThe bottom line is that red needed a hero like Eowyn, and frankly, it took too long. The game is still better with clear distinction between colors, but every color needs to be viable by having strength in all essential elements of the game.\n\nNow, despite having 4 willpower in red, with a starting threat of 6 (effectively) Eowyn is still not very good. There, I said it. She kinda sucks. Now, it's not really her fault. It's because red still has little going for it outside of strong heroes like Boromir, Hama, Legolas, and Beregond. As a result, there isn't any motivation to choose Eowyn over other heroes, including better red heroes and including her own blue alternative self. Why go red anyway? What does it offer? It has feint, but without Hama that's just okay. It has Foe-hammer, but green has about 20 better card draw options. What does going mono red open up? You get trained for war, which has sick anti synergy with Eowyn. You get thicket of spears, which makes multiplayer seriously boring in the right combo deck but otherwise is too expensive. You get that knight that can attack alone against an enemy in staging, which is so useless it actually makes me laugh out loud thinking about putting it in my deck. Seriously, what does red Eowyn offer that blue Eowyn does not? She has 3 lower startng threat, but red has no secrecy cards. The last color anybody cares about in secrecy is red. Nevertheless, I do think her secrecy angle is already showing potential when she is paired up with hobbits. I'm not completely sold on it yet, but the future looks intriguing.\n\nIn the current meta, the only substantial reward I have found for playing specifically red Eowyn is playing her with Theoden. Red Theoden pushes her to 5 willpower, which is quite impressive, and blue Santa Theoden allows you to use red Eowyn to splash red in a rohan tribal deck so you can get 1 cost outriders without going Eomer. That is genuinely fun and cool, but more of a novelty instead of something with time tested reliability.\n\nThe conclusion is that tactics Eowyn does not fit into any existing type of deck. New deck styles will need to be invented before she is actually good. This may reqire more cards or rethinking current deck design approaches. Time will tell if this new Eowyn is an interesting novelty or a foundational staple of certain archtypes. Personally I hope and believe it will be the second, but we have a long way to go. Until then, have fun exploring Middle Earth with our new secret shield maiden.\n\nEdited August 17, 2016 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370021","commentId":2370021,"userName":"987654321","timestamp":1471424250,"content":"I agree with your thoughts. There is a similar problem in AGoT LCG, where each faction becomes really specific."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370051","commentId":2370051,"userName":"Mndela","timestamp":1471425971,"content":"Reading this article i have thought some ideas that i want to post:\n\n1. I liked more the rol of each sphere when game was started, during first cycles. Now, mmmh, not so much. The idea is that at beginning, spherer's rols were well diferencied designed. Tactics was focused on combat, spirit on willpower. And you can't play tactics alone, because you can't advance in quest, and you can't play spirit alone because you dont had anything to kill really efficient. Spheres had a strong face, but another weak face. Spheres need mutually of each other.\n\nNow this difference is not true. You can play monotactics without problem, and monospirit without problem.\n\nThere are spirit cards with a lot of attack, and focused in combat: Idraen, Lanwyin, etc.\n\nThere are tactics cards with a lot of myscelanious effects diferent than attack ways: Secret Vigil (decreasing threat! pure rol of spirit), Eowyn Tactics (4wp), cancelation damage (is a subtype of healing), Legolas ally drawing cards, etc.\n\n2. About traits. I think Gold Shield is a very good card, it can't be at this moment for everybody, or beregond will become an authentic panzer. Armor attachments must be restringed to traits since now, and since 1 year ago, too.\n\nProblem of traits to me is that the game has to take care about not to design all cards focused in traits. Id like 50%-50%, the half of cards yes, increasing the power of some trait, but the  other half, designed to be playable for every character in the game.\n\nEdited August 17, 2016 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370350","commentId":2370350,"userName":"DukeWellington","timestamp":1471441884,"content":"Mndela, I agree that the game is better with strong distinction between colors and perhaps there is too much similarity between colors, but I respectfully disagree that it was better at the beginning. Blue was overpowered and red was garbage. You could easily go mono blue and do fine in combat. The real reason blue is worse at combat now is because the scenarios got more challenging and they didn't give blue as many tools to keep up. Mono red is still pretty bad. You don't want red to lower threat, cancel damage, or draw cards? That just means you want red to suck. Why is that better? Secret vigil and Legolas trigger off killing an enemy, so to me it still fits red flavor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370404","commentId":2370404,"userName":"dalestephenson","timestamp":1471443909,"content":"I enjoyed your essay, though I don't agree that \"red sucks\".  While all spheres have cards that can attack and defend, Tactics has the best cards for both.  And more important -- Tactics is fun to play.  Consider constructing a two-deck fellowship, one a questing deck and the other a combat deck (the previous home of mono-tactics deck).  Is the combat deck not fun to play, I daresay more fun to play?  When introducing a new player to the game in two-player mode, I like to give them the combat deck.\n\n \n\nYou're absolutely right that willpower for questing is \"absolutely essential\", and the near-total-lack of willpower in Tactics was a major problem.  But it's not that tactics is \"unplayable garbage\", it's that tactics *alone* is unplayable garbage.  The red deck in the core set was unable to muster enough questing power to beat the easiest quest in the game.  But replace one of those red heroes with SpEowyn and you're good to go.  When I analyzed the most recent decks posted by 100 different players at cardgamedb earlier this year, 44 out of 93 three-hero decks used tactics.  (The least popular sphere was actually leadership.)\n\n \n\nIn a one-deck solo environment, is there any advantage to using TaEowyn?  I think so.  Plenty of solo decks use tactics, and pretty much all solo decks can find use for a great quester with low threat and potential for high attack.  In solo, X/SpEowyn/TaBeregond has long been a powerful hero combination, combining great defense with great questing -- and changing that to X/TaEowyn/SpBeregond will in most cases be better, I think.\n\n \n\nOverall on the philosophy of scheme bleed, I like the idea that every sphere has a way of doing something, as long as the way of doing something is different.  Feint has a (weaker) alternative in every sphere, I like that.  Every sphere should have a (weaker) alternative to Test of Will as well.\n\n \n\nI also disagree that Feint is just \"OK\" without Hama.  It's precisely because Feint is powerful that Hama's ability to recycle it is so powerful.  I also question why you chose to mention Thicket of Spears or Trained for War as examples of Tactic's weakness, when those are little used cards.  Why not mention Defender of Rammas or Honour Guard or Quick Strike?\n\n \n\nFinally, I don't think it's true that red is the \"last color\" anyone cares about in secrecy.  By *far* the most common secrecy lineup I've seen is the classic hobbit Sam/LoPippin/TaMerry, and every single one of those decks wants to put 1-2 Daggers of Westernessee on TaMerry.  Despite the low engagement costs, a solo secrecy deck has to eventually kill things to win, and given low-threat heroes it's tough to pull that off without red."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370528","commentId":2370528,"userName":"Bullroarer Took","timestamp":1471446567,"content":"I wrote a long piece titled \"Spirits Silver Spoon\" a few months after the core set came out that complained about the red/blue schism. I agree that it really hasn't improved. I would like to add a few points though:\n\nYou must quest every turn, but you don't necessarily have combat every turn. This alone makes will power more important than attack or defense.\n\nThe ratios of encounter cards aren't constant, but for arguments sake assume they are 1/3 each location, treachery and enemy. Spirit is ALSO the sphere that handles treacheries the best with A Test of Will (and ways to get that back). Spirit also came equipped with Dunhere which let them attack the staging area without even having to engage an defend.\n\nWithout readying effects, each hero can quest, attack OR defend. And yet willpower, attack and defense count equally towards threat. This means that a hero that can attack and defend well gets doubly penalized for threat and additionally penalized if it has high hit points. And yet, even during the first cycle of Dunedain xxx cards we saw that gaining willpower was worth twice as much as gaining attack or defense. I believe the game would be better if there were a single \"combat\" stat rather than attack and defense.\n\nI have a pretty good deck with Boromir. The only tactics cards in it are Feint and Gondorian Shield. (I don't use Fire.)\n\nIncidentally, in terms of pure stats, lore has the very slight edge in defense.\n\nI won't argue with sphere bleed. Can't. I will say again that the core set feels rushed to me and if a longer play testing period had been spent some of this would have been ironed out. That said Caleb and Matt have done a pretty good job steering the ship since they took over. They have pushed the game more towards tribal rather than sphere and maybe that's what the game should have been from the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370628","commentId":2370628,"userName":"Gizlivadi","timestamp":1471449511,"content":"I've only read the OP, and yup, I mostly agree with you (lol'd at the Knight of Minas Tirith part. Yeah, it's laughable how the design team shot themselves in the foot with that one). So, without having read other posts, I will mention another important point. You talk mostly about power and stats distributed among spheres. Recently, it's been concluded that perhaps the 2 most powerful effects in the game, at least in solo, are resource acceleration and card draw. Every good solo deck needs to have some form of these 2 things in the deck. And recently, as the issue of sphere bleed becomes worse, Spirit got Arwen and Elven-light, two incredible cards that single handedly solve these 2 requirements. I think this is evident of the designers being either biased towards Spirit or they have no clue of how to design a balanced color pie. And I'm not even mentioning all those Spirit 3-attack heroes while Tactics just now got a single 4 willpower hero. Heck, even one of the top 3 defensive cards in the game, Blood of Númenor, is exploitable without having a single drop of Tactics.\n\n \n\n \n\n@Bullroarer Took Oh the Core Set was rushed alright. They didn't even stop to check if they were using the correct plural or singular forms of Quenya, or to see if the image they put on the back of every encounter card wasn't a blatant rip-off of Peter Jackson's Eye of Sauron which does not match the description of the books at all.\n\nEdited August 17, 2016 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370712","commentId":2370712,"userName":"John Constantine","timestamp":1471451388,"content":"I've used Knight of Minas Tirith to my success a lot of times and I find him pretty strong. Pulling enemy from the staging area before questing is no laughing matter. Yes, he will be rarely killing anybody with this ability, but usually killing is not the point of using it. Also, I was playing him with my friend being full Gondor deck and running lead Boromir, so Knight was hitting for 4 which is pretty decent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370799","commentId":2370799,"userName":"CaffeineAddict","timestamp":1471452924,"content":"I posted a work-in-progress two-hero deck in the Strategy Section, with Tactics Eowyn and Spirit Glorfindel, using her with Strider and Golden Shield. So far, despite needing a fair bit of tweaking to the deck list, she rocks.\n\nSo I would dispute the assertion that She's not very good, just because she doesn't automatically slot into an existing deck list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370812","commentId":2370812,"userName":"Gizlivadi","timestamp":1471453127,"content":"> I've used Knight of Minas Tirith to my success a lot of times and I find him pretty strong. Pulling enemy from the staging area before questing is no laughing matter. Yes, he will be rarely killing anybody with this ability, but usually killing is not the point of using it. Also, I was playing him with my friend being full Gondor deck and running lead Boromir, so Knight was hitting for 4 which is pretty decent.\n\n \n\nOk, I was too hasty to judge. I had forgotten that you also engage the enemy. I thought he just attacked it. That con come in handy in multiplayer especially if he attacks for 4, but not really in solo where you can't have Leadership Boromir and him at the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2370921","commentId":2370921,"userName":"dalestephenson","timestamp":1471455318,"content":"You can't use Knight of Minas Tirith's ability solo with leadership Boromir (barring songs or such), but you can use him to attack for four and absorb damage.  He's the only non-unique Gondor ally with base-3 attack, and all the Gondor allies with even 2 attack cost at least 3.  So if you had a Gondor deck with tactics in it (instead of the stereotypical mono-leadership), why not?\n\n \n\nWith that said, in my deck analysis I only found Knight of Minas Tirith in tactics monosphere decks (present in 3/5).  There were only two Gondor decks in my sample, only one with tactics, and LeBoromir/LeAragorn/Beregond is going to make paying for a 3-cost tactics ally tough.  (Though I suppose today Roheryn might be in that deck.)  Replace Aragorn with LeDenethor and it might be different, also replacing Beregond with Mablung or TaImrahil might make them more viable in a splash-tactics Gondor deck.\n\n \n\nAt least it was used in my monosphere sample, while Thicket of Spears (0/5) was not.  Still, that's not a function of tactics itself being bad, as many monosphere-friendly cards met similar fates.  White Tower Watchmen was in just 3 of 14 monosphere decks, and of the monosphere events only Strength of Arms (4/4) and Trained for War (1/5) were used at all.  Thicket of Spears no more means that tactics is junk than Advance Warning (0/3) or Against the Shadow (0/3) proves that Lore and Spirit are junk.\n\n \n\nFeint was included in 56% of the tactics deck, giving it one of the highest percentages for events.  Here's the generic events found in greater than 25% of the eligible decks:\n\n \n\n75% A Test of Will (spirit)\n\n62% The Galadhrim's Greeting (spirit)\n\n59% Sneak Attack (leadership)\n\n56% Feint (tactics)\n\n49% Daeron's Runes (lore)\n\n47% Hasty Stroke (spirit)\n\n28% Quick Strike (tactics)\n\n28% Dwarven Tomb (spirit)\n\n27% Stand and Fight (spirit)\n\n \n\nHorn of Gondor was the third most popular generic attachment, behind Unexpected Courage and A Burning Brand, but my sample was all pre-errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371042","commentId":2371042,"userName":"Some Sort","timestamp":1471458601,"content":"I will say this: while the Tactics sphere itself remains one of the weakest, Tactics Eowyn continues the trend of the sphere having some of the best top-end heroes.\n\n \n\nWhile Tactics doesn't have any true secrecy cards, T'Eowyn is still a strong secrecy hero. She gives access to the few Tactics cards that work wonderfully with a low-threat build, (Dagger of Westernesse, Unseen Strike, the kicker on Arrows from the Trees). She's immediately a vital cog in Staging Area Attack decks, (admittedly a pretty small niche), because she gives access to weapons, keeps threat low so enemies won't engage, and helps quest over those stranded enemies. Moreover, she can address two of the biggest early-game weaknesses of secrecy decks.\n\n \n\nThe first is the problem of questing successfully in turn one. If you fail your first quest, you're likely out of secrecy territory immediately. Samwise and Spirit Glorfindel gave secrecy decks a pair of 3-WP starting heroes, (though Glorfindel needed his Light of Valinor or he'd run the risk of blowing your secrecy discount, anyway), but otherwise you're mostly relying on 2-WP hobbits. Eowyn's 4 WP for 6 threat is an *insane* exchange rate. Even if she did nothing else, getting stats that big for a cost that low has value. I mean, that's essentially what made Spirit Glorfindel one of the most-played heroes in the game-- huge stats for a tiny threat cost. (It helps that Glorfindel also gives access to arguably the most-desired sphere, too.)\n\n \n\nTactics Eowyn is good for the same reason Tactics Beregond is good. She's giving you a huge stat right off the bat that eases pressure on the rest of your deck. She isn't necessarily bringing a lot to the party in terms of secrecy discounts, but she's doing a lot to ensure you keep those discounts for an extra round or two.\n\n \n\nThe other problem secrecy decks tend to have is early engagements, whether through a forced effect or in the form of low-engagement-cost enemies. The latter can be safely handled with O Elbereth, provided you have Spirit, but that's a one-shot deal. It's not fun trying to figure out a way through combat using squishy hobbit heroes if your Timely Aid whiffed, (or never arrived in the first place).\n\n \n\nTactics Eowyn opens up a whole glut of options to enable a secrecy build that doesn't break into a cold sweat at the thought of early combat. Feint is still one of the power cards in the pool, essentially a chump blocker and a shadow cancel all rolled into one. With Golden Shield, she's defending for five every round. Killing enemies who engage you in the first round is also very easy and consistent-- even with no other cards, she can swing twice for ten attack, (though she might blow your secrecy discount in the process).\n\n \n\nSo she's no savior, and she's certainly not the most game-breaking hero in a sphere that's kind of become known for game-breaking heroes and not much else, (Boromir, Hama, Scorpagorn, Mablung). She's not even as good as her Spirit counterpart. But I'd say she's essentially on par with Tactics Beregond or Tactics Merry in terms of raw power and impact on the meta. Which is certainly no trivial feat. She's not great, but she *is* very good. Totally playable.\n\nEdited August 18, 2016 by Some Sort"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371092","commentId":2371092,"userName":"Mndela","timestamp":1471459711,"content":"At the beginning, spheres had a very specific and different rols:\n\ntactics: attack and defense\n\nlore: drawing and healing\n\nspirit: questing and readying\n\nleadership: resources and interaction\n\n \n\n...but with the time, all spheres are mixed.\n\n \n\nAt the moment, if you want to ready a character you can use: behind-walls, rohan warhorse (tactics), eothain or faramir hero (leadership), fast-hitch and erebor keeper (lore), and more, much more...\n\nTo draw: foe-hammer and legolas (tactcis), light elven and galadriel hero (spirit), erestor ally and rod of stewards (leadership)\n\nTo gain resources: mablung and horn-gondor (tactics), miruvor and zigil miner (spirit), love tale (lore)\n\nTo attack: boromir leadership hero and dain (leadership), lanwyn and idraen heroes (spirit), haldir hero and faramir hero (lore)\n\n \n\nSpheres still have its own rol, but all rols are more mixed than before.\n\nEdited August 17, 2016 by Mndela"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371181","commentId":2371181,"userName":"Dain Ironfoot","timestamp":1471462646,"content":"I can't get past calling them \"colors\" instead of their proper name, spheres. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371187","commentId":2371187,"userName":"DukeWellington","timestamp":1471462759,"content":"There are a ton of good points and I'm sure I will neglect some that I want to respond to.\n\n@dalestephenson You made a lot of comments I agree with. I like tactics and I like feint a lot. I think Hama is my favorite hero ever. I agree that tactics is better multiplayer and I think it is a fun color, especially for new players. My points were pertaining to Eowyn and her high willpower (and overall lack of combat abikity). In that context red is the least viable color to win in solo and to run as a mono color. It needs high willpower. That was my point. The good cards you listed are good, but they kind of prove my point. The reason I said feint is only okay is because it is a one time use as opposed to an ally that stays in play. As a result it can be clutch in specific circumstances, but you obviously cannot build a deck around it. You find feint in basically every deck with red because it is cheap and useful. As far as that goes it is extremely good, but as the foundation of a deckbuilding archtype it can't fit that role (without Hama). The other cards I mentiined were specific to mono red decks with Eowyn (I should have made that more clear). My point was that there is little motivation to run a mono red lineup with her because going mono red offers so little reward. It is still better just to splash red, in which case there are at least 4 heroes who are better to splash. Why splash with Eowyn? That's my point. Good point regarding dagger od westerness. I think that qualifies as a red secrecy card that I neglected.\n\n@John Constantine I applaud you for being that one guy that had at least one or maybe even two examples of success with the red knight of engaging, but I stand by my assessment that the card is laughably bad. While it is true that you can engage an enemy, yiu have to do so during the planning phase while running a mono red deck. 95% of the time or more that situation will not come up ever. Your threat will be too high or you can just engage the enemy anyway. The knight doesn't even allow you to skip the attack unless you kill it or combo it with another card (which yiu could use anyway). By neglecting the card I suppose I will miss out on the opportunity to use his sweet ability every thousand games or so, but I guess I just have to content myself with running decks that are actually good. Oh well.\n\n@CaffeinAddict I saw your deck idea and I am excited to give it a try. I just don't personally like to proxy so I have to wait for the physical copy of Strider to give it a run. I did mention that I think Eowyn's future as a secrecy enabler looks promising and I tried to make clear that she was not very good in the current meta. I don't think you and I disagree.\n\nBeyond stats the most powerful and essential game elements include card draw, resource acceleration, cheating allies into play (sneak attack, a very good tale, elf stone, to the sea), and action advantage. Each of those aspects is non marginal. In my opinion the game works better when color identity determines the way that each color has access to these elements, rather than making them exclusive to one or two colors. I think purple should be the best at resource acceleration, and should do it the best, but every color should have some way to do it. In contrast, healing, cancellation, location control, encounter deck manipulation, dealing direct damage, global buffs, range and sentinel, and so forth, all count as marginal and can be relegated to one color. That's my opinion. Others can disagree, but that's where I come down on the issue.\n\nThanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371347","commentId":2371347,"userName":"dalestephenson","timestamp":1471466964,"content":"DukeWellington,\n\n \n\nThanks for clarifying that the mention of monosphere cards was for picturing TaEowyn in that role.  In that context, certainly you don't build around Feint without Hama, just as no deck builds itself around A Test of Will, quite possibly the single most useful card (and certainly the most irreplacable) in the entire game.  However, Feint *by itself* makes splashing tactics useful, even in a one-deck solo context.  It's probably more useful to splashers than mono-tactics, honestly, because tactics has no shortage of defenders and mono-tactics can afford to play them.\n\n \n\nSo let's back up -- is it useful to:\n\n \n\n1) Splash tactics in a multiplayer deck?\n\n2) Splash tactics in a solo deck?\n\n3) Splash another sphere in a tactics multiplayer deck?\n\n4) Splash another sphere in a tactics solo deck?\n\n5) Have a mono-tactics multiplayer deck?\n\n6) Have a mono-tactics solo deck?\n\n \n\nBefore TaTheoden, everyone agreed that the answer to #6 was \"no\".  However, I think it's abundantly clear that people were most certainly saying \"yes\" to #1-#5.  Solo tactics was out, but solo-mostly-tactics was perfectly viable (I played all released quests with a SpEowyn/Thalin/Gimli deck), and multiplayer-mono-tactics was certainly viable when played with a questing deck.  It's true that the mono-tactics didn't build themselves around the three mono-tactics cards, but they didn't have to.  There's plenty of strong events, attachments, and allies in tactics to take care of combat.  They just couldn't quest enough to solo.  #6 was out.\n\n \n\nAfter TaTheoden, it was *possible* to have a hero lineup with enough questing oomph to make progress early, which is the key factor separating mono-tactics solo from other decks.  The chief difficulty is having to keep your heroes questing, since questing allies are so expensive and scarce in tactics.  Still, tactics abounds with allies who can take care of combat, and with one card revealed per turn getting massive amounts of wp isn't required.\n\n \n\nSo if we accept that #1 through #5 are all viable decks, and #6 after TaTheoden is at least semi-plausible, what good is Eowyn?  Let's see, her strengths are as follows:\n\n \n\n1) She's an excellent quester.\n\n2) She's low threat\n\n3) She can ready and attack for 10+ once per game.\n\n \n\nLet's see, what kind of decks *can't* use an excellent quester who's low threat and can kill bosses after questing?  Those are three abilities that are *always* useful.  One of the reasons that SpGlorfindel is so stinking popular is because he gives you so much wp for so little threat.\n\n \n\nDoes she fit in a splash tactics deck?  Certainly!  She allows you to play cheap and powerful tactics events, while being low threat, questing strongly, and giving you a one-time boss attack that non-tactics decks can sometimes struggle to muster.\n\n \n\nDoes she fit in a majority tactics deck?  Certainly!  She still has those same always-useful abilities, and readying + Herugrim or Golden Shield can make her a potent contributor to combat as well.\n\n \n\nDoes she fit in a multiplayer mono-tactics deck?  Certainly!   Those abilities are still useful, and there's two other heroes and a whole deck to take care of multiplayer combat needs.\n\n \n\nWhat about the solo mono-tactics deck?  TaTheoden/TaEowyn quests for *8* with no help whatsover, and that leaves another hero and a whole deck to provide for other needs.  And at 18 threat for Theoden/Eowyn, the third hero can be any published tactics hero and you'll start with 30 or less threat.  Totally, totally viable.  Now it's true that of the existing tribes only Eagles lend themselves to a mono-tactics deck.  But there's no shortage of viable decks that can be constructed with tactics cards, a free hero slot, and two heroes questing for *8*.  Following Beorn's Path I played all manner of solo one-handed quests with Theodred/LeAragorn/Denethor (typically heroes quest for 3, Denethor ready), and Eowyn/Thalin/Gimli (typically heroes quest for 5, Gimli ready).\n\n \n\nNow it may be true that you can construct a stronger mono-solo deck by going mono-Leadership Gondor/Outlands, or mono-Lore Rossiel/Ents, or mono-Spirit Caldara.  So what?  It's not at all important that mono-tactics be the most powerful possible deck, it's only important that it be *viable*.  And TaTheoden/TaEowyn makes mono-tactics totally, totally viable, which was not the case at all not so long ago.  Why play such a deck?  Because it's fun, and because you can win with it.  What other reason could be needed?\n\n \n\nAnd *outside* the mono-tactics solo deck, where 99% of the tactics is played, I don't see how Eowyn's not useful.  She's low threat, she's an excellent quester, she can kill bosses.  That's useful in any deck.  Yes, you wouldn't sub her in for a tactics hero you selected for their specific ability, but if you just want a generic tactics hero, Eowyn gives you excellent bang for her buck.  Outstanding supporting hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371497","commentId":2371497,"userName":"DukeWellington","timestamp":1471471953,"content":"You write with detail and passion, but it's difficult to engage fully becaus you're communicating as though we are on opposite sides of a debate. I just don't think we disagree that much so your tone is off putting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371506","commentId":2371506,"userName":"Kakita Shiro","timestamp":1471472415,"content":"> You write with detail and passion, but it's difficult to engage fully becaus you're communicating as though we are on opposite sides of a debate. I just don't think we disagree that much so your tone is off putting.\n\n \n\n> The conclusion is that tactics Eowyn does not fit into any existing type of deck. New deck styles will need to be invented before she is actually good. This may reqire more cards or rethinking current deck design approaches. Time will tell if this new Eowyn is an interesting novelty or a foundational staple of certain archtypes. Personally I hope and believe it will be the second, but we have a long way to go. Until then, have fun exploring Middle Earth with our new secret shield maiden.\n\n \n\n> DukeWellington,\n> \n>  \n> \n> Thanks for clarifying that the mention of monosphere cards was for picturing TaEowyn in that role.  In that context, certainly you don't build around Feint without Hama, just as no deck builds itself around A Test of Will, quite possibly the single most useful card (and certainly the most irreplacable) in the entire game.  However, Feint *by itself* makes splashing tactics useful, even in a one-deck solo context.  It's probably more useful to splashers than mono-tactics, honestly, because tactics has no shortage of defenders and mono-tactics can afford to play them.\n> \n>  \n> \n> So let's back up -- is it useful to:\n> \n>  \n> \n> 1) Splash tactics in a multiplayer deck?\n> \n> 2) Splash tactics in a solo deck?\n> \n> 3) Splash another sphere in a tactics multiplayer deck?\n> \n> 4) Splash another sphere in a tactics solo deck?\n> \n> 5) Have a mono-tactics multiplayer deck?\n> \n> 6) Have a mono-tactics solo deck?\n> \n>  \n> \n> Before TaTheoden, everyone agreed that the answer to #6 was \"no\".  However, I think it's abundantly clear that people were most certainly saying \"yes\" to #1-#5.  Solo tactics was out, but solo-mostly-tactics was perfectly viable (I played all released quests with a SpEowyn/Thalin/Gimli deck), and multiplayer-mono-tactics was certainly viable when played with a questing deck.  It's true that the mono-tactics didn't build themselves around the three mono-tactics cards, but they didn't have to.  There's plenty of strong events, attachments, and allies in tactics to take care of combat.  They just couldn't quest enough to solo.  #6 was out.\n> \n>  \n> \n> After TaTheoden, it was *possible* to have a hero lineup with enough questing oomph to make progress early, which is the key factor separating mono-tactics solo from other decks.  The chief difficulty is having to keep your heroes questing, since questing allies are so expensive and scarce in tactics.  Still, tactics abounds with allies who can take care of combat, and with one card revealed per turn getting massive amounts of wp isn't required.\n> \n>  \n> \n> So if we accept that #1 through #5 are all viable decks, and #6 after TaTheoden is at least semi-plausible, what good is Eowyn?  Let's see, her strengths are as follows:\n> \n>  \n> \n> 1) She's an excellent quester.\n> \n> 2) She's low threat\n> \n> 3) She can ready and attack for 10+ once per game.\n> \n>  \n> \n> Let's see, what kind of decks *can't* use an excellent quester who's low threat and can kill bosses after questing?  Those are three abilities that are *always* useful.  One of the reasons that SpGlorfindel is so stinking popular is because he gives you so much wp for so little threat.\n> \n>  \n> \n> Does she fit in a splash tactics deck?  Certainly!  She allows you to play cheap and powerful tactics events, while being low threat, questing strongly, and giving you a one-time boss attack that non-tactics decks can sometimes struggle to muster.\n> \n>  \n> \n> Does she fit in a majority tactics deck?  Certainly!  She still has those same always-useful abilities, and readying + Herugrim or Golden Shield can make her a potent contributor to combat as well.\n> \n>  \n> \n> Does she fit in a multiplayer mono-tactics deck?  Certainly!   Those abilities are still useful, and there's two other heroes and a whole deck to take care of multiplayer combat needs.\n> \n>  \n> \n> What about the solo mono-tactics deck?  TaTheoden/TaEowyn quests for *8* with no help whatsover, and that leaves another hero and a whole deck to provide for other needs.  And at 18 threat for Theoden/Eowyn, the third hero can be any published tactics hero and you'll start with 30 or less threat.  Totally, totally viable.  Now it's true that of the existing tribes only Eagles lend themselves to a mono-tactics deck.  But there's no shortage of viable decks that can be constructed with tactics cards, a free hero slot, and two heroes questing for *8*.  Following Beorn's Path I played all manner of solo one-handed quests with Theodred/LeAragorn/Denethor (typically heroes quest for 3, Denethor ready), and Eowyn/Thalin/Gimli (typically heroes quest for 5, Gimli ready).\n> \n>  \n> \n> Now it may be true that you can construct a stronger mono-solo deck by going mono-Leadership Gondor/Outlands, or mono-Lore Rossiel/Ents, or mono-Spirit Caldara.  So what?  It's not at all important that mono-tactics be the most powerful possible deck, it's only important that it be *viable*.  And TaTheoden/TaEowyn makes mono-tactics totally, totally viable, which was not the case at all not so long ago.  Why play such a deck?  Because it's fun, and because you can win with it.  What other reason could be needed?\n> \n>  \n> \n> And *outside* the mono-tactics solo deck, where 99% of the tactics is played, I don't see how Eowyn's not useful.  She's low threat, she's an excellent quester, she can kill bosses.  That's useful in any deck.  Yes, you wouldn't sub her in for a tactics hero you selected for their specific ability, but if you just want a generic tactics hero, Eowyn gives you excellent bang for her buck.  Outstanding supporting hero.\n\n \n\nTL,DR: You said she has no place, Dalestephenson said she's does. Seems like you guys are on opposite sides of the debate here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371683","commentId":2371683,"userName":"Distractionbeast","timestamp":1471479235,"content":"I will totally use Teowyn.  And I will totally use Speregond.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2371692","commentId":2371692,"userName":"DukeWellington","timestamp":1471479896,"content":"I don't want anyone to misunderstand me. I have zero problem with anything dalestephenson said. I have no problem with a good debate. I have no problem with a strong communicator making a strong case. My point in my last post was not to criticize dalestephenson or suggest he did something wrong. My point was that I think his case was largely based on distortions and exaggerations of my actual opinion. Again, I am not saying that dalestephenson distorted or exaggerated anything, but rather that either I miscommunicated because I was trying to be provacative or funny, or because of the nature of language. The reason I said that his tone was off putting was because I felt that it would take a lot of effort to clarify and I've found that once people are in a debate mindset they are looking to knit pick and refute everything you say which would lead down a long futile rabbit hole.\n\nSo, that being said, I will try to clarify why I believe that dalestephenson and I are not really on opposite sides of a debate. Basically, there are many ways of playing LOTR. I have discussed this in other threads. I like to build Dwalin decks because they are fun. If I claimed that spirit Pippen yotally sucks then somebody will tell me about their totally sweet hobbit deck that runs spirit Pippen and OHUH Gandalf and it is so fun and, yes there are better decks, but so what, it's fun, etc. Would I disagree with the Pippen fan boy? No. I would say, that is so cool! I would love to try the deck. It sounds like fun. I would also still stand by my assessment that Pippen is a horrible hero. That seems to be contradictory, but it's not. The apparent contradiction arises from the nature of the game. So, on one level every hero and card has a place, and on another, some heroes and cards are better than others.\n\nDalestephenson was talking one one level. I was talking on another. Is Eowyn fun and worth playing? You bet! Dalestephenson did a good job saying why. Is Eowyn a good hero? Eh, not really. In virtually every case he described I could come up with a better hero choice or better deck. So, if you approach the topic like a competitive power gamer, where you don't just want fun and interesting cards, but THE BEST cards, then she is not really worth playing. You can say, so what! and I would agree, but it's still true. I tried to clarify by saying that she was worth playing as a \"novelty\", but in limited space it's difficuly to speak with complete clarity.\n\nNow, I know the temptation is to keep the debate going, but I will be choosing to bow out in that case. Feel free to take the last word, I just don't think it's important enough as a life thing to put more effort and thought in. Life is too short, and I want to play more LOTR, ya know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372572","commentId":2372572,"userName":"Seastan","timestamp":1471532757,"content":"One of the many good uses for Tactics Eoywn is that she brings a revival to the solo Dunhere archetype. Here's one example: http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0 [http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0]\n\n \n\n \n\n> Is Eowyn a good hero? Eh, not really. In virtually every case he described I could come up with a better hero choice or better deck.\n\n \n\nHmm, so a hero is not good if you can come up with a better deck that does not involve that hero. For any given definition of \"better\", it follows that there are only 3 good heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372610","commentId":2372610,"userName":"Some Sort","timestamp":1471533598,"content":"> I don't want anyone to misunderstand me. I have zero problem with anything dalestephenson said. I have no problem with a good debate. I have no problem with a strong communicator making a strong case. My point in my last post was not to criticize dalestephenson or suggest he did something wrong. My point was that I think his case was largely based on distortions and exaggerations of my actual opinion. Again, I am not saying that dalestephenson distorted or exaggerated anything, but rather that either I miscommunicated because I was trying to be provacative or funny, or because of the nature of language. The reason I said that his tone was off putting was because I felt that it would take a lot of effort to clarify and I've found that once people are in a debate mindset they are looking to knit pick and refute everything you say which would lead down a long futile rabbit hole.\n> \n> So, that being said, I will try to clarify why I believe that dalestephenson and I are not really on opposite sides of a debate. Basically, there are many ways of playing LOTR. I have discussed this in other threads. I like to build Dwalin decks because they are fun. If I claimed that spirit Pippen yotally sucks then somebody will tell me about their totally sweet hobbit deck that runs spirit Pippen and OHUH Gandalf and it is so fun and, yes there are better decks, but so what, it's fun, etc. Would I disagree with the Pippen fan boy? No. I would say, that is so cool! I would love to try the deck. It sounds like fun. I would also still stand by my assessment that Pippen is a horrible hero. That seems to be contradictory, but it's not. The apparent contradiction arises from the nature of the game. So, on one level every hero and card has a place, and on another, some heroes and cards are better than others.\n> \n> Dalestephenson was talking one one level. I was talking on another. Is Eowyn fun and worth playing? You bet! Dalestephenson did a good job saying why. Is Eowyn a good hero? Eh, not really. In virtually every case he described I could come up with a better hero choice or better deck. So, if you approach the topic like a competitive power gamer, where you don't just want fun and interesting cards, but THE BEST cards, then she is not really worth playing. You can say, so what! and I would agree, but it's still true. I tried to clarify by saying that she was worth playing as a \"novelty\", but in limited space it's difficuly to speak with complete clarity.\n> \n> Now, I know the temptation is to keep the debate going, but I will be choosing to bow out in that case. Feel free to take the last word, I just don't think it's important enough as a life thing to put more effort and thought in. Life is too short, and I want to play more LOTR, ya know.\n\n \n\nI registered to make a post earlier, though it hung up waiting for approval for a while, so I suspect it got missed. For what it's worth, I think there are places in the existing meta where T'Eowyn is THE BEST option, or at the very least among the best.\n\n \n\nStaging area attack is the big one. Now, one could easily say \"staging area attack is terrible!\", and they would be right. Staging area attack suffers from a lot of problems. You need to keep your starting threat low enough to keep enemies in staging. Your key attackers are attacking alone, which means you need Tactics access for weapons, (and possibly for Hands Upon the Bow). And if you're leaving all those enemies in staging, you need a lot of willpower to quest over top of the top of them. Those three needs have historically been at odds with each other, meaning it's hard to get consistent staging area attack going in 50 cards worth of deck space.\n\n \n\nBut, let's see, who is a hero that has low starting threat, high willpower, and gives us access to Tactics...\n\n \n\nBeyond being a staging-area-attack powerhouse, she's a quality add to the secrecy archetype, which could really benefit from a low-threat super-defender who doesn't raise your threat out of secrecy territory. While it's true that there are no \"true\" Tactics secrecy cards, (though: Dagger of Westernesse, Unseen Strike, the kicker on Arrows from the Trees), she does a lot to solve some of the biggest struggles Secrecy decks face-- namely, succeeding at early quests to maintain the secrecy discount and dealing with early engagements. Feint and Golden Shield mean early engagements are NBD.\n\n \n\nI'd also say she replaces TacMerry as the best Tactics hero in a dual-sphere Ent deck. TacMerry gets you extra Ent attacks, but Ents are the ultimate \"slow start\" archetype, and Eowyn is the ultimate \"fast start\" hero-- she can quest for 4 and attack for 10 in the first round with no other cards required! She's going to do a *ton* to establish your foothold while you're waiting for your Ents to rouse.\n\n \n\nAnd, really, Golden Shield has to be mentioned again because it turns her into one of the best defenders in the game. Beregond + Gondorian Shield = 6 defense, but the two Denethors and Tactics Theoden are the only other heroes who can get to 5 defense with a single card. And the Denethors don't have a sphere-match for the card in question, and TacTheoden has a starting threat of 12.\n\n \n\nAt the end of the day, a hero's stats can be good enough relative to his or her threat that they alone make him/her good. Why do you think everyone plays Spirit Glorfindel? T'Eowyn has the second-best stat-to-threat ratio in the game, especially when you consider that a 4/1/1 line is a lot better than a 2/2/2 line. And unlike Glorfindel's negative, she comes with an additional positive. Tactics isn't as good as Spirit, but if we're downgrading Eowyn because Tactics isn't good, are we forced to say that there isn't a single \"good\" Tactics hero in the entire game, outside of Boromir and maybe Hama? I mean, essentially then you aren't saying \"Eowyn isn't good\", you're saying \"there's no good reason to play Tactics\". Tactics is clearly the weakest sphere, but there are plenty of good reasons to play it, still.\n\n \n\nI'm not saying she's the best hero in the pool. I'm not even saying she's top 10, or as good as her Spirit counterpart, (who is absolutely in my top 10). I'm saying she's a good hero-- not just a fun one, but a good one, too. I'd put her in the 2nd quartile of hero power, roughly on par with Beregond, and for roughly the same reason. That's a massive pile of stats that is not easily replicated for anywhere near as cheaply, which frees up a ton of deck space to devote to other areas of need. She comes into the meta already with tailor-made roles-- Staging attack! Ents! Mono-tactics!-- and her uses are only going to grow as the Tactics card pool continues to improve.\n\n \n\nI guess let me turn the question around on you. There are, what, about 80 heroes in the game? If you were to rank them all from 1-80(ish)-- not based on \"fun factor\", but on \"objective quality\"-- where would Eowyn fall? Top 10? Top 20? 21-40? 41-60? 61-80? I've already said Eowyn's probably in the 21-40 range for me. Do we disagree, or is your definition of \"good heroes\" simply much narrower than mine?\n\n \n\n(Also, to be clear, I'm not debating, I'm discussing, because I love this game and I love discussing it and I like hearing other people's thoughts and seeing where they're coming from and learning things. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372695","commentId":2372695,"userName":"dalestephenson","timestamp":1471536152,"content":"We probably don't disagree on details as much, but I'm specifically reacting to phrases like \"unplayable garbage\" (for tactics) and \"not a good hero\" (for TaEowyn).  These are strong statements, and I disagree strongly with them.\n\n \n\nHowever, leaving the strong language aside, I think you have a good point -- TaEowyn is an *excellent* support hero for Tactics, of SpGlorfindel levels of usefulness for splashing tactics.  However, prior to TaEowyn, there were very few support heroes in Tactics, really only Thalin and Dori, and neither of those are popular or associated with top-rank decks.  Splash tactics is probably more strongly associated with Amarthiul than any real tactics heroes.  So substituting Eowyn straight up for a tactics hero would require reworking most decks, since some power you were planning on is no longer there.  (I don't think the reworked deck would necessarily be *weaker*, but it would be different.)\n\n \n\nBut as a low-threat powerful quester with a strong one-time ability, Eowyn is a plausible replacement for support heroes in other spheres, including her own spirit version that's been a part of no end of powerful decks.  Because it's a sphere change you'd either have to swap another hero out or change the deck somewhat in most cases -- one exception is decks that include SpEowyn and TaBeregond, a powerful combination.  There are 14 such decks at ringsdb.com (not counting the one using SpEowyn as a TaEowyn proxy), and most of them would be better with a straight-up substitution of TaEowyn and SpBeregond.  (The Caldara deck is the obvious exception.)\n\n \n\nIf you approach the topic like \"a competitive power gamer\" and only want THE BEST cards, the question then becomes what the basis of comparison is.  If you start with something like this:\n\n \n\n1) Seastan's Boromir deck wins 99% of all nightmare decks\n\n2) Any other deck falling short of that standard does not represent THE BEST cards, and is not of interest to the competitive power gamer.\n\n \n\nIt's possible to take that approach.  A new player on BGG recounted playing with another player who was playing some sort of super-Boromir deck, said he was attacking for 30 and he couldn't muster more than four, and then wondered why anyone would ever play anything but Boromir .  I have a hard time understanding the mindset for this game, which gets its replay value from challenge and variety.  Constructing an unbeatable deck may be a satisfying endeavor, but playing one is less so.\n\n \n\nAnother way to look at it is with respect to a given deck approach.  For example, even if Noldor decks are more powerful than Silvan decks, that doesn't make Celeborn a \"bad hero\" for being essential for Silvan but worthless for Noldor.  The best possible Silvan deck will always have Celeborn in it.\n\n \n\nTaEowyn is in that place for the mono-tactics solo deck.  The strongest mono-tactics solo deck will have both TaTheoden and TaEowyn, and a viable mono-tactics solo deck isn't even *possible* without one or the other.  Is a mono-tactics solo deck weaker than other sphere's mono-decks?  I'm only theory-casting here because I've only played monosphere decks two-handed, but I think it could be the weakest of the four (it might not be, though -- it certainly has higher starting questing than leadership/lore, and being able to quest strongly out of the gate is huge in solo).  But I don't think it matters much from a competitive standpoint *because it's a different type of deck*.  I don't think you can dismiss a mono-Lore Rossiel deck just for not being as strong as the mono-Spirit Caldara deck with its new toys, they aren't really comparable and you can't make a Rossiel deck \"better\" by substituting a Caldara deck.  It's no longer a Rossiel deck.\n\n \n\nBut what about TaEowyn outside the mono-tactics solo deck?  Can any deck she is in be improved by substituting a different hero?  There are heroes that fit that description -- Dori with Beregond, SpPippin with anybody, Fatty with anyone not named SpPippin.  But a hero that quests for four, has an effective threat of six, and can attack once for ten, can be improved on that easily?  I don't believe it.\n\n \n\nShe's a new hero, but here's the TaEowyn decks at cardgamedb that do not have TaTheoden also:\n\n \n\nTaEowyn/TaMerry/LoPippin (Eowyn Esquires and Ents)\n\nTaEowyn/TaMerry/LoPippin (Flame of the West first quest solo)\n\nTaEowyn/LeDenethor/SpGlorfindel (Secretly Overpowered)\n\nTaEowyn/SpBeregond/Beravor (The Defense of Gondor)\n\nTaEowyn/Dunhere (Sniper)\n\nTaEowyn/TaBoromir/LeDenethor (Boromir and Eowyn rescure Frodo)\n\nTaEowyn/SpBeregond/Haldir (Flame of Support)\n\nTaEowyn/Bard/Dunhere (Killing in the Staging Area)\n\nTaEowyn/TaMerry/Mablung (First quest, then slay the boss)\n\nTaEowyn/SpGlorfindel/SpFrodo (Tactics Eowyn)\n\nTaEowyn/Mirlonde/Treebeard (Ents along the Anduin)\n\nTaEowyn/Eomer/Hama (Rohan Fighting)\n\nTaEowyn/TaMerry/SpTheoden (Eowyn's Wrath)\n\nTaEowyn/LoAragorn/Grima (Grima raises the Ents)\n\n \n\nTwo of those decks are mono-tactics, one of which (yours, in fact) identifies it as a solo deck, and the other could be a solo deck (neither of the attacking heroes are ranged), so we'll ignore those.  That leaves 13 decks, of which *none* can clearly be improved by substituting another tactics hero for Eowyn, IMO.\n\n \n\nThis isn't to say you can't substitute a hero of a different sphere to make a viable deck -- possibly a better deck, possibly not.  Two different people shook up the classic Sam/LoPippin/TaMerry lineup to substitute TaEowyn for Sam.  You lose the usual defender, some nice leadership cards, weaken cards that want hobbits, and reduce TaMerry's attack by one.  OTOH, your effective threat goes down by two, leaving you in secrecy longer, your starting willpower goes up by one and with double-tactics can afford to play good defenders and attackers.  Plus Eowyn's got a 10+ attack in her back pocket.\n\n \n\nDunhere/TaEowyn is an interesting two-hero deck.  Dunhere needs tactics enhancement and two-hero decks need a strong quester, Eowyn's absolutely the perfect hero to pair with Dunhere in a two-hero deck.\n\n \n\nThough not a secrecy deck, TaEowyn/Haldir/SpBeregond and Dunhere/TaEowyn/Bard are from a similar page.  Eowyn provides questing oomph, access to tactics for the Haldir deck, and combat heroes that can be useful against not-engaged enemies.\n\n \n\nTaEowyn/Mirlonde/Treebeard has an effective threat of 25, and tactics gives access to tactics ents and Boomed and Trumpeted.  Substitute any other tactics hero, and you both have significantly higher threat and significantly less starting questing.  I have a hard time seeing an improvement for Eowyn here, she's perfect for the splash tactics you need to use all the ents.\n\n \n\nTaEowyn/LeDenthor/TaBoromir you obviously can't substitute any other tactics hero, because the other two heroes can't quest for squat.  You could substitute SpEowyn, but then you'd have a different deck.  You could substitute a leadership hero (since Denethor's ability can help pay for tactics), but Sam's the best quester and that'd raise your effective threat while lowering your willpower.  Simply no point.\n\n \n\nTaEowyn/TaMerry/SpTheoden is an interesting deck, it doesn't use many Rohan allies, just loads up SpTheoden with attachments and lets him handle combat.  I think this'd be a stronger deck if you made it TaEowyn/SpMerry/TaTheoden, since Herugrim and Golden Shield would be more powerful and the Rohan discount isn't really needed.  The usual Rohan deck is SST, since there's so many spirit allies, but most of the spirit allies are cheap, so I think a STT Rohan deck would work equally well, especially if expecting to recycle Grimbold.\n\n \n\nIn short, looking just at the hero lineups, there's not really a case where another hero would cleanly sub and make it obviously better, and there's several cases where substitution of any hero might well make it worse.\n\n \n\nIn a more general sense, I think TaEowyn will be a boon to the tactics-tactics-other solo decks.  Previously those had essentially required that the splash hero *must* be a good quester, because tactics doesn't and you need a certain amount of questing out of the gate to not get swamped.  That's no longer the case, and opens up double-tactics to work with off-sphere non-questers, of which many exist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372696","commentId":2372696,"userName":"DukeWellington","timestamp":1471536153,"content":"> One of the many good uses for Tactics Eoywn is that she brings a revival to the solo Dunhere archetype. Here's one example: http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0 [http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0]\n> \n> > Is Eowyn a good hero? Eh, not really. In virtually every case he described I could come up with a better hero choice or better deck.\n> \n> Hmm, so a hero is not good if you can come up with a better deck that does not involve that hero. For any given definition of \"better\", it follows that there are only 3 good heroes.\n\nWell, because of the colors it would be 12, plus Gandalf. However, I would expand this to include something like \"best hero in an archtype\", which admittedly eludes precise definition. Boromir is so unique that you can't just swap him with other red heroes in a deck. With Eowyn, however, she can almost always be replaced and the result will be a deck that does the same thing, only better. That's my point. Again, I am talking about existing deck styles. I fully think that decklists will emerge where this won't be the case, but I haven't seen it yet.\n\nAnd yes, I'm okay with the number of legit power heroes being very few. I'm not sure why that is bad.\n\nEdited August 18, 2016 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372814","commentId":2372814,"userName":"dalestephenson","timestamp":1471538906,"content":">  \n> \n> > One of the many good uses for Tactics Eoywn is that she brings a revival to the solo Dunhere archetype. Here's one example: http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0 [http://ringsdb.com/decklist/view/2482/dnhere-solo-with-tactics-eowyn-1.0]\n> > \n> >  \n> > \n> > > Is Eowyn a good hero? Eh, not really. In virtually every case he described I could come up with a better hero choice or better deck.\n> > \n> > Hmm, so a hero is not good if you can come up with a better deck that does not involve that hero. For any given definition of \"better\", it follows that there are only 3 good heroes.\n> \n> Well, because of the colors it would be 12, plus Gandalf. However, I would expand this to include something like \"best hero in an archtype\", which admittedly eludes precise definition. Boromir is so unique that you can't just swap him with other red heroes in a deck. With Eowyn, however, she can almost always be replaced and the result will be a deck that does the same thing, only better. That's my point. Again, I am talking about existing deck styles. I fully think that decklists will emerge where this won't be the case, but I haven't seen it yet.\n> \n> And yes, I'm okay with the number of legit power heroes being very few. I'm not sure why that is bad.\n\nI'll bite -- who would be better than TaEowyn in Seastan's Dunhere deck?  Who would make it do \"the same thing, only better?\"\n\n \n\nWith the exception of mono-tactics, TaEowyn can almost always be replaced, and the result will almost always be a deck with higher threat and lower initial questing.  If the deck is trying to do the \"same thing\" it was doing with TaEowyn (i.e. the deck and other two heroes provide the main thrust of the deck) I don't think it's obvious at all that it could still do that, only better, with higher threat, lower initial questing, and no boss attack.\n\n \n\nThe definition of \"best hero in a archetype\" as a synonym for \"good\" is not intuitive to me.  I don't think SpGlorfindel is the \"best\" hero in any particular archetype, but I certainly think he's good.\n\n \n\nIt's OK to consider the number of \"legit power heroes\" to be very few.  It's another thing to say that someone who is not a legit power hero is \"not a good hero.\"\n\n \n\nI am however intrigued by the idea that their are 13 \"best heroes\" when you include colors.  Surely for all decks in existence, one must be the most powerful, and that will almost certainly have exactly three heroes in it.  But if you widen it to include colors, why would it have three heroes from each sphere plus Gandalf?  For three-hero solo decks, there are 20 decks not including Gandalf -- 4 monosphere, 4 tri-sphere, and 12 major/minor combinations.  Would it really be the case that the same heroes are \"the best\" for all possible combinations involving that color?\n\n \n\nMaybe so.  Let's accept that the irreplacable Boromir is part of the best tactics-splash deck in existence, which is certainly plausible.  Each of the four single-tactics decks would look something like this:\n\n \n\nTaBoromir-X-X\n\n \n\nOK, given that, what would the best double tactics decks in existence look like?  I suspect they would like this:\n\n \n\nTaBoromir-TaEowyn-X\n\n \n\nWith TaBoromir and double tactics, you don't *need* any combat-focused tactics heroes to go with Boromir.  He can do it all.  So you want to pair it with the lowest threat (TaEowyn) and the highest willpower (TaEowyn) -- and Eowyn *by herself* can free X up to have something in their job description more important than \"must quest well\"\n\n \n\nSo that brings us to the best mono-tactics deck in existence:\n\n \n\nTaBoromir-TaEowyn-TaTheoden.  Threat starts at just 29, you can quest for *10* with the heroes out of the gate while having 3 tactics resource per turn and TaBoromir to handle combat.  Think there's a \"better\" mono-tactics deck out there?  I doubt it.\n\n \n\nBy this measure, the \"best\" tactics heroes would be TaBoromir, TaEowyn, and TaTheoden.  We know that's not true, in all 11 decks it's Boromir that makes the deck rock.  But if you want to prove that you can improve the 5 decks with TaEowyn by substituting a different tactics hero, make your case.  I don't see it.\n\n \n\nAre \"legit power heroes\" really better when paired with other power heroes instead of good support heroes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2372994","commentId":2372994,"userName":"dalestephenson","timestamp":1471543886,"content":"Just to clarify, I'm not saying that I *know* TaEowyn can't be replaced with another hero in any non-solo-mono-tactics deck to make it a better deck.  I'm no master deckbuilder, and I could very well be wrong on that point.  I'm saying I don't see *how* Eowyn is replaced with another hero to make it obviously better.  I'd rather see a detailed example showing how I was wrong and learn something rather than \"win\" and learn nothing.\n\n \n\nI'm also now madly curious about which combination of heroes would have the highest winning percentage against all nightmare quests, for each sphere combination.  I was thinking about starting with Seastan's public decks and sorting by likes, but I'm not sure all those decks are meant to be broken."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373064","commentId":2373064,"userName":"DukeWellington","timestamp":1471545947,"content":"I repeat a lot of points here, but I think I have a better handle on my thoughts.\n\nIt may be true that Eowyn in a Dunhere deck is powerful. I was unaware of that deck and made clear that I was expecting new decks that would feature Eowyn as a quality choice. That was a major point of what I was saying, that she would create new archtypes.\n\nIt is true that including the top 3 heroes in a lineup is rarely a good choice. It is ussually better to combine a power hero with a support hero. Boromit is strong, but not if you just randomly toss him into a lineup. He needs a deck built around him. Spirit Glorfindel, on the other hand, can be tossed into basically any deck and he makes it better. He doesn't require a deck that is built around him. All that illustrates to me, again, is that there are different ways of talking about things like good and bad. It is not so black and white. That's why I can say that Eowyn is not very good (in one sense) while still agreeing that she is good (in another sense).\n\nEowyn is not good as a power hero like Boromir or Gandalf. She doesn't have enough abilities to build around her. She is certainly a strong candidate for a solid support hero. Her 6 threat cost and 4 willpower make her great for that role. I am not sold that red is so great as a splash support color. Yes, obviously red is fun and worth playing and so forth, but the other colors seem stronger. Ussually when I splash red, which I do a lot, I don't add it as a support color so much as something more central. The distictiin is fuzzy. Anyway, whenever I do splash red I think Eowyn is a poor choice given how red has historically been used, but she is radically different, so she may be a good choice in a new approach to using red, something that utilizes low threat, etc. We haven't seen that yet so it is hard to say. I think the strider deck, the hobbits and ents, and perhaps Dunhere deck (haven't played it yet) will prove to be excellent decks. I hope so. Even if they are more like fun novelty decks, I fully expect somebody will come up with something more inventive later.\n\nSo, given that it doesn't work to put 3 power heroes together, we can see that each color does not necessarily have 3 good heroes. If we grant that Boromir is the best red hero, we sometimes don't want to play with him. Maybe we want to use Beorn instead. Beorn and Boromir cannot really be used together because both need to be the central focus of a deck. If a Beorn deck can be built that is almost as good as the Boromir deck then we have two archtypes that are solid choices. A hero qualifies as good, IMO, if it is one of the top 3 heroes (power or support) in a strong deck type. So for Eowyn to be good she either has to have her own strong deck type or be one of the best support heroes in a deck built around another hero. That would be my standard. The jury is still deliberating, but my prediction is that new deck types will need to be invented before Eowyn meets that standard, which I fully expect to happen.\n\nNow I've repeated my point in several different ways. I hope people will now understand what I was saying. The phrases like unplayable garbage were hyperbole used to make it all provacative."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373194","commentId":2373194,"userName":"Some Sort","timestamp":1471549259,"content":"> I repeat a lot of points here, but I think I have a better handle on my thoughts.\n> \n> It may be true that Eowyn in a Dunhere deck is powerful. I was unaware of that deck and made clear that I was expecting new decks that would feature Eowyn as a quality choice. That was a major point of what I was saying, that she would create new archtypes.\n\n \n\nStaging area attack isn't a \"new\" deck type, though. It's an old one-- a very, very old one. One of the oldest deck archetypes on the block. It's just an archetype that had failed to keep up with the meta, and which Eowyn provides a strong shot in the arm to in order to bring it back up to date. But there are lots of different staging area attack decks. Pretty much anything on RingsDB with Hero Haldir or Dunhere. (I even built one that includes neither, and instead relies on Hama + Hands Upon the Bow.) And for pretty much every Staging Area Attack deck, Eowyn is the optimal hero. 4 willpower, 6 starting threat, access to Tactics.\n\n \n\nEnts aren't a new archetype, either. They've been around for a couple of cycles now. They're a very powerful archetype, though, and Eowyn at least gives TacMerry a strong argument for the best Tactics Hero in an Ent deck. (Personally, I give it to Eowyn, but I can see the argument that TacMerry + Fast Hitch + Rohan Warhorse + Treebeard = kind of sort of good.)\n\n \n\nMono-tactics definitely *is* a new archetype, and I think we're all on the same page that she's indispensable to it. It's only an archetype now because she exists.\n\n \n\nReally, there's nothing special or fancy about Tactics Eowyn. She doesn't need an \"archetype\". She needs a deck that would love to add four willpower for just six starting threat while also gaining Tactics access. Which is rather a lot of decks, because that is an absurd stat-line to threat ratio. She's the best stats-only hero released since Spirit Glorfindel, bar none. No, she's not as good as Glorfindel, but she's a solid second, and she comes with a positive bonus instead of a negative penalty.\n\n \n\nI would like to go back to my question, if you don't mind. There are ~80 heroes released right now. If you ranked all 80 from best to worst, where do you think Eowyn would fall? Obviously I'm not looking for an exact answer, but a rough range would go a long way towards letting all parties know whether we actually disagree or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373369","commentId":2373369,"userName":"dalestephenson","timestamp":1471554854,"content":"> Eowyn is not good as a power hero like Boromir or Gandalf. She doesn't have enough abilities to build around her. She is certainly a strong candidate for a solid support hero. Her 6 threat cost and 4 willpower make her great for that role. I am not sold that red is so great as a splash support color. Yes, obviously red is fun and worth playing and so forth, but the other colors seem stronger. Ussually when I splash red, which I do a lot, I don't add it as a support color so much as something more central. The distictiin is fuzzy. Anyway, whenever I do splash red I think Eowyn is a poor choice given how red has historically been used, but she is radically different, so she may be a good choice in a new approach to using red, something that utilizes low threat, etc. We haven't seen that yet so it is hard to say. I think the strider deck, the hobbits and ents, and perhaps Dunhere deck (haven't played it yet) will prove to be excellent decks. I hope so. Even if they are more like fun novelty decks, I fully expect somebody will come up with something more inventive later.\n\nIn a nutshell, you recognize that Eowyn's statistics are outstanding for a support hero, but you don't think tactics is a useful splash based on his historical usage.  I both agree and disagree.\n\n \n\nI agree that based on how a splash tactics has been used in published decks, TaEowyn is a misfit as a hero -- tactics has largely been used to pull in a specific hero, not a support hero.  The only other tactics quester is Thalin, and he's neither popular nor a good quester.\n\n \n\nOTOH, I don't think the sphere itself works against splash.  There's plenty of good stuff in the 2-or-less category.  Any deck that doesn't rely on chump blocking combined with swarm attacking can really benefit from tactics.  (And any deck at all can benefit from Honour Guard.)\n\n \n\nI'm not sure we need to wait to see if ent decks are powerful.  They seem plenty powerful to me, and I was under the impression that they were recognized as a very powerful tribe already.  You need tactics for their ents (and the powerful Boomed and Trumpeted), and TaEowyn seems to be the perfect hero to provide tactics for it.\n\n \n\nI appreciate you clarifying that your controversial statements were meant to be hyperbolic.  I presume that the implication you could replace TaEowyn in any deck and make it better was also hyperbolic?  I'm sorry you find my tone in disagreeing with hyperbolic statements to be off-putting, though I am curious why you would use hyperbolic language to be provocative if you find provoked responses unpleasant."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373383","commentId":2373383,"userName":"Slothgodfather","timestamp":1471555505,"content":">  \n> \n> I would like to go back to my question, if you don't mind. There are ~80 heroes released right now. If you ranked all 80 from best to worst, where do you think Eowyn would fall? Obviously I'm not looking for an exact answer, but a rough range would go a long way towards letting all parties know whether we actually disagree or not.\n> \n>  \n\n \n\nNow I want to sit down and try to rate them all to find out where I'd put her in the rankings, but a lot of this game and our perceptions of a heroes worth are based on our modes of play.   I haven't played solo in over a year now, so it is hard for me to examine a card with that mindset.  I always consider it in a 2 player mode with the expanded focus of a 4 player game.   Most of my games are 2 player, but there are plenty of 4 player ones as well.  So for me, cards get judged from a different mindset than - seemingly - most of the players here.\n\n \n\nThe other issue with ranking them is trying to actually find some numerical value of their abilities when they are so situational.   Sure, Dain is arguably the best hero in the game - provided you (and your fellows) bring enough dwarves to the field.   If he is your only one, then he is the worst. \n\n \n\nI think that is kind of the issue with Eowyn atm, because there is the mindset that tactics shouldn't even have WP, plus they still suck at it anyways, so she is a bad choice for a tactics player to pick, but I think she is one of the best heroes we've got for her flexability and sphere bleed.   In a 4 player fellowship group I'm playing in, I was using Spirit Eowyn, who is 200% better at questing that Tactics Eowyn, but me giving her up to the tactics player allowed that player to have an invested character in each phase, as opposed to only during combat.  I was running the support deck, so adding Snowmane to her was perfect in letting her add to the quest then ready for combat.  Eomer was her main attacker, and while he could typically manage the enemies as they came, Eowyn, who later got an Rohan Warhorse - was able to single handedly smash through some of our bigger enemies, leaving the rest for Eomer to ride down.\n\n \n\nThe trouble with judging most heroes, is it is pretty impossible to rate them in some perfect vacuum.  They each have their variations of stipulations as to when they are great, and when they are terrible.  SpGlorfindel was brought up earlier as an example of the perfect hero to just drop in and make any deck better.  To that, I completely disagree, from my 2+ player mindset.  Nearly any time I've played SpGlorfindel, he is simply standing during the combat phase and does absolutely nothing until my partner can grace me with a bow to give me ranged.  Just because Glorfindel has great stats, doesn't mean they actually get any use.  If you aren't fighting anything, than any hero with 4 WP is better than him, or a hero that offers resource acceleration like Arwen.\n\n \n \nAs for Ents, I think Mablung is the best hero to provide the tactics resource because, as Ents without any ranged, you will want to engage guys regularly.   But if you just run the Song, you could go with 2 tactics heroes and still use Eowyn.  Mablungs Gondor trait works well for defense.  \n\n>  \n> \n> I would like to go back to my question, if you don't mind. There are ~80 heroes released right now. If you ranked all 80 from best to worst, where do you think Eowyn would fall? Obviously I'm not looking for an exact answer, but a rough range would go a long way towards letting all parties know whether we actually disagree or not.\n> \n>  \n\n \n\nNow I want to sit down and try to rate them all to find out where I'd put her in the rankings, but a lot of this game and our perceptions of a heroes worth are based on our modes of play.   I haven't played solo in over a year now, so it is hard for me to examine a card with that mindset.  I always consider it in a 2 player mode with the expanded focus of a 4 player game.   Most of my games are 2 player, but there are plenty of 4 player ones as well.  So for me, cards get judged from a different mindset than - seemingly - most of the players here.\n\n \n\nThe other issue with ranking them is trying to actually find some numerical value of their abilities when they are so situational.   Sure, Dain is arguably the best hero in the game - provided you (and your fellows) bring enough dwarves to the field.   If he is your only one, then he is the worst. \n\n \n\nI think that is kind of the issue with Eowyn atm, because there is the mindset that tactics shouldn't even have WP, plus they still suck at it anyways, so she is a bad choice for a tactics player to pick, but I think she is one of the best heroes we've got for her flexability and sphere bleed.   In a 4 player fellowship group I'm playing in, I was using Spirit Eowyn, who is 200% better at questing that Tactics Eowyn, but me giving her up to the tactics player allowed that player to have an invested character in each phase, as opposed to only during combat.  I was running the support deck, so adding Snowmane to her was perfect in letting her add to the quest then ready for combat.  Eomer was her main attacker, and while he could typically manage the enemies as they came, Eowyn, who later got an Rohan Warhorse - was able to single handedly smash through some of our bigger enemies, leaving the rest for Eomer to ride down.\n\n \n\nThe trouble with judging most heroes, is it is pretty impossible to rate them in some perfect vacuum.  They each have their variations of stipulations as to when they are great, and when they are terrible.  SpGlorfindel was brought up earlier as an example of the perfect hero to just drop in and make any deck better.  To that, I completely disagree, from my 2+ player mindset.  Nearly any time I've played SpGlorfindel, he is simply standing during the combat phase and does absolutely nothing until my partner can grace me with a bow to give me ranged.  Just because Glorfindel has great stats, doesn't mean they actually get any use.  If you aren't fighting anything, than any hero with 4 WP is better than him, or a hero that offers resource acceleration like Arwen.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373636","commentId":2373636,"userName":"awp832","timestamp":1471563912,"content":"I was really surprised at reading through this topic,  while I agree with you on several points, we don't draw the same conclusions.\n\nLet me talk about spheres/ color bleed first.  Frankly I don't really see what all the fuss is about.  If any color needs a little bit of bleed, it's certainly Tactics.  If I want to make a Eowyn(t), Theoden(t), Merry(t) deck that quests for 11 out of the gate, what is wrong with that?  It's fun, it's crazy thematic,  it's certainly not overpowered.  I don't see why anybody has a problem with that just because they happen to think \"red shouldn't have willpower\".    If we could rewind time and carefully select the role of each sphere when we were printing every card, perhaps it would be a decent enough idea to aggressively avoid color bleed.    The cat is out of the bag now.  It's out of the bag, its running around the room knocking stuff out of your cabinets and clawing your face.  You are not going to fix color bleed by saying;  'okay,  so NOW we are going to really start restricting sphere roles'.  The way FFG is doing it is smart.   Give a few cards that bleed colors to each sphere, but just a few cards.  Let tactics have a little bit of willpower, but just a little.   Enough that they don't have to feel useless during an entire phase of the game.  If they want more, they will still need to splash.  If they're just fine with contributing 4 a turn,  let them have T Eowyn and call it good.  There's no harm in tactics having a little bit of willpower so long as the idea that it's focused on combat remains intact,  and I think that it does.  \n\nLet me provide one last bit of evidence for my point that color bleed really isn't a big deal.   If it was a big deal, if it really were true that one color could attack, defend, quest, all at the same time... we would see a TON of monosphere decks out there.   But we don't.  Actually we see the opposite of that.  We see tri-sphere all over the place, dual-sphere is common too, but hardly any monosphere decks at all except for niche decks like Caldara (spirit).\n\nNow let me get to what I really want to talk about;  Eowyn.  Actually I've used her quite a bit.  I think she's great.  I think she's really great as a matter of fact.  I think she's one of the best, most game-changing heros we've had for some time.  Her stats are good, her threat is low, she works for staging area attack (I guess), helps out with dagger of westerneese/merry, etc, that's already been discussed a lot.  She's got the Rohan trait which can be good for certain attachments  -meh,  don't even care.\n \nSo lets get to what really has me excited about Eowyn.  DAT OPG!!!!  I can not tell you how useful her once-per-game is as an ability.  How many times do you start with a difficult enemy engaged with you, or in the staging area, or you just draw one on your first quest phase and there is just nothing you can do about it?   It happens a lot.  Or even a moderately hard enemy that has an annoying ability.  It happens a lot.  Eowyn gives you the tools you need to deal with practically anything and she gives it to you right away.  Eowyn belongs in the category of heros like Ld Denethor who give you a good start.  What is the hardest, most win-or-lose part of this game?  The first couple of turns.  Eowyn gives you the ability to deal with the first big nasty that comes knocking on your door while you're still trying to get set up.  \n\nA perfect example is in the campaign mode at the battle of Pelinor Fields, you get a turn or so to set up and then what shows up to ruin your day?  The Wraith on Wings.  But with Eowyn he's no problem.  This son of a beast has 12 hp and 4 defense, but Eowyn can slam into him for 10 attack, if you've got Theoden with Snowmane and F-Aragorn who doesn't exhaust to quest (you did get the palantir, didn't you?) helping out, he's down.  One less problem to deal with. \n\nAnd that's just one example.  Hill Trolls?  Please.  Southron Companies in Into Ithilien?  Handled.  Orc Vanguard? Done.  Almost anything that you want to die, you have a freebie.  And all you have to do for it is raise your threat back up to the point it would be at if you didn't have Eowyn's discount.  I really feel this makes Eowyn an incredibly powerful hero to have on your team.\n\nEdited August 18, 2016 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373743","commentId":2373743,"userName":"JsBingley","timestamp":1471567161,"content":"Red was a four legged chair with 2 legs missing while blue seemed to have 5 legs.\n\n \n\nI agree with this.\n\n \n\nWhen you use Mono-Tac for solo, the normal mode becomes the nightmare mode, even some quest most for killing and quest card with Battle keyword.\n\n \n\nWhen solo a nightmare quest, adding a tac hero means nearly beaten at the setup phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2373819","commentId":2373819,"userName":"DukeWellington","timestamp":1471570600,"content":"@dalestephenson I explained in another post why I said it was off putting, the next post chronologically. I have zero problem with strong responses or with getting challenged. In fact I may be to fond of debate :-)\n\nEnts are good, but not top tier because they are too slow IMO. Even if it is an unquestionable power deck, Eowyn may prove to not be the best hero, or maybe she will be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2374071","commentId":2374071,"userName":"Some Sort","timestamp":1471583359,"content":"> @dalestephenson I explained in another post why I said it was off putting, the next post chronologically. I have zero problem with strong responses or with getting challenged. In fact I may be to fond of debate :-)\n> \n> Ents are good, but not top tier because they are too slow IMO. Even if it is an unquestionable power deck, Eowyn may prove to not be the best hero, or maybe she will be.\n\n \n\nEnts are only slow for the first turn or two. I've dug into the stats, and based on the costs of similar allies without negative effects, Ents are undercosted by about 1.4 resources. Getting two ents on the table is like saving an entire round's worth of resources. It's like if someone dropped a Legacy of Numenor on you without the accompanying threat game. Or, at least, it's like that as soon as your ents ready.\n\n \n\nOn turn 1, this is a problem. By turn 2, it's a much smaller problem, since you have that underpriced bit of work you dropped in turn one readying to help cover the lazy git you just dropped in turn 2. By turn 3 or 4, you've already made up the pace disadvantage, and everything after that just puts you further and further ahead in terms of tempo. (Aside: if you include ally readying, whether in the form of Gandalf/Narya or Leadership Faramir, even this meager tempo hit doesn't apply.)\n\n \n\nSo I'd say Ents are pretty clearly a power-archetype whose biggest deckbuilding constraint is figuring out how to survive the first two turns until your army wakes up. Which is why I think T'Eowyn is pretty clearly the best hero for the archetype, because she's MRS. \"Survive the first two turns\". Like I said, she's questing for 4 and attacking for 10 in round one without a single other card on the table. (Or skipping the quest and attacking for 10 twice.)\n\n \n\nTactics Merry was the old standby for the Ents, but Tactics Merry is the ultimate \"win more\" card in that deck. Once your Ents are already roused, Merry can get them extra attacks, but he doesn't do anything about the wait for them to wake up. Slothgodfather mentions Mablung as another good Ent hero, and while I'll never argue too hard against Mablung, (I think he's a top-3 hero in Tactics and a top-10 hero overall), I think the whole point of the Ents is they're already extremely resource-efficient, but that efficiency is offset by action disadvantage. So I think they're better served by a hero who mitigates that action disadvantage than one who further piles on resources.\n\n \n\nBut that's just my take on the archetype; I don't think it'd be too difficult to build a truly wicked Mablung/Ent deck, either. I'd rank him 3rd for the archetype, or maybe even 2nd over Merry depending on who my other heroes were, what my starting threat looked like, and how much that starting threat mattered for the quest I was playing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2375672","commentId":2375672,"userName":"Lecitadin","timestamp":1471651971,"content":"I'm now trying to beat the Pelennor quest from the Flame of the West saga in pure solo, and it's quite difficult. I want to build a thematic full Rohan deck, and in mymmind, it makes more sens to use spirit Eowyn and Theden than tactics Eowyn and Theoden. \n\n \n\nWhy? Because the spirit Rohan allies are way more effective than the tactic ones and Theden makes them super affordable, and spirit Eowyn, with Elven light, can give you access to good card draw.\n\nI think that tactics Eowyn will be even cooler with a pure solo 2 heroes deck, or maybe she can be more useful in a 2 handed deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2375676","commentId":2375676,"userName":"Gizlivadi","timestamp":1471652185,"content":"> I'm now trying to beat the Pelennor quest from the Flame of the West saga in pure solo, and it's quite difficult. I want to build a thematic full Rohan deck, and in mymmind, it makes more sens to use spirit Eowyn and Theden than tactics Eowyn and Theoden. \n> \n>  \n> \n> Why? Because the spirit Rohan allies are way more effective than the tactic ones and Theden makes them super affordable, and spirit Eowyn, with Elven light, can give you access to good card draw.\n> \n> I think that tactics Eowyn will be even cooler with a pure solo 2 heroes deck, or maybe she can be more useful in a 2 handed deck.\n\n \n\nWhat 3rd hero are you using with Theoden and Eowyn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2375684","commentId":2375684,"userName":"Lecitadin","timestamp":1471652792,"content":"With spirit Eowyn and Theoden, it would be Eomer, that benefits from the Rohan ally discarding mechanic. Nothing new here, but I tried to do it with one spirit Rohan hero and tactics Eowyn and Theoden, but it donesn't work very well (weak card draw and questing, plus some too expensive tactics Rohan allies).\n\nEdited August 20, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2375697","commentId":2375697,"userName":"Gizlivadi","timestamp":1471653677,"content":"I think that if you're going the Rohan ally route, with Háma, Escort, Gamling, Spirit Théoden is better, yeah. Also, Elven-light synergizes with Eowyn, even though I think Arwen might be better that Eowyn as you can get 1 extra resource at the cost of 2 willpower, which with all the allies should not be an issue (and with that extra resource you can get your main allies way faster). You'd be breaking theme though.\n\n \n\nI still really want to try mono-Tactics with Eowyn and Theoden though, I think the general idea of Some Sort's deck that uses Elven-light and Háma should be pretty powerful. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2376351","commentId":2376351,"userName":"Lecitadin","timestamp":1471710345,"content":"I'm trying my Rohan deck with Flame of the West, so Arwen would break theme, like you said, but of course, Arwen hero is so good that she could fit in almost any spirit deck!\n\n \n\nI will try a mono sphere tactics deck but with tactics Aragorn, to give him his toys to boost the questing.\n\n \n\nAnd tactics Eowyn will probably make pure solo tactic decks more viable (and be interesting to try such a deck against nightmare quests!).\n\nEdited August 20, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2378826","commentId":2378826,"userName":"dr00","timestamp":1471883584,"content":". \n\nEdited August 28, 2016 by dr00"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2387792","commentId":2387792,"userName":"Lecitadin","timestamp":1472316992,"content":"I've been using her automaticaly now if I build a deck with Tactics (pure solo decks), I really like her.\n\nWith my lastest Ents deck, with her 9 attack ability, it can be quite ridiculous!!! http://ringsdb.com/decklist/view/2603/to-catch-an-orc-nightmare-mode-crusher-1.0 [http://ringsdb.com/decklist/view/2603/to-catch-an-orc-nightmare-mode-crusher-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227890-thoughts-on-tactics-eowyn/?do=findComment&comment=2399060","commentId":2399060,"userName":"Boris_the_Dwarf","timestamp":1472997960,"content":"Read through the OP but not much else. I don't think the new Eowyn sucks. On the contrary, I think she opens up Tactics for solo play in a way that was needed. More importantly, it gives Spirit/Tactic decks a place in the game rather than having to go Spirit/Lore. Instead of going after healing and good attack Lore allies like the one that ignores defense when it attacks alone, Frankly, creating an opportunity to add cheap weapons and armor instead of healing reduces the need for healing even more, which IMO is a good thing.\n\n \n\nAlso, I'm not sure comparing this game to Magic is completely fair, either. At least, not in terms of a color wheel. The mechanic for playing cards in this game is incredibly prohibitive. You can't play a 3-cost tactics card from your hand on the first turn if you only have a single tactics hero on your team.\n\n \n\nThe game did skew toward Spirit in the beginning because the designer(s) undervalued the importance of willpower. Willpower is, in most cases, how you win. Creating keywords like Siege and Battle were meant to give high-attack characters in other spheres a place but it just wasn't getting the job done. Those scenarios created alternate deck designs, designs that had to be shelved when playing the more traditional scenarios. The solution, ultimately, is to finally add characters with high willpower to the other spheres. Because it's the most important attribute in the game.\n\n \n\nSpirit Eowyn is still superior, as it should be, but Tactics Eowyn has a place in the game because it opens up deck design in a whole new way. No longer is Tactics the \"second player\" sphere. I'm looking forward to a solo deck design with Tactics in its rightful place without having to be gimmicky."}]}