{"url":"https://community.fantasyflightgames.com/topic/227838-over-hill-and-under-hill-gandalf-narya-and-sphere-of-influence-question/","title":"Over Hill and Under Hill Gandalf, Narya, and Sphere of Influence Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/227838-over-hill-and-under-hill-gandalf-narya-and-sphere-of-influence-question/?do=findComment&comment=2368987","commentId":2368987,"userName":"Levanthalas","timestamp":1471375739,"content":"Hey guys.\n\n \n\nI love coming up with fun, if sometimes ridiculous ideas for ways to play. One question I ran into regarded OHaUH Gandalf, Narya, and his presence in a sphere of influence.\n\n \n\nFor example, I know that Sword-Thain can only be played on an ally which belongs to a sphere of influence, and therefore Gandalf would normally not be a valid target for that attachment.\n\nHowever, if Narya is attached to Gandalf, he \"gains the leadership resource icon.\" \n\n \n\nIn the rulebook, it says that resource icons \"indicate the sphere(s) of influence\" the card belongs. Additionally, most people seem to agree that for cards such as Burning Brand, a Song of Wisdom attached to a hero is sufficient for them to count as a Lore character, and thus be valid targets for attaching Burning Brand.\n\n \n\nSo, in summary, does attaching Narya to Gandalf make him belong to the Leadership sphere of influence? And therefore a valid target for Sword-Thain or any other Sphere-restricted attachments, i.e. Mariner's Compass (Don't think I would ever use Compass on such a powerful ally, but as an example)\n\n \n\nThis is a very unique set of circumstances, as nothing else in the game can give an ally a resource icon, so I'm looking for opinions, thoughts, or insight on wording I haven't noticed.\n\n \n\nThanks for opinions guys!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/227838-over-hill-and-under-hill-gandalf-narya-and-sphere-of-influence-question/?do=findComment&comment=2369029","commentId":2369029,"userName":"cmabr002","timestamp":1471376772,"content":"This combination is legal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227838-over-hill-and-under-hill-gandalf-narya-and-sphere-of-influence-question/?do=findComment&comment=2369053","commentId":2369053,"userName":"Kakita Shiro","timestamp":1471377219,"content":"Of course by making him a Sword-thain, you're losing out on Gandalf's sick stat line when he uses Narya on himself (5 Atk, 5 Def). Just because you can do something doesn't always mean you should ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/227838-over-hill-and-under-hill-gandalf-narya-and-sphere-of-influence-question/?do=findComment&comment=2369067","commentId":2369067,"userName":"Levanthalas","timestamp":1471377654,"content":"cmbar: Exciting to know someone else agrees with my thoughts.\n \n\nKakita: Oh yes, that is one of my favorite things to do, especially with Shadowfax attached. Expensive, but very effective in a deck with threat reduction. Was simply looking for a new way to play with everyone's favorite Wizard.\n\n \n\nThanks for the thoughts guys, and I'm excited to see what other people may say."}]}