{"url":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/","title":"Your Saga Campaign So Far","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2378444","commentId":2378444,"userName":"PsychoRocka","timestamp":1471870650,"content":"I haven't seen one of the \"Your Saga Campaign so far\" sort of posts we normally get after new Saga Boxes so thought I would share mine and I hope that you all will share yours if you have beaten this new saga box in campaign play. Anyway here is mine as well as a fair few notes at the end on my overall thoughts on the Saga Campaign quests and new Box especially as well as the performance of my two decks while playing the saga campaign:\n\nTHE LAST ELVEN HOST - TWO HANDED SAGA CAMPAIGN\n \nThe Grey Company: Aragorn (T), Elladan and Elrohir\n*(Legolas is used instead of Aragorn (T) in quests that feature fellowship Aragorn or in quests you cannot use Aragorn)\n32 Starting Threat\n \nLine of the Half Elven: Elrond, Galdor of the Havens and Arwen\n31 Starting Threat\n\nOld Scoring System used (Number of Rounds does not affect score)\n \nQUEST 1 - A Shadow Of The Past\nScore: 63\nCampaign Pool Choices:\nBoons: Mr. Underhill (attached to Frodo during setup)\nBurdens: The Ring Draws Them (shuffled into encounter deck)\n \nQUEST 1.1 - The Old Forest\nScore: 91\nCampaign Pool Choices:\nBoons: None. Did not place enough damage on Old Man Willow to earn Old Bogie-stories.\nBurdens: -\n \nQUEST 1.2 - Fog on the Barrow Downs\nScore: 69\nCampaign Pool Choices:\nBoons: Ho, Tom Bombadil! (added to the first players hand during setup)\nBurdens: -\n \nQUEST 2 - A Knife In The Dark\nScore: 75\nCampaign Pool Choices:\nBoons: Valiant Warrior (attached to Elladan during setup), Noble Hero (attached to Galdor during setup)\nBurdens: -\n \nQUEST 3 - Flight to the Ford\nScore: 63\nCampaign Pool Choices:\nBoons: -\nBurdens: Eaten Alive! (shuffled into encounter deck)\n \nQUEST 4 - The Ring Goes South\nScore: 93\nCampaign Pool Choices:\nBoons: Glamdring and Anduril (shuffled into player decks during setup). Sting and Mithril Shirt are not helpful or advantageous to my play style so are not being used.\nBurdens: -\n\n \n\nQUEST 5 - Journey in the Dark\n\nScore: 82\n\nCampaign Pool Choices:\nBoons: -\nBurdens: Pursued by the Enemy (shuffled into the encounter deck during setup), Overcome by Grief (added to the staging area during setup)\n*Only have to take two burdens as the Balrog was not in play and never entered play as I escaped Moria before he could catch up to me and appear.\n*Ho, Tom Bombadil used to cancel a copy of Fool of a Took! to avoid the Balrog appearing. Managed to beat the quest right as the last counter was removed from Doom, Doom, Doom (as always!) so this was entirely necessary to avoid the fight with the Balrog and having to sacrifice a hero or having to take all four burdens instead.\n \nQUEST 6 - Breaking of the Fellowship\nScore: 60\nCampaign Pool Choices:\nBoons: Phial of Galadriel and Three Golden Hairs (both attached to a hero of the first players choice during setup)\nBurdens: Ill Fate (shuffled into the encounter deck)\n\n*By exploring Seat of Seeing I was able to remove Overcome by Grief from the campaign pool.\n\n*Elladan and Galdor are taken captive for the purposes of the next quest\n\n \n-Hero Change/Addition-\nTactics Aragorn needs to come out to make room for Fellowship Aragorn. Legolas hero is added to The Grey Company to replace him and will remain there for the remainder of the campaign as I will either be using Fellowship Aragorn or will not be allowed to use Aragorn until the end from this point. I am still able to keep StwB and Roheryn in my decks for certain quests because they can still be used on the Fellowship version of Aragorn to great effect.\nThe ally version of Legolas in The Grey Company is replaced with x1 Arod (for the hero version).\n \nQUEST 7 - The Uruk Hai\nScore: 64\nCampaign Pool Choices:\nBoons: Forewarned (on Elrohir) and Leader of Men (on Elrond)\nBurdens: -\n*Had 23 pursuit allowing me to earn the two burdens.\n\n \n\nQUEST 8 - Helms Deep\nScore: 84\nCampaign Pool Choices:\nBoons: -\nBurdens: -\n\n*Beat it starting on stage 2A so avoided Poisoned Counsels\n\n \n\nQUEST 9 - Road to Isengard\n\nScore: 87\n\nCampaign Pool Choices:\n\nBoons: Palantir of Orthanc (attached to Fellowship Aragorn during setup)\n\nBurdens: -\n\n*Narrowly avoided earning Voice of Saruman as both decks had 4 cards in hand at the end!\n\n \n\nQUEST 10 - The Passage of the Marshes\n\nScore: 83\n\nCampaign Pool Choices:\n\nBoons: -\n\nBurdens: +2 starting threat for each deck for the rest of the campaign\n\n*Decided to take the +2 starting threat for each deck rather than take the copies of The Searching Eye. Still have Three Golden Hairs to offset this as well as drawing 3 cards for each deck in an especially nasty quest.\n\n*Copies of StwB replaced with Fellowship Card \"Fellowship of the Ring\" to achieve a less potent but similar willpower boost. Roheryn simply removed from the deck as the deck is 51 cards to begin with (not including boons of course).\n\n \n\nQUEST 11 - Journey to the Cross-Roads\n\nScore: 64\n\nCampaign Pool Choices:\n\nBoons: -\n\nBurdens: -\n\nEnemies placed under The Black Gate: x1 Man of Harad\n\n*No copies of Brace of Conies earned as I took the +1 resource to all heroes instead.\n\n*Managed to avoid all but one enemy being placed under the black gate by constantly optionally engaging enemies and using direct damage effects, location engagement effects and always choosing the option on treacheries that does not place an enemy under the black gate.\n\n \n\nQUEST 12 - Shelob's Lair\n\nScore: 67\n\nCampaign Pool Choices:\n\nBoons: -\n\nBurdens: A Heavy Burden earned. Unavoidable. (attached to Ring Bearer during setup)\n\n \n\nQUEST 13 - The Passing of the Grey Company\n\nScore: 92\n\nCampaign Pool Choices:\n\nBoons: The Army of the Dead (Put under the first players control during setup.)\n\nBurdens: -\n*Avoided earning any copies of Overcome by Fear by having none attached at the end of the game.\n\n \n\nQUEST 14 - The Siege of Gondor\n\nScore: 87\n\nCampaign Pool Choices:\n\nBoons: -\n\nBurdens: -\n\nNumber of resources on The Corsair Fleet: 7\n\n*The Army of the Dead removed from the campaign pool\n\n \n\n \n\nQUEST 15 - The Battle of the Pelennor Fields\n\nScore: 59\n\nCampaign Pool Choices:\n\nBoons: -\n\nBurdens: 2x Wraith On Wings (added to staging area during setup). Unavoidable.\n\n*Used Phial of Galadriel during a critical round to reduce the attack of 4 enemies allowing me to avoid damage as well as take undefended attacks of 0 attack strength. Would have lost without using it at that point.\n\n \n\nQUEST 16 - ???\n\nScore:\n\nCampaign Pool Choices:\n\nBoons:\n\nBurdens:\n\nLosses:\n\n \n\nQUEST 17 - ???\n\nScore:\n\nCampaign Pool Choices:\n\nBoons:\n\nBurdens:\n\nLosses:\n\n \n\n \n\nQUEST 18 - ???\n\nScore:\n\nCampaign Pool Choices:\n\nBoons:\n\nBurdens:\n\nLosses:\n\n \n\nCampaign Pool:\n\nBoons: Palantir of Orthanc (attached to Fellowship Aragorn during setup). Forewarned on Elrohir, Leader of Men on Elrond, Noble Hero on Galdor and Valiant Warrior on Elladan (all attached during setup). Three Golden Hairs (attached to any hero during setup). Anduril and Glamdring (shuffled into player decks during setup).\n*Ho! Tom Bombadil used during Journey in the Dark to cancel Fool of a Took\n*Mr. Underhill removed from the campaign pool due to the campaign effect that does so at a certain point\n*Phial of Galadriel used during Battle of Pelennor Fields to reduce the attack of several enemies\n \nBurdens: The Ring Draws Them, Eaten Alive, Pursued by the Enemy and Ill Fate (shuffled into the encounter deck during setup). A Heavy Burden (attached to Ring Bearer during setup).\n+2 starting threat for each deck for the rest of the campaign (instead of copies of The Searching Eye).\nx2 Wraith on Wings (added to the staging area during setup).\n*Seat of Seeing explored to remove Overcome by Grief from the campaign pool\n \n\n \n\n \n\n \n\n \n\nOverall Notes and Thoughts:\n\nMost quests have taken at least a few attempts and some have taken several but overall the decks are performing extremely well. Helms Deep as always was epic and I managed to beat it without reaching stage 4 and without as much trouble as it usually takes to beat. Similarly Journey into the Dark was beaten without the Balrog arriving on the third attempt. This was fairly expected however as I have done it several times in the past now and always use up Tom Bombadil to assist me in doing so. The Uruk Hai and the Passage of the Marshes were some of the quests that actually proved harder than expected this time round. Uruk Hai is always some what tough for my decks though as they rely on each other and each and every hero combined to really destroy a quest and without two key heroes the decks really struggle. This time round was a nightmare though and this quest took far more attempts than Journey in the Dark. Passage was just a pain and I had very unlucky games with many nasty mire effects triggering without me being able to do much about it, this resulted in me conceding once and threating out twice.\n\n\nQuests I had the most fun playing were definitely Helm's Deep, A Knife in the Dark, Breaking of the Fellowship and Battle of Pelennor Fields. Helm's Deep is just such an epic quest that it is always fun even when it is stressful and frustrating as well. Just seeing that final quest stage appear is such a relief and such an awesome moment. You get to rain absolute hell on the enemies unlucky enough to still be in play now that you don't have to exhaust ANYONE to quest and keep them back anymore. The fact I managed such a great win on only my second attempt made the victory that much sweeter and I also managed to hang onto both Phial of Galadriel and Three Golden Hairs. Normally I use at least one of the two to get my eventual win on Helm's Deep.\nA Knife in the Dark similarly is just always fun due to the showdown with the Witch King and the Nazgul at the end. It is sort of the first big boss of the campaign as well because Old Man Willow is both optional and escapable without having to actually defeat him and there is no boss in A Shadow of the Past or Fog on the Barrow Downs. Also using Tactics Aragorn to wipe that smirk right off Bill Ferny's stupid face is always good fun.\n\nBreaking of the Fellowship is normally a quest that isn't as much as fun as others are for me. It gets tedious towards the end with the seperate staging areas. As well as that Seat of Seeing is extremely missable but I am always determined to get a win where I also explore Seat of Seeing which leads to me replaying the quest until I do. There is also plenty of threat increase and other various effects to constantly keep track of (locations moving around staging areas, separate staging areas, so much archery like almost as much as Helm's Deep etc) and it is just an all round punishing quest for someone who plays with real cards and also plays two handed. This time however I had an absolute blast with this quest. It was mainly due to the fact that I demolished it first turn and although I missed Seat of Seeing as a shadow card at first, because I had such an intensely strong board state set up with both decks by the end I was able to wait until the encounter deck shuffled itself and then it luckily appeared pretty quickly the second time around not as a shadow card but as a reveal during staging! I was able to clear it and the final quest stage in the same final turn. Tactics Aragorn was an absolute beast in this quest and with Anduril, Dagger of Westernesse and UC (with Halbarad ally boosting Dagger) he was able to take out many foes on his own including right after defending by using Anduril's ability. With 6 attack (and -1 to their defense) he was easily able to slay most Uruks even with their nasty Toughness.\n\nThoughts on the new Saga box:\nPassing of the Grey Company is tense just like it should be. Threat is raised constantly and by constantly I mean by almost every single encounter card that appears. Everything raises your threat in one way or another or alternatively attempts to attach Overcome by Fear to your threat dial which is possibly even worse. I have only played this quest once considering I beat it first go but I did so by the skin of my teeth with both decks on 45 threat. I used many threat reducing effects while copies of Overcome by Fear were not attached to threat dials and I even had to clear a copy of Gather Information to get Greeting and Gandalf so both decks didn't threat out at one point! I took some extremely risky attacks in the last few rounds and even had to take some undefended attacks while at the Stone of Erech (luckily this resulted in damage on heroes instead of threat otherwise I would have threated out and lost! Honestly this effect at the end is probably far more of a bonus to the players than it is a detriment). I only just manged the win and it felt very thematic and fitting. I left several enemies in play and had to pretty much all out quest on the last turn to win as certain effects on encounter cards in this quest can seriously slow you down or increase threat very quickly so I knew that if I did not do this there was a very good chance I would lose on the following turn or two. I focused all my offensive effort on the Army of the Dead over the course of two turns (which wasn't very much as most characters that are usually used for combat were on questing duties instead) and managed to destroy it which was an immense boost to the following quest. Overall I enjoyed the quest though I could definitely see it being quite frustrating to beat for certain decks. I was actually surprised I was able to beat it first attempt with decks that had 33 and 31 starting threat (both increased by +2 instead of taking copies of The Searching Eye) but that was only because I managed to use plenty of threat reduction and sped through with high willpower. I'm sure next time this one will probably give me a lot of grief and will take many attempts to beat.\n\nThe Siege of Gondor is actually a pretty decent quest and was probably better than I expected it to be. That being said I was anxiously trying to beat it as fast as I could so that I could finish it with as few counters on The Corsair Fleet as possible so that Battle of Pelennor Fields would be more manageable and this led to me enjoying it slightly less than I probably should have. I was just rushing to finish this one and didn't take the time to appreciate the quest itself. It is a fairly straight forward quest but **** does it get tough when damage has really stacked up on characters and you have to start revealing extra encounter cards instead of placing damage from the effect on The Corsair Fleet. It can be hard to quickly clear three boats and then the final boat as the encounter deck throws out some nasty effects and direct damage or the staging area fills with non-boat locations with nasty effects that you want to travel to that will also slow you down..\nEssentially this quest is all about choices and just how far you can push things before you lose or get to the finish line. The longer you take the harder Battle of Pelennor Fields will be but the faster you go the more nasty effects you suffer (Driven to the Brink treachery, Nastier effects on enemies while the active location is a ship, nastier shadow cards if the active location is a ship and even nasty effects on the ship locations themselves when you travel to them). As thematic as this is and as well as this has been captured in the mechanics of this quest as well it makes this quest my least favorite of the three and the least memorable.\nI also didn't beat it as quickly as it is possible to and it took me seven turns which was quite a while to wait for Aragorn (especially since counters don't come off during stage 1 in Pelennor Fields as there is no quest phase) for Aragorn to appear in Pelennor Fields to be honest and many times I would be on the brink of defeat right as the last counter or two was about to be removed so doing this quest faster would have benefited me greatly but I thought I did a decent job and the quest isn't exactly a cake walk. Army of the Dead was integral but honestly due to the fairly lackluster enemies (enemies are easily the weak point of the scenario the treacheries, locations and The Corsair Fleet objective card are all super nasty and the enemies are extremely tame) it was used to quest for a bonus 4 willpower on pretty much every single round.\n\nThe Battle of Pelennor Fields is easily my favorite quest of the three and I spent the most time playing this one because of how many attempts it took to beat. To me it is like a much better version of Helm's Deep as it is very similar but better designed and although it is possibly a little harder I found that most of my losses were quite late game which meant I still had a lot of fun playing and the losses were easier to ignore. There were far fewer false starts although you need insanely good starting hands to even stand a chance against this one so I did perform many mulligans and scoops until I had decent staring hands to play each game with.\nIt is an extremely tense game and there are many moving pieces that I admittedly messed up on my first attempt and I had to end the game because of this three quarters of the way through. Once you get used to the encounter deck though (the rules insert tip about most effects taking place at the beginning of the quest phase or end of the turn is actually such an amazing tip) and know all of the effects well it is not as bad as many other quests that have as many if not more moving parts. Grond is just awful and you need to travel there AS SOON AS POSSIBLE.. cannot stress that enough. The eventual win I got was almost entirely because I cleared Grond so quickly. There was 46 damage on Minas Tirith (4 off defeat) and Grond was on 2 tokens already so another 2 turns of it being in play would have lost me the game. As awful as those witch king attacks are you need to travel there as soon as you feasibly can and honestly those witch king attacks are far worse on stage 5 when he is making another 2 attacks against the first player each turn already....\nThe Witch King himself is an absolute beastly boss and easily one of the hardest and coolest we have seen in the saga campaign and Aragorn and Banner of Elendil were absolutely key to taking him down with his 7 defense 14 health and his ability that stops ranged attackers helping. Aragorn's boost can easily give you another 5 or so damage when you attack with several strong attackers and that was how I was able to one hit him. I had many games where he struck absolute terror into both my decks and slaughtered many characters or in a few games that I managed to kill him he had held me up long enough for Minas Tirith to fall a turn or two later. The Mumakil in this quest are fairly brutal but because of the fact they give -4 threat to each player when killed and also contribute 4 progress to Stage 3 when killed they are actually not so bad. I love the design of stage 3 as my decks are great at killing multiple enemies per turn so they are fairly good at getting through stage 3 at a decent or even fairly quick pace. This allows me to get to stage 4 and then take out the remaining Wraith on Wings (I am normally able to defeat one in combat) as a result of stage 4's mechanics when playing progress and placing it as damage on enemies instead.\nReally love this quest and it felt as epic and thematic as I hoped it would be. The only possibly complaint would be a little more diversity between enemies in the quest and I would have loved to have seen a few extra enemy designs in this quest such as an Olog-Hai enemy (perhaps similar strength to the Mumak but has one of the various troll effects instead of archery but has the threat reduce and can only take 3 damage per turn effects as well), a Variag of Khand enemy (another great opportunity to include something that is only briefly mentioned in the texts, Mordor Uruks (we only see normal Orcs in this quest..) or a great beast/beast of burden or even warg rider enemy (I know we have seen a million of these but we could have gotten a really epic captain version or something). Other than this the mood and mechanics of the quest are absolutely perfect and I couldn't have asked for more. Very excited for what the last box has in store for us for the last leg of this journey!\n \nOne last thing, the boons and burdens in this final quest are fairly unique. I actually love the design of Wraith on Wings but really hate the two boons.\nWraith on Wings is just nasty and will now sit in our staging area at the beginning of all three of our last quests until we engage and combat them when we are either able to or can no longer take the extra threat in staging.\nTheir huge amount of hitpoints and high attack are a nasty combination and they stick around unless you dedicate quite a bit of attack power towards destroying them.\nThe boons however..... do absolutely nothing WHATSOEVER if you run deck/s that have no gondor or rohan characters.... Elven decks, dwarf decks, hobbit and dunedain decks and others that don't run any of these traits get absolutely no boost whatsoever from these two boons. They are extremely thematic don't get me wrong but **** does it suck that they do nothing whatsoever for my decks..\n \nVague Game Plan for Final Saga Box:\n-I managed to save Three Golden Hairs and plan to use this on whichever of the last three quests is the most threat intensive for some respite and card draw.\n-With fairly high starting threat on both decks already I am most likely going to be exhausting the ring-bearer on the majority of rounds in the quests he is used in due to the effect on A Heavy Burden rather than taking the threat gain and will have to get along without his willpower.\n-As always making sure that I avoid any new burdens that are avoidable and making sure I earn any final boons that might appear in the final box (I doubt there will be any final boons though).\n-Depending on how difficult it is or even just for fun when I get to the quest that features the Battle of the Morannon I might make a hero change of Legolas for Tactics Boromir so that on one of the final critical rounds when many enemies are engaged I can use his first ability to destroy/weaken every enemy engaged and then potentially use his second ability to finish off any enemies on low hitpoints as well. Due to it being right at the end of the campaign it doesn't matter if I finally allow a hero to die and be included on the list of Fallen Heroes. Although it includes a nasty score penalty and whatnot it would still be really fun to pull off or perform efficiently/to an extent that it is worth it. It would almost be like a very cool alternative imagining of Boromir's great sacrifice in my version of the story, Boromir making it all the way to the battle of Minas Tirith (mainly due to not being included in the fellowship) and making a final noble stand at the Battle of the Morannon during which he dies whilst destroying innumerable foes.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2378543","commentId":2378543,"userName":"Lecitadin","timestamp":1471874322,"content":"Yep, The Battle of the Pelennor Fields is super tought in pure solo.\n\nAfter a few tries with different decks, I beat the Flame of the West quests with a rush Gondor deck, with Denethor Leadership, Boromir Leadership and Erestor. I know it's not 100 % thematic, but it's the only way I found to beat Pelennor feilds..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2378838","commentId":2378838,"userName":"Calvadur","timestamp":1471883999,"content":"Cool write up. But I think there will be one last boon in the final box, just because there has always been at least one. But I expect something on the level of brace of conies, that you can easily miss or trade for a one time Advantage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2410978","commentId":2410978,"userName":"tomtom","timestamp":1473707340,"content":"Yeah, really cool; fragment about Helm's Deep really broke my heart. I'm currently replaying Saga taking notes and everything (with another cool writeup in mind) , but am stuck for about a month in this Rohan sh*thole trying to avoid Poisoned Counsels. I must say this is an example of quest perfectly designed to wreck your nerves, because every time I fall just short of winning there's a feeling that I was exactly one ally short of that. Not counting myriad of tries when two quick Nights Without End on stage 2A end my futile, hopeless attempts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2411113","commentId":2411113,"userName":"banania","timestamp":1473711012,"content":"How do you get to attach the Palantir to Aragorn during setup? :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2411142","commentId":2411142,"userName":"GrandSpleen","timestamp":1473711898,"content":"I made the same mistake.  It took me until the end of Battle of Pelennor Fields to realize it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2411157","commentId":2411157,"userName":"banania","timestamp":1473712270,"content":"I asked because I made the same mistake too, the card read \"attach to Fellowship Aragorn\" but not as part of a setup action, so the player have to shuffle the boon into his deck, hope to draw it and play it. I even implemented the error it on the Online Campaign Log, until I realized (a few weeks ago when playing the newest expansion) I was bing wrong, so I hope I'm not responsible for psychorocka's mistake.\n\n \n\nI should say two things about that Palantir:\n\n- it really should be a setup action and it's on my mind to totally house-rule it\n\n- but in that case, the new Fellowship Aragorn would be very good right from the start, without even threat-paying and resource-paying for Anduril, and I'm not sure how healthy that would be for the scenarios diffculty after Treason of Saruman\n\nEdited September 12, 2016 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2411562","commentId":2411562,"userName":"PsychoRocka","timestamp":1473729544,"content":"Wait what..?\n\nEven though it is one use only and costs zero anyway you don't get it during setup....?\n\n \n\nYeah wow I totally missed this as well and just assumed/because the campaign log also says to do this I didn't even notice that nowhere does it say Setup or Permanent.\n\nWell I used it towards the very end of the game that I did win so I'm going to just assume I would have drawn it anyway, also it didn't really help THAT much playing two handed it just made one of the final rounds a little bit easier.\n\nI really think you should get the Palantir from setup to be honest... it is one use only and isn't the most powerful thing ever either; it just allows you to reveal one less card during staging on one round. Like others have said it is just a free Gildor's Counsel. If we are this far along in the campaign I don't see the harm in a one use only Gildor's Counsel we get from setup onwards for the last two boxes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2411579","commentId":2411579,"userName":"GrandSpleen","timestamp":1473730088,"content":"It isn't even free, as it costs an Aragorn exhaustion and it can whiff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2412389","commentId":2412389,"userName":"PigsAreOurEquals","timestamp":1473781521,"content":"I never understood it as one use. In my view it turns Aragorn into Henamarth Riversong.\n\nThe card text says:\" you may add ... to  the victory display ... \"\nIf you choose never to use this option you can simply look at the top card of the encounter deck.\n\nPalant%C3%ADr-of-Orthanc.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Treason-of-Saruman/Palant%C3%ADr-of-Orthanc.jpg]\n\nYou can still debate if that is worth the deck space but at least in solo-play Henamarth has saved my **s several times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2412498","commentId":2412498,"userName":"dalestephenson","timestamp":1473785370,"content":"But it says to discard the top card of the encounter deck, which makes it near-worthless as a scrying power.  (Shadow of the Past could put it back)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2412529","commentId":2412529,"userName":"PigsAreOurEquals","timestamp":1473786590,"content":"Ah yes, I missed that. Thanks for pointing it out dalestephenson."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2412547","commentId":2412547,"userName":"Authraw","timestamp":1473787089,"content":"You could use it in conjunction with Henamarth as a kind of combotastic LoDenethor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2413349","commentId":2413349,"userName":"NathanH","timestamp":1473832640,"content":"I include it just as a free way of boosting the new Aragorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2413362","commentId":2413362,"userName":"GrandSpleen","timestamp":1473833644,"content":"I'll just post the most recent scenario results and my current campaign pool.\n\n \n\nPassing of the Grey Company\n\nDeck 1: Gimli, Eowyn (Tactics), Beravor\n\nDeck 2: Amarthiul, Elfhelm, Beregond (Spirit)\n\nBoons earned: Army of the Dead\n\nBurdens earned: None\n\n \n\nThe Siege of Gondor\n\nDeck 1: Gimli, Elfhelm, Amarthiul\n\nDeck 2: Eowyn (Spirit), Beregond (Spirit), Beravor\n\nBoons earned: None\n\nBurdens earned: None\n\nRemoved from Campaign Pool: Army of the Dead\n\nResources on The Corsair Fleet: 5\n\n \n\nThe Battle of the Pelennor Fields\n\nDeck 1: Gimli, Eowyn (Tactics), Beravor\n\nDeck 2: Amarthiul, Elfhelm, Beregond (Spirit)\n\nBoons earned: None\n\nBurdens earned: Wraith on Wings x2\n\nRemoved from Campaign Pool: Three Golden Hairs\n\n \n\nCurrent Campaign Pool\n\nBoons\n\nSkilled Healer (Sam), Tireless Ranger (Fatty), Anduril, Sting, Glamdring, Mithril Shirt, Leader of Men (Aragorn), Intimidation (Gimli), Palantir of Orthanc, Old Bogey-Stories, Brace of Coneys x1 (my deck), Esquire of Rohan (Gimli), Esquire of Gondor (Eowyn)\n\nBurdens              \n\nShadow of Fear, Overcome by Grief, Ill Fate, Saruman’s Voice, A Heavy Burden, +2 threat penalty (each deck), 2x Wraith on Wings"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2415036","commentId":2415036,"userName":"PsychoRocka","timestamp":1473919142,"content":"Thanks Grandspleen!\n\nNice campaign pool! Well done managing to earn a copy of Brace of Conies while also only placing a single enemy under the black gate. No idea how you managed that! I had to replay Journey to the Crossroads multiple times to achieve only a single enemy and that was without taking either copy of brace of conies and really relying on those additional resources at the start.\n\nBummer that you earned Saruman's Voice though.... nasty burden.. \n\nYou will be changing heroes for the next box I assume? Looks like you play very thematically and change heroes between the two groups (Aragorn and Co and Frodo and Co). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2415455","commentId":2415455,"userName":"GrandSpleen","timestamp":1473949450,"content":"I had like 12 play-throughs of that scenario. My decks were able to beat it fairly consistently, but I always ended up with a couple of oliphaunts under there so I kept trying again.\n\n \n\nI actually earned Saruman's Voice intentionally.  I get to choose which hero it goes on, so I can minimize the impact, it has no shadow effect (!!!) and it doesn't have Surge.  I can also remove it if I include Condition management, which I always do because I have Overcome by Grief as well.  When Saruman's Voice comes out of the encounter deck it's almost always preferable to what would have come out in its place.  \n\n \n\nAnd yeah I do change heroes between the two groups and play for theme. Sam and Galadriel will probably be around in the last box, but it's hard to imagine who else might make it in.\n\nEdited September 15, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2415615","commentId":2415615,"userName":"Calvadur","timestamp":1473953874,"content":"> I had like 12 play-throughs of that scenario. My decks were able to beat it fairly consistently, but I always ended up with a couple of oliphaunts under there so I kept trying again.\n> \n>  \n> \n> I actually earned Saruman's Voice intentionally.  I get to choose which hero it goes on, so I can minimize the impact, it has no shadow effect (!!!) and it doesn't have Surge.  I can also remove it if I include Condition management, which I always do because I have Overcome by Grief as well.  When Saruman's Voice comes out of the encounter deck it's almost always preferable to what would have come out in its place.  \n> \n>  \n> \n> And yeah I do change heroes between the two groups and play for theme. Sam and Galadriel will probably be around in the last box, but it's hard to imagine who else might make it in.\n\nYou just opend my eyes! If you are running a Noldor deck or at least elven light Saruman's Voice can really help you (except for the 2 threat and a one time quest Penalty)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2416568","commentId":2416568,"userName":"PsychoRocka","timestamp":1473989978,"content":"Yeah that is interesting how mundane Sarumans Voice can be to the right deck and how it can be far less nasty than other encounter cards that might appear in its place had you not earned it....\n\n \n\nIt would definitely barely effect one of my decks (that discards and draws like crazy) and potentially even help it but if attached to a hero in the other deck it would wreak havoc... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2416716","commentId":2416716,"userName":"GrandSpleen","timestamp":1473999250,"content":"Here's the session report from the game of Journey to the Cross-roads in which only one Man of Harad escaped, if you're interested:\n\n \n\n1st Deck: Faramir (Leadership), Sam, and Haldir.\n\n2nd deck: Galadriel, Damrod, and Haldir.\n\nRing-bearer: Frodo (Land of Shadow).\n\n \n\nChanged my approach and put a bunch of Ents into the Faramir deck to make better use of his readying ability, then put some victory display shenanigans into the Galadriel deck (otherwise leaving it mostly unchanged).  This all worked out well.  Out of the Wild removed a Man of Harad and a Marching Up the Road treachery, a The Dark Lord's Summons treachery, and a Man of Harad enemy.  The Door is Closed was able to cancel a The Dark Lord's Summons later on, and A Test of Will did plenty of work as well.  I got very lucky in that the Oliphaunts were all in the last 4 cards of the Men of Harad encounter set, so I did not see them until I had a million Ents on the table.  I dealt with one Oliphaunt in combat, and at the end of the game there were still two engaged, with 6 and 3 damage on them.  Faramir generally readied Treebeard.  In the end we had only one Man of Harad escape, best result so far.  The Faramir deck earned Brace of Conies, while the other deck took the starting resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=2439853","commentId":2439853,"userName":"tomtom","timestamp":1475426967,"content":"Here's my Saga Campaign so far.\n\nStarting decks:\n\n \n\nTactics/Lore no-nonsense deck, derived from funny but not too practical mono-tactics decks of the past. Unlike it's ancestors, it can draw cards and pay for itself besides killing things. Mablung is the key to success; he reminds me of some silent accountant, sitting in the far corner of the corporate open space - HQ people barely notice his existence, but as soon as he goes down, company goes down in flames:\n\n \n\nhttp://www.ringsdb.com/deck/view/2331 [http://www.ringsdb.com/deck/view/2331]\n\n \n\nMono Spirit deck with Gandalf and his toys. One can imagine some less expensive spirit setups,  but this proved to be surprisingly useful:\n\n \n\nhttp://www.ringsdb.com/deck/view/18732 [http://www.ringsdb.com/deck/view/18732]\n\n \n\nNew scoring system used.\n\n \n\n1. Shadow Of The Past\n\n \n\nscore 172\n\nBoons and Burdens: Ring Draws Them, Gildor\n\nstyle: 1 try\n\n \n\n \n\n1.1 The Old Forest\n\nscore 191\n\nBoons and Burdens: Old Bogey Stories\n\nstyle: 1 try\n\n \n\nAlmost threated out trying to get Old Bogey Stories. Many moving parts here, so one has to be extra careful about timing of 2A/B quest switch, number of locations in Victory Display and so on. It's frustrating enough to be beaten to death by the tree, so better don't get killed by the rules.\n\n \n\n1.2. Fog On The Barrow-Downs\n\nscore 188\n\nBoons and Burdens:Ho! Tom Bombadil\n\nstyle: 2 try\n\n \n\nReally like this quest's ability to unexpectedly throw wrong player under the wrong bus. Getting out of it takes some time.\n\n \n\n \n\n2. Knife In The Dark\n\nscore 145\n\nBoons and Burdens: Valiant Warrior (attached to Haldir), Tireless Ranger (attached to Beregond)\n\nstyle:  1 try\n\n \n\n \n\n3. Flight To The Ford\n\nscore 117\n\nBoons and Burdens: Eaten Alive!\n\nstyle: 1 try\n\n \n\n \n\n4. The Ring Goes South\n\nscore 190\n\nBoons and Burdens: Glamdring and Anduril\n\nstyle: 1 try\n\n \n\nOne of the quests that tries to kill you by rules breaching (besides beaing eaten by Wargs), extra careful here. Weakest quest of Saga IMO.\n\n \n\n5. Journey In The Dark\n\nscore 134\n\nBoons and Burdens: Overcome By Grief, Pursued By The Enemy\n\nstyle: 1 try\n\nhero fed to Balrog: Eowyn\n\nnew hero: Cirdan\n\npermanent +1 threat earned\n\n \n\nI must admit, I got sick of Eowyn, really wanted to try someone new and straighten the finances of Spirit deck in the process. Bridge of Khazad-dum also seemed to be perfect thematic place to ditch Gandalf. Meeting Cirdan in Lorien was the exactly opposite lore-wise, of course, but nevertheless, here he is:\n\n \n\nhttp://www.ringsdb.com/deck/view/20588 [http://www.ringsdb.com/deck/view/20588]\n\nSick amounts of card draw, affordable, good threat control, endless amounts of willpower. Leadership splash can be problematic sometimes, when you get Gimli, Faramir and AVGT in the starting hand with no Narya in sight, but with that kind of card draw one should not worry. Mirror of Galadriel might seem helpful in that regard, but using it early in the game generates the risk of losing something useful because there are not too many cards in hand and Silver Harp is quite expensive early on. Late game it is pretty useless, because you have already drawn Narya and when Elven Light starts humming your deck goes down really fast.\n\n \n\n \n\n6. Breaking Of The Fellowship\n\nscore 207\n\nburden added: Ill Fate\n\nboons added: Three Golden Hairs, Leaf-wrapped Lembas\n\ncaptive heroes: Galadriel, Mablung\n\nSeat Of Seeing explored, so bye Overcome By Grief\n\nstyle: 5 try\n\n \n\nReally wanted to get rid of OBG and +2 def to enemies in combination with Toughness keyword makes things difficult for Haldir, so it took some time. Some unxpected logistical problems when decks are separated - had to switch to bigger table.\n\n \n\n \n\n7. Uruk-Hai\n\nscore 132\n\nboons added: Intimidation, Leader Of Men\n\nHo! Tom Bombadil wasted\n\nstyle: RP 1 try\n\n \n\nDue to some lackadaisical play late in the game I had to use Ho! Tom Bombadil to earn the boons. Leader of Men goes to Arwen, which makes Spirit deck even more affordable. Intimidation went to Haldir, making him even more badass killer.\n\n \n\n8. Helm’s Deep\n\nscore 177\n\nPoisoned Counsels avoided\n\nstyle: umpteenth try\n\n \n\nMan, this one is tough indeed. There's really not much one can do when first round Night Wihout End effectively surges into another Night Without End. Finally got it done, but it wasn't easy, pretty or curse words-less.\n\n \n\n \n\n9. Road To Isengard\n\nscore 184\n\nPalantir earned, Saruman’s Voice avoided\n\nstyle: RP 2 try\n\n \n\nExtra care is required during stage 3, when Saruman makes seemingly endless attacks. Burning-Branded multiple UC-ed Beregond  (BBmUCB) once again proves his worthiness. Timing of your attacks against Sarumans is also crucial.\n\n \n\n10. Passage Along The Marshes\n\nscore 158\n\nSearching Eye taken\n\nstyle: RP 4 try\n\n \n\nEarly Undead/Nazgul rush made it difficult twice, but I got over it finally. Mire keyword requires some attention rules-wise (lost game 3 due to lack of that attention).\n\n \n\n \n\n11. Journey To The Cross-roads\n\nscore 149\n\nno Coneys, no enemies under Black Gate\n\nstyle: RP 4 try\n\n \n\nAfter two tries i chose to ignore Coneys since it's another card making my decks bigger. Haldir's ability supported by Hands Upon The Bow along with BBmUCB make poor Encounter Deck powerless. And I didn't draw Legolas until late in the game.\n\n \n\n12. Shelob’s Lair\n\nscore 213 – 16 completed rounds :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nHeavy Burden earned of course\n\nstyle: OS\n\n \n\nAnother quest that heavily relies on nasty shadow card effects, so Burning Branded Beregond turn one/two breaks it. Took the quest OnSight which resulted in Shelob having 14 resources at the start of 3B :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nNow I'm stuck waiting on my Flame Of The West arrival, stay tuned.\n\nEdited October 2, 2016 by tomtom"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3674357","commentId":3674357,"userName":"gpd924","timestamp":1554947504,"content":"ok so what decks did you guys use for Journey to the Cross-roads?  I see the results of the games in this thread, but no actual decklists."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3674561","commentId":3674561,"userName":"dalestephenson","timestamp":1554975888,"content":"Most recently my son and I beat it with these two decks working together (campaign mode):\n\nhttps://ringsdb.com/fellowship/view/152 [https://ringsdb.com/fellowship/view/152] (Dori and Caldara)\n\nOnly one Oliphaunt was let through."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3674580","commentId":3674580,"userName":"gpd924","timestamp":1554978558,"content":"> 43 minutes ago, dalestephenson said:\n> \n> Most recently my son and I beat it with these two decks working together (campaign mode):\n> \n> https://ringsdb.com/fellowship/view/152 [https://ringsdb.com/fellowship/view/152] (Dori and Caldara)\n> \n> Only one Oliphaunt was let through.\n\nHmm, those seem interesting.  I think the quest is impossible to beat solo using only one deck.  You might have to go through so many losses before actually winning with just one deck, so I'll try it two-handed.\n\nAny particular strategies?  I also don't know what the Sideboard cards are all about.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3674602","commentId":3674602,"userName":"dalestephenson","timestamp":1554981081,"content":"If you click on the decks themselves they'll give an explanation of the sideboard cards.  For this particular case, I'd include the Westfold Outriders, since pulling an enemy out of staging after the enemy attacks can be most useful.\n\nIn our campaign Arwen has defensive enhancements (can discard non-unique shadows and +1 defense), so once Light of Valinor shows up (or we can spare the questing) she becomes the defender on that side if necessary -- that gets the weaker enemies.  Amarthiul has the offensive enhancements, but with Armored Destrier he defends for at least 4 (six with Dori's help) and can discard a shadow.  Arwen/Eowyn put strong allies in the discard pile for Caldara to fetch.  Since we started the campaign pre-errata we don't bind ourselves by it, but in practice she's only used once.  Since Road Darkens we've ignored the fallen hero rule for a discarded Caldara, so that we don't have to stall at the end of quests just to play Fortune or Fate -- Caldara's an absurd choice for the campaign if you use it.  Since you aren't playing campaign your heroes are weaker than mine were, but you miss my burdens as well.\n\nThis is *far* from the most powerful fellowship available, but it was strong enough for us.  I haven't had to drop to easy mode for any of the quests so far, though we still have Mountain of Fire to go and Mount Doom is not a good fit for the fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3711388","commentId":3711388,"userName":"PigsAreOurEquals","timestamp":1559207772,"content":"> On 4/11/2019 at 12:29 PM, gpd924 said:\n> \n> Hmm, those seem interesting.  I think the quest is impossible to beat solo using only one deck.  You might have to go t﻿hrough so many losses before actually winning with just one deck, so I'll try it two-handed.\n> \n> Any particular strategies?  I also don't know what the Sideboard cards are all about.  \n\nIn my solo campaigns sofar (excluding the mountain of fire which I haven't opened yet) it is the toughest quest for a single deck (tougher than Pelennor fields and Helm's deep).\nTwo of my campaigns made it through in pure solo:\n\n* Treebeard, Gimli and Pippin: the boon choices were made to get maximum hitpoints and healing for Gimli. With this and the erebor record keeper Gimli can make multiple huge attacks and take attacks undefended.\n* Erestor, Arwen and T Legolas: straight up Noldor discard deck. Use hands upon the bow and protector of lorien for defense.\n\n\nHope that helps.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3711509","commentId":3711509,"userName":"silverthorn","timestamp":1559228737,"content":"I just started a solo campaign with Tactics Aragorn, Gandalf and Spirit Glorfindel. A Shadow Of The Past went well with little or no problems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228290-your-saga-campaign-so-far/?do=findComment&comment=3714468","commentId":3714468,"userName":"silverthorn","timestamp":1559667998,"content":"I've managed to get as far as finishing The Ring Goes South, with little or no problems. "}]}