{"url":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/","title":"So what is the difference between this game and Descent?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383138","commentId":2383138,"userName":"FrogTrigger","timestamp":1472070893,"content":"I am looking to pick up a Co-Op game to play with a friend, we play Imperial Assault regularly with a campaign group and skirmishes. We have both tried and really liked Descent, however I find that it is so close to IA that I could see myself getting 'miniature fatigue' if we were to start lengthy campaigns in that as well.\n\n \n\nSo I started looking at LoTR the Card Game, I've watched the videos and I have a basic understanding of how the game works. But I have yet to see a team or duo in action. I am leaning towards LOTR, but I need help with the final push in the right direction :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nSo, what are the differences and why is this game better? I don't expect you to sell me on it, that isn't your job, you aren't getting paid to do this! But I would appreciate any information you can provide about the multiplayer aspect of this card game and why it is unique."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383147","commentId":2383147,"userName":"John Constantine","timestamp":1472071180,"content":"What are the differences? How about EVERYTHING?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383155","commentId":2383155,"userName":"FrogTrigger","timestamp":1472071637,"content":"Ok, ok, I like it where this is going.. define, 'everything'. *crosses legs and rests chin on steepled index fingers*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383157","commentId":2383157,"userName":"rbaker1978","timestamp":1472071789,"content":"Yeah, Descent/IA and LOTR LCG are in totally different categories. Think of MTG (sort of) but played cooperatively in a set of scenarios."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383163","commentId":2383163,"userName":"FrogTrigger","timestamp":1472071916,"content":"Ok so lets assume that I have zero experience with Magic the Gathering, is this an engaging game for both sides? Do my decisions affect what happens to my team mate and vice versa? Will we be discussing and strategizing or playing two solo games side by side as I find a lot of so called 'co-op' board games do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383165","commentId":2383165,"userName":"John Constantine","timestamp":1472072034,"content":"You will depend heavily on each other. You'll most probably have to build your decks around each other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383182","commentId":2383182,"userName":"mulletcheese","timestamp":1472072487,"content":"You could wait for the arkham horror LCG to arrive.\n\nTry that when it comes out and it'll give you an idea of what a cooperative card game plays like, then you'll have an idea of whether you'll like LOTR before you sink lots of money into the huge card pool."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383189","commentId":2383189,"userName":"FrogTrigger","timestamp":1472072940,"content":"Can't I just start with the core game for LOTR? Is that not enough content for a multi hour session of gaming? 3-4 hours?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383202","commentId":2383202,"userName":"John Constantine","timestamp":1472073470,"content":"The time you spend playing has nothing to do with how much game expansions you own. You could easily spend those 3-4 hours playing the seconds quest of the core set. If you manage to not get wiped by Troll and keep your threat down, that is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383204","commentId":2383204,"userName":"Calvadur","timestamp":1472073536,"content":"> Ok so lets assume that I have zero experience with Magic the Gathering, is this an engaging game for both sides? Do my decisions affect what happens to my team mate and vice versa? Will we be discussing and strategizing or playing two solo games side by side as I find a lot of so called 'co-op' board games do.\n\nDo not worry, this is one of the best co-op games you can find. So why doesn't this feel like two solo games?\n\n \n\nFirst you have the same staging area, so you and your mate have to discuss how to handle that (in MY opinion it feels much better if you ignore the \"table talk rule\" as it is really counter intuitive). Where do you want to travel? Can both of you pay the travel \"costs\"? etc., then how do you handle the enemies (you better have a plan before starting to Play, hehe). Can both of you handle enemies? Is one enemie much worse for one of you? Do you want to fight enemies or leave them if you can? You will see that you really discuss these Points while playing.\n\n \n\nSecond, deckbuilding. It's a huge part of the game and you can do great Combos and go for strong synergies when having multiple Players (These Comes more into Play the more Cards you have as one core-set really doesn't offer much in that regard, but you can still supoort each other very well). Most Import here are the heroes and attachments as These give the most supporting Options. Attachments mainly because you can Play them on the other Players characters. Basic example would be playing your unexpected Courage and a sentinel Defender controlled by your Team mate, who cannot Play this Card, because he has no ressource match.\n\n \n\n \n\n> Can't I just start with the core game for LOTR? Is that not enough content for a multi hour session of gaming? 3-4 hours?\n\n \n\nSure. But be warned, without much Prior learning the 2nd and 3rd quest will be hard (especially the 3rd). So prepare to loose. Because you (most likely) will loose, you can spend quite some time with only the core-set (if you win every quest instantly I would calculate about 2h per quest). Anyway you should get  a very good Impression, if the game is what you are looking for. If you don't like it you can probably sell the core set easily, too as the Card Distribution is not that good (some Cards you often times would want 3 copies of are only included 1 or 2 times (but don't worry game is totally playable with one 1 core set!); so expierenced Players often look for reasonable offers on eBay etc. to get missing copies cheaper).\n\n \n\nBut I am sure you will like it :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited August 24, 2016 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383249","commentId":2383249,"userName":"mulletcheese","timestamp":1472075621,"content":"> Can't I just start with the core game for LOTR? Is that not enough content for a multi hour session of gaming? 3-4 hours?\n\nIt depends on how many players you want to support.\n\nThere are enough hero's in the core set for 4 players but each player will want a core set to have enough cards to build good decks. Each player will control 3 hero's and they have to be unique amongst all players, with just core set cards some players will have better decks than others.\n\nLOTR is based heavily on deck building, a lot of the time you are \"playing\" the game you will be updating your decks between attempting the scenarios.\n\nDue to the focus on deckbuilding the bigger the cardpool the better.\n\nWe only know a bit about Arkham horror from gencon.\n\nIt supports 2 players from one core set, 4 players with 2 core sets, with little overlap of player cards. Each player controls a single character and moves around a map fighting monsters and investigating.\n\nThe biggest difference is that there is less deckbuilding in AH. Your starting deck is only 30 cards and instead of rebuilding your deck between scenarios you spend experience points to upgrade a few cards in your deck.\n\nThey'll both be good games but may appeal to different types of players.\n\nMaybe the best thing to do is watch a YouTube video of each of the games being played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383278","commentId":2383278,"userName":"rsdockery","timestamp":1472076371,"content":"> Can't I just start with the core game for LOTR? Is that not enough content for a multi hour session of gaming? 3-4 hours?\n\n \n\nYes, you certainly can. I have no idea why you'd want to wait several months for an entirely different game to come out just so you can play it as a comparison to this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383429","commentId":2383429,"userName":"Dain Ironfoot","timestamp":1472084395,"content":"Here's two folks playing: \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383469","commentId":2383469,"userName":"FrogTrigger","timestamp":1472086911,"content":"Great responses, thank you, very helpful. I am impressed but not surprised, I've lurked in this forum for a while now and one of the draws this game has had to me is an amazingly supportive community.. especially compared to some of the other forums I visit *cough* X-Wing *cough*.\n\n \n\nI am sold, I will be picking the core up Friday to play through with a friend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383797","commentId":2383797,"userName":"DukeWellington","timestamp":1472109348,"content":"On a related note I have often wondered how Starcraft and Checkers compare, and how they differ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383854","commentId":2383854,"userName":"zazoo","timestamp":1472114366,"content":"> Great responses, thank you, very helpful. I am impressed but not surprised, I've lurked in this forum for a while now and one of the draws this game has had to me is an amazingly supportive community.. especially compared to some of the other forums I visit *cough* X-Wing *cough*.\n> \n>  \n> \n> I am sold, I will be picking the core up Friday to play through with a friend.\n\nI play a lot of games including IA and even though I really enjoy IA, LOTR is my favourite, so I am positive you will enjoy it.\n\nI would say the only bad part of the game right now is there are a lot of expansions so getting them all is going to be difficult. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2383996","commentId":2383996,"userName":"monkeyrama","timestamp":1472125580,"content":"> Can't I just start with the core game for LOTR? Is that not enough content for a multi hour session of gaming? 3-4 hours?\n\n \n\nSome of my fondest memories of this game are from the core set only days. I got the game while on a work placement away from home, and the core set alone allowed many sessions of multi-hour play. Each scenario can take anywhere between 30 minutes to 2 hours (although the final scenario in the core set is very hard solo play with the core set only). I really fondly remember the first time I beat the third quest playing two-handed, with only 2 heroes left alive at the end. I lost about 5 times before that! So the core game has plenty of play in it.\n\n \n\nThe game has a steep learning curve, which can be mitigated by learning from the community (e.g., tactics solo from core set will lose, and lose hard) and there's just enough there to get some interesting deck building going. The multiplayer aspect is great because your decks can interact quite fully (attachments can go across the board) and it is very much a cooperative matter when dealing with enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2385683","commentId":2385683,"userName":"BigKahuna","timestamp":1472198342,"content":"Well I actually disagree with the sentiment that Descent and Lord of the Rings are \"totally different\".\n\n \n\nIn the end the core concepts are the same.  You have a group of characters, you go on quests, their is a campaign mode and the game is dynamically designed to allow for custom created content for which there are tools for you to do it with.\n\n \n\nThe core difference is that one game (Lord of the Rings) is played with cards, while Descent is played on the table top with miniatures.\n\n \n\nNow of course that core difference definitely changes the experience and so which adventure game you ultimately choose should probably depend on your personal tastes (do you prefer card games or board games).\n\n \n\nFor what its worth I think Lord of the Rings is a better choice for several reasons.  First and foremost the setting, its Lord of the Rings which is a setting that is extremely rich and detailed, when playing campaign mode you really get a sense of the story and I think that is a huge plus over Descent which is based on FFG's fantasy world that is frankly a bit generic and uninspired in my opinion.  \n\n \n\nSecond, is that Lord of the Rings can be played with a large variant of players.  Wether its solo, 2, 3 or 4 players, Lord of the Rings remains a rich, deep and challenging gaming experiance.  Now Descent has seen some improvements in this regard with the Iphone app where you can now play solo against the app, but generally this game is best played with exactly 5 people, anything less and it becomes a less fun game.  More importantly though Descent is really not a challenging or deep experience, a half-way competent group will breeze through the game.  Its really a very simple to win game.\n\n \n\nFinally is the campaign mode.  Now I can't say enough about how awesomely fun the campaign mode is in Lord of the Rings.  It is really where this game just shines.   In particular if you include the adventure cycles into the campaign game and treat them as side quests you really have this amazing journey.  \n\nDescent campaign mode is very linear and there really is not much of a difference between campaign and regular one time plays, nor is the campaign story (journey) particularly interesting, its all very generic.\n\n \n\nNow I will say this about Lord of the Rings... It gets expensive fast.  Once it gets its hooks in you, it will end up costing you hundreds of dollars.   You mentioned \"can I just get the core set\" and yes of course you can but you will realize very quickly that it just won't do.  I started out with the core set, 1st cycle and the first Saga Expansion and that brought the tally to about 160 dollars and that is just a taste of what your getting into.  If you become a collector you will easily spend over 1,000 dollars on this game and the feeling of \"needing the next one\" can be quite intrusive.  You always feel like your adventure is on hold until you get the next pack, next expansion etc.. plus there is all this great stand-alone content.  It can be a bit I don't know the word... uncomfortable?  \n\n \n\nThe nice thing about Descent is that you can buy the core game and you can easily put 50 hours into it before you feel like ... ok, time to get another set... and each set is effectively its own game so its considerably less trouble to get a very complete experience with Descent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2385753","commentId":2385753,"userName":"evilidler","timestamp":1472203786,"content":"> The nice thing about Descent is that you can buy the core game and you can easily put 50 hours into it before you feel like ... ok, time to get another set... and each set is effectively its own game so its considerably less trouble to get a very complete experience with Descent.\n\n \n\nYes, the equivalent for LotR I guess would be buying the core and the whole Mirkwood cycle, which ends up about 50% more expensive than Descent before discounts. On the other hand you can also buy LotR in smaller chunks, but see the other bits BigKahuna wrote about desiring more :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI did a thorough investigation of what the game would cost me to complete. I have three full cycles, one lone deluxe, two sagas and a handful of packs from the different cycles. Getting just the sagas and the rest of the cycles (assuming a complete Harad cycle) puts the price around $630 (by today's exchange rate, from 3-4 suppliers) without Nightmare decks (another $300+, increasing with each release). I've calculated and taken notes of the best way to ship everything to me, so short of discounts there's no way it can get cheaper. American prices will be a little lower.\n\n \n\nI'm buying a deluxe, filling the cycle and then getting two parts of a saga, repeating until done. Descent is really looking cheaper at this point, but I'm not sure I'd enjoy it as much. I also like compact card games the most, but the size of even my moderate collection also makes Descent look quite portable.\n\n \n\nSo before you even start: Are you sure you want to go down this road? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2385783","commentId":2385783,"userName":"John Constantine","timestamp":1472206727,"content":"> Well I actually disagree with the sentiment that Descent and Lord of the Rings are \"totally different\".\n> \n>  \n> \n> In the end the core concepts are the same.  You have a group of characters, you go on quests, their is a campaign mode and the game is dynamically designed to allow for custom created content for which there are tools for you to do it with.\n\nAnd I actually disagree with you. I don't know what cloudy concepts are you talking about, but there is literally nothing in common between these two games in terms of gameplay. Nothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2385930","commentId":2385930,"userName":"BigKahuna","timestamp":1472215065,"content":">  \n> \n> > Well I actually disagree with the sentiment that Descent and Lord of the Rings are \"totally different\".\n> > \n> >  \n> > \n> > In the end the core concepts are the same.  You have a group of characters, you go on quests, their is a campaign mode and the game is dynamically designed to allow for custom created content for which there are tools for you to do it with.\n> \n> And I actually disagree with you. I don't know what cloudy concepts are you talking about, but there is literally nothing in common between these two games in terms of gameplay. Nothing.\n> \n>  \n\n \n\nSure there is.\n\n \n\n1. You have a group of heroes that go on quests.\n\n2. You fight monsters, you visit various locations, there are a wide variety of special missions and objectives.\n\n3. You have a campaign mode that allows you to link the quests together to form a longer, ongoing campaign where decisions and changes in he course of the campaign alter your experience.\n\n \n\nI'm not suggesting they are mechanically the same, but there is a reason why the poster picked Descent and Lord of the Rings as his two choices instead of say Lord of the Rings and Game of thrones which have far more in common mechanically.  He's looking for an cooperative adventure game and both of these games fit that genre.  One is a board game, one is a card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386202","commentId":2386202,"userName":"John Constantine","timestamp":1472223597,"content":"> Sure there is.\n> \n>  \n> \n> 1. You have a group of heroes that go on quests.\n> \n> 2. You fight monsters, you visit various locations, there are a wide variety of special missions and objectives.\n> \n> 3. You have a campaign mode that allows you to link the quests together to form a longer, ongoing campaign where decisions and changes in he course of the campaign alter your experience.\n> \n>  \n> \n> I'm not suggesting they are mechanically the same, but there is a reason why the poster picked Descent and Lord of the Rings as his two choices instead of say Lord of the Rings and Game of thrones which have far more in common mechanically.  He's looking for an cooperative adventure game and both of these games fit that genre.  One is a board game, one is a card game.\n> \n>  \n\nCan you read properly? \n\n \n\nI said \"in terms of gameplay\". If you say those two games are similar because they have a group of heroes and they fight monsters, etc, then the same can be said about LotR LCG and, let me see, Neverwinter Nights. This comparison brings nothing to the table as it serves no purpose.\n\n \n\nI repeat once again, in terms of gameplay those games have absolutely NOTHING in common. And if you read the original post of this thread carefully, you'll find that the question is exactly about the gameplay part. Which, once again, is absolutely different for both of those games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386238","commentId":2386238,"userName":"DukeWellington","timestamp":1472224777,"content":"Seriously... here are a few other similarities:\n\n1. The are both tabletop games.\n\n2. They both feature art.\n\n3. Multiple people can participate in both games.\n\n4. The players have objectives in both games.\n\n5. Each game includes a set of rules.\n\n6. While playing either game the participating players can interact with each other.\n\n7. The games are each played over a series of \"rounds\" or \"turns\".\n\nI could go on and on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386352","commentId":2386352,"userName":"FrogTrigger","timestamp":1472228178,"content":"BigKahuna and Duke get what I am after, I am looking at the top co-op games in FFG's line up (yes I am a FFG fanboi, their product quality is top notch) and these two are it. Gameplay, shmameplay, I know both are going to be fun, what I am after is the experience. How do the experiences vary, I should have hit that harder but enough posters got my point that this has been a very useful thread.\n\n \n\nCost structure is something I am familiar with in IA, their blister packs are fast and furious compared to Descent. Generally you see 2-3 small figure, 1 multi figure and 1 large figure coming out with each expansion and some extra blister packs sprinkled in there randomly. Canadian, a big box with all the blister packs is about $160 with tax. That gets you around 20-25 hours of game play in a campaign, with replayability of course. I know that any of these games I dive into I am looking at cost.\n\n \n\nI guess one thing that came up to me in this thread I never thought about before is that LOTR is a fully co-op experience where as Descent's co-op play is just based off of an app. They've done a good job with the app, I have tested it, but there is jsut a short mini campaign and one full campaign. We could play through that in a matter of months and then be sitting there twiddling our thumbs. Yes there is replayability, but generally these choices are X--Y or Z---Y or Z---X---Y or Z---X etc.. so you do get some variability in your quests, but after two play through chances are you've played it all and the flavor text is very much the same.. as is the end result. I also found while the app was fun, it was evident that the co-op play was an after thought. I am not sure how it works on LOTR, but basically in Descent the challenge only arises in the monsters spawning faster and faster the longer you take to complete a quest. No flavor text or description just drop this monster here now. And now this one, and this one and so on until you win or die.\n\n \n\nWhere as with LOTR every time you sit down you are playing a game that is built around being co-op. I understand with LOTR you are flipping cards as you advance through the quest, which brings an element of randomness into things as well.. but it isn't all just spawn monster X here, there is actually a scenerio being built and obstacles to over become besides just smash smash smash. So now the debate delves deeper to dungeon crawl vs adventure.. I think I enjoy the adventure part more. That is a great point about how the flavor text from Descent can't add up to the rich lore of LOTR."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386391","commentId":2386391,"userName":"BigKahuna","timestamp":1472228993,"content":"I understood what you where after FrogTrigger but I think to a degree these guys are also correct in that gameplay is not something you should ignore, you should consider the cards vs. board game versions of adventure games.  Just to play devils advocate here, Descent has one thing going for it that Lord of The Rings can't put a candle to and that is fan created content.  Descent has the Quest Vault which is jam packed with content that expands the game beyond compare and you have a tool there as well to create your own content.  In a lot of ways fan created content is considerably better, more challenging.  The catch is that this expanded content will always require an \"overlord\" to play the part of the bad guy, which in itself is a ton of fun.\n\n \n\nNow I will say that given the option to play Descent, I would also consider Imperial Assault.  Its not fantasy but without question, by a wide margin, a much better version of that system and built into it is a secondary skirmish game which is fantastic in its own right.  Its really two games in one.\n\n \n\nI still consider Lord of the Rings the Card game the premiere Co-Op adventure game.  I have never play anything in that genre nearly as good.  I actually found that after 4 or 5 plays of Descent, I can pretty much go the rest of my life and never play it again where as in Lord of the Rings after 40+ plays I'm trying to figure out how I can squeeze a couple hundreds bucks out of my budget to get more.. more and more...\n\n \n\nBy the way I reviewed Lord of the Rings a while back if you want to read about my experience a bit more in my blog (I think it was last month), might find something there that might help you decide.\n\nEdited August 26, 2016 by BigKahuna"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386644","commentId":2386644,"userName":"FrogTrigger","timestamp":1472236415,"content":"Thanks I will check your review out this afternoon. I guess the other thing I have to push me towards LOTR is that if I want to play a minis game with an overlord, I own all of Imperial Assault, so I can play that. Like you said it is sci-fi, not fantasy, but the system is muuuuchh better than Descent. So why pick up another minis game where I need 4-5 people to make it fair or fun after I demolish the one co-cop campaign when I can try something completely different."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386811","commentId":2386811,"userName":"DukeWellington","timestamp":1472242437,"content":"Actually FrogTrigger, I was being sarcastic, but I do want you to play LOTR :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228488-so-what-is-the-difference-between-this-game-and-descent/?do=findComment&comment=2386819","commentId":2386819,"userName":"Slothgodfather","timestamp":1472242917,"content":"> Thanks I will check your review out this afternoon. I guess the other thing I have to push me towards LOTR is that if I want to play a minis game with an overlord, I own all of Imperial Assault, so I can play that. Like you said it is sci-fi, not fantasy, but the system is muuuuchh better than Descent. So why pick up another minis game where I need 4-5 people to make it fair or fun after I demolish the one co-cop campaign when I can try something completely different.\n\n \n\nDo you already own Descent?  Have you tried the companion app yet?\n\n \n\nDisregard.  I didn't finish reading your other post.\n\n \n\n \n\nA huge difference between the two is the capacity to build your decks and choose your starting heroes.   There are limited options in Descent and you have a specific small set of cards you can purchase throughout the campaign to \"level up' your guy.\n\n \n\nThe closest thing LotR has to that is when you play through the Saga Expansions in Campaign mode, there are boons that you can keep between quests.  \n\n \n\nOtherwise, you can completely customize your deck and make it fit whatever roles you want.  Between you and your friends, you will need characters that can quest, defend and attack.  Support functions like cancels, heals, card draw and resource acceleration are also useful.   You can focus on specific tasks and have your companions focus on the tasks that you aren't good at.   This makes the group build pretty dynamic.\n\n \n\nA lot of replay-ability with LotR is trying the same quests with different decks/themes/builds.\n\nEdited August 26, 2016 by Slothgodfather"}]}