{"url":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/","title":"Skip the Hobbit?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2384457","commentId":2384457,"userName":"Zura","timestamp":1472141130,"content":"Heya,\n\nI'm fairly new to this game. I've bought a core set + Khazad Dum few years ago, but after few games i put the game back on the shelf. Now I decided to give it another shot and this time it was a pretty good experience. Experience from another lcgs made this game not as deadly as it was on my first try. Sadly, the game in my country is not in really good state (almost no events, low amount on players and problems with avaibility of some expansions and new cycles are only print on demand), but i decided to go with my original language anyway - i feel more comfortable about translated names, i read the saga so many times that it felt just right to follow the translated expansions. I've bought entire mirkwood and dwarrodelf cycle and now i'm wondering where to go next. If i were to follow the expansion timeline, hobbit sagas are the way to go, but frankly, i don't feel like playing hobbit at all - i prefer going with lotr timeline or ffg adventures. But i heard that heirs are really hard and i'm not sure if i will be able to beat them without hobbit cardpool. My friend who i play with also like dwarf decks, so i'm not sure if skipping hobbit won't hurt them a bit. So, what's your advice? Would you skip sagas and go straight to against the shadow or follow the expansion timeline? Thanks for advice, \n\nZura \n\n \n\nPS: Another quick question, would you go with 2nd core set or not? Lack of tokens and some key cards hurt a bit sometimes, how did you handle the issue?\n\nEdited August 26, 2016 by Zura"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2386264","commentId":2386264,"userName":"Kolley Kibber","timestamp":1472225602,"content":"There are some great cards in the Hobbit expansions, especially for Dwarf decks, but in my opinion there isn't anything that's going to make Heirs of Numenor dramatically easier.  There might be a case to be made that some of the best cards for beating Heirs are found in the subsequent packs in Against the Shadow (Gondorian Shield, for example, or some of the monosphere-enabling cards), but Heirs is beatable with the cards that you have already - it'll be tough, for sure, but far from impossible.  The Heirs quests get talked up a lot, and they're definitely a step up in difficulty from the previous cycles, but there are ways and means of tackling them, and if you get stuck I'm sure someone will be happy to help you out with some tips based on your current pool.\n\n \n\nAs far as purchasing recommendations go, though, it might be a good idea to split the difference and try out The Black Riders (ie., the first of the Lord of the Rings Saga expansions), assuming you can get hold of it - those quests are often held to be among the best in the game, and should provide a good challenge without being punishing, while the new cards will help you build up your card pool if you don't want to face down Heirs of Numenor right now. \n\nEdited August 26, 2016 by Kolley Kibber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2386693","commentId":2386693,"userName":"Authraw","timestamp":1472238140,"content":"As far as the quests go, you can definitely skip the Hobbit. They're fine, but they're not the best, and you can probably get more quality for your money elsewhere. There are a few staples in the first Hobbit box that I would be sad to live without, though--Cram, A Very Good Tale, and Foe-Hammer make their way into my decks all the time. The second box is mostly Dwarf support, and you can probably do without it.\n\n \n\nThe Black Riders, though, is an excellent box, and I can highly recommend both the player cards and the quests.\n\n \n\nAs far as the second core goes--if you want to play 3+ players it might be worth it since you'll get good use out of the tokens and the player cards. Otherwise, I'd have trouble justifying it when you could instead spend that money on other expansions--it's almost always better to get both quests and new player cards than it is to get a few extra copies of a few player cards when it comes down to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2386763","commentId":2386763,"userName":"Zura","timestamp":1472240238,"content":"Thank you for the advice. I will probably go with heirs if they're beatable, as this theme appeals the most to my playgroup. After the cycle, i will reconsider getting back to hobbit. \n\n \n\nPS: Ffg forums censor the words that shouldn't be censored so it looks like using vulgar language while actually it's not"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2386872","commentId":2386872,"userName":"Gizlivadi","timestamp":1472244970,"content":"In the second Hobbit box you get one of the most splashable Leadership heroes ever, Balin. He's amazing, but you can certainly do without him. He still deserved a mention though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2386917","commentId":2386917,"userName":"donkler","timestamp":1472247085,"content":"I don't really get the meh reception of the Hobbit Sagas. I thought it was fun building decks around the riddles/burglary quests and really liked the treasure cards that were persistent in the campaign. I had more fun with them in general than the Heirs quests anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228557-skip-the-hobbit/?do=findComment&comment=2387044","commentId":2387044,"userName":"Lecitadin","timestamp":1472253854,"content":"Yep, the problem is that FFG know what they are doing, and the sagas always offer great cards. But I guess you can do without them, you may want to prioritize the regular cycles (and hurt your credit card less....)."}]}