{"url":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/","title":"Flame of the West","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2387513","commentId":2387513,"userName":"Veve7","timestamp":1472295682,"content":"1.If Minas Tirith is not in play,but City Wall [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/lord-of-the-rings-saga-expansions/the-flame-of-the-west/city-wall-r1931] it is I must still assign damage to it?\n\n2.When Mordor Orc attacks what happens?I must take the attack undefended and damage a hero and Minas Tirith or just Minas Tirith?Or maybe I can defend the attack and no damage will go on the city?Or damage are puted on Minas Tirith even if I defend.The same question for Regiments of crows.\n\n3.I may put progress on the third stage of Battle of the Pelleanor Fields with Ravens of the Mountains?\n\n4.If I use Eowyn to reduce my threat by 3(now is 26) in setup,then I rise it by 3 (now is 29)for resources (in Passing quest),What is my minimum threat at stage 2(26 or 29)?\n\n5.If there is no Witch-King in play I can't travel to Grond?\n\n6.If I use the Helm!Helm! on a War Mumak I will gain the threat reduction?\n\n7.If i reveal a card with surge,I first resolve all the card and then the surge?\n\n8.If Witch-King has a  Fell Beast Attached when he is removed from play by stage 4,he keeps it so at stage 5 he will have 2 attached?\n\n9.Can someone give me synonims for Brace word on the  Brace of Coneys boon?\n\nThank you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2387514","commentId":2387514,"userName":"Veve7","timestamp":1472295718,"content":"Sorry for double post!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2387667","commentId":2387667,"userName":"Lecitadin","timestamp":1472309463,"content":"I'll try to answer of few questions :\n\n \n\n \n\n \n\nPosted Today, 12:01 PM\n\n1.No.\n\n2.You decide if the attack is undefended or not.\n\n3.Yes.\n\n4.It would be 29.\n\n5.I would travel anyway because the forced effect is not a traveling condition or requirement; if the *****-King is in not in play, he just won't attack.\n\n6.Yes.\n\n7.You resolve the surge first, then the text on the card with the surge.\n\n8.Yes. Same with ennemies with traps attached to them, if they return to the staging area, they keep their trap.\n\n9.Not me!\n\n \n\n \n \n\nPosted Today, 12:01 PM\n\n \n\nEdited August 27, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2387916","commentId":2387916,"userName":"987654321","timestamp":1472324478,"content":"4.Éowyn and Stage 1 don't matter. Your starting threat is determined in step 3 of the Game Setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2388155","commentId":2388155,"userName":"GrandSpleen","timestamp":1472344019,"content":"I can answer for only a few of these, I haven't played Battle of Pelennor Fields yet and I don't want to look up each of those cards...\n\n \n\n4. 29 I think, you set your initial threat to 29 then used card effect to reduce it by 3, so 29 would still be your initial threat value.\n\n6. No, you did not \"defeat\" the Mumak, you only \"discarded\" it via a card effect.  These are different.\n\n7. The Core set manual says: \"Resolve the surge keyword immediately after resolving\n\nany when revealed effects on the card.\"\n9. Synonyms, eh?  How about a \"pair\" or a \"couple?\"  I have never seen the word \"brace\" used in this way outside of this specific context, but dictionary.com tells me that \"brace\" may have the meaning of \"a pair of things.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/228696-flame-of-the-west/?do=findComment&comment=2388392","commentId":2388392,"userName":"NathanH","timestamp":1472369122,"content":"Yes, brace means a pair.\n\n \n\nFor 2) the way Mordor Orc works is as follows. If you decide to defend his attack with a character, then the attack resolves as normal. If you decide to take the attack undefended, then instead of assigning damage to a hero, you assign the damage to Minas Tirith instead. No damage is done to a hero.\n\n \n\nFor 3) I don't have the Assault rules in front of me, but I think that nothing other than destroying enemies can place progress on an Assault quest.\n\nEdited August 28, 2016 by NathanH"}]}