{"url":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/","title":"FrogTrigger&#039;s ongoing quest(ion) thread!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2387923","commentId":2387923,"userName":"FrogTrigger","timestamp":1472325457,"content":"Hi LOTR community, you may remember me from such threads as why is this game different from Descent? Well I tried the game last night with a friend and I am definitely hooked.It is a well thought out game that is both engaging and fun..if not a little frustrating :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] The familiar faces and places definitely add to the enjoyment. I wanted to use this thread as a place I could report the fun I've had on my quests and the mistakes I've made so I can ask questions and learn from this great community.\n\n \n\nWe played through all three scenarios of the core box last night, beating them all, and making a ton of mistakes along the way. We knew there was no way we would play the game 100% accurate our first time through, similar to learning IA, you pick things up that you are doing wrong as you go (especially when things feel to easy).\n\n \n\nBig mistakes we made were first off not including all three deck types in the first quest, I just had the Tree icon that matched the icon of the scenario card. Check. The other big mistake was drawing encounter cards during the quest phase for each CHARACTER instead of player. Sometimes this meant we drew 3, often 2, but most of the time it meant we drew 1 as Eowyn was our go to girl, so we were one card short a lot which is a huuuggee difference we figured out during scenario 2 :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nWe still managed to beat the end quest though, with a threat of 48 and 47, so I feel like we are still doing something wrong as from what I have read there is no way we should have beat it on our first time through. I wanted to just run through the process as I see it and maybe you guys could tell me what I am doing wrong or offer suggestions/links to common mistakes people make.\n\n \n\nWe were playing the tactics and spirit decks as they are laid out in the rule book guide for beginners.\n\n \n\nPhase 1: Resource - We take a resource token for each HERO and put it in their pool. Each player draws 1 card to add to their hand. \n\n \n\nPhase 2: Planning - This is your only chance to purchase attachment or ally cards. Make sure you are only buying cards that have a resource match, this wasn't an issue as we were using all tactics or all spirit decks, correct? My understanding is that I can use resources from multiple spirit hero's pools under my control to buy one card. But I can never use my resources to buy a card for the other player.\n\n \n\nPhase 3: Quest - Here you pick how many players you want to commit to questing, generally we would put Eowyn up solo but once we figured out that it was always going to be 2 cards with 2 players we started committing another hero usually. We then flipped one card per player from the encounter deck into the staging area, we processed any When Revealed traits (if I didn't block them with my one hero to draw a different card instead) then placed the cards down, added up the total threat and subtracted it from our total willpower. The difference was then added to the quest OR the location if we had an active location.\n\n \n\nPhase 4: Travel - Here we just picked a location to travel to, if we wanted to, and made sure to pay the cost (if any) or trigger any associated effects for travelling there. This now became the active location, removing its threat from the total in the staging area but becoming a buffer for progress tokens to the scenario card. My understanding is that this does not actually require exhausting a character, you just go 'as a group' but the first player makes the actual decision.\n\n \n\nPhase 5: Encounter - If we flipped any enemies during the quest phase we now have a chance to engage ONE enemy each, meaning we can pick it regardless of threat level or to come engage us (first playing picking first, then rotating). After we pick our enemies any that are left over are automatically assigned to the player who has threat equal to or less than their threat, starting with the first player, then going to the next until all enemies are engaged. Usually in this phase the tactics guy would take more enemies as he was tougher obviously, and the spirit guy generally just would take one if forced to and slowly wittle it down.\n\n \n\nPhase 6: Combat - Now we do actual combat, first the player picks the enemy, then his defender, exhausts him/her, flips the shadow card and resolves any effect, then subtract your shields from their damage and apply any damage that made it through. Only one character can defend for one enemy is my understanding, meaning you can't spread damage. But you can choose to ignore the defense part and not exhaust a hero, however I found the shadow card effects were VERY steep if you did this. Once you exhaust that character they can't be used for combat. However in combat you CAN pool multiple characters attacks to one target, however you can't say split 2 damage from ONE character to TWO enemies, they have to pick an enemy and apply all of their damage. When your character takes damage equal to their health they are discarded, when you defeat an enemy they are discarded.\n\n \n\nPhase 7: Refresh - Refresh all exhausted cards/abilities (unless told not to for whatever reason by a card), increase threat by 1 and pass the first player token.\n\n \n\nOne question I had was about event cards, my understanding is that you can play them during combat at the start or end of any of the sub phases within that phase. So before you pick a defender, or after, before you pick an attacker, or after.\n\n \n\nSo how close am I? How far off? What are key things I am missing? Any and all information is appreciated here!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2387975","commentId":2387975,"userName":"John Constantine","timestamp":1472329661,"content":"So, how different this game from Descent in your opinion?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388003","commentId":2388003,"userName":"FrogTrigger","timestamp":1472331425,"content":"I think this game is very different from Descent and designed better. The party interaction is way different not talking about what you have in your hand. In Descent there is a lot of back and forth about what your best move is which always results in Alpha gaming, in this game you actually feel like you are controlling your group and while there is still a great deal of interaction and debate, ultimately you hold the cards in your hand! The difficulty is also way higher in LOTR versus Descent. In Descent you just get punished for taking to long basically, in this game you do get punished for that... but you can also be severely handicapped right off the first encounter flip if you make the wrong decision or commit the wrong players. Recovering in this game is wayyyy harder than Descent, thus the deck building to be able to react to these situations. \n\n \n\nOne thing Descent has going for it over this game is I actually prefer the dice combat, maybe that is just me and my IA roots but I love the thrill of rolling the different dice with the different effects. But the combat in this game for a card game is very well designed and requires an actual thought process behind whats going to randomly happen with my red and blue die! So to each their own.\n\n \n\nAt their root both of the games are co-op adventure games that weave through a story line fighting monsters and over coming obstacles and they both require each person playing to do their part to further the team.. but if I had to pick which is one is better, I would go with LOTR. The replay ability alone is what makes it unique.\n\n \n\nNow I need to go pick up a few of the cycle packs and try these quests again :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388009","commentId":2388009,"userName":"Kakita Shiro","timestamp":1472332126,"content":"The Shadow effects are the random elements of combat, some of which can affect the game state in ways other than just numerical bonuses (bonii?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388061","commentId":2388061,"userName":"CaffeineAddict","timestamp":1472335633,"content":"Beating Dol Guldur first try with those decks sounds unlikely...did you follow the setup instructions and capture a hero? Did you resolve the Guarded keywords on the objectives?\n\nIn your phase notes, you mention resolving \"when revealed\" effects, but not surge or doomed?\n\nIf I recall, there is an effect on the nazgul that puts it into play, rather than a quest effect, did you remember to check that?\n\nYou mention not exhausting a character to defend - you realise you have to assign damage from an undefended attack to a hero, ignoring their defence?\n\nAlso, just checking, with the travel phase, you weren't travelling to a new location until your explored the active one?\n\nThat's all the ambiguities from your notes that spring to mind...\n\nEdited August 27, 2016 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388065","commentId":2388065,"userName":"Kakita Shiro","timestamp":1472336204,"content":"Did you check the latest FAQ that reduces the effectiveness of Horn of Gondor and makes the Nazgul of Dol Goldur immune to player attachments?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388249","commentId":2388249,"userName":"jjohnson111","timestamp":1472350641,"content":"There are loads of resources out there for timing windows and such (as well as in the rulebook) but I really like this version, and how it is streamlined, in particular for knowing when action windows exist!\n\nhttp://www.orderofgamers.com/downloads/LordoftheRingsLCG_v2.pdf [http://www.orderofgamers.com/downloads/LordoftheRingsLCG_v2.pdf]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388715","commentId":2388715,"userName":"FrogTrigger","timestamp":1472401392,"content":"> Beating Dol Guldur first try with those decks sounds unlikely...did you follow the setup instructions and capture a hero? Did you resolve the Guarded keywords on the objectives?\n> \n> In your phase notes, you mention resolving \"when revealed\" effects, but not surge or doomed?\n> \n> If I recall, there is an effect on the nazgul that puts it into play, rather than a quest effect, did you remember to check that?\n> \n> You mention not exhausting a character to defend - you realise you have to assign damage from an undefended attack to a hero, ignoring their defence?\n> \n> Also, just checking, with the travel phase, you weren't travelling to a new location until your explored the active one?\n> \n> That's all the ambiguities from your notes that spring to mind...\n\n \n\nYes we learned about the Surge and Doom effects and processed them right, and we were taking the penalties on the objective cards. When we didn't exhaust a character to defend (which was rare) we really got punished by the shadow effect, and yes all damage had to go one person.. so we quickly learned that was a very poor option. And yes we made sure to always explore the active travel phase first, those added up in the last mission I think we had 3 in the staging area collecting threat and one active buffering the scenario. I think where we might have went wrong was with the Nazgul, it says to remove a character each time that a shadow effect is triggered with his attacks, we didn't do that.. but If I remember correctly I don't think he did actually trigger a shadow effect though, just luck of the draw.\n\n \n\nI will have to look this FAQ up, there really is no way for a new player who just bought the box to know there is a FAQ."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388887","commentId":2388887,"userName":"FrogTrigger","timestamp":1472412447,"content":"Ok so I tried Journey down the Anduin again with the spirit and leadership decks, it was tougher than the first time through but I made it through the Hill Troll and things were looking up, until I flipped another Hill Troll in the next encounter. I threated out two rounds later on the leadership deck and then the hill troll + hydra thingie + wolves crushed my weak spirit deck. Now to figure out how to beat that **** hill troll! lol\n\n \n\nSo when you do start deck building with expansions, what is the average deck size? Do you just follow the tournament rules of 50 cards and no more than 3 of each? How often do you mix and match spheres?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388893","commentId":2388893,"userName":"Lecitadin","timestamp":1472413080,"content":"Remember this :\n\n''Surge, Doomed, and Guarded keywords should be\n\nresolved any time the card on which they occur is\nrevealed from the encounter deck, including during\nsetup'' (from the latest FAQ)\n\nThis means that when an encounter card added instead of being revealed, you don't trigger those keywords.  ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388939","commentId":2388939,"userName":"Noccus","timestamp":1472416827,"content":"> Ok so I tried Journey down the Anduin again with the spirit and leadership decks, it was tougher than the first time through but I made it through the Hill Troll and things were looking up, until I flipped another Hill Troll in the next encounter. I threated out two rounds later on the leadership deck and then the hill troll + hydra thingie + wolves crushed my weak spirit deck. Now to figure out how to beat that **** hill troll! lol\n> \n>  \n> \n> So when you do start deck building with expansions, what is the average deck size? Do you just follow the tournament rules of 50 cards and no more than 3 of each? How often do you mix and match spheres?\n\n \n\nOn the hill troll: https://talesfromthecards.wordpress.com/2014/01/14/how-to-kill-a-hill-troll/ [https://talesfromthecards.wordpress.com/2014/01/14/how-to-kill-a-hill-troll/]\n\n \n\nWith deck building, people mostly stick to 50 cards max.\n\nBut when should you start mixing spheres & expansion cards etc? That's up to you. When you feel ready, go for it.\n\n \n\n \n\n \n\nAnd was Frog your favorite character from chrono trigger?\n\nEdited August 28, 2016 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388961","commentId":2388961,"userName":"FrogTrigger","timestamp":1472419418,"content":"Were there any other characters? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2388972","commentId":2388972,"userName":"Authraw","timestamp":1472420040,"content":"I wouldn't bother trying to build 50 card decks with just the Core set. There aren't quite enough good cards to build competitive decks with just the Core set. I'd stick to more like 40 at the beginning.\n\n \n\nIt won't take many expansions, though, before you start wanting more than 50 cards; and that's when you know your card pool is big enough for \"tournament legal\" decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2389138","commentId":2389138,"userName":"FrogTrigger","timestamp":1472429213,"content":"Alright so 4 solo play throughs for Anduin puts me at 2-2. It went loss, win, loss win, first attempt was Leadership/Spirit and from there on it was Tactics/Spirit, this seems to be the best combo in the core?\n\n \n\nThe two wins I got multiple attachments off the back including the dagger that gives Legolas extra damage/travel token, the axe for Gimli (and then later the armor) and the willpower buff for Eowyn.  When I lose it seems to happen when I have trouble finding the attachments, does that make sense?\n\n \n\nI also got lucky on my last win and grabbed my card to lower threat by 6 when I was sitting at 49 and would have went to 50 at the end of the round (or sooner with an unlucky card draw!)\n\n \n\nI used the tip from that link about waiting the hill troll out and not engaging right away, I mulliganed my spirit starting 6 to get the threat debuff and used it on my tactics deck to drop his threat and buy us a few more rounds to build the troops up. I was able to take a round of troll attack with Gimli, hurt the troll, then use Feint to avoid getting hit the second time around and then finish it off. The travel tokens from Legolas really add up fast, especially with that dagger. And I can use multiple of the same attachments on one hero? I ran into some trouble with multiple locations in the staging around (4 I think total at one point) adding up to like 8 or 9 threat before I even flipped one of the three mandatory encounter cards, so that crippled me for a bit, but I was able to just stall out in phase 2 and let Legolas pick them up.\n\n \n\nThe scouts in the spirit deck will help to get the locations done, but what is the case with the girl who puts travel tokens on the locations in the staging area? Do they disappear even in the staging area once you reach the token amount or does that just mean when I choose to travel there they will disappear right away as I've already met the requirement?\n\n \n\nMy understanding of how the expansions work is that each deluxe expansion is basically a cores worth of cards with 3 new linked scenarios but without all the cardboard tokens/threat counters (so 12 heroes, multiple encounter decks and more cards for each sphere?). Then the cycles expand the cards of each core/deluxe expansion with a new hero, a new scenario, some new player cards and a new encounter deck.\n\n \n\nThe saga expansions are centered more around re creating the events of the movie, but they still offer unique cards you can't get anywhere else. I am guessing each saga expansion focuses on a part of the game that the deluxe expansions don't? For instance, Hobbits in the Black Riders deluxe expansion?\n\n \n\nI think my best bet is to play through the Mirkwood cycle to expand my deck and give me a good feeling for the game.. then I can pick if I want to go Saga Route and follow the story line or a specific Deluxe expansion to expand an area I like (right now I am really liking the dwarves).\n\nEdited August 29, 2016 by FrogTrigger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2389262","commentId":2389262,"userName":"Kakita Shiro","timestamp":1472437516,"content":"> Were there any other characters? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n>  \n\nGlenn!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2390382","commentId":2390382,"userName":"Noccus","timestamp":1472497608,"content":"@ FrogTrigger:\n\n\n \n\n\nAlright so 4 solo play throughs for Anduin puts me at 2-2. It went loss, win, loss win, first attempt was Leadership/Spirit and from there on it was Tactics/Spirit, this seems to be the best combo in the core?\n\n\n \n\n\nThere is no \"real best\" combo. Although the concensus is that the Spirit deck is indeed the strongest, and the tactics deck by (itself) the weakest.\n\n\nYou might want to give combining the decks a try. Leadership/Spirit (Aragorn/Theodred/Eowyn & Lore/Tactics (Denethor/Beravor/Legolas)\n\n\n \n\n\nThe two wins I got multiple attachments off the back including the dagger that gives Legolas extra damage/travel token, the axe for Gimli (and then later the armor) and the willpower buff for Eowyn.  When I lose it seems to happen when I have trouble finding the attachments, does that make sense?\n\n\n \n\n\nYes, always put your attachments on your heroes asap.  Don't take too big risks to slap one on a hero tho. Like saving a spirit token when you have test of will in your hand, and not giving Eowyn +1wp.\n\n\n \n\n\nI also got lucky on my last win and grabbed my card to lower threat by 6 when I was sitting at 49 and would have went to 50 at the end of the round (or sooner with an unlucky card draw!)\n\n\n \n\n\nI used the tip from that link about waiting the hill troll out and not engaging right away, I mulliganed my spirit starting 6 to get the threat debuff and used it on my tactics deck to drop his threat and buy us a few more rounds to build the troops up. I was able to take a round of troll attack with Gimli, hurt the troll, then use Feint to avoid getting hit the second time around and then finish it off. The travel tokens from Legolas really add up fast, especially with that dagger. And I can use multiple of the same attachments on one hero? I ran into some trouble with multiple locations in the staging around (4 I think total at one point) adding up to like 8 or 9 threat before I even flipped one of the three mandatory encounter cards, so that crippled me for a bit, but I was able to just stall out in phase 2 and let Legolas pick them up.\n\n\n \n\n\nWell done.\n\n\nYes, you can place multiple attachments on the same character. They only can have 2 restricted ones tho. And yes, they can be the same ones, like 2 Gondolin blades.\n\n\n \n\n\nThe scouts in the spirit deck will help to get the locations done, but what is the case with the girl who puts travel tokens on the locations in the staging area? Do they disappear even in the staging area once you reach the token amount or does that just mean when I choose to travel there they will disappear right away as I've already met the requirement?\n\n\n \n\n\nWhenever a location gets the required progress tokens on it, it is explored and you can discard it. Those Northern Trackers rock frogs.\n\n\n \n\n\nMy understanding of how the expansions work is that each deluxe expansion is basically a cores worth of cards with 3 new linked scenarios but without all the cardboard tokens/threat counters (so 12 heroes, multiple encounter decks and more cards for each sphere?). Then the cycles expand the cards of each core/deluxe expansion with a new hero, a new scenario, some new player cards and a new encounter deck.\n\n\n \n\n\nEh not quite. At least player cardwise. You do get 3 quests every delexe expansion.\n\n\nCheck this site and click on cards up above.\n\n\nYou can see the player cards you get per set : http://ringsdb.com/ [http://ringsdb.com/]\n\n\n \n\n\nThe saga expansions are centered more around re creating the events of the movie, but they still offer unique cards you can't get anywhere else. I am guessing each saga expansion focuses on a part of the game that the deluxe expansions don't? For instance, Hobbits in the Black Riders deluxe expansion?\n\n\n \n\n\nThe saga's follow the books, not the movies. And the FFG cycles timeline we play our quests in is also inspired by the books, but happen between the hobbit & lotr books.\n\n\nSo the Hobbit expansions follow the hobbit book, and LotR those books. (and yes, there are hobbits in the lotr books :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png])\n\n\n \n\n\nI think my best bet is to play through the Mirkwood cycle to expand my deck and give me a good feeling for the game.. then I can pick if I want to go Saga Route and follow the story line or a specific Deluxe expansion to expand an area I like (right now I am really liking the dwarves).\n\n\n \n\n\nIf you already own the mirkwood cycle then that is indeed the way to go first.\n\n\nMaybe you can add & remove player cards per new pack, to get to know the new ones.\n\n\nEdited August 29, 2016 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2390403","commentId":2390403,"userName":"FrogTrigger","timestamp":1472498228,"content":"Awesome response, thank you so much. For some reason that ringsdb site crashes my desktop at home, but here at work it loads fine... interesting.\n\n \n\nI get blue screened at home. But an amazing resource.\n\n \n\nSo for deck building it has me confused, is it better to build a hybrid deck and play solo? Or play solo with two different decks (players)? Or two different hybrid decks (players)? lol\n\n \n\nAnd if I am playing with a friend, is it better to have someone full support like lore/spirit and leadership/tactics or mix and match?\n\nEdited August 29, 2016 by FrogTrigger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2390433","commentId":2390433,"userName":"manoftomorrow010","timestamp":1472498952,"content":"> Awesome response, thank you so much. For some reason that ringsdb site crashes my desktop at home, but here at work it loads fine... interesting.\n> \n>  \n> \n> I get blue screened at home. But an amazing resource.\n> \n>  \n> \n> So for deck building it has me confused, is it better to build a hybrid deck and play solo? Or play solo with two different decks (players)? Or two different hybrid decks (players)? lol\n> \n>  \n> \n> And if I am playing with a friend, is it better to have someone full support like lore/spirit and leadership/tactics or mix and match?\n\n \n\nMy partner and I are in the early cycles, since we're playing progressively and waiting for Khazad-dum to be off the boat.\n\n \n\nWe first played through the Core & Mirkwood cycle with 2-1 decks, two heroes of the same sphere, and 1 of a different. She used Tactics (2) and Lore (1), and I used Spirit (2) and Leadership (1).\n\n \n\nSince we're waiting for Khazad-dum, we made new decks, this time I'm using Spirit (2) and Lore (1) and she's using Tactics (2) and Leadership (1). We both are using 1 new Hero this time around.\n\n \n\nI'm more powerful in questing, healing, card draw, and she's more powerful in generating resources and combat. So we split the duties in that fashion, it works out pretty well, because she only has to commit 2 Heroes to quest and has good defending/attacking allies from Tactics and Leadership.\n\n \n\nI have not played solo, so I can't speak to how to build a tri-sphere deck, or anything like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2391134","commentId":2391134,"userName":"FrogTrigger","timestamp":1472526684,"content":"Thanks for the tips, might not be a bad idea for me to grab Kazad-dum while it is actually available as well..\n\n \n\nSo I tried my first multi sphere deck build, first question, can you put attachments from one sphere on a character of a different sphere? So can I buy a spirit attachment with spirit only resources and attach it to a leadership character? If so, I understand the hype behind multi sphere, if not then I am left a little confused.\n\n \n\nIf so I had an epic round of Anduin where it came into the mid 40's for threat and things were up in the air, Gimli died but I was able to buy Faramir the next round, I got lucky flipping the Hill Troll as one of my two initial flips so I had one less card right off the bat. I did the usual build the team up first and then engage with Gimli as the meat shield. He ended up dying to a shadow effect afterwards, should have healed him when I had the chance but he just hits so **** hard wounded!\n\n \n\nI used Legolas, Gimli and Theoden... not in love with my Theoden choice really, I honestly feel like I could have just went full tactics instead. But my other deck was Eowyn and Denethor and the elf with 3 willpower/ 3 melee. Lets call him Elf. Elf and Eowyn stacked for 9 willpower each round with their attachments, then I ended up getting the +2 willpower attachment for Eowyn as well in phase 2. So combined they did 11, this allowed me to just blow through the travel tokens. Especially combined with Legolas and one of the daggers that gives him +1 travel token.  I also had it set up so Denethor could take a hit and then the next round I would save Elf to do 3 damage along with some allys and take out whatever needed to be taken out. This freed up my tactics and leadership side to take on the tougher mobs and keep us free of engagements. \n\n \n\nDefinitely the most fun I've had and I understand now the whole 'deckbuilding' hype... assuming I did it correctly?\n\nEdited August 30, 2016 by FrogTrigger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2391162","commentId":2391162,"userName":"Kakita Shiro","timestamp":1472528283,"content":"> Thanks for the tips, might not be a bad idea for me to grab Kazad-dum while it is actually available as well..\n> \n>  \n> \n> So I tried my first multi sphere deck build, first question, can you put attachments from one sphere on a character of a different sphere? So can I buy a spirit attachment with spirit only resources and attach it to a leadership character? If so, I understand the hype behind multi sphere, if not then I am left a little confused.\n\nUnless the attachment itself says that it can only be attached to a particular type of hero or a hero with a particular trait, then you can put it on any qualifying Hero you'd like- even another player's Heroes! Edited August 30, 2016 by Kakita Shiro"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2391868","commentId":2391868,"userName":"FrogTrigger","timestamp":1472573930,"content":"Now THAT is cool, now I really understand the importance of deck building and making sure you and your partner compliment each other. So I can even buff up say my partners Gimli with the healing attachment.\n\n \n\nSo if a character has two restricted attachments they can still have additional non-restricted attachments? Say a total of 3, 2 restricted 1 that isn't?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2391885","commentId":2391885,"userName":"PocketWraith","timestamp":1472574788,"content":"Yeah, aside from observing any restrictions mentioned on the attachments (like Restricted or Limit 1 per hero) they can be combined with whatever else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2397733","commentId":2397733,"userName":"FrogTrigger","timestamp":1472888283,"content":"Ok so we had another full playthrough tonight and failed on Anduin 3 times. We took a break to play Hunt for Gollum, had a lot of fun on that mission and we beat it by the skin of our teeth basically blitskrieging the last stage with 2 Gandalfs (1 per player) to get just enough.  But ya, this game is hard. I was pretty disappointed with the upgrades in HFG to.. kind of makes me not want to bother with the cycles and just buy the big boxes. 2 cycles = 1 big box in price.\n\n \n\nI can't figure out if its better to just stick to one sphere with the core deck, or go multi sphere with a full support and full attack deck, or mix and match or what, nothing seemed to work tonight."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2397959","commentId":2397959,"userName":"Kakita Shiro","timestamp":1472909618,"content":"2 Gandalfs? Surely not simultaneously as that would break the Unique rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2398024","commentId":2398024,"userName":"CaffeineAddict","timestamp":1472914936,"content":"> I was pretty disappointed with the upgrades in HFG to.. kind of makes me not want to bother with the cycles and just buy the big boxes. 2 cycles = 1 big box in price.\n\nThe player cards in the early cycles were quite mixed...overall, player cards in the last couple of cycles have been a much higher quality."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2398097","commentId":2398097,"userName":"FrogTrigger","timestamp":1472918884,"content":"Yes they both were at the same time and I realized that was an error last night after I posted this. We used Gandalf to lower threat which didn't change anything, and his extra insight actually didn't even help in the quest as we won with 6 extra committing everyone. So it was an error, but we would have won anyway. But good to remember moving forward.\n\n \n\nAnd what about Bilbo? I was thinking ok maybe a new hero will help give us an advantage in Anduin, he seems like a total liability? Would you suggest skipping this cycle and just going straight on to a different expansion/cycle? \n\n \n\nI have to admit the Gollum quest was fun, I like how it was all about travelling and picking up these clues and Gollum being elusive and if you lose a clue you have to go back to phase 2, it is very clever and thematic.\n\nEdited September 3, 2016 by FrogTrigger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2398128","commentId":2398128,"userName":"Kakita Shiro","timestamp":1472920579,"content":"> Would you suggest skipping this cycle and just going straight on to a different expansion/cycle? \n\nDon't skip. Boromir, Dain, eagles, Gildor Inglorion and Dunedain signals are all decent (or in the case of the first two, utterly insane) cards and all still see some play years later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2398837","commentId":2398837,"userName":"jjohnson111","timestamp":1472972589,"content":"> Now THAT is cool, now I really understand the importance of deck building and making sure you and your partner compliment each other. So I can even buff up say my partners Gimli with the healing attachment.\n> \n>  \n> \n> So if a character has two restricted attachments they can still have additional non-restricted attachments? Say a total of 3, 2 restricted 1 that isn't?\n\nTo add a small addendum to the restricted rule: if you have two restricted attachments on a character, and you attempt to play a 3rd, you can choose to discard one of the first two in order to allow for the new one to attach. (pg 24, core rule book)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2398865","commentId":2398865,"userName":"Noccus","timestamp":1472978057,"content":"> Ok so we had another full playthrough tonight and failed on Anduin 3 times. We took a break to play Hunt for Gollum, had a lot of fun on that mission and we beat it by the skin of our teeth basically blitskrieging the last stage with 2 Gandalfs (1 per player) to get just enough.  But ya, this game is hard. I was pretty disappointed with the upgrades in HFG to.. kind of makes me not want to bother with the cycles and just buy the big boxes. 2 cycles = 1 big box in price.\n> \n>  \n> \n> I can't figure out if its better to just stick to one sphere with the core deck, or go multi sphere with a full support and full attack deck, or mix and match or what, nothing seemed to work tonight.\n\n \n\nHFG has some good cards in it: Dunedain mark, Campfire tales (better with more players), Eagles, Rohan (you need more from other packs tho) Rivendell minstrel & Song of kings.\n\nAll of these still hit the table. \n\nHero Bilbo is too expensive at 9 threat in my book. At the time there was a lot of discussion on who was better Bilbo or Beravor. I'm Beravor all the way.\n\n \n\nAnyway, like Shiro I'd also advice you not to skip. The next pack has a great quest, and some good player cards too.\n\nFrodo is a great hero. You'll also get Dunedain warning, eagles & rohan, burning brand & song of wisdom. \n\nEspecially burning brand. If you play Lore, slap it on Denethor. You will not be disappointed.\n\n \n\nSo how's the deck building going?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399198","commentId":2399198,"userName":"FrogTrigger","timestamp":1473007035,"content":"I actually went back to using the core supplied decks and added in the cards from HFG. HFG seems to easy not sure if I am doing something wrong but with the spirit allies I just destroy all of the locations. Anduin is still really tough, but I've beat it 2 times in a row now, one with 48 and 47 threat and again this morning I 'threated out' on my Spirit deck with on the very last stage but was able to kill the few monsters that spawned with my tactics side. Tactics/Spirit seem so powerful together, I don't see the need to water them down just yet. I also find it very hard to play without the \"cancel revealed effects and draw another card\" buff from the third hero in the spirit deck, her name escapes me at the moment. I find that the \"increase threat by X amount of players not committed to the quest\" and :\" deal 1 damage to every character when over 35 threat\" cards to be the most devastating, so I need to always have her ready as I can't rely on card draw. And the game is always so much more fun when you actually win lol. Especially when they are close games like I've had.\n\n \n\nFor the record I don't think that playing with one deck is better than split deck, I think the fact I was losing when I split the decks is just a reflection on my lack of knowledge/skill of the game. So playing withe the pre made decks helps me learn which cards are more powerful. For instance, when I first got the Eagles I didn't think they were good at all and didn't use them, now that I have though I could probably never leave them out of my deck! 1 token to basically block any monsters damage besides a Hill Troll or buffed Hydra. I think the next time I split deck I need to try Berevor, she seems so powerful but I always use Glorfindel.\n\n \n\nMy LGS is out of the next 2 cycle packs, is there a problem with me skipping a few ahead and then going back for those other decks when they get in?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399266","commentId":2399266,"userName":"Authraw","timestamp":1473011366,"content":"> My LGS is out of the next 2 cycle packs, is there a problem with me skipping a few ahead and then going back for those other decks when they get in?\n\nNot really. There's a loose narrative that strings the quests of the cycle together, but actually in HFG the second and third quests feel kind of like side quests, so you could easily skip them for now and play them later as standalone scenarios with almost no change to the experience.\n\n \n\nThe narrative part of the game gets better starting with the Heirs of Numenor + Against the Shadow cycle; up to that point you can pretty much play quests as independent entities without really changing the experience.\n\nEdited September 4, 2016 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399564","commentId":2399564,"userName":"Rajam","timestamp":1473029952,"content":">  \n> \n> > Would you suggest skipping this cycle and just going straight on to a different expansion/cycle? \n> \n> Don't skip. Boromir, Dain, eagles, Gildor Inglorion and Dunedain signals are all decent (or in the case of the first two, utterly insane) cards and all still see some play years later.\n> \n>  \n\n \n\nAlso, A Burning Brand!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399596","commentId":2399596,"userName":"PocketWraith","timestamp":1473031900,"content":"> The narrative part of the game gets better starting with the Heirs of Numenor + Against the Shadow cycle; up to that point you can pretty much play quests as independent entities without really changing the experience.\n\nEven then it's still totally reasonable to play the quests without being too bothered about the ongoing story. It's just that if you are paying attention to the story, from that point it's a better story."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399760","commentId":2399760,"userName":"FrogTrigger","timestamp":1473044177,"content":"I picked up Dead Marshes tonight and played through the mission, very fun. I think I got pretty lucky with how things worked out for me but I can definitely see this being a frustrating mission as that elusive Gollum keeps slipping away. Off the bat I got dealt two Sneak Attacks and Gandalf in my mulligan deal, so I knew things wouldn't be to bad at the start. I knew the Hill Troll was in this deck so my odds of seeing him were good.\n\n \n\nI am not getting advanced enough yet to post my whole build, but I am getting there, lol. The heroes I took were Theodred, Boromir (he is a beast) and Thalin in my tactics/leader deck and my Eowyn, Dunhere and Beravor in my spirit/knowledge deck. I worked on getting a few allies up off the bat to help me with questing and enemies. This is definitely a light enemy deck, I didn't end up taking a lot of damage (But did run in that cave troll!) I used Gandalf on both decks (separate rounds!) to keep my threat down and build up the troops before engaging the troll. I pulled a Hydra (40 threat I forget the real name) at the same time but I was able to pick him off a round at a time in the staging are with Dunhere (gave him Dunedain mark, great upgrade from HFG). I eventually took on the Hill Troll with Boromir taking me to one health, then I took him down 4. Next round I sneak attack with Gandalf to finish off the troll before he can hit anyone, but I also healed Boromir to full from the knowledge side.\n\n \n\nThe rest of the mission was pretty easy going. Not a lot of enemies were faced, I got lucky with a bunch of them showing up in the escape tests. I put steward of Gondor on Beravor and just kept exhausting her each turn to draw cards then churned out allies like you wouldn't believe. One thing I thought I should check, is there a limit to the number of allies you can have at one time? Like I don't see that symbol on the tracker or scout, but it is on Elfhelm (which makes sense as you could chain lower threat I guess). By the time this mission was over my threat was just hovering around 40 and I had a staggering amount of allies to make sure I actually caught Gollum. He did escape me once, which put me back to the drawing board, but I was smart this time and I dragged my feet to build up my troops. I kept the first stage right around 9, 10, 11 travel tokens making sure not to commit to much (even took a few threat guessing low) and not kill with Boromir who had the dagger that gives tokens. Then Gollum finally appeared again and I committed, I engaged an enemy that also flipped from the deck, killed him with Boromir giving me the 1 token I needed to advance stages. Then I blew through the quest phase and committed a staggering 14 willpower for the escape check on a Gollum with 0 tokens :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] Not even sure if I had to draw a card? But I did anyway. In fact I drew 4 for fun and still won handily.\n\n \n\nGranted I played this right, I had a lot more enjoyable experience with my mixed sphere decks than Anduin, this was much less frustrating. I understand that Anduin has a lot more enemies, maybe that is my problem. The escape tests were tough as you are constantly losing people, so I figured out fast that allies with willpower are very key in this one. But very thematic, you track him through the marshes which takes a lot of tokens and it should, then you finally get him cornered, a short distance to travel to close the gap but one last test... oh no you failed, now he runs away again and you have to go looking for him, stumbling through these locations and fighting the monsters you run into on your way (were there Hill Trolls in the marshes though? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]) Very neat and immersive.\n\n \n\nOverall I think this deck is quite useful. Boromir alone is worth buying, that paired with the thematic quest makes me happy I got it. Again I found the booster cards a little under whelming, but I think they need to just grow on my like the last deck did. I see now how these are quite specialized towards building certain decks, like healing Silvans or We Do Not Sleep letting you use all of your Rohans to quest without exhausting. Elfhlem seems to be the most interesting, I didn't get a chance to use him this quest and he is pricey, but being able to curb the damage of that pesky raise your threat for each character seems tempting, especially with great stats. I really like the Eagles card as well, just a cheap hit and run tactic again that is very thematic. The songs I am still trying to figure out, but I am starting to see their merit. There were a couple times that being able to pool resources would have been very useful, so being able to attach a sphere to a character would come in handy. So many choices! And i'm not even 5% through this yet, lol!\n\n \n\nI found it odd that this quest has a difficulty rating of 5, and HFG is 4.. and Anduin is 4. I would rank it Anduin: 5, Dead Marshes: 4, HFG 3.\n\nEdited September 5, 2016 by FrogTrigger"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399841","commentId":2399841,"userName":"John Constantine","timestamp":1473051516,"content":"Don't pay any attention to difficulty ratings. They almost never represent the actual deal. One of the hardest quests in the game is marked by a flimsy rating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399853","commentId":2399853,"userName":"Bellator Sardel","timestamp":1473052205,"content":"Yeah, the \"official\" ratings of the quests aren't consistent, and sometimes, you bring a deck that just has the tools to turn a rough scenario into an easy one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2399917","commentId":2399917,"userName":"987654321","timestamp":1473061953,"content":"There's no limit on the number of allies you can get. Just the uniqueness rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400437","commentId":2400437,"userName":"FrogTrigger","timestamp":1473096127,"content":"So I went to RingsDB and put my decks on there for feedback. These are the decks I used to beat Dead Marshes and have tried Anduin but lost with. I've tried a few variations of heroes and cards but the majority are the same (since my choices are so limited with just core + HFG + Dead Marshes).\n\n \n\n \n\nMy Spirit/Lore deck:\n\n \n\nhttp://ringsdb.com/deck/view/23681 [http://ringsdb.com/deck/view/23681]\n\n \n\nMy tactics/leadership deck:\n\n \n\nhttp://ringsdb.com/deck/view/23688 [http://ringsdb.com/deck/view/23688]\n\n \n\nBasically I just try to get as many allies going as I can while keeping my threat below 30 for the Hill Troll and 35 overall. As I get the resources I throw out attachments, making ones like Steward of Gondor or Mark of Dunedain priority. I like to get a Mark on Dunhere so he can hit enemies for 4 in the staging area (pesky Goblin Archers in Anduin)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400468","commentId":2400468,"userName":"Rajam","timestamp":1473098095,"content":"> Don't pay any attention to difficulty ratings. They almost never represent the actual deal. One of the hardest quests in the game is marked by a flimsy rating.\n\n \n\nWhich one are you thinking in here? \"Into Ithilien\" ranked with a 4?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400569","commentId":2400569,"userName":"Calvadur","timestamp":1473103505,"content":"> So I went to RingsDB and put my decks on there for feedback. These are the decks I used to beat Dead Marshes and have tried Anduin but lost with. I've tried a few variations of heroes and cards but the majority are the same (since my choices are so limited with just core + HFG + Dead Marshes).\n> \n>  \n> \n>  \n> \n> My Spirit/Lore deck:\n> \n>  \n> \n> http://ringsdb.com/deck/view/23681 [http://ringsdb.com/deck/view/23681]\n> \n>  \n> \n> My tactics/leadership deck:\n> \n>  \n> \n> http://ringsdb.com/deck/view/23688 [http://ringsdb.com/deck/view/23688]\n> \n>  \n> \n> Basically I just try to get as many allies going as I can while keeping my threat below 30 for the Hill Troll and 35 overall. As I get the resources I throw out attachments, making ones like Steward of Gondor or Mark of Dunedain priority. I like to get a Mark on Dunhere so he can hit enemies for 4 in the staging area (pesky Goblin Archers in Anduin).\n\nI can't view your decks, It says: \"You are not allowed to view this deck. To get access, you can ask the deck owner to enable \"Share my decks\" on their account.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400587","commentId":2400587,"userName":"FrogTrigger","timestamp":1473104825,"content":"Oh sorry should be fixed now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400724","commentId":2400724,"userName":"Calvadur","timestamp":1473111633,"content":"Some things I would do:\n\n \n\n1. Cut down to 50 cards. For example: Tactics/Leadership take out: Grim Ressolve, Brok Ironfist, Long Beard Orc slayer, 2x Ever vigilant, Swift Strike, 3x Snowborn Scout and ADD one Gandalf from the other deck (to increase the Chance of sneak attack + Gandalf) and in Spirit/lore: 2x Power of the earth, Fortune or Fate (you shouldn't Need it), Beorn's hospitality (shouldn't Need that as well) add 2x Westfold horse-breaker.\n\n \n\n2. Both decks have more Cards and Overall cost in the sphere where only 1 hero is represented. You might want to redesign the hero line-up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2400856","commentId":2400856,"userName":"FrogTrigger","timestamp":1473118931,"content":"Thanks for the tips I'll try that out. My friend came over to play again today and we beat Anduin (finally) and Dead Marshes. Anduin was a tough battle but it was our 6th or 7th try so we got it down now. Dead Marshes was tough but we went all in at the end and won the escape test by 1 to get Gollum. Then we tried the third quest in the core snd got smoked. We didn't even get one progress token lol, ended up with 8 locations in the staging area just pummelling us. Really needed to draw a tracker but it didn't happen. Next time maybe, but we might not try that one for a little while lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405410","commentId":2405410,"userName":"FrogTrigger","timestamp":1473348801,"content":"Alright so I've played Dol Guldur 3 times over the past few days and beat it twice. I was using very similar decks to what I posted before, but I did trim them down. The spirit/lore deck is down to 40 cards, nice and tight, and the tactics/leader deck is down to 51 shedding a lot of the high cost units.\n\n \n\nOne thing I learned from reading Beorn's Path is that it is ok to take a risk on shadow cards when it can put you a big step forward in the game. Before I was obsessed with making sure I blocked every attack, but that just led to me being either swarmed by enemies or not making quest progress. It seems better to get offensive than defensive, which as a guy who has played a lot of sports this makes a lot of sense to me.\n\n \n\nI was using Gimli, Thalin and Theodred and Eowyn, Beravor and Dunhere. Both times I won it was Theodred who got captured and the time I lost it was Eowyn. Honestly, that is my one complaint about this game. The luck factor can sometimes be so bad that you might as well just start over. I never had a shot with Eowyn down and no tracker/steward of gondor to build up my spirit resources. But with Theodred down I wasn't able to play any cards from leadership, but I did however still win almost all of my quests. I think that Tracker is the most broken card for this quest, the mission I lost I had no Eowyn and no tracker and the locations just over whelmed me, same as before. The times I won I got tracker either right off the bat or used Beravor to find it fast and from then on it was easy street, especially after I got my lore healing ally. The one ally per turn for both players does make things a bit tougher, but it just makes it a slow build. I was unlucky to draw the exhausted characters take 1 damage twice in a row and that took Thalin down early, but luckily I had Brok Ironfist waiting in the wings and he stepped in no problem. Steward of Gondor is definitely the most powerful card in the game so far, the extra 2 resources is just out of hand. I can basically play any card I want, even 5 cost cards are no problem.\n\n \n\nBoth times I won I saved Gandalf and used him twice, one round at a time, to hit the Nazgul taking him down to 1 health left, then I just used Seward of Gondor (Beorn's tip) or swift attack on an injured Gimli with his axe, or the other card that lets me do 2 damage as a defender to finish it off. Worked like a charm. Before I hit 40, and if I was at 40 I would use my spirit card to get back down in threat, I would make sure I had a good run at the quest basically committing every single player I had and discarding two cards. It seems like to win this the key is to move fast. I did not find the objectives to be intimidating at all, without the treachery card that makes you raise threat for exhausted characters I found it a lot easier to keep threat down. The can't attack or defend went on Beravor as she is always either questing or giving cards, the damage went on Dunhere who has 4 and got healed up by the lore ally that heals and the threat one I put on my tactics side which as I said was never really an issue.\n\n \n\nSo it seems like I might now have a formula that works, after failing a good 5 or 6 times and reading up on Beorn's guide. I didn't find that any of the cards from the cycle packs I bought were a big help either, I think the core is sufficient for beating this with the above strategy. I want to try it again now with different heroes/builds and see how I do. I wonder if I could beat it without Eowyn?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405425","commentId":2405425,"userName":"Calvadur","timestamp":1473349321,"content":"Glad your results improved.\n\n \n\nOne thing: The mimimum amount of cards for a \"legal\" deck is 50 cards. So when is said trim down, I ment to 50 cards as both of your decks had more and I found some of them unnessecary. Sorry if my comment wasn't clear enough :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405835","commentId":2405835,"userName":"capnhoppy","timestamp":1473366234,"content":"Are you attacking the Nazgul without engaging him first?  That's a no-no unless you have specific cards that let you do it.\n\n \n\nI ask because you mention keeping your threat below 40 AFTER you talk about taking him out.  If I misunderstood my apologies.\n\n \n\nI beat this quest for the first time myself last night after 5-6 failed attempts.  Very pleased."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405862","commentId":2405862,"userName":"John Constantine","timestamp":1473367324,"content":"You can optionally engage nazgul even if your threat is below 40, you know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405894","commentId":2405894,"userName":"FrogTrigger","timestamp":1473368980,"content":"I used Gandalf to hit him in the staging area which I assume is OK as it just says an enemy 'in play'? Then I did have to engage him to let him impale himself on the gondor spear.\n\n \n\nAbout the deck size, I didn't think it really mattered for casual play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2405924","commentId":2405924,"userName":"NathanH","timestamp":1473370077,"content":"Strictly speaking there are no rules for constructing \"non-tournament\" decks, so depending on your point of view you can take that to mean that you are not allowed to use any decks apart from a) the 30-card starter decks and b) 50+ card decks with no more than 3 copies of a card; or that you can make whatever decks you please for \"non-tournament\" play.\n\n \n\nIn practice, once you have a card collection of more than the Core Set and a couple of packs, you should try to follow the 50 card rule just because doing anything else will quickly make your deck too efficient. A good way to work out whether you've reached that point is to try to make 50-card decks and ask yourself \"Have I put a bad card in this deck?\" If the answer is yes, then you don't have enough cards yet and I would advise going under 50. If all 50 cards are at least decent then use the 50-card deck.\n\nEdited September 8, 2016 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2406017","commentId":2406017,"userName":"dalestephenson","timestamp":1473374987,"content":"I'd use the touchstone for 50-card decks to be this -- if you're asking yourself \"what else can I put in this deck to get to 50\", don't worry about having a 50-card deck.\n\n \n\nHere's how long it took Beorn's Path to get to 50 cards:\n\n \n\nLeadership/Lore, core: 40 cards\n\nSpirit/Tactics, core: 40 cards\n\nLeadership/Lore, AP1: 45 cards\n\nSpirit/Tactics, AP1: 43 cards\n\nLeadership/Lore, AP2: 50 cards\n\nSpirit/Tactics, AP6: 50 cards (not improved for AP2-AP5)\n\n \n\nThe tri-sphere back-to-basics deck (core only) is at 42 cards, and the creator identified 8 different cards that he would *consider* adding to it in AP1-AP6, even using 3x of each (unlikely) wouldn't get to 50 before AP3.\n\n \n\nIf you are running mono-sphere, I doubt you have enough good cards to get to 50 even with the entire Mirkwood cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2407302","commentId":2407302,"userName":"capnhoppy","timestamp":1473446324,"content":"> I used Gandalf to hit him in the staging area which I assume is OK as it just says an enemy 'in play'? Then I did have to engage him to let him impale himself on the gondor spear.\n> \n>  \n> \n> About the deck size, I didn't think it really mattered for casual play?\n\nYup!  Totally fine.  I did that on one of my failed attempts.  I had two sneak attacks and Gandalf in hand ready to go.  Then when I turned over the bad guy cards during questing I got hit with two \"1 point of damage on all exhausted character\" treacheries.  Wipe soon followed..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2409078","commentId":2409078,"userName":"FrogTrigger","timestamp":1473569621,"content":"Played a few more quests with this set up, I think I need to house rule a few cards because all the Gondar related resource cards seem to break the game. Not calling it easy, but I never seem to run out and it can really make things one sided.\n\nI like the thread that is already going about this, some good solutions in there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2429159","commentId":2429159,"userName":"FrogTrigger","timestamp":1474743865,"content":"Picked up Journey to Rhosgobel and Return to Mirkwood today. I haven't really played the cycles in order as I've had to wait for them to become available at my local stores.. I still can't find a copy of Conflict at the Carrock unfortunately. Rhosgobel was fun, I got lucky in that I had exactly enough plant regen for the bird to win in stage 3. Didn't see that twist coming at all, so it was pretty cool. I switched up my hero order bringing the Dale hero to shoot down the bats and crows for me. I got unlucky with a Caught in the Web right off the bat, but then I got lucky in that none of the deal damage while exhausted cards came up in the encounter deck. It was a quick win, I am going to try it again today and probably won't be as lucky.\n\n \n\nI haven't tried Return to Mirkwood yet, I wanted to re play all of them in order first before I finished the cycle.. but I don't think I will be able to wait for Carrock.  Then I will be moving on to Kazad Dum! Which seems to have even less cycle packs available.. lol. Oh the joys of joining in late!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2429201","commentId":2429201,"userName":"dr00","timestamp":1474746060,"content":"> Picked up Journey to Rhosgobel and Return to Mirkwood today. I haven't really played the cycles in order as I've had to wait for them to become available at my local stores.. I still can't find a copy of Conflict at the Carrock unfortunately. Rhosgobel was fun, I got lucky in that I had exactly enough plant regen for the bird to win in stage 3. Didn't see that twist coming at all, so it was pretty cool. I switched up my hero order bringing the Dale hero to shoot down the bats and crows for me. I got unlucky with a Caught in the Web right off the bat, but then I got lucky in that none of the deal damage while exhausted cards came up in the encounter deck. It was a quick win, I am going to try it again today and probably won't be as lucky.\n> \n>  \n> \n> I haven't tried Return to Mirkwood yet, I wanted to re play all of them in order first before I finished the cycle.. but I don't think I will be able to wait for Carrock.  Then I will be moving on to Kazad Dum! Which seems to have even less cycle packs available.. lol. Oh the joys of joining in late!\n\n \n\nluckily with the Mirkwood cycle, you can play them out of order and not feel that you are ruining the overall story.  each pack kind of seems like its own separate story instead of another point in time in a continuing arch\n\n \n\nthat said, Carrock is a pretty fun quest.\n\n \n\n \n\ni would also say that some of the earlier quests ended up being kind of trivialise by later player cards, so you may homerule some of these things now, but i wouldn't get too attached to them.  you'll find the difficulty ramp up quite a bit when you enter Moria ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nyou'll also find the story a bit more put together (imo)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2451809","commentId":2451809,"userName":"FrogTrigger","timestamp":1476196927,"content":"Alright so I finished the Mirkwood cycle with a friend, sans Carrock as I can't find that in print just yet, and we had a blast. Every mission took us more than one try to get through, some more, besides Hunt for Gollum and Return to Mirkwood, so I was really impressed with the challenge of the game. The last mission was really fun and it was just random luck that got us through. We were playing Leadership/Tactics with Aragorn, Thalin and Theodred and Spirit/Lore with Eowyn, Eleanor and Beravor. We built our decks around canceling shadow and when revealed effects and bringing along strong allies.\n\n \n\nWe got a very un lucky deal 4 damage to a player with Gollum early (after negating the second discard 10 cards in a row) which forced me to choose between Eleanor and Beravor.. I obviously wanted the ability to counter when revealed effects to try and prevent this from happening again so I went with Beravor. The next round we got a bit of luck on our side by drawing Steward of Gondor and then after that the song to let Aragorn have a tactics sphere, this combination would basically save our bacon as my tactics/leadership side would be able to build a plethora of allies through out the scenario.\n\n \n\nSo round 1 Beravor is out and we are soldiering on, I bought a Ranger to help clear threat in the staging area as many of the locations had nasty travel effects. We soldiered on and basically just focused on questing strong and letting my tactics guy meat shield as much as possible. We had to take a few risks with some un defended attacks which put Gollum's health down a bit which was scary. We got to the stage where he attempts to escape after dealing with a Hill Troll and using Gandalf to kill the Hummerhorns, and were able to quest successfully to keep playing the game. The next round made it so my buddy couldn't quest as he was guarding Gollum, so I had been saving for Gandalf and the timing couldn't be better, him and Ewoyn combined with the other allies I had bought were able to blow through this stage in one round thankfully. So Thalin wasn't committed to the quest and we just happened to draw the bats that surge, then the warg rider that surges, lol, into a tough enemy that hits for 8. This took us to the next stage, which couldn't have worked out better as my buddy had all heroes and allies readied since he couldn't quest with them and even though we were facing a lot of enemies, he was able to kill all of them in one round (taking a few undefended attacks that worked out to Gollum finishing with 3 health). But we had various shadow card cancelling effects that we didn't even have to use (the spirit cards, the leadership ally you discard, the leadership card that came with Return to Mirkwood).\n\n \n\nI did end up using both of my cancel when reveals and Eleanor every round,and then I used my spirit card to bring one of those cancel the when reveals back. So we were very cautious and meticulous with our planning and it paid off in the end. Controlling the surprises in the deck unsurprisingly results in a much smoother gameplay experience and now that we have so many options to do so it worked out great. We finished with me in the mid 30's for threat and my buddy who had kept Gollum most of the game (didn't see many effects to switch him over) had 45. So we had 1 more round, maybe 2 if I could lower his threat (again), but chances are we would have lost if it went that long.\n\n \n\nOverall this cycle was a lot of fun, a good mix of challenging and fun scenarios that were all very, very thematic. We were so impressed how good of a job they do making the story come to life and keeping everything so accurate and immersive. Now the trick is figuring out where I want to go next. Do I keep following the deluxe/cycle path or do I branch off and start following the campaign? Any recommendations?\n\n \n\nIt is a tough decision to make. I think we have a few more sessions of this cycle to figure it out though as we want to try out different heroes. I feel like we had figured out the most powerful combination by the end, me alternating between Dunhere and Eleanor and my buddy alternating between Gimli and Aragorn but keeping the other two the same. It would be nice to see if we can beat the scenarios with other combinations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2451986","commentId":2451986,"userName":"Calvadur","timestamp":1476201615,"content":"Glad you enjoyed the cycle, look forward to the carrock as it is one (if not the) best pack of the cycle. Nice mirkwood playthrough. Personally I always let the 10 discard happen has the card does else if memory serves essentially doing no direct harm as you probably won't run out of cards. Of course it sucks to discard all copies of e.g. a test of will, but it could be an unneeded copy of Steward and gleowine, too.\n\n \n\nAs you have Dain Ironfood I would suggest going for Over Hill and Under Hill or Khazad-Dum next as they give you some dwarves to use Dain. Personally I went Khazad-Dum with it's cycle before the hobbit Sagas. I have great memories of nearly all 9 quests and there were so many great Player Cards that fit into many decks (though Over Hill Under Hill has These Kind of Cards too, besides it's dwarf Support). Things like Arwen or Warden of healing are till today pure value.\n\nThe cycle can prepare you for the following heirs of numenor quests (which have some terrible Encounter Cards) as Khazad-Dum and it's cycle itself have some nasty stuff (*cough* sleeping sentry *cough*).\n\n \n\nHave fun :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2453375","commentId":2453375,"userName":"FrogTrigger","timestamp":1476285606,"content":"I also figured out why some of these quests might seem easier than normal, there are some pretty big decisions that we made where if we weren't able to tell each other what we planned to do long term things could have gone very wrong. I think ignoring the table talk room also takes away a big element of the challenge.. but I just did not have fun trying to play with it in. There is always just dumb luck, you draw one really good card early and it can tilt the whole match (Steward of Gondor, Unexpected Courage etc.).  Either way I had a lot of fun.. I just .. kind of wish I got a bit more bang for my buck. I understand that I can go back and play it as many times as I want, but I more expected to fail a few times (we didn't' read the quest text or the encounter deck ahead of time) and then have to go back to the drawing board than say beat the quest in a hour."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2453434","commentId":2453434,"userName":"Authraw","timestamp":1476286897,"content":"I don't know anyone who actually follows the table talk rule. It's too easy to subvert just by using careful language that it just becomes an exercise in speaking in code.\n\nI don't usually hear people saying that they had too easy of a time this early in the game. I suspect that you would find most of the Khazad Dum + Dwarrodelf quests to be in a similar vein, then.\n\nIf you're looking to lose a little more, you have a few options: You could skip to Heirs of Numenor, where the difficulty ramps pretty noticeably, or you could try buying the Nightmare upgrades for some of the quests you found to be too easy. I'm not 100% sure your cardpool is quite big enough to be competitive there, but I suspect with good enough decks you should be able to pull out a win. If not, then it at least gives you something to shoot for and come back to until you have the cards you need to master it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2454265","commentId":2454265,"userName":"FrogTrigger","timestamp":1476310011,"content":"I don't want to use the term to easy, as this game is anything but easy. I think maybe I just figured a few things out that clicked well for us on the last scenario, but there is so much luck involved that perhaps a few different card draws and we were back to the drawing board. I've made sure to move slow as well, I've watched play throughs from other people to make sure I am not missing anything important. It is easy to call something easy when you are just doing something wrong :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] \n\n \n\nWe are going to try playing through again this weekend using different hero combinations and see what happens. We both still really enjoy the game, I just don't want to move to fast and furious and blow through 400 dollars worth of content. At what point do you start shifting your deck from Best cards I can find to actually focusing on specific words like an Eagle deck or Rohan deck etc.. ? I imagine the dwarf cycle will help build a really strong dwarf deck, then it just follows from there? Are there more eagle cards or Rohan allys coming? etc.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228718-frogtriggers-ongoing-question-thread/?do=findComment&comment=2454461","commentId":2454461,"userName":"FeloniusBard","timestamp":1476318809,"content":"In my experience, I couldn't even begin to start building \"thematic\" or keyword-associated decks until I had 3 or 4 of the Mirkwood cycle packs, the Khazad-Dum deluxe and 3-4 of its expansion packs, and The Black Riders. I skipped the Hobbit saga boxes because I frankly just don't like dwarfs, but it's absolutely true that if you want to get good, powerful decks early in your buying cycle, it's easiest to do with dwarfs (Khazad-Dum + Return to Mirkwood + 2 Hobbit saga boxes). \n\n \n\nEven then I wasn't building keyword-associated decks that were actually good, but they were at least functional. I bought the Heirs of Numenor and a couple of its associated packs, but I never cared for the theme, so I mostly just pooled the cards into what I already had. \n\n \n\nThe Voice of Isenguard + Ringmaker cycle had some fun, interesting character cards, but the quests were totally hit and miss. I would only buy the packs if there was something highly specific that would fill out a deck I was already planning. \n\n \n\nAssuming you've bought most of what came before, the game really hits its stride with the Road Darkens saga box and the Lost Realm deluxe box. After that, all of those little pieces, those cards that had you thinking, \"What am I going to do with this?\" actually start coming together.\n\nEdited October 13, 2016 by FeloniusBard"}]}