{"url":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/","title":"Attack power: another thought experiment","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/?do=findComment&comment=2388584","commentId":2388584,"userName":"sappidus","timestamp":1472391759,"content":"So, Some Sort kind of fired off a /thread on the other Gedankenexperiment, so I thought I'd post another one of these. (Some Sort, as we discussed this puzzle last night, please refrain from posting an answer for a while. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] )\n\nYou are playing Passage through Mirkwood in true solo. It is the combat phase, and you are going to declare an attack with a single hero against an engaged enemy. There are no resource tokens on the table. Without using any effects that gain resources, what is the maximum raw ATK power (with that single-hero attack) you can muster under these circumstances?\n\n- The phrase \"gain resources\" is a fraught one in this game -- I'm not even sure I understand it completely -- so to be clear: you may not use any card effect that involves putting a resource on any of your cards. (Please note that the stipulation of no resource tokens on the table also applies to Keeping Count.)\n\n- You began the game with a >=50-card deck, with no more than 3x of any card.\n\n- Your hand can be whatever you want it to be. Your deck and discard pile can also be whatever you want it to be, in whatever order, including post-shuffle. Same with the encounter deck.\n\n- Your board state in terms of allies and attachments out on the table can also be whatever legal state you want it to be, as long as it is theoretically possible to put it out from your deck in true solo. You can assume you've been puttering around Passage through Mirkwood for arbitrarily long, so the cost of your board state is irrelevant.\n\n- Despite the arbitrarily long puttering, you may still assume your threat is 0.\n\n- You may determine the exhaustion state of your characters/attachments.\n\n- The visible board state must entirely describe the game state. This has a couple of consequences:\n\na. No character has boosted stats that are not immediately discernible. (Example: Grave Cairn has not previously added 5ATK to your character because hero Beorn left play earlier, and you'd played GC before the point this exercise begins.)\n\nb. No character has traits that are not immediately discernible. (Example: one cannot assume Mutual Accord has been played earlier in the phase.)\n\n- You may take any Actions before actually starting the attack. As per the \"visible board state\" criterion, however, there are no relevant pending Response triggers. (Example: again with Grave Cairn, you are not allowed to use it immediately, having assumed hero Beorn just left play.)\n\n- Remember, you are attacking with a HERO. So, no Erebor Battlemaster. (Feel free to use Sword-thain if you think it can help, though.)\n\nEdited August 30, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/?do=findComment&comment=2392235","commentId":2392235,"userName":"Some Sort","timestamp":1472586675,"content":"So I've been tweaking the approach we discussed on Discord and here's what I got. For those who want to try for themselves before peeking at my answer, the current number to beat is \"404\".\n\n \n\n \n\nStarting board state: Your deck is empty.\n\n \n\nHero #1: Gimli. \n\nHas Dunedain Cache (ranged), 1 Ent Draught, 1 Boots from Erebor, Sword That Was Broken, Palantir, Thror's Map, Thror's Key, Black Arrow (valid because Cache gives him ranged), 1x Celebrian's Stone (RESTRICTED), Ring of Barahir, Hardy Leadership (valid because Sword That Was Broken gives him a Leadership icon). This gives him a 5 (base) + 2 + 1 + 7 (ring of Barahir) + 1 hit points, or 16 total.\n\n \n\nGimli also has: 3x Dunedain Mark (+3 ATT), 3x Dunedain Quest (+3 WP), 3x Favor of the Lady (+3 WP), 1x Star Brooch (+1 WP), Strider (+2 WP), 1x Leaf Brooch, 3x Protector of Lorien, 3x Miruvor, 3x Support of the Eagles, Book of Eldacar, Leaf Brooch, and Herugrim (RESTRICTED).\n\n \n\nHero #2: Spirit Pippin with 3x Good Meal, 3x Fast Hitch, 2x Spare Hood and Cloak, 1x Leaf Brooch, 1x Map of Earnil\n\nHero #3: Grima.\n\nAlso on the table:\n\nEagles of the Misty Mountains with 17 eagles beneath him (2x Eagles of the Misty Mountain, 3x Landroval, Gwaihir, Descendent of Thorondir, Vassal of the Windlord, Winged Guardian) and Spare Hood and Cloak attached.\n\nAlly Faramir with Sword-thain, Leaf Brooch, 3x Unexpected Courage, 3x Lembas, 3x Cram.\n\nRadagast with Wizard-pipe.\n\n \n\nGimli has 13 WP, 5 ATT, and 16 HP. He has 14 damage tokens, (not 15-- it would be a shame to die as soon as we discard that Black Arrow), giving him 19 attack.\n\n \n\nPlay Blade Mastery, (+1 attack). It plays for free thanks to Gimli's Leaf Brooch. 13 WP / 20 Att.\n\nExhaust all three Support of the Eagles. Target the Eagles of the Misty Mountain for +19 Att each time. 13 WP / 77 Att.\n\nExhaust Faramir to increase WP by 1. Exhaust Eagles of the Misty Mountain and pass a Spare Hood to ready him. 14 WP / 77 Att.\n\nPlay Meneldor's Flight. Return Eagles of the Misty Mountain to your hand.\n\nIn response, play Grave Cairn. It plays for free thanks to Faramir's Leaf Brooch. 14 WP / 96 Att.\n\nDiscard nine cards to the three Protectors of Lorien for +9 WP. 23 WP / 96 Att.\n\nDiscard the three Miruvors for +3 more WP. Put them on top of your deck. 26 WP / 96 Att.\n\nExhaust Faramir for +1 WP. Ready him and exhaust him 9 more times using UC / Cram / Lembas. 36 WP / 96 Att.\n\nExhaust Pippin to pass Faramir a Spare Hood and Cloak. Ready Pippin with Fast Hitch. Exhaust Faramir. 37 WP / 96 Att.\n\nExhaust Pippin to pass Faramir a Spare Hood and Cloak. Ready Pippin with Fast Hitch. Exhaust Faramir. 38 WP / 96 Att.\n\nPlay Common Cause. Exhaust Pippin to ready Faramir. Exhaust Faramir. Ready Pippin with his final Fast Hitch. 39 WP / 96 Att.\n\nPlay Common Cause. Exhaust Pippin to ready Faramir. Exhaust Faramir for +1 WP. 40 WP / 96 Att.\n\nPlay Common Cause. Exhaust Grima to ready Faramir. Exhaust Faramir for +1 WP. 41 WP / 96 Att.\n\nPlay Well-equipped. Discard two Miruvors, put one on Gimli. Discard it to give +1 WP and put it on top of the deck. 42 WP / 96 Att.\n\nPlay Well-equipped. Discard two Miruvors, put one on Gimli. Discard it to give +1 WP and put it on top of the deck. 43 WP / 96 Att.\n\nPlay Well-equipped. Discard the last card of your deck, a Miruvor, and put it on Gimli. Discard it to give +1 WP. 44 WP / 96 Att.\n\n \n\nNow the fun begins.\n\n \n\nPlay Fair and Perilous on Gimli. It plays for free thanks to Pippin's Leaf Brooch. 44 WP / 140 Att.\n\nPlay three copies of Elrond's Counsel. 47 WP / 140 Att.\n\nDiscard a Good Meal to play Fair and Perilous. 47 WP / 187 Att.\n\nDiscard a Good Meal to play Fair and Perilous. 47 WP / 234 Att.\n\nDiscard a Good Meal. Discard Map of Earnil to recur a Fair and Perilous. 47 WP / 281 Att.\n\nPlay 3x Unseen Strike and 3x Khazad! Khazad!. 47 WP / 299 Att.\n\nDiscard Book of Eldacar to recur either an Unseen Strike. 47 WP / 302 Att.\n\nPlay a Deep Knowledge. Since your deck was empty, you draw Fair and Perilous and Unseen Strike.\n\nTrigger Grima. Play Fair and Perilous. 47 WP / 349 Att.\n\nPlay Unseen Strike. 47 WP / 352 Att.\n\nDeclare an attack. In response, trigger Herugrim. 47 WP / 399 Att.\n\nDiscard Black Arrow. 47 WP / 404 Att.\n\nResolve attack.\n\n \n\nFinal attack: 404\n\n \n\nEdit: got an extra nine points of attack by swapping out the Citadel Plate for Celebrian's Stone.\n\nEdited August 30, 2016 by Some Sort"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/?do=findComment&comment=2392306","commentId":2392306,"userName":"Some Sort","timestamp":1472589201,"content":"Alright, thanks to feedback on the Discord channel, I know that Grave Cairn only works with printed attack, so take that out. This reduces the final value by 19.\n\n \n\n*BUT*, for our 1-cost Leadership event, we can use Durin's Song. This gives +2 attack and, more importantly, +2 WP. That WP is multiplied six times, (5x Fair and Perilous, 1x Herugrim), so this results in +14 total attack, a net loss of just 5. Our total now stands at 399.\n\n \n\nAlso, I can use Core Set Gandalf + Narya as one of my allies and ready the Eagles of the Misty Mountain before activating Support of the Eagles. This gives +1 more attack, which gets multiplied three times over thanks to Support. That brings us to 402.\n\n \n\nAlso, I can put a Wizard Pipe on that Core Gandalf and a Scroll of Isildur on Grima. I can use Scroll of Isildur to recycle a 0-cost Lore Event (doesn't matter what) from my discard and put it on top of my deck. Then, I can use Wizard Pipe to swap another Durin's Song from my hand with the event on top of my deck, and then use Ally Elrond with Vilya attached to play it. This gives another +14 attack. Then, to make sure I don't lose my Strider bonus, I'll have Born Aloft attached to both Gandalf and Elrond, and I'll pull them both back to my hand after.\n\n \n\nSo that's 416, and that's I think where things currently stand. Anyone else see things that were played wrong or ways to improve the sequence?\n\nEdited August 30, 2016 by Some Sort"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/?do=findComment&comment=2392443","commentId":2392443,"userName":"Seastan","timestamp":1472596091,"content":"There are 6 ways to play Fair and Perilous for free:\n\n \n\nLeaf Brooch\n\n3x Good Meal\n\nGrima\n\nElrond+Vilya\n\n \n\nI think the optimal solution will make use of all of them.\n\n \n\nPlay the first (Leaf Brooch)\n\nPlay the second and third (Good meal 1 and Grima)\n\nTrigger Map of Earnil to play a fourth from your discard (Good Meal 2)\n\nGet another Map into play using Well-Equipped\n\nPlay the fifth with Elrond+Vilya\n\nTrigger Map to play the sixth from your discard (Good Meal 3)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228757-attack-power-another-thought-experiment/?do=findComment&comment=2392446","commentId":2392446,"userName":"Some Sort","timestamp":1472596354,"content":"You're right, I was thinking I couldn't get another map in play, but I didn't think about Song of Traveling Gimli so I could Well-equip it on him.\n\nEdited August 30, 2016 by Some Sort"}]}