{"url":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/","title":"Best scenarios for training new players + reasons","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388245","commentId":2388245,"userName":"Gunslinger83","timestamp":1472350378,"content":"I'm wondering what scenarios some of the veterans in here use to teach new players the game, and why you use them.\n\n\nMy personal favorite has become the Dunland Trap. I find the 1st quest stage ideal. Willpower/questing requirements are generally low, and players are thrown right into combat against what should be a couple of fairly weak enemies (although they get big fast if you don't kill them!). This makes it easy to teach combat and without requiring everything to be committed to the quest and make progress. You can take your time on the first stage and build up to get control of the board before triggering the ambush (at which point you and the new players will likely get wrecked.) Basically, the pacing and mix of combat are perfect. Also, the mechanics on this particular scenario are so well designed and elegant, it gives new players a taste for some of the brilliant design factors built in this game.\n\nOf course, you do want to set them up with decent decks before going in.\n\n\nWhat are some of your favorite \"training\" scenarios?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388448","commentId":2388448,"userName":"CaffeineAddict","timestamp":1472377831,"content":"I've used Journey Down the Anduin, Massing at Osgiliath, Into The Pit, Seventh Level and Battle of Five armies with new and newish players. Tried Battle of Lake town with a newish player once. Don't do that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388606","commentId":2388606,"userName":"sappidus","timestamp":1472393017,"content":"> I'm wondering what scenarios some of the veterans in here use to teach new players the game, and why you use them.\n> \n> My personal favorite has become the Dunland Trap..\n\n...wait, what?\n\nThe Dunland Trap is awesome, but besides being balls-hard if you haven't specifically teched for it, the quest also punishes card draw in a way quite antithetical to most of the rest of the game. Is that really good for new players?\n\nMaybe I could see it a little more if you're literally just talking about the 1st stage, but I'd think new players would be a little \"Huh?\" if you purposely cut off playing at that point. Unless they're constitutionally OK with losing, in which case, hey, this game is perfect for 'em! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388612","commentId":2388612,"userName":"John Constantine","timestamp":1472393582,"content":"Passage through Mirkwood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388614","commentId":2388614,"userName":"Lecitadin","timestamp":1472393688,"content":"The first quest of the core set, Passage through Mirkwood, is perfect and easy enough to explain most of the game's rule to new players, I woulnd't go with something too complicated and frustrating.  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\nOnce you've played through that quest, then you play Carn-Dum with them....  (I'm kidding!)\n\nEdited August 28, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388869","commentId":2388869,"userName":"Mndela","timestamp":1472411617,"content":"Dunland Trap is the less played scenario to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2388870","commentId":2388870,"userName":"Lecitadin","timestamp":1472411767,"content":"> Dunland Trap is the less played scenario to me.\n\n \n\nYou need a deck with the less possible attachments and a few cards like Feint, for that last stage.\n\nI beat the nightmare mode with an Ents deckm keeping Threebeard ally (when you just choose and keep only one ally)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2392590","commentId":2392590,"userName":"Gunslinger83","timestamp":1472604588,"content":">  \n> \n> > I'm wondering what scenarios some of the veterans in here use to teach new players the game, and why you use them.\n> > \n> > My personal favorite has become the Dunland Trap..\n> \n> ...wait, what?\n> \n> The Dunland Trap is awesome, but besides being balls-hard if you haven't specifically teched for it, the quest also punishes card draw in a way quite antithetical to most of the rest of the game. Is that really good for new players?\n> \n> Maybe I could see it a little more if you're literally just talking about the 1st stage, but I'd think new players would be a little \"Huh?\" if you purposely cut off playing at that point. Unless they're constitutionally OK with losing, in which case, hey, this game is perfect for 'em! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n\nI guess I need mention that easy mode is essential. The first phase isn't bad on easy mode, and I figure the actual ambush is good training for getting your teeth kicked in by the encounter deck... which is a necessary lesson to learn. As far as the restricted card draw and the periodic wiping of hand, well that makes for less decisions and faster games!\n\nI do agree on this being one of the most challenging scenarios in the game though. I don't build decks for specific scenarios, so this one still gives me some pretty good problems. Ran my top shelf Silvan attack and Noldor questing decks against it 6 times the other day and only made it to the final attack of the game 1 time. Still lost, but figured it was close enough.\n\nBut I still like it's first phase on easy mode for training.\n\nEdited August 31, 2016 by Gunslinger83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2392662","commentId":2392662,"userName":"dr00","timestamp":1472608143,"content":"> Passage through Mirkwood.\n\nthis for me.  why go for anything else when the original introduction quest is so good?\n\n \n\ni even taught a 6-player version of it once because 5 of my friends wanted to play but i was the only one who knew how\n\ni would recommend highly against doing this, however.  it was a nightmare... without the nightmare cards (pun intended)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2392913","commentId":2392913,"userName":"Crabble","timestamp":1472633132,"content":"For me it's Trouble in Tharbad right now. Not that hard of a quest, no real ally or attachment hate and you have some not to complicated quest mechanics that you have to keep track of. Encounter at Amon Din is another easy scenario that might be worth trying with new players.\n\nIf you want to go really easy yeah Passage through Mirkwood is the go to scenario but I find it a little bit boring to play and new players might get the impression \"Oh this game seems to be easy, you can crush every quest with a reasonable deck\" which would be a shame because that's definitely not the case ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2392953","commentId":2392953,"userName":"TwiceBorn","timestamp":1472637430,"content":"I would probably go with Passage Through Mirkwood using Core set player cards only to keep the scenario somewhat challenging. As others have said, simple and straightforward, good place to start even if it isn't a particularly exciting quest. And Ungoliant's Spawn and the Hummerhorns can still make things hard if they engage when players aren't ready to deal with them.\n\n \n\nThe game only gets better from there.\n\n \n\nAfter Mirkwood, on through Journey Down the Anduin, and yes... Escape from Dol Guldur using Core set cards only (not so bad with 2+ players).\n\n \n\nEDIT: Then again, I say Passage Through Mirkwood because I've only ever taught one other person (my wife) to play the game. I'm sure if I taught newbies on a regular basis, I might go with something more exciting. But it's been so long since I've played Mirkwood that it wouldn't be too onerous for me at this point.\n\nEdited August 31, 2016 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2393410","commentId":2393410,"userName":"Gunslinger83","timestamp":1472660498,"content":"Yeah, I used Passage through Mirkwood for a very long time as a trainer. That is part of the problem. It's almost unplayable for me now from over use, except for the nightmare variant that is actually pretty good. Has anyone tried training new players in Nightmare PtM?\n\nTharbad and Amon Din have been my personal go to as test scenarios for new decks that I'm trying out and tuning. Agreed that they are pretty ideal for new players. However, like PtM, I have used THEM so much in testing new decks, that I almost can't stand them much anymore either... and atleast for Amon Din, the nightmare variant is WAY too difficult (havn't tried Tharbad's).\n\nThe cool thing is that easy mode makes a lot of scenarios that might not otherwise be viable for new players suitable... atleast for the opening quest stages. Heck, I just got done playing The Three Trials, and realized that this one also has a nice slow \"warm-up\" followed by a punishing final stage. Thinking about trying this one out for new players as well, as it's also extremely well designed and fun thematically. Who doesn't like a dungeon crawl where you have to find keys, and then unlocking the final stage for the boss fight?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2393416","commentId":2393416,"userName":"Kakita Shiro","timestamp":1472660838,"content":"Journey Down the Anduin is a good training quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2393458","commentId":2393458,"userName":"Gunslinger83","timestamp":1472662575,"content":">  \n> \n> > Passage through Mirkwood.\n> \n> this for me.  why go for anything else when the original introduction quest is so good?\n> \n>  \n> \n> i even taught a 6-player version of it once because 5 of my friends wanted to play but i was the only one who knew how\n> \n> i would recommend highly against doing this, however.  it was a nightmare... without the nightmare cards (pun intended)\n> \n>  \n\n6 Players!!!!\n\nThe most I've done at one time is 2 newbies + me... and \"that\" was a nightmare.\n\nPart of my justification for only using the 1st phase of some scenarios is that's sometimes all the farther you get with new players.... which is fine because completion takes backseat to learning the game correctly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2393507","commentId":2393507,"userName":"kwitee","timestamp":1472665299,"content":"Encounter at Amon Dîn: fun quest with not so punishing boss enemy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2393880","commentId":2393880,"userName":"dr00","timestamp":1472681140,"content":">  \n> \n> >  \n> > \n> > > Passage through Mirkwood.\n> > \n> > this for me.  why go for anything else when the original introduction quest is so good?\n> > \n> >  \n> > \n> > i even taught a 6-player version of it once because 5 of my friends wanted to play but i was the only one who knew how\n> > \n> > i would recommend highly against doing this, however.  it was a nightmare... without the nightmare cards (pun intended)\n> > \n> >  \n> \n> 6 Players!!!!\n> \n> The most I've done at one time is 2 newbies + me... and \"that\" was a nightmare.\n> \n> Part of my justification for only using the 1st phase of some scenarios is that's sometimes all the farther you get with new players.... which is fine because completion takes backseat to learning the game correctly.\n> \n>  \n\nit was awful, and i did not want to do it.  i was also thrown into it, since we had 4 of the 6 players owning at least the core set, so i thought that someone besides me knew how to play the game.\n\n \n\nthey all hate the game now, but i blame them for trying to force me to teach it to them in such a way and not bothering to learn it on their own.\n\n \n\n \n\nthat said, i still prefer Passage through Mirkwood as a teaching tool.  i've used it successfully with other people (and a much smaller group!)\n\ni like that the 3rd stage is variable, so it can be played a few times to help solidify all of the concepts.  plus it plays relatively quickly (when you're not playing with 6!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2403760","commentId":2403760,"userName":"Zura","timestamp":1473262268,"content":"Hey all. This weekend i will be introducing brand new player to the game and as inexperienced player i have difficulties with choosing the scenarios and way to play them. We will be playing 3-person mode with my friend who succesfully went through the whole mirkwood cycle in proggresion mode with me, so he has some experience. I have 2 core sets, mirkwood, khazad dum, dwarrodelf, hobbit 1, heirs and black riders, so there is plenty of scenarios to choose from. The problem is that we all don't have much time, as we're busy guys, and going through core set is probably not the best thing to do. I look for scenarios that are at their best in 3-person mode. Another issue i have is decks. If we use the same decks to complete let's say passage at mirkwood, return to mirkwood and shadow and flame it might be not really good, as it requires deck to have to big level of complexity and it might put new player off, and i want him to like it as much as possible. I have an idea to first use core set decks and complete passage through mirkwood and then complete the Black Riders saga box, but i'm note sure if the scenarios are good for new player. Sorry for my english and i will be really glad to se some advice on how to solve the problems - which scenarios and which decks to use and how to change them between scenarios not to create much mess. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2421643","commentId":2421643,"userName":"Benoit Poulin","timestamp":1474320370,"content":"> Hey all. This weekend i will be introducing brand new player to the game and as inexperienced player i have difficulties with choosing the scenarios and way to play them. We will be playing 3-person mode with my friend who succesfully went through the whole mirkwood cycle in proggresion mode with me, so he has some experience. I have 2 core sets, mirkwood, khazad dum, dwarrodelf, hobbit 1, heirs and black riders, so there is plenty of scenarios to choose from. The problem is that we all don't have much time, as we're busy guys, and going through core set is probably not the best thing to do. I look for scenarios that are at their best in 3-person mode. Another issue i have is decks. If we use the same decks to complete let's say passage at mirkwood, return to mirkwood and shadow and flame it might be not really good, as it requires deck to have to big level of complexity and it might put new player off, and i want him to like it as much as possible. I have an idea to first use core set decks and complete passage through mirkwood and then complete the Black Riders saga box, but i'm note sure if the scenarios are good for new player. Sorry for my english and i will be really glad to se some advice on how to solve the problems - which scenarios and which decks to use and how to change them between scenarios not to create much mess. \n\n \n\n \n\n.. so, how it went? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2425414","commentId":2425414,"userName":"13nrv","timestamp":1474537731,"content":">  \n> \n> > Dunland Trap is the less played scenario to me.\n> \n>  \n> \n> You need a deck with the less possible attachments and a few cards like Feint, for that last stage.\n> \n>  \n\n \n\nLess attachment ? I would say a lot of attachment :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nThe reset \"only\" discard item and mount ... The most important attachments to restart after the reset wasn't discarded like ressource attachment (Stewart of Gondor, ressourcefull etc ...), Card draw attachment (Legacy of Durin, King under the mountain, Expert treasure hunter etc ...). Unexpected courage too and this one is very important for last stage.\n\nSword-thain allow you to have one more character after the reset :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nVilya wasn't discarded too etc ... etc ...\n\n \n\nAs you say, Accumulated ressources on treebeard is a good solution.\n\n \n\nIf you have a deep knowledge of this scenario, you have a lot of strategy to beat it for each kind of archetype (Attachment based, swarm, secrecy etc ...).\n\nOne of the flaw of the scenario : Allowing player to draw two cards every two turns in the first phase :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nSword-Thain is very powerfull on this scenario. (It's powerfull too on Druadan Forest NM ! At the third stage you gain 3 ressources on each hero ... Oh ! i have 4 heroes :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png])\n\n \n\nThe NM don't change the flaw of the scenario ... It is a little bit harder but decks which win against the normal version win also against the NM one.\n\n \n\nTo make a comparison, the reset of Fundation of stone has been modified in the NM version which really modify the scenario (and the difficulty). I don't understand why they didn't do that on Dunland trap NM !\n\nEdited September 22, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2427471","commentId":2427471,"userName":"Narsil0420","timestamp":1474640800,"content":"Seventh Level is one of my favorites.\nOf newer Scenarios I like The Ring Goes South, it's doesn't have any extremely different mechanics and it has memorable movie moments in it.\n\nI think not giving new players a lot of extra mechanics to remember is important. That being said, I just played with my step mom for the first time on the second Grey Havens expansion and it went pretty well, I just ran the encounter deck and she was focused mainly on figuring out her player deck and hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2433872","commentId":2433872,"userName":"Yepesnopes","timestamp":1475052465,"content":"I typically use the scenario \"Into the pit\" and Dwarf player's decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228734-best-scenarios-for-training-new-players-reasons/?do=findComment&comment=2452478","commentId":2452478,"userName":"FeloniusBard","timestamp":1476221186,"content":"Everybody's already hit my usual suspects for teaching new players. \n\n \n\n * Journey Down the Anduin\n * Hunt for Gollum --- I actually use this one quite a bit, as it's basically no different than Passage Through Mirkwood, but it adds a few slightly beefier enemies in the Orc Hunting Party, and adds just a tiny bit more with the mechanic to search for clues.\n * Into the Pit --- this is a good one for demonstrating location effects, plus the need to avoid shadow cards. Also very straightforward, nothing too difficult to master. \n * Ring Goes South --- This one's harder because it needs a bit more insight into card synergies than most newbies are able to muster, but it's a fun, balanced quest. "}]}