{"url":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/","title":"How to Infinitely Recur Any Event in the Game.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389197","commentId":2389197,"userName":"Some Sort","timestamp":1472433751,"content":"Inspired by Sappidus' \"How Rich Can You Get?\" challenge, I figured I'd write up a brief guide on how to infinitely recur any event card in the game, (giving you one play per round).\n\n \n\nLeadership (for events that are actions and not responses):\n\nEmpty your deck. Get a second breakfast in your discard, a Tome of Atanatar in play, and the event you want to recur in your hand.\n\n \n\nCycle 1: (If necessary, draw event.) Play event. Trigger Tome of Atanatar to recur Second Breakfast, which puts Tome of Atanatar in your hand and Second Breakfast on top of your deck, (since there are no other cards there). Play Tome of Atanatar. End the round.\n\n \n\nCycle 2: Draw Second Breakfast. Trigger Tome of Atanatar to recur your event, which puts the Tome in your discard and the event on top of your deck, (since there are no other cards there). Play Second Breakfast to recur your Tome of Atanatar. End the round.\n\n \n\nReturn to Cycle 1. Repeat as desired.\n\n \n\nSpirit:\n\nEmpty your deck. Get a Dwarven Tomb in your discard, a Map of Earnil in play, and the event you want to recur in your hand.\n\n \n\nCycle 1: Play event. Trigger Map of Earnil to recur Dwarven Tomb, which is used on Map of Earnil, which puts Map of Earnil in your hand and Dwarven Tomb on top of your deck, (since there are no other cards there). Play Map of Earnil. End the round.\n\n \n\nCycle 2: Draw Dwarven Tomb. Play Dwarven Tomb to recur your event. Trigger Map of Earnil to recur Dwarven Tomb, which is used on Map of Earnil, putting Map of Earnil in your hand and Dwarven Tomb on top of your deck. Play Map of Earnil. End the round.\n\n \n\nRepeat Cycle 2 as desired.\n\n \n\nTactics (aka \"Lol, Hama\")\n\nHave Hama. Get a spirit resource. Get an Elven-light and the event you want to play in your hand.\n\n \n\nCycle 1: Play event. Attack with Hama. Discard your Elven-light to recur event. Pay one resource to recur Elven-light.\n\n \n\nRepeat Cycle 1 as desired.\n\n \n\nEverything Else (Lore, Neutral, or Leadership events that are responses):\n\nEmpty your deck. Have Beravor as one of your heroes. Get a Galadhrim Weaver in play and a Tree People, Scroll of Isildur, and the event you want to recur in your hand.\n\n \n\nCycle 1: (if necessary, draw Scroll of Isildur.) Play Scroll of Isildur. Play Tree People to return Galadhrim Weaver to your hand. Play Event. Play Galadhrim Weaver to put event on top of your deck, (since there are no other cards there). Trigger Scroll of Isildur to recur Tree People, putting Galadhrim Weaver in your hand and Tree People on the bottom of your deck. Trigger Beravor to draw the event and Tree People. Play Galadhrim Weaver to put Scroll of Isildur on top of your deck, (since there are no other cards there).\n\n \n\nRepeat Cycle 1 as desired.\n\n \n\nThis last loop also works if you replace The Tree People and Scroll of Isildur with either Island Amid Perils and Map of Earnil or Pursuing the Enemy and Book of Eldacar, but I figured if you were already running Beravor anyway, the Lore pair would probably be easiest.\n\n \n\n \n\nAnyway, that's how you do it. In my opinion, anything except the Tactics loop qualifies as \"A Jank Too Far\", and this is coming from a guy who would inject jank intravenously if he could. But that's how it's done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389225","commentId":2389225,"userName":"sappidus","timestamp":1472435259,"content":"For everyone's edification, I paired a mono-Leadership deck meant to pull off the above recurrence -- basically, a Gondor list that has a \"WTF Longbeard Sentry and Good Harvest??\" look to it -- and paired with a not-at-all tuned aggro Noldor deck (a bastardization of 13nrv's lovely list that had to drop Leadenethor and Steward)... I beat Intruders in Chetwood. Not a hard quest, and one that to some extent does let you build up to a ridiculous combo, but not a trivial quest either.\n\nRecurring Sneak Attack, Reinforcements, or Strength of Arms as needed was, needless to say, an amusing experience. The jank is real, y'all.\n\nOne point that deserves some emphasis is that you don't always need the precise setup that Some Sort describes to start the combo. You need your deck empty, yes, but you only need a single recursion piece in hand. You don't even need the event you want to recur in hand -- it can be in the discard pile too. You may need more resources and time, but it's still possible from that position. (If you're doing Sneak Attack or Reinforcements shenanigans with Gandalf, then yes, you need him in hand.)\n\nEDIT: The decklist I used: http://ringsdb.com/decklist/view/2633/recurse-1.0 [http://ringsdb.com/decklist/view/2633/recurse-1.0]\n\nEdited August 29, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389253","commentId":2389253,"userName":"Some Sort","timestamp":1472436771,"content":"> One point that deserves some emphasis is that you don't always need the precise setup that Some Sort describes to start the combo. You need your deck empty, yes, but you only need a single recursion piece in hand. You don't even need the event you want to recur in hand -- it can be in the discard pile too. You may need more resources and time, but it's still possible from that position. (If you're doing Sneak Attack or Reinforcements shenanigans with Gandalf, then yes, you need him in hand.)\n\n \n\nYeah, to be clear, I was just trying to establish a clearly-defined board state that the combo would repeatedly cycle back to exactly to make the loop easy to see. The Spirit and Leadership loops can be started from several other points in the cycle and they'll still create a perfect closed loop at the end. (The \"everything else\" loop can be tricky, because the Galadhrim Weaver recurs the *TOP* card in your discard pile, so it's imperative that stuff gets played in the right order if you don't want to break your loop beyond repair.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389257","commentId":2389257,"userName":"sappidus","timestamp":1472437235,"content":"Indeed. I'm just driving home the point that entering the loop is easier than it may seem to the casual onlooker. Once you've gotten Longbeard Sentry into play, and the rest of your board state is alright to go? You just need 1 Second Breakfast or Tome of Atanatar in hand, then fire away that Sentry like he's going out of style. As I was running 6 recursion pieces, and had Sneak Attack Gandalf to bolster my card draw (don't worry! that Sneak Attack will be back soon!), having 1 in hand was really not an issue.\n\n(Of course, you do need the Sentry out in the first place. Both Good Harvest and A Very Good Tale could do it in my build.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389545","commentId":2389545,"userName":"13nrv","timestamp":1472466048,"content":"> Spirit:\n> \n> Empty your deck. Get a Dwarven Tomb in your discard, a Map of Earnil in play, and the event you want to recur in your hand.\n> \n>  \n> \n> Cycle 1: Play event. Trigger Map of Earnil to recur Dwarven Tomb, which is used on Map of Earnil, which puts Map of Earnil in your hand and Dwarven Tomb on top of your deck, (since there are no other cards there). Play Map of Earnil. End the round.\n> \n>  \n> \n> Cycle 2: Draw Dwarven Tomb. Play Dwarven Tomb to recur your event. Trigger Map of Earnil to recur Dwarven Tomb, which is used on Map of Earnil, putting Map of Earnil in your hand and Dwarven Tomb on top of your deck. Play Map of Earnil. End the round.\n> \n>  \n> \n> Repeat Cycle 2 as desired.\n> \n>  \n\n \n\nA precision, you can recure any spirit card with this combo.\n\nMy Caldara deck can empty deck quickly and so use this loop.\n\n \n\nWith this loop, you control the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389864","commentId":2389864,"userName":"chico2323","timestamp":1472482862,"content":"don't understand the leadership version, recurring the event will result in the event going to the bottom of your deck.  (thus no longer in your discard).\n\n \n\nPlaying subsequent copies of Tome of Atanatar won't help in this case because the desired event is now at the bottom of your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389904","commentId":2389904,"userName":"PocketWraith","timestamp":1472484138,"content":"> don't understand the leadership version, recurring the event will result in the event going to the bottom of your deck.  (thus no longer in your discard).\n> \n>  \n> \n> Playing subsequent copies of Tome of Atanatar won't help in this case because the desired event is now at the bottom of your deck?\n\nSince you empty your deck before doing it, the bottom of your deck is also the top of your deck, so you draw the event again the following round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389966","commentId":2389966,"userName":"chico2323","timestamp":1472486222,"content":"Ah I understand I missed the part about emptying your deck!  Nice combo but now I need to think of a clever way to easily empty the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=2389991","commentId":2389991,"userName":"Some Sort","timestamp":1472487059,"content":"> Ah I understand I missed the part about emptying your deck!  Nice combo but now I need to think of a clever way to easily empty the deck.\n\n \n\nMight I suggest Longbeard Sentry? He lets you dump the top two cards of your deck once per phase. With seven phases in a round, he can burn through your entire deck in 2-3 rounds. (Just make sure you have the necessary cards in hand before you drop that bomb.)\n\n \n\nEdit: in Leadership, A Very Good Tale is also a good way to speed through your deck faster, (in addition to being a very powerful card in its own right, and potentially a way to get that Longbeard Sentry into play in the first place).\n\nEdited August 29, 2016 by Some Sort"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=3719431","commentId":3719431,"userName":"sappidus","timestamp":1560321600,"content":"[Necro alert!]\n\nThe release of Elvenking makes recurring an arbitrary event (or indeed, any card that keeps on ending up on the top of your discard pile) even easier:\n\nHave the event and a Galadhrim Weaver in hand. Have a hero with Elvenking attached. Have an empty deck.\n\n 1. Play the event. (Subsequently, it's on top of discard.)\n 2. Play the Weaver to \"shuffle\" the event into your deck. (Now the event's the only card in your deck.)\n 3. Use Elvenking to recall the Weaver to hand. Note that the attached hero needs to already have been exhausted for this to be legal.\n 4. Next round you draw the event in the Resource phase. Rinse and repeat.\n\n(If you use Thranduil, you can even play the Weaver in the Combat phase, which means you can get that Test of Will you played this round back for the very next round. Or, you can recur something else without Spirit access at all.)\n\nEdited June 12, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/228800-how-to-infinitely-recur-any-event-in-the-game/?do=findComment&comment=3720099","commentId":3720099,"userName":"Yepesnopes","timestamp":1560399081,"content":"Now I feel much better with the errata on Hama, it was really needed... 🤣"}]}