{"url":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/","title":"Newbie rules questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393403","commentId":2393403,"userName":"Elrad","timestamp":1472660062,"content":"Good day everyone,\n\n \n\nAs the title mention, I am fairly new to this game but I have been having it for quite a moment now. Yesterday, A friend of mine played the two first scenarios fo the coreset. And one question came to mind regarding the final quest card of Mirkwood.\n\n \n\nIt is said at the end of the card that players must find and defeat Ungoliant's Spawn. What does \"find\" mean here ? does it mean that we must play the game as normal until we get Ungoliant'spawn coming into the track ?\n\n \n\nAnd what happen if Ungoliant is in the discard pile at the moment the players come to this last quest step ? Do we have to empty the encounter deck and then shuffle the discard pile knowing that Ungoliant will spawn in any way or do we have to search the discard pile looking for Ungoliant's spawn and insert it in the active encounter deck ?\n\n \n\nAnd what happens if the Ungoliant's spawn appears in game as a shadow card ?\n\n \n\nThanks for any further information and for your answers,\n\n \n\nRegards,\n\n \n\nElrad\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393415","commentId":2393415,"userName":"Kakita Shiro","timestamp":1472660783,"content":"The quest card's When Revealed effect lets you search the discard pile for a Spider, you can use that effect to seek out the Ungoliant's Spawn and put it into the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393481","commentId":2393481,"userName":"Slothgodfather","timestamp":1472664019,"content":"Like Kakita mentions, when the \"When revealed\" effect goes off, you get to search the encounter deck and discard pile for a spider of your choice.  Typically, you should use this opportunity to find the Ungoliant's Spawn.   If you don't and just get any other spider, then yes, you do have to keep playing the game until the Spawn shows up as an encounter card.  If it is a shadow card, you have to keep going and going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393498","commentId":2393498,"userName":"Elrad","timestamp":1472664940,"content":"Thank you for your answers. i haden't seen it in this way :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393751","commentId":2393751,"userName":"Slothgodfather","timestamp":1472675257,"content":"It seems common that a lot of people don't think to get the Spawn from this effect.  It is brought up fairly regularly.   I think FFG learned from this.  Future quests tend to have the wording to say it is mandatory to get certain enemies when necessary for victory.   Such as \"each player searches the encounter deck for 1 orc enemy and adds it to the staging area.  1 must be the boss\".   "},{"commentUrl":"https://community.fantasyflightgames.com/topic/229001-newbie-rules-questions/?do=findComment&comment=2393863","commentId":2393863,"userName":"987654321","timestamp":1472680709,"content":"Find means nothing here. You just need to get that spider there and kill it."}]}