{"url":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/","title":"The Nin-in-Eilph nightmare","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2397339","commentId":2397339,"userName":"Lecitadin","timestamp":1472858849,"content":"Hello LOTR friends!\n\nI've played all the new nightmare decks for the Voice of Insegard box and adventure packs, 100 % pure solo, and they are quite fun! To Catch an Orc is pretty nasty...\n\n \n\nLet me tell you this : the NM version of The Nin-in-Eilph is one of the toughest quests I've played in a long time (including Dol Guldur NM...).\n\n \n\nHas any of you beat this in pure solo?  \n\nSome cards are crazy (I've lost a few games with an enemy that forces you to discard a charcter with any damage on it...).   :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nEdited September 2, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2398891","commentId":2398891,"userName":"Crusaderlord","timestamp":1472981111,"content":"I play solo with one deck and am still trying to beat the original Nin-in-Eilph. Whilst I like this quest, the theme and artwork is great, also i quite like the way locations move around. But the forced time counter conditions on the creatures always seem to wear me down before i can get to stage 4. I am not sure if this just a one deck issue or my inability to create a deck but i find i have to ignore the forced conditions to complete it. In some ways it is a shame, it could be one of my top favourites, but similar to Three Trails i just find it unbeatable as written. That said i keep trying and it is one of my most played quests despite my inability to win.\n\nEdited September 5, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2399070","commentId":2399070,"userName":"Lecitadin","timestamp":1472998912,"content":"Yeah, it's pretty nasty, even in easy mode! In the NM version, you must put the Marsh-deller in the staging area as soon as you go to a new 2A quest card (even if it is out of play or engaged with you!), so you need a LOT of questing power...\n\nI won't stop until I beat it, but I think it needs a specifi type of player deck with a precise strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2399502","commentId":2399502,"userName":"jjenks476","timestamp":1473026409,"content":"I play exclusively NM for quests that have the option, yet I didn't but Nin-in-Eliph. I didn't buy the NM for this quest because it doesn't meet my criteria, of I really like the theme of this quest, or it's too easy. I don't enjoy the time and random quest stages mechanics in this quest. The theme is out then, and it is not that easy. So I passed on the NM, bought the rest of the cycle though, none as awesome as Against the Shadow NM, except for Three Trials probably."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2399922","commentId":2399922,"userName":"Crusaderlord","timestamp":1473062550,"content":"i skipped Against the Shadow cycle - forums suggested this cycle was too hard to solo. However having played Ringmaker i cant imagine it is any harder to solo with one deck.\n\n \n\nDunland Trap / Antlered Crown - loads of forced card effects to keep track off and you need to discard cards all the time - i wasnt overly keen in the end and the time triggers are penalising. I would have been happy just with Fords of Isen and no more Dunlings quests.\n\nTrouble in Tharbad - excellent fun, thematic and not too hard - really liked this one and in my top 10 quests\n\nThree Trails / Nin-In-Eilph - love the theme and artwork, really hard to win though, in fact i have never beaten either without ignoring some effects, but these are worth persevering with and i find them quite addictive\n\nCelebrimor's Secret - continues the theme of Tharbad but makes it largely unenjoyable with all the constant scour triggers and counters everywhere - for me it is how not design a quest \n\n \n\nSo i thought 3 Ringmaker quests were worth having long term, and 3 well i could have lived without them.\n\n \n\nI would be interested on opinions of Against the Shadow compared to Ringmaker.\n\nI have however just bought Lost Realms box and will be getting Wastes of Eriador, Mount Gram and Treachery of Rhuadar - but i am not sure about the other 3 yet as i may find these overly difficult as well. I think i may cherry pick in future rather than get all of a cycle given my experiences with Ringmaker. Dwarrowdelf however i liked and was happy to have all of them.\n\nEdited September 5, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2399931","commentId":2399931,"userName":"John Constantine","timestamp":1473063966,"content":"Against the Shadow has the best quest of all time - Steward's Fear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2399943","commentId":2399943,"userName":"13nrv","timestamp":1473065222,"content":"> Hello LOTR friends!\n> \n> I've played all the new nightmare decks for the Voice of Insegard box and adventure packs, 100 % pure solo, and they are quite fun! To Catch an Orc is pretty nasty...\n> \n>  \n> \n> Let me tell you this : the NM version of The Nin-in-Eilph is one of the toughest quests I've played in a long time (including Dol Guldur NM...).\n> \n>  \n> \n> Has any of you beat this in pure solo?  \n> \n> Some cards are crazy (I've lost a few games with an enemy that forces you to discard a charcter with any damage on it...).   :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\nI agree this NM quest is one of the hardest of the game (including Lost Realm ones). I continue to think that Dol Guldur NM is still harder.\n\n \n\nI have beaten it with my Caldara deck.\n\nElhelm ally is great for this quest. I have maintained my threat at low level to avoid engagement. Put strong quester and Northen Tracker + Rhovanion outriders for Location. It was very hard.\n\n \n\nMy others powerfull decks have been totally crushed by this quest.\n\nEdited September 5, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2400321","commentId":2400321,"userName":"Authraw","timestamp":1473091446,"content":"Honestly, the last two quests of the Heirs of Numenor box were the ones I remember hating back in the day. The Angmar Awakened cycle itself was more of a mixed bag, with Steward's Fear definitely being a high point for me. Amon Din is fun too, even though it's pretty easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2400568","commentId":2400568,"userName":"Lecitadin","timestamp":1473103370,"content":"I'll try with the Calandra deck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2400628","commentId":2400628,"userName":"Rajam","timestamp":1473107284,"content":"> I'll try with the Calandra deck!\n\n \n\nIf you have no luck you may try later a Caldara deck :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2400700","commentId":2400700,"userName":"Lecitadin","timestamp":1473110402,"content":">  \n> \n> > I'll try with the Calandra deck!\n> \n>  \n> \n> If you have no luck you may try later a Caldara deck :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n> \n>  \n\n \n\nMan... I'm so terrible with tyspo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2400790","commentId":2400790,"userName":"Gunslinger83","timestamp":1473115549,"content":"LOL... the original Nin-in-Eilph is a nightmare in and of itself! I actually haven't purchased a single NM deck from VOI on up, just because I think this is the point where the basic scenarios are still challenging enough in their own right, even to someone who has the entire card pool.\n\nI just did a run-through of the VOI deluxe and Ringmaker cycle with my Silvan attack/Noldor questing fellowship, and realized that the difficulty level of this series is just about right at the moment as it is (I think the Dunland Trap is even more punishing than NiE). However, I have noticed that this particular cycle of the game is especially hostile to solo play, as several of these scenarios are much more difficult solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2402111","commentId":2402111,"userName":"Lecitadin","timestamp":1473182666,"content":"I finale beat the quest nightmare mode pure solo with a Caladra deck (and if it ain't for Glorfindel ally that could ready by discarding a card, I wouldn't have been able to kill the Dweller (that has 13 threat and attack points...).\n\n \n\nI think that the other way to win this quest is with a Hama hero and Spirit deck, to engage the Dweller all the time you can and recycle Feint with Hama. I think that Eowyn Spirit would be great, combed with Galadriel (even if she can't draw cards with one of the 2A stages, she still can reduce your threat().\n\n \n\nThe idea would be to keep the Dweller out of the staging area and quest like there's no tomorrow to get rid of the 2A stages (the stage 3 of the quests are not as nasty...).\n\n \n\nIf you beat the quest solo, please let us know!  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nEdited September 6, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2403274","commentId":2403274,"userName":"Crusaderlord","timestamp":1473238110,"content":"Getting closer to beating the original Nin-In-Eilph solo one deck after ditching my tactics cards and going spirit / lore only - last night i had the Marsh Dweller on 6 wounds and possibly one round from winning when an adder struck in the counter removal phase and was dealt another shadow attack which decimated my remaining heroes. \n\n \n\nI will say that this is fast becoming one of my favourite quests - bucking the general opinion trend. It is hard to properly explain why i enjoy it because i generally hate the time counter use, but i just find this a challenge i do want and enjoy playing against, and unlike say Celebrimors Secret (way too many trigger effects). I think it is because the mechanics i find fairly straightforward there are not too many multiple trigger effects into staging, the monsters are clear in what you need to do to overcome them and art and locations are excellent, and i just like the wilderness adventures (Anduin is another favourite of mine). \n\n \n\nIt is very hard though, i kind of wish it was like Passage to Mirkwood where you could beat the original but then buy the nightmare cards to switch in some cards to get the right level of difficultly for your own challenge. I dont like removing cards and going easy level so I am currently toying with reversing the nightmare idea and will add one or two Marsh Adders from the core set in place of Swamp Adder to soften that a bit and will look around for another creature i think to add in.\n\n \n\nWhilst i prefer to play purist as written, some quests like this one do lend themselves to easily switch encounter cards without totally destroying the overall theme and style. I do this with the spider quests and it works really well.    \n\nEdited September 7, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229201-the-nin-in-eilph-nightmare/?do=findComment&comment=2404963","commentId":2404963,"userName":"Crusaderlord","timestamp":1473325440,"content":"Finally yes i squeeked a win last night v normal Nin-in-Eilph. I dont think i missed any triggers but it got very close at the end. Switched in Frodo for Eowyn and used him to take damage with threat reduction cards and an Aragorn reset. Even then i finished on 48 threat as it all got hectic in the last two rounds.\n\n \n\nAt stage four the combat round saw me engaged with the Marsh Dweller, 2 Adders and Neekerbreekers. Gandalf and Glorfindel helped to put decent damage on the Marsh Dweller who in a thematic struggle managed to drag an Ent beneath the swamp waters, while two handmaiden were eaten by the giant snakes. The time counter triggers were desparate as the Neekerbreekers damaged Gildor (summoned earlier to help by a leaf brooch) and Aragorn and Frodo took risky undefended damage from the Adders, and with Aragorn saved by some last ditch shadow mitigation. Gandalf then decided not to stay around to help further assuming the party had everything under control. \n\n \n\nThe final round saw Glorfindel and Aragorn quest and refresh, and a nice encounter draw saw a location emerge. The Marsh Dweller was too powerful for Gildor who died defending the others, while Aragorn discarding Lembas survived an adder attack. The Neekerbreekers swarm damaged Glorfindel to within one wound of his life. The final adder squared up to Frodo who wanted to take the last damage as threat, but it was too much with the shadow card and at 48 threat he died heroically. The remaining two heroes and the dwarf all one wound from death killed off the Marsh Dweller to escape the swamp. Wow !\n\nEdited September 8, 2016 by Crusaderlord"}]}