{"url":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/","title":"Hidden objectives","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400408","commentId":2400408,"userName":"sappidus","timestamp":1473094670,"content":"After the theoretical shenanigans of my max resources/attack power threads, I move to... well... real-life shenanigans? ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nIn the Netrunner world, there's a guy, bewnt, who puts out a lot of great content. But my favorite thing he does is his Hidden Objective series, where he picks some ridiculous challenge that may have nothing to do with actually winning, then aims to complete it in a real game before his unwitting opponent can close it out. The nice part about the videos is that he doesn't reveal the Objective to the viewers either, so you can watch and try to figure it out before the end. (Check him out at https://www.youtube.com/user/bewnt [https://www.youtube.com/user/bewnt]).\n\nIt's a breath of fresh air in the online Netrunner world, which can often seem excessively obsessed with tournament-level power decks. The LotR LCG community doesn't need the change-up as much, but I thought some might still get a kick out of some alternate win-condition decks. My Deforestation deck [http://ringsdb.com/decklist/view/491/deforestation-1.0] could be considered in this vein, although that deck is still meant to put up a fight after pulling off the eponymous feat. More to the point is my A Very Good Tale deck [http://ringsdb.com/decklist/view/2143/okay-that-was-good-2.0] that aims to guarantee 5 allies will be put into play with a single AVGT invocation -- no small feat when the card's effect shuffles the deck first!\n\nAnyway, I make this thread today for my latest \"hidden objective\", which isn't really so hidden:\n\nhttp://ringsdb.com/decklist/view/2737/hidden-objective-2-1.0 [http://ringsdb.com/decklist/view/2737/hidden-objective-2-1.0]\n\nCuriously, it was not even theoretically possible to unlock this achievement until quite recently in the card pool. And yet, I pulled it off on my first attempt... on turn 3! Can you guess which quest I chose in order to maximize my chances?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400460","commentId":2400460,"userName":"John Constantine","timestamp":1473097353,"content":"Hidden Objective: Add Grima to your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400465","commentId":2400465,"userName":"GrandSpleen","timestamp":1473097905,"content":"You were trying to get all 9 walkers into play at the same time. You'd need a Fellowship Frodo.  I am guessing you picked The Ring Goes South in order to take advantage of the Council of Elrond event at the beginning of that quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400754","commentId":2400754,"userName":"sappidus","timestamp":1473113713,"content":"> You were trying to get all 9 walkers into play at the same time. You'd need a Fellowship Frodo.  I am guessing you picked The Ring Goes South in order to take advantage of the Council of Elrond event at the beginning of that quest.\n\nTotally reasonable, but since that effect can only help with Gimli or Gandalf (it's phrased \"0 cost\", not \"no cost\"), I went with Breaking of the Fellowship. As I wasn't trying to win the quest, I thought pinning enemies to the staging area was the safest way to try to assemble the Nine without having to deal with pesky combat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400820","commentId":2400820,"userName":"Authraw","timestamp":1473117099,"content":">  \n> \n> > You were trying to get all 9 walkers into play at the same time. You'd need a Fellowship Frodo.  I am guessing you picked The Ring Goes South in order to take advantage of the Council of Elrond event at the beginning of that quest.\n> \n> Totally reasonable, but since that effect can only help with Gimli or Gandalf (it's phrased \"0 cost\", not \"no cost\"), I went with Breaking of the Fellowship. As I wasn't trying to win the quest, I thought pinning enemies to the staging area was the safest way to try to assemble the Nine without having to deal with pesky combat.\n> \n> \n> \n>  \n\nI did a deck very much like this a few months ago! Here's the updated version, if you're interested:\n\nhttp://ringsdb.com/decklist/view/2745/the-fellowship-of-the-ring-in-one-deck-2.0 [http://ringsdb.com/decklist/view/2745/the-fellowship-of-the-ring-in-one-deck-2.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400825","commentId":2400825,"userName":"sappidus","timestamp":1473117406,"content":"No need to spoiler tag this one: Authraw's version is way better! It might actually win a scenario, heh.\n\nI should've searched to see whether anyone had published something like this, so late hat tip to you, sir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400849","commentId":2400849,"userName":"sappidus","timestamp":1473118543,"content":"Okay, to make up for my lack of due diligence, I will post a different sort of game puzzle...\n\nYou walk in on your friend playing Journey along the Anduin in true solo, and you ask how it's going. He says, \"It's the start of my 1st travel phase, but as you can see, I won't have much choice.\"\n\nYou double-take. The staging area is blank. But there are 2 Hill Trolls in the victory display already. For good measure, there are two enemies in the otherwise-empty discard pile.\n\nEven your friend's board state is clean, without allies or attachments. You don't see any progress on the quest, either, so you ask, \"Oh, you underquested...?\"\n\nHe points at his threat tracker, \"Well, I'm still at my starting threat, so what do you think?\"\n\nYou laugh and say, \"What did you, spam out Sneak Attack Gandalfs or something?\"\n\nHe looks miffed. \"How cheap do you think I am!? I didn't draw into any duplicate cards, starting hand or otherwise! Hard to spam when that happens.\"\n\nYou concede the point, then give in and ask how he cleaned house so thoroughly.\n\na. How did he dispose of 2 Hill Trolls already? (Everything your friend said is the truth [except maybe the implication about not being cheap, heh].)\n\nb. What enemies are in the discard pile? In what order?\n\nEdited September 5, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2400980","commentId":2400980,"userName":"sappidus","timestamp":1473126237,"content":"(I have improved my solution to put 2 Hill Trolls AND Chieftain Ufthak into the victory display, as well as an empty encounter discard pile and 2 progress on the quest. Unfortunately, the efficiency of the new solution to some extent invalidates the part b question above, which is a shame because I liked its purity. Oh well.)\n\nEdited September 6, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2401025","commentId":2401025,"userName":"Rajam","timestamp":1473129638,"content":"Key pieces:\n\n1 Legolas Hero\n\n2 other Tactics heroes (or Amarthiúl) with a total attack of at least 3\n\n \n\n2 Dagger of Westernesse\n\n1 Delay the enemy\n\n1 Black Arrow\n\n1 Dunedain Hunter\n\n1 Hands upon the Bow\n\n \n\nDunedain Hunter grabs the 2nd Hill Troll from the encounter deck and puts it into play engaged. 2 Daggers of Westernesse + Legolas + Black Arrow + Hands the Bow = 13 attack -> Kill Hill Troll in staging area during quest phase and place 2 progress tokens on Delay the Enemy. The other 2 heroes + Dunedain Hunter defeat this side quest and then you discard the Hill Troll engaged with you.\n\n \n\nFor the enemies in the discard pile... I'm not sure lol... I'm guessing one of the heroes can be Thalin and then it can kill Eastern Crows during staging\n\n \n\nEDIT:\n\nFor the 2nd challenge, If I can free one tactics resource (and I need to work on that), then I can put a Lore hero instead (Haldir seems like the better option... or Grima, but then you'll have your threat raised by 1) and play very similar to challenge 1, with the next changes:\n\n \n\nGrab Chieftan Ufthak with Dunedain Hunter\n\nReveal the 2nd Hill Troll during staging, and cancel it with The Door is Closed! after you have killed the 1st troll with Legolas + Black Arrow + Hands upon the Bow + some other weapons to reach 12 attack\n\nEdited September 6, 2016 by Rajam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2401031","commentId":2401031,"userName":"Seastan","timestamp":1473130092,"content":"http://ringsdb.com/deck/view/23720 [http://ringsdb.com/deck/view/23720]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2401060","commentId":2401060,"userName":"sappidus","timestamp":1473132937,"content":"> Key pieces:\n> \n> 1 Legolas Hero\n> \n> 2 other Tactics heroes (or Amarthiúl) with a total attack of at least 3\n> \n> 2 Dagger of Westernesse\n> \n> 1 Delay the enemy\n> \n> 1 Black Arrow\n> \n> 1 Dunedain Hunter\n> \n> 1 Hands upon the Bow\n> \n> Dunedain Hunter grabs the 2nd Hill Troll from the encounter deck and puts it into play engaged. 2 Daggers of Westernesse + Legolas + Black Arrow + Hands the Bow = 13 attack -> Kill Hill Troll in staging area during quest phase and place 2 progress tokens on Delay the Enemy. The other 2 heroes + Dunedain Hunter defeat this side quest and then you discard the Hill Troll engaged with you.\n> \n> For the enemies in the discard pile... I'm not sure lol... I'm guessing one of the heroes can be Thalin and then it can kill Eastern Crows during staging\n> \n> EDIT:\n> \n> For the 2nd challenge, If I can free one tactics resource (and I need to work on that), then I can put a Lore hero instead (Haldir seems like the better option... or Grima, but then you'll have your threat raised by 1) and play very similar to challenge 1, with the next changes:\n> \n> Grab Chieftan Ufthak with Dunedain Hunter\n> \n> Reveal the 2nd Hill Troll during staging, and cancel it with The Door is Closed! after you have killed the 1st troll with Legolas + Black Arrow + Hands upon the Bow + some other weapons to reach 12 attack\n\nWhile I did stipulate that there are no allies/attachments in play, I nevertheless like your lines of thought! Both your tries take an approach I certainly did not think of, but I am not sure it works...\n\nDiscarding a card with victory points may not be the same as \"defeating\" it -- the terminology used in the Core rules -- so I don't think that 2nd Hill Troll would be put in the victory display. At the same time, in the same paragraph, the rules do talk about leaving play... Hmmm. Like I said, not sure.\n\nEdited September 6, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2401325","commentId":2401325,"userName":"987654321","timestamp":1473159112,"content":"Reveal Ufhtak during Setup. Use Ravens of the Mountain to put 2 progress on the quest. Out of the Wild a Hill Troll. Exhaust Argalad to deal one damage to the Hill Troll. Play a Westfold Outrider which engages that Hill Troll. Play Stand and Fight to bring it back and discard it to bring Ufhtak. Play Forest Snare to the Hill Troll, and Forest Patrol to deal it 3 damage. Use Scroll of Isildur to use it again. Discard Boromir to kill the Hill Troll and deal two damage to Ufthak. Discard the top 2 cards of your deck for Well-Equipped to bring a Skyward Volley into the discard pile, and play another exhausting Lanwyn to deal 4 damage to Ufhtak and killing him. Reveal Eastern Crows during the Quest phase and ready Lanwyn and discard its surge with Minas Tirith Lampwright, getting that card to the top of your deck with Shadow of the Past to leave an empty discard pile. Use Hands Upon the Bow to kill the Crows with Lanwyn and they get shuffled into the deck leaving an empty discard pile.\n\nHow have the resources for all this? He played Broken Mode(everybody begins with 10 resources on it)!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229371-hidden-objectives/?do=findComment&comment=2401657","commentId":2401657,"userName":"sappidus","timestamp":1473173145,"content":"> http://ringsdb.com/deck/view/23720 [http://ringsdb.com/deck/view/23720]\n\nExcellent! I do note that, even though the same approach will also work on the Chieftain Ufthak variant, the method you describe will prevent the placement of quest progress, so it would not quite explain the stated boardstate in that case."}]}