{"url":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/","title":"Battle of the Pelennor Fields -- 5 rounds of setup?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=2402507","commentId":2402507,"userName":"GrandSpleen","timestamp":1473194295,"content":"The setup for the Battle of the Pelennor Fields quest has you make a Pelennor Fields the active location (4 quest points with no text that is relevant for this question)\n\n \n\nThen the 1B quest card has this text:\n\n \n\n\"Skip the quest phase and combat phase.\nForced: At the end of the planning phase, place 1 progress here.\"\n\n \n\nThe quest card has 2 quest points.  Clearly you're intended to progress to stage 2 at the end of the 2nd planning phase.  But the way it is worded, shouldn't Pelennor Fields act as a buffer for the quest, meaning you actually get 5 rounds of setup before you have to advance?  This question came up way back in 2012 about the Abandoned Tools card and Flight from Moria quest.  Nate French gave this answer, which is reported in the thread here [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-2]:\n\n \n\n\"If there is an active location, the progress from Abandoned Tools should go on the active location. The only time an active location does not act as a \"buffer\" for the quest is if the card specifically instructs you to \"bypass the active location.\"\n\n \n\nFor reference, the Escape from Darkness quest card in Flight from Moria says: \"Abandoned Tools gains: \"Refresh Action: Exhaust attached hero to put a progress token on Escape from Darkness.\" \n\n \n\nWith no text to \"bypass the active location,\" the progress should actually go on the active location first, shouldn't it?  Does BotPF's first stage need errata?\n\nEdited September 6, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=2402527","commentId":2402527,"userName":"sappidus","timestamp":1473194973,"content":"I think by the letter of the ruling you are correct. It's also FAQ entry 1.27. Consider Conflict at the Carrock's Nightmare setup card, which specifically states \"bypassing the active location\" for a similar progress-placing encounter card effect.\n\nhttps://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Conflict-at-the-Carrock-Nightmare/Conflict-at-the-Carrock-Nightmare-SetupB.png [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/Conflict-at-the-Carrock-Nightmare/Conflict-at-the-Carrock-Nightmare-SetupB.png]\n\nThey could also revise the FAQ to account for player cards vs. encounter card effects, but that might be tricky to word, given Abandoned Tools.\n\nAlternatively, could one make an appeal to the Golden Rule in this case? Encounter card specifically says \"here\".\n\nEdited September 6, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=2402570","commentId":2402570,"userName":"Lecitadin","timestamp":1473196156,"content":"Yeah, the quest card says ''here'', and I don't think that they intended to let the players prepare themselves during 4 or 5 planning phase!  And ''here'' also means that even if you think you're a smartass and play a sidequest, you can not bypass the sidequest.   ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\nEdited September 6, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=3301705","commentId":3301705,"userName":"kompunerd","timestamp":1524995266,"content":"Has anyone heard an official ruling on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=3301755","commentId":3301755,"userName":"Wandalf the Gizzard","timestamp":1525003950,"content":"No, but you should only get two turns of progress to set up, even though the wording suggests otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=3335025","commentId":3335025,"userName":"Buhallin","timestamp":1526511544,"content":"We ran into this and I submitted a question.  Response is below.  I actually think it's wrong per the rules as they stand - in both this specific case and the general reasoning, which as near as I can tell doesn't actually exist - but it is official.\n\n \n\nStage 1B, The Garrison of Gondor, gives the players 1 free round before forcing you to advance. In general, if a quest card instructs you to put progress directly on to it, that bypasses any active location. The active location only serves as a buffer to player card effects and progress made from questing successfully.\nHope you’re enjoying The Flame of the West saga expansion!\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=3335248","commentId":3335248,"userName":"kompunerd","timestamp":1526529506,"content":"Thank you Buhallin. I agree that the rules as written are kinda unclear - it's not explicit that the progress bypasses the location and the location starts as active... that said... Caleb is the boss!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229470-battle-of-the-pelennor-fields-5-rounds-of-setup/?do=findComment&comment=3335663","commentId":3335663,"userName":"PocketWraith","timestamp":1526563378,"content":"I think the distinction is that it says to place 1 progress *here*, as opposed to *on the current quest*. Current quest would follow normal rules, but 'here' is very specific."}]}