{"url":"https://community.fantasyflightgames.com/topic/229590-saga-permanent-boons-and-allys/","title":"Saga: permanent boons and allys","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/229590-saga-permanent-boons-and-allys/?do=findComment&comment=2404855","commentId":2404855,"userName":"Flrbb","timestamp":1473314780,"content":"Lately, I am into Caladra decks. I was hinking about starting the saga (again) and lost my thought to which boons I'd pick.\n\nWith Caladra in the discard and Prince Imrahil on the table; would it be leagal to permanently attach a boon to PI?\n\nWhat happens in the next game? Caladra still in play, paying to put PI in game. Has he still his boon card (as an ally)? Similar question: Plaing with Legolas hero, giving him a boon then switching to the ally version. Will that ally always enter play with the bonus attached??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229590-saga-permanent-boons-and-allys/?do=findComment&comment=2405020","commentId":2405020,"userName":"krokodiler","timestamp":1473330560,"content":">  \n> \n> Black Riders rules:\n> \n> If a boon card has the Permanent keyword, the players record which hero it is attached to in the Notes section on page 10.\n> \n> and\n> \n> If a boon with the Permanent keyword was recorded as being attached to a specific hero, that boon must be attached to the specified hero at the start of the game.\n\nSo, as I can see this, there would be a problem Permanent boons, as they can only be attached to a hero at the start of the game and PI ally (and Legolas ally also) cannot fulfill this requirement...\n\nYou could attach Permanent boon during a game when Caldara is in discard and PI on the table, but that boon would not be re-attached to him at the start of the next game.\n\nBut, I think it would be legal to attach Permanent boon to PI ally when Caldara is in discard, switch to PI hero in the next game and re-attach that boon at the start of that game :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYou could even switch lately to another version of PI hero from upcoming The City of Corsairs adv pack and still keep that Permanent boon then :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] :)\n\nEdited September 8, 2016 by krokodiler"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229590-saga-permanent-boons-and-allys/?do=findComment&comment=2405070","commentId":2405070,"userName":"Flrbb","timestamp":1473333895,"content":"Thanks for reminding me of reading the rule book! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/229590-saga-permanent-boons-and-allys/?do=findComment&comment=2405266","commentId":2405266,"userName":"GrandSpleen","timestamp":1473343536,"content":"> With Caladra in the discard and Prince Imrahil on the table; would it be leagal to permanently attach a boon to PI?\n> \n> What happens in the next game? Caladra still in play, paying to put PI in game. \n\n \n\nAlso, if you ended the game with Caldara in the discard pile (so Imrahil could be a hero), you could not use Caldara again in the campaign.  She would be added to the list of fallen heroes."}]}