{"url":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/","title":"Selecting from OR option that does nothing once you&#039;ve tried it","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2419142","commentId":2419142,"userName":"JYoder","timestamp":1474162818,"content":"I know if you have an \"OR\" option you have to pick one that \"must be performed in full, if able\" (faq 1.44), but what of this instance...\n\n \n\nI drew \"Marching up the Road\" in Journey to the Crossroads quest in the Land of Shadow saga. It says, \"When Revealed: Each player must either return an enemy engaged with him to the staging area, or search the encounter deck for a Harad enemy and put it into play engaged with him.\"\n\n \n\nI'm playing 2 handed. For deck 1, I decided to search the encounter deck for an enemy, but found there wasn't one. Now do I have to take the alternate and return an enemy to the staging area? Or because I selected an option, yet it happened to do nothing, am I fine? If that's ok, I assume for the 2nd deck I can opt to do the same, but wanted to double check. Thanks in advance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2419152","commentId":2419152,"userName":"GrandSpleen","timestamp":1474163570,"content":"Hmm, that's probably a question for the developers.  The 'search' option is something you don't necessarily know whether or not you can perform in full until you have tried, and I really doubt there would be a ruling that said you had to perform the first option after having searched the deck and failed to find an enemy.\n\n \n\nThe second deck would then have advance knowledge that there is no enemy in the encounter deck, so are you able to choose that option, knowing you cannot fully perform it?  I don't know!  I would hope that both players are allowed to select the same option, but I couldn't say for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2419295","commentId":2419295,"userName":"NathanH","timestamp":1474182407,"content":"We think it would be unreasonable to search, not find something, and then do the other action, because searching and reshuffle alters the game state. So if we search and don't find something, we consider that resolved. A good strategy is to conveniently forget how many Nazgul there are in the Land of Shadow Nazgul set...\n\n \n\nIf the encounter deck were empty when the card was revealed, then I might argue that, since we can tell whether searching will find something or not, it's not allowed at this point to choose the searching option. A similar argument might apply when the card requires both players to search. But who knows what the official rule is going to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2419874","commentId":2419874,"userName":"dr00","timestamp":1474233372,"content":"you searched and simply failed to find an enemy, and thus 'performed in full, if able' imo\n\n \n\nthe only thing that would force one option over the other is if you had no enemies engaged with you to return to the staging area, then you must search\n\n \n\n \n\n> If the encounter deck were empty when the card was revealed, then I might argue that, since we can tell whether searching will find something or not, it's not allowed at this point to choose the searching option. A similar argument might apply when the card requires both players to search. But who knows what the official rule is going to be.\n\nthe encounter deck still exists, even if there are no cards in it.  that said, it seems like it's a treachery, so there's little chance the deck would be truly empty when it triggers and resolves"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2421678","commentId":2421678,"userName":"JYoder","timestamp":1474322310,"content":"I agree with all of you... though apparently, Caleb doesn't. His response to my email...\n\n \n\n>  \n> \n> If there are no enemies remaining in the deck, then you cannot fulfill that option and must resolve the second option.\n> \n> I hope you’re enjoying The Land of Shadow saga expansion!\n> Cheers,\n> Caleb\n\n \n\nI've replied to his email, asking him to please look at this thread and weigh in as to why this is the case. Because the more I think about it, the more it doesn't feel intuitive. I really dislike the idea of selecting an option, and if nothing concrete comes of it, you dismiss it and choose another option. I have to believe in the history of past quests, there are instances where this would be goofy. It seems to me there is one quest where you can choose to reveal the top card of the encounter deck, and you take a penalty based off the threat. Ring a bell for anyone? If so, then by this ruling, if you reveal a treachery card, then it has 0 threat and you take no penalty, in which case, you are must choose the other option. That just feels wrong and takes away the tension of hoping it's 0.\n\n \n\nOr maybe I'm wrong about that one, but seems there must be something similar somewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2421915","commentId":2421915,"userName":"PsychoRocka","timestamp":1474333009,"content":"I am on the opposite side and don't really see the issue with this ruling. \n\nYou are forced to choose between two options, you choose one but it is literally not possible (no enemies in encounter deck) so instead you have to perform the other option considering you literally cannot perform the other.\n\nThe encounter deck gets shuffled so is still in an unknown order. The whole point and theme behind the treachery is that more Harad enemies are marching to the Black Gate through the crossroads. If just because there are no enemies left in the encounter deck the card did nothing it would be both mechanically and thematically unfitting in my opinion. Due to the fact that no enemies can be added to staging via the encounter deck the card instead grabs enemies you are already engaged with and puts them back in the staging area once more marching towards the black gate. \nThis is definitely one of the key cards you want to be cancelling when playing this quest especially if you are playing with more than 1 player/deck so I get the frustration of the second effect doing nothing and the first then needing to be fulfilled but I think it is pretty clear and straight forward that this is what happens in that case. \n\nI don't really understand the example you made of a similar issue. It is unfortunately not really related. We already know that treachery cards have a \"threat\" of zero and that any card with a printed threat of X will also be considered to have a threat of zero for the purpose of cards that reveal/discard cards from the top of your deck and care about their threat. \n\nSo if you choose to reveal the top card of the encounter deck and raise your threat by the revealed cards printed threat and it is a treachery you simply raise your threat by 0. It is not that you are not fulfilling any criteria you are simply raising threat by 0 instead of say 1 or 2. You are still able to fulfil this effect it just increases threat by 0. Even just think of stuff like Hide tests from the Black Riders. If you reveal treacheries during those you don't reveal a new encounter card instead, the treacheries count and whats more they are what you WANT to appear during stuff like hide tests to make things far easier on you. Just like in whatever quest you are talking about you want treacheries to appear during that effect so that you in fact do not need to raise threat (also what scenario is this...? I cannot think off the top of my head...\n\n \n\nNow lets say Marching up the Road was written differently and instead said:\n\"Search the encounter deck and if there are any enemies with the Harad trait choose one and put it into play engaged with you\" then it would work the way you think it should. You are forced to search for a Harad enemy but if there aren't any you have still fulfilled that effect/choice as you searched the encounter deck but there just were not any Harad enemies.\n\nIF however Marching up the Road appears and the encounter deck has no Harad enemies left AND you don't have enemies engaged then it will indeed do nothing at all. Pretty rare that this would be the case in this particular quest but I could see it happening! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2421952","commentId":2421952,"userName":"GrandSpleen","timestamp":1474336361,"content":"Good to know... as I thought, this was a question for the developers.  Your community responders were not able to divine the answer to this one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2422134","commentId":2422134,"userName":"NathanH","timestamp":1474351774,"content":"> The encounter deck gets shuffled so is still in an unknown order.\n\n \n\nUnless the order was already known through some other effect, and so choosing the second option genuinely changes the relevant board state."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2422250","commentId":2422250,"userName":"PsychoRocka","timestamp":1474362291,"content":"Good point!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2422575","commentId":2422575,"userName":"JYoder","timestamp":1474381498,"content":"> Just like in whatever quest you are talking about you want treacheries to appear during that effect so that you in fact do not need to raise threat (also what scenario is this...? I cannot think off the top of my head...\n\n \n\nI may be completely wrong on that. Kind of rings a bell, but not sure.\n\n \n\n \n\n> Unless the order was already known through some other effect, and so choosing the second option genuinely changes the relevant board state.\n\n \n\nMaybe that's why it feels goofy to me -- the board state has changed. Therefore, you shouldn't have to \"go back\" and now do something different once you've attempted something. But you make it sound like changing the board state is a specific ruling I'm unfamiliar with. Is that the case, and if so, what is it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2423777","commentId":2423777,"userName":"NathanH","timestamp":1474440927,"content":"There isn't one. It's just very weird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2424179","commentId":2424179,"userName":"JYoder","timestamp":1474470042,"content":"I wrote Caleb about game state changing (and even gave example where you previously peeked at multiple cards atop the encounter deck, but now the order changed so this is double whammy as that knowledge is gone and you still should carry out other option) but he stuck with the ruling.\n\nI looked back through other encounter cards and found choices of pulling enemy from encounter deck. Pretty sure if I ever took that option in the past and there was no enemy, I considered it good luck. I just don't know... this may be first time I go against on official LotR LCG ruling as it doesn't sit well with me at all... though I hate the very idea. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2426199","commentId":2426199,"userName":"rsdockery","timestamp":1474571484,"content":"But you shouldn't need to change the game state, because the composition of the Encounter deck is public knowledge. You may not know the precise order of cards in the deck, but you can easily deduce which cards are in it based on the contents of the discard pile and the cards in play. If you look through the deck and can't find any Harad enemies, you've simply misplayed. It's a totally forgivable misplay, and it's not like it gives you an unfair advantage so long as you reshuffle afterwards, but it's still a misplay, and you still need to back up and take a legal move.\n\n \n\nIn the case where you know the top X cards of the deck before your misplay, you should set those known cards aside before reshuffling, then put them back on top of the deck in the correct order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2426881","commentId":2426881,"userName":"dr00","timestamp":1474600600,"content":"> Good to know... as I thought, this was a question for the developers.  Your community responders were not able to divine the answer to this one!\n\nto be completely honest, this doesn't actually follow the logical parse of how one should interact with this situation. it seems that the golden rule of 'do the thing that's worst for the players' is what Caleb was going on for this.\n\nbecause now he has to reconcile more explicitly what it means to 'complete in full, if able' for these OR decisions\n\n\n\n> I wrote Caleb about game state changing (and even gave example where you previously peeked at multiple cards atop the encounter deck, but now the order changed so this is double whammy as that knowledge is gone and you still should carry out other option) but he stuck with the ruling.\n> \n> I looked back through other encounter cards and found choices of pulling enemy from encounter deck. Pretty sure if I ever took that option in the past and there was no enemy, I considered it good luck. I just don't know... this may be first time I go against on official LotR LCG ruling as it doesn't sit well with me at all... though I hate the very idea. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\ni also don't think this will come up ever probably anyway, but i don't agree with the ruling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2426983","commentId":2426983,"userName":"PsychoRocka","timestamp":1474608305,"content":"Look to be honest I think that the situation you guys are in is not at all uncommon for enthusiasts of this game.\n\nThe game is absolutely fantastic but the rules can be finicky and at times extremely hard to predict based on other rulings or your knowledge of the game so it is inevitable that most die hard or regular players will encounter a ruling that they strongly disagree with and/or don't understand. I myself have had this a few times in the past with the most memorable being a specific ruling on To Catch an Orc that I just did not understand at all and could not have more strongly disagreed with.\n\nUltimately though you just have to accept the ruling and move on or you can always just ignore the ruling considering it is a co-operative game where really you can play any sort of way you want or with whatever house rules you want.\n\nI have to say that I think the so called \"golden rule\" is not as reliable anymore. Yes alot of the rulings we get happen to be whichever option is more punishing for the player/s but I find that we get plenty of rulings that go the other way these days. Look at the crazy Prince Imrahil + Caldara ruling we got recently!\n\nEdited September 23, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2426986","commentId":2426986,"userName":"GrandSpleen","timestamp":1474608874,"content":"^^ this\n\n \n\n \n\nI used to be a pretty big stickler for following the rules to the letter, and I still am when I am left to interpreting the rules on myown.  But when I see a a corner case like this which REALLY CAN be read either way, my golden rule is 'however the group wants to play it'  (even if I am aware of an official ruling)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2428123","commentId":2428123,"userName":"TwiceBorn","timestamp":1474661432,"content":"Disregard. \n\nEdited September 23, 2016 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230355-selecting-from-or-option-that-does-nothing-once-youve-tried-it/?do=findComment&comment=2429233","commentId":2429233,"userName":"dr00","timestamp":1474748308,"content":"> I have to say that I think the so called \"golden rule\" is not as reliable anymore. Yes alot of the rulings we get happen to be whichever option is more punishing for the player/s but I find that we get plenty of rulings that go the other way these days. Look at the crazy Prince Imrahil + Caldara ruling we got recently!\n\nwhile i do agree with this, i think it's an odd reply to what i was saying, so i'm not entirely sure what point it is that you're trying to make."}]}