{"url":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/","title":"Spirit Merry and Fast Hitch","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2422212","commentId":2422212,"userName":"Flrbb","timestamp":1474358325,"content":"I do have a question on timing/action windows for the combo of spirit Merry with Fast Hitches attached:\n\n \n\nIn the rule book there is no action window while revealing cards from the encounter deck. So, assuming I send Merry questing and I reveal an enemy - can I ready him and use his threat reduction ability? Or even more: in a multiplayer game with more Fast Hitches: when more enemys are reveald can I use the threat reduction more than once?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2422236","commentId":2422236,"userName":"DukeWellington","timestamp":1474361181,"content":"In general there is an action window at the beginning and end of each step. However, when you reveal encounter cards during the staging step of the quest phase it is all one step, so there are no actiin windows in between ecounter card reveals. That's why all the abilities used during staging are responses instead of actions, like Merry's ability. So, you can commit Merry to the quest and then use fast hitch to ready him before staging because commiting to the quest is a separate step from staging. However, you cannot use fast hitch during staging to ready Merry in between encounter cards.\n\nThere is a way to do it in the saga, however. There is a card Wingfoot, which allows the attached character to ready as a response. So, if Merry had wingfoot attached he could ready after every enemy and use his ability to drop threat. Normally Merry cannot have wingfoot because it only attaches to ranger heroes, but in the saga you can earn a boon that allows you to make a hero a ranger. If you give Merry the ranger trait and attach wingfoot then he can use his ability on every enemy that is revealed by the encounter deck. It's actually somewhat common for people to do it on their campaigns.\n\nEdited September 20, 2016 by DukeWellington"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2422243","commentId":2422243,"userName":"alogos","timestamp":1474361733,"content":"Or you could play Don't be Hasty after readying merry with fast hitch and when revealing a second enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2422536","commentId":2422536,"userName":"PocketWraith","timestamp":1474379857,"content":"Also, if a card effect causes an enemy to make an immediate attack, there are action windows between all the steps of resolving that attack as usual, so you could ready Merry in those to have the option of triggering him again if you reveal another enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2423950","commentId":2423950,"userName":"Seastan","timestamp":1474459929,"content":"> Also, if a card effect causes an enemy to make an immediate attack, there are action windows between all the steps of resolving that attack as usual, so you could ready Merry in those to have the option of triggering him again if you reveal another enemy.\n\n \n\nIn the same vein, if you are using Spirit Merry in A Shadow of the Past, he can ready using Fast Hitch after the cards are revealed for a Hide Test, before the next card is revealed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230517-spirit-merry-and-fast-hitch/?do=findComment&comment=2438165","commentId":2438165,"userName":"Lecitadin","timestamp":1475265461,"content":"Or you quest with Merry, then you ready him with fast hitch, making him ready to exhaust again if an enemy shows up."}]}