{"url":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/","title":"Threat elimination and &quot;key&quot; characters","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2424412","commentId":2424412,"userName":"Boromore","timestamp":1474479376,"content":"Hi. A couple of quick questions about threat elimination for a player with a \"must not leave play\" character (e.g. Bilbo Baggins in the Hobbit Saga quests).\n\n \n\n(1) If the first player is eliminated on threat, does the character move to the new first player's control when the token is passed on, or is he eliminated (and all players losing at that point). \n\n \n\n(2) Is the situation any different with two key characters (e.g. Sahir and Na'asiyah allies in the Dreamchaser cycle), one with the first player, and one for the last?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2425599","commentId":2425599,"userName":"sappidus","timestamp":1474551245,"content":"This seems to come up every so often, and I don't think anyone has actually documented asking officially.\n\nMy ad hoc answer would be that since FAQ 1.30 says something along the lines of the 1st-player token moving IMMEDIATELY when the former 1st player is eliminated, the group would not lose. However, in practice I have always taken a game loss in this situation, as I've assumed that that is the designer intent.\n\nI think it's worth a formal query, though.\n\nEdited September 22, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2425621","commentId":2425621,"userName":"GrandSpleen","timestamp":1474552513,"content":"Pretty sure you lose.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2425838","commentId":2425838,"userName":"Slothgodfather","timestamp":1474560971,"content":"that's interesting as I never paid attention to the movement of the first player token when the first player is eliminated from the game.   If the rules state that the token moves immediately, then it would seem to follow suit that any characters that follow the token also make that switch.\n\nEdited September 22, 2016 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2426083","commentId":2426083,"userName":"sappidus","timestamp":1474568341,"content":"I submitted the official query and will update when I get an answer.\n\nEDIT: That took like 10 minutes...\n\n> If a player is eliminated while in control of something like The One Ring or an objective-ally with game text that will cause the players to lose if it leaves play, then the players will lose the game because all of the cards under that player's control are immediately removed from the game when he is eliminated.\n\nNot surprising. The Core rules (p. 22) do refer to said card elimination, so. Now it's official.\n\nEdited September 22, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428429","commentId":2428429,"userName":"Seastan","timestamp":1474675053,"content":"What about threating out during the refresh phase? It seems that players raise their threat and pass the 1st player token all at the same time. Can players choose the order of these effects (i.e. pass or not pass the saga hero so that the relevant player is not controlling him when he threats out)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428540","commentId":2428540,"userName":"GrandSpleen","timestamp":1474682937,"content":"I would assume you do those things in the order listed in the core set manual, which is raising your threat before passing the token."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428676","commentId":2428676,"userName":"DukeWellington","timestamp":1474698605,"content":"With this thread and the one about EotMM we now know that the cards etc. under a player's control are removed from the game, not discarded. I hope they add that to the official FAQ and errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428755","commentId":2428755,"userName":"rmunn","timestamp":1474709921,"content":"> With this thread and the one about EotMM we now know that the cards etc. under a player's control are removed from the game, not discarded. I hope they add that to the official FAQ and errata.\n\n \n\nHonestly, since sappidus said that Caleb answered in \"like 10 minutes\", I wouldn't put too much importance on his choice of phrasing. I don't think he meant to contradict the official rules, which on page 22 say that the eliminated player's cards are played in \"their owners' discard piles\". If he had said \"removed from play\", then his ruling would have had the exact same effect on what he was ruling (objective allies that cause the players to lose when they leave play), but he wouldn't have been contradicting the rulebook.\n\n \n\nI think Caleb simply wrote in haste, and did not intend to make a ruling that changes the core rulebook in a 10-minute response."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428820","commentId":2428820,"userName":"sappidus","timestamp":1474719109,"content":"> I think Caleb simply wrote in haste, and did not intend to make a ruling that changes the core rulebook in a 10-minute response.\n\nI cannot say what designer intent is, but a ruling that an eliminated player's cards* are removed from the game seems pretty kosher to me.\n\nIf you want to parse Caleb's words with lawyerlike/religious intensity, though, he did not *precisely* say that in his response to my Stand and Fight question...\n\n> Great question. The answer is no, because you cannot search the discard pile of a player who is not a part of the game. Once a player is eliminated from the game, he is no longer part of it.\n\nThis is a pretty clean answer with respect to cards that player controlled that he didn't own, e.g., attachments from others. (This is why I asterisked \"cards\" above, as DukeWellington's summary of a potential Core rules revision in his post is slightly inaccurate in that regard.) Edited September 24, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2428833","commentId":2428833,"userName":"NathanH","timestamp":1474720974,"content":"That seems consistent with the rulebook. The cards are in a discard pile, which is still part of the game, but because the discard pile is no longer a player's discard pile, it doesn't seem possible to interact with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2430854","commentId":2430854,"userName":"Boromore","timestamp":1474893681,"content":"This was my first post, so thanks for all the replies (and for confirming my fears!). To be honest, I was playing it that way, using the Diamond rule \"If it's the hardest option for the players...\", but I was grasping for a let-out clause. No such luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2432787","commentId":2432787,"userName":"rmunn","timestamp":1474989426,"content":">  \n> \n> > I think Caleb simply wrote in haste, and did not intend to make a ruling that changes the core rulebook in a 10-minute response.\n> \n> I cannot say what designer intent is, but a ruling that an eliminated player's cards* are removed from the game seems pretty kosher to me.\n> \n> If you want to parse Caleb's words with lawyerlike/religious intensity, though, he did not *precisely* say that in his response to my Stand and Fight question...\n> \n> > Great question. The answer is no, because you cannot search the discard pile of a player who is not a part of the game. Once a player is eliminated from the game, he is no longer part of it.\n> \n> This is a pretty clean answer with respect to cards that player controlled that he didn't own, e.g., attachments from others. (This is why I asterisked \"cards\" above, as DukeWellington's summary of a potential Core rules revision in his post is slightly inaccurate in that regard.)\n> \n>  \n\n \n\nIf I'd been aware of that ruling (\"Once a player is eliminated from the game, he is no longer part of it\"), I probably wouldn't have written what I did about Caleb's writing in haste, because it's consistent with that ruling.\n\n \n\nSo, to sum up, mostly for my own benefit so that others can check if I got anything wrong:\n\n \n\n1) When a player is eliminated, all the cards he controls get put into their owner's discard piles. If someone else had previously played an Unexpected Courage on him, it goes into its owner's discard pile, not his. If he played a Steward of Gondor on someone else, he doesn't control it, so it stays in the game. But if it later gets discarded for any reason, it goes into his out-of-the-game discard pile and is no longer retrievable by any means.\n\n \n\n2) At that time, any \"leaving play\" effects can be triggered on that player's cards, as per Nate's ruling on the EotMM thread: \"A card \"leaves play\" any time it moves from an in-play state to an out of play state (hand, deck, discard pile, removed from game).\" (Emphasis mine).\n\n \n\n3) If that player controlled \"vital\" heroes or objective allies, who follow the first player token but cause the players to lose the game if they leave play, they leave play before the first player token passes, so the players lose. Do not let the first player threat out during the turn when they're holding the Fellowship ally.\n\n \n\nDo I have that right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2433495","commentId":2433495,"userName":"sappidus","timestamp":1475019075,"content":"> 2) At that time, any \"leaving play\" effects can be triggered on that player's cards, as per Nate's ruling on the EotMM thread: \"A card \"leaves play\" any time it moves from an in-play state to an out of play state (hand, deck, discard pile, removed from game).\" (Emphasis mine).\n\nThis does not directly address your point, but it brings up a question I hadn't thought about: if Eomund, or Squire of the Citadel, leaves play because his controller is eliminated, does that mean the other players don't get to ready their Rohan characters/add a resource to a Gondor hero, because the relevant character is no longer a part of the game? Or are they still part of the game because of something like NathanH's \"The cards are in a discard pile, which is still part of the game, but because the discard pile is no longer a player's discard pile, it doesn't seem possible to interact with it.\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2433782","commentId":2433782,"userName":"NathanH","timestamp":1475043060,"content":"I would expect that Responses don't occur because their controller doesn't exist at the moment their Response occurs, but who knows?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230621-threat-elimination-and-key-characters/?do=findComment&comment=2434674","commentId":2434674,"userName":"rmunn","timestamp":1475084292,"content":">  \n> \n> This does not directly address your point, but it brings up a question I hadn't thought about: if Eomund, or Squire of the Citadel, leaves play because his controller is eliminated, does that mean the other players don't get to ready their Rohan characters/add a resource to a Gondor hero, because the relevant character is no longer a part of the game? Or are they still part of the game because of something like NathanH's \"The cards are in a discard pile, which is still part of the game, but because the discard pile is no longer a player's discard pile, it doesn't seem possible to interact with it.\"?\n> \n>  \n\n \n\nWho gets to trigger a card's response? Only its controller, unless the card specifically says otherwise. So Squire of the Citadel can only be triggered by its controller, and that player is out of the game by that point.\n\n \n\nNow, let's say in a future pack we get a Spirit ally with \"Response: When (this ally) leaves play, spend 2 Spirit resources to ready any two characters. Any player may trigger this effect.\" Then as player A threats out, player B could indeed trigger that ally's effect. But unless the card specifically says so, player B cannot trigger player A's responses -- and so when player A threats out, he takes Eomund or the Squire with him without anyone being allowed to play their effect."}]}