{"url":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/","title":"LotR LCG Rework project: first update + OCTGN support","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2430168","commentId":2430168,"userName":"John Constantine","timestamp":1474832326,"content":"Hello again. I've absorbed the feedback I had from the inital release, and had my own peace, and thought. As a result, I've made some changes to the existing cards, and added some new ones. Be warned though, that this time I was far less conservative and some of the new changes might seem to be on a powerful (or riddikulous) side.\n\n\nI've also imported the set into the OCTGN if anybody cares enough to play with the cards (you may even add me if you wanna play together). Cards are separate from the original ones, so you can mix and match originals with reworks in any combination you like.\n\n\n \n\n\nList of cards that was updated or added:\n\n\nhttp://imgur.com/a/cPcNu [http://imgur.com/a/cPcNu]\n\n\n \n\n\nYou can see all current cards here:\n\n\nLeadership: http://imgur.com/a/aiAzw [http://imgur.com/a/aiAzw]\n\n\nLore: http://imgur.com/a/qt8qK [http://imgur.com/a/qt8qK]\n\n\nSpirit: http://imgur.com/a/hl2Gh [http://imgur.com/a/hl2Gh]\n\n\nTactics: http://imgur.com/a/esBAl [http://imgur.com/a/esBAl]\n\n\nNeutral: http://imgur.com/a/kYZ5z [http://imgur.com/a/kYZ5z]\n\n\n \n\n\nOCTGN Files:\n\n\nhttps://www.dropbox.com/s/9n0yvzql1skyvmn/LotR%20LCG%20Rework%200.02.rar?dl=0 [https://www.dropbox.com/s/9n0yvzql1skyvmn/LotR%20LCG%20Rework%200.02.rar?dl=0]\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2430949","commentId":2430949,"userName":"Mndela","timestamp":1474897317,"content":"Wow hard work. Thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2431253","commentId":2431253,"userName":"dalestephenson","timestamp":1474906635,"content":"Added cards:\n\n \n\nLoFaramir -- I like it, changes him from Faramir, friend of Ranger Spikes to Faramir, friend of hobbits.\n\n \n\nTheodred -- paying for the extra willpower is well worth it for a questing ability.  Change to resource distribution makes him better, but I don't think he's OP.\n\n \n\nGrima -- I like making him multiplayer friendly.  Text should read \"next card\" not \"next cards\"\n\n \n\nThalin -- redistributing a defense point to questing makes him much more valuable.  The rewording of the test to be before enemy keywords is welcome, so he's not useless against the Uruk-Hai.\n\n \n\nGreyflood Wanderer -- I assume the reason for rewording the optional \"doomed\" on this and other card is to make them eligible for that doom-finding card?  I approve, even though it is more awkward to read.  The wp buff from unexplored locations and the reduced doom cost make using his ability much more palatable.\n\n \n\nFarmer Maggot -- 2 wp uniques are always welcome in tactics, and allowing hobbits to pay for him makes him actually playable in a hobbit deck.  I also like expanding his direct damage targets.\n\n \n\nHenneth Annun Wanderer -- share the doom, share the benefit.  Seems fair, although the sentinel-granting is largely a multiplayer benefit.\n\n \n\nSaruman -- doomed mini-Gandalf effect.  It's a shame to lose such a unique ability as ally Saruman had, but this is way more useful and usable.  (As an aside, it occurred to me what power a hypothetical Hero Saruman should have -- since his thing is supposed to be his knowledge of the enemy, he should play with the top card of the encounter deck face up.  Apologies if you've already made him with that power....)\n\n \n\nEred Luin Miner -- very nice change.  I always worry about meant-to-be-mined cards ending up in my hand, and getting a rebate takes away a bit of the sting.\n\n \n\nHerald of Anorien -- shared doom, shared benefit.  Seems appropriate.\n\n \n\nMirkwood Pioneer -- I think the text blanking makes him more compelling.  Ranger and +1 attack are subtle buffs.\n\n \n\nWarden of Anor -- Definitely better, now it always provides a benefit and also gives more flexibility.\n\n \n\nTake no Notice -- I like giving a reward for getting below enemies' threat, and any event that can give conditional threat reduction helps make Hobbit Pipe better.\n\n \n\nWhite Council -- allowing players to pay collectively is a good idea.  Requiring alturism from a player can make a card much less popular.\n\n \n\nChanged cards:\n\n \n\nBrand -- I like it, it makes him actually useful in solo.\n\n \n\nDwalin -- powerful but very nice, makes him a worthy alternative to SpBeregond as a defender, and worthwhile hero without Dain on the table.\n\n \n\nLongbeard Orc Slayer -- a conditional damage to all enemies is preferable to a unconditional damage to engaged enemies.  I like it.\n\n \n\nDamrod -- Adding a secrecy discount and a secrecy buff to his discard makes his discard ability more likely to trigger, though I think it'll still be rare.\n\n \n\nBeorning Bee-keeper -- I like the change to wp, and a questing bee-sting.  Flavorful and useful.\n\n \n\nKeen-eyed Took -- even weakened to +3 engagement cost, I think he's still very useful to a deck that cares.\n\n \n\nSword that was Broken -- thanks for giving Aragorn a discount by name.\n\n \n\nDark Knowledge -- slight tweak to be more multiplayer friendly, good.\n\n \n\nRing of Barahir -- reduction back to 1 cost is important, 4-sphere benefit is interesting and thematic, but since getting to 4-spheres requires two extra attachments, this still isn't a good enough card to justify 3x for the discard-from-hand ability.  I'd move the +1 hp/artifact for additional health back in to give more benefit for the initial play.\n\n \n\nAlternate thought -- you could make it elf-helmish, so it gives you a benefit for each sphere -- +1 health for lore (which it grants), +1 wp for spirit, +1 attack for tactics, and +1 defense for leadership.  That way it has immediate value and increases as spheres are added.\n\n \n\nHobbit Pony -- appreciate losing the restricted, and giving a wp boost for straight questing allows it to be useful on a straight-questing hobbit.  Now it's worth 1.\n\n \n\nElven Spear -- +1/+2 for the round with any discard.  I like this better, despite the lower upside, because it removes the requirement to discard in the combat phase.\n\n \n\nBoots from Erebor -- giving the health back is good, and helps differentiate from the weather stained cloak.\n\n \n\nSwift Strike -- 3 damage plus reduced attack for survivor would make this attractive at 2 again.  I like it.\n\n \n\nWe are not Idle -- protection from dwarven mining is welcome.\n\n \n\nAncestral Knowledge -- changing the bonus from hero exhaustion to unique exhaustion is also welcome.\n\n \n\nWord of Command -- Spreading the benefit to any istari-holder from the doomed is a nice touch, though the revised Saruman and Radagast are needed for that to matter much.  But even with just Gandalf at the table, letting  a lore player benefit someone else's Gandalf is nice.\n\n \n\nGandalf's Search -- Much weaker, which is good because your original was so powerful.  I like this version.\n\n \n\nLate Adventurer -- just a wording change, I think, since you can't exhaust other player's characters.\n\n \n\nStand Together -- also just a wording change I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2431292","commentId":2431292,"userName":"Lecitadin","timestamp":1474908134,"content":"Saruman... AMAZING!!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2431297","commentId":2431297,"userName":"DurinVoronwe","timestamp":1474908314,"content":"> Added cards:\n> \n>  hypothetical Hero Saruman should have -- since his thing is supposed to be his knowledge of the enemy, he should play with the top card of the encounter deck face up.\n\nI guess I am not first with that one..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2431447","commentId":2431447,"userName":"John Constantine","timestamp":1474913556,"content":"Stand Together - not just a wording change. I remvoed \"eligible\", so all players may exaust characters regardless of them being sentinels or not.\n\n \n\nAbout Saruman heroes - there were plenty custom versions of Saruman who plays with the top card of encounter deck revealed, however none of them is mine. I had plenty of Saruman custom heroes designed, final one being this:\n\n \n\npf_iyEQvino.jpg [https://pp.vk.me/c638028/v638028009/1238/pf_iyEQvino.jpg]\n\n \n\nObviously, this was done way before that new version of Grima."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2431959","commentId":2431959,"userName":"Kjeld","timestamp":1474930777,"content":"It might be interesting if instead the Saruman hero allowed its controlling player to absorb the threat gain from Doomed cards by all other players. Obviously, this would skyrocket your threat, but it would make you much more of a team player. However, both your version and this version are pretty much pointless in solo play, so that aspect of Saruman needs work. Why would you play this hero? He needs more of a concrete benefit from Doomed cards -- maybe reduce the Doomed keyword on all cards -- player and encounter deck -- by 1?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2432149","commentId":2432149,"userName":"Rajam","timestamp":1474938929,"content":"Doomed X: Each player draws 1 card. X is the number of players. Once per round.\n\nEdited September 27, 2016 by Rajam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2432313","commentId":2432313,"userName":"John Constantine","timestamp":1474953643,"content":"In solo, you would play that hero for his sheer power and to glue some spheres together. He is also considered to have a printed resource icon of other your heroes, so he is eligible for stuff like Caldara and etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2433309","commentId":2433309,"userName":"Rajam","timestamp":1475009691,"content":"How would Saruman work with Gandalf (in terms of printed resource icons)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2433319","commentId":2433319,"userName":"Kakita Shiro","timestamp":1475010094,"content":"> How would Saruman work with Gandalf (in terms of printed resource icons)?\n\nYou mean if they were the only two heroes you had? Your cards in-hand would be SOL. You'd be utterly dependent on Wizard Pipes to put cards on the top of your deck for Gandalf to play, and while Gandalf is playing them, Saruman has those icons as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2433754","commentId":2433754,"userName":"Edvando","timestamp":1475039336,"content":"> Why would you play this hero? He needs more of a concrete benefit from Doomed cards\n\n \n\nDoomed cards mostly cost 0 and are REALLY freaking powerful. If you not messing with other people threat, you can deal with your own threat more easily. Because of the doomed cost 0 (plus Key of Orthanc), you can use your resources to deal with your threat and/or also use Loragorn.\n\n \n\nAnd yes, that Saruman is mostly pointless in solo (beside his shared colors, high stats and being Istari)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2436250","commentId":2436250,"userName":"John Constantine","timestamp":1475171686,"content":"I'm still working on more stuff, adding new reworks and adjusting the existing ones.\n\n \n\nMost recent one would be The End Comes. A card which strikes me as an extremely strange one, because it seems completely random an unintuitive, especially in being tied to a Dwarf departure for some otherwordly reason.\n\n \n\nI can see, however, a great potential in getting rid of the encounter discard pile, as some quests simply love utilizing it for nasty stuff (Nightmare Mirkwood and Deadman's Dike first come to mind), so I see it as a decent sideboard card. I got rid of strange condition and made it somewhat more friendly to play:\n\n \n\n4fo7DTsUyAM.jpg [https://pp.vk.me/c626831/v626831009/28fde/4fo7DTsUyAM.jpg]\n\n \n\n \n\nAnd, as Scouts are a thing now, I thought it was just the time Snowbourn Scout could use some refreshment:\n\n \n\nvkq11LTMxMA.jpg [https://pp.vk.me/c626831/v626831009/28fe6/vkq11LTMxMA.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2438079","commentId":2438079,"userName":"Edvando","timestamp":1475262666,"content":"I think that version of Snowbourn Scout don´t add real value to the card nor a reason to include it instead of other chump blocks in faction (while also been verbose). One progress don´t do anything by itself 95% of the time, as the -1 threat. Progress to be useful need to get at the critical mass that destroy a location, but if you doing that, you best bet is playing better cards for that function. Even if you play 2 snowbourn scout same turn, you very very rarely blowing a location.\n\n \n\nWhat about \"place 2 progress\"?\n\n \n\nIf you think thats too op in playtesting, maybe \"After Snowbourn Scout enters play or leaves play, place 1 progress...\".\n\n \n\nWith that text i see reason to play Snowbourn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2438097","commentId":2438097,"userName":"dalestephenson","timestamp":1475263122,"content":"I think that version of Snowbourn scout would be a staple.  1-cost non-unique 1 wp ally is outsanding value in Leadership, even without buffing his enters-play response.\n\n \n\nThe End Comes is useful only a few quests, but for those quests it's certainly worth paying 1 instead of being free but hard to trigger.  It's better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2438111","commentId":2438111,"userName":"John Constantine","timestamp":1475263708,"content":"Changing placement of progress from just entering to entering or leaving was my first thought, but then I decided it was too boring. Then I rememberred he's a Scout, so I wanted to give him +1 wp if the location is not explored, just as his cousin. So, if he'd be questing, I shifted his stat point from 1 useless def to 1 useful wp. But then again, I thought that giving him 1 wp directly is sorta boring too, so I went with -1 threat for the location instead, which still makes his enterance essentially a 2 wp contribution for the round if he's gonna quest, which is a bloody good deal to me.\n\nEdited October 3, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2440230","commentId":2440230,"userName":"Edvando","timestamp":1475459030,"content":"I didnt see the 1wp! Sorry =X"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2440745","commentId":2440745,"userName":"Yepesnopes","timestamp":1475501502,"content":"I really love your version of Dwalin!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/230958-lotr-lcg-rework-project-first-update-octgn-support/?do=findComment&comment=2444212","commentId":2444212,"userName":"John Constantine","timestamp":1475686365,"content":"I thought Ever Vigilant was one of my weakest attempts, so I had another go at it:\n\n \n\nMTd_iluMxhw.jpg [https://pp.vk.me/c836322/v836322009/4328/MTd_iluMxhw.jpg]\n\n \n\nWatch'a thinkin'?"}]}