{"url":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/","title":"Solo Deck - One Sphere Possible ?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442056","commentId":2442056,"userName":"Crusaderlord","timestamp":1475576089,"content":"I play one deck solo . Historically i have always used two or three spheres cherry picking cards, but getting resources for all spheres when needed was always a bit tough. I thought one sphere (apart from spirit maybe) would never work well as there are cards you really want that are suddenly unavailable - however that may be changing.\n\n \n\nI recently bought the Angmar Cycle and Rossiel made me finally try a Lore only deck for the first time for over 2 years, and wow it did work well, adding in the Rivendell Minstrel for a song and a splash of spirit threat control i found i had plenty of lore resources and could generate a lot of varied allies in play, and with burning brand and elf cloak Rossiel ended up defending everything that enemies threw at her. Plus you can even discard cards occasionally when in the victory display. This was a fun and magical deck and you have a lot of enemy control on hand. Actually i felt lore is quite well set up to cope even without Rossiel as you have traps and shadow protection.\n\n \n\nI am now wondering if other spheres are also more up to the job of solo play now. I know a recent tactics hero even had some questing ability. I may have to try and move into playing more one sphere decks as this will utilise cards i have not managed to get into play before given i have tended to stick to old favourites. I quite like the idea of playing mono spheres as it does make the deck easier to build in that you are largely just looking through one sphere of cards to choose from - then perhaps consider a song and one or two cards that you really dont want to leave behind such as unexpected courage or light of valinor. I liked the process more than looking through the whole box of cards each time.\n\nEdited October 4, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442095","commentId":2442095,"userName":"DunedainLoreKeeper","timestamp":1475580692,"content":"Sure!\n\n \n\nSpirit can make a good Caldara deck, or Noldor.\n\nTactics *could* work with the new Eowyn but I haven't tried it yet.\n\nLore can use traps to make any deck good in solo.\n\nLeadership can use Faramir, Sword that was Broken etc. to turn decks with enough combat power into questing.\n\n \n\nKey cards for solo are:\n\n \n\nResource generation (for non-leadership): Elf Stone, Zigil Miner, Vilya, Caldara, Theoden (sp), Mablung, Grima, etc.\n\nCard draw (for non-lore): Galadriel, Elven Light, Foe-hammer, Ancient Mathom, Valiant sacrifice, Erestor (Le), Rod of the Steward, Legolas (al)\n\n \n\nIf you can get reliable card draw and resource generation or card discounts, you can make a good deck with it. There are enough powerful allies to get enough firepower on the table, and threat reduction is not as nessecary as it used to be. And there are always cards like Gandalf and Treebeard that help out as neutral allies. However, it is my opinion that for solo it's a lot easier to splash in extra spheres than it used to, making it less nessecary to strictly go mono-sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442256","commentId":2442256,"userName":"joezim007","timestamp":1475590291,"content":"Spirit and Leadership definitely can. Haven't tried Tactics, but they're obviously great against Battle or Siege quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442260","commentId":2442260,"userName":"Nickpes","timestamp":1475590527,"content":"I have played (for fun) and won half the quests (including dol guldur and massing at osgiliath) with a spirit solo deck. So yes it can be. Leadership also can build great decks\n\nWith tactics i have managed to win many quests also -including tough ones- not with a good score but who cares.\n\nNever tried lore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442280","commentId":2442280,"userName":"Narsil0420","timestamp":1475591013,"content":"Just played with Eowyn, Mablung, Na'asiyah (Gandalf my only non-tactics ally) and did great against Helm's Deep. Given, you don't have to have crazy willpower there, only enough to slow the encounter deck's progress but still, it felt well balanced. I focused on including the 2 WP allies, and all the cards that let tactics do other sphere's work: the damage prevention cards(Close call was great), Legolas and Foe-hammer, Grappling Hook was great, Arod, and the threat reduction attachment. I actually forgot to use Eowyn's special ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442345","commentId":2442345,"userName":"DurinVoronwe","timestamp":1475593102,"content":"> Just played with Eowyn, Mablung, Na'asiyah (Gandalf my only non-tactics ally) and did great against Helm's Deep. Given, you don't have to have crazy willpower there, only enough to slow the encounter deck's progress but still, it felt well balanced. I focused on including the 2 WP allies, and all the cards that let tactics do other sphere's work: the damage prevention cards(Close call was great), Legolas and Foe-hammer, Grappling Hook was great, Arod, and the threat reduction attachment. I actually forgot to use Eowyn's special ability.\n\nYou should have used Eowyn with Grappling Hook! Spirit Eowyn: \"I quest for 8!\". Tactics Eowyn: \"I quest for 10!\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2442715","commentId":2442715,"userName":"Benoit Poulin","timestamp":1475604187,"content":"> Spirit and Leadership definitely can. Haven't tried Tactics, but they're obviously great against Battle or Siege quests.\n\n \n\nActually, I was only able to beat the second and third quest of Heirs of Numenor with mono tactic decks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445154","commentId":2445154,"userName":"CaffeineAddict","timestamp":1475733811,"content":"> I have played (for fun)\n\nAs opposed to....?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445172","commentId":2445172,"userName":"PsychoRocka","timestamp":1475735534,"content":">  \n> \n> > I have played (for fun)\n> \n> As opposed to....?\n> \n>  \n\nHave you played Battle of Carn Dum?  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  (I jest!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445173","commentId":2445173,"userName":"dr00","timestamp":1475735543,"content":"> > Just played with Eowyn, Mablung, Na'asiyah (Gandalf my only non-tactics ally) and did great against Helm's Deep. Given, you don't have to have crazy willpower there, only enough to slow the encounter deck's progress but still, it felt well balanced. I focused on including the 2 WP allies, and all the cards that let tactics do other sphere's work: the damage prevention cards(Close call was great), Legolas and Foe-hammer, Grappling Hook was great, Arod, and the threat reduction attachment. I actually forgot to use Eowyn's special ability.\n> \n> You should have used Eowyn with Grappling Hook! Spirit Eowyn: \"I quest for 8!\". Tactics Eowyn: \"I quest for 10!\".\n\njust so we're clear, you do have to exhaust the attached character to use Grappling Hook\n\ni also don't believe there's a way to commit yourself more than once to the quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445386","commentId":2445386,"userName":"DurinVoronwe","timestamp":1475755459,"content":"> > > Just played with Eowyn, Mablung, Na'asiyah (Gandalf my only non-tactics ally) and did great against Helm's Deep. Given, you don't have to have crazy willpower there, only enough to slow the encounter deck's progress but still, it felt well balanced. I focused on including the 2 WP allies, and all the cards that let tactics do other sphere's work: the damage prevention cards(Close call was great), Legolas and Foe-hammer, Grappling Hook was great, Arod, and the threat reduction attachment. I actually forgot to use Eowyn's special ability.\n> > \n> > You should have used Eowyn with Grappling Hook! Spirit Eowyn: \"I quest for 8!\". Tactics Eowyn: \"I quest for 10!\".\n> \n> just so we're clear, you do have to exhaust the attached character to use Grappling Hooki also don't believe there's a way to commit yourself more than once to the quest\n\nYes and? Have I missed a ruling here? Quick Strike, use ability, quest with Grappling Hook. What's wrong? I'm not so good with rules in this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445394","commentId":2445394,"userName":"John Constantine","timestamp":1475755722,"content":"How are you not supposed to exhaust attached character while using Grappling Hook, if it reads \"exhaust attached character\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445437","commentId":2445437,"userName":"joezim007","timestamp":1475758070,"content":"Not sure why anyone is bringing up the exhaustion via Grappling Hook or double committing. Just wait until the action window after staging, then pop Eowyn's ability and then Grappling Hook on her to quest for 10. Also, since she takes with her ability, you should use something like Quick Strike kill something engaged with you before popping GH."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445632","commentId":2445632,"userName":"dr00","timestamp":1475767305,"content":"> Yes and?\n\nand... nothing else. that's it.\n\nno, you haven't missed a ruling per se, but your post was ambiguously worded in such a way that it wasn't clear to me what exactly you were implying. hence my post.\n\ni see now that you probably meant questing for 8 by from 4 players discarding cards, but i read it differently at first.\n\n\n\n> Not sure why anyone is bringing up the exhaustion via Grappling Hook or double committing.\n\nbecause it's a relevant mechanic for the card?\n\ni'm not saying that it's mechanically impossible, i'm just bringing it up so that people don't ignore it when thinking of what they can do with the card.\n\nhonestly, it was meant to be a helpful clarification post. and i did not expect this much attitude lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445722","commentId":2445722,"userName":"Nickpes","timestamp":1475770541,"content":">  \n> \n> > I have played (for fun)\n> \n> As opposed to....?\n> \n>  \n\nhehehehheeh\n\n \n\nI mean I started doing this just to experiment, not aiming to win the quests, but it turned out good. I was using Glorfindel, Galadriel and Pippin (Mery was not there at the time), so maybe not the best hero setup"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2445872","commentId":2445872,"userName":"rican919","timestamp":1475776484,"content":"I have done well with an Lore trap deck using Aragorn (one time threat reduction to starting level), Damrod (-1 cost to first trap played per round and card draw when trap successfully snares an enemy), and Mirlonde (reduce threat of all lore heroes by 1).  These heroes give me a starting threat of 26, plus the chance to reset back to 26 if things get out of hand.  I have other cards to help with card draws and discard manipulation including Anborn (return topmost trap from the discard pile back to hand).  The traps help keep enemies under control either stopping engagement checks altogether, reducing snared enemy threat, poisoning to death, etc, so that allies and heroes can quest or battle if necessary.  Doesn't work in all scenario types though.  This one isn't well suited for siege quests, for example.  I have a number of different decks that work better in some quest types than others.  Part of the fun really, this is a deck building game after all.  But this all Lore deck is one I keep coming back to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2446863","commentId":2446863,"userName":"DurinVoronwe","timestamp":1475827822,"content":">  \n> \n> > Yes and?\n> \n> and... nothing else. that's it.\n> \n> no, you haven't missed a ruling per se, but your post was ambiguously worded in such a way that it wasn't clear to me what exactly you were implying. hence my post.\n> \n> i see now that you probably meant questing for 8 by from 4 players discarding cards, but i read it differently at first.\n> \n> > Not sure why anyone is bringing up the exhaustion via Grappling Hook or double committing.\n> \n> because it's a relevant mechanic for the card?\n> \n> i'm not saying that it's mechanically impossible, i'm just bringing it up so that people don't ignore it when thinking of what they can do with the card.\n> \n> honestly, it was meant to be a helpful clarification post. and i did not expect this much attitude lol\n> \n>  \n\nOh, my fault. I´m not a good English speaker. I should have described more.\n\n \n\nAlso, sorry for I sounding angry in my previous post. It wasen´t my intent to make everyone of you feel angry and hurt. Sorry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231599-solo-deck-one-sphere-possible/?do=findComment&comment=2446960","commentId":2446960,"userName":"Crusaderlord","timestamp":1475839002,"content":"It is such a versatile solo game its quite amazing . Once you start to get over use to your favourite deck and dare is say find it a bit samey, just switch into another sphere and the quest you are playing can take on a whole new difficulty or experience. I don't know of any other solo game experience with quite this much variation available - and this is even before you consider the actual number of different quest scenarios you can buy and how different some of them are, both theme wise or how mechanics test you.\n\n \n\nTo think i bought this game in 2013 and then sold it a few weeks later as being too hard - then was prompted to give it another shot in 2014 when i was more interested in having a long term solo game and it clicked this time around. Yes there are quests that just don't work well solo or are set up so hard - as some penalties where really designed to be shared around more players, but i found i have learnt how to re-interpret an occasional rule to make them work in a more enjoyable anyway solo. You do have to have a mindset that doesn't mind losing and trying again and embraces this as part of the game. If you only ever want to win every game then this may still disappoint. \n\n \n\nI have recently become more interested in tinkering with the encounter decks a bit (heresy i know). For instance merging some Passage to Mirkwood core and nightmare to make a better challenge or my latest one to add in a couple of extra / different wargs to the Wastes of Eriador. I find this quite fun after i have beaten the original version or maybe a mid way option to easy level rather than removing all the tougher golden cards.  "}]}