{"url":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/","title":"Philosophy of Gaming: Thoughts on Motivation","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2447972","commentId":2447972,"userName":"DukeWellington","timestamp":1475878873,"content":"Why do we play?\n\nMy major in college was philosophy, and you may find it interesting to know that one of the most common degrees among professional game designers is philosophy. I have read many blogs and even books on the process of game design and it is filled with the same patterns of thought as you find in a philosophical discipline. Philosophers want to comprehend human consciousness. How is it that the human mind is able to understand anything? Why? The same sort of person who is driven to understand the understanding is the same sort of person who ends up playing and designing games. That's been my experience.\n\nMany blogs have been written on the topic of motivation in gaming. By far the most famous was a series written by Mark Rosewater concerning the Spike/Johnny/Timmy player profiles. Rosewater's categories have since defined the paradigm of the discussion. The general takeaway is that people play games for three main reasons (corresponding to the three player profiles): 1. competition 2. self expression 3. big splashy moments. However, the topic continues to evolve and over time people have realized that there are other factors that don't fit. Some people just play games because they are collectors. Collecting is their first love, and they just play as an off shoot. Some people play merely as a social excercise. Some people like to watch others play, and only participate as a way of connecting with the people the watch. And so on.\n\nIf we take a step back and get more fundamental in our thinking, it seems that people play games for two broad reasons: 1. to pass the time (entertainment) 2. to feel a sense of accomplishment. People like to fill their days with activity rather than just lie in bed. Even if the activity is mental, they will do something rather than nothing. We read books, watch movies, play a game of solitaire, take a walk, write a poem, surf the internet, call a friend, whatever. Different people have different tastes and we go with what we like. It seems too simple, but in the end, maybe that is the best answer we can get.\n\nGenerally as we are doing things, we like to feel that the activity matters. It has to have purpose and meaning, or at least feel that way. It doesn't matter whether that purpose is \"real\" or not, whatever that means. It just needs to mean something to us. For some, that sense of accomplishment comes when they win a competitive contest, whether against another person, or against an arbitrary standard or goal, like getting under par when golfing. Some people get a sense of satisfaction by solving a Sudoku puzzle. A previously uncovered mystery has been solved through deductive reasoning. This same puzzle solving drive leads a deck builder to uncover cominations that \"break\" a game (that's a topicc for another day). Some people find inherent value in exploring varios role playing scenarios. Imagine a local actors group who engages in improv acting exercises. The leader says, \"Okay, Tim, you are a KKK grand dragon, Kim, you are a member of the Black Panthers, and Joe, you're Jesus. Ready? And... action!\" We want to know how that situation would turn out. If actors can create a plausible scene, it teaches something about humanity. Yet, what is the difference between a group of improv actors and a weekly D&D playgroup? There are different rules for deciding what to do, but the differences are less than you might think.\n\nTo summarize, I find it most enlightening to think of people as possessing a complex mix of various motivations when gaming. Each person has their own gamer personality profile. The motivations are, broadly speaking, found in four major categories, and each category is itself complex and made up of different subcategories (which I won't bother to analyze here).\n\nThe categories are:\n\n1. Puzzle solving: Using various methods to uncover information that solves or completes some mystery. Methods include trual and error, deductive reasoning, and/or inductive research, etc.\n\n2. Competition: Turning gaming into sporting, the player is not interested in necessarily solving anything, but in executing previously mastered techniques or strategies in the most impressive way possible.\n\n3. Exploration/Expression: Here a player is focused on making unique individual contributions to community. This could be through role playing or novel deck design, but the point is to introduce to the world a previously unwittnessed combination of elements\n\n4. Spectating: Focusing on gaming as entertaining pasttime, a player is motivated to enjoy the inevitable unfolding of an algorithm, or the sporting contest of two others, or to take in the improvised creation of others. The player plays to connect to that which he or she enjoys watching\n\nNow that I have described my understanding of player motivations I want to make a quick observation about the history of gaming and then connect all this to LOTR LCG.\n\nBefore the contemporary era of gaming, people thought very differently. Games were idle amusement or wasteful dangers, like gambling. Even as gaming became more socially acceptable and sophisticated, people couldn't get around comparing games to sports, and making it all about winning. Can we have professional gamer leagues, like we have with football? Again, Magic the Gathering defined the conversation. People could earn a living in competitive Magic, but the vast majority of plaayers didn't care or even try to do that. In fact, there was a backlash against competitive gaming as players employed shaming language to condemn people who would \"pay to win\" or \"netdeck\" or \"min/max\" \"tryhard\". In many playgroups it was viewed as morally repugnant to be good at the game. Certain cards or decks would be banned in the interest of fun. Today, we see the trend of shaming competitive players as a fully accepted practice, even if it is not really taken seriously. My explanation for this is that people used ethical outrage to communicate something that they could not really articulate for lack of vocabulary or social tropes. They wanted to simply say that in their gamer personality profile competition was not a high priority. They wanted to express themselves, or spectate. They had different goals. The modular nature of the Magic game mechanics had introduced to the world, for the first time, a single game that could incorporate all of the different motivations into a single player community. Dungeons and Dragons never spawned that kind of conflict because there is no possibility of competitive D&D\n\nNow, at long last, I address the specific game we all play and love, LOTR LCG. This was the first game, ever, to combine deckbuilding, and an expanding cardpool, with cooperative gaming. The only other game that even came close was Sentinels of the Multiverse, which was a raw kickstarter driven innovation that gave players a coop experience with premade decks. Yet even that game is barely comparible to LOTR LCG. Fantasy Flight really did something special when they made this game. Now, with the new Arkham Horror LCG they hope to follow that up with another success.\n\nThe interesting thing about a coop LCG is that it is not driven by competitive motivation. I would say that it hits the other three pillars pretty hard, but it especially satisfies the motivation to explore and express. LOTR LCG is like a role playing game that you experiance as a deckbuilding game, like Magic or Netrunner. However, since it is non-competitive there is no real conflict between types of players. Nobody complains if you netdeck. In fact, it would be nice if more people would try those decks out. It is true that cards can get OP and/or nerfed, but such cards do not \"destroy the meta\" because there is no competitive pressure to use those cards to win against the meta. Players simply choose not to use broken cards (something they can't do in a competitive environment). I think people have a hard time adjusting, and this game represents a culture shift.\n\nFor me, I tend to be strongest on the pillars related to explore/express and spectating. Competition and Puzzle solving are less and less important to me. I like to just say, \"let's see what happens!\" I approach the game like that improv acting group. Probably my most fun experience ever playing LOTR LCG was when I built an orc killer deck around Frodo, Dwalin, and tactics Merry and tried to beat all the orc heavy scenarios in the game. It turns out, that's super fun. I used to get all pumped to play nightmare quests because I wanted the challenge, and sometimes that is still fun, but these days I get super pumped when an easy quest comes along because I know I will end up running like 100 different decks against it, just to see what happens. The uber hard quest stay in the box unplayed.\n\nI have started to explain these things when I introduce new people to the game and it has been dramatically successful. I say, \"Look, I know you want to just play one of my decks to get the hang of things, but I won't let you. I have yet to see anybody enjoy this game without building their own deck. This is a different kind of game. The goal is not to win, but to win only in your own way. When you do that, you will love this game.\" When I explain that, people get it, and then they see the game for what it is and enjiy it much more.\n\nConsider a few things as you play. Most games have a huge cardpool, but less than a third of the cards are even playable. In this game nearly all the cards are playable. Consider digging deep into a small handful of your favorite quests. If your goal is to puzzle solve and master the game (which is fine) then you will ultimately always use power cards that 1. draw cards 2. accelerate income 3. cheat expensive cards into play (a very good tale) 4. ready characters 5. create infinitely repeatable combinations, etc. These effects ignore the specifics of the quest but always work. If your goal is to see what happens consider avoiding these effects as much as possible and focus on cards that are only good against threats specific to that quest (Dwalin). Playing thematically is always fun. Try to understand who you are as a unique player in the community and approach the game so as to always offer something consistent with that uniqueness. Develop a reputation and show appreciation for the unique contributiins of others.\n\nAs always, I hope you have enjoyed my thoughts and found them helpful and encouraging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448108","commentId":2448108,"userName":"Lecitadin","timestamp":1475886743,"content":"I have Asperger, and LOTR LCG is my favorite game, I play A LOT. The time I spent playing keeps me at peace and focused. It's my own private time. And I love the art and the mechanics of the gane.. Call it an obsession!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448236","commentId":2448236,"userName":"dr00","timestamp":1475899331,"content":"with liberal education for my first two years, i could have technically majored in Antropology, Philosophy, Psychology, or Sociology\n\ni chose Sociology, but i still enjoyed Philosophy quite a lot, especially in how it helped me to logically parse arguments and reason.\n\nwell anyway, as a personal Philosophy i guess, i enjoy trying to figure out puzzles, but also spatial thinking. i'm also a pretty kinaesthetic learner, so board games and card games are a good way for me to lay everything out in an ordered way and try to feel the connections and combinations they have with each other.\n\ni love figuring out puzzles in board games, but moreso i think it's just trying to think of ways to achieve certain things. i want to get from point A to point B, and i have X, Y, and Z, so how can i use these things to accomplish that? how can i use them to accomplish it more efficiently?\n\ni also really love exploration in games. i think this just comes from my childhood, playing Monopoly, and Candyland, and visiting all of the places of the board. going next game and visiting completely different places, so a completely different journey."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448285","commentId":2448285,"userName":"John Constantine","timestamp":1475905036,"content":"I can play as Grima."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448526","commentId":2448526,"userName":"dalestephenson","timestamp":1475940861,"content":"> The interesting thing about a coop LCG is that it is not driven by competitive motivation. I would say that it hits the other three pillars pretty hard, but it especially satisfies the motivation to explore and express. LOTR LCG is like a role playing game that you experiance as a deckbuilding game, like Magic or Netrunner. However, since it is non-competitive there is no real conflict between types of players. Nobody complains if you netdeck. In fact, it would be nice if more people would try those decks out. It is true that cards can get OP and/or nerfed, but such cards do not \"destroy the meta\" because there is no competitive pressure to use those cards to win against the meta. Players simply choose not to use broken cards (something they can't do in a competitive environment). I think people have a hard time adjusting, and this game represents a culture shift.\n\nI enjoyed your post, but I think one of the interesting things about LOTR is that it's not strictly a coop LCG, and may not even be mostly a coop LCG.  Solo players (one or two-handed) are a significant portion of the userbase, perhaps the majority, and whatever style of play or deck a player uses can't possibly create conflict.  The only expectation conflict comes when particular quests turn out to be \"too easy\" or \"too hard\" for the style of play the solo player most enjoys.\n\n \n\nI haven't had a chance to play multiplayer in a bring-your-own-deck environment, but I would think an expectations conflict between players is quite possible.  If a player \"netdecks\" for the purpose of bringing the most powerful possible deck, I think players might complain if your super-Boromir deck hogs all the combat (or for a recent thread, your super-Gloin deck takes all the attacks undefended).  In a solo environment there's no conflict between experimental decks and optimal decks, but in a MP session I would think a conflict between \"competitive\" gamers seeking only to crush the quest as quickly as possible and a \"thematic\" player who wants every quest to pose a real threat of losing is quite possible.   It may not have quite the sting of a clash between competitive and experimental players in a competitive game, as at least the experimental players wins instead of loses, but I pity the player whose enjoyment comes primarily or even significantly from whether he wins or loses.  On the other hand, a competitive gamer with a powerful deck may not be amused when a player brings an experimental deck that contributes little towards the quest.  I just built a private deck with SpMerry/SpPippin intended to never engage and filled with temporary/movable spirit characters to keep under Strider limits, but if I brought it to a fellowship event and it didn't pull its weight against a tough quest, I think a more competitive player might rightfully be miffed.  (There's also the possibility of someone bringing a Grima deck and hogging popular unique cards, but I would guess/hope that such behavior is very very rare.)\n\n \n\nI would also point out that \"shaming competitive players\" is certainly extant in our game.  \"Friends don't let friends play Outlands.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448623","commentId":2448623,"userName":"DukeWellington","timestamp":1475946879,"content":"Dalestephenson, I am learning your communication style and it is extremely analytical in nature. You seem to focus on precise details and draw distinctions based on those details. I have had several friends like you and I always find conversations extremely frustrating because my mind doesn't work that way. I paint like an impressionist who uses big bold strokes. I often find myself thinking that precise communicators like you draw out \"distinction with no difference\" (a common phrase used in debate). None of this is a criticism. I am hust describing the contrast in our styles which will commonly produce conflict so that you can perhaps see a little better where i am coming from. My goal is not to achieve \"mathematical\" accuracy in which no exception can be found. My goal is to give summary general impressions that then define the conversatiinal paradigms by establishing what is \"normal\" and which is \"exceptional\".\n\nNow that I said that I can respond to your points. Calling a game \"coop\", in standard cultural convention, automatically includes the idea that the game can also be played solo by default. So, a \"solitaire\" category is a game that can only be played solo. Thus, drawing a distinction between coop and solo is unnecessary. Every coop game can, at least, be played \"two handed\" or something like that, unless the game necessarily involves hidden information (as with the game Hanabi, a coop game that cannot be played solo). In general I think all the points I made already took solo play into account. I play about 90% solo.\n\nIn saying there is no conflict between types of players I was not making a statement of absolute degree, but simply saying that this is a different kind of game that does not naturally foster such conflict. Every player group is different and I cannot possibly make a statement that is true of all people. However, I can make broad general statements. First, if people shame a power decker, which does happen, I suspect this is more of a carry over from the culture that was previously established by other games like Magic. If people are accustomed to controlling their playgroup by those means, then they will continue to do so, even if it's not really natural to the game. Second, coop games produce a different kind of conflict in which some \"alpha gamer\" sort of takes charge and wants to tell everyone what yo do. The other gamers want the contributions of each participant to be as close to even as possible. Thus, some players can become frustrated that they are just sitting around and watching while the rest of the team plays and just tells them what to do. If players experience that regularly they may decide they don't like coop games, or they may try to stop certain players from playing certain cards. For instance, the problem with Outlands in MP is not so much that it is OP (although that can be a problem), it is that the player using Outlands has super long turns and play tons of allies while other players do like one thing and pass. The same is true with power Boromir decks. One player just takes up too much of the play time. That seems to me to be the kind of conflict that naturally arises in coop. Of course there are exceptions, but having been in both communities extensively, the shaming of power players is almost non existent compared with other deck building games. It still happens (ussually with newer members of community) but to a far smaller degree. Of course, you can disagree =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448632","commentId":2448632,"userName":"DukeWellington","timestamp":1475947320,"content":"@dr00 Trying to get from point A to point B using X,Y, and Z is what I would call a puzzle. Puzzle solving is a broad category, so it includes things that may not be called puzzles in casual language. For instance, if you are trying to build a \"one deck to rule them all\" that can beat all quests that can be a puzzle solving challenge. It can also be a competitive challenge. The distinction is more psycological, and there can be some overlap. It sounds, from what you were saying, that you are a puzzle solver =)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448686","commentId":2448686,"userName":"dalestephenson","timestamp":1475952096,"content":"> Dalestephenson, I am learning your communication style and it is extremely analytical in nature. You seem to focus on precise details and draw distinctions based on those details. I have had several friends like you and I always find conversations extremely frustrating because my mind doesn't work that way. I paint like an impressionist who uses big bold strokes. I often find myself thinking that precise communicators like you draw out \"distinction with no difference\" (a common phrase used in debate). None of this is a criticism. I am hust describing the contrast in our styles which will commonly produce conflict so that you can perhaps see a little better where i am coming from. My goal is not to achieve \"mathematical\" accuracy in which no exception can be found. My goal is to give summary general impressions that then define the conversatiinal paradigms by establishing what is \"normal\" and which is \"exceptional\".\n> \n> Now that I said that I can respond to your points. Calling a game \"coop\", in standard cultural convention, automatically includes the idea that the game can also be played solo by default. So, a \"solitaire\" category is a game that can only be played solo. Thus, drawing a distinction between coop and solo is unnecessary. Every coop game can, at least, be played \"two handed\" or something like that, unless the game necessarily involves hidden information (as with the game Hanabi, a coop game that cannot be played solo). In general I think all the points I made already took solo play into account. I play about 90% solo.\n> \n> In saying there is no conflict between types of players I was not making a statement of absolute degree, but simply saying that this is a different kind of game that does not naturally foster such conflict. Every player group is different and I cannot possibly make a statement that is true of all people. However, I can make broad general statements. First, if people shame a power decker, which does happen, I suspect this is more of a carry over from the culture that was previously established by other games like Magic. If people are accustomed to controlling their playgroup by those means, then they will continue to do so, even if it's not really natural to the game. Second, coop games produce a different kind of conflict in which some \"alpha gamer\" sort of takes charge and wants to tell everyone what yo do. The other gamers want the contributions of each participant to be as close to even as possible. Thus, some players can become frustrated that they are just sitting around and watching while the rest of the team plays and just tells them what to do. If players experience that regularly they may decide they don't like coop games, or they may try to stop certain players from playing certain cards. For instance, the problem with Outlands in MP is not so much that it is OP (although that can be a problem), it is that the player using Outlands has super long turns and play tons of allies while other players do like one thing and pass. The same is true with power Boromir decks. One player just takes up too much of the play time. That seems to me to be the kind of conflict that naturally arises in coop. Of course there are exceptions, but having been in both communities extensively, the shaming of power players is almost non existent compared with other deck building games. It still happens (ussually with newer members of community) but to a far smaller degree. Of course, you can disagree =)\n\nDukeWellington, thanks for you explaining where you're coming from.  And I'd like to repeat that I have no personal experience with multiplayer (outside two player games where I constructed both decks), so my thoughts on differing expectations there are all theoretical or based in different games.  I certainly could be wrong.\n\n \n\nIt's true that mechanically any co-op game can be played as a solitaire game, and it's hypothetically possible for people to cooperate on any solitaire game (either by splitting decisions or using dicussion/voting to determine actions).  However, as a matter of practice I think the distinction between co-op and solitaire is meaningful, because the presence of multiple players creates issues and interactions that do not exist in solitaire form.  The possible presence of an \"alpha gamer\", as you mentioned, is one such wrinkle.  But LOTR is very unusual (for boardgames) in that different players can, by their own choices, bring very different capabilities to the game.  If I'm playing a game of Pandemic or Flash Point: Fire Rescue, it's possible that I may see my role is more powerful or less powerful than the role randomly assigned to some other player.  But it's never going to be the case where I play a game of Flash Point with a stranger and I bring a character with one power and he brings a character with five powers.  So you could have a different sort of \"alpha gamer\" problem -- not someone who's telling me what to do with my turn, but someone who's doing all the work because his deck is so much better than mine.  You acknowledge that, but it's a problem *solely* with LOTR in co-op form.  Divergent power levels or capabilites between decks has *no* effect in solo apart from altering difficulty level.  Errata to prevent \"abusive\" decks are completely useless, and sometimes harmful to a solo player, but I can see where a co-op player would want or welcome such errata.\n\n \n\nI'm quite surprised to hear that the objection to Outlands in MP is more related to \"super long turns\" and \"playing lots of allies\" than power level, and that the same is true of power Boromir decks.  When playing (solo) Outlands and Boromir, I never noticed either having exceptional long turns.  In my experience the longest turns are associated with scrying, draw engines, and cards that require decision making, and I'd rate Outlands and Boromir both relatively low on those aspects.  Playing allies in hand I've always found to be a very quick process, slap it down and pay the resources.  None of the Outlands have per-turn capabilities, so use of them once they are down is also very straightforward -- in fact, the ease of play I thought was one of the distinguishing hallmarks of an Outlands deck, and one of the criticisms of Outlands is that it *didn't* require skill to pilot.  Am I off base here?\n\n \n\nOf course, this gets back to your point about divergent discussion styles.  You want to philosophize about a general point, I'm more interested if the specific details used to support a point *actually* support a point.  Your background is in philosophy, mine is in engineering."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448720","commentId":2448720,"userName":"DukeWellington","timestamp":1475954517,"content":"You are correct that scrying, card draw, and analysis paralysis from decision making are the typical sources of long turns. Outlands and Boromir deck do feature these elements enough to be annoying. Simply playing 2 AVGT back to back on turn 1 can be annoying (shuffling your deck also causes delays). When one player has 10 allies and another player has 2 and an attachment, the player with more has to figure out who to commit and who to hold back, etc. It may or may not be an issue depending on the players involved. The criticism of Outlands has not been so much that it takes no skill to pilot (though yhat may be true) but that it takes no skill to build because you just throw all the Outlands allies in automatically. It feels like the designers are building the deck for you. This is in contrast to, say, Silvan tribal decks which require far more thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2448987","commentId":2448987,"userName":"dr00","timestamp":1475978604,"content":"> @dr00 Trying to get from point A to point B using X,Y, and Z is what I would call a puzzle. Puzzle solving is a broad category, so it includes things that may not be called puzzles in casual language. For instance, if you are trying to build a \"one deck to rule them all\" that can beat all quests that can be a puzzle solving challenge. It can also be a competitive challenge. The distinction is more psycological, and there can be some overlap. It sounds, from what you were saying, that you are a puzzle solver =)\n\nit sounds like you're correcting me(?), but i was actually saying that that was a kind of puzzle and speaking more specifically that those are the kinds of puzzles i enjoy the most.\n\ni would say overall that i'm a puzzle solver / explorer. i didn't explain that last part very well tbh, but it doesn't show up in this game as much as it does others, but one thing i do in this game is 'what if?' for example, after defeating a scenario, i'll simply keep going for a few more turns to see how my board state advances. if i threat out, i'll keep going to see what would have happened as well (knowing that i've already lost)\n\ni would also probably add another tier to my own philosophy of gaming, which concerns the social aspect: when i was in my teens, my parents decided one night to play Yahtzee! with my brother and me. we spent the whole night. there was no tv. no computer. there may have been music, but i can't recall. i do remember that we spent all night doing so. and the thing that stood out to me was the shared social experience. perhaps it could be related to spectating, but really it could have been anything, and often the game took a backseat to the social engagement.\n\nthat is the one night that really sold me on board games. it's often (at least for me) 'something to do' while also spending time with others. it sets the pace for the conversation, and i'm often content if the game gets ignored so that an unrelated conversation may develop (except during rules explanations, but that's a rather specific pet peeve of mine wherein 1: i don't like to be ignored when i'm trying to be helpful and 2: i don't want to have to re-explain rules again just because someone wasn't listening at all before)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2450077","commentId":2450077,"userName":"alogos","timestamp":1476094459,"content":"Too long, didn't read.\n\n \n\nBut I have seen some keyword that I came across when studying game design. I would like to share the result of this research here for those who want to read more.\n\nHere's the references:\n\nTimmy, Johnny and Spike: http://magic.wizards.com/en/articles/archive/making-magic/timmy-johnny-and-spike-2013-12-03 [http://magic.wizards.com/en/articles/archive/making-magic/timmy-johnny-and-spike-2013-12-03]\n\nVorthos, Melvin: http://magic.wizards.com/en/articles/archive/making-magic/vorthos-and-mel-2015-08-31 [http://magic.wizards.com/en/articles/archive/making-magic/vorthos-and-mel-2015-08-31]\n\nBartles' Taxonomy : http://mud.co.uk/richard/hcds.htm [http://mud.co.uk/richard/hcds.htm]\n\nOctalysis : http://yukaichou.com/gamification-examples/octalysis-complete-gamification-framework/ [http://yukaichou.com/gamification-examples/octalysis-complete-gamification-framework/]\n\nThe last one is what I consider the most advanced and is now my reference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2450283","commentId":2450283,"userName":"dalestephenson","timestamp":1476108553,"content":"It takes some cheek to proudly proclaim that you didn't read the OP for being too long, then provide links to four external posts longer than the OP."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2451077","commentId":2451077,"userName":"DukeWellington","timestamp":1476139420,"content":"@alogos thanks for the links. I was familiar with all except the last, and so far I haven't been able to get that one to work =("},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2452035","commentId":2452035,"userName":"JJ48","timestamp":1476203029,"content":"I like to play for problem solving and for story.  Interestingly enough, playing thematic decks often involves a bit of problem solving because:\n\n1.  Trying to develop a thematic deck that plays well can be tricky enough with some themes, and some cards may require some creativity to explain (What's a Warden of Healing doing hunting for Gollum with a bunch of Dunedain?).\n\n2.  Some decks may require quite a bit of explanation as to how they fit with the quest (Why are Thorin Oakenshield and Boromir fighting Black Riders in the Shire?  For that matter, how is Thorin fighting anyone at all decades after his own death?)\n\n \n\nI really enjoyed one blog (Tales from the Cards, maybe?) doing a playthrough of the campaign, turn by turn, and also adding in some story flavor to try to make a coherent narrative (I believe they were up to Helm's Deep last I checked).  I've been thinking of trying something similar myself, as an exercise in storytelling (and maybe people can read my play-by-play and give me tips on how my decks could play better)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/231871-philosophy-of-gaming-thoughts-on-motivation/?do=findComment&comment=2452179","commentId":2452179,"userName":"shoreless","timestamp":1476208952,"content":"> Why do we play?\n> \n>  \n> \n> 3. Exploration/Expression: Here a player is focused on making unique individual contributions to community. This could be through role playing or novel deck design, but the point is to introduce to the world a previously unwittnessed combination of elements\n\n \n\nThis is a great discussion! I really like what you wrote here - it's something I haven't really thought of explicitly but explains a lot of why I enjoy this game and community. Thanks for your enlightening post."}]}