{"url":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/","title":"What to buy after the core set?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449849","commentId":2449849,"userName":"Chronos96","timestamp":1476065768,"content":"I'm sure this topic's been discussed at length but anyways I'm planning on buying the core set in a few weeks. I know a lot of people recommend the Khazad-Dum expansion first to build up the card pool or the Hobbit saga expansions and while I do plan on buying them eventually, what in your opinion is the latest expansion I could buy that would scale relatively well? For example, I'm strongly considering buying the Lost Realms expansion afterwards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449866","commentId":2449866,"userName":"Rajam","timestamp":1476068309,"content":"What are your priorities?\n\n \n\nIf you want good player cards, I'd recommend The Steward's Fear, The Watcher in the Water, Foundations of Stone, Shadow and Flame\n\n \n\nIf you're looking for a challenge, Heirs of Númenor, The Battle of Carn Dum\n\n \n\nIf you want fun quests, then idk 'cause I love them all"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449893","commentId":2449893,"userName":"Chronos96","timestamp":1476070236,"content":"Enjoyment level I guess. I want to be able to enjoy the game while still being challenged. I know some people say it's better to buy in order but honestly, dwarves don't really appeal to me so I was wondering what would still be fun but manageable and a challenge as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449902","commentId":2449902,"userName":"Zura","timestamp":1476071421,"content":"Lotr sagas should do, then. Enjoyable, challengic, fun, iconic. Start with black riders and decide if you like it - its widely considered as one of best exp for the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449919","commentId":2449919,"userName":"FrogTrigger","timestamp":1476073277,"content":"I've always wondered at what point did the LOTR saga expansions come out? Was it along the same time frame as the deluxe expansions? After a bunch were out already?\n\n \n\nI've got the core and the first cycle and I am in the same boat, go the story route or follow the deluxe expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449969","commentId":2449969,"userName":"John Constantine","timestamp":1476079804,"content":"Everything else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2449972","commentId":2449972,"userName":"Flrbb","timestamp":1476080203,"content":"As far as I remember, some \"usual\" APs (and maybe deluxe boxes, too) were allready on the marked when they decided to release the saga quests.\n\nI cannot recomend the hobbit saga boxes. Indeed, there is some kind of story mode, but it is not as far develloped as that of the lotr boxes. Player cards in that two boxes focus on dwarfs. A trait which is good, but I'd tend say not state of the art nowadays.*\n\nThe quests in Khazad-Dun are definitly fun and doable with only the core set, but again: player cards focus on dwarfs.\n\nI cannot say how much fun the mission on latest deluxe expansions with only the core set, but the level of powerness of player cards are way higher than in the first boxes, so from that point of view I'd recomend the last cycle (Grey Havens). Some say that the theme around the ships isn't thematic anymore but the quest design is fun and interesting.\n\n*: the dwarf archetype is a bit spread over different boxes. If you want to have fun with them you probably want to have Dain Ironfoot (Return to Mirkwood), Ori, Thorin Oakenshield (both Over and Under Hill), Narvis Belt (Khazad-Dun) and so on and so forth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2450242","commentId":2450242,"userName":"PocketWraith","timestamp":1476106929,"content":"Though it's a few months outdated at this point, I would recommend taking a look at the TftC New Player Byuing Guide: https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\n \n\n> I've always wondered at what point did the LOTR saga expansions come out? Was it along the same time frame as the deluxe expansions? After a bunch were out already?\n\nBlack Riders was about halfway through Against the Shadow, Road Darkens about halfway through Ring-maker, Treason of Saruman right after Lost Realm, Land of Shadow just into Angmar Awakened at GenCon but noticerably later for everyone else, Flame of the West about halfway through Dream-Chaser."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2450243","commentId":2450243,"userName":"Rob_Oz","timestamp":1476106977,"content":"The progression style is a common and solid approach for new players, but I like that the OP wants to go a different route and start playing the products that interest him. If the Lost Realm looks good to you, then grab that box and have fun! I've personally found that cycle (Lost Realm plus Angmar Awakened) and the current cycle (The Grey Havens plus the Dreamchaser) to be the best cycles so far.\n\n \n\nAs you likely already know, however, the quests are typically designed with the entire card pool in mind. That's usually means that newer quests are more challenging with a small card pool.\n\n \n\nI'd tend to agree with Zura's response and pick up the Black Riders saga box. It's still very well regarded and gives you quite a few player cards that work well together, assuming you'd enjoy playing Hobbits. The Road Darkens would also be a decent option. The Road Darkens would give you a strong hero in Gandalf, plus a number of cards that make him better (Staff, Pipe, etc). The great draw back there is that you couldn't use ally Gandalf from the Core set. Assuming you enjoy the game, you'll pick it all up eventually.\n\n \n\nEdit - The Tales from the Cards link, posted above really is the best answer to your question.\n\n \n\nRE LOTR Saga releases from a time standpoint: Black Riders, GenCon /October 2013, The Road Darkens: October 2014, Treason of Saruman: March(?) 2015, Land of Shadow: GenCon 2015/November 2015, Flame of the West: August 2016.\n\nEdited October 10, 2016 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2450951","commentId":2450951,"userName":"Chronos96","timestamp":1476134186,"content":"> The progression style is a common and solid approach for new players, but I like that the OP wants to go a different route and start playing the products that interest him.\n> \n>  \n> \n>  \n\nThanks, yeah I don't have anything against dwarves but I like variety so from what everyone is saying I think I'll buy the first two saga expansions and then the Lost Realms. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232015-what-to-buy-after-the-core-set/?do=findComment&comment=2452494","commentId":2452494,"userName":"FeloniusBard","timestamp":1476222079,"content":"If you prefer to play Noldor decks like I do, in order, I'd go as follows: \n\n \n\n * Khazad-Dum --- I say this mostly because the three quests you get with Khazad-Dum are playable with the limited card pool you start with early on. The fact that you get some decent dwarf cards as well doesn't hurt. \n * Conflict at the Carrock --- for Spirit Frodo, Song of Wisdom, and Burning Brand, plus a few Rohan and Eagles. The quest is actually fun as well. \n * Foundations of Stone --- Say what you want about him, but it's never a bad idea to have Spirit Glorfindel in your back pocket if you need him. Plus, Asfaloth is the quintessential \"location lock\" antidote. Oh, and once again, the quest is fun. \n * Watcher in the Water --- Just some really good options for deckbuilding --- Lore Aragorn, Arwen ally, Rivendell bow for Legolas, Resourceful, Sword that was Broken . . . plus the quest is pretty fun.\n * Lost Realm deluxe pack --- this whole set is very good\n * Grey Havens --- also very good. \n\nFrom then on, it's purely on a \"What I want to play\" basis. At some point pick up Shadow and Flame to get Elrond + Vilya. Numenor + Against the Shadow has some great player cards, but you really have to want to jump into the quest difficulty. The Ringmaker cards for me were just so hit and miss. The Isengard deluxe box has really \"meh\" player cards, to the point that it almost felt like I was throwing away that $30 just so I could grab the Ringmaker cycle cards later.\n\n \n\nAfter you've got maybe 3-5 solid expansions and your card pool is just a little bit broader, start hitting the Saga expansions hardcore. The Black Riders is an absolute must-buy, and the Road Darkens and Treason of Saruman aren't far behind. I'm not as big a fan of the Hobbit saga boxes, because I just don't care about dwarfs, but the Battle of Five Armies quest almost makes On the Doorstep worth the price of admission alone, and the Over Hill Under Hill box is pretty much a must-have if you have any interest at all in ever running a dwarf deck (dwarf decks also obviously assume you've picked up the Return to Mirkwood pack for Dain). \n\nEdited October 11, 2016 by FeloniusBard"}]}