{"url":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/","title":"Nightmare Decks Experiences and Rankings","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452299","commentId":2452299,"userName":"Jekzer","timestamp":1476213455,"content":"Hi all!\n\n \n\nI decided to create a topic in regards of Nightmare experiences from you, fellow questers.\n\n \n\nThe comunity is really kind to share experiences, but I haven't seen a lot of Nightmare topics in that regard, and as a personal burden, being Spanish means that even receiving new AP's before or close to US release dates, we have a grim problem with NM adventures (the last one published in Spain being Khazad-Dûm), so forgive me if I'm repeating topics. The thing is that since every now and then FFG are releasing new NM decks, this could be a good place to update.\n\n \n\nAnd which kind of experiences? Well, whatever you may please! Talking about the most fun NM adventures for you, the most unforgiving, ranking them in whichever aspect you may see fit. And so on.\n\n \n\nFor me, having a scarce knowledge in NM (I only play pubished Spanish ones), the best ones in terms of overall improvement and good all-around strats (questing needed, hard combat, cancelation needed, etc) may be 7th Level and Into the Pit. I want to give a special mention to Hunt for Gollum in terms of improving a mechanic and increasing the fun factor exponentially (those clue tracker orcs make a nice clue hunting race!).\n\n \n\nWhat do you guys think? You can talk about whatever quests you want, NM-wise!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452397","commentId":2452397,"userName":"FeloniusBard","timestamp":1476217001,"content":"I've only played a handful of the Nightmare scenarios, but I've enjoyed most of them. \n\n \n\nFor reference, I play almost exclusively multiplayer (2-4 players) with my brother-in-law and a group of friends who are all very experienced at the game, so I can't comment on anything as it relates to solo play. \n\n \n\n * Nightmare Passage Through Mirkwood --- The original is so easy that even in Nightmare mode this quest didn't really make a dent. My brother-in-law and I made it through without really breaking a sweat. I'd say it barely brings the difficulty up from its original 2 to a 4 at most. Pretty much any halfway decent player with an optimized deck should blow through this thing. \n * Nightmare Journey Down the Anduin --- I LOVED this quest. Love, love, loved it. THIS is exactly the kind of thing you sign up for. It's hard, it demands solid deck building to cover nearly all your bases, but it never feels off-the-wall bonkers or just stupidly unfair (Siege of Cair Andros and Into Ithilien, I'm looking at you). It took my group a good 6 tries to finally win this scenario. \n * Nightmare Hunt for Gollum --- This one is okay. Its biggest problem is that it still suffers from the early quests' weakness where a simple \"turtling\" strategy makes it easy to beat. We easily defeated this on our first try. \n * Nightmare Conflict at the Carrock --- It took us a good 4 tries to beat this one, but even the one we ended up winning I think we may not have totally followed the scenario correctly. I'm almost certain we were forgetting to add up some of the troll bonuses at the end. I have to say as well, that although the challenge is quite hard and requires really strong combat decks, I don't know that this one is particularly \"fun.\" The early stages aren't really that much harder, and the fight with the trolls was more tedious than exciting.\n * Nightmare Dead Marshes --- This one is good. Not astoundingly praise-worthy, but good. It did build some tension along the way with some interesting decision points, but it certainly wasn't as hard as Journey Down the Anduin. We did manage to beat this one on our first try (albeit by the skin of our teeth).\n\nThat's pretty much as far as I've gotten in Nightmare mode. I'm actually looking forward to trying some of the Khazard-Dum Nightmares at some point, and I think the Angmar Awakened Nightmares will be really fun.\n\n \n\nI have zero interest in the Numenor nightmare decks. Good grief, who actually wants to make that crap harder?\n\nEdited October 11, 2016 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452472","commentId":2452472,"userName":"TwiceBorn","timestamp":1476220994,"content":"Great topic, Jekzer. I have never played Nightmare mode, but I've always wondered whether or not it's something I might enjoy... someday (I'm dedicated to acquiring and playing through all the expansions in standard mode first, and I'm behind in my purchasing and even further behind in my playing!).\n\n \n\nThus far, I have played everything up to The Three Trials (excluding LotR saga) standard mode straight solo and two-handed, strictly progression style. I occasionally play 2-player with my wife, but I'm sure that NM would not be for her.  \n\n \n\nSo what NM quests people like, how they play them (solo? 2-handed? multiplayer?) and ***why*** they like them or not, will be very helpful to me. Does NM enhance the story aspect of a quest as well as the difficulty?\n\n \n\nFeloniusBard's reply above is exactly the kind of info I'm interested in. And at this point, I must agree that the prospect of facing an even more difficult version of Into Ithilien, The Morgul Vale, or Escape from Dol Guldur (especially straight solo) does not seem appealing at all... but perhaps those quests would be easier for me in standard mode if I no longer limited myself to progression style play (now that I have beaten all of them solo/2-handed progression style), thereby making NM something worthy of consideration even for the hardest quests?\n\n \n\nJust rambling at this point... but looking forward to seeing what others have to say. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452515","commentId":2452515,"userName":"FeloniusBard","timestamp":1476223062,"content":"To answer one of your questions, TwiceBornh, Nightmare mode doesn't really add to the story aspects at all; it's really all about purely upping the difficulty. It's about testing your deckbuilding strategies. If you're the type of person that really loves the intricacies of deckbuilding, looking for those ever elusive card synergies, Nightmare mode will rock. \n\n \n\nIf you're really just about having fun, and playing through the quests to enjoy the thematic elements, the artwork, and the basic gameplay, then Nightmare mode may hold less appeal.\n\nEdited October 11, 2016 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452533","commentId":2452533,"userName":"Calvadur","timestamp":1476224236,"content":"I like Nightmare mode, but have played very few NM quests.\n\n \n\nFirst one I ever got was NM Conflict at the Carrock. I decided to to go with a complete fun deck (dunhere + merry (t) aiming to get steward on dunhere and gondorian fire keep threat low and then sweep the staging area in one turn with hour of wrath as soon as the trolls appear). Got my dream hand first try and managed to pull everything of :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]. Never played it again^^, but will do; I need an ordinary win (as you may see from the cards I just recently got into NM)\n\n \n\nNext I picked up was Hunt for Gollum. Quest did not improve much as it is still location heavy. But it is nice that they removed false lead so randomly loosing a hint doesn't happen that often. The alternative loss condition (the hunter's collecting all clues) is more of a joke in my book as I never were close to that happening. You will still loose if to many hunters/clues pop up to early. Good for revisiting the quest after years with a little upped level of difficulty.\n\n \n\nQuite pleased with the experience I invested a little more and got the black riders and road darkens NM packs. Started of a campaign with a friend (we played all normal quests together). After an hour of deckbuilding we started into a shadow of the past. We took 2 quick defeas as we were either Location locked or had black riders ready to destroy our defenseless heroes. Even though the NM Cards mostly are not that bad the Overall upped threat hit's you twice and hide Tests become really nerve wrecking (we had one hide test that knocked us out with 14 threat :S) and in the end we didn't bother sending anyone if we couldn't at least send 4 (3 if despirate). Third try went better and we managed to stay at Phase 1 for 3 turns when we went to stage 2 the staging area was EMPTY. It probably still was the Point we were closest to loose as we turned up 2 Locations and had to reveal the Nazgul, who forced hide 2, what left us unable to travel as both Locations required a hide 1 test to travel and there was nothing left. Turns later we arrived at stage 3 and the so far unseen Kamul showed up, but we new he would come (it is mentioned on the NM Card) and killed him in an instant. Only the Ferry and we would be done. To bad you can't travel there while other Locations are in Play, what left us 5 rounds questing, hiding and fighting to get the Locations out of Play (quest Card effect helped a LOT). In the end we both were Close to threatening out.\n\nFor sure the hardest nightmare I played up to this Point as it is insane how much will- and firepower you Need.\n\n \n\nHappy with our victory we picked Mr. Underhill and the ring draws them and moved on to a knife in the dark. NM adds the really mean Cards to the deck: 2 extra Nazgul enemies, a threat raisng treachery, which can be ahrd to cancel and Bill Ferny becomes Immunre to playercard effects in the staging area. We only saw the possibility to raise my threat high enough so he engages me and then try to hold my threat with Galadriel. With this problem solved we started thinking about the prancing Pony and realised that it is NOT immune to Player Card effects so we traveled there got Legolas for free and swapped it out with westroad traveller and got Landroval for free, too, what left us in a very good Position to fight the enemies coming out of the prancing Pony. We went lucky as to copies of unwanted Attention hit the Player contolling Frodo, otherwise we could not have removed 2 heroes from the quest. Sadly a new nightmare Location stayed in Play too Long and shuffled a ring-wraith into the deck, but we saw that coming and swapped the Location out with another westroad traveller as the Location does nothing else and has low threat. We blew through stage 2 in 2 turns to our own surprise and that was when the really mean part hit us: As there are 2 more Nazguls by Default we weren't up against 4, but against 6 + spys from the last quest Phase. Of Course our threat was high from our Bill Ferny Action and the new treacherie so everything, but the witchking engaged. We blew every combar trick we had inc. Mr. underhill and it was barely enough as we had exactly enough defenders. Thanks to the Pony we had much attack power and took out half of the enemies. Next turn I played Gandalf who took out a remaining spy and was our defensive solution for the witchking. 2 turns later it was won :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] After discussing what boons to take ((keeping in mind some upcoming \"potential\" hero losses) we finshed and sadly didn't have time to Play again.\n\n \n\n \n\nI have to say especially the 2 campaign quests were extremly fun (but they are \"better\" quests i my opinion in normal already) and extreme tense and I felt mch more frightend by the Nazgul, NM can really add something in that regard (NM Cards hve some of the most gorgeous art the game has to offer, too). For me it also showed how quests can Change as I always found knife harder than shadow, but now Feeling it's the other way around, even though that could Change again. I also recommand 2 Players so far as FeloniusBard is right: You Need Combos and synergies. Readying effects are king and if you Play multiplayer sentinel and ranged become even better I found.\n\n \n\nIf someone is interested: I played Treebeard, Galadriel, Denethor (L) and my friend Glorfindel (S), Beregond and Brand Son of Bain. Brand turned out to be insanly useful (never tought I would say that) as his effect in combination with treebeard often means 8 extra damage. Sadly we came to the conclusion that he will not leave Moria and will be replacyed by his grandfather most likely.\n\n \n\nLast words: I would suggest everyone to try NM (after getting a decent sized Collection) and to start of with somethig not that hard (Mirkwood, Hunt for G...). If you liked quests like Carn Dum, Cair Andros, Laketown chances are good NM is what you seek :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nP.S.: If you haven't tails from the Cards has a very good N buying guide (but it is a Little outdated):\nhttps://talesfromthecards.wordpress.com/2014/02/21/nightmare-buying-guide/ [https://talesfromthecards.wordpress.com/2014/02/21/nightmare-buying-guide/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452570","commentId":2452570,"userName":"Glaurung","timestamp":1476226368,"content":"Good thread. I play mostly Nmode. If not Nmode I was scope to play this game a couple of years ago"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2452818","commentId":2452818,"userName":"tomtom","timestamp":1476244569,"content":"> I've only played a handful of the Nightmare scenarios, but I've enjoyed most of them. \n> \n>  \n> \n> For reference, I play almost exclusively multiplayer (2-4 players) with my brother-in-law and a group of friends who are all very experienced at the game, so I can't comment on anything as it relates to solo play. \n> \n>  \n> \n>  * Nightmare Passage Through Mirkwood --- The original is so easy that even in Nightmare mode this quest didn't really make a dent.\n\n \n\nYou certainly did not reveal Spider's Web in Setup, followed by turn one Ungoliant's Brood :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Replaying this quest like ten times might revise your grade.\n\n \n\nMy current NM experience has just reached Into Ithilien. Except Escape From Dol Guldur, I don't find any of those I played ridiculously difficult. Most times they're harder, but not to the level where one could say \"no way I'm gonna beat this\". Revised mechanics benefits some of the scenarios greatly; yesterday I spent half a day chasing local troublemakers through Pelargir in search for Alcaron's scroll and it was cool.\n\nI'd also like to mention that there are some great writeups of early NM's by Psychorocka somewhere in this forum, but I could not find them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453018","commentId":2453018,"userName":"jjenks476","timestamp":1476272262,"content":"If a scenario has the NM version available for it, I play that version exclusively. Once you start playing NM and do it consistently you realize how much more appealing the game is. First off the art is always superior to the original cards. Secondly the theme of quests are enhanced because often the cards that are removed in setup are the generic cards that came in the deluxe box. For example if you play the Morgul Vale NM, most all the cards from the HON box are eliminated and it is a much more thematic experience of the current adventure in the Morgul Vale. It also means the quest itself has better combos because they have eliminated all the cards that don't synergize well with the particular focus of the chapter pack. This leads to an increase in difficulty and makes each quest unique.\n\nThe difficulty in NM is ramped up, but for me if I beat a quest easily it is not worth it. NM means every card in your deck has to be effective, of course you can use cool combos and fun cards still, but just make sure they work with your deck. I play exclusively 2 handed.\n\nBest NM quests as of now, Wastes of Eriador, The Three Trials, The Druaden Forest, Into Ithilien, and The Knife in the Dark."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453035","commentId":2453035,"userName":"PsychoRocka","timestamp":1476273108,"content":"Yeah I vaguely remember doing a short series on my experiences with a bunch of Nightmare quests with spoilers as well I think?\nI'll try to dig them up. I've actually been meaning to post on this thread all day about what I think of the various nightmare quests I have played thus far. I actually stopped playing Nightmare quite a while ago (when we got a huge flood of content after a long drought, a flood that sort of still continues!) so even though I own up to Nightmare Antlered Crown I'm pretty sure I only ever got up to maybe Druadan Forest I want to say? I plan to give Nightmare another go in the near future and am eager to get my hands on The Lost Realm and Angmar Awakened Nightmare packs (except Dread Realm and Carn Dum.... no thanks.....).\n\n \n\nEdit: Found this! - https://community.fantasyflightgames.com/topic/123328-experience-with-new-nightmare-dwarrowdelf-quests/ [https://community.fantasyflightgames.com/topic/123328-experience-with-new-nightmare-dwarrowdelf-quests/]\n\nEdited October 12, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453139","commentId":2453139,"userName":"tomtom","timestamp":1476279134,"content":"Thanks! This forum's search engine can easily be compared to NM'ed Journey In The Dark Balrog when it comes to use/fight it...\n\nI was specifically looking for that topic to unearth it for two reasons:\n\n1. It was great read, I prefer it that way instead of turn by turn reports, so I wanted to demand more;\n\n2. We're approaching second anniversary of your promise that you would return there \"in next few days\"  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453323","commentId":2453323,"userName":"PsychoRocka","timestamp":1476284482,"content":"Hahahahahahaha :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\nHmmmm.. how about instead in the near future I'll try to do some reports on some newer nightmare quests like some of the Voice of Isengard cycle or something.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453655","commentId":2453655,"userName":"tomtom","timestamp":1476291814,"content":"Would be great.\n\nHow was your Shadow Of Flame? I tried it with your Last Host Of Firstborn decks, but to no avail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453692","commentId":2453692,"userName":"Lecitadin","timestamp":1476292846,"content":"In pure solo, the most difficult NM quests are, for me :\n\n \n\n-Return to Mirwood\n\n-Steward's Fear\n\n-Escape from Dol Duldur\n\n \n\nThe ones I like the most :\n\n-the 3 Khaza Dum box quests\n\n-the 3 Heirs of Numenor quests (because I get to use mono tactics)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2453934","commentId":2453934,"userName":"Jekzer","timestamp":1476299646,"content":"FeloniusBard, oh god I forgot about NM Journey Down the Anduin! You're right about it, is one of the greatest quest in terms of complete equilibrium between combat, questing and treachery cancelation. Actually I'm going to revisit it again (today if I have time). The thing with Hunt for Gollum is true with turtle strategy, but some of the 2-players sessions that I gave to that quest were a pleasant surprise, with the orc hunters closing the gap with us in the clue hunting!\n\n \n\nI am with all of you that most of NM quests need a bit of deck R&D to achieve victory. As a side note I usually play solo 1-handed. Sometimes 2-player games.\n\n \n\nTwiceBornh, I think that a lot of the NM adventures improve the theme and the mechanics. Is not only straight ramp-up difficulty. A perfect example is NM Escape from Dol Guldur. Most of the players really hate that quest for being so unforgiving. NM is worse, way worse, and that's something that may force players to not play it. But in terms of mechanics and theme, is much, much more cohesive and interesting. You feel like being in a true dungeon, where your other heroes can be captured, executed, tortured and interrogated. And all that is achieved with new enemies and treacheries (props to Crazed Captive for being a nerve-wrecking guy). There's also a mechanic where you put resource tokens on several locations and one of them if it has X number or more, the players lose the game, so you need to shuffle it (thanks to Mariner's Compass) or make haste to explore those dungeons. For me this quest is perfect, although is so hard that repels me sometimes to test it.\n\n \n\nCalvadur, nice writeup, Black Riders is one of my favourite boxes, so it seems that NM seems a neat addition!\n\n \n\nPsychoRocka, that's it, I knew there was a playthrough topic about some NM adventures! I'd LOVE to read it again for new ones, like Voice of Isengard or other NM quests after Dwarrowdelf. Actually, aside from several videos from Glaurung and Seastan where they play some NM Heirs of Númenor/Agains the Shadow quests, all that came after that is uncharted territory for me (aside from reading the news post about NM decks from FFG)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454303","commentId":2454303,"userName":"13nrv","timestamp":1476311609,"content":"Best NM quest (IMO) :\n\n \n\nWaste of Eriador : New cards increase difficulty AND increase the atmosphere of the quest. I really feel to be hunting by wargs which attack by pack at night. The company is exhausted by weather. Very good quest and a good challenge.\n\n \n\nA journey down the Anduin : The perfect balanced quest ! You need everything to beat the quest. Some location combination could be nasty, troll come and go. Each game is different and the challenge is good.\n\n \n\nInto the pit : New cards modify the scenario with more interactions with the torch. I feel like playing a new quest and have a lot of fun. The difficulty increase with the number of player due to nasty interaction between location. The difficulty wasn't very high so you can play it more easily with casual player.\n\n \n\nThe seventh level : A new mechanic with goblin which gain boost from resources on it and the last step was modified with a new Boss. Like the previous, i feel like playing a new quest and as previous the difficulty is increase but we can play it with casual player.\n\n \n\nFundation of Stone : Very difficult on solo. the reset at step 3 has been revisited and was very hard (much more than Dunland trap). A very good challenge with new scary enemies !\n\n \n\nPeril in Pelargir : The new cards are more focused on the scroll and new loss condition are set on the scroll (you can't let it attached to an ennemy for many turns).\n\n \n\nInto Ithilien : Very good modification. The quest is harder but fair. No more insane and unfair treachery like Watcher in the wood. A good challenge, more Mumak and deadly archery effect :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nSiege of Cair andros : No more Power of mordor ... One bug corrected, good point. New battlegrounds locations which have nasty effect when destroyed. So the battleground mechanic is present during the entire scenario.\n\n \n\nStewart fear : I like so much the normal quest and NM is better and harder. The underground deck is always plenty and new added enemies are so nasty to handle. New fun plots !\n\n \n\nEncounter at Amon Din : The normal was one the easiest and the NM one of the harder. The quest is now far more focus on villager. We need to save a lot of them to win and they die very quickly.\n\n \n\nFord of Isen : The new enemies are nasty and required to precisely handle the hand size ! Very cool and fun.\n\n \n\nGood NM Quest :\n\n \n\nFlight from Moria : Some bug corrected and new quest available with more interaction with Balrog.\n\n \n\nEscape from Dol Guldur : Very hard ... Too hard on solo. Need a great hand and an easy setup to have a chance. But in Duo, it's good challenge.\n\n \n\nHunt for Gollum : Some interesting change but i feel like just an increase of difficulty\n\n \n\nConflict at the carrock : Great modifications that prevent player to wait as long as they want at first step. The new trolls modify the quest. In Normal quest, the more troll you kill, weaker they become. In NM mode, the more troll you kill, stronger they become.\n\n \n\nThe dead marshes : Just harder.\n\n \n\nReturn to Mirkwood : The modification are good but majority of new effect have an effect if you play multi. On solo, many enemies or location or treachery effect could be considered as blank. The quest is much more hard.\n\n \n\nRedorn Gate : Just harder.\n\n \n\nRoad to rivendell : interesting modification which a new quest (new step two with Arwen captured by orcs) ... But GO cards are still in the encounter (like sleeping sentry) and so can ruin the game.\n\n \n\nWatcher in the water : The new watcher is so cool and have more interaction with tentacles (when you kill a tentacle you damage watcher) ... But now the NM quest demand to kill the watcher and explore the doors of durin ... So you need luck or scry ...\n\n \n\nThe shadow and the flame : Cool quest with a special shadow deck for Balrog ... These shadow effect are nasty ... But if you play Galadriel or/and Hama, you just break the quest like normal.\n\n \n\nThe Druadan forest : The modification totally change the quest. It's fun the first time after it's like a puzzle and if you don't play resources generation, it could be impossible to win. Sword thain is a good card for the last step (3 more resources). But the challenge is good and need reflection !\n\n \n\nAssault on Osgiliath : The scenario stay the same, just harder with a lot of archery and a lot of effect which bring back location in staging. It could very long and i have seen many time Archery 14+ ... A new location correct the bug with Boromir ta and require player to explore at least five location.\n\n \n\nBlood of Gondor : Harder with nasty enemy which never die :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nThe morgul vale : Harder and token come quickly on objective To the tower. You can lost quickly due to this objective. Many effect are linked to the objective and new bodyguard are very powerfull ! Big Challenge.\n\n \n\nDunland trap : Deception on modification, the reset wasn't change and just improve the difficulty. Strategy which work on normal mode continue to work with NM.\n\n \n\nThe three trials : Modifications are interesting but now i always do the quest in the same order due to modifications ... I like new spirit enemies dedicated to each guardians !\n\n \n\nNin In Eilph : One of the harder ... But unfair IMO. So a big challenge but few deck will have a chance against this scenario.\n\n \n\nSecret of Celebrimbor : Well just harder ... A big challenge if you play multi.\n\n \n\nThe Antered crown : No important modifications ... Same quest just harder.\n\n \n\nChetwood Intruders : No more sudden assault ! New cards bring back enemies in staging and increase quickly the threat (very quickly). New side quest are so cool and modify the quest.\n\n \n\nThe weather hills : Harder ! But the new villager objective, you need to protect, is so fun and change the quest.\n\n \n\nThe deadman dike : Same mechanic ... Just harder.\n\n \n\nOver the misty mountains Grim : New great Goblin with a new nasty forced effect. In normal mode, when the great goblin is killed the scenario become easier now new enemies are enraged when great goblin was killed. The first part of the scenario with giant demand to discard a lot of card.\n\n \n\nFly and Spider : Just harder.\n\n \n\nBattle of the five armies : One of the hardest ... But the scenario could be very unfair. A new Treachery on setup could be just GO !\n\n \n\nA shadow of past : Just harder.\n\n \n\nA knife in the dark : more Nazgul ! An interesting challenge, bill is more harder to kill so threat increase quickly and so all Nazgul could engage simultaneously at last step.\n\n \n\nFlight to the ford : Just harder.\n\n \n\nThe worst NM Quest :\n\n \n\nThe lonely mountain : the normal quest is just bad with Smaug which could become a mini gun ... NM didn't change anything, the burgle is harder and you need to find all treasure. The density of cards with burgle is increased ... So Smaug become a nuclear mini gun ... So for me it's just a puzzle. I have find a strategy to win it : Success at all Burgle test (Thanks to Gandalf), find a way to discard shadow on Smaug so no minigun and a great questing power to win. Three win and now the quest stay in the box.\n\n \n\nDungeon Deep and cavern dim : Well same as previous but with hardest riddle ...So a puzzle, i find solution three win and now the quest stay in the box.\n\n \n\nWe Must Away, Ere Break of Day : Keep your threat low and put strong quester = win ... So boring.\n\n \n\nTo catch an orc : Harder ... But i didn't like the normal one, the NM didn't change that with no major interesting change.\n\n \n\nInto Fangorn : Quest ! Quest ! Quest ! Quest ! And win as normal ... So boring.\n\n \n\nTrouble in Tharbad : Well the normal one is very easy and boring. The NM one is a little bit harder and still boring.\n\n \n\nA journey to Rhosgobel : The normal one is unfair and based on luck to find Athelas or you use a strategy to win : Explore Rhosgobel in staging at first step (Asfaloth, Tracker etc ...), you wait at first step healing Wyliador then when ready, you rush and win ... NM quest didn't correct the bug (explore Rhosgobel in staging at first step) and increase the massive damage, the quest become a lot more unfair ... Another puzzle ... Well i break the scenario with honour guard which cancel damage and not heal and use the uncorrected flaw of the quest. Three win and now the quest stay in the box.\n\n \n\nA passage through mirkwood : Unbalanced quest ... Could be easier as the normal one or deadly setup ...\n\n \n\nThe hills of Emyn muils : Well a bug corrected, it's far more difficult to explore location in staging but so many direct damage effect ... too many ... The scenario is still boring IMO and could be unfair with deadly combo of direct damages.\n\n \n\nThe Long dark : The normal version could be easy or very hard depend on encounter. The locate test is so hazardous ... NM version just amplify lost nasty effect. But as normal, the quest could be easy or deadly just depending on luck ...\n\n \n\nTo Be tested :\n\n \n\nEscape from Mount Gramm, Across the Ettenmoors, The road darkens.\n\nEdited October 12, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454483","commentId":2454483,"userName":"PsychoRocka","timestamp":1476320512,"content":"> Would be great.\n> \n> How was your Shadow Of Flame? I tried it with your Last Host Of Firstborn decks, but to no avail.\n\nYeah honestly to me Nightmare Shadow and Flame is easily the hardest nightmare quest I have ever played. \n\nIt is just SO PUNISHING. I never actually beat it but came fairly close a couple of times....\n\nThe Balrog and his shadow cards are just too good.... he has insane base attack and so many nasty effects that you HAVE to build up an uber defender to stand any chance but then one of his main shadow effects discards ALL attachments from defending characters... not even just one attachment... all of them... like what the hell even is that effect? Really every single attachment I have spent several turns setting up on my defender? You can't chump block either because of other nasty shadow effects (especially the one that does 1 damage to defending character right away as this stops 1 hitpoint allies being an option for chump blocking) as well as the fact you still need high willpower for this quest so if you are playing allies every turn just to chump with who are you questing with?\n\nHonestly the only ways I have ever read about people beating this one is either by keeping their threat at 0 for the entire game and avoiding the Balrog altogether (from Dori or Galadriel) or by using Eagles of the Misty Mountains as their defenders after they get seriously buffed by several other eagles leaving play and making them into monsters. The only thing is I'm not really sure that is even actually a valid strategy now that I think about it and reflect as those discarded Eagles are technically attachments on the Eagles of the Misty Mountains. They are just facedown blank attachments but they are still sort of attachments so if you do in fact have to discard these then literally the only way I am aware of this quest being legitimately beaten is by just avoiding the Balrog and keeping threat at 0. I'm sure there definitely are other ways to win but they are the only ways I have EVER heard anyone talk about. If there is some valid strategy that isn't just keeping threat at 0 I would love to hear about it!!!!\n\nOut of curiosity what decks did you use? The newer ones with Gimli and Legolas or the older ones with the Twins? It would be interesting to see if my new decks do any better.... I assume not as they are not hugely different or that much better.\n\nEdited October 13, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454732","commentId":2454732,"userName":"tomtom","timestamp":1476340096,"content":"I used older versions. They're quite different from my setup and I like to use them now and then, especially against quests that create problems for me. This quest was the other way around - my guys finally managed to push Balrog down the Khazad-dum sewers. Some luck was necessary, of course - Blazing Grip came precisely on Balrog's last attack. If it appeared earlier, there would be no success.\n\nEdited October 13, 2016 by tomtom"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454925","commentId":2454925,"userName":"13nrv","timestamp":1476359447,"content":"> Honestly the only ways I have ever read about people beating this one is either by keeping their threat at 0 for the entire game and avoiding the Balrog altogether (from Dori or Galadriel) or by using Eagles of the Misty Mountains as their defenders after they get seriously buffed by several other eagles leaving play and making them into monsters. The only thing is I'm not really sure that is even actually a valid strategy now that I think about it and reflect as those discarded Eagles are technically attachments on the Eagles of the Misty Mountains. They are just facedown blank attachments but they are still sort of attachments so if you do in fact have to discard these then literally the only way I am aware of this quest being legitimately beaten is by just avoiding the Balrog and keeping threat at 0. I'm sure there definitely are other ways to win but they are the only ways I have EVER heard anyone talk about. If there is some valid strategy that isn't just keeping threat at 0 I would love to hear about it!!!!\n> \n>  \n\n \n\nI can give you some winning strategy i have used :\n\n \n\n- The easiest one : Keep your threat at 0 => Galadriel or Nori in a dwarf deck.\n\n- Lock the Balrog : Balrog isn't immune to player card effect => Hama/Feint and lock the Balrog.\n\n- Discarding shadow cards : Each turn discard the shadow card from Balrog => Keep one ennemy engage with you and defend it with Hero + Armored Destrier. You can discard the shadow from Balrog and after safely defend it (Chump or Heavily attached hero).\n\n- Know your ennemy : Always see the shadow card from Balrog and so decide the good defenser or the right moment to use a feint-like card => Silver lamp or dark knowledge\n\n- Allies with high HP : Swarm a lot of allies with more than one hitpoint and defend with these allies => Dwarf swarm deck (so thematic :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png])\n\n- Bears are tough : Strong defender ally with Heal => Beorn ally + Arwen ally + Elrond\n\n- Gondor will protect you : Chump blocker are a good solution but one shadow kill easily this ally => Honour Guard + Chump blocker\n\n \n\nOr a mix of these solutions.\n\nEdited October 13, 2016 by 13nrv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454968","commentId":2454968,"userName":"PsychoRocka","timestamp":1476361171,"content":"Thanks so much for the great tips/strategies! Its been that long since I played that for some reason I thought the Balrog and Shadow cards dealt to it were immune to player card effects but that is Journey Into the Dark isn't it? Only Blazing Grip cannot be cancelled and you are right that the Balrog and shadow cards aren't immune to player card effects. I may have exaggerated a bit to its difficulty I guess :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  it certainly devastated my decks back in the day!\nArmored Destrier is certainly very useful for this quest and I use it in my decks now so perhaps I should really revisit this one!\n\nEven Burning Brand is great to cancel all the other shadow effects except Blazing Grip and just hoping to hell that you feint or feigned voices the Balrog during the turns it is dealt blazing grip. Or as you said turn shadow cards faceup with various effects so that you know when to defend with your uber defender and when to defend with a strong defensive ally or chump. I feel silly not thinking of at least a few of these various strategies back in the day!\n\nEdited October 13, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2454977","commentId":2454977,"userName":"PsychoRocka","timestamp":1476361508,"content":"> I used older versions. They're quite different from my setup and I like to use them now and then, especially against quests that create problems for me. This quest was the other way around - my guys finally managed to push Balrog down the Khazad-dum sewers. Some luck was necessary, of course - Blazing Grip came precisely on Balrog's last attack. If it appeared earlier, there would be no success.\n\nWhat are your usual decks? Would love to see them!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2455169","commentId":2455169,"userName":"tomtom","timestamp":1476367916,"content":"Here you are:\n\nhttp://www.ringsdb.com/fellowship/view/1119 [http://www.ringsdb.com/fellowship/view/1119]\n\nNow I feel obliged to enhance description a little...\n\nGaladriel keeps the threat of her deck at 0, tactics deck tries to put Burning Brand on Beregond asap. Threat reduction effects allow me to get a round or two free of Balrog attacks. With some starting hand luck I am even able to boost my card draw with Deep Knowledge+Double Back combo, which gives more threat reduction, which gets me another round of buffing up and here it goes. Played NM SaF 5 times, won two, two were lost after a long fought battle, one after round 1. More games coming, since I think that the effectivness of deck against certain scenarios can be reliably measured after minimum 20 tries.\n\nEdited October 13, 2016 by tomtom"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2456325","commentId":2456325,"userName":"PsychoRocka","timestamp":1476417441,"content":"Nice decks! They look quite strong and cover pretty much all the bases. The Mono spirit one with Gandalf ally with all his toys looks really fun to play as well! So does the other really with Haldir sniping and whatnot. Will have to give these a go one day as I really like their design!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2456445","commentId":2456445,"userName":"tomtom","timestamp":1476430795,"content":"Looks like we've hijacked the thread a little.\n\nI got little confused by ringsdb publishing/fellowship creating method and as a result you are commenting on previous iteration of monospirit, which in fact used Gandalf. Fun factor was undeniable, but the financial burden was a real problem. I corrected the link and now it leads to current version. I even managed to write enhanced description :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2462661","commentId":2462661,"userName":"13nrv","timestamp":1476785465,"content":"Fuit from Mount Gram : really interesting changes. Additions gives us more option to save our allies in exchange of threat. Besides the threat goes up to an impressive speed. The scenario is tougher but also more fair. What I mean is that it is easier to save the captured cards but the cards effects are generally more violent. More type of deck can get there but the path will be difficult ... Especially now we must find all the heroes to win.\n\n \n\nAcross the Etten moore : I don't know what to say ... I totally crush the scenario, it seems easier ... I think the new first step (which replaces the normal) is bugged ... I explore the 7 side quests in the first step in 8 rounds which imply problems for the rest of the scenario ... i need to redo it but big disappointment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2464072","commentId":2464072,"userName":"tricil","timestamp":1476825999,"content":"Thank you for the update and for posting the spoilers in the other thread! I ordered the Mount Gram and Ettenmoors nightmare packs just yesterday because it looks like they greatly improve the atmosphere of both quests (and I already liked both quests to begin with). Not sure what to think about the difficulty level. I would hope that they are a lot harder now, so what you say about Ettenmoors sounds really disappointing. :mellow: [//content.invisioncic.com/Mfantflight/emoticons/default_mellow.png] If you redo it within the next couple of days, I will definitely be interested in any updates!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2464201","commentId":2464201,"userName":"PsychoRocka","timestamp":1476831810,"content":"> Fuit from Mount Gram : really interesting changes. Additions gives us more option to save our allies in exchange of threat. Besides the threat goes up to an impressive speed. The scenario is tougher but also more fair. What I mean is that it is easier to save the captured cards but the cards effects are generally more violent. More type of deck can get there but the path will be difficult ... Especially now we must find all the heroes to win.\n> \n>  \n> \n> Across the Etten moore : I don't know what to say ... I totally crush the scenario, it seems easier ... I think the new first step (which replaces the normal) is bugged ... I explore the 7 side quests in the first step in 8 rounds which imply problems for the rest of the scenario ... i need to redo it but big disappointment.\n\n \n\nEscape from Mount Gram sounds really great! I love that you can save captured cards a little more easily but at a price. I also like that you have to find all the heroes to win! I usually try to accomplish this before victory anyway! \n\nAs for Across the Ettenmoors, I am very interested to see what you are talking about with this one being bugged now and it being easier than before. Very intrigued to see what you mean."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2468464","commentId":2468464,"userName":"PsychoRocka","timestamp":1477055441,"content":"Did some reviews of older Nightmare Quests on a new blog I started and was somewhat inspired by this thread to do the reviews in the first place! Here are links for those interested :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nhttps://warriorsofthewestblog.wordpress.com/2016/10/20/nightmare-review-trouble-in-tharbad/ [https://warriorsofthewestblog.wordpress.com/2016/10/20/nightmare-review-trouble-in-tharbad/]\n\nhttps://warriorsofthewestblog.wordpress.com/2016/10/17/nightmare-review-the-seventh-level/ [https://warriorsofthewestblog.wordpress.com/2016/10/17/nightmare-review-the-seventh-level/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2469569","commentId":2469569,"userName":"tricil","timestamp":1477109857,"content":"> Across the Etten moore : I don't know what to say ... I totally crush the scenario, it seems easier ... I think the new first step (which replaces the normal) is bugged ... I explore the 7 side quests in the first step in 8 rounds which imply problems for the rest of the scenario ... i need to redo it but big disappointment.\n\n \n\nI got my copy today and I have to say that I agree. The enemies, locations and side quests became harder. But you can now stay in the first quest stage until all encounter side quests are cleared. This way, stages 2 and 3 will be a lot easier. To fix this issue, I would recommend NOT using the nightmare 1B quest card and instead just use the normal one. This will force you to leave stage 1 before you can clear all side quests, just as in normal mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2469833","commentId":2469833,"userName":"sappidus","timestamp":1477146739,"content":"Mildly curious: I haven't seen much commentary, here or elsewhere, on The Road Darkens or Treason of Saruman NM stuff. Thoughts from you masochists? :-)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2475119","commentId":2475119,"userName":"Jekzer","timestamp":1477469411,"content":"Yeah, NM sagas quests are the least commented. Eager to know, too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2475280","commentId":2475280,"userName":"13nrv","timestamp":1477480258,"content":"Well ! My feedback will be very subjective :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI am not a fan of saga quest ... IMO few saga quest really shine. The Black riders and Flame of the west are really good but not the other (IMO).\n\nI buy NM on Saga quest only for collection.\n\n \n\nI will try Road darkens NM but don't know when i will have some time to loose to play it :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nVery subjective feedback and only applicable for me :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2476238","commentId":2476238,"userName":"Lecitadin","timestamp":1477518291,"content":"I always get NM decks except for saga quests, because I think it's harder to build thematic decks to beat NM quests. And some saga quests, like the one with the Balrog or Battle of the 5 armies are already challenging enough!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2514888","commentId":2514888,"userName":"tomtom","timestamp":1480080235,"content":"What's wrong with Blood Of Gondor? I've been trying for about a week with no success. Man, I can't get past round 2 because of too much of everything happening right out of the gate. OK, it's an ambush, I get it, but how am I supposed to manage six low threat enemies hitting for at least three on round one, with chaining shadows and heaps of hidden cards approaching from basically everywhere? The only viable option seems to engage sen. Palpatine ASAP, but he has a nasty habit of un-hiding his minions which means dead heroes round 1.\n\nSeriously, I didn't expect to get stuck here after fighting through Woses and Amon Din."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232149-nightmare-decks-experiences-and-rankings/?do=findComment&comment=2514910","commentId":2514910,"userName":"Seastan","timestamp":1480083137,"content":"> how am I supposed to manage six low threat enemies hitting for at least three on round one\n\n \n\nBoromir"}]}