{"url":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/","title":"1-shot stats","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460578","commentId":2460578,"userName":"Seastan","timestamp":1476718853,"content":"The first number is your attack, the second number is how many enemies have exactly that much hit points + defense, followed by the full list of enemies that fit in that category.\n\n \n\nNightmare is not included here, nor are enemies with \"X\" hit points or defense. \n\n \n\n  0:  0 ()\n 1:  2 (Dark Bats, Eastern Crows)\n 2:  14 (Snaga Scouts, Army of Flies, Mirkwood Bats, Evil Crow, A Suspicious Crow, Goblin Miners, Pickpocket, Forest Bat, Black Forest Bats, Wolf Rider, Goblin Sniper, Black Forest Bats, Goblin Scout, Restless Dead)\n 3:  29 (Uruk Soldier, Goblintown Scavengers, Grasping Tentacle, Thrashing Tentacle, Goblin Runners, Cornered Orc, Cursed Dead, Crebain, Drúadan Thief, Moria Bats, Orc Hound, Morgul Tracker, Goblin Sneak, Rock Adder, Mordor Orc, Evil Crow, Orc Scramblers, Dungeon Guard, Lazy Lob, Croaking Crows, Gundabad Wolf Rider, Hummerhorns, Dol Guldur Orcs, East Bight Patrol, Cavern Guardian, Goblin Swordsman, Warg of Carn Dûm, Crebain from Dunland, Ranging Goblin)\n 4:  44 (Wolves from Mordor, Orc Ravager, Orc Ambusher, Striking Tentacle, Goblin Axeman, Muck Adder, Orc Raiders, Drúadan Drummer, Underworld Dissident, Orc Hunter, Prowling Wolf, Morgul Sorcerer, Isengard Orc, Snaga, Dead Man of Dunharrow, Corsair of Umbar, Orc of the Eye, Harbor Thug, Zealous Traitor, Orc Rabble, Goblin Tormentor, Orc Grunts, Crazy Cob, Wicked Spider, Gundabad Climber, Gundabad Archer, Ravenous Warg, Mirkwood Flock, Bree-land Informant, King Spider, Wargs, Misty Mountain Goblins, Wolf of Angmar, Orc Horn Blower, Goblin Spearman, Goblin Archer, Orc Drummer, Stray Goblin, Corsair Arsonist, Throngs of Unfaithful, Hound of Sauron, Moria Orc, Raven Skirmisher, Regretful Shade)\n 5:  42 (Uruk Lieutenant, Southron Phalanx, Grasping Arm, Wainriders, Marauding Orc, Craven Eagle, Goblin Driver, Goblin Bent-Swords, Wild Wargs, Dead Lord, Boar Clan Stalker, Boar Clan Warrior, Blue Mountain Goblin, Groping Dead, Man of Harad, Morgul Orc, Dunland Tribesman, Dunland Berserker, Goblin Pursuer, Mountain Goblin, Snow Warg, Wraith of Carn Dûm, Wild Hillman, Wolf of Isengard, Cave Spider, Faithless Dead, Morgul Captain, Shady Bree-Lander, Squint-Eyed Southerner, Orc Arsonist, Cruel Torturer, Vanguard of Bolg, Lawless Ruffian, Forest Spider, Northern Warg, Black Uruks, Orc of Angmar, Corsair Seafarer, Southron Sailor, Corsair Infiltrator, Uruk-hai Tracker, Uruk-hai Hunter)\n 6:  56 (Crushing Arm, Brutal Uruk, Cold-wight, Baleful Shade, Angmar Orc, Angmar Marauder, Goblin Taskmaster, Orc of Ered Luin, Traitorous Wight, Drúadan Elite, Drúadan Hunter, Bellach's Scout, Spy from Mordor, Haradrim Archer, Orc Skirmisher, Dunland Prowler, Dunlending Bandit, Witch of Angmar, Spirit of the Wild, Warrior of Dunland, Soldier of Isengard, Gríma, Isengard Uruk, Ghosts of Men, Haradrim Pirate, Southron Champion, Southron Company, Lossarnach Bandit, Umbar Assassin, Morgul Spider, Southron Mercenaries, Haradrim Elite, Old Tomnoddy, Greenway Footpad, Dol Guldur Beastmaster, Faithless Desecrator, Island Watcher, Profane Dead, White Warg, Chieftain of the Pit, Goblin Follower, Mountain Warg, Angmar Warg-rider, Cunning Pirate, Vicious Marauder, Umbar Raider, Raid Leader, Drowned Dead, Soulless Cadaver, Sea-Scorpion, Cave Eel, Howling Warg, Moria Archer, Uruk-hai Archer, Shadow-man, Whisperer)\n 7:  26 (Giant Arm, Wainrider Captain, Neekerbreekers, Great Gray Wolf, Barrow-wight, Angmar Captain, Dead Things, Orc of Citith Ungol, Haradrim Soldier, Uruk-hai Fighter, The Black Serpent, Siege Raft, Lieutenant of Mordor, Orc Arbalesters, Fat Spider, Bodyguard of Bolg, Blood-thirsty Warg, Patrol Leader, Savage Werewolf, Corsair Skiff, Serpent's Blade, Servant of the Deceiver, Uruk from Mordor, Uruk-hai Captain, Raven Warrior, Shadow Host Captain)\n 8:  36 (Thrashing Arm, Giant Marsh Worm, Long Trailer, Grasping Root, Hunters from Mordor, Black Númenorean, Gollum, Dark-wight, Thaurdir's Damned, Chief Turch, Wild Bear, Wight of Rhudaur, Prowling Orc, Candle-bearer, Captain of Harad, Daughter of Berúthiel, Methedras Orc, Dunland Raider, Morgul Bodyguard, Lord Alcaron, Uglúk's Uruk-hai, Lieutenant of Orthanc, Goblin Warlord, Shadow Host, Rider of Mordor, Bill Ferny, Orc Horse Thieves, Battering Ram, Orc Vanguard, Carn Dûm Garrison, Bill Ferny, Chetwood Outlaw, Marsh Adder, Dungeon Jailor, Sahír's Ravager, Umbar Captain)\n 9:  24 (Southron Commander, Uruk Vanguard, Giant Swamp Adder, Orc War Party, Drû-buri-Drû, Bellach's Marauder, The Hand of Castamir, Telemnar's Bane, Mugash's Guard, Dark-Hearted Huorn, Dunland Chieftain, Murzag, Nazgûl of Minas Morgul, Savage Trollspawn, Dwimmerlaik, Corsair Captain, Fell Rider, Ringwraith, Chieftan Ufthak, Hunting Pack, Sahír’s Escort, Scouting Ship, Great Warg Chief, Orc-chieftan)\n 10:  15 (Eye of the Beast, Ghulat, Attercop, Attercop, The Great Goblin, Corsair Skirmisher, Deadly Huorn, Uglúk, Saruman, Umbar Pirate Crew, Army of the Dead, Black Rider, Werewolf of Angmar, Wolf-pelt Jake, Johnny Goblin-fingers, Great Cave-troll)\n 11:  13 (Old Stone Troll, Bellach, Bellach, Oliphaunt, Coldfell Giant, Cruel Mountain-troll, War Mumak, Jailor Gornákh, Bolg, Susie the Spider, Ungoliant's Spawn, Cave-troll, Vanguard of Carn Dûm)\n 12:  20 (Bert, Stone-Giant, Louis, Morris, Stuart, Rupert, Shelob, Siege Ship, Mugash, Angry Huorn, Mountain Troll, Grishnákh, Todd the Troll, Old Orc-eyes, Hill Troll, Nazgûl of Dol Guldur, Pack Leader, Swift Raider, Light Cruiser, The Lord of the Dead)\n 13:  12 (Ancient Marsh-dweller, Tom, Thaurdir, Thaurdir, Morgul Wraith, Heavy Cruiser, Ruthless Hill-troll, Raven's Guardian, Thaurdir, Great Cave-troll, Lieutenant of Angmar, Corsair Warship)\n 14:  6 (William, Lurker of the Depths, Boar's Guardian, The Witch-king, Temple Guardian, Raven Chief)\n 15:  2 (Wolf's Guardian, Mumak)\n 16:  4 (Old Man Willow, The Watcher, Wraith on Wings, Host of Angmar)\n 17:  3 (The Witch-king, Daechanar, Watcher in the Water)\n 18:  0 ()\n 19:  0 ()\n 20:  1 (The Witch-king)\n 21:  1 (Raider Flagship)\n 22:  0 ()\n 23:  0 ()\n 24:  1 (The Stormcaller)\n 25:  1 (Naurlhûg)\n 26:  0 ()\n 27:  1 (Smaug the Terrible)\n 28:  2 (Smaug the Magnificent, Smaug the Magnificent)\n 29:  2 (Smaug the Mighty, Smaug the Golden)\n 30:  1 (Durin's Bane)\n 31:  0 ()\n 32:  0 ()\n 33:  0 ()\n 34:  1 (The Balrog)\n \n \nNow, after taking into account the quantity of each enemy that show up in the quests, here are the stats again:\n  0:  0\n 1:  6\n 2:  41\n 3:  92\n 4:  136\n 5:  126\n 6:  162\n 7:  67\n 8:  87\n 9:  56\n 10:  28\n 11:  21\n 12:  30\n 13:  16\n 14:  6\n 15:  2\n 16:  9\n 17:  3\n 18:  0\n 19:  0\n 20:  1\n 21:  1\n 22:  0\n 23:  0\n 24:  1\n 25:  1\n 26:  0\n 27:  3\n 28:  4\n 29:  4\n 30:  1\n 31:  0\n 32:  0\n 33:  0\n 34:  1\n \nFinally, we want to know the total enemies you can 1-shot with a given attack, so we need to sum up all the quantities from 0 up to the attack value.\n 0:  0 (0.0%)\n 1:  6 (0.7%)\n 2:  47 (5.2%)\n 3:  139 (15.4%)\n 4:  275 (30.4%)\n 5:  401 (44.3%)\n 6:  563 (62.2%)\n 7:  630 (69.6%)\n 8:  717 (79.2%)\n 9:  773 (85.4%)\n 10:  801 (88.5%)\n 11:  822 (90.8%)\n 12:  852 (94.1%)\n 13:  868 (95.9%)\n 14:  874 (96.6%)\n 15:  876 (96.8%)\n 16:  885 (97.8%)\n 17:  888 (98.1%)\n 18:  888 (98.1%)\n 19:  888 (98.1%)\n 20:  889 (98.2%)\n 21:  890 (98.3%)\n 22:  890 (98.3%)\n 23:  890 (98.3%)\n 24:  891 (98.5%)\n 25:  892 (98.6%)\n 26:  892 (98.6%)\n 27:  895 (98.9%)\n 28:  899 (99.3%)\n 29:  903 (99.8%)\n 30:  904 (99.9%)\n 31:  904 (99.9%)\n 32:  904 (99.9%)\n 33:  904 (99.9%)\n 34:  905 (100.0%)\n \nSo for example, with an attack value of 5, you can 1-shot 417 enemies, or about 46.1% of the enemies you will see come up in the game.\nEdited October 17, 2016 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460587","commentId":2460587,"userName":"Flrbb","timestamp":1476719202,"content":"Nice stats!\n\nBut seriously, aer you bored? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460635","commentId":2460635,"userName":"Seastan","timestamp":1476720414,"content":"> Nice stats!\n> \n> But seriously, aer you bored? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nHaha, I automated it. Took about 30 min."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460644","commentId":2460644,"userName":"Qaanaaq","timestamp":1476720608,"content":"Nice. Can we see some data visualisation/charts? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460648","commentId":2460648,"userName":"dalestephenson","timestamp":1476720664,"content":"Thanks for the list, but for one-shot calculations \"toughness\" should be added as well.\n\n \n\nFrom 3 to 6 attack the percentage jumps by about 15% for each additional point of attack, at which point diminishing returns kick in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460663","commentId":2460663,"userName":"dalestephenson","timestamp":1476720878,"content":"For a breakdown by quest (through April), I took a look at the attack needed by quest to kill at least 50% or 75% of the enemies in a particular quest's encounter deck here:\n\n \n\nhttps://boardgamegeek.com/thread/1560093/analyzing-attack-needed [https://boardgamegeek.com/thread/1560093/analyzing-attack-needed]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460738","commentId":2460738,"userName":"Fingolfin Fate","timestamp":1476722429,"content":"I have just finished a game with Dúnhere, having not played him in about two years maybe (though he had been my favourite of the good'ol core set days). He mostly attacked for 5 with 1 weapon (Spear of Blade) and Warhorse for a double attack. It felt ideal to equip him with a single weapon and keep the second restricted spot for the horse, as I still had ways (Unseen Strike, Charge of the Rohirrim) to boost his attack when needed. And of course, you can attach a different restricted attachment later and drop a previous one -- even change Blade for Spear (or vice versa) may sometimes be beneficial.\n\n \n\nAll that said, this exact statistic seems very appropriate for the given moment. Nice!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460747","commentId":2460747,"userName":"Fingolfin Fate","timestamp":1476722561,"content":"> For a breakdown by quest (through April), I took a look at the attack needed by quest to kill at least 50% or 75% of the enemies in a particular quest's encounter deck here:\n> \n>  \n> \n> https://boardgamegeek.com/thread/1560093/analyzing-attack-needed [https://boardgamegeek.com/thread/1560093/analyzing-attack-needed]\n\nAnd this. It is amazing how valuable can that one point of direct damage done by Argalad be. I find him ways better than Thalin, obviously, as he can also double-duty on quest and ability with any sort of action advantage (Naith Guide seems fit for him).\n\nEdited October 17, 2016 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460754","commentId":2460754,"userName":"Lecitadin","timestamp":1476722783,"content":"What's going on, here?  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460793","commentId":2460793,"userName":"987654321","timestamp":1476723586,"content":"> Nice. Can we see some data visualisation/charts? \n\nWe could if it was possible to copy/paste an Excel graphic into FFG forums. It doesn't seem we can, however, so nope."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460930","commentId":2460930,"userName":"Seastan","timestamp":1476725446,"content":"> Thanks for the list, but for one-shot calculations \"toughness\" should be added as well.\n\n \n\nGood point. I updated it to consider toughness."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2460949","commentId":2460949,"userName":"GrandSpleen","timestamp":1476725731,"content":"Wow cool stats!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2462123","commentId":2462123,"userName":"joezim007","timestamp":1476758101,"content":"> > Nice. Can we see some data visualisation/charts?\n> \n> We could if it was possible to copy/paste an Excel graphic into FFG forums. It doesn't seem we can, however, so nope.\n\nScreenshot and upload image?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232575-1-shot-stats/?do=findComment&comment=2462208","commentId":2462208,"userName":"Kakita Shiro","timestamp":1476761543,"content":"Google Sheets?"}]}