{"url":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/","title":"Buy or Wait Decision","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2463999","commentId":2463999,"userName":"Crusaderlord","timestamp":1476823895,"content":"I am closing on the end of the Angmar Cycle - i still have Carn Dum and Dread Realm to buy but have been a bit put off by the difficulty level - i solo play one deck and am not as keen on the hardest quests generally - also i do have some undead quests i like already. The first 4 quests in Angmar were very good i thought.\n\n \n\nSo back to another dilemma, to buy Grey Havens or wait for Sands of Harad. I confess i am not overly excited by Grey Havens box theme (sailing isnt something i am desparate to play through) but it is a gateway to a couple of quests i really like the look of in the middle of the cycle - Temple of the Deceived and Drowned Ruins. I am not sure how long it will be until Sands appears but i like the theme of this one as a box better. Also i have my eye on Arkham Horror LCG so am mindful of holding back anyway. My other thought is to get Flame of the West in the interim which has some hero cards i really want and the quests seem like a good mix.\n\n \n\nAny thoughts that may help are appreciated from those who own any of them. I have really enjoyed the first 4 quests in Angmar and the Lost Realms box was good too - much better for me than the more annoying time mechanics of Ringmaker and Isengard.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2464005","commentId":2464005,"userName":"Bullroarer Took","timestamp":1476824134,"content":"Personally I have loved this cycle, but then I'm a sailor.  There have also been some pretty good player cards too.\n\n \n\nSands is already \"On the Boat\" for what that's worth, but Grey Havens was on the boat for three months if I recall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2464080","commentId":2464080,"userName":"tricil","timestamp":1476826499,"content":"Initially, I was not overly exciting by the theme of the Grey Havens and the cycle either. However, having played A Storm on Cobas Haven for more than a dozen times now, I think I can safely say that this became one of my most favourite quests of all time. Even if you skipped everything else, I would at least give this one a try (at your FLGS or so)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2464177","commentId":2464177,"userName":"PsychoRocka","timestamp":1476830808,"content":"Just wanted to add that there are actually not that many quests that feature the sailing mechanic. So far only Voyage across Belegaer, Flight of the Stormcaller and Storm on Cobas Haven feature the Sailing quest. I am not sure about the City of Corsairs but I think we have seen spoilers showing it has sailing too? That is 4 out of the 9 quests in the deluxe and cycle that feature Sailing (3 if I am wrong about the last AP). Thats less than half of the quests! \n\n \n\nI love the current cycle but admittedly am not a big fan of the sailing mechanic. I have no issue with the game being at sea for certain quests and like the idea I just think the mechanics fall somewhat short. I like the off-course/on-course idea and various effects that are worse depending on how on course you are and the general idea of sailing but the actual sailing tests just feel like more swingy versions of hide tests from the Black Riders combined with making locate tests in The Long Dark. I have played Flight of the Stormcaller a handful of times but did not love it (it is a cool quest though) like most of the community seemed to and don't think I've gone back to it in a while. Voyage across Belegaer I pretty much never play and I don't have Storm on Cobas Haven just yet.\n\nThat being said I LOVE Fate of Numenor (even though its super easy) and Raid on the Grey Havens. Both are amazing quests. Drowned Ruins, The Thing in the Depths and Temple of the Deceived are all great quests as well and none feature the Sailing mechanic. To sum up you don't have to enjoy Sailing or even the mechanics behind it to enjoy the current cycle. I wouldn't skip this cycle and deluxe as the non-sailing tests are great and there are plenty of great player cards as well. \n\nAlso just wanted to add I couldn't agree more re Carn Dum and Dread Realm especially Carn Dum. Such an overly punishing quest that is just no fun unless you are a masochist  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2464223","commentId":2464223,"userName":"dr00","timestamp":1476832743,"content":"buy everything. don't wait. unless it's currently between printings and people are price-gouging. it'll come back around at some point anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2475054","commentId":2475054,"userName":"xodarap","timestamp":1477464460,"content":"> I am closing on the end of the Angmar Cycle - i still have Carn Dum and Dread Realm to buy but have been a bit put off by the difficulty level - i solo play one deck and am not as keen on the hardest quests generally - also i do have some undead quests i like already. The first 4 quests in Angmar were very good i thought.\n> \n>  \n> \n> So back to another dilemma, to buy Grey Havens or wait for Sands of Harad. I confess i am not overly excited by Grey Havens box theme (sailing isnt something i am desparate to play through) but it is a gateway to a couple of quests i really like the look of in the middle of the cycle - Temple of the Deceived and Drowned Ruins. I am not sure how long it will be until Sands appears but i like the theme of this one as a box better. Also i have my eye on Arkham Horror LCG so am mindful of holding back anyway. My other thought is to get Flame of the West in the interim which has some hero cards i really want and the quests seem like a good mix.\n> \n>  \n> \n> Any thoughts that may help are appreciated from those who own any of them. I have really enjoyed the first 4 quests in Angmar and the Lost Realms box was good too - much better for me than the more annoying time mechanics of Ringmaker and Isengard.\n\nSo as a fellow solo player let me ask you:  Is it worth getting into this game when the reviews are SO mixed and even the developers of the Arkham Horror game (which I'm definitely getting) have said that they've built it as an evolution of current LCGs.  Is it really that much fun or did they really mess up the difficulty curve in order to ensure that people would buy expansions (understandable) and then went a bit far in that direction.  Don't get me wrong I LIKE challenge, it's why I play a lot of solo games (MageKnight being my favorite) but I don't like an unbalanced challenge that is random with a lot of losing where there is nothing to be done, and therefore nothing really learned.  I would appreciate your take on the game please.  (I'm only looking into it because I have the chance to buy the majority of the set for a song so what the hey right?  However, I don't need a dust magnet on my shelf either and I'm NOT a Tolkien fan.)\n\nEdited October 26, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2475145","commentId":2475145,"userName":"PsychoRocka","timestamp":1477470790,"content":">  \n> \n> > I am closing on the end of the Angmar Cycle - i still have Carn Dum and Dread Realm to buy but have been a bit put off by the difficulty level - i solo play one deck and am not as keen on the hardest quests generally - also i do have some undead quests i like already. The first 4 quests in Angmar were very good i thought.\n> > \n> >  \n> > \n> > So back to another dilemma, to buy Grey Havens or wait for Sands of Harad. I confess i am not overly excited by Grey Havens box theme (sailing isnt something i am desparate to play through) but it is a gateway to a couple of quests i really like the look of in the middle of the cycle - Temple of the Deceived and Drowned Ruins. I am not sure how long it will be until Sands appears but i like the theme of this one as a box better. Also i have my eye on Arkham Horror LCG so am mindful of holding back anyway. My other thought is to get Flame of the West in the interim which has some hero cards i really want and the quests seem like a good mix.\n> > \n> >  \n> > \n> > Any thoughts that may help are appreciated from those who own any of them. I have really enjoyed the first 4 quests in Angmar and the Lost Realms box was good too - much better for me than the more annoying time mechanics of Ringmaker and Isengard.\n> \n> So as a fellow solo player let me ask you:  Is it worth getting into this game when the reviews are SO mixed and even the developers of the Arkham Horror game (which I'm definitely getting) have said that they've built it as an evolution of current LCGs.  Is it really that much fun or did they really mess up the difficulty curve in order to ensure that people would buy expansions (understandable) and then went a bit far in that direction.  Don't get me wrong I LIKE challenge, it's why I play a lot of solo games (MageKnight being my favorite) but I don't like an unbalanced challenge that is random with a lot of losing where there is nothing to be done, and therefore nothing really learned.  I would appreciate your take on the game please.  (I'm only looking into it because I have the chance to buy the majority of the set for a song so what the hey right?  However, I don't need a dust magnet on my shelf either and I'm NOT a Tolkien fan.)\n> \n>  \n\nWhere are all these mixed reviews??? I've only ever seen a few negative reviews of this game and the majority I see are stellar. So long as you don't play Carn Dum (1 of something like 60+ quests) over and over or Nightmare exclusively it is not unbalanced and you aren't constantly losing. You can use power decks that stand very little chance of losing if you are the type of person who wants to lose as little as possible or you can play easy mode, sleazy mode etc etc\n\nThere definitely is something to be done, you get better at the game, develop strategies, improve your deck building etc. For sure the game is no walk in the park but it isn't Battle Toads either :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nAlso just wanted to say this is the OFFICIAL forums for this game so the vast majority of people on here love this game. Might not be the best place to ask for a review as it is probably going to be somewhat biased so I reckon its worthwhile asking this somewhere like Boardgamegeek or a community of that nature as well.\n\nHonestly if you aren't a tolkien fan AT ALL and are worried about difficulty/losing every now and then it honestly might not be the game for you. I stopped playing MTG forever when I discovered this game as it was everything I wanted out of MTG that I couldn't have (solo play, co-op, a fantasy world that I love as opposed to extremely average ones, a far less abrasive community etc) but if you already have several solo games you love this one might not stand out to you like it does to me. I am a huge tolkien fan and enthusiast and if this game had a different setting I honestly have no idea if I would still play it. One of the main reasons I love this game is that it is the closest thing I have ever found to a game that expands upon Tolkien's lore while still respecting and staying as close to the facts and actual lore as possible.\n\n \n\nEdited October 26, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2475166","commentId":2475166,"userName":"Crusaderlord","timestamp":1477472110,"content":"I am going to buy Arkham Horror which i am expecting to have an ever better solo option than LOTR, but its not largely available and remains untested in the long term. So i can only answer this from a LOTR perspective. Given the number of brilliant solo games are very low, this is my current favourite. Now it is hard, but the difficulty is variable both in terms of different quests offering different challenges but also an improving stock of player cards will make the game easier. As the game isnt completely designed as a solo game, there are quests that dont work well, equally there are many that do. \n\n \n\nI think you get a mixture of quests to be honest. I will name a few as an example.\n\n * Some are perfectly playable solo and are excellent fun and beatable - Passage to Mirkwood, Seventh Level, Redhorn Gate, Trouble In Tharbad, Mount Gram,\n * Many are tough but fair and you may need to tweak your deck to win -  Journey along the Anduin, Watcher in the Water, Knife in the Dark, Flight from Moria\n * Some are story theme heavy but are tough -  Wastes of Eriador, Return to Mirkwood, Treachery of Rhudaur, Across the Ettenmoors\n * Some are larger scale battles - Battle of Five Armies, Carn Dum, Heirs of Numenor\n * Some are a puzzle you need to work out and need specific decks to beat - Conflict at Carrock, Shadows and Flame, Three Trials, Journey to Rhosgobel\n * Some are plain nasty and may become annoying depending on your taste - The Lonely Mountain, Dunland Trap, Celembrimors Secret, To Catch an Orc, We Must Away\n\nSo the game isnt broken just varied, yes i think the difficulty went up over time for solo players, but your ability to cope gets better too. You will not like every quest, each cycle has an easier one, one or two really nasty ones and then some in between. Personally i like stories and i dont mind resetting and trying to win a quest. Also it isnt that hard to tweak a quest, drop a few encounter cards that trouble you, switch in monsters from another deck, tweak a rule which really seems more multiplayer than solo. I dont mind doing these things to make a quest fun, i dont play to get a score but to have an adventure - others may disagree.\n\n \n\nIf you like Mage Knight then you should have no difficulty with the varied quest rules the game brings in to make them unique, i find Mage Knight a much harder game to remember everything i am allowed to do, and its combat is much more complex. However Mage Knight is a flowing adventure game, you largely dont just lose but more likely run out of time. LOTR you will win or lose and sometimes you will lose quickly, reshuffle and reset - for me thats the charm of the game but i dont find them comparable really. Mage Knight i think suffers from taking forever to play one quest. However if you dont like losing at all then this game is probably not for you, part of the game mechanic is learning, tweaking your deck and replaying.\n\n \n\nWhat LOTR offers is immense variety - loads of different quests fighting Orcs, Undead, Goblins, Wargs, escaping dungeons, travelling landscapes, telling stories. Then you can choose from a load of different heroes. Then you can deck build to a theme if you want, Elf, Dwarf, Hobbit, Rohan. Then you can change sphere and try a different type of game (switch from lore to tactics and the whole game feels different). That is what i like the best how much variety i can get from one game. I really dont think that liking Tolkein makes much difference to your enjoyment.\n\n \n\nFinally some cycles are better than others, hence my original question, and there are a lot to get through. I certainly found Mirkwood Cycle, Khazad Dum and Dwarrowdelf really good for solo. I have also really enjoyed Lost Realms and Angmar Cycle, however i never took that well to Voice of Isengaard and Ringmaker due to its largely annoying time rules.\n\nEdited October 26, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2475175","commentId":2475175,"userName":"PsychoRocka","timestamp":1477472641,"content":"Don't forget if you are worried about quests not working properly in solo you can always try out solo two handed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  It's definitely one option and fix for a quest not working that well in Solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2475259","commentId":2475259,"userName":"Crusaderlord","timestamp":1477478857,"content":"For those with any interest (not many i suspect) - i chose to buy Flame of the West for now and then wait for Sands of Time. I will probably skip over the Grey Havens and Dreamchaser for now at least. I dont have any real like or dislike for the theme as such but i do think with the more ship orientated player cards i would feel less able to substitute into any deck i wanted to adventure with. Also as i wasnt a huge fan of turning over encounter cards to trigger hide effects and this mechanic doesnt fill me with excitement for the sailing. That said i will probably buy it one day as i want Temple of the Decieved and Drowned Ruins for sure.\n\n \n\nInitial glance through Flame of the West box looks pretty good. I only cherry pick saga boxes and this looks like a good one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476748","commentId":2476748,"userName":"xodarap","timestamp":1477557536,"content":">  \n> \n> >  \n> > \n> > > I am closing on the end of the Angmar Cycle - i still have Carn Dum and Dread Realm to buy but have been a bit put off by the difficulty level - i solo play one deck and am not as keen on the hardest quests generally - also i do have some undead quests i like already. The first 4 quests in Angmar were very good i thought.\n> > > \n> > >  \n> > > \n> > > So back to another dilemma, to buy Grey Havens or wait for Sands of Harad. I confess i am not overly excited by Grey Havens box theme (sailing isnt something i am desparate to play through) but it is a gateway to a couple of quests i really like the look of in the middle of the cycle - Temple of the Deceived and Drowned Ruins. I am not sure how long it will be until Sands appears but i like the theme of this one as a box better. Also i have my eye on Arkham Horror LCG so am mindful of holding back anyway. My other thought is to get Flame of the West in the interim which has some hero cards i really want and the quests seem like a good mix.\n> > > \n> > >  \n> > > \n> > > Any thoughts that may help are appreciated from those who own any of them. I have really enjoyed the first 4 quests in Angmar and the Lost Realms box was good too - much better for me than the more annoying time mechanics of Ringmaker and Isengard.\n> > \n> > So as a fellow solo player let me ask you:  Is it worth getting into this game when the reviews are SO mixed and even the developers of the Arkham Horror game (which I'm definitely getting) have said that they've built it as an evolution of current LCGs.  Is it really that much fun or did they really mess up the difficulty curve in order to ensure that people would buy expansions (understandable) and then went a bit far in that direction.  Don't get me wrong I LIKE challenge, it's why I play a lot of solo games (MageKnight being my favorite) but I don't like an unbalanced challenge that is random with a lot of losing where there is nothing to be done, and therefore nothing really learned.  I would appreciate your take on the game please.  (I'm only looking into it because I have the chance to buy the majority of the set for a song so what the hey right?  However, I don't need a dust magnet on my shelf either and I'm NOT a Tolkien fan.)\n> > \n> >  \n> \n> Where are all these mixed reviews??? I've only ever seen a few negative reviews of this game and the majority I see are stellar. So long as you don't play Carn Dum (1 of something like 60+ quests) over and over or Nightmare exclusively it is not unbalanced and you aren't constantly losing. You can use power decks that stand very little chance of losing if you are the type of person who wants to lose as little as possible or you can play easy mode, sleazy mode etc etc\n> \n> There definitely is something to be done, you get better at the game, develop strategies, improve your deck building etc. For sure the game is no walk in the park but it isn't Battle Toads either :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n> Also just wanted to say this is the OFFICIAL forums for this game so the vast majority of people on here love this game. Might not be the best place to ask for a review as it is probably going to be somewhat biased so I reckon its worthwhile asking this somewhere like Boardgamegeek or a community of that nature as well.\n> \n> Honestly if you aren't a tolkien fan AT ALL and are worried about difficulty/losing every now and then it honestly might not be the game for you. I stopped playing MTG forever when I discovered this game as it was everything I wanted out of MTG that I couldn't have (solo play, co-op, a fantasy world that I love as opposed to extremely average ones, a far less abrasive community etc) but if you already have several solo games you love this one might not stand out to you like it does to me. I am a huge tolkien fan and enthusiast and if this game had a different setting I honestly have no idea if I would still play it. One of the main reasons I love this game is that it is the closest thing I have ever found to a game that expands upon Tolkien's lore while still respecting and staying as close to the facts and actual lore as possible.\n> \n>  \n> \n>  \n\nThank You very much, that was helpful, and I never received any kind of notification it was there.  I'm not concerned about the difficulty but I always play by the rules as the designers intend.  You play because you love the world of Tolkien and the theme, I play because I love the elegance of mechanisms and what I learn by watching them interact.  I don't play to win.  I play for the experience, it's just I find \"auto-lose\" situations or \"one hit death\" intolerable and almost always indicative of poor, sloppy, or rushed design.  For me, thematically, this is an entirely new world so I already know that exploration will be there but it's the mechanisms that concern me, again, sorry if I didn't state that well but I wasn't being negative about your game or \"mean\" to anyone.  I tend to be brusque in actual life and when I get on forums it just magnifies that especially with people who are deeply invested there or into whatever product I am discussing/making a decision about.  EDIT:  Sorry, I wasn't trying to dodge your question about the reviews, I just forgot it.  The reviews I was talking about are the one at Board Game Brawl, a video posted by Sologamer who is a great fan and essentially it wasn't a review, but a rant about the game's solo incompatibility with it's difficulty setting (those were the not-so-good ones) and what concerned me more was that reviewer's/solo gamers I really respect had nothing to say about it at all or had cooled on it significantly since it's release and it was nowhere to be found on their top 100's any more.  I chalk that up to reviewers not really being able to invest a lot of energy (even in something they really initially like) so I made the judgment call for myself that views of this game (for me at least) were mixed and came here with the simple idea that if the fans were complaining about it, or if it were dying - no go.  Now I can no longer get it for a song and it represents a somewhat considerable investment (once I showed interest and started digging for info the price became remarkably fluid.  No real shock, but I don't deal with people like that out of principle.) yet my research still leads me to believe that my inexperience with the subject could make it a huge adventure with tons to explore - worth it.  Yet if the mechanisms aren't there and it's more story than game - not.  Thanks for your input.  BattleToads was an apt metaphor.  If it has half the mechanisms and fun of that masterpiece, then please recommend a starting \"kit\" for solo'ers (not a netdeck, just a toobox, I can't STAND netdeckers) because I'm IN.  I freakin' loved that game!  : )\n\nEdited October 27, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476775","commentId":2476775,"userName":"xodarap","timestamp":1477559302,"content":"> Don't forget if you are worried about quests not working properly in solo you can always try out solo two handed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  It's definitely one option and fix for a quest not working that well in Solo.\n\n*nods*  That was pretty much already a given, I have seen in the play throughs (Watch It Played was especially good although the rules seemed to test even Rodney's sanity, one of the reasons for my concern about the rules.) that I've watched that \"solo\" means you run at least two heroes.  As CrusaderLord very accurately points out:  there are FEW truly solo excellent games.  I understand how spheres work but I want to  run \"multi-sphere\" dual or even triple \"decks\" so I can get the most out of the mechanisms and love for deck building.  That doesn't bother me at all.  Thanks for your input!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476791","commentId":2476791,"userName":"xodarap","timestamp":1477561008,"content":"> I am going to buy Arkham Horror which i am expecting to have an ever better solo option than LOTR, but its not largely available and remains untested in the long term. So i can only answer this from a LOTR perspective. Given the number of brilliant solo games are very low, this is my current favourite. Now it is hard, but the difficulty is variable both in terms of different quests offering different challenges but also an improving stock of player cards will make the game easier. As the game isnt completely designed as a solo game, there are quests that dont work well, equally there are many that do. \n> \n>  \n> \n> I think you get a mixture of quests to be honest. I will name a few as an example.\n> \n>  * Some are perfectly playable solo and are excellent fun and beatable - Passage to Mirkwood, Seventh Level, Redhorn Gate, Trouble In Tharbad, Mount Gram,\n>  * Many are tough but fair and you may need to tweak your deck to win -  Journey along the Anduin, Watcher in the Water, Knife in the Dark, Flight from Moria\n>  * Some are story theme heavy but are tough -  Wastes of Eriador, Return to Mirkwood, Treachery of Rhudaur, Across the Ettenmoors\n>  * Some are larger scale battles - Battle of Five Armies, Carn Dum, Heirs of Numenor\n>  * Some are a puzzle you need to work out and need specific decks to beat - Conflict at Carrock, Shadows and Flame, Three Trials, Journey to Rhosgobel\n>  * Some are plain nasty and may become annoying depending on your taste - The Lonely Mountain, Dunland Trap, Celembrimors Secret, To Catch an Orc, We Must Away\n> \n> So the game isnt broken just varied, yes i think the difficulty went up over time for solo players, but your ability to cope gets better too. You will not like every quest, each cycle has an easier one, one or two really nasty ones and then some in between. Personally i like stories and i dont mind resetting and trying to win a quest. Also it isnt that hard to tweak a quest, drop a few encounter cards that trouble you, switch in monsters from another deck, tweak a rule which really seems more multiplayer than solo. I dont mind doing these things to make a quest fun, i dont play to get a score but to have an adventure - others may disagree.\n> \n>  \n> \n> If you like Mage Knight then you should have no difficulty with the varied quest rules the game brings in to make them unique, i find Mage Knight a much harder game to remember everything i am allowed to do, and its combat is much more complex. However Mage Knight is a flowing adventure game, you largely dont just lose but more likely run out of time. LOTR you will win or lose and sometimes you will lose quickly, reshuffle and reset - for me thats the charm of the game but i dont find them comparable really. Mage Knight i think suffers from taking forever to play one quest. However if you dont like losing at all then this game is probably not for you, part of the game mechanic is learning, tweaking your deck and replaying.\n> \n>  \n> \n> What LOTR offers is immense variety - loads of different quests fighting Orcs, Undead, Goblins, Wargs, escaping dungeons, travelling landscapes, telling stories. Then you can choose from a load of different heroes. Then you can deck build to a theme if you want, Elf, Dwarf, Hobbit, Rohan. Then you can change sphere and try a different type of game (switch from lore to tactics and the whole game feels different). That is what i like the best how much variety i can get from one game. I really dont think that liking Tolkein makes much difference to your enjoyment.\n> \n>  \n> \n> Finally some cycles are better than others, hence my original question, and there are a lot to get through. I certainly found Mirkwood Cycle, Khazad Dum and Dwarrowdelf really good for solo. I have also really enjoyed Lost Realms and Angmar Cycle, however i never took that well to Voice of Isengaard and Ringmaker due to its largely annoying time rules.\n\nThank you for all the information it is muchly appreciated.  If I can pay it back a little it sounds like you own MageKnight?  Have you ever tried beating the \"running out of time\" element by focusing on your reputation and evolving your heroes?  The game doesn't state this, it lets you learn it on your own, but if you negatively impact your reputation, you will find yourself underpowered when it counts the most.  Just because you CAN do something doesn't mean you should.  Yes, this game is also metaphorically and artistically brilliant.  I should have mentioned that much as with Lord of the Rings, the 1st expansion (the Lost Legion) is really necessary for the game to shine.  What it does for variety and most importantly Hero evolution can not be understated.  I started with both and I feel that's why it has remained my favorite game for 1/2 a decade and the only game that I will say is truly excellent solo using only one game piece.  The rules were daunting to me as well, (and I'm literally \"learning disabled\") but with experience you'll find them to be second nature and very well organized once you understand them.  All those symbols which only seem cumbersome and arcane initially lead to an elegance and balance that remains unequalled in my opinion, and well worth the effort.  Anywho, just trying to pay back the help a bit.  Back on topic, I don't mind difficult at ALL and deck building without having to deal with the \"tournament mindset\" IS a lot of the appeal but I have no idea as a solo player where to start or if as I've stated before, the mechanisms aren't what the games really about and it's more of a love letter to fans.  What concerns me about your post is the house ruling.  Is it necessary?  I really suck at that and usually just end up making the game much worse since I'm not the designer and the whole point for me, mostly, is exploration not so much of theme (which I'm not at all concerned about since as a kid I wasn't into Tolkien but I loved his drinking buddy and this doesn't happen in Narnia, so every card is a new treasure for me - perfect!) but of the designers original vision.  If I house rule, it perverts that vision.  If I MUST house rule, it makes me doubt that vision to begin with. That may sound weird but dancing with the math behind the paper and watching it work is worth more to me than the very best story that yet another version of \"A Heroes Journey\" can provide.  Everything you say about variety is music to my ears but is the PLAY as varied for the mind as it is for the eye and the sensibility that is already in love with Middle Earth?  If so what sets (I really appreciate your list but it doesn't seem to correspond to anything I can order, I will double check with multiple online retailers but the names do not look familiar.) would you recommend I start with (multiple cores are fine, this isn't my first dance with FFG LCG's hence all the research prior to investment.) now that you know that I don't mind challenge or a fair loss.  Even if it's a fair few of them so long as I get to study, learn, think, build, overcome, and eventually - win.     Again, thank you for your efforts to help me in this! : ) \n\nEdited October 27, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476809","commentId":2476809,"userName":"PsychoRocka","timestamp":1477562753,"content":"hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476815","commentId":2476815,"userName":"PsychoRocka","timestamp":1477563264,"content":">  \n> \n> > Don't forget if you are worried about quests not working properly in solo you can always try out solo two handed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  It's definitely one option and fix for a quest not working that well in Solo.\n> \n> *nods*  That was pretty much already a given, I have seen in the play throughs (Watch It Played was especially good although the rules seemed to test even Rodney's sanity, one of the reasons for my concern about the rules.) that I've watched that \"solo\" means you run at least two heroes.  As CrusaderLord very accurately points out:  there are FEW truly solo excellent games.  I understand how spheres work but I want to  run \"multi-sphere\" dual or even triple \"decks\" so I can get the most out of the mechanisms and love for deck building.  That doesn't bother me at all.  Thanks for your input!\n\nYeah two player (or two handed solo) is definitely the sweet spot for the game. Every other way of playing is just as valid and has just as much support but I think it is fairly universally agreed that two player is the \"sweet spot\" or works best (as far as the encounter deck working properly and difficulty is concerned). That being said I am sure that 3 and 4 player are an absolute blast and I hope to one day get to try proper multiplayer out.  No worries happy to help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476836","commentId":2476836,"userName":"PsychoRocka","timestamp":1477564240,"content":"I will begrudgingly admit that the rules for this game (whilst awesome!) are not the most straight forward or absolute compared to other card games out there. There are many times that we have to ask the developers to make rulings on effects that people are interpreting differently. Even with this being the case once you get used to the game and rules and have a good resource nearby when you play (I know I constantly mention this resource but it is just amazing and has helped me SO MUCH: http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf [http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf]) you can definitely minimize error to a pretty decent level. You can always just replay a quest if you played it wrong :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png].\n\nI think like Crusaderlord mentioned, immense variety is one of the main draws to this game and also helps with rules and frustrating losses. Even if you do lose and its annoying/frustrating you can play an easier or at least less rules intensive quest and thrash it to feel better and then go back to that other quest later on. You can play a different game mode (nightmare, easy, sleazy etc) or even just house rule ( I personally am a purist and follow rules to the tee but think houseruling is a very valid and important part of the game for some) and ignore certain parts of a quest that you don't like if they don't gel with your play style or are ridiculously hard to remember/implement for you personally (there are one or two encounter cards that my brain just seems to hate and refuse to remember, like the Make Camp sidequest....). I think that being so in love with the IP helps many of us cope with the rules which although great can sometimes be a little umm.. how to put this... arbitrary?\n\nEdited October 27, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476857","commentId":2476857,"userName":"monkeyrama","timestamp":1477565924,"content":"> hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n\n \n\nA little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n\n \n\nThis means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n\n \n\nI don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476871","commentId":2476871,"userName":"xodarap","timestamp":1477566548,"content":">  \n> \n> > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> \n>  \n> \n> A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> \n>  \n> \n> This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> \n>  \n> \n> I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> \n>  \n\nThanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n\nEdited October 27, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476885","commentId":2476885,"userName":"xodarap","timestamp":1477567141,"content":"> I will begrudgingly admit that the rules for this game (whilst awesome!) are not the most straight forward or absolute compared to other card games out there. There are many times that we have to ask the developers to make rulings on effects that people are interpreting differently. Even with this being the case once you get used to the game and rules and have a good resource nearby when you play (I know I constantly mention this resource but it is just amazing and has helped me SO MUCH: http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf [http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf]) you can definitely minimize error to a pretty decent level. You can always just replay a quest if you played it wrong :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png].\n> \n> I think like Crusaderlord mentioned, immense variety is one of the main draws to this game and also helps with rules and frustrating losses. Even if you do lose and its annoying/frustrating you can play an easier or at least less rules intensive quest and thrash it to feel better and then go back to that other quest later on. You can play a different game mode (nightmare, easy, sleazy etc) or even just house rule ( I personally am a purist and follow rules to the tee but think houseruling is a very valid and important part of the game for some) and ignore certain parts of a quest that you don't like if they don't gel with your play style or are ridiculously hard to remember/implement for you personally (there are one or two encounter cards that my brain just seems to hate and refuse to remember, like the Make Camp sidequest....). I think that being so in love with the IP helps many of us cope with the rules which although great can sometimes be a little umm.. how to put this... arbitrary?\n\nThanks again PsychoRocka, I trusted your link and I'm glad I did!  That reference should be in the main rules!  For anyone who has watched a competent explanation of the rules a couple of times it really goes hand in hand to create a much smoother learning curve.  I opened the .pdf for the main rules and just winced in comparison to Rodney's explanations.  However once I get used to it and write in all the errata, clarifications and attach that reference I think I'll bee able to handle it. All of my favorite games rules manuals seem to have reputations but once I'm used to them and more practiced with the mechanisms they all seem far more clear than they first appeared and I find the effort invested in learning them to be well worth it as in many cases the \"advanced\" rules sets are part of what creates a great game with depth and flexibility.  That reference sheet will sure make it less a grind though!  I still have awhile to assemble a solo starting kit list during my break but I'm finding a lot of recommendations out of stock.  It looks like getting that together will be an adventure in itself!  : )\n\nEdited October 27, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476899","commentId":2476899,"userName":"dalestephenson","timestamp":1477567908,"content":">  \n> \n> > Don't forget if you are worried about quests not working properly in solo you can always try out solo two handed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  It's definitely one option and fix for a quest not working that well in Solo.\n> \n> *nods*  That was pretty much already a given, I have seen in the play throughs (Watch It Played was especially good although the rules seemed to test even Rodney's sanity, one of the reasons for my concern about the rules.) that I've watched that \"solo\" means you run at least two heroes.  As CrusaderLord very accurately points out:  there are FEW truly solo excellent games.  I understand how spheres work but I want to  run \"multi-sphere\" dual or even triple \"decks\" so I can get the most out of the mechanisms and love for deck building.  That doesn't bother me at all.  Thanks for your input!\n\nTo be clear, \"solo two handed\" doesn't refer to running two heroes, but running two *decks*, each of which typically has three heroes.  This allows you to deal with a few quests that don't scale well, and also take advantage of cards and keywords with little benefit for the one-deck solo player.  I think it's a richer experience -- but it also adds substantially to play time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476923","commentId":2476923,"userName":"xodarap","timestamp":1477569596,"content":">  \n> \n> >  \n> > \n> > > Don't forget if you are worried about quests not working properly in solo you can always try out solo two handed :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  It's definitely one option and fix for a quest not working that well in Solo.\n> > \n> > *nods*  That was pretty much already a given, I have seen in the play throughs (Watch It Played was especially good although the rules seemed to test even Rodney's sanity, one of the reasons for my concern about the rules.) that I've watched that \"solo\" means you run at least two heroes.  As CrusaderLord very accurately points out:  there are FEW truly solo excellent games.  I understand how spheres work but I want to  run \"multi-sphere\" dual or even triple \"decks\" so I can get the most out of the mechanisms and love for deck building.  That doesn't bother me at all.  Thanks for your input!\n> \n> To be clear, \"solo two handed\" doesn't refer to running two heroes, but running two *decks*, each of which typically has three heroes.  This allows you to deal with a few quests that don't scale well, and also take advantage of cards and keywords with little benefit for the one-deck solo player.  I think it's a richer experience -- but it also adds substantially to play time.\n> \n>  \n\nSorry, I explained that poorly.  By \"Heroes\" I actually did mean \"Decks\", sorry.  I don't think I will run three or four though as I'm finding out that would require a much larger amount of cards.  Judging by the challenge I'm running into just finding the starting few packs in even the first cycle, or even the first deluxe expansion Khazad-Dum? - that doesn't look doable.  Looking at the prices on Amazon it seems some opportunist has nabbed all the starting stuff so they can sell single packs for over $50.  It looks like I'll find out just how important it is to play this game with any kind of sequence!  Ah well non-linear is always welcome and since all of it is new to me I'll just go with what people hopefully suggest as a proper solo kit.  (Understanding that most of the starting stuff is unavailable.) I'm quite liking the look of the Lost Realm (I do love Rangers!) to be honest, and it leads to the Agmar Awakened cycle which CrusaderLord spoke fondly of so I'll come up with something to give it a go.  Any suggestions?\n\nEdited October 27, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476925","commentId":2476925,"userName":"monkeyrama","timestamp":1477569713,"content":">  \n> \n> >  \n> > \n> > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > \n> >  \n> > \n> > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > \n> >  \n> > \n> > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > \n> >  \n> > \n> > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > \n> >  \n> \n> Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> \n>  \n\n \n\nNo problem, quite happy to answer that! Although bear with me if this gets verbose...\n\n \n\nI got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n\n \n\nI play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n\n \n\nI also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n\n \n\nThe only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n\n \n\nAs to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n\n \n\nFinally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n\n \n\nHope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2476973","commentId":2476973,"userName":"xodarap","timestamp":1477572328,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > > \n> > >  \n> > > \n> > > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > > \n> > >  \n> > > \n> > > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > > \n> > >  \n> > > \n> > > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > > \n> > >  \n> > \n> > Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> > \n> >  \n> \n>  \n> \n> No problem, quite happy to answer that! Although bear with me if this gets verbose...\n> \n>  \n> \n> I got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n> \n>  \n> \n> I play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n> \n>  \n> \n> I also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n> \n>  \n> \n> The only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n> \n>  \n> \n> As to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n> \n>  \n> \n> Finally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n> \n>  \n> \n> Hope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse...\n> \n>  \n\nThat wasn't verbose at all, and very informative, Thank You!  Okay now I'm really convinced I'll like Lord of the Rings for many reasons my research here has uncovered and I've already discussed so I won't bore you with that further.  Most importantly, you confirmed what I thought about the game.  That it gets better with the later cycles.  I had kind of guessed that as one: all systems evolve and two: one of the designers on another solo game I'm getting into had some design ideas I REALLY liked and came from Lord of the Rings having joined it later in the cycles.  The space consideration and puzzle aspect are HUGE for me and what you said about the difficulty answered some of my most important design questions as well ESPECIALLY coming from someone else who has encountered the WarHammer 40k rules set.  A game, that for me, is all about paying your dues, studying, picking a strategy, adapting tactics on the fly and getting better, which I love, but I was hoping the players mindset wasn't like that everywhere as I've always wanted to learn to paint well.  However, Zombicide Black Plague looks like it could scratch that same itch, is soloable, has 1/8 th the footprint, and gives me a LOT to paint.  Hmmmmm.  You may have just given me a great idea!  Not playing doesn't mean I can't still follow the lore (which I love) Anywho, I digress wildly.  Back on topic however you (and others here as well) have convinced me to give it a go.  I'd like to follow the path of the releases but that's just not available.  What would you suggest for a starting solo kit that would give me the flexibility to puzzle solve?  What are the best of those later sets where the \"kinks\" had been worked out?  Can you help me develop a starting set, so to speak?  I'm liking the look of the Lost Realm and Angmar Awakened cycle, (all currently available.) but surely I'll need some cards from preceding sets right?  Especially since you just said that (along with CrusaderLord) the last two cycle packs were pretty beastly right?  So maybe that's not the best starting point?  So any suggestions as to kit?  Also am I right that if I play two decks as most suggest, that I'll definitely need two core sets?  Thanks again for all the help!  : ) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2477158","commentId":2477158,"userName":"PigsAreOurEquals","timestamp":1477578290,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > >  \n> > > > \n> > > > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > > > \n> > > >  \n> > > > \n> > > > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > > > \n> > > >  \n> > > > \n> > > > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > > > \n> > > >  \n> > > > \n> > > > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > > > \n> > > >  \n> > > \n> > > Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> > > \n> > >  \n> > \n> >  \n> > \n> > No problem, quite happy to answer that! Although bear with me if this gets verbose...\n> > \n> >  \n> > \n> > I got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n> > \n> >  \n> > \n> > I play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n> > \n> >  \n> > \n> > I also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n> > \n> >  \n> > \n> > The only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n> > \n> >  \n> > \n> > As to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n> > \n> >  \n> > \n> > Finally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n> > \n> >  \n> > \n> > Hope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse...\n> > \n> >  \n> \n> That wasn't verbose at all, and very informative, Thank You!  Okay now I'm really convinced I'll like Lord of the Rings for many reasons my research here has uncovered and I've already discussed so I won't bore you with that further.  Most importantly, you confirmed what I thought about the game.  That it gets better with the later cycles.  I had kind of guessed that as one: all systems evolve and two: one of the designers on another solo game I'm getting into had some design ideas I REALLY liked and came from Lord of the Rings having joined it later in the cycles.  The space consideration and puzzle aspect are HUGE for me and what you said about the difficulty answered some of my most important design questions as well ESPECIALLY coming from someone else who has encountered the WarHammer 40k rules set.  A game, that for me, is all about paying your dues, studying, picking a strategy, adapting tactics on the fly and getting better, which I love, but I was hoping the players mindset wasn't like that everywhere as I've always wanted to learn to paint well.  However, Zombicide Black Plague looks like it could scratch that same itch, is soloable, has 1/8 th the footprint, and gives me a LOT to paint.  Hmmmmm.  You may have just given me a great idea!  Not playing doesn't mean I can't still follow the lore (which I love) Anywho, I digress wildly.  Back on topic however you (and others here as well) have convinced me to give it a go.  I'd like to follow the path of the releases but that's just not available.  What would you suggest for a starting solo kit that would give me the flexibility to puzzle solve?  What are the best of those later sets where the \"kinks\" had been worked out?  Can you help me develop a starting set, so to speak?  I'm liking the look of the Lost Realm and Angmar Awakened cycle, (all currently available.) but surely I'll need some cards from preceding sets right?  Especially since you just said that (along with CrusaderLord) the last two cycle packs were pretty beastly right?  So maybe that's not the best starting point?  So any suggestions as to kit?  Also am I right that if I play two decks as most suggest, that I'll definitely need two core sets?  Thanks again for all the help!  : ) \n> \n>  \n\nIf you are joining late, like I did, pick a race/faction/tribe... that's your favorite and look below what packs to buy.\n\nhttps://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\nPersonally the quests are what make the game fun so I tend to buy more deluxe expansions as they give more quests per $/€. Adventure packs give more player cards per $/€. So decide if you want to grow your card pool for deck building or your quest pool for playing. Heroes cost the sme no matter waht you buy (except hobbit sage gives a good $/€ per hero, but they are ver dwarf heavy)\n\nA bit of topic but might be good to know for a new player who still wants to spend money on other games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2477618","commentId":2477618,"userName":"JJ48","timestamp":1477592334,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > >  \n> > > > \n> > > > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > > > \n> > > >  \n> > > > \n> > > > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > > > \n> > > >  \n> > > > \n> > > > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > > > \n> > > >  \n> > > > \n> > > > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > > > \n> > > >  \n> > > \n> > > Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> > > \n> > >  \n> > \n> >  \n> > \n> > No problem, quite happy to answer that! Although bear with me if this gets verbose...\n> > \n> >  \n> > \n> > I got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n> > \n> >  \n> > \n> > I play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n> > \n> >  \n> > \n> > I also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n> > \n> >  \n> > \n> > The only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n> > \n> >  \n> > \n> > As to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n> > \n> >  \n> > \n> > Finally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n> > \n> >  \n> > \n> > Hope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse...\n> > \n> >  \n> \n> That wasn't verbose at all, and very informative, Thank You!  Okay now I'm really convinced I'll like Lord of the Rings for many reasons my research here has uncovered and I've already discussed so I won't bore you with that further.  Most importantly, you confirmed what I thought about the game.  That it gets better with the later cycles.  I had kind of guessed that as one: all systems evolve and two: one of the designers on another solo game I'm getting into had some design ideas I REALLY liked and came from Lord of the Rings having joined it later in the cycles.  The space consideration and puzzle aspect are HUGE for me and what you said about the difficulty answered some of my most important design questions as well ESPECIALLY coming from someone else who has encountered the WarHammer 40k rules set.  A game, that for me, is all about paying your dues, studying, picking a strategy, adapting tactics on the fly and getting better, which I love, but I was hoping the players mindset wasn't like that everywhere as I've always wanted to learn to paint well.  However, Zombicide Black Plague looks like it could scratch that same itch, is soloable, has 1/8 th the footprint, and gives me a LOT to paint.  Hmmmmm.  You may have just given me a great idea!  Not playing doesn't mean I can't still follow the lore (which I love) Anywho, I digress wildly.  Back on topic however you (and others here as well) have convinced me to give it a go.  I'd like to follow the path of the releases but that's just not available.  What would you suggest for a starting solo kit that would give me the flexibility to puzzle solve?  What are the best of those later sets where the \"kinks\" had been worked out?  Can you help me develop a starting set, so to speak?  I'm liking the look of the Lost Realm and Angmar Awakened cycle, (all currently available.) but surely I'll need some cards from preceding sets right?  Especially since you just said that (along with CrusaderLord) the last two cycle packs were pretty beastly right?  So maybe that's not the best starting point?  So any suggestions as to kit?  Also am I right that if I play two decks as most suggest, that I'll definitely need two core sets?  Thanks again for all the help!  : ) \n> \n>  \n\n \n\nI play two-handed solo, and I get by with only one core set.  Usually, my decks focus on different spheres, so there's very little (if any) overlap between the two.  The core came with fewer than three copies of some desirable cards, but it's quite possible to make do without, and I certainly wouldn't recommend buying a second core set simply because you're playing two-handed!  (If you're playing 3-4 decks, or if you really want extras of those cards regardless of how many decks you're playing, on the other hand...)\n\n \n\nAlso, you may already know this from your research (and I apologize if it's already been mentioned), but adventure packs require the corresponding deluxe expansion in order to play them (except Mirkwood cycle, which just needs the base set).  For this reason, if you're looking for the best value, you may want to start with a cycle where both the deluxe expansion quests and a few of the adventure packs appeal to you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478222","commentId":2478222,"userName":"xodarap","timestamp":1477620098,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > >  \n> > > > \n> > > > >  \n> > > > > \n> > > > > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > > > > \n> > > > >  \n> > > > \n> > > > Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> > > > \n> > > >  \n> > > \n> > >  \n> > > \n> > > No problem, quite happy to answer that! Although bear with me if this gets verbose...\n> > > \n> > >  \n> > > \n> > > I got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n> > > \n> > >  \n> > > \n> > > I play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n> > > \n> > >  \n> > > \n> > > I also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n> > > \n> > >  \n> > > \n> > > The only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n> > > \n> > >  \n> > > \n> > > As to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n> > > \n> > >  \n> > > \n> > > Finally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n> > > \n> > >  \n> > > \n> > > Hope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse...\n> > > \n> > >  \n> > \n> > That wasn't verbose at all, and very informative, Thank You!  Okay now I'm really convinced I'll like Lord of the Rings for many reasons my research here has uncovered and I've already discussed so I won't bore you with that further.  Most importantly, you confirmed what I thought about the game.  That it gets better with the later cycles.  I had kind of guessed that as one: all systems evolve and two: one of the designers on another solo game I'm getting into had some design ideas I REALLY liked and came from Lord of the Rings having joined it later in the cycles.  The space consideration and puzzle aspect are HUGE for me and what you said about the difficulty answered some of my most important design questions as well ESPECIALLY coming from someone else who has encountered the WarHammer 40k rules set.  A game, that for me, is all about paying your dues, studying, picking a strategy, adapting tactics on the fly and getting better, which I love, but I was hoping the players mindset wasn't like that everywhere as I've always wanted to learn to paint well.  However, Zombicide Black Plague looks like it could scratch that same itch, is soloable, has 1/8 th the footprint, and gives me a LOT to paint.  Hmmmmm.  You may have just given me a great idea!  Not playing doesn't mean I can't still follow the lore (which I love) Anywho, I digress wildly.  Back on topic however you (and others here as well) have convinced me to give it a go.  I'd like to follow the path of the releases but that's just not available.  What would you suggest for a starting solo kit that would give me the flexibility to puzzle solve?  What are the best of those later sets where the \"kinks\" had been worked out?  Can you help me develop a starting set, so to speak?  I'm liking the look of the Lost Realm and Angmar Awakened cycle, (all currently available.) but surely I'll need some cards from preceding sets right?  Especially since you just said that (along with CrusaderLord) the last two cycle packs were pretty beastly right?  So maybe that's not the best starting point?  So any suggestions as to kit?  Also am I right that if I play two decks as most suggest, that I'll definitely need two core sets?  Thanks again for all the help!  : ) \n> > \n> >  \n> \n> If you are joining late, like I did, pick a race/faction/tribe... that's your favorite and look below what packs to buy.\n> \n> https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n> \n> Personally the quests are what make the game fun so I tend to buy more deluxe expansions as they give more quests per $/€. Adventure packs give more player cards per $/€. So decide if you want to grow your card pool for deck building or your quest pool for playing. Heroes cost the sme no matter waht you buy (except hobbit sage gives a good $/€ per hero, but they are ver dwarf heavy)\n> \n> A bit of topic but might be good to know for a new player who still wants to spend money on other games.\n> \n>  \n\nYes I'm joining quite late and finding that there are some canny opportunists who are really taking advantage of folk that don't do their research!  (Economically, I mean, not on these forums.)  So please, am I right that I can start ANYwhere?  I'd really like to get the Lost Realm and Angmar Awakens.  To spare you my previous walls o' text, I am trying to replace my favorite solo game that's ALL about exploration which is space prohibitive and where my favorite character was an Artemis / Ranger type.  So Lost Realm/Angmar looks PERFECT, the fact that CrusaderLord is a solo player who enjoyed all but the last two packs in the cycle is a plus, however he and Monkeyrama have mentioned the difficulty of those last two packs so I'm not SURE.  Also, it's available.  THANK YOU for that site.  It will be a big help!  That's some deep research to dive into, just what I was looking for.  It should honestly be a sticky for new players along with the resource sheet PsychoRocka linked.  I hadn't made the exact link that adventure packs = stuff to deck build with and Deluxe Expansions = stuff to play, is that right?  Also I've now read this in several threads, why is being Dwarf heavy a bad thing?  Is it for a play reason or is there some reason they just aren't popular with fans of the Mythos? Also, you're not off topic, this was very helpful Thank You!  : )    My starting kit so far 1 Core, the Lost Realms, the entire Agmar cycle.  I'm also looking at Grey Havens/Dream chaser cycle as adventure plus water looks too good to pass up and that has been mentioned by my \"mentors\" as well. Again, some of this is based on recommendation some is based on availability.  Sound good so far?\n\nEdited October 28, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478235","commentId":2478235,"userName":"PocketWraith","timestamp":1477620619,"content":"> I hadn't made the exact link that adventure packs = stuff to deck build with and Deluxe Expansions = stuff to play, is that right?  Also I've now read this in several threads, why is being Dwarf heavy a bad thing?\n\nBoth deluxe expansions and adventure packs contain a mixture of player cards and quests. Specifically, a deluxe contains 3 quests and more player cards, whereas an adventure pack contains one quest and 10 different player cards including the hero. Additionally, adventure pack quests will include some generic encounter sets found in the preceding deluxxe expansion as well as the quest-specific one, so you need the deluxe to play those quests.\n\nAs to being Dwarf-heavy, there's nothing wrong with Dwarves other than some players find Dwarf decks boring, but some of the Dwarf cards (certainly most of the heroes in the Hobbit Sagas) are really only useful in a dedicated Dwarf deck, so you don't get much flexibility out of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478236","commentId":2478236,"userName":"xodarap","timestamp":1477620837,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > >  \n> > > > \n> > > > >  \n> > > > > \n> > > > > > hmmm as far as auto-lose or one hit death sort of situations there are only really a few quests that will actually feature these sort of effectsand even then you are sort of expecting it because those particular quests are so notoriously difficult or punishing so you can sort of prepare for these effects. Most loses I encounter are towards the end of a game so I still get to play the majority of a game and even with the loss have fun. I personally love the mechanics of this game and think that they work really well but again am biased because I love the setting and the mechanics tie into the setting and theme so well. The mechanics have definitely gotten a lot better as the game has progressed and admittedly some earlier quests are very basic compared to newer quests but nightmare can definitely address and fix this issue as can handicapping yourself with weaker (but maybe more fun?) decks.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > A little on the subject of auto-lose cards, one thing that I wonder about is what people mean. For example, I can sometimes hit a board state where the balance is such that a normally OK card becomes auto-lose. Precious few quests, as Psychorocka says, have actual auto-lose cards, which I take to mean cards that can defeat you no matter what your board state is. If a card defeats you because you have precarious board state, or made a stupid decision that entailed the risk of auto-losing (eg defending against an attack with an objective ally that cannot leave the game, and not taking into account a shadow effect that could cause the character to die in one hit) then that's actually not, in my view, the game's fault, but poor play by the player.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > This means that I honestly think that only a very small number of quests have auto-lose cards (the notorious Sleeping Sentry is one card of this type). Usually cards that look like auto-lose are actually just part of each quest's challenge. I recently had real trouble winning The Thing in the Depths, because I was playing my decks as though the final boss fight was a normal boss fight, which it isn't, and this meant that certain shadow effects kept defeating me. I did not really change the decks between plays, but changed how I approached combat.\n> > > > > \n> > > > >  \n> > > > > \n> > > > > I don't know. I am very much not trying to be defensive about this game, and it is undoubtedly hard and unforgiving sometimes (and the rules can be complex because of inconsistent wording, which is annoying). It requires investment (financial and temporal), but it is now very rare to find a quest that can, in one turn, defeat you, with one card. That particular criticism is fair at the start, but now a little dated. If it were the case, then it is absolutely bad design - no question there! Big hitting enemies are not 'one-hit-death', really, but problems to be solved. If we don't solve it, then sure, it's one-hit-death, but then that's more about how we play the game more than the design. But given the time and money requirement, I think all LCGs should be considered a lot before investment.\n> > > > > \n> > > > >  \n> > > > \n> > > > Thanks very much!  Yes that's exactly what I meant by \"one hit kills.\"  If it's my bad and I learned something, then so much the better, yet if the game has certain states that make it unavoidable, that's bad design.  Problems to be solved make the best games, I think, and deck building challenges just give me a chance to do something I love and your recent experience with the Thing in the Depths kind of tells me this is my type of challenge.  I change my deck strategy very slowly as I want to give it enough iterations to judge it's effectiveness, but I tend to change different tactics with that build on the fly and it sounds like this game rewards that.  A real plus!  Let me ask though please, has your investment in this game been worth it to you monkeyrama?\n> > > > \n> > > >  \n> > > \n> > >  \n> > > \n> > > No problem, quite happy to answer that! Although bear with me if this gets verbose...\n> > > \n> > >  \n> > > \n> > > I got this game when it first came out, so I've been collecting since the beginning, and have seen it gradually mature into a much better game than when it started - although I'm not that active on this forum, I've also been here for years now, and have generally found it to be a positive place, the usual internet bickering aside! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The recent expansions for the game in particular have started to develop interesting mechanics that keep quests challenging throughout their duration (early quests often front-loaded difficulty, which was not great design).\n> > > \n> > >  \n> > > \n> > > I play many board games socially (when I can) but LOTR is the game for me, because it is mechanic heavy and plays to a theme I enjoy. I like the puzzle (whereas the games I play with other people tend to be clever but lighter games - 7 Wonders is a big favourite, as it Takenoko etc.). So for me, LOTR is my solo game that keeps my brain ticking over on something that is not work. Having a deck slowly piece together in my mind and then trying to make it work in reality is part of the fun for me. For that reason I don't net-deck, even though my own decks kinda suck most of the time! (although I have no problem with net-decking whatsoever)\n> > > \n> > >  \n> > > \n> > > I also don't get to play as much as many people on the forums do. I am a lecturer, and during semester I struggle to play more than once a week (if that), and therefore I don't have the nightmare packs (not enough time) and I still don't have the latest saga expansion, as I'm catching up on the current Dreamchaser cycle, and I haven't played in over a week, as I'm deep in a period of marking... The current release rate is about spot on for me, and it's absolutely worth it to keep up the collection. One major benefit of the game is that it travels well. If I go to a conference or something similar, I can pack 2 decks and 2 scenarios in a corner of my bag and get the break I need from work after the conference papers finish each evening. All I need is a decent floor space or desk space and I can play, so crappy hotel rooms are no problem!\n> > > \n> > >  \n> > > \n> > > The only problem I get sometimes is when a quest is on the harder end of the scale, as I don't deck build quite as quickly as others (or as often) and so if the decks I'm currently running hit a wall, it can take ages to beat it (so I have still not won against the last two Angmar cycle packs...). Really beastly quests can stump me for ages, and I usually turn to a few favourite decks to beat them.\n> > > \n> > >  \n> > > \n> > > As to the reward of solving a puzzle, that's a big part. The Thing in the Deeps situation, eg, was caused because I couldn't quite hit the right tempo between the two quests stages. The scenario changes completely between Stage 1 and Stage 2, and I kept moving too quickly or too slowly. I switched out one hero (sadly dropping Faramir to add in Mablung) and tweaked one deck to include 4 more allies for defense, and that was all it took to shift the play style to beat it. It was satisfying, and if puzzle solving is a draw then this game has it in spades. It is definitely the case that more recent cycles have tried to avoid insta-kill cards and instead offer a more consistent pressure on decks, and I really do think that the developers are starting to hit a sweet-spot in this respect. It's a sign of maturity for the game, as early cycles were less good at this. I like that even if I get a good board state I can rarely switch off my brain, but I also rarely feel like I lost because I could do nothing to prevent it.\n> > > \n> > >  \n> > > \n> > > Finally, on the rules issue, although the game can be played solo, and sometimes the rules are a little complex in terms of some interactions, you do not need to house-rule to make it work. I don't house-rule at all, and while some combos or cards can evidently be made to be broken (honorable mention to Seastan here among those who show how to break the game, which I find endlessly amusing!), if you don't wanna do that, then don't. The lack of a competitive scene is the final, big draw for me. I used to play 40K in a very competitive club, and I just got bored, because if you didn't play whatever the current power army was, why show up? With this game, I control to a large extent that side of it, and if I don't like a quest, I just don't play it and instead focus on the ones I enjoy.\n> > > \n> > >  \n> > > \n> > > Hope this helps you make your decision. I am also a big fan of LOTR and the extended world, so that obviously draws me in. Now if only they'd release a Faramir hero that usurps Boromir as a powerhouse...\n> > > \n> > >  \n> > \n> > That wasn't verbose at all, and very informative, Thank You!  Okay now I'm really convinced I'll like Lord of the Rings for many reasons my research here has uncovered and I've already discussed so I won't bore you with that further.  Most importantly, you confirmed what I thought about the game.  That it gets better with the later cycles.  I had kind of guessed that as one: all systems evolve and two: one of the designers on another solo game I'm getting into had some design ideas I REALLY liked and came from Lord of the Rings having joined it later in the cycles.  The space consideration and puzzle aspect are HUGE for me and what you said about the difficulty answered some of my most important design questions as well ESPECIALLY coming from someone else who has encountered the WarHammer 40k rules set.  A game, that for me, is all about paying your dues, studying, picking a strategy, adapting tactics on the fly and getting better, which I love, but I was hoping the players mindset wasn't like that everywhere as I've always wanted to learn to paint well.  However, Zombicide Black Plague looks like it could scratch that same itch, is soloable, has 1/8 th the footprint, and gives me a LOT to paint.  Hmmmmm.  You may have just given me a great idea!  Not playing doesn't mean I can't still follow the lore (which I love) Anywho, I digress wildly.  Back on topic however you (and others here as well) have convinced me to give it a go.  I'd like to follow the path of the releases but that's just not available.  What would you suggest for a starting solo kit that would give me the flexibility to puzzle solve?  What are the best of those later sets where the \"kinks\" had been worked out?  Can you help me develop a starting set, so to speak?  I'm liking the look of the Lost Realm and Angmar Awakened cycle, (all currently available.) but surely I'll need some cards from preceding sets right?  Especially since you just said that (along with CrusaderLord) the last two cycle packs were pretty beastly right?  So maybe that's not the best starting point?  So any suggestions as to kit?  Also am I right that if I play two decks as most suggest, that I'll definitely need two core sets?  Thanks again for all the help!  : ) \n> > \n> >  \n> \n>  \n> \n> I play two-handed solo, and I get by with only one core set.  Usually, my decks focus on different spheres, so there's very little (if any) overlap between the two.  The core came with fewer than three copies of some desirable cards, but it's quite possible to make do without, and I certainly wouldn't recommend buying a second core set simply because you're playing two-handed!  (If you're playing 3-4 decks, or if you really want extras of those cards regardless of how many decks you're playing, on the other hand...)\n> \n>  \n> \n> Also, you may already know this from your research (and I apologize if it's already been mentioned), but adventure packs require the corresponding deluxe expansion in order to play them (except Mirkwood cycle, which just needs the base set).  For this reason, if you're looking for the best value, you may want to start with a cycle where both the deluxe expansion quests and a few of the adventure packs appeal to you.\n> \n>  \n\nGot it thanks!  Only planning one core set as I'm probably only going to play two decks.  Are you saying that it's not really a good idea to play multi-sphere decks?  So one tactics/spirit and one leadership/lore to cover all bases isn't great?  I didn't know that adventure packs required certain deluxe expansions but the online retailers very kindly point that out before you order thankfully!  So far my starting kit is:  One core the Lost Realms / Agmar cycle and I'm leaning heavily towards Grey Haven / Dream chaser with The Ruins of Belegost for a kind of dugeon crawl feel.  If I can only play two one sphere decks they will probably be Tactics / Spirit.  Do you think that's a good start?  Thanks again for your help!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478252","commentId":2478252,"userName":"xodarap","timestamp":1477621710,"content":">  \n> \n> > I hadn't made the exact link that adventure packs = stuff to deck build with and Deluxe Expansions = stuff to play, is that right?  Also I've now read this in several threads, why is being Dwarf heavy a bad thing?\n> \n> Both deluxe expansions and adventure packs contain a mixture of player cards and quests. Specifically, a deluxe contains 3 quests and more player cards, whereas an adventure pack contains one quest and 10 different player cards including the hero. Additionally, adventure pack quests will include some generic encounter sets found in the preceding deluxxe expansion as well as the quest-specific one, so you need the deluxe to play those quests.\n> \n> As to being Dwarf-heavy, there's nothing wrong with Dwarves other than some players find Dwarf decks boring, but some of the Dwarf cards (certainly most of the heroes in the Hobbit Sagas) are really only useful in a dedicated Dwarf deck, so you don't get much flexibility out of them.\n> \n>  \n\nOkay, I think I understand.  So my above kit looks okay then for a starting solo player?  I was going to avoid Sagas entirely as they seem to change the game somewhat and I'm not really sure what they add for someone who isn't playing with a deep knowledge of the Middle Earth story and for whom, really doesn't have that as a motivator to play.  I'm interested in the mechanisms and exploration.  Thank You!  : )"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478303","commentId":2478303,"userName":"JJ48","timestamp":1477624340,"content":"> Got it thanks!  Only planning one core set as I'm probably only going to play two decks.  Are you saying that it's not really a good idea to play multi-sphere decks?  So one tactics/spirit and one leadership/lore to cover all bases isn't great?  I didn't know that adventure packs required certain deluxe expansions but the online retailers very kindly point that out before you order thankfully!  So far my starting kit is:  One core the Lost Realms / Agmar cycle and I'm leaning heavily towards Grey Haven / Dream chaser with The Ruins of Belegost for a kind of dugeon crawl feel.  If I can only play two one sphere decks they will probably be Tactics / Spirit.  Do you think that's a good start?  Thanks again for your help!\n\n \n\nSorry, I didn't mean to give the impression that multi-sphere decks aren't a good idea!  (I tend to use a Leadership/Tactics deck paired with a Lore/Spirit deck, myself.)  What I meant is that when playing two-handed, you're probably not going to have two decks which share a sphere (like a Leadership/Lore deck paired with a Leadership/Spirit deck, for instance).\n\n \n\n> Okay, I think I understand.  So my above kit looks okay then for a starting solo player?  I was going to avoid Sagas entirely as they seem to change the game somewhat and I'm not really sure what they add for someone who isn't playing with a deep knowledge of the Middle Earth story and for whom, really doesn't have that as a motivator to play.  I'm interested in the mechanisms and exploration.  Thank You!  : )\n\n \n\nSaga expansions actually don't change the game that much on their own.  You can still play the three expansions in each of the saga boxes with the only change being the addition of an additional hero with a unique sphere, who doesn't count against your three heroes per deck.  However, they also give you the option of playing the quests in Campaign Mode.  In Campaign Mode, you may earn boon cards or burden cards which are added to your deck and carry over to the next game in Campaign Mode. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478458","commentId":2478458,"userName":"xodarap","timestamp":1477641394,"content":">  \n> \n> > Got it thanks!  Only planning one core set as I'm probably only going to play two decks.  Are you saying that it's not really a good idea to play multi-sphere decks?  So one tactics/spirit and one leadership/lore to cover all bases isn't great?  I didn't know that adventure packs required certain deluxe expansions but the online retailers very kindly point that out before you order thankfully!  So far my starting kit is:  One core the Lost Realms / Agmar cycle and I'm leaning heavily towards Grey Haven / Dream chaser with The Ruins of Belegost for a kind of dugeon crawl feel.  If I can only play two one sphere decks they will probably be Tactics / Spirit.  Do you think that's a good start?  Thanks again for your help!\n> \n>  \n> \n> Sorry, I didn't mean to give the impression that multi-sphere decks aren't a good idea!  (I tend to use a Leadership/Tactics deck paired with a Lore/Spirit deck, myself.)  What I meant is that when playing two-handed, you're probably not going to have two decks which share a sphere (like a Leadership/Lore deck paired with a Leadership/Spirit deck, for instance).\n> \n>  \n> \n> > Okay, I think I understand.  So my above kit looks okay then for a starting solo player?  I was going to avoid Sagas entirely as they seem to change the game somewhat and I'm not really sure what they add for someone who isn't playing with a deep knowledge of the Middle Earth story and for whom, really doesn't have that as a motivator to play.  I'm interested in the mechanisms and exploration.  Thank You!  : )\n> \n>  \n> \n> Saga expansions actually don't change the game that much on their own.  You can still play the three expansions in each of the saga boxes with the only change being the addition of an additional hero with a unique sphere, who doesn't count against your three heroes per deck.  However, they also give you the option of playing the quests in Campaign Mode.  In Campaign Mode, you may earn boon cards or burden cards which are added to your deck and carry over to the next game in Campaign Mode. \n> \n>  \n\nAh that clarifies it.  So they give what is usually a one off game a sense of persistence and progression via the boon / burden cards?  Would you recommend them to add to a starting solo kit?  Do I understand you right in that they give you a 4th hero to start with so that means an extra resource each turn right? Thank You!  : )\n\nEdited October 28, 2016 by xodarap"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478477","commentId":2478477,"userName":"Crusaderlord","timestamp":1477643302,"content":"The saga series do have an extra hero who also gains a resource each turn to largely be spent on new specific items that they can use and also can spend on neutral cards.\n\nIn the non saga cycles there are many quests that give you an extra starting ally to help you and who you must protect - this is particularly true in Angmar Cycle. So quite often you will start with 4 characters whichever sets you choose.\n\n \n\nIn terms of your starting kit - personally i prefer the deluxe and cycles over the saga boxes ones - the main reason for this is that i find the cycles are a bit more inventive in their quests and whilst they do follow the settings of the main story they divert into different ideas, while the saga concentrates on you playing the actual story events. \n\n \n\nThis said if you go with a core set and jump straight to Lost Realms and Grey Havens then you may find it quite tough as you will have missed out on early player cards that do build up the deck choices. I will agree the quests get better from the Mirkwood Cycles onwards but this was the place where you got some core cards to help you get started. There is no right or wrong answer to this, if you like the theme of a Cycle then you are more likely to play it so i say go with that, but if you do find it too hard you may need to backtrack into Mirkwood Cycle to get some extra player cards. I am not an expert on dual decks as i play one deck so my experiences may not be same. \n\n \n\nA quick aside - if you want to play hobbits as heroes and have support cards for them then you do need the first saga box Black Riders - i only had that one saga box for ages and only now have bought Flame of the West skipping the rest. The Black Riders does have quite good quests in it and are not the hardest out there either.\n\n \n\nMy own favourite cycles are Khazad Dum and Dwarrowdelf and Lost Realms and Angmar - the former is overall not as tough as more recent quests and has some really great quests in it. I have still skipped Heirs of Numenor (high difficulty level) and would not recommend Voice of Isengard (time rules) over other deluxe box sets. Also i would not recommend Hobbit boxes unless you want a load of Dwarf heroes and items - these Hobbit box quests are not the best ones around. Important to note that the Hobbit labelled boxes were not the place to buy the Hobbit based cards and heroes (if you not familiar with the storylines you may make this assumption). \n\n \n\nFinally Ruins of Belegost is an excellent quest theme with lovely cards and artwork but is very very very hard to play as written. Get it yes but don't play it first as it will set a high bar.\n\n \n\nThe above is all my own opinions and wont reflect everyones, my website has some more personal thoughts on the quests - it may help a bit > http://crusadersgolf.co.uk/board-games/lord-of-the-rings-lcg/ [http://crusadersgolf.co.uk/board-games/lord-of-the-rings-lcg/]\n\nEdited October 28, 2016 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2478664","commentId":2478664,"userName":"dalestephenson","timestamp":1477658064,"content":"One thing to remember about tough quests, especially as a beginning player, is that there's no moral shame in easing the difficulty level by adding a resource to each hero during setup, or going all the way to easy mode.  A deck that can't beat an easy quest consistently needs major surgery, but a deck that can't beat a very hard quest may still be fun to play against most of the quests -- and may still be fun to play against a hard quest on an easier difficulty level.  If you find you can't beat Carn Dum with the cards you have, getting more cards in order to beat it needn't be your first priority."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2479599","commentId":2479599,"userName":"xodarap","timestamp":1477689091,"content":"> The saga series do have an extra hero who also gains a resource each turn to largely be spent on new specific items that they can use and also can spend on neutral cards.\n> \n> In the non saga cycles there are many quests that give you an extra starting ally to help you and who you must protect - this is particularly true in Angmar Cycle. So quite often you will start with 4 characters whichever sets you choose.\n> \n>  \n> \n> In terms of your starting kit - personally i prefer the deluxe and cycles over the saga boxes ones - the main reason for this is that i find the cycles are a bit more inventive in their quests and whilst they do follow the settings of the main story they divert into different ideas, while the saga concentrates on you playing the actual story events. \n> \n>  \n> \n> This said if you go with a core set and jump straight to Lost Realms and Grey Havens then you may find it quite tough as you will have missed out on early player cards that do build up the deck choices. I will agree the quests get better from the Mirkwood Cycles onwards but this was the place where you got some core cards to help you get started. There is no right or wrong answer to this, if you like the theme of a Cycle then you are more likely to play it so i say go with that, but if you do find it too hard you may need to backtrack into Mirkwood Cycle to get some extra player cards. I am not an expert on dual decks as i play one deck so my experiences may not be same. \n> \n>  \n> \n> A quick aside - if you want to play hobbits as heroes and have support cards for them then you do need the first saga box Black Riders - i only had that one saga box for ages and only now have bought Flame of the West skipping the rest. The Black Riders does have quite good quests in it and are not the hardest out there either.\n> \n>  \n> \n> My own favourite cycles are Khazad Dum and Dwarrowdelf and Lost Realms and Angmar - the former is overall not as tough as more recent quests and has some really great quests in it. I have still skipped Heirs of Numenor (high difficulty level) and would not recommend Voice of Isengard (time rules) over other deluxe box sets. Also i would not recommend Hobbit boxes unless you want a load of Dwarf heroes and items - these Hobbit box quests are not the best ones around. Important to note that the Hobbit labelled boxes were not the place to buy the Hobbit based cards and heroes (if you not familiar with the storylines you may make this assumption). \n> \n>  \n> \n> Finally Ruins of Belegost is an excellent quest theme with lovely cards and artwork but is very very very hard to play as written. Get it yes but don't play it first as it will set a high bar.\n> \n>  \n> \n> The above is all my own opinions and wont reflect everyones, my website has some more personal thoughts on the quests - it may help a bit > http://crusadersgolf.co.uk/board-games/lord-of-the-rings-lcg/ [http://crusadersgolf.co.uk/board-games/lord-of-the-rings-lcg/]\n\nThanks CrusaderLord!  Okay I think I have my starting kit, which may be difficult, but that's okay actually I LIKE that and the reality is I just have to wait until the earlier stuff becomes available.  My starting kit will be:  One core, The Lost Realm with the entire Angmar cycle, Grey Havens with the entire Dreamchaser cycle, and Ruins of Belegost for the occasional \"Get dem loots! No, RUN you fool!\" experience.  I love the themes (Rangers, Sailors, and tricks with the discard pile what's NOT to love?) and variety of these deluxe sets and have seen trusted reviews on both by marcowargamer who enjoys and recommends them highly (but does so in spite of the difficulty) I'll get as much of the earlier stuff as I can but I want to add A deluxe with all of it's cycle when I do.  I'm completely avoiding Sagas for now, seeing the Deluxe/Cycle combo as the most efficient use of investment.  I'm not too worried about the difficulty because I enjoy that AND because I intend to play the 24 quests completely randomly, building up a score card based on a win/loss setup rather than a linear \"play your way through the adventure\" setup.  Sound good?  What early adventure packs/deluxe sets that are available do you feel have the most important building blocks that are must have for approaching that difficulty though remembering that I don't house rule or use easy mode based on the reasons I listed above? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/232744-buy-or-wait-decision/?do=findComment&comment=2479614","commentId":2479614,"userName":"xodarap","timestamp":1477689605,"content":"> One thing to remember about tough quests, especially as a beginning player, is that there's no moral shame in easing the difficulty level by adding a resource to each hero during setup, or going all the way to easy mode.  A deck that can't beat an easy quest consistently needs major surgery, but a deck that can't beat a very hard quest may still be fun to play against most of the quests -- and may still be fun to play against a hard quest on an easier difficulty level.  If you find you can't beat Carn Dum with the cards you have, getting more cards in order to beat it needn't be your first priority.\n\nThank You I really do appreciate the input!  I actually enjoy the challenge.  I expect to send a few \"scouting runs\" to Carn Dum and always prefer exploratory surgery to just outright playing God.  Part of the draw is to learn what the designer's intentions were, and it's fun to think about why they thought one or the other design was balanced and why they made things the way they did.  Changing bits around to suit myself is, to me, rather the equivalent of photo shopping the Mona Lisa just because I don't like her attitude.  It's not mine to mess with someone else's art, specifically if I'm trying to learn what art IS."}]}