{"url":"https://community.fantasyflightgames.com/topic/232818-surge-timing/","title":"Surge Timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232818-surge-timing/?do=findComment&comment=2465195","commentId":2465195,"userName":"cmabr002","timestamp":1476886674,"content":"> Resolve the surge keyword immediately after resolving any when revealed effects on the card.\n\n \n\n1.  We know that cards are not in the staging area when they resolve their When Revealed effects from prior rulings. \n\n2.  We know that \"After a card is revealed, it is added to the staging area\".  We know this comes before Strider's Path. (We still don't know why, officially).\n\n \n\nDoes this mean that you resolve surge before or after adding the card to the staging area or do you get to choose the order?  Once it is added to the staging area (if you are allowed to choose to put it there before resolving surge), then has it been technically \"revealed\" and I may trigger responses on \"After revealed\" before revealing the next card?\n\n \n\nOr must I reveal the next card before adding it to the staging area, and as such, have not fully \"revealed it\" and cannot trigger any \"After revealed\" effects until later.  This matters.\n\n \n\nLanwyn, for example could theoretically ready before the next card is revealed and the next card could be damage to exhausted characters (which I always thought she could before, but now I'm not sure).  In hindisght I don't think there was a window where she could trigger before surge.\n\n \n\nBefore this new ruling, I never really thought about Surge timing.  I always followed these steps but I think it was incorrect now:\n\n \n\n1. Resolve When Revealed\n\n2. Trigger After revealed\n\n3. Add to staging area\n\n4. Trigger after added to staging area\n\n5. Trigger surge\n\n \n\nCorrect order is????\n\n \n\n1. Resolve When Revealed\n\n2a. Resolve surge or add to staging area\n\n2b. Resolve the one you didn't resolve in 2a\n\n3.  Trigger after adding/after revealed\n\nEdited October 19, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232818-surge-timing/?do=findComment&comment=2465251","commentId":2465251,"userName":"cmabr002","timestamp":1476888104,"content":"I guess \"resolving Surge\" just means that you log in your mind that you will reveal 1 additional encounter card after fully resolving the staging of the card in which Surge appeared.  So the following is what happens:\n\n \n\n1.  Resolve When Revealed\n\n2.  Log that you need to reveal 1 additional card\n\n3.  Add to staging area\n\n4.  Trigger after added to staging area/after revealed\n\n5.  Reveal the 1 additional card"}]}