{"url":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/","title":"Ispiring Presence","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466147","commentId":2466147,"userName":"Gizlivadi","timestamp":1476913189,"content":"https://www.fantasyflightgames.com/en/news/2016/10/19/inspiring-presence/ [https://www.fantasyflightgames.com/en/news/2016/10/19/inspiring-presence/]\n\n \n\nFinally another preview!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466162","commentId":2466162,"userName":"John Constantine","timestamp":1476913647,"content":"The 3 willpower dunedain girl is playable (probably) for her stat box alone (1 copy in the deck 4 shur), as for her ability - brilliant in a 3-4 player game. I would totally play dat.\n\n \n\nStand Together for leadership? I'm not sure it is that justifyable even with paying the tactics part, unless you're facing a Smough or something. \n\n \n\n...I really wanted to see that leadership gondor knight with an insane stat box, but oh well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466167","commentId":2466167,"userName":"Gizlivadi","timestamp":1476913817,"content":"Yeah, I'm actually rather meh about the previewed cards as they're clearly multiplayer cards and their value decreases quite a bit in solo. Would have loved to see the knight too.\n\nEdited October 19, 2016 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466181","commentId":2466181,"userName":"Gizlivadi","timestamp":1476914477,"content":"Also I just noticed the typo in the title. My bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466196","commentId":2466196,"userName":"Kakita Shiro","timestamp":1476915389,"content":"Inspiring Presence would be good for my Elrond/Merry/Pippin deck. Makes those two layabouts worth their salt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466282","commentId":2466282,"userName":"Gunslinger83","timestamp":1476921395,"content":"Anybody else notice the mistake regarding Spirit Beregond? How does he reduce threat by 2 for two attacks when it's a once per round ability?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466338","commentId":2466338,"userName":"PsychoRocka","timestamp":1476924325,"content":"Hold the Line is awesome!!!!! I know that Stand Together is a terrible card but I think that Hold the Line is actually quite good. If you aren't paying the tactics kicker I will admit it is pretty mediocre and just does what Stand Together does in leadership. With those two tactics resources though you could be readying up to three characters.\nEssentially you get to band together three characters to make an uber defense against a nasty foe and then get to ready all three characters to either defend additional attacks or counter attack themselves. Also you are more than likely going to be readying all three characters as they shouldn't take damage with their combined defense stat or at least you would hope not. \nIts probably somewhat of a niche card but in decks that it does work I think it'll actually be really great. Everything Stand Together should have originally been!\n\nSulien seems made for 3/4 player! Even with an extremely multiplayer centric ability though I think she is great. Like John said even just with her statline alone and no ability she is very playable and 1 copy will be going straight in my decks. 3 willpower allies are ALWAYS great. She provides that 3 willpower for one resource less than allies like Glorfindel and Gildor as well! (who do admittedly have much better abilities but I use them predominantly for their willpower). Unless you are playing with 3 or more players I doubt you are going to want to use her ability very often as her 3 willpower is better than -1 threat to only two or three locations. In two player she might be useful at times though if you get 4 or more locations in staging which is definitely not unheard of especially for particular quests. \nYou do have to pay a lore resource and exhaust her however so it only seems worth doing if it is actually providing a decent boost so even with four locations in staging I'm not sure if its worth using her ability (1 point more of \"willpower\" than she has naturally).\n\nWe've known what Inspiring Prescence does for a while but **** is it a good card. Using it on Elrond or Gandalf or another high threat hero can boost every other hero in play by +2 attack and +2 defence. Thats insane value in multiplayer and honestly even with its high cost (if you want both effects) I think it is extremely playable and in a wide variety of decks too. \n\nReally impressed by these spoilers! Can't wait to get my hands on this AP. Going to proxy Sulien and put her in my decks tonight  :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466340","commentId":2466340,"userName":"PsychoRocka","timestamp":1476924389,"content":"> Anybody else notice the mistake regarding Spirit Beregond? How does he reduce threat by 2 for two attacks when it's a once per round ability?\n\nI think that they are talking about a hypothetical situation in which you have used both Hold the Line and Inspiring Prescence. So Beregond is helping out with the 3 man defence of Hold the Line then performing a second defence of his own. This still doesn't explain lowering threat twice though because as you said it is once per round! Good Catch!\n\nEdited October 20, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466433","commentId":2466433,"userName":"rsdockery","timestamp":1476934401,"content":"> Unless you are playing with 3 or more players I doubt you are going to want to use her ability very often as her 3 willpower is better than -1 threat to only two or three locations. In two player she might be useful at times though if you get 4 or more locations in staging which is definitely not unheard of especially for particular quests. \n> \n> You do have to pay a lore resource and exhaust her however so it only seems worth doing if it is actually providing a decent boost so even with four locations in staging I'm not sure if its worth using her ability (1 point more of \"willpower\" than she has naturally).\n\n \n\nUnless, of course, you've got Saga Ally Gandalf and Narya in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466502","commentId":2466502,"userName":"John Constantine","timestamp":1476940696,"content":"Hey, guise, how long do you think til' our spanish comrades get their hands on this stuff?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466526","commentId":2466526,"userName":"Flrbb","timestamp":1476943469,"content":"Somewhere I saw the Sulien image before. I think it has similarities to Idraen. I was wondering if we will get her as an ally and what her abilities will be. But even better: a new character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466534","commentId":2466534,"userName":"987654321","timestamp":1476943872,"content":"Cool! But I don't believe we will ever see it for Aragorn cause of his huge threat...in non-Seastan decks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466537","commentId":2466537,"userName":"Flrbb","timestamp":1476944435,"content":"I'd say Sulien won't hit the table often (at least for her ability). As all of you above allready said, that is only viable in 3/4 player game. But imho in a 4 player game you have some sort of auto loss if there is no player who is able to make loction control. So, Sulien will not be that usefull."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466969","commentId":2466969,"userName":"Fingolfin Fate","timestamp":1476971513,"content":"It is interesting to have a 3-willpower ally with an ability requiring exhaustion. Probably fits the Caldara deck I never play.\n\n \n\nI feel Hold the Line could be great. It is funny that some of the double-duty cards feel like they are perfectly alright without the second effect, and it is even too expensive to bother with, but Hold the Line only feels like it makes any sense with the second effect. But if you can afford 2 Tactics resources (which really does not feel like too many), it should be very useful in every quest with high hitting enemies. Even if one of your characters get injured, or even killed, the other two can hit back. A side question, I do not remember from playing Stand Together, such a long time ago, can you distribute the excess damage from the attack whichever way you want?\n\n \n\nInspiring Presence should be good, though my Gandalf, Elrond or Círdan decks usually defend with allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232870-ispiring-presence/?do=findComment&comment=2466998","commentId":2466998,"userName":"PocketWraith","timestamp":1476972646,"content":"> A side question, I do not remember from playing Stand Together, such a long time ago, can you distribute the excess damage from the attack whichever way you want?\n\nYou assign all the damage to one defending character."}]}