{"url":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/","title":"An idea for player side quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466384","commentId":2466384,"userName":"Seastan","timestamp":1476927940,"content":"I love the idea of side quests, but I have a problem with all the player side quests that we have: they don't do anything until you finish them. The quests we got in the Angmar Awakened cycle all have triggers upon completion, and so far all the spoiled side quests we've seen for the upcoming Haradrim cycle have to be in the victory display.\n\n \n\nThe reason I don't like them and never play them is because most of the time, if I am completing quest stages, it means I must have the game somewhat under my control. So while the effect can be quite powerful, it isn't really needed in order for me to win. I'd rather fill my deck with cards like feint, that help be prevent a character from being destroyed, or spirit Bofur, who can help me quest successfully when I would have failed.\n\n \n\nThere is no reason why side quests can't have instant positive effects when you play them. But they must be properly balanced, because if they have a positive passive effects then people will just put them in play and never explore them.\n\n \n\nHere's an example of a side quest I'd play:\n\n \n\nnuRk2TR.jpg [http://i.imgur.com/nuRk2TR.jpg]\n\n \n\nThis side quest provides an effect that helps me when I'm behind the instant it enters play. It also offers me an incentive to choose it as the active quest. You may think it's overpowered or underpowered, but regardless, this type of player side quest is certainly possible, and I have more ideas for positive-passive side quests for the other spheres.\n\n \n\nThe are other possibilities too. You could have a side quest that has a positive-passive effect, but when a character is destroyed the enemy makes progress on it, and if it gets completed something terrible happens. Or you could have a side quest that grants an immediate bonus but then has a negative effects until it's explored, like this:\n\n \n\nZtulVuh.jpg [http://i.imgur.com/ZtulVuh.jpg]\n\n \n\nThis provides a really great benefit that scales with the number of players, but it carries a heavy risk. These are the kinds of cards I'd love to see more of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466415","commentId":2466415,"userName":"PsychoRocka","timestamp":1476932435,"content":"This is an awesome idea. Really love the design on that first Quest card. At first glance I didn't get it but now that I've read it properly and get how it works I think it is really clever. I really like the idea of a stronger player side quest that enemies place progress on and that you want to avoid clearing because it does something awful if it is explored. Ones that have a strong enter play effect but are then detrimental until you clear them like the one above are also really cool. \n\nAs much as I totally see where you are coming from and even agree to an extent I feel like the whole reason the effects of a side quest are so powerful and they are so cheap to play is because the trade off is that you have to clear the side quest to receive the effect. Maybe there could be player side quests that provide both? A decent effect that is instant and is worth the initial investment as well as an ability that triggers when you clear the side quest. This way you would have more incentive to play them and an immediate boost as well as a stronger boost once you clear it?\n\nOr of course we could just have side quests like the ones we already have as well as these ones that always provide a boost. Either way though really like the idea and hope that we do get some side quests of this nature at some point!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466498","commentId":2466498,"userName":"John Constantine","timestamp":1476940527,"content":"The tactics one is an interesting concept. I see it as one-timer. however. I mean, doubtfully players are gonna quest to keep that -1 defense thing afloat, unless it's a combat quest and there is not much else to do. Maybe just put a Time keyword on it and be done with it? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nI'm not sure I dig the X cost on the second side quest. All players suffer from failed questing in the future, the quest itself is gonna be equally hard to beat with those 9 progress as you reveal 1 encounter card per player each quest phase. So why price it with X?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466519","commentId":2466519,"userName":"Flrbb","timestamp":1476942756,"content":"I do like your ideas. Execpt the two examples you gave seem to be very powerfull.\n\nAnother concept would be to\n\na) let them cost more (e.g. return an encounter side quest to the staging area, exhaust all *Ranger* characters, or simple: I think the 1 cost of that tactics example is to low)\n\nb) also have negative tradeoffs, while they are in game.\n\nBesides, another idea(!):\n\nWhat about effects (from further APs) to return sidequest into the stagin area (or the encounter deck)? For those encounter side quests that would be a pain in the a**."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466523","commentId":2466523,"userName":"Flrbb","timestamp":1476943247,"content":"A lore one with tradeoffs and most probably not ballanced, yet:\n\nCost: 0\n\nSphere: Lore\n\nTitle: Plague\n\nQuest points: X\n\nText:\n\nCannot be the active quest. Quest progress can only be placed upon by its own effect.\n\nResponse: when entering the game each player may search his deck for a healer character.\n\nForced: At the end of the round, each (non objective) character get one damage.\n\nResponse: whenever a charater is healed by one or more points, add one progress here.\n\nX is double the number of heroes in game.\n\nResponse: when this sidequest leaves play heal all characters in game.\n\nOk, have to admit: quite a lot text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466552","commentId":2466552,"userName":"John Constantine","timestamp":1476945616,"content":"> Forced: At the end of the round, each (non objective) character get one damage.\n\n \n\n:blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466592","commentId":2466592,"userName":"Flrbb","timestamp":1476948667,"content":"> :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]\n\nYea. Didn't I say quite unbalanced?! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nThere should be an effect which has to to with healers. Dunno what exactly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466597","commentId":2466597,"userName":"John Constantine","timestamp":1476948997,"content":"Replace Forced effect at the end of the round with Time effect, if quest is not cleared until time expires - everyone takes damage?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466684","commentId":2466684,"userName":"PsychoRocka","timestamp":1476955681,"content":"unbalanced but extremely thematic for a card that is representing a plague!\n\ndamage every turn, healers more prevalent during times of plague, once the plague has been researched/dealt with enough a cure is found/the plague passes etc\n\nEdited October 20, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466854","commentId":2466854,"userName":"PocketWraith","timestamp":1476967535,"content":"> The reason I don't like them and never play them is because most of the time, if I am completing quest stages, it means I must have the game somewhat under my control.\n\nMost regular quest stages have more than 4 (or 6) quest points.\n\n \n\nIn general, I'm in favour of additional variety in my player cards, so in principle your idea might be a decent one, but I'd be more convinced if the two examples you gave weren't so overpowered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466956","commentId":2466956,"userName":"Seastan","timestamp":1476971197,"content":"> This is an awesome idea. Really love the design on that first Quest card. At first glance I didn't get it but now that I've read it properly and get how it works I think it is really clever. I really like the idea of a stronger player side quest that enemies place progress on and that you want to avoid clearing because it does something awful if it is explored. Ones that have a strong enter play effect but are then detrimental until you clear them like the one above are also really cool. \n> \n> As much as I totally see where you are coming from and even agree to an extent I feel like the whole reason the effects of a side quest are so powerful and they are so cheap to play is because the trade off is that you have to clear the side quest to receive the effect. Maybe there could be player side quests that provide both? A decent effect that is instant and is worth the initial investment as well as an ability that triggers when you clear the side quest. This way you would have more incentive to play them and an immediate boost as well as a stronger boost once you clear it?\n> \n> Or of course we could just have side quests like the ones we already have as well as these ones that always provide a boost. Either way though really like the idea and hope that we do get some side quests of this nature at some point!\n\n \n\nThanks for the feedback!\n\n \n\n> The tactics one is an interesting concept. I see it as one-timer. however. I mean, doubtfully players are gonna quest to keep that -1 defense thing afloat, unless it's a combat quest and there is not much else to do. Maybe just put a Time keyword on it and be done with it? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n>  \n> \n> I'm not sure I dig the X cost on the second side quest. All players suffer from failed questing in the future, the quest itself is gonna be equally hard to beat with those 9 progress as you reveal 1 encounter card per player each quest phase. So why price it with X?\n\n \n\nIt costs X because in a one player game it only puts 1 ally into play, but in a 4 player game it puts in 4. Putting a static cost doesn't make much sense.\n\n \n\n>  \n> \n> > The reason I don't like them and never play them is because most of the time, if I am completing quest stages, it means I must have the game somewhat under my control.\n> \n> Most regular quest stages have more than 4 (or 6) quest points.\n> \n>  \n> \n> In general, I'm in favour of additional variety in my player cards, so in principle your idea might be a decent one, but I'd be more convinced if the two examples you gave weren't so overpowered.\n> \n>  \n\n \n\nWell, I disagree with \"so overpowered\" given the similar effects that we already have in the game, but the point here was not their power level so much as the concept."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2466981","commentId":2466981,"userName":"John Constantine","timestamp":1476971846,"content":"> It costs X because in a one player game it only puts 1 ally into play, but in a 4 player game it puts in 4. Putting a static cost doesn't make much sense.\n\nIt actually does, as the real cost of this sidequest is the hurt for questing unsuccesfully. There are numerous player cards that affect each player, but are not paid with X, where X is the number of players in the game. Heck, we have qusts like Gather Information, Double Back, Delay the Enemy, Send for Aid, all affect each player, yet all have a static cost. It's not all that cost what you pay for playing a card in resources. If you wanna make things fair, make each player spend 1 resource for this event, not tax a single player for all of em."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2467017","commentId":2467017,"userName":"dalestephenson","timestamp":1476973250,"content":"That's a good idea -- have the quest cost zero, but have the ability be \"each player may pay one resource to play one ally of up to cost 3 from their hand.\"  Spread the wealth, spread the cost.  (I think the risk is too heavy for the benefit for the card, but that's a separate issue.)\n\n \n\nI agree that these are interesting designs and wouldn't object to seeing side-quests on this principle.\n\n \n\nIt's a fair point that current side quests only offer benefit if you can make quest progress, and offer no immediate help if you can't, with the sole exception of the unpopular Delay the Enemy.  On the other hand, the benefit of completed side quests (aside from synergy with player cards that want them in the victory display) hasn't necessarily been keyed to help with questing.  Gather Information and Send for Aid could be used for questing help, but when I've used them I'm usually digging out help for combat.  Delay the Enemy targets enemies.  Double Back targets threat.  Scout Ahead is useful for planning questing phases, but high threat is a minor consideration when I decide what to remove.\n\n \n\nOf the spoiled upcoming player quests, Explore Secret Ways directly helps questing, The Storm Comes could be used for combat help, and Keep Watch explicitly only helps combat.  Of course, that quest is only available in the most combat-capable, weak-questing sphere...\n\n \n\nThere's three kind of quests where I particularly like side quests as a sideboard:\n\n \n\n1) Quests with a less strenous setup stage before reaching the tough part of the scenario.  Gives more time to build up and overquesting is not a worry.\n\n2) Stages resolved by encounter card removal rather than progress.  Since I need to quest successfully anyway to avoid threat gain, I like to put that progress to good use during a boss fight.\n\n3) Battle/Siege questing with a strong questing deck -- it's nice to do regular questing while I build up my combat prowess.  It's especially nice in Into Ithilien to nerf Southron Company."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2467026","commentId":2467026,"userName":"donkler","timestamp":1476973466,"content":"It would be rad if side quests were something that only one player could go on and it gave them a separate staging area like they were on a different stage of the main quest. It wouldn't work so well for many of the quests though where the encounter cards need to interact with a specific enemy, location, or objective in the staging area.\n\n \n\nHow they function now, I think that side quests are always going to be entirely quest dependent. Conflict at the Carrock is the perfect use case, although I think there have been plenty of quests in the Dream Chaser cycle where you can spare a few rounds to knock out some side quests before you need to do a huge sprint later on. I'm hoping the Harad cycle is going to have some similar quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2467135","commentId":2467135,"userName":"Seastan","timestamp":1476977652,"content":">  \n> \n> > It costs X because in a one player game it only puts 1 ally into play, but in a 4 player game it puts in 4. Putting a static cost doesn't make much sense.\n> \n> It actually does, as the real cost of this sidequest is the hurt for questing unsuccesfully. There are numerous player cards that affect each player, but are not paid with X, where X is the number of players in the game. Heck, we have qusts like Gather Information, Double Back, Delay the Enemy, Send for Aid, all affect each player, yet all have a static cost. It's not all that cost what you pay for playing a card in resources. If you wanna make things fair, make each player spend 1 resource for this event, not tax a single player for all of em.\n> \n>  \n\n \n\nI do like like your suggestion, and you hit on a good point with the other side quests. Their effect gets better with more players, while the cost of playing the quest stays constant and cost of completing it arguably goes down (I find it's easier to get a big burst of questing in multiplayer vs. solo). This is another issue I have with them.\n\n \n\nAnother point I forgot to mention in the original post is that I sometimes see a side quest get played, but then the main quest is too pressing (e.g. any quest with Time, but there are more examples) and it just gets ignored for the rest of the game. This tends to make the side quests too situational, turning them into sideboard cards at best. If instead (or additionally) they had passive effects, they would always have some sort of effect on the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2467144","commentId":2467144,"userName":"Seastan","timestamp":1476977904,"content":"> The tactics one is an interesting concept. I see it as one-timer. however. I mean, doubtfully players are gonna quest to keep that -1 defense thing afloat, unless it's a combat quest and there is not much else to do. Maybe just put a Time keyword on it and be done with it? \n\n \n\nI wanted to be careful when designing these cards so that they would remain true to their identity as side quests. There must be some incentive to choose them as the active quest. By placing Time X on it, it just becomes an event that lasts several rounds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2467221","commentId":2467221,"userName":"Gizlivadi","timestamp":1476979701,"content":"I approve of this new take on side quests. Already more interesting and much easier to play than the ones we'll be getting next cycle!\n\nEdited October 20, 2016 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2468473","commentId":2468473,"userName":"Seastan","timestamp":1477055972,"content":"I made 4 new 2-cost side quests, 1 for each sphere. Here are the Lore and Leadership quests. I'll post the other ones after.\n\n \n\nLore:\n\n \n\nAnother idea for side quest effects. An immediate buff, but only if you've chosen it as the active quest that round and diverted time away from the main quest. And yet, a negative effect upon completion.\n\n \n\nu771IaC.jpg [http://i.imgur.com/u771IaC.jpg]\n\n \n\nIt's a powerful effect for decks that want to avoid engagement, like Dunhere or Haldir, which is a good thematic fit. But is it too powerful? Perhaps. Although you can achieve a better repeatable effect with secrecy and Noiseless Movement for 1 cost per turn (or 0 with Brooch), and you don't have to divert time away from the main quest. So this is a good alternative for decks with a little too much threat for secrecy. Also, with this side quest, you risk scouting too far ahead and revealing yourself to the enemy, although you can mitigate the chances of this if you've already scouted out the encounter deck before with Henamarth or Scout Ahead, or happen to know how much threat is coming via the Palantir. Lastly, since it's not unique, you could have multiple in play. It doesn't make the effect more powerful, since it only activates when it's the active quest, but it would allow you to scout out different \"fronts\" of the enemy, making it less likely you'll scout too far.\n\n \n\nLeadership:\n \n\nThe is one of the ideas I talked about earlier. It gives you an immediate buff, but the enemy can make progress on it, and if they complete it something bad happens. There are lots of things you could do with this concept, this is just one idea.\n\n \n\nEcBSIBo.jpg [http://i.imgur.com/EcBSIBo.jpg]\n\n \n\nIf the enemies can overcome your buffed up army, it will cause your allies to lose morale, and gives the enemy more motivation. You could try to gather up your troops again afterward (side quest is unique, not 1/game), but the enemies retain their attack boost for the rest of the game. And you better not fail a second time...\n\nEdited October 21, 2016 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2469273","commentId":2469273,"userName":"Gunslinger83","timestamp":1477089431,"content":"Curious, have you played much with side quests? I ask because I used to have trouble justifying putting them in my decks as well. While playing Deadman's Dike, the perfect scenario for experimenting with side quests, I learned how awesome they are.\n\nHowever, I've had a tremendous amount of success with them as they are. My favorite is Double Back.....It's pretty easy to drop it on a round that you are reasonablycertain to get four progress....and that 5 threat reduction per player is legit! I've also gotten good use out of gathering information and scout ahead as well....especially in mirlonde or scry decks.\n\nAnd we haven't even seen the high point yet with the new lore Dunedain!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2469438","commentId":2469438,"userName":"Seastan","timestamp":1477098631,"content":"> Curious, have you played much with side quests? I ask because I used to have trouble justifying putting them in my decks as well. While playing Deadman's Dike, the perfect scenario for experimenting with side quests, I learned how awesome they are.\n> \n> However, I've had a tremendous amount of success with them as they are. My favorite is Double Back.....It's pretty easy to drop it on a round that you are reasonablycertain to get four progress....and that 5 threat reduction per player is legit! I've also gotten good use out of gathering information and scout ahead as well....especially in mirlonde or scry decks.\n> \n> And we haven't even seen the high point yet with the new lore Dunedain!\n\n \n\nSure, they can be good in some situations, I'll admit that. They are pretty much the best possible cards to put in your deck against Nightmare Conflict at the Carrock.\n\n \n\nBut I'm often in the situation where a) I'm taking a deck that I've built up against a bunch of different quests, or b) I'm taking my deck up against a quest I've never played before. And in those cases, I don't want to have cards in my deck that are heavily quest-specific.\n\n \n\nThe new Lore hero solves one problem with the current side quests: the 1/deck problem. We'll see if it's enough to make me like them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2470072","commentId":2470072,"userName":"Seastan","timestamp":1477164886,"content":"Tactics & Spirit\n\n \n\nc9SLPde.jpg [http://i.imgur.com/c9SLPde.jpg]\n\n \n\n \n\nKWz6sVB.jpg [http://i.imgur.com/KWz6sVB.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481374","commentId":2481374,"userName":"sappidus","timestamp":1477857404,"content":"> I love the idea of side quests, but I have a problem with all the player side quests that we have: they don't do anything until you finish them. The quests we got in the Angmar Awakened cycle all have triggers upon completion, and so far all the spoiled side quests we've seen for the upcoming Haradrim cycle have to be in the victory display.\n> \n>  \n> \n> ...\n> \n>  \n> \n> There is no reason why side quests can't have instant positive effects when you play them.\n\nThe ideas you've put forth in this thread have been quite interesting, but I wanted to bring up one mechanicothematic reason that side quests have been the way they are: when you decide to delve into a side dungeon in, say, some video game RPG, you usually don't get a reward until you, well, fight through the dungeon.\n\nThat's why I don't really mind the extant design concept. Yes, they can make things harder for a while as you try to get through them instead of making progress on the real quest. But the carrot at the end of the stick can be designed to be sufficiently rewarding to make it feel worth it. Whether one thinks the current set of side quests are in fact rewarding enough is a separate issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481434","commentId":2481434,"userName":"John Constantine","timestamp":1477861471,"content":"I have a feeling that Hide is overpriced. Putting a steep price on something with disadvantage - that something must have a really good benefit. And -4 threat doesn't files like it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481483","commentId":2481483,"userName":"Seastan","timestamp":1477867261,"content":">  \n> \n> > I love the idea of side quests, but I have a problem with all the player side quests that we have: they don't do anything until you finish them. The quests we got in the Angmar Awakened cycle all have triggers upon completion, and so far all the spoiled side quests we've seen for the upcoming Haradrim cycle have to be in the victory display.\n> > \n> >  \n> > \n> > ...\n> > \n> >  \n> > \n> > There is no reason why side quests can't have instant positive effects when you play them.\n> \n> The ideas you've put forth in this thread have been quite interesting, but I wanted to bring up one mechanicothematic reason that side quests have been the way they are: when you decide to delve into a side dungeon in, say, some video game RPG, you usually don't get a reward until you, well, fight through the dungeon.\n> \n> That's why I don't really mind the extant design concept. Yes, they can make things harder for a while as you try to get through them instead of making progress on the real quest. But the carrot at the end of the stick can be designed to be sufficiently rewarding to make it feel worth it. Whether one thinks the current set of side quests are in fact rewarding enough is a separate issue.\n> \n>  \n\n \n\nExcept that 17 of the 18 currently existing encounter side quests have passive effects that are active whether or not you choose them as the side quest for the round. I don't see why those can work mechanically/thematically while player side quests with similar effects couldn't.\n\n \n\n> I have a feeling that Hide is overpriced. Putting a steep price on something with disadvantage - that something must have a really good benefit. And -4 threat doesn't files like it.\n\n \n\nI think you just need to experiment a little to see why Hide would be good. With Arwen as your sole spirit hero you could start at 23 threat and then have six cards in your deck that could drop you into secrecy on turn 1 (3 Hide and 3 Elrond's Council). That opens up a lot of deckbuilding space, not to mention the things you could do with the other decks that are also benefiting from the threat drop. With a leadership hero you could include Dunedain Message and make the immediate threat drop even more consistent (or just use Thurindir). And the only drawback is if you decide not to keep Hiding, which you can do as long as the main quest isn't rushing you. If you ask me, I probably under-costed this one or made the threat drop too big."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481697","commentId":2481697,"userName":"John Constantine","timestamp":1477892538,"content":"Clearing a side-quests takes effort, and is probably not going to be done in one turn, especially if you play it early on. I don't wanna to pay 2 for something that will hamper my progress for two or more turns. If we consider that it'll take us several turns to clear it, the threat increase at the end of the round kinda mitigates the benefit. Also, you can't have more than 1 of those in play at the time (well, you can, but good luck keeping up with them).  If you ask me, 3 cost event that would lower each player's threat by 4 would be probably worth it. But cost 3 side quest that would force you to quest on it for several turns after? Nah."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481883","commentId":2481883,"userName":"Seastan","timestamp":1477918371,"content":"> Clearing a side-quests takes effort, and is probably not going to be done in one turn, especially if you play it early on. I don't wanna to pay 2 for something that will hamper my progress for two or more turns. If we consider that it'll take us several turns to clear it, the threat increase at the end of the round kinda mitigates the benefit. Also, you can't have more than 1 of those in play at the time (well, you can, but good luck keeping up with them).  If you ask me, 3 cost event that would lower each player's threat by 4 would be probably worth it. But cost 3 side quest that would force you to quest on it for several turns after? Nah.\n\n \n\nSo what cost would you put on it? If you think 2 or 3 is too expensive, I guess you want it to cost 1 or 0? But this enables any deck with 24 threat and a spirit hero to start in secrecy. I think that just serves to make Spirifindel even better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2481995","commentId":2481995,"userName":"Lecitadin","timestamp":1477923364,"content":"There HAS to be a sidequest that lets you play with faced up encounter cards while it's active.\n\nEdited October 31, 2016 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/232886-an-idea-for-player-side-quests/?do=findComment&comment=2482136","commentId":2482136,"userName":"John Constantine","timestamp":1477927950,"content":"I would cost it 1, but limit it 1 per deck or something. An alternative restriction might be brokered to facilitate a cost less than 2."}]}