{"url":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/","title":"Oh am I a fool...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469564","commentId":2469564,"userName":"shosuko","timestamp":1477109669,"content":"I swear, every time I play this game I do something wrong...  I was against Dungeons Deep and Caverns Dim.  My partner and I are playing Dwarf themed decks which is a bit of a challenge with my limited card pool, but we're doing well.  These aren't the worst quests to do.  We get to DDaCD and I skip over reading the rule book, instead inferring from the cards how the riddle mechanic works.  It is a pretty straight forward mechanic anyway...\n\n \n\nSo we get bashed, and hard...  We were not expecting so much to come from it, but flipping 2 cards each per quest phase was a lot to handle...  We go out through the second or third turn on a few runs.  We take a break and consider what options we have.  Noticing how much the riddles thin out the deck we throw in some cards that play well from the discard, still staying true to our dwarven loyalty (zero non-dwarf characters) and things look promising... but we die out again...\n\n \n\nA day or two after our crushing defeat I decide to check out some of the tactics people have used for this quest...  and then I read the rules...\n\n \n\nYou do EITHER the card OR the riddle, not both... omg -_- [//content.invisioncic.com/Mfantflight/emoticons/default_sleep.png]  I am blonde as can be...  Now I have to wait till our next session Wednesday next week to have another go, where I'm 1000% confident we'll complete the quest with honors and head into the 2nd half of The Hobbit quests.\n\n \n\n-------------------------\n\n \n\nWhen I first started playing this game almost every session, especially session where we were victorious in our quest, we found some rule that we played wrong, or some error in our interpretation of the cards...  I thought after this time I had a firm hold on the rules, and made the mistake of not reading the quest specific rules... and fumbled again...\n\n \n\nHow many of you still find you play some rule wrong occasionally as you go into a new quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469575","commentId":2469575,"userName":"GrandSpleen","timestamp":1477111175,"content":"My campaign log is full of asterisks.  Errors are very much a part of the game with me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469613","commentId":2469613,"userName":"shosuko","timestamp":1477114746,"content":"thx, at least I'm not alone ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]  This is actually my first time really venturing out of the core set...  I didn't want to jump around (even though my original purchases did) so every time I got someone to join up with me I'd go through the core set quests again...  I've been through many attempts and starting, and my buddy I'm with now is much more determined to play through with me, as we cooperate very well with our choices in play.  We did the core set and search for gollum, now we're into the hobbit, and doing well enough ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]  No nightmare obviously, but not easy mode either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469654","commentId":2469654,"userName":"NathanH","timestamp":1477121099,"content":"Hah, we played a full afternoon (about 6 attempts) not noticing the same point for that quest, and I was completely furious by the end of it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469789","commentId":2469789,"userName":"Network57","timestamp":1477142956,"content":"I beat my first attempt of the Hobbit saga by using the Erebor Record-Keeper as a chump blocker for the Trolls."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469804","commentId":2469804,"userName":"Gunslinger83","timestamp":1477144318,"content":"Wait until you play scenarios like Deadman's Dike. I think I had something like 9 ongoing card effects to keep track of at one point.\n\nNothing like realizing that you had a Power of Angmar side quest up 3 turns after you played that Will of the West and thus it was an illegal (but irreversible at this point) action."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469822","commentId":2469822,"userName":"sappidus","timestamp":1477145559,"content":"I consider myself a very careful player, but like just about everyone, I still make mistakes all the time.\n\n \n\nIt took me forever to beat Morgul Vale the 1st time, and when I did, I was overjoyed! Then I realized I did something wrong, was crushed, and had to go beat it again... Then in the 2nd \"win\" I realized I did something else wrong, so I had to do it again. Then in the 3rd \"win\" I realized I did something else wrong, so I had to do it AGAIN. For certain personality types, sometimes it's best not to realize these things, heh.\n\n \n\n(I felt this most acutely after an epic battle led to my 1st successful defense of Helm's Deep... Then, for some reason I decided to count the player cards as I was putting them away. This revealed that one of my decks only had 49 cards. After agonizing over this tiny error for a while -- \"You didn't draw to the bottom of the deck! It doesn't matter!\" -- I still felt I had to do it \"for real\", so I went back and took a bunch more tries to redo the **** thing. The whole experience led directly to me not checking s*** after beating Carn Dum, ha.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469826","commentId":2469826,"userName":"Seastan","timestamp":1477145774,"content":"As anyone who watches my youtube channel can attest, I never ever make mistakes.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469834","commentId":2469834,"userName":"krokodiler","timestamp":1477147124,"content":"Well, speaking of Hobbit saga quests: in my first play of the first quest I played solo two-handed and I realized that something's wrong at the end of the first round, when I took saga Bilbo to the play area of my second hand: I had Bilbo from HfG as one of that hand's heroes...\n\nMy main mistake during plays is forgetting about some game effect that is active and I do it quite often :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469841","commentId":2469841,"userName":"PocketWraith","timestamp":1477147704,"content":"> As anyone who watches my youtube channel can attest, I never ever make mistakes.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nMe neither! Any mistakes and annotations pointing out those mistakes are just figments of your imaginations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469860","commentId":2469860,"userName":"Rob_Oz","timestamp":1477149553,"content":"I'm in midst of navigating my way through Storm at Cobas Haven. I'm inching toward victory, but suddenly realize that I forgot to attach a Siege Ship to an unattached Objective card several turns earlier. That Objective card happened to be the one that reduces Archery damage by 4 which I'd been using to protect me for, oh, about several turns. Yeah, I'd been cheating.\n\n \n\nThe Encounter Deck can toss a great deal of cards out on to the table, particularly with 2-4 players. Throw in Quest card effects and it becomes an awful lot to keep track off (Not to mention cycle mechanics like the Ringmaker Time Counters) Mistakes will happen. You're playing the game to have fun. Don't sweat the small stuff.\n\nEdited October 23, 2016 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469874","commentId":2469874,"userName":"Lecitadin","timestamp":1477151067,"content":"Soetimes I forget to set the initial threat of my heroes and start the game with 0 threat. Lucky I always play with the BEST hero if the game, Dunhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469935","commentId":2469935,"userName":"Gunslinger83","timestamp":1477154389,"content":"I've gotten in the habit of carrying bags of red and blue tokens. If a card as ongoing negative effect, I put red token on. If it has ongoing positive effect, I place blue token.\n\nI just remind myself to constantly be scanning all token cards to check if they come into play for current phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2469990","commentId":2469990,"userName":"monkeyrama","timestamp":1477158098,"content":"I'm still not totally sure that my first (and only) win against Helm's Deep in my saga campaign was legal. I can't quite put my finger on it, but I'm pretty sure that I did something wrong with it, And that's usually the case! This game has so many moving parts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470043","commentId":2470043,"userName":"GrandSpleen","timestamp":1477161891,"content":"If someone really were able to develop a fully automated digital version of this game, and the players had to do everything legally, in turn order, and no rewinding.... \n\n \n\nWell, we already think this game is pretty tough.  But just imagine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470179","commentId":2470179,"userName":"dr00","timestamp":1477173300,"content":"i played probably 10 sailing quests before realising sailing tests were mandatory (not optional, as i thought)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470263","commentId":2470263,"userName":"Bullroarer Took","timestamp":1477180701,"content":"If I had a nickel for every mistake I've made the game would be paying me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470347","commentId":2470347,"userName":"Rajam","timestamp":1477187568,"content":"I've never made mistakes in this game and I'll never make them again JRSRkLT.png [http://i.imgur.com/JRSRkLT.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470458","commentId":2470458,"userName":"shosuko","timestamp":1477196277,"content":"I don't feel so foolish now.  Thanks for the support ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]\n\n \n\nAlso - great suggestion for the tokens to mark passive positive / negative effects.  Sometimes you have 3-6 locations / enemies ect out and the passives all mix and are active at certain points...  It's good to have a physical reminder on top of the cards so you don't have to re-read everything.\n\nEdited October 23, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470574","commentId":2470574,"userName":"NathanH","timestamp":1477212458,"content":"I remember the first game we ever played we didn't realize that enemies had hp values, so Aragorn killed Ungoliant's Spawn on his own in the first turn... Eventually one of us drew a Gandalf and realized that if he was dealing 4 damage to something it probably might have more than 1 hp... Oops!\n\n \n\nTo be honest that mistake probably helped us get into the game, because we were playing with starter decks and revealed the Spawn on the first turn, which would normally have annihilated us and would have left us thinking that the game was pretty unfair.\n\n \n\nSome of the quests are brutal for having lots of effects to keep track of. In Pelennor Fields we had to do some rewinding from time to time but all of the effects at least happen at the same times. I doubt we have ever played Battle for Carn Dum correctly. Actually, I doubt I've ever fully understood exactly how Thaurir works..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2470624","commentId":2470624,"userName":"John Constantine","timestamp":1477218999,"content":"So... that numeric value sealed within a shield, just like on your characters, didn't tipped you off earlier? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2471484","commentId":2471484,"userName":"PsychoRocka","timestamp":1477284253,"content":"Mistakes are inevitable with this game. I pride myself on making as few mistakes as possible by always being super attentive and playing with a laminated copy of this reference at my side for all games:\n\nhttp://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf [http://www.kaybee.org/kirk/LoTR_LCG_QuickRef.pdf]\n\nEven this is not foolproof though and like everyone I am prone to mistakes from time to time. It is definitely a million times worse when you make a mistake on a game you have publicly recorded!! :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]:P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nhttps://warriorsofthewestblog.wordpress.com/2016/10/22/warriors-of-the-west-raid-on-the-grey-havens/ [https://warriorsofthewestblog.wordpress.com/2016/10/22/warriors-of-the-west-raid-on-the-grey-havens/]\n\nMade a very silly mistake on my latest turn by turn report but THANKFULLY it is negligible and I definitely still won that game but still a very painful and silly mistake I hoped I was above making!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2471487","commentId":2471487,"userName":"PsychoRocka","timestamp":1477284524,"content":"> Wait until you play scenarios like Deadman's Dike. I think I had something like 9 ongoing card effects to keep track of at one point.\n> \n> Nothing like realizing that you had a Power of Angmar side quest up 3 turns after you played that Will of the West and thus it was an illegal (but irreversible at this point) action.\n\nOr having several encounter side quests in play at once and realising you forgot all about Make Camp's effect and have still been healing damage off characters the last few rounds...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2479855","commentId":2479855,"userName":"xodarap","timestamp":1477705385,"content":"If it makes anyone feel better, Rodney Smith the king of game exposition, made so many mistakes in his play through (which still got me into LoTR by the way) that he re-named himself \"Rodney Mistake\".  True story.  I think the mistakes are part of the journey, also just like MageKnight.  Ya' gots to pay yer' dues.  (true of any game with any depth and tactical detail, I think.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2479863","commentId":2479863,"userName":"Gizlivadi","timestamp":1477706203,"content":"Rodney's videos are fantastic, they were too big part of my entrance to the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2483412","commentId":2483412,"userName":"wolfien8","timestamp":1478012282,"content":"Was playing through the first quest in the Dread Realm and forgot to shuffle the encounter deck after pulling out the locations to select 3 of them. Ended up with 6 locations out and we all paused and my friends were like \"did you shuffle\" and at that point it was like, whelp this sucks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2489756","commentId":2489756,"userName":"CaffeineAddict","timestamp":1478364608,"content":"I've just come to play Storm on Cobas Haven for the first time (I've had it for a few weeks, but i've had no spare time at all for ages to try and play it), and I've literally *just* realised that in solo, you are supposed to control an additional ship objective in sailing quests, not just the Dreamchaser. I've been handicapping myself in all the sailing quests so far without realising. Doh!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233043-oh-am-i-a-fool/?do=findComment&comment=2489982","commentId":2489982,"userName":"shosuko","timestamp":1478376740,"content":"Yeah CA it's like \"WOW this quest is so freakin hard what gives LOTR!!\"  then a week later you're like \"OOOOHHHHHH im dum -_-\" haha"}]}