{"url":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/","title":"Shadow cards, and when they are dealt effects","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/?do=findComment&comment=2473052","commentId":2473052,"userName":"Pinsther","timestamp":1477366210,"content":"I was playing The Road to Isengard quest today and had a Wolf of Isengard engaged with me. He was dealt a shadow card and when he attacked I used Forewarned to discard it. The (never-truly-revealed) shadow card had a Wizardry effect.\nMy question is - was there ever a point that we had to check and see if the shadow card had a Wizardry effect BEFORE I had opportunity to discard it? Or because it was discarded without truly being revealed, did I avoid the Wolf's text entirely?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/?do=findComment&comment=2473126","commentId":2473126,"userName":"NathanH","timestamp":1477374644,"content":"The \"When X is dealt a shadow card\" wording is really awkward. But yeah, if you never flip the shadow card (by discarding it through effect, by killing the Wolf before it attacks, or by preventing the Wolf from attacking) then the effect never resolves. Note that if you do end up flipping the shadow card and then cancel it through for example Hasty Stroke, then the Wolf's effect will resolve."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/?do=findComment&comment=2473154","commentId":2473154,"userName":"PsychoRocka","timestamp":1477377537,"content":"Nah its facedown until you reveal it as part of resolving the enemys attack at which point the effect triggers. You discarded the shadow card before it was flipped and revealed so the Wolf will not make an additional attack or force you to discard a card. You definitely avoided the wolfs text entirely so good job! \n\n \n\nTo be honest the wording used on cards like this is pretty awful so I can definitely understand your confusion! It sounds like you are meant to resolve the effect as soon as shadow cards are dealt out which makes no sense because you cannot see the shadow card until it flips and resolves. It could definitely be worded better to more clearly indicate that you are resolving these effects when you flip and reveal shadow cards not when you deal them out to enemies (as you literally cannot do this as you have no idea yet whether a shadow card has for example the wizardry trait and definitely are not allowed to look at shadow cards until they resolve). One thing that is a give away on this particular card is the word additional. It has to make an attack to begin with for its shadow cards to be \"dealt\" (flipped/revealed) in the first place and then if there is a wizardry effect it makes an additional attack after the first. \n\nEdited October 25, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/?do=findComment&comment=2473156","commentId":2473156,"userName":"PsychoRocka","timestamp":1477377596,"content":"Ah beaten to it by more than half an hour! Thats what I get for having a draft response sitting there for so long! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/233249-shadow-cards-and-when-they-are-dealt-effects/?do=findComment&comment=2478800","commentId":2478800,"userName":"Pinsther","timestamp":1477662404,"content":"Excellent! That was how I hoped it worked, and I couldn't find a concrete answer elsewhere! Thanks for the confirmation, both of you!"}]}