{"url":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/","title":"Ungoliant Spawn in the victory display.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2477986","commentId":2477986,"userName":"legofiddl3","timestamp":1477605923,"content":"I just constructed my first victory display deck and had a question. What do you do on a quest that says grab a specific enemy from the encounter deck or discard pile and add it to the staging area, and it is in the victory display? A specific example would be ungoliant spawn, as it is non unique.\n\nEdited October 27, 2016 by legofiddl3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2478060","commentId":2478060,"userName":"RichardPlunkett","timestamp":1477610045,"content":"Could you give an example of such a quest/target? Because I couldn't find any quest that mentions Ungoliant's Spawn.\n\n \n\nFor this text: \"grab Ungoliant's Spawn from the encounter deck or discard pile and add it to the staging area\", I think the answer is that you do remove it from the victory display and place it in the staging area.\n\n \n\nIn coming to this conclusion, I consider that we generally operate under a \"do as much as you can\" regime. The text described uses the word \"and\" which means we should separately try to do each part, even if we couldn't do every other part. (if the text said \"then\", different rules would apply).\n\nWe know from other rulings that cards can leave the victory pile and there is nothing really stopping them doing that (nothing beyond the usual lack of things causing it).\n\nAlso, there are quite a lot of quests where the initial setup tells us to put something aside, and a later stage tells us to put it into the staging area. Those quests don't say \"grab it from where you put it aside\" because there is a little bit of that already implicit in the instruction to move the card. I think, with the search of the encounter/discard piles having failed, the second half of the instruction now resembles one of these setup instructions, and I don't see why it wouldn't have enough power to move it from the victory display to the staging area.\n\nFinally, note the FAQ entry on Caradhras and the last stage of Redhorn Gate. It just says \"add Caradhras to the staging area\" and has been ruled to work even if Caradhras is in the victory display at the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2478125","commentId":2478125,"userName":"PocketWraith","timestamp":1477614103,"content":"> Could you give an example of such a quest/target? Because I couldn't find any quest that mentions Ungoliant's Spawn.\n\nThe quest is Passage through Mirkwood. It doesn't specify Ungoliant's Spawn, just a Spider, and you have to kill US to win.\n\n \n\nAnd since the victory display is not part of the encounter deck or discard pile (which were specified), I'm pretty sure you just can't win under those conditions. Don't add Ungoliant's Spawn to the victory display in Passage through Mirkwood."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2479776","commentId":2479776,"userName":"Lecitadin","timestamp":1477698252,"content":"From the FAQ :\n\n''(1.29) Victory Display The victory display is a game area where victory points are tracked. Cards in the victory display are considered to be out of play, but are not considered to be a part of the encounter discard pile. Cards in the victory display are not considered “removed from game,” and some card effects may still interact with them.''"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2480065","commentId":2480065,"userName":"RichardPlunkett","timestamp":1477726086,"content":"Ok, so for Passage through Mirkwood, A Chosen Path, there are two different last stages you randomly chose between.\n\nFor 'Beorn's Path', having Ungoliant's Spawn in the victory display is fine, but for 'Don't Leave The Path' you are doomed.\n\nIt reads: \"When Revealed: Each player must search the encounter deck and discard pile for 1 Spider card of his choice, and add it to the staging area. The players must find and defeat Ungoliant's Spawn to win this game.\"\n\n \n\nThis wording only lets you chose spiders that are present in the given areas (encounter or discard). If you have already placed Ungoliant's Spawn in the victory display, and since there is only one in the game, it won't be in those areas, and thus you can't choose to put it into play by this effect.\n\nAlso, your chances of finding and killing Ungoliant's Spawn while it's in the victory display seem to be zero, so you have basically lost.\n\nThis one is a case of 'live and learn', but newer quests don't seem to rely on non-unique cards like this, so it shouldn't be a problem you run into often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2480246","commentId":2480246,"userName":"Lecitadin","timestamp":1477750704,"content":"Yep, Spawn in the victory pile with Don't leave the path means you lose.\n\n \n\nBut once you know it, you're OK for the next times you play the quest.  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2480401","commentId":2480401,"userName":"shosuko","timestamp":1477759222,"content":"Yeah there are a lot of quests where you really need to know what will happen next, so you don't shoot yourself in the foot as you get started.  It could be as simple as knowing the character with attached objective needs to be able to handle a certain kind of check, or knowing a certain non-unique spider who is a 1 off in the quest deck may be required to complete the last stage.\n\n \n\nSo just don't add her to the vic display ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2506905","commentId":2506905,"userName":"Trenloe","timestamp":1479495777,"content":"I've just started playing The Lord of the Rings: The Card Game and this thread has helped me a lot with the final \"Don't Leave the Path\" quest card - thanks.\n\n \n\nOne thing for this question regarding the Ungoliant Spawn - the card doesn't have a \"Victory X\" keyword, so it doesn't have any victory point value and so should never be put in the Victory pile.  Only defeated enemies/locations with a \"Victory X\" keyword should be placed in the victory pile.  At least that's how I'm reading it.\n\n \n\nSo, for the \"Don't Leave the Path\" quest card the \"Ungoliant's Spawn\" enemy should always be available for the players to find and so have a chance to defeat to win the game.  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2506916","commentId":2506916,"userName":"Kakita Shiro","timestamp":1479496309,"content":"> I've just started playing The Lord of the Rings: The Card Game and this thread has helped me a lot with the final \"Don't Leave the Path\" quest card - thanks.\n> \n>  \n> \n> One thing for this question regarding the Ungoliant Spawn - the card doesn't have a \"Victory X\" keyword, so it doesn't have any victory point value and so should never be put in the Victory pile.  Only defeated enemies/locations with a \"Victory X\" keyword should be placed in the victory pile.  At least that's how I'm reading it.\n> \n>  \n> \n> So, for the \"Don't Leave the Path\" quest card the \"Ungoliant's Spawn\" enemy should always be available for the players to find and so have a chance to defeat to win the game.   :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThere are cards outside the core set that allow you to put it there, so it is not outside the realm of possibility merely unlikely."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2507488","commentId":2507488,"userName":"Trenloe","timestamp":1479535452,"content":"Ah right, thanks for the info.  Makes sense.\n\nEdited November 19, 2016 by Trenloe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2507490","commentId":2507490,"userName":"shosuko","timestamp":1479535798,"content":"There is no way to accidentally put the card there.  Any card that puts a non-victory card in the victory display is an action by the player, with knowledge of the card being targeted.  If a player puts Ungoliant in the victory display, they have crafted their own downfall."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233501-ungoliant-spawn-in-the-victory-display/?do=findComment&comment=2509434","commentId":2509434,"userName":"Slothgodfather","timestamp":1479737925,"content":"Since the Victory Display manipulation stuff wasn't introduced until a long time after this quest, I'd just house rule an errata to the quest card to search the \"encounter deck, discard pile and victory display...\".   Other newer quests follow this pattern for important encounter cards that could get manipulated into the victory display. "}]}