{"url":"https://community.fantasyflightgames.com/topic/233682-strider-decks/","title":"Strider Decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233682-strider-decks/?do=findComment&comment=2481460","commentId":2481460,"userName":"Bullroarer Took","timestamp":1477864326,"content":"I'm seeing a lot of 2 hero Strider decks appearing on ringsdb.  Are you people finding them viable solo decks on difficult quests or are they just good support decks in multi-player?\n\n \n\nTIA"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233682-strider-decks/?do=findComment&comment=2481477","commentId":2481477,"userName":"shosuko","timestamp":1477866279,"content":"Wow, I hadn't seen this card yet, as I haven't picked up the newest quest arc... but this would be great for a 2 character secrecy deck...  It's like giving anyone a LoV.  I could see like Lore Aragorn + Spirit Glorfindel going at it with this.\n\n \n\nI can't speak for how powerful the card is, but I can say it looks like a fun way to change up the game.  Rather than fighting against threat cost to include 3 heroes, you can basically LoV any character and run with just 2.  I should pick this set up ^_^ [//content.invisioncic.com/Mfantflight/emoticons/default_happy.png] My partner I typically play with always runs a 2 character deck anyway, so I can be focused easier to take all combat while he plays more quest / control oriented setups.\n\nEdited October 30, 2016 by shosuko"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233682-strider-decks/?do=findComment&comment=2481695","commentId":2481695,"userName":"Flrbb","timestamp":1477891699,"content":"Well, I've tried a bit with some hero variations. IMHO, that card makes a two hero deck way more viable, but still not viable enough not to use three heroes.\n\nIn case of Aragon and Glorfindel you want to have not only LoV in your starting hand, but Stider and Resourcefull too! That is kind of impossible. Otherwise you will have a really bad start.\n\nWith Vanish from Sight you Can play Resourcefull later on, but until then you will be short on resources...\n\nI want to make a two deck hero work, but I failed at building a deck so far. I count on you Guys. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233682-strider-decks/?do=findComment&comment=2481696","commentId":2481696,"userName":"Flrbb","timestamp":1477892083,"content":"Another thought:\n\nI tried strider only solo until now. A Strider deck in multi player might be the same as a Hobbit deck: every other player has to take the load of the additional player (from that Hobbit deck) until the hobbits are set up. Sadly, this is my experience from different style-of-play decks, when the starting threat differs to much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233682-strider-decks/?do=findComment&comment=2481980","commentId":2481980,"userName":"Lecitadin","timestamp":1477922914,"content":"I trtied one or two for solo against nightmare quests... and got crushed.\n\nI think Strider decks maybe more viable for solo when comboed with a trait, like Silvan, Outlands, etc"}]}