{"url":"https://community.fantasyflightgames.com/topic/233670-hero-switcher/","title":"Hero switcher","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233670-hero-switcher/?do=findComment&comment=2481099","commentId":2481099,"userName":"Qaanaaq","timestamp":1477834400,"content":"I have an idea for a hero switcher event. Do you think its a plausible idea? To habe an event which switches heros? Probably hero with the same name would be allowed. Eg starting with sp Eowyn and at some poit swithing to tac Eowyn. Or switch to loragorn, while starting with scorpagorn. Probably only once per game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233670-hero-switcher/?do=findComment&comment=2481112","commentId":2481112,"userName":"Lecitadin","timestamp":1477836265,"content":"I think it's a weird concept (in a good sense) and maybe more profitable in Multiplayer... or in solo Saga, where you could switch the orange spehere hero with the same hero of one of the 4 regular spheres."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233670-hero-switcher/?do=findComment&comment=2481125","commentId":2481125,"userName":"Calvadur","timestamp":1477837058,"content":"I wouldn't like it being limited to the same name. There are just to few heroes it would work with and a few you probably would never switch (lore for spirit pippin e.g.) and it would be a horriic card for a new player. Let's say the card is released in a harad-pack. A new player can play the card with Gimli and Legolas (as they would be in the deluxe iirc and core). Pretty meh, right?\n\nIn general I don't like a card that needs two SPECIFIC cards in my collection to be playable. It would be fine if the heroes \"just\" need to share a trait, if you don't want to allow free switching. Then you will Need rules for possible differences in threat and in General I think it's a Balance wise nightmare. Start with Thurindir and swap him with lore Aragorn?\n\n \n\nApart from these concerns I would never play it. I build my deck around my heroes or the other way around. In any case in 99,9% of the cases I wouldn't want to switch heroes mid game. Of course everyone probably wished at least once he coud sub in Lore Aragorn to drop threat, but would you really Count on that Happening.\n\n \n\n \n\nCreative idea, but I think it would be cooler if it would be worked into a quest that Forces/allowes you to Change heroes and provides the rules for doing so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233670-hero-switcher/?do=findComment&comment=2481180","commentId":2481180,"userName":"Lecitadin","timestamp":1477841100,"content":"We need a card that gives a hero the Hobbit trait so we can use Fast hitch."}]}