{"url":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/","title":"Another question about &#039;Either&#039; (faq section 1.44)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2482835","commentId":2482835,"userName":"philkav","timestamp":1477955186,"content":"So the FAQ tells us that when 2 options are separated by the word 'Either' one of them must be performed in full, if able. I wonder what they mean exactly by performed in full.  Constant Tail [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-ring-maker-cycle/trouble-in-tharbad/constant-tail-r1200] (Trouble in Tharbad) for example says : \"Then, the first player either removes 1 time counter from the current quest or each Spy enemy in the staging area gets +2 threat.png [http://hallofbeorn.com/Images/threat.png] until the end of the phase.\" Can I pick the second option even if there's no Spy enemy in the staging area ? Does it counts as performed in full if the effect does nothing ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2482975","commentId":2482975,"userName":"Seastan","timestamp":1477966060,"content":"\"Each\" requires there to be at least 1. \"All\" can include 0."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2483010","commentId":2483010,"userName":"philkav","timestamp":1477970412,"content":"> \"Each\" requires there to be at least 1. \"All\" can include 0.\n\n \n\nIs that how it works ? Thanks !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2483414","commentId":2483414,"userName":"Seastan","timestamp":1478012331,"content":">  \n> \n> > \"Each\" requires there to be at least 1. \"All\" can include 0.\n> \n>  \n> \n> Is that how it works ? Thanks !\n> \n>  \n\n \n\nhttp://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-4#entry110974 [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-4#entry110974]\n\n \n\n> The difference between ‘all’ and ‘each’ is very significant because ‘all’ can include 0 whereas ‘each’ requires there to be at least 1 target. For example, with a When Revealed effect that read: “All engaged enemies make an immediate attack. Then, each player discards the top card of his deck.” the second effect will always trigger, even if there are no enemies in play. But, if that effect read: “Each engaged enemy makes an immediate attack. Then, each player discards the top card of his deck.” the second effect will only trigger if at least 1 enemy made an attack.\n> \n> Cheers,\n> \n> Caleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2483426","commentId":2483426,"userName":"Seastan","timestamp":1478012594,"content":"I did find an earlier ruling from Caleb that seems to contradict this: http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-4#entry86990 [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-4#entry86990]\n\n \n\n> Treacherous Fog\n> \n> When Revealed: Each location in the staging area gets +1 Threat Strength until the end of the phase. Then, each player with a threat of 35 or higher chooses and discards 1 card from his hand.\n\n \n\n> Treacherous Fog : works the opposite way. It creates a lasting effect (locations in the staging area gets +1 threat strength) that triggers an immediate effect (players with 35+ threat must discard 1 card). Since this lasting effect affect the game state, it will always resolve. Even if there are no locations in the staging area at the time Treacherous Fog is revealed, locations will still get +1 threat strength until the end of the phase. That means if a location is added to the staging area after Treacherous Fog is revealed, it will get +1 threat until the end of the phase. Because the lasting effect of Treacherous Fog always resolves, it also means the \"then\" clause will also always resolve.\n> \n> \n> So, if there are no locations when Treacherous Fog is revealed, it still resolves because it has successfully created a lasting effect. However, if there are no enemies engaged with players at the time Chaos in the Cavern is revealed, it cannot resolve its immediate effect and you should not resolve the \"then\" effect.\n> \n> Cheers,\n> Caleb\n\n \n\nUnless someone can resolve this contradiction, I would recommend going with Caleb's later ruling regarding \"all\" and \"each\".\n\nEdited November 1, 2016 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2483540","commentId":2483540,"userName":"dalestephenson","timestamp":1478017607,"content":"Here's how I'd resolve it:\n\n \n\n1) \"then\" is conditional is on the previous phrase \"doing something\"\n\n2) Doing something right now to \"all\" is doing something, even if \"all\" includes no members.\n\n3) Doing something right now to \"each\" is NOT doing something if \"each\" includes no members.\n\n4) Creating a lasting effect for \"each\" is doing something, even if \"each\" includes no members.\n\n \n\nIn the case of \"each\" enemy making an immediate attack, if there is no \"each\" then nothing is done.\n\nHowever, if it were instead \"each enemy revealed this phase makes an immediate effect\", something is done (lasting effect), even if no enemies are currently present and none happen to be subsequently revealed.\n\n \n\nThe question then becomes whether the threat increase to spies is a \"lasting effect\", or a \"right now\" effect.  If it's the first, then it *is* legitimate to pick without any spies currently in staging -- but any subsequent spies revealed would get +2 threat.  If it's the latter, then you can't pick the threat option without any spies present -- but if there were and you picked it, any subsequent spies revealed would not get a +2 threat increase.  Since the wording is identical to treacherous fog, I'd say it's creating a lasting effect, can be picked even without spies in the staging area, and would increase the threat of any spies revealed after the treachery."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2485797","commentId":2485797,"userName":"Lecitadin","timestamp":1478129796,"content":"Yep, I now know that LOTR LCG stands for: Lord of The Rings Linguistic Card Game!  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2486092","commentId":2486092,"userName":"rmunn","timestamp":1478151472,"content":"> Yep, I now know that LOTR LCG stands for: Lord of The Rings Linguistic Card Game!  :blink: [//content.invisioncic.com/Mfantflight/emoticons/default_blink.png]\n\n \n\nSince Tolkien was himself a linguist*, this seems ... appropriate, somehow.\n\n \n\n* A philologist, to be specific. Philology is called linguistics these days, but in Tolkien's day the term was \"philologist\" rather than \"linguist\". And anyone wants to split hairs and say that the two terms are different because of X, Y or Z... well, you know what? An argument about the meaning of words would be perfectly appropriate here, so go ahead!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2486396","commentId":2486396,"userName":"dalestephenson","timestamp":1478177323,"content":"I'll go ahead.  Philology is a specific linguistic approach that approaches the study of language with emphasis on its history, literature, and context.  There are other approaches.  For example, theories about \"natural language\" would fit squarely under the umbrella of linguistics, but have no place in philology.\n\n \n\nA caveat would be that etymologically, there doesn't seem to be a distinction between philology and linguistics in earlier centuries, and when comparative philology became the first \"scientific\" approach to language study in the 19th century, linguistics was essentially a synonym for that.  But as other approaches became popular in the 20th century, the distinction could be made, and has been made.  Tolkien's approach was definitely philology."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2547096","commentId":2547096,"userName":"SK3LMC","timestamp":1482001413,"content":"My question on this topic is \"what if the first does not need to be done, must the 'or' phrase occur?\"  Dead Man of Dunharrow: \"attach a set aside Overcome by Fear..., or raise your threat.\"  If Overcome by Fear is already attached must I raise my threat by 2?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2547229","commentId":2547229,"userName":"Kakita Shiro","timestamp":1482005991,"content":"> My question on this topic is \"what if the first does not need to be done, must the 'or' phrase occur?\"  Dead Man of Dunharrow: \"attach a set aside Overcome by Fear..., or raise your threat.\"  If Overcome by Fear is already attached must I raise my threat by 2?\n\nIf you cannot attach another Overcome By Fear (legitimately don't know, not looking it up), then you must raise your threat by 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2547232","commentId":2547232,"userName":"SK3LMC","timestamp":1482006154,"content":"Kakita, darn, but thanks for the answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/?do=findComment&comment=2556314","commentId":2556314,"userName":"The Thing In The Attic","timestamp":1482493608,"content":"Hi\n\nI'd say the each in these cases are not time specific or time constrained. The clause \"untill the end of the phase\" extends the card effect to be constantly checking the game state untill the end of the phase. Always looking for a locations to increase threat.\n\nThe full stop after the first clause separates the two clauses so \"then\" is not a condition of the first clause. It's just a list of things that happened in sequence. For it to be conditional it would all have to be re-worded as one sentence with \"if\" at the start ie. Do x untill the end of the phase but If x occurs then do y.\n\nThat's how I understand the card logic"}]}