{"url":"https://community.fantasyflightgames.com/topic/233964-rules-help-yes-i-know-i-should-have-figured-this-out-by-now/","title":"Rules Help (Yes, I know, I should have figured this out by now)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/233964-rules-help-yes-i-know-i-should-have-figured-this-out-by-now/?do=findComment&comment=2487445","commentId":2487445,"userName":"FeloniusBard","timestamp":1478212941,"content":"So last night we're playing 4-player multi through Passing of the Grey Company.\n\n \n\nAnd for probably the 30th time, it came up just exactly how to resolve the \"Either/or\" effects of certain encounter cards. \n\n \n\nThe big one for this quest is there are numerous treachery cards that either force you to re-attach \"Overcome with Fear\" to your threat dial, or something else bad happens. \n\n \n\nThe question always came up, \"If I already have 'Overcome with Fear' attached to my threat dial, am I then forced to choose the second option no matter what?\"\n\n \n\nI know there's some semantics involved here, and that there are some card effects where this is the case. For example, I seem to recall that in cases where it's a \"Do this, then do that,\" if you as a player can't perform the \"Do this\" part of the encounter card, the \"Then that\" never triggers. But is it the same if its a \"Choose Option A or Option B\"? \n\n \n\nIf I can't reattach \"Overcome with Fear\" to my threat dial because it's already attached, am I then forced to choose Option B whether I like it or not?\n\nEdited November 3, 2016 by FeloniusBard"},{"commentUrl":"https://community.fantasyflightgames.com/topic/233964-rules-help-yes-i-know-i-should-have-figured-this-out-by-now/?do=findComment&comment=2487779","commentId":2487779,"userName":"NathanH","timestamp":1478242627,"content":"If you're given a choice, you have to choose an option that does something. Occasionally this can be subtle (there is an interesting discussion on this in the Rules subforum right now) but in this case it is clear. If you can't attach Overcome By Fear, you need to do the other thing."}]}