{"url":"https://community.fantasyflightgames.com/topic/234091-can-you-lose-an-effect-when-this-happens/","title":"Can you lose an effect when this happens?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/234091-can-you-lose-an-effect-when-this-happens/?do=findComment&comment=2490010","commentId":2490010,"userName":"JYoder","timestamp":1478378961,"content":"I have Blood of Numenor a hero. I activate it, giving lots of bonus defense to the hero. A shadow cards says to treat all attachments as blank. Does he lose or retain the bonus defense?\n\n \n\nSeems to me he retains it as I activated it before it would be blank, but not sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234091-can-you-lose-an-effect-when-this-happens/?do=findComment&comment=2490192","commentId":2490192,"userName":"rmunn","timestamp":1478393159,"content":"> I have Blood of Numenor a hero. I activate it, giving lots of bonus defense to the hero. A shadow cards says to treat all attachments as blank. Does he lose or retain the bonus defense?\n> \n>  \n> \n> Seems to me he retains it as I activated it before it would be blank, but not sure.\n\nFAQ section 1.55 says:\n\n \n\n> (1.55) Lasting Effects\n> \n> There are two classes of lasting effects in the game: those created by player cards and those created by encounter cards. Each class is handled differently as follows: A lasting effect created by a player card ability must be calculated at the time that the ability is triggered, and that effect is not recalculated if the game state changes.\n> For example: If a player triggers the Quest Action on Nenya (RM 121) to add Galadriel’s (RM 112) 4 willpower to another hero until the end of the phase, that +4 willpower bonus will not be recalculated if Galadriel’s willpower is increased later that phase.\n\n \nI assume that when you activated Blood of Numenor, that shadow card had not yet been revealed. So you give a bunch of bonus defense to the hero. Then later the game state changes (the text box is blank), but according to the FAQ you do not recalculate the effect at that point. Therefore, he keeps all the bonus defense that you gave him.\n \nFor once, the answer is in favor of the player!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234091-can-you-lose-an-effect-when-this-happens/?do=findComment&comment=2490322","commentId":2490322,"userName":"JYoder","timestamp":1478404556,"content":"Nice! Thx for the FAQ find!"}]}