{"url":"https://community.fantasyflightgames.com/topic/234267-nin-in-eilph-hidden-eyot-quest-advancement/","title":"Nin-in-Eilph - Hidden Eyot + Quest Advancement","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/234267-nin-in-eilph-hidden-eyot-quest-advancement/?do=findComment&comment=2493599","commentId":2493599,"userName":"cmabr002","timestamp":1478606367,"content":"> Q: If there is an active location with a Response effect that triggers when it is explored and the players make enough progress to explore the location and advance to the next stage, when do the players resolve the location’s Response effect?\n> \n>  \n> \n> A: The players should advance to the next stage immediately and resolve any ‘when revealed’ effects on the next stage, then resolve the Response effect on the active location.\n\n \n\n> Response: After Hidden Eyot leaves play as an explored location, place 2 time counters on the current quest\n\n \n\nWhat happens when Hidden Eyot is the active location and you quest enough to clear both the active location and advance\n\n \n\n1.  You place 2 time counters on the next stage because by the time you can trigger Hidden Eyot's response the current quest is the new stage.\n\n2.  You don't get to place any time counters because by the time you trigger the Hidden Eyot's response, the \"current\" quest to which it was referring to is no longer in play even though we have to wait to trigger its response.\n\n3.  Other\n\n \n\nI was able to disprove #2 due to the ruling with Legolas and Blade of Gondolin.\n\n \n\n>  \n> \n> Response: After attached hero attacks and destroys an enemy, place 1 progress token on the current quest.\n\n \n\n>  \n> \n> Q. If Legolas has a Blade of Gondolin (CORE 39) and destroys an enemy, can he trigger his response, finish off a quest card, and still place progress tokens on the next quest with the Blade of Gondolin’s response?\n> \n>  \n> \n> A: Yes. Quest cards are immediately replaced as soon as players place enough progress on them, and this replacement does not interrupt the current round sequence. If the current quest card only needs 1 progress on it, then a player could also trigger the Blade’s effect first, and then Legolas’ in order to maximize the number of progress tokens placed.\n\nEdited November 8, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234267-nin-in-eilph-hidden-eyot-quest-advancement/?do=findComment&comment=2493615","commentId":2493615,"userName":"RichardPlunkett","timestamp":1478607315,"content":"Pretty sure it's Option 1.\n\nTerms in a response (like \"current quest\") are pretty consistently resolved when you are initiating the Response, and from the ruling you quoted, that is after the quest has been replaced. At that point in time \"current quest\" is well defined and just happen to be the next stage.\n\nIt is common for the game state to have changed between a Response meeting its trigger condition and the relevant response window being open to allow it to being triggered by the players. Unless the text has become incoherent we just resolve it as best we can when it's time comes around.\n\n \n\n(This is all likely excluding the small set of Responses that behave like Disrupts, such as cancellation or replacement effects)."}]}