{"url":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/","title":"Blood of Gondor, hidden cards engagement","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2494106","commentId":2494106,"userName":"kofdaniel","timestamp":1478624359,"content":"In the Blood of Gondor quest, after activating Faramir's Action (Turn a hidden card face up and if its an enemy deal 3 damage to it), the enemy is killed before the forced effects of engagement? they engage me before they die?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2494135","commentId":2494135,"userName":"cmabr002","timestamp":1478625204,"content":"I'm going to quote both effects for everyone's reference, but it looks to me like they occur at the same time and are both Passive effects.  This would mean you presumably could choose the order in which they resolve.  If you choose to deal damage first (and this kills it), then I would suppose it would technically never have engaged you, but I dunno.  Alternatively, it would die, go to the discard pile, then come back from the grave...\n\n \n\nFaramir: Combat Action: Exhaust Faramir to turn a hidden card faceup.  If that card is an enemy, deal 3 damage to it.\n\n \n\nHidden Card Rules: When a player is instructed to turn his hidden cards faceup, he turns each hidden card in his play area faceup one at a time. If a player turns a hidden card faceup and it is an enemy, he immediately engages that enemy.\n\nEdited November 8, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2494269","commentId":2494269,"userName":"NathanH","timestamp":1478628536,"content":"I've always played that you can deal the damage first, based on the principle that it makes sense thematically and I couldn't see any reason why mechanically it should be one way or the other."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2494315","commentId":2494315,"userName":"RichardPlunkett","timestamp":1478630125,"content":"I don't agree. I think you are engaged, albeit very briefly.\n\n\"Exhaust Faramir to turn a hidden card faceup.  If that card is an enemy, deal 3 damage to it.\"\n\nIt seems to be that we have to do the \"turn a hidden card faceup\" before we do the \"deal 3 damage\". And part of turning a hidden card faceup is \"he immediately engages that enemy\".\n\n \n\nSo it seems to me the enemy gets engaged before it dies. If the enemy had a forced effect on it, then that forced effect wouldn't happen because the enemy would be dead before it could trigger, but it seems clear to me that any forced or regular responses on other cards that care about engagement would have their trigger condition met (eg Sam Gamgee, Mablung) and could proceed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2494391","commentId":2494391,"userName":"rsdockery","timestamp":1478631630,"content":"Seems to me you'd use the same logic as Thalin. When you kill an enemy as it's revealed, that preempts When Revealed effects and keywords like Doomed and Surge, and it also means the enemy never actually enters the staging area. I'd think the special rules for hidden cards would be treated as framework effects, just like adding a revealed card to staging.\n\n \n\nNow, if Faramir had read \"Exhaust Faramir to turn a hidden card faceup. Then, if that card is an enemy, deal 3 damage to it.,\" you'd fully resolve the normal framework effects for turning hidden cards faceup before damaging the enemy. (Likewise, if Thalin had read \"While Thalin is committed to a quest, deal 1 damage to each enemy after it is revealed by the encounter deck,\" you'd fully resolve the normal effects of revealing an encounter card.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234287-blood-of-gondor-hidden-cards-engagement/?do=findComment&comment=2495280","commentId":2495280,"userName":"alogos","timestamp":1478690378,"content":"I remembered seeing that in my faq:\n\nQ: Regarding the hidden cards mechanics of Blood for Gondor, does the enemy is considered revealed when turned face up? Will Faramir prevent the enemy from being revealed and/or engaged when using his ability?\nA: In The Blood of Gondor, enemies that are turned face-up are not \"revealed.\" If a player uses the Faramir objective-ally to turn a hidden card face-up and it turns out to be an enemy, Faramir will deal 3 damages to that enemy before it is considered to be engaged. If the enemy is destroyed by that effect, then it never engages.\nhttp://sdajce.forumactif.org/t2616-question-le-sang-du-gondor-carte-cachee-et-engagement-au-combat-reponse-officielle#43390  [http://sdajce.forumactif.org/t2616-question-le-sang-du-gondor-carte-cachee-et-engagement-au-combat-reponse-officielle#43390%C2%A0](French)"}]}