{"url":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/","title":"Ranger Spear (The City of Corsairs)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2500930","commentId":2500930,"userName":"JanB","timestamp":1479124651,"content":"Hi Fellowship,\n\n \n\nin germany \"The City of Corsairs\" was released last week. From this pack i picked the \"Ranger Spear\".\n\n \n\n>  \n> \n> Attachment. Cost: 1.\n> \n> Item. Weapon.\n> \n> Attach to a Ranger character. Restricted.\n> \n> Attached character gets +1  (+2  instead when attacking an enemy with an attachment on it).\n\n \n\nWow .. awesome card for trapped enemies. Also effective against enemies with \"Secret Vigil\" attached.\n\nAt the moment, there are no more player attachments which are attached to enemies.\n\n \n\nAfter reading the rulebook and FAQ for the \"Guarded\" keyword i think every enemy who guards a Guarded-card has an attachment, right?\n\nEdited November 14, 2016 by JanB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2500938","commentId":2500938,"userName":"cmabr002","timestamp":1479126028,"content":"Okay, this topic is something that has bothered me for a long time.  There is a discrepancy in the rules, and I've for the most part resolved it how it seems it should be resolved.\n\n \n\nCore Set Rules:\n \n\n> The guarded keyword is a reminder on some objective cards to reveal and attach the next card of the encounter deck to the objective when it enters the staging area from the encounter deck, and place them both in the staging area. The objective cannot be claimed as long as any encounter card is attached.\n\n \n\nFAQ:\n \n\n> Q: During the Setup for stage 1A of The Necromancer’s Tower (Core 123), should each objective have one encounter card attached to it, or two?\n> \n>  \n> \n> A: One. When you reveal a Guarded objective, you must reveal the top card of the encounter deck and attach it to that objective, guarding it. The additional instruction on The Necromancer’s Tower to “... attach 1 encounter to each objective card” is there as a reminder, so that players know to attach 1 encounter card to each Guarded objective.\n\n \n\nFAQ:\n \n\n> (1.17) Unclaimed Objectives\n> \n>  \n> \n> An unclaimed objective is one that is not currently claimed and under the control of a player. An unclaimed objective can be guarded or unguarded. A guarded objective is treated like an attachment if guarded by an enemy or location, and remains attached to that card until it leaves play, at which point it will return to the staging area. Any unclaimed objective in the staging area that is not attached to a card is considered to be unguarded.\n\n \n\nFAQ:\n\n \n\n> Q: If I use the Response effect on Saruman (VoI 3) to treat an encounter card guarding an objective as out of play, does that mean I can claim that objective because\n> it is free of encounters?\n> \n>  \n> \n> A: No. When a card is considered to be out of play, each card attached to it is also considered to be out of play. Because objectives with the Guarded keyword are attached to the enemy or location that is guarding it, if that enemy or location is considered to be out of play, the guarded objective is too.\n\n \n\nAs you can see, the first two quotes above indicate that you attach the encounter card to the objective card.  This would mean that Ranger Spear would not deal more damage because you can't attack most objective cards.\n\n \n\nHowever, the next two quotes contradict this and say you attach the objective to the encounter card guarding it.  This makes more sense and in this case, Ranger Spear would deal more damage.\n\n \n\nI think the latter is how it is supposed to be played and the first two quotes are wrong.  Additional evidence to support this interpretation is the following:\n\n \n\n> (1.23) Attachments\n> \n> Any non-objective card that attaches to another card loses its original card type and gains the attachment card type.\n\n \n\nThus, if the former were to be true, you would attach the enemy to the Guarded objective, and then the enemy would lose the \"enemy\" card type so you could presumably never damage it.  Similarly, if a location lost the location card type, you could not place progress on it.\n\n \n\nWith all that said, I think it is pretty safe to assume you do attach the guarded objectives to the enemy (and not the other way around).  As such, your Ranger Spear would give the attached character +2 attack.\n\nEdited November 14, 2016 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2500951","commentId":2500951,"userName":"JanB","timestamp":1479127232,"content":"Nice research :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIt makes no sense to attach an enemy or location to a guarded card. because .. as you quoted, theses cards would considered as attachments and then the whole guarded mechanic does not work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2500962","commentId":2500962,"userName":"Lecitadin","timestamp":1479128127,"content":"Traps also count as attachments on enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2501310","commentId":2501310,"userName":"Teamjimby","timestamp":1479144036,"content":"The enemy is not attached to the guarded card, it's the other way around.  The guarded card (always an objective, IIRC) is what gets attached.  So 1.23 doesn't apply and I don't believe there is a conflict."},{"commentUrl":"https://community.fantasyflightgames.com/topic/234680-ranger-spear-the-city-of-corsairs/?do=findComment&comment=2501634","commentId":2501634,"userName":"rsdockery","timestamp":1479159142,"content":"Right. The confusion is that the Core rules incorrectly state that the encounter cards are attached to the Objective, when it's really the other way around."}]}