{"url":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/","title":"New Three Hunters","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2515843","commentId":2515843,"userName":"Bullroarer Took","timestamp":1480185164,"content":"Like many people I tried The Three Hunters after the core was first released.  Unlike many I stubbornly stuck it out with them through the frst cycle thinking they had to get better.  It eventually turned into an eagles deck that was was inferior to almost everything else out there (and certainly anything running Eowyn).  The biggest problem was the starting threat of 32.\n\n \n\nAnyway, now that Sands of Harad is out I thought I would try them again running the new versions.  My version is here:\n\n \n\nhttp://www.ringsdb.com/decklist/view/3722/three-hunters-1.0 [http://www.ringsdb.com/decklist/view/3722/three-hunters-1.0]\n\n \n\nThe biggest problem is the starting threat of 32.  The next biggest problem is that it's an expensive deck.  If you don't get Steward early you are in trouble.  Mulligan heavily for it.  Even when you get it you kinda need an early break from the encounter deck.\n\n \n\nYou will probably notice that I don't have Blood of Numenor or Gondorian Fire in there.  The deck would almost certainly be better with them, but I consider those cards cheap.\n\n \n\nI'm open to any suggestions and changes.  As I've stated elsewhere, I feel like it plays like a bad twins deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516010","commentId":2516010,"userName":"silverthorn","timestamp":1480202838,"content":"I've got plans to build a Three Hunters deck as soon as Sands of Harad comes out in the UK (probably as part of a two-hander with a Hobbit deck for saga play). I'll post something when I've got some games under my belt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516042","commentId":2516042,"userName":"Bullroarer Took","timestamp":1480205075,"content":"Two more things...\n\nThe Blades of Gondolin are actually Mirkwood Long-Knives.\n\nI originally had only one Celebrian's Stone, but upping it to two has made the deck much smoother. If I could just find a substitute for Gondorian Shield..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516058","commentId":2516058,"userName":"Seastan","timestamp":1480206515,"content":"> Two more things...\n> \n> The Blades of Gondolin are actually Mirkwood Long-Knives.\n> \n> I originally had only one Celebrian's Stone, but upping it to two has made the deck much smoother. If I could just find a substitute for Gondorian Shield...\n\n \n\nDid you know that ringdb lets you edit the descriptions of your published decks? Just click \"edit\" on the published page.\n\n \n\nI can't comment much on the deck yet because I haven't played with the new heroes, but at first glance the resource curve does seem pretty steep. Is Eldahir any good? Looks like you can't use his ability until your 1x Ring of Barahir is in play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516077","commentId":2516077,"userName":"dr00","timestamp":1480207938,"content":"some thoughts:\n\ni don't think a starting threat of 32 is bad. i think we're all still conditioned from Journey Down the Anduin (i'm a victim as well)\n\nif a deck is really expensive, i'd suggest some more resource-generating cards. Steward of Gondor is very good, but imo, you shouldn't rely on one card to fuel your whole deck unless you have some tutors\n\nthere are plenty of decent options, like Ranger Provisions and Tighten Our Belts\n\nas for not including cards because they are cheap; i've never understood this. the encounter deck doesn't remove anything because it's cheap, like Sleeping Sentry [http://www.cardgamedb.com/forums/uploads/lotr/ffg_sleeping-sentry-rtr.jpg]. cards are in the game pool for a reason; use them if you think they'll help.\n\nthat said, i don't think they'd actually help this deck. you're already running high on costs and low on resource generation, so i they'd hinder more than help.\n\n\n\n> Is Eldahir any good? Looks like you can't use his ability until your 1x Ring of Barahir is in play.\n\nnot the person you asked, but i don't like him at all.\n\n4 resources for a 1/2/2/3 sentinel. he's clearly meant to be a defender, so the extra cost to play him for the option of attacking for 2 makes him an unattractive option imo. plus his ability is only usable beforehand, and you can't even use things like Silver Lamp because it specifies a face down shadow card\n\nand on top of that, it just gives him +2 def, so if the shadow effect is discard an attachment, defending character, deal direct dmg, etc., it doesn't help much unless you were blocking someone with higher attack anyway, at which point you gambled on whether or not you'd get the bonus def, and gambled again that the shadow effect wouldn't give the attacking enemy more attack, and so many cost analyses that result in 'this card really isn't that great'\n\nalso as an aside, doesn't this go in the strategy/deck-building forum?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516186","commentId":2516186,"userName":"Rob_Oz","timestamp":1480217845,"content":"Maybe Narvi's Belt and/or Captain's Wisdom for resource smoothing/acceleration? Belt would go onto Gimli, of course, while Captain's Wisdom could be used by all three Heroes. Legolas and Gimli's abilities could probably provide readying tricks in conjunction with CW. Dwarven Shield seems like it would be a good fit also. Also consider swapping out A Good Harvest for A Very Good Tale which works very, very well with Sneak Attack/Gandalf shenanigans.\n\n \n\nI'll also play devil's advocate and say that Eldahir IS good in a Leadership/Lore deck with resource acceleration. I'm using 1 copy in my Denethor/Erestor/Loragorn deck and he can be quite solid, as I typically have resources to spare. I'll use his ability against one enemy to reveal a shadow card. If there's no shadow effect, then that typically allows Denethor with Armored Destrier to block, take little to no damage, ready, discard another enemy's shadow card, and then block that enemy. That's two enemy attacks I just neutered. If Eldahir's ability does reveal a shadow effect and it's +damage, then I can block with him at a 4 defense and then let Denethor do his thing with the Destrier against 1-2 other enemies. Sure, some shadow effects might still screw me even with Eldahir revealing it, but paying 1 Lore resource to confirm a shadow card should never be dismissed out of hand.\n\n \n\nA few other points to consider with Eldahir.\n\n \n\n1) Getting him into play via Sneak Attack/Gandalf/A Very Good Tale shenanigans is absolutely viable. Sneak Gandalf into play, let Gandalf do his thing and then A Very Good Tale out Eldahir for defense.\n\n2) Eldahir's ability reads Action: Spend 1 Lore resource to look at a facedown shadow card dealt to an engaged enemy. Note that's not \"an enemy engaged with you\", that's \"an engaged enemy\". That allows the ability to be used on a shadow card on any enemy, not just one engaged with you. Since Eldahir has Sentinel, he can then potentially block for another player.\n\n3) Eldahir is not obligated to block the enemy he used his ability on. Nor does he exhaust when he uses it. And any player can pay for the ability.\n\n \n\nIs he expensive? Yes. Is he a suitable fit in a wide array of decks? No. But in the right deck he is a very worthy addition. My guess is that, like many cards, most players just looked at him and said he's way too expensive and he's unique. Conclusion, not worth it, not playable, not trying him. And therefore never gained experience actually using the card.\n\nEdited November 27, 2016 by RobOz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516209","commentId":2516209,"userName":"Trialus","timestamp":1480220464,"content":"Thanks for posting Bullroarer! \n\n \n\nHere is what I am thinking of putting together (hoped to play tonight, but did Christmas decorations instead...will get a chance to play Mon evening I hope).\n\n \n\nHeroes: \n\n \n\nLegolas (spirit)\n\nGimli (leadership)\n\nAragorn (Lore)\n\n \n\nAllies: \n\n \n\nArwen x 2\n\nGaladriel's handmaiden x 2\n\nWest road traveller x 2\n\nWarden of healing x 2\n\nWandering Ent x 2\n\nFaramir x 2\n\nMaster of the Forge x 3\n\nHennemarth Riversong x 2\n\n \n\nAttachments:\n\nSteward of Gondor x 3\n\nNarvi's Belt x 2\n\nDwarven shield x 2\n\nMirkwood knife x 2\n\nSilver harp x 2 \n\nRanger provisions x 2\n\nDunedain warning x 2\n\nDunedain Mark x 2\n\nCelebrian's stone x 2\n\nDunedain quest x 2\n\nSword that was broken x 2\n\nRune-Master x 2\n\n \n\nEvents:\n\nTest of will x 2\n\nUnlikely friendship x 2\n\nCaptain's wisdom x 2\n\nDaeron's Runes x 2\n\nFair and perilous x 2\n\n \n\nThink that is actually 52 cards and with lots of 2 ofs might be spread a bit thin....But if the card draw is rolling well then it seems like it could be ok.\n\n \n\nSideboard ideas:\n\nMirkwood explorer (Really like him as a quester, but might be bit expensive in tri-sphere deck)\n\nIoreth swapped for one Warden of Healing (lots of my recent decks have been too fragile to need 3 healing on a single char, but this one is beefy enough that it might be a good use of her)\n\nConey in a trap (upcoming) to dodge a heavy hitter if needed\n\nWingfoot for Aragorn and maybe UE x 2 so that Gimli and Legolas could handle multiple enemies - OR - \n\nMaybe  a Burning Brand and some of the Dunedain warnings on Loragorn if lots of defense is needed or shadows are particularly bad.\n\nDeep Knowledge if threat isn't too big a deal.\n\n \n\nMulligan for SoG and/or MotF.  Pull lots of attachments, focus on runes due to bargain from rune-master.  Narvi's to spread Gimli's resources among spheres, Silver harp to bring back pitched cards, \n\n \n\nIdea is to quest with just about everyone and ready Gimli and Legolas for combat.\n\n \n\n \n\nNot tested yet and put together pretty quickly, but I would love to hear feedback....\n\n \n\n \n\n*sorry for long list, but couldn't bring myself to create it on RingsDB.com without the actual cards up yet...\n\nEdited November 27, 2016 by Trialus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516224","commentId":2516224,"userName":"PsychoRocka","timestamp":1480221648,"content":"This may not be overly helpful so I apologise but I find any of these lineups a lot more viable and effective in theory than tri-sphere three hunters:\n\n-Aragorn (tactics)\n\n-Gimli (tactics)\n\n-Legolas (spirit)\n\n-Legolas (tactics)\n\n-Aragorn (tactics)\n\n-Gimli (leadership)\n\n(what I am running)\n\n \n\n-Legolas (tactics\n\n-Aragorn (leadership)\n\n-Gimli (leadership)\n\n \n\n-Legolas (tactics)\n\n-Aragorn (leadership)\n\n-Gimli (tactics)\n\nAlso in the right deck/s Eldahir is incredible and offers another great defensive measure against shadow cards/effects and high attack strength enemies. Yes he is expensive and to use his ability costs a lore resource every time but he is well worth it. There are plenty of ways to get him into play for free as well such as AVGT, Send for Aid, Vilya etc.\n\nEdited November 27, 2016 by PsychoRocka"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516237","commentId":2516237,"userName":"PsychoRocka","timestamp":1480222575,"content":"Another way to get around trisphere being a big issue is to run Aragorn (lore), Legolas (spirit) and Gimli (leadership). Run all the doomed cards and ramp cards and resources first turn then drop back down to starting threat with Aragorn. You could play first turn UC, Steward, StwB, Dwarven Shield, Mirkwood Longknife etc etc. Could be a pretty powerful deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516512","commentId":2516512,"userName":"Lecitadin","timestamp":1480265648,"content":"Amyone tried a 2 heroes deck with Strider with the new Gimli and Legolas?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516552","commentId":2516552,"userName":"Bullroarer Took","timestamp":1480269134,"content":"Thanks for the repiles.\n\n \n\nFirst of all Dr00 is right, this should have been in strategy.  Mea Culpa.\n\n \n\nNext to Seastan, I'm aware I can edit the decks, but for some reason I can't edit them with my iPad which is what I was using when I realized that I'd forgot to explain that Blade of Gondolin was supposed to be Murky Knife.  (I'll make the change now though.)\n\n \n\nSome good suggestions out there, but remember that when you suggest an addition you might want to suggest a cut as well.  The deck is already at 51 and I wouldn't tolerate that except for having three Friendships.  Particularly intriguing is Narvi's Belt.  I have been putting Steward on Aragorn, but with it on Gimli... Very possible.\n\n \n\nEldahir...  In about 10 games with him I haven't triggered his ability once.  Probably not worth a slot.  Doubling up on Erestor might be better.\n\n \n\nI realized sometime last night that another combo I have been trying to pull off - and failing  - is getting Gondorian Shield onto Aragorn with Good Harvest then it gives two extra shields because of Steward.  But it would be much easier and more effective to just change those to two Dunedain Warnings.  I can even move those around if needed.\n\n \n\nAnother card that has surprisingly under-performed is Dwarven Shield.  In 10 games I think I've only manged to get 1 resource back from it.  I'm going to keep it a little longer, but going to three Warnings might be better.\n\n \n\nA few months ago when the cards were first spoiled someone mentioned that they didn't like the discard mechanic on Legolas as he is Silvan.  Thematically I agree.  Fortunately, with Elven Light we essentially turn that into \"pay a resource and draw a card\".  (Which is nice.)  In fact, getting the first Light blinking is so important that I am thinking of trying to find room for a third.  Possibly at the expense of a Mathom.\n\n \n\nEarlier I called this \"a bad twins deck\".  That wasn't really fair.  As I play it more and more I am starting to see the differences and advantages.  Being able to quest turn one for 6 and still have everyone available for three more actions is pretty good after all.\n\n \n\nLastly to Trialus, thanks for the deck.  It looks very much like I expected.  Adding Loragorn gives you access to those wonderful Lore cards from Dwarowdelf - which is what I was trying to avoid in my build,  I've been leaning on those cards for the last five cycles and I wanted to try something different."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516794","commentId":2516794,"userName":"dr00","timestamp":1480289872,"content":"> I realized sometime last night that another combo I have been trying to pull off - and failing  - is getting Gondorian Shield onto Aragorn with Good Harvest then it gives two extra shields because of Steward.  But it would be much easier and more effective to just change those to two Dunedain Warnings.  I can even move those around if needed.\n\ni was actually going to make this suggestion until i realised the combo with Steward. since it's not working, imo drop it altogether (the shields, Good Harvest, all of it) and get some resource acceleration. i'd also consider dropping Sulien (or swap for something like ally Bilbo). her ability is situational and 4 resources for 3 questing isn't too terrible of a trade, it's an expensive ally for an already expensive deck. if you were running a Dunedain with Heir of Heir of Valandil, i'd say go for it\n\nalso is Blade of Gondolin supposed to be Mirkwood Knife? how is it working for you?\n\nalso, i really like An Unlikely Friendship in this deck. you could probably cut something for A Very Good Tale, like Sneak Attack. yes, it's an awesome combo with Gandalf, but you only have 2, and A Very Good Tale combos just as well Gandalf to give you a permanent ally"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516811","commentId":2516811,"userName":"Bullroarer Took","timestamp":1480291025,"content":"I just tried a game using three Warnings instead of the Gondorian Shield and Harvests.  Good switch.  I really like Sulien even as 3WP for 4.  She was a beast in my last game.  (I wish she had 3 hp though.)\n\n \n\nThe Blades are supposed to be Murky Knives.  I forgot to mention that earlier.  I LOVE them.  Because of the ability to quest and then ready Legolas they pay dividends in a hurry.  Much more so than the Dwarven shields which are just okay.  I've never been enamored with Heir of Valadil.  Not sure it will really pay for itself.\n\n \n\nI have three Sneaks and use them as much with Galadriel as I do Gandalf.  Getting the free attachment and then setting up my next 4 draws is a big help.  A Very Good Tale is certainly a card I am thinking about though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516816","commentId":2516816,"userName":"Bullroarer Took","timestamp":1480291546,"content":"The more I think about it the more I like the idea of Bilbo.  Probably in place of Eldahir over Sulien though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516873","commentId":2516873,"userName":"PsychoRocka","timestamp":1480295816,"content":"Sneak Attack + Galadriel unfortunately does not work. Her ability only triggers if you play her from your hand. Sneak attack puts her into play from your hand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2516955","commentId":2516955,"userName":"Bullroarer Took","timestamp":1480304538,"content":"> Sneak Attack + Galadriel unfortunately does not work. Her ability only triggers if you play her from your hand. Sneak attack puts her into play from your hand.\n\nOh... $$$$...  G**D***It FFG! Why do you make that so difficult?\n\n \n\nYou are certainly right and it will require a revision to the deck...  \n\n \n\nOk.  That said and cleared up, Eldahir is absolutely bonkers when you have a spare (Lore) resource handy and he's not going anywhere.  This deck is shaping up nicely, even with the Galadriel change."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2522983","commentId":2522983,"userName":"Rob_Oz","timestamp":1480659247,"content":"Glad you are enjoying Eldahir. I was really dubious at first, but after using him for a bit I really grew to like him. In a Leadership/Lore deck having the ability to confirm a shadow card and then potentially have a 4 defense/Sentinel ally to defend with is really, really strong (Sentinel is obviously not relevant in solo, which I think you tend to play). In many cases, there's often only really one enemy I fear when making multiple blocks. Confirming whether that enemy has a shadow card, and if so, what it does is often enough information for me to set up my entire defense. Eldahir provides that confirmation.\n\n \n\nHeck, since he's Leadership, you could even go really crazy and try to Sword Thain him since he's unique. If you have resource laundering available, you could then use that extra resource he's generating to pay for his ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2523263","commentId":2523263,"userName":"Lecitadin","timestamp":1480686326,"content":"I beat the Sands of hard quests with the new Gimly/Legolas Lethal Weapon style duo combined with Haldir of Lorien, and it works great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2523359","commentId":2523359,"userName":"JonG","timestamp":1480690084,"content":"I don't usually comment on decks, but I did look at yours. My first thought was \"too many attachments and not enough allies\". My second thought was \"not enough cheapo allies\".\n\n \n\nThe Gondor decks have some 1 cost allies and using some of those as chump blockers would help IMO. I'd also want the third Sword that was broken card and third Faramir card, but then I'm a believer in maxing out on willpower strength.\n\nEdited December 2, 2016 by JonG"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2523651","commentId":2523651,"userName":"Bullroarer Took","timestamp":1480698047,"content":"@ Lecitadin - I think Haldir might be a better fit than core Aragorn with his lower threat and access to Lore.  Healing is certainly wanted.\n\n \n\n@JonG - You raise a valid point.  I am certainly playing with one hand tied behind my back in trying not to use some dispensable allies.  I'm not sure about the third Sword and Faramir though.  The deck has pretty good draw and it's rare I don't see one early.  A second Faramir has been on my mind though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2536982","commentId":2536982,"userName":"silverthorn","timestamp":1481484762,"content":"I built a deck with Lore Aragorn and the new Gimli and Legolas and it did pretty well against Peril In Pelargir (winning first tme in 7 turns) but lost Into Ithilien in two turns. I think it's going to need some modifying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235588-new-three-hunters/?do=findComment&comment=2557135","commentId":2557135,"userName":"Narsil0420","timestamp":1482530137,"content":"I ran through the Sands of Harad scenarios with Aragorn(lead) and new L&G with a NO allies deck! it was pretty fun but I definitely had to add some allies for the last scenario."}]}