{"url":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/","title":"City of Corsairs -- shadow cards during stage 2-3 transition","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/?do=findComment&comment=2518521","commentId":2518521,"userName":"GrandSpleen","timestamp":1480398505,"content":"SPOILER ALERT for a major thing in City of Corsairs...\n\n \n\n \n\nQuest card 2a reads: When Revealed: Each player assigns damage among non-Ship characters he controls equal to the total damage on each Ship objective he controls. Discard all Ship enemies, Ship objective and Ocean locations in play.\n\n \nAnd 2b reads:\n \nWhen Revealed: Shuffle the Corsair deck and Corsair discard pile into the second encounter deck. Search the encounter deck and discard pile for each copy of Battle-hardened and each copy of Watch Tower, shuffle them into the second encounter deck. Set the current encounter deck and discard pile aside, inactive. The second encounter deck becomes the active encounter deck. Advance to stage 3.\n \n \nWhat happens to shadow cards if you advance while they are in play? Could easily happen while dealt to a Corsair enemy and you advance in the combat phase after destroying the Storm-caller.  \n \n1) Nothing, they remain in play.  At the end of the phase they will be discarded as per usual.  This means they will end up in the new encounter deck.  This opens up the possibility for a Ship enemy or an Ocean location to become part of the new encounter deck.  \n \n2) They should be discarded.  Nothing tells you to do this, but that seems to be the intent, because you shouldn't end up with a Ship or Ocean once on stage 3.  This means you will end up with a Corsair enemy or two or three who has no shadow card this round.\n \n3) Resolve the shadow effect, but once the card is discarded, put it with the inactive encounter deck (because again, it does not seem to be intended that you have Ships/Oceans at this point).  This is actually how I played it.\n \nI sent this in as an official rules question about one week ago but have not received a response.  It seems that I might not get one, so what do you all think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/?do=findComment&comment=2518525","commentId":2518525,"userName":"Authraw","timestamp":1480399009,"content":"Wow, that's a tough one. I agree that #3 is probably how I would rule it so that everything \"makes sense\", but without an errata I think that rules-as-written would have you go with #1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/?do=findComment&comment=2518545","commentId":2518545,"userName":"RichardPlunkett","timestamp":1480400808,"content":"I suspect the straight rules-as-written approach would be #1, but I also think it's reasonable to enforce sensible outcomes and preempt erratas and I would argue strongly for #3 in my play group."},{"commentUrl":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/?do=findComment&comment=2520004","commentId":2520004,"userName":"GrandSpleen","timestamp":1480480903,"content":"I just got a reply today, took a little longer than I anticipated but it wasn't overlooked after all.. Maybe just a holiday backlog.  Anyway here it is:\n\n \n\n\"Great question. Somehow this never came up in play-testing, so it never occurred to us that stage 2A should also force you to discard each shadow card in play. As a result, stage 2A will likely need an errata to read: “Discard all Ship enemies, Ship objectives, Ocean locations and shadow cards in play.”\n\nI hope you’re enjoying the scenario!\nCheers,\nCaleb\"\n\nEdited November 30, 2016 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/235735-city-of-corsairs-shadow-cards-during-stage-2-3-transition/?do=findComment&comment=2520234","commentId":2520234,"userName":"alogos","timestamp":1480508697,"content":"As far as I can remember, we had a question somewhat similar (but not the same) where Carahadras (I think?) was a shadow card while moving to the quest that make it the active location. The answer was that you should look at the shadow card one by one to find it. (the quest didn't say to limit to encounter deck and discard pile)"}]}