{"url":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/","title":"Which Expansions to get Multiple Of?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530654","commentId":2530654,"userName":"chico2323","timestamp":1481119482,"content":"In order to get the most important player cards so that multiple people can have multiple play sets?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530712","commentId":2530712,"userName":"Kakita Shiro","timestamp":1481121243,"content":"Depends on what spheres are being played in what quantities."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530762","commentId":2530762,"userName":"John Constantine","timestamp":1481123017,"content":"Daeron's Runes is a very staple card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530901","commentId":2530901,"userName":"CommanderDave","timestamp":1481126823,"content":"Print out extra copies if you already own it and are playing at home. I'm not buying three or more cores for unexpected courage, test of will etc. I've put hundreds of dollars into this game, and very much enjoy it, but can't justify multiples like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530904","commentId":2530904,"userName":"Bullroarer Took","timestamp":1481126869,"content":"Sleeves and proxies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2530957","commentId":2530957,"userName":"Gizlivadi","timestamp":1481127984,"content":"I've bought multiple copies of some packs to keep many decks built simultaneously for solo play, and I've also bought singles. Sleeving and re-sleeving wears the cards. With that said though I do make proxies of Core Set cards such as Steward of Gondor, Unexpected Courage, Sneak Attack, etc. Anyway, I've bought multiple copies of Foundations of Stone, Celebrimbor's Secret, Dread Realm, and Flight of the Stormcaller. Others I would consider are Steward's Fear, Watcher in the Water, mabye even Long Dark just for Warden. Over Hill and Under Hill contains some pretty amazing cards, like Foe-hammer and A Very Good Tale. Shadow and Flame also contains Master of the Forge which is one of the best Lore allies in the game and many decks can use him to good effect.  \n\nEdited December 7, 2016 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236401-which-expansions-to-get-multiple-of/?do=findComment&comment=2531055","commentId":2531055,"userName":"ParinorB","timestamp":1481131048,"content":"How many people are you playing with? I find that once you have a decent number of packs, you can build cool decks for two or three players (never played 4 player) with just three of each card - obviously, you might end up haveing decks that are not perfectly optimized (such as a Lore deck without 3 times the runes) - I did buy two cores but given the ratio of cards that you never use to the cards that you buy the extra packs to, I thought it felt like overkill.\n\n \n\nBut if you really don't like proxies, then maybe buying single copies (as Gizlivadi suggested) is a solution?"}]}