{"url":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/","title":"Has Noldor caught on?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536490","commentId":2536490,"userName":"GrandSpleen","timestamp":1481438775,"content":"Do people play Noldor decks in your playgroups?\n\n \n\nThis is still one of the newer, shinier archetypes, but  I think I don't see it so often.  I see Erestor, who is kind of like an archetype all on his own, but I don't know that I've ever seen anyone play Noldor without Erestor in the groups I have played with this year (other than myself).  \n\n \n\nI see Noldor heroes like Arwen and Cirdan on their own outside of Noldor decks, and I see some Noldor allies like Glorfindel pop up in Caldara decks, or Imladris Caregiver in any deck with Elrond.  \n\n \n\nHow about you all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536495","commentId":2536495,"userName":"Nickpes","timestamp":1481439499,"content":"I played the Grey Havens Delux and first 4 of dream chaser cycle quests with a Noldor deck, heroes Cirdan, Galadriel and Galdor. The deck was mainly build for Gildor, Glorfindel and Rivendell Guardian (neutral ally) using most of the Noldor based events, ally Arwen and some attachments to boost these two. All of my allies were Noldor (not even Silvan)\n\n \n\nI had hard time on a couple of quests but most of them went well and managed to win each of them with some neccessary tweaking when needed on my cards. \n\n \n\nI could not progress on Storm on Cobas, thus changed my hero setup for the last two quests.\n\n \n\nMy main \"problem\" was that my deck needed time to setup, so in quests that needed fast progress I had difficulties. Gildor with Burning brand and the ring on Cirdan with a Light of Valinor on him was pretty essential. When these were on, everytyhing was much easier. Galadriel was used mainly for threat reduction till UC was on her and Gildor hero was used only for questing (and his ability offcourse which is pretty strong in a Noldor discard deck) "},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536546","commentId":2536546,"userName":"PsychoRocka","timestamp":1481446343,"content":"I'm still rocking an Elrond, Galadriel and Arwen Noldor deck and it works really well. Can take on most quests with its partner deck and rarely struggles. Card draw really actually is King when playing a Noldor deck though and you need to find that careful balance between discard mechanics and card draw that work for your particular deck. If you don't find that balance you are either never going to have as many cards as you need to run your discard engines and effects or you will have way too many cards without enough outlets to discard them to."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536548","commentId":2536548,"userName":"PsychoRocka","timestamp":1481446519,"content":"Also NEVER had Erestor as part of the line up at any point in the decks history and never even really considered him. Cirdan was heavily considered and Galdor was included for a fair while before being replaced by Galadriel but Erestor was never in the decks and never would have been, his drawback is just way too severe for me personally. I honestly think that the Noldor archetype is stronger and more interesting without him and I think you are right Grandspleen that he is more of an archetype of his own than necessarily part of the Noldor one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536558","commentId":2536558,"userName":"John Constantine","timestamp":1481447900,"content":"Yes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536563","commentId":2536563,"userName":"Fingolfin Fate","timestamp":1481448292,"content":"Galdor, Arwen, Círdan line up with Glorfindel, Gildor and other Noldor allies is certainly one of my strongest decks, up their with the Galadhrim or Gandalf/Elrond/Beregond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536736","commentId":2536736,"userName":"Gizlivadi","timestamp":1481469932,"content":"Erestor Cirdan Arwen is one of my most powerful solo \"tribal\" decks. Up there with Dwarves, possibly better than Silvan. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536750","commentId":2536750,"userName":"Teamjimby","timestamp":1481470943,"content":"You're right, not many people in our group play it.  I think I've only seen one other person besides you play a true Noldor deck.  The reason I haven't is that there is almost always someone that plays Erestor or Arwen (hero or ally version), so the odds of actually being able to use the deck in a 3-4 player game are pretty slim.  Maybe I will play some 2 handed solo with a Noldor deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536808","commentId":2536808,"userName":"PocketWraith","timestamp":1481474434,"content":"Noldor is definitely an archetype which can easily be mixed with other decks, so you can just have a bit of it in a deck rather than needing to go pure Noldor, and I'd say that is perhaps the more common case. In any case, at this point in the card pool there are so many different possibilities for decks that we shouldn't really expect to see a new archetype all over the place the way we did for Dwarves, or I guess Silvans, because there are so many other possibilities also coming up with newly released cards. I built a Noldor deck after Dread Realm came out, haven't updated it since but it's still really good and beats most quests pretty handily... but I still don't play it that often because I have so many other options to choose from.\n\n \n\nAlso I'd just like to put in my thoughts on Erestor, because I disagree that he's an archetype. He's not. He's a glue hero you put into an existing archetype to give it the card draw. Granted, his inclusion then alters how you build the rest of the deck, pushing you towards either recursion or a hyper-efficient cost curve, but still all he's doing is enabling whatever else you're doing. You can build a Gondor deck with Erestor, or an Outlands deck with Erestor, a Silvan, Noldor, or Dwarf deck with Erestor, and so on, but to my mind there isn't really such a thing as an 'Erestor deck'."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2536933","commentId":2536933,"userName":"Authraw","timestamp":1481481871,"content":"Seems a bit unfair not to count an Erestor deck as a Noldor deck, since the primary reason I haven't been playing Noldor in multiplayer of late is that it would conflict too much with my partner's Erestor deck. I think I use Noldor decks in solo more than anything else right now though.\n\nPocketWraith makes a good point about the Noldor heroes being splashable, too. You can find Galadriel or Glorfindel in all sorts of decks, so if you put them both together in one deck you might be stomping on other people's decks as well (not to mention that many Noldor heroes also have excellent ally versions too, making the chances of a collision even higher)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537028","commentId":2537028,"userName":"dr00","timestamp":1481487561,"content":"> Seems a bit unfair not to count an Erestor deck as a Noldor deck, since the primary reason I haven't been playing Noldor in multiplayer of late is that it would conflict too much with my partner's Erestor deck. I think I use Noldor decks in solo more than anything else right now though.\n> \n> PocketWraith makes a good point about the Noldor heroes being splashable, too. You can find Galadriel or Glorfindel in all sorts of decks, so if you put them both together in one deck you might be stomping on other people's decks as well (not to mention that many Noldor heroes also have excellent ally versions too, making the chances of a collision even higher).\n\nthe language of your post suggests that you disagree with the OP, but you seem to be making similar points...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537156","commentId":2537156,"userName":"Authraw","timestamp":1481497090,"content":">  \n> \n> > Seems a bit unfair not to count an Erestor deck as a Noldor deck, since the primary reason I haven't been playing Noldor in multiplayer of late is that it would conflict too much with my partner's Erestor deck. I think I use Noldor decks in solo more than anything else right now though.\n> > \n> > PocketWraith makes a good point about the Noldor heroes being splashable, too. You can find Galadriel or Glorfindel in all sorts of decks, so if you put them both together in one deck you might be stomping on other people's decks as well (not to mention that many Noldor heroes also have excellent ally versions too, making the chances of a collision even higher).\n> \n> the language of your post suggests that you disagree with the OP, but you seem to be making similar points....\n> \n>  \n\nThat's a fair point. I think my tone was responding more to the title of the post than anything, since I feel like I'm using the new Noldor cards all the time right now, and about half of my solo decks are Noldor-centric. But I suppose Spleen's right in that I haven't seen anyone but my partner playing Noldor at the game shop—and she uses Erestor.\n\nEdited December 11, 2016 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537281","commentId":2537281,"userName":"Otherworlder","timestamp":1481506040,"content":"My Glorfindel Arwen Cirdan deck thinks Cairn Dum is not that bad. Also I absolutely rocked Mount Gram with the same deck, considering it was Arwen who rescued the great elf-lords  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]  :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] . I have only been playing Noldor solo then, and I absolutely agree Noldor is best solo, since it's really what I call \"good cards.dek\", literally a collection of this game's best uniques. (It is fitting, if you think about it. And Elladan/Elrohir ally WHEN ffg?)\n\n \n\nPS: I always think of it as Caldara would be perfect for a Noldor deck lol. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537347","commentId":2537347,"userName":"awp832","timestamp":1481509515,"content":"if I may add a little,  I think maybe the \"Noldor deck\" Grandspleen was referring to meant a bit more than using Noldor heroes.   After all we've been playing Elladan/Elrohir, Glorfindel, Galadriel, Elrond, Erestor, Ciradan and Arwen for a while and they're all solid heroes.   But that doesn't really sing \"noldor deck\" to me either.  Regardless of the hero lineup, I think the question is:  are the decks using the Noldor tricks?  I'm talking about more than using Arwen and Elven Light,  I mean do people run Elwing's Flight, and Skyward Volley?  Are we using Mithlond Sea Watcher and playing with our discard pile?   That sort of thing.  Are we doing the Noldor thing, so to speak?,  -not just using Noldor Heroes and a few Noldor cards.\n\nI dont really have much of a point of reference because I don't see any more than the decks I build most of the time.  But just from judging what sorts of lists are around the online community;  they certainly don't seem to be very popular.\n\nEdited December 12, 2016 by awp832"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537390","commentId":2537390,"userName":"Bullroarer Took","timestamp":1481513881,"content":"Has Dunedain caught on? I'm seeing a lot more Noldor love in the deck lists than Dunedain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537471","commentId":2537471,"userName":"GrandSpleen","timestamp":1481519757,"content":"I've seen a lot of Dunedain around where I live. From the discussion it sounds like people do like Noldor, but as awp832 points out above it's more like people enjoy the new Noldor heroes.  Dunno if people are putting other Noldor-y cards in their decks, like Steed of Imladris, Power of the Eldar, To the Sea! and so forth.  Maybe yes.  Personally I haven't gotten much use out of the Tactics Noldor cards, but I've played many games and enjoyed the offerings in Lore and Spirit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537479","commentId":2537479,"userName":"Teamjimby","timestamp":1481520259,"content":"Yeah, I wish there were better options in Leadership and Tactics for Noldor.  The only heroes are Elladan and Elrohir, which you would obviously never play alongside Arwen and Erestor.  I suppose Aragorn can be the third hero since he works with Arwen, but he otherwise has no synergy with Noldor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537486","commentId":2537486,"userName":"Authraw","timestamp":1481521091,"content":"That's true. I've used all of the Spirit and Lore cards recently, but I don't think I have used any of the Tactics or Leadership ones at all. I blame it on a lack of Noldor heroes in red and purple. We basically just have Elladan and Elrohir, and you can't really separate them, so that limits deck options quite a bit.\n\nEdit: ninja'd!\n\nEdited December 12, 2016 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537848","commentId":2537848,"userName":"Otherworlder","timestamp":1481552570,"content":"> if I may add a little,  I think maybe the \"Noldor deck\" Grandspleen was referring to meant a bit more than using Noldor heroes.   After all we've been playing Elladan/Elrohir, Glorfindel, Galadriel, Elrond, Erestor, Ciradan and Arwen for a while and they're all solid heroes.   But that doesn't really sing \"noldor deck\" to me either.  Regardless of the hero lineup, I think the question is:  are the decks using the Noldor tricks?  I'm talking about more than using Arwen and Elven Light,  I mean do people run Elwing's Flight, and Skyward Volley?  Are we using Mithlond Sea Watcher and playing with our discard pile?   That sort of thing.  Are we doing the Noldor thing, so to speak?,  -not just using Noldor Heroes and a few Noldor cards.\n> \n> I dont really have much of a point of reference because I don't see any more than the decks I build most of the time.  But just from judging what sorts of lists are around the online community;  they certainly don't seem to be very popular.\n\n \n\nElwing's Flight is actually great. Perilous and Fair is super powerful, my Dwarven Mine generally end up recycling them exclusively. Light of Valinor, Silver Harper, Steed of Imladris are also really great cards. Does Tale of Tinuviel count as a Noldor card? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2537961","commentId":2537961,"userName":"dalestephenson","timestamp":1481555476,"content":"If I were to identify a \"Noldor deck\", I would use \"To the Sea! To the Sea!\" as the indicator.  It's a discarder, and it specifically reduces only Noldor allies.  If you have this card, you're running a Noldor deck.  (Of course, you can run a Noldor deck without it, I'd just argue it's likely the most popular card to be *only* found in Noldor decks.)\n\n \n\nThere are 108 deck lists using this card.  How does that compare with other touchstone cards?\n\n \n\n\"O Lorien!\" (Silvan) is in 100 decks\n\n\"Heir of Valandil\" (Dunedain) is in 99 decks\n\n \n\nSpirit Theoden (Rohan) is in 125 decks\n\nDamrod (traps) is in 148 decks\n\nLeadership Boromir (Gondor) is in 103 decks\n\nHirluin (Outlands) is in 94 decks\n\n \n\n\"Legacy of Durin\" (Lore-dwarf) is in 151 decks\n\nDain Ironfoot (Leadership-dwarf) is in 190 decks\n\n \n\n\"Eagles are Coming\" (Eagles) is in 131 decks\n\n\"Entmoot\" (Ents) is in 146 decks\n\n \n\nI'm actually amazed at how the magnitude of the various tribes is similar, as judged by these touchstone cards.  At least to the extent of constructing decks, Noldor has caught on.  Usage in a multiplayer setting may be somewhat different, of all the archtypes listed above I think the Noldor deck is the most likely to cause conflicts with heroes, block quality allies, and create competition for Light of Valinor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2538752","commentId":2538752,"userName":"GrandSpleen","timestamp":1481578484,"content":"I actually started looking at those numbers from Ringsdb myself last night, but after looking for a while I concluded it's not a great measure of archetype proliferation.  Example, not every Dunedain deck is going to include Heir of Valandil.  To the Sea! is newer than Steward of Gondor.  Steward has 100 pages of decks on Ringsdb, while To the Sea gets 4.  Yes obviously Steward is more popular, but what would those numbers look like if it were a Core set card?  Anyway, too many variables and the playing field is anything but level, so not a great way to determine how popular a card actually.\n\n \n\nBut the best actual data we have. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2538841","commentId":2538841,"userName":"dalestephenson","timestamp":1481581413,"content":"Comparing ringsdb count obviously has its limitations.  Besides the ones you mentioned, there's also the issue that multiple revisions of the same deck can be published, multiplying the deck count.  When I was doing a more lengthy hero combination analysis I actually used just the most recent deck with a given card by a particular author, which excluded some unique decks but made it sort of a \"one deckmaker, one vote\" approach that was I think more accurate for broad use -- but also more time consuming, which is why I didn't use it for this analysis.\n\n \n\nIt's true there are Dunedain decks without Heir of Valandil, just as there are Noldor decks that don't include To the Sea! and Silvan decks without O Lorien.  My attraction is that they *only* appear in that kind of deck.  So it gives us a rough order-of-magnitude impression of the archtype, and it appears to be in the same ballpark as other rough estimates.\n\n \n\nI doubt that To the Sea! would be in dramatically more decks if it were in the core.  There are *no* Noldor allies in the Core set, so it'd be utterly useless there.  I don't think it'd be in many decks at all until Grey Havens and the Stormcaller cycle provided so many more Noldor allies.\n\n \n\nSteward of Gondor would be in dramatically less decks if it had come in Grey Havens, but among players who have Grey Havens, it'd probably be *more* popular because of its obvious utility and the lack of SoG fatigue.  As LeDenethor shows, an impressive late card can quickly acquire a lot of decks (over 250 now) -- and even after all this time, 240 of those LeDenethor decks have Steward of Gondor.\n\n \n\nRingsdb comparisons are probably most accurate for cards released about the same time.  Still, ringsdb is recent enough that most of the archtype cards I checked were already released when it came into existence (though new players, which are still coming into the game, will still be very Core-heavy.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2539438","commentId":2539438,"userName":"13nrv","timestamp":1481623518,"content":"The Noldor archetype is based on lore and spirit mainly due to the Noldor Heroes.\n\n \n\nWe need some other independent leadership and tactic Noldor heroes in order to create different archetype.\n\n \n\nI have used all lore and spirit Noldor and there are all good.\n\nBut i have used only some of them in a Noldor swarm allies archetype :\n\n- Lore : Galdor and/or Erestor. Big draw capacity.\n\n- Spirit : Arwen Undomiel and/or Cirdan and/or Galadriel.\n\n \n\nGlorfindel ally is too strong in this kind of Archetype so exit Glorfindel Hero.\n\nI have to test Elrond in a Noldor deck. Elrond capacity to play leadership and tactic ally could be a good solution to play some other Noldor than the usual ones.\n\nThe twins are fun but didn't fit to this kind of Archetype."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2539655","commentId":2539655,"userName":"GrandSpleen","timestamp":1481639750,"content":"Just like Leadership Imrahil and Eomer play nice with Silvans, there are some non-Noldor heroes who fit very well into the archetype as well.  Hama, Eowyn, new Legolas, Kahliel once he is released.  So we already have 1 Tactics hero that can work in these decks, and we'll soon have a Leadership one (although I don't know that you want to be populating a Noldor deck with a bunch of Harad allies for Kahliel).  They can't benefit from cards like Lords of the Eldar, but in my experience that is not generally what a Noldor deck is doing every turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2539873","commentId":2539873,"userName":"Authraw","timestamp":1481646548,"content":"I still say Elladan and Elrohir Allies would be a huge boon for the Noldor archetype, allowing you to start with one of them as a hero and mulligan for the other. It would be like getting 2 new heroes at once!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236698-has-noldor-caught-on/?do=findComment&comment=2540227","commentId":2540227,"userName":"Yepesnopes","timestamp":1481655176,"content":"I enjoy a lot playing with my noldor deck!\n\nhttp://ringsdb.com/decklist/view/3799/lords-of-the-eldar-2.0 [http://ringsdb.com/decklist/view/3799/lords-of-the-eldar-2.0]\n\nI use Arwen, Cirdan and Elrond as heroes and I have removed Asfaloth and Silver Harp in favor of two Dwarven Tombs.\n\nBesides the two healers and Treebeard and Quickbeam, the rest are noldor allies. Honestly the ents are not really needed and I will substitute them for Guardians of Imladris who do benefit from Lords of the Eldar.\n\nSaid that, I also would love to see Elladan and Elrohir as allies!"}]}