{"url":"https://community.fantasyflightgames.com/topic/236710-black-riders-saga-panicked-burden-card/","title":"Black Riders Saga: Panicked (burden card)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/236710-black-riders-saga-panicked-burden-card/?do=findComment&comment=2536597","commentId":2536597,"userName":"peke12","timestamp":1481452560,"content":"Panicked is a burden card and forces you to pass the first player token to the next player.\n\nI'm a bit confused what happens now in a single player game? When I reveal this card, is my turn immediately ended? And what about my next turn? because all my characters are still exhausted. this would implicate that I will have difficulties to quest and fight this turn. Is this the correct resolution of this card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/236710-black-riders-saga-panicked-burden-card/?do=findComment&comment=2536620","commentId":2536620,"userName":"NathanH","timestamp":1481456151,"content":"The card just passes the first player token, it doesn't end the turn or do anything else. In a solo game, the next player doesn't exist so the first player token stays where it is. You just add 3 to your threat and carry on. In a multiplayer game, you just pass the token to the next player, they formally become the first player, and the turn carries on as normal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236710-black-riders-saga-panicked-burden-card/?do=findComment&comment=2536743","commentId":2536743,"userName":"GrandSpleen","timestamp":1481470505,"content":"There's even a player card called Follow Me! which moves the first player token.  It doesn't signify the end of a round (in a single player or multiplayer game), and the token pass to the next player as per usual once you get to the refresh phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/236710-black-riders-saga-panicked-burden-card/?do=findComment&comment=2536878","commentId":2536878,"userName":"987654321","timestamp":1481478425,"content":"It is, however, interesting to see how the Peril keyword would proceed."}]}