{"url":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/","title":"Solo Play — Am I Getting Something Wrong?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2544531","commentId":2544531,"userName":"jp1971","timestamp":1481861749,"content":"Hi,\n\nThis is my first post here.\n\nI’ve recently returned to LotR TCG after not playing for a couple of years. I’m playing solo these days and am finding it very difficult to make it through the first scenario of the core set. At this point, I’ve made it through once with the leadership heros and starter deck.\n\nBefore I go into detail, I’d just like to say that I’ve read the rules through a few times and have watched the video tutorial as well. I’m a lifelong gamer and, as such, generally grasp rules easily.\n\nWhat keeps happening is that the staging area fills up quickly while at the same time my heros become engaged with multiple enemies. This makes it difficult to commit enough characters to questing on one hand while having enough characters to defend and attack on the other. The end result is that, six or seven rounds in, the game reaches a point that is unwinnable.\n\nDespite numerous defeats, I’m a huge Tolkien fan and want to play this game solo. Any advice would be greatly appreciated.\n\nThanks,\n\nJameson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2553233","commentId":2553233,"userName":"Lecitadin","timestamp":1482327838,"content":"Hi!\n\nTry tp combine spheres, especially Spirit with Tactics, or Leadership with Lore.\n\nIf you have 2 spirit heroes and one tactic hero, don't forget that you will have more Spirit resources, so build your deck according to that.\n\n \n\nEnjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2554283","commentId":2554283,"userName":"RichardPlunkett","timestamp":1482369672,"content":" The core adventures are design to provide a spread of difficulty, using starter decks the first should be quite doable, while the last quite hard.If you are struggling with the first, then there is at least a small chance you are doing something wrong rules-wise.\n\n \n\nAlternatively, if you are playing solo, it may be that you would find the game easier playing two-handed. Most of the starter decks lack roundness, and you can struggle to do both questing and fighting with any one sphere. If that doesn't do it, try building your own muli-sphere decks as Lecitidan suggests.\n\n \n\nI recommend reading this: TalesfromtheCards -Things I wish I had known starting lotr lcg [https://talesfromthecards.wordpress.com/2013/01/03/5-things-i-wish-i-wouldve-known-when-i-started-playing-lotr-lcg/] and maybe this: https://boardgamegeek.com/blogpost/16397/guide-new-lotrlcg-solo-players [https://boardgamegeek.com/blogpost/16397/guide-new-lotrlcg-solo-players]or this: https://boardgamegeek.com/thread/1294079/back-basics-two-pair-tandem-decks-using-one-core-s [https://boardgamegeek.com/thread/1294079/back-basics-two-pair-tandem-decks-using-one-core-s]\n\n \n\nAnd here is a video of people playing the first scenario with only core cards, so it could be informative regarding some implied play advice and a bit of seeing the rules in action: Passage Through Mirkwood - LOTR LCG Progression Series Ep.001 [https://www.youtube.com/watch?v=tHHOLzy2T5U]\n \n\nEdited December 22, 2016 by RichardPlunkett"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2554408","commentId":2554408,"userName":"dr00","timestamp":1482378742,"content":"i would also suggest trying out two-handed solo (play two decks at the same time by yourself). there's a bit more bookkeeping, but it will make things a bit easier for some of the earlier quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2554581","commentId":2554581,"userName":"TwiceBorn","timestamp":1482393288,"content":"As I recall, using the starter decks provided in the Core set, I think I only beat the first quest solo using the Leadership deck as well (and maybe once with Spirit?). The Tactics deck solo is completely useless.\n\n \n\nAs Lecitadin suggested, combining spheres might help you achieve success more easily. I certainly found that was the way to go with the second quest, and also with the quasi-impossible third quest solo.\n\n \n\nGood luck jp1971!\n\nEdited December 23, 2016 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237114-solo-play-%E2%80%94-am-i-getting-something-wrong/?do=findComment&comment=2555513","commentId":2555513,"userName":"The Thing In The Attic","timestamp":1482437852,"content":"I remember struggling with the core set quests with only the core set cards. I discovered though that I was missing some rules, not using the action windows properly (especially in the quest phase), not using encounter deck manipulation and not using certain cards: Steward of Gondor and unexpected Courage are essential.\n\nI also hadn't grasped the core fundamental concepts of the game in that the base line rules give you one resource per hero, one new card per turn, no inherent healing and no inherent readying, no inherent threat reduction. You have to build all of that into your deck with your cards. However each sphere is good at only one of those things so lore for healing, spirit for threat reduction, Leadership for resources etc, but if you use multi sphere decks then it's harder to get working.\n\nThis is what makes it a great game... It's a real conundrum every time you build a deck or play a quest. You'll never have enough with one core set though, start getting the adventure cycles (deluxe and adventure packs) to increase your card pool."}]}