{"url":"https://community.fantasyflightgames.com/topic/237105-desperate-alliance-limit-1-per-phase/","title":"Desperate Alliance - limit 1 per phase?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/237105-desperate-alliance-limit-1-per-phase/?do=findComment&comment=2544417","commentId":2544417,"userName":"RichardPlunkett","timestamp":1481852935,"content":"The Desperate Alliance card has text that says:\n\nAction: Choose a hero you control. Until the end of the phase, give control of that hero and all resources in that hero's resource pool to another player. (Limit 1 per phase.)\n\n \n\nWhat does that limit actually limit?\n\nThe rules seem to say that limits like these are card specific, so I can't use the Action on this specific instance of this card more than once in a phase, but since it's an event I could never have done that anyway.\n\nMost limits like this are on characters or attachments, and the rules don't seem to cover the case for events.\n\n \n\n \n\nI have these theories regarding this limit:\n\n \n\n1) It has no effect at all, I am free to use a second copy or Dwarven Tomb to give away a second hero.\n\n2) I am free to use a second copy, but not to Dwarven Tomb/replay the first copy.\n\n3) Each player can't  use this effect (ie a card with this title) more than once per phase.\n\n4) The players as a group can't use this effect more than once per phase.\n\n \n\nTheory 1 is most consistent with the \"limit\" rules, but clearly struggles vs the golden rule (if they added the card text, it should do something).\n\nTheory 2 seems kind of stupid. The rules say cards become new instances when the go to the discard pile, so using Dwarven Tomb to replay it should be no different than holding a second copy.\n\n \n\nBut theories 3 & 4 are any real without justification, nor can I see how to pick between them.\n\nIf this was CoC the fact it says \"limit 1\" instead of \"limit once\" would make it a player limit by card name, making this seem like an attractive compromise. But, this game is a coop, so should it limit a single player or the group?\n\n \n\nCan anyone cast some light on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237105-desperate-alliance-limit-1-per-phase/?do=findComment&comment=2544459","commentId":2544459,"userName":"sappidus","timestamp":1481857197,"content":"Previously discussed here: https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/ [https://community.fantasyflightgames.com/topic/180521-desperate-alliance-and-once-per-phase/]\n\nTL;DR: \"...only 1 copy of [Desperate Alliance] can be played by a player group in a phase.\" Caleb essentially issued an erratum to Desperate Alliance.\n\ncf. https://community.fantasyflightgames.com/topic/230371-limit-once-per-phase/ [https://community.fantasyflightgames.com/topic/230371-limit-once-per-phase/]\n\nEdited December 16, 2016 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237105-desperate-alliance-limit-1-per-phase/?do=findComment&comment=2544460","commentId":2544460,"userName":"GrandSpleen","timestamp":1481857369,"content":"That applies to Heavy Stroke as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237105-desperate-alliance-limit-1-per-phase/?do=findComment&comment=2545021","commentId":2545021,"userName":"RichardPlunkett","timestamp":1481891085,"content":"I feared that would be the case.\n\nThanks, and my apologies for not finding that myself."}]}