{"url":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/","title":"Card Tokens Prototype: Need Opinions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2546675","commentId":2546675,"userName":"John Constantine","timestamp":1481973637,"content":"Hello.\n\n \n\nPrehistory (feel free to skip to the point): So, I've recently soft-finished my \"LotR LCG Rework\" Project (still applying small fixes, but nothing major planned at the moment), and there was a person who to my surprise asked me about the status of my old, long forgotten projects, and expressed the hope that I would revisit them one day.\n\n \n\nWhich I started doing a couple of days ago, I started revisiting my Esgaroth expansion. It's kinda embarassing actually, looking at my old work :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] So many things I could have done better. \n\n \n\n \n\nThe point: I started prototyping a new (not actually) thing - token cards. I'll provide current prototypes for evaluation below. \n\n \n\nThe concept is simple: Token cards are cards that are not included into a deck, but are kept in an out of play area and introduced into the game by various game effect, think Ranger of the North. But I decided to give it a \"Token\" subtype to allow me to affect those cards with rules separately.\n\n \n\n \n\nThe rules: \n\nWhile in a player's hand, token cards are not considered to be in the players hand for any game effects purposes.\n\nExample: You can't discard them to pay for card effects, you can't discard them from encouner card effects, you do not count them as part of your hand in Dunland quests, etc.\n\n \n\nIf a token card would enter an out of play state other than player's hand, remove it from the game instead.\n\nExample: Any effect that causes a token card to enter a player's discard pile, or be shuffled into his deck would cause the token card to be removed from the game.\n\n \n\n \n\nThe reason behind those rules: Card economy is the main reason. If I am to introduce a way to add cards to the player's hand, I must make sure Noldor can't skyrocket their discard engines with them. I also must make sure that encounter card effects that punish hand size don't inflate their effectiveness because of all those tokens, as well as card-discarding encounter effects don't grow weaker because of the hand watered down with tokens.\n\n \n\n \n\nWhat I'm asking for: Is educated feedback regarding this concept. By educated I mean feedback that bears actual points regarding the concept, not the \"it sux/rox\" type. The concept as a whole, not the example cards I'm gonna post below, because they are just a quickly made proofs of the concept. I'll be very greatful for any thoughts.\n\n \n\n \n\nCard examples:\n\n \n\nvuJPPCwH95g.jpg [https://pp.vk.me/c636717/v636717009/48704/vuJPPCwH95g.jpg]\n\n \n\nYxbekiWcRH8.jpg [https://pp.vk.me/c636717/v636717009/48714/YxbekiWcRH8.jpg]\n\n \n\nH8mFHvIsewY.jpg [https://pp.vk.me/c636717/v636717009/4871c/H8mFHvIsewY.jpg]\n\n \n\nBcthWJTtNYU.jpg [https://pp.vk.me/c636717/v636717009/48724/BcthWJTtNYU.jpg]\n\n \n\nWPne55UmuzA.jpg [https://pp.vk.me/c636717/v636717009/4870c/WPne55UmuzA.jpg]\n\n \n\n \n\nThank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2546792","commentId":2546792,"userName":"Kakita Shiro","timestamp":1481984431,"content":"In my own experience, cards that generate other cards put them into play directly so I would mimic that.\n\nI would also explicitly print on all the tokens/created cards that they cannot be included in your draw deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2546816","commentId":2546816,"userName":"John Constantine","timestamp":1481985607,"content":"I've seen plenty of different things, things that go in hand particularly striked my fancy as they add new layer of strategy, so to say. Different card back \n\n \n\nThat's why I printed the \"token\" on their type, to avoid flooding the text box of each card with the restriction from including in the deck by just implementing the rule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2547867","commentId":2547867,"userName":"Eldainorn","timestamp":1482053697,"content":"Wow this is a neat idea! I really dig it! The possibilites are huge and I think that it would bring quite a change to the game. If only the devs would pick this up and cite you in the expansion under 'Additional development'. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2547891","commentId":2547891,"userName":"John Constantine","timestamp":1482055639,"content":"> Wow this is a neat idea! I really dig it! The possibilites are huge and I think that it would bring quite a change to the game. If only the devs would pick this up and cite you in the expansion under 'Additional development'. \n\nThey did a similar thing with their Ranger of the North, didn't they? Judging by how none other cards released after him had any similarity, I think they decided against it. Maybe production cost is too high, or comissioning 2 arts for technically 1 card it too expensive or someting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550235","commentId":2550235,"userName":"Calyx","timestamp":1482178917,"content":"I am ambivalent about having cards enter from out of play - don't really use Ranger of the North much, but I suppose I am open to the idea. However, I think making this a different class of card that doesn't interact with hand & card effects adds unnecessary complications. I'd rather they be either completely normal cards (in which case, the allies would say \"search your deck for one...\") or simply normal cards that start out of play. I don't think this would mess with hand size and discard effects too much - in both illustrative cases, the ally you play simply replaces its self, keeping hand size constant.\n\n \n\nThumbs up for creativity, though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550271","commentId":2550271,"userName":"John Constantine","timestamp":1482180205,"content":"\"ambivalent\" - wow, made me look this one up :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n\n \n\nI understand that those rules might get confusing at first, but I assure you they are pretty simple to follow because they apply only while in your hand. And the card economy here is really important to preserve in it's original state because, lets say, I want to create event that adds 3 token allies to your hand from out of play. Or something else that would give you technically more cards than you spend with considerably less effort than usual. Discarding-triggered cards can go bonkers, encounter deck will have hard time getting rid of the useful cards out of your hand, and raving mad men from Dunland will tear you apart :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550332","commentId":2550332,"userName":"Gizlivadi","timestamp":1482181941,"content":"> \"ambivalent\" - wow, made me look this one up :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n> \n>  \n\n \n\nYou can't be serious."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550486","commentId":2550486,"userName":"John Constantine","timestamp":1482186939,"content":"> > \"ambivalent\" - wow, made me look this one up :o [//content.invisioncic.com/Mfantflight/emoticons/default_ohmy.png]\n> > \n> >  \n> \n>  \n> \n> You can't be serious.\n\nI can and I am. Never encountered that word before, at least not that I can remember."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550643","commentId":2550643,"userName":"Gizlivadi","timestamp":1482192025,"content":"Interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2550866","commentId":2550866,"userName":"Bullroarer Took","timestamp":1482202962,"content":"I like the idea. I think the blacksmith is a bit under-costed. 2 for a 1-1-1-2 vanilla isn't bad. Is the heading remedy supposed to be a ore time use?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2551020","commentId":2551020,"userName":"John Constantine","timestamp":1482211698,"content":"> I like the idea. I think the blacksmith is a bit under-costed. 2 for a 1-1-1-2 vanilla isn't bad. Is the heading remedy supposed to be a ore time use?\n\nConsider that you then have to pay for the token attachment too, so the body costs 2, and then you have to pay 1 for what it gives you.\n\n \n\nYes, Rejuvenating Brew is an event, and a token one at that, so immediately after you play it, it goes away into an out of play area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2551702","commentId":2551702,"userName":"Bullroarer Took","timestamp":1482250681,"content":"> > I like the idea. I think the blacksmith is a bit under-costed. 2 for a 1-1-1-2 vanilla isn't bad. Is the heading remedy supposed to be a ore time use?\n> \n> Consider that you then have to pay for the token attachment too, so the body costs 2, and then you have to pay 1 for what it gives you.\n\nIt's still a card. When you ran through your card changes that's what I noticed most: you gave Master of the Forge 1 WP. The guy is busted enough as it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2551772","commentId":2551772,"userName":"John Constantine","timestamp":1482252064,"content":">  \n> \n> >  \n> > \n> > > I like the idea. I think the blacksmith is a bit under-costed. 2 for a 1-1-1-2 vanilla isn't bad. Is the heading remedy supposed to be a ore time use?\n> > \n> > Consider that you then have to pay for the token attachment too, so the body costs 2, and then you have to pay 1 for what it gives you.\n> \n> It's still a card. When you ran through your card changes that's what I noticed most: you gave Master of the Forge 1 WP. The guy is busted enough as it is.\n\nHaven't you noticed the trend? 3 is now a cost for powerful allies. There is a 2/2/0/2 non-unique rohan ally spoiled which does not exhausts to quest when you have a sidequest in victory display. And you want me to price a 1/1/1/2 ally with 3 resources just because he enables you to then pay 1 resource for a weapon that gives +1 attack for one attack once per round? No, thanks. \n\n \n\n1 willpower on master of forge is justified because his ability makes him exhaust, rendering that willpower useless. The way original master of forge is, he may have been an attachment. When I see an ally with exhaustment ability, I expect him to be able to do something if he doesn't exhaust, otherwise there is no point in it, no tradeoff, no decision involved.\n\nEdited December 20, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552060","commentId":2552060,"userName":"Seastan","timestamp":1482258996,"content":">  \n> \n> >  \n> > \n> > >  \n> > > \n> > > > I like the idea. I think the blacksmith is a bit under-costed. 2 for a 1-1-1-2 vanilla isn't bad. Is the heading remedy supposed to be a ore time use?\n> > > \n> > > Consider that you then have to pay for the token attachment too, so the body costs 2, and then you have to pay 1 for what it gives you.\n> > \n> > It's still a card. When you ran through your card changes that's what I noticed most: you gave Master of the Forge 1 WP. The guy is busted enough as it is.\n> \n> Haven't you noticed the trend? 3 is now a cost for powerful allies. There is a 2/2/0/2 non-unique rohan ally spoiled which does not exhausts to quest when you have a sidequest in victory display. And you want me to price a 1/1/1/2 ally with 3 resources just because he enables you to then pay 1 resource for a weapon that gives +1 attack for one attack once per round? No, thanks. \n> \n>  \n> \n> 1 willpower on master of forge is justified because his ability makes him exhaust, rendering that willpower useless. The way original master of forge is, he may have been an attachment. When I see an ally with exhaustment ability, I expect him to be able to do something if he doesn't exhaust, otherwise there is no point in it, no tradeoff, no decision involved.\n> \n>  \n\n \n\nI think an even better point of comparison you could use is the spoiled Dunedain Lookout - 2 cost 1/1/1/2 ally that can discard himself to cancel the when revealed effects of an enemy. He's technically undercosted by the stats = 2x cost formula, but it's easier to get away with that when you have an even stat spread.\n\n \n\nAs for the token attachment/item idea. I don't like it, mainly due to the confusing interaction with your hand size and discard, etc. Here's how I would sidestep it:\n\n \n\nRules:\n\nToken cards are not added to the player's deck. They are instead set aside at the start of the game along with the cards with the encounter keyword. If a Token card ever leaves play, remove it from the game.\n\n \n\nCards:\n\nHard-working Craftsman:\n\nAfter you play Hard-working Craftsman from your hand, attach a set-aside Well-crafted shield or a Steel-forged blade to a character.\n\n \n\nAspiring alchemist:\n\nAction: Remove a set-aside copy of Rejuvenating Brew from the game to perform its action.\n\n \n\nThough with that second one I'm not sure why it isn't just an ability on the ally with a built-in limit.\n\n \n\nThe point is, even though these don't 100% match what your cards do, I think you can mimic this whole mechanic close enough without dealing with the hand/draw/discard issue (which I don't really see as a big deal anyway)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552273","commentId":2552273,"userName":"John Constantine","timestamp":1482264503,"content":"It's not a token attachment idea, it's a token player card idea. It can be anything - attachment, event, ally, sidequest if you're crazy, it can shuffle a token enemy/location/treachery into the encounter deck as a downside.\n\n \n\nHey, the only reason why I'm doing this whole \"confusing rules\" thing is to preserve the game balance, but even you don't see it getting out of control?.. Well, then I might just drop them alltogether.\n\n \n\nYou can't mimic the whole mechanic by introducing half-measure of two proofs of concept I provided. How would you mimic an event that will add 3 ally tokens to your hand? There is so much to explore within that mechanic, those little basic examples I provided don't even begin to cut it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552309","commentId":2552309,"userName":"Seastan","timestamp":1482265378,"content":"> How would you mimic an event that will add 3 ally tokens to your hand?\n\n \n\nAttachment. Attach to a hero. Action: Play a set-aside _____ token-ally, paying its resource cost. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552330","commentId":2552330,"userName":"John Constantine","timestamp":1482265854,"content":"...which is completely different from what I've said, and is also uses side-board."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552356","commentId":2552356,"userName":"Seastan","timestamp":1482266572,"content":"I don't have a problem with the sideboard, just the hand/discard rulings. But I don't see why my suggestion is completely different from what you asked for. Once played, you have the ability to play 3 allies from your sideboard. Maybe write \"limit 3 times per game\" if you want to allow more than 3x of the card in the sideboard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552373","commentId":2552373,"userName":"John Constantine","timestamp":1482267153,"content":"Ok, lets assume I lift the in-hand rules. Lets elaborate.\n\n \n\nAttachment: \n\nVulnerable to attachment hate, you lose all the remaining uses if it gets discarded.\n\n \n\nEvent:\n\nIs a card in your hand until played, so you'll lose everything if it gets discarded.\n\nAdds ally cards directly to your hand, so they are vulnerable to hand hate too, such as Dunland or discard mechanics.\n\nFloods your hand, making it more difficult for discard mechanics to discard something of actual value from your hand.\n\nIndividual tokens in your hand independent from each other, if one gets discarded - others remain in your hand until discarded or played.\n\nCan be used to fuel discard enginges, providing cheap cards to burn without significantly affecting your hand state.\n\n \n\n \n\nThat's kinda heavy difference to me.\n\nEdited December 20, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552543","commentId":2552543,"userName":"Seastan","timestamp":1482272697,"content":"I was comparing it you your token rules as you defined them (where they are in your hand, but not really). Yes, there are a lot more differences if you take away those rules.\n\n \n\nThe main difference is that my version is susceptible to attachment hate. Now, this is just my opinion of course, but that doesn't seem like a big enough deal to warrant a whole new set of un-intuitive rules.\n\nEdited December 20, 2016 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552599","commentId":2552599,"userName":"Calyx","timestamp":1482275135,"content":"I agree with Seastan - the extra card class and supplemental rules are unnecessary. I don't share your concerns about hand size and specific quests (ie. Dunlandings) - certain deck types have always been poor against specific quests. Trap decks are totally ineffective against The Three Trials, but trap cards themselves are excellent additions to the card pool.\n\n \n\nIf you are worried about player-induced interactions, as with Noldor, you could simply add something along the lines of \"This card cannot be optionally discarded from your hand\" to the top of the text box. This would be a more flexible option, since there are some potential token cards - including your proof of concept ideas presented here - that wouldn't need that restriction. It would also dramatically simplify things, which can only help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2552622","commentId":2552622,"userName":"dr00","timestamp":1482276121,"content":"> Hey, the only reason why I'm doing this whole \"confusing rules\" thing is to preserve the game balance\n\ni think it overcomplicates things for not much reward for the sake of game balance\n\nLindir, for example, lets you draw 3 cards if you have a hand full of tokens, so what do we do about him? and what would happen with Old Bogey-stories?\n\nonce we start looking at other cards that affect how these things will work, it adds more layers of complexity. it also limits the scope of design for future cards; imagine a 'discard your hand of x cards to draw x cards' effect\n\ni also don't think rules need to exist just so it's not considered overpowered with certain archetypes. just balance the cost/traits accordingly\n\ni also think that a lot of this could have been sidestepped if they just brought into play whatever it was they had (or played the event at the same time)\n\nand yes i know how it shortens the window of playable events with this theme, but my point is that it's overly complicated, and it doesn't need to be.\n\none last point on balance: i also think that cards shouldn't be balanced based on certain quests. some quests will invariably favour some archetypes, card combos, etc. and invalidate others, and i think that this is an intended and important part of the game.\n\nsome cards come out in a particular cycle are meant to be strong in those certain quests, but i've never seen anything purposefully try to invalidate encounter mechanics, even from the cycle they're released in\n\nanyway, that said, i like the idea overall. for example, what i like about the Ranger of the North in the game is that it opens up the chance that they could print a different version of the card and could give the players a choice of which Ranger of the North is shuffled into the encounter deck\n\nin your concepts, i think i liked the first concept better, where you give a choice. the player can look at the board state and choose whether or not they would like more def or more atk\n\ni think that's kind of what's necessary here as well. why? why not just make an attachment that lets you choose atk or def? or why not just make an ally that can be discard for the potion effect?\n\nfor the first question, i think it overly complicates things, so i like the set aside cards in how they make this interesting*. for the second, i don't see a reason, but if there were a choice in events, that would help.\n\ni also think that you should be able to give the card to anyone's hand (perhaps not every card). this opens up a few options but also allows the design space to consider a more powerful effect that only affects 'your' heroes/characters/engaged enemies/etc.\n\nand i agree with Seastan for attachments. simply have them come into play at the same time and adjust costs accordingly. it makes more thematic sense that way as well imo\n\n*also, did you consider that the ally could leave/re-enter play several times and could end up with all 6 attachments? is that an intended effect? even with the enters play from hand restriction, Dwarven Tomb could easily workaround this"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553182","commentId":2553182,"userName":"John Constantine","timestamp":1482324357,"content":"> I was comparing it you your token rules as you defined them (where they are in your hand, but not really). Yes, there are a lot more differences if you take away those rules.\n> \n>  \n> \n> The main difference is that my version is susceptible to attachment hate. Now, this is just my opinion of course, but that doesn't seem like a big enough deal to warrant a whole new set of un-intuitive rules.\n\nThe thing is, differences start to pop up when you take away those rules, and that was the main reason why I implemented them in the first place. However if even someone like you is not bothered by potential OP scenarios, I'll just drop them. Less work and things to consider for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553213","commentId":2553213,"userName":"John Constantine","timestamp":1482326737,"content":"dr00, Lindir case sounds perfectly fine to me, because, if we take currently presented tokens, a hand full of +1atk/def attachments and 0 costs heal 1 events is not that much of a hand to begin with. Old Bogey stories are simple: You shuffle all of your non-token cards into your deck and draw 6 cards. \n\n \n\nNo, adding cards to hand - of anything, that is not overly complicated.\n\n \n\nI bring up Dunland as a main offender, there are plenty of hand-discarding stuff to go around in many different quests.\n\n \n\nWhy not make ally that discards itself fof heal? How is it remotely the same as having an event that healds separately from the ally that brought it to life? That ally might be gone by the time you trigger that event. That ally can do various things after you trigger that event. That ally doesn't needs to be in play when you trigger it. The list goes on.\n\n \n\nYes, I considered that option. There are honestly plenty of more powerful things to do with the Dwarve tomb than bringing a Blacksmith back and forth for those little attachments :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI don't agree on your thematic point. Blacksmith is not an outfitter. Giving you a weapon or armor piece that you can then attach to anybody who seems fit is more thematic in my book for a craftsman than instatntly equipping it as soon as it pops."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553556","commentId":2553556,"userName":"xchan","timestamp":1482340812,"content":"I really like what you are trying to do with the craftmen. Token cards really fit their theme, although I would like for them to trigger from something else than the character just entering the game, as that doesn't scream \"craftmanship\" to me.\n\n \n\nI'm not sure about the rules either. Tokens in other games use to come in play to avoid extra complications. I understand that you want to give some additional layer of complexity, but maybe it could be done differently? Also, like others have pointed out, you could end up with the 6 tokens in your hand with some enter play shennanigans in one round, so I don't know if a limit should be included.\n\n \n\nMy options would be something like this (note that I changed the \"token\" tag to a \"crafted\" tag to avoid confusing them to the progress tokens I suggest using, but that's up to you):\n\n \n\nThe Rules:\n\nCrafted cards are not part of your deck. Instead they are placed off to the side (crafting deck?). A token works just like a regular card except that if it ever leaves play it's removed from the game instead (or goes back to the sideboard/crafting deck). \n\n \n\n \n\nOPTION A\n\n \n\nNew keyword\n \nCraftmanship (X). When this character enters play (from your hand?), put X progress tokens on them.\n \nHard-working Craftman\n \nCraftmanship (4)\n \nAction: Remove 1 progress token from Hard-working Craftman to choose one: attach a Steelforged Blade crafted attachment to a character, or attach a Well-crafted Shield crafted attachment to a character. (Limit once per round/phase, if needed to prevent abuse)\n \nAspiring Alchemist\n \nCraftmanship (3)\n \nAction: Remove 1 progress token from Aspiring Alchemist to play a Rejuvenating Brew crafted event from your crafting area as if it were in your hand. (Limit once per round/phase, if needed to prevent abuse)\n\n \n\nYou can then play with different triggered conditions. Some powerful tokens can require extra costs like exhausting the craftmen, or could require some triggering condition first (make them responses then) ala \"Response: After Nonamed Craftman attacks and destroys an enemy, remove X progress tokens to put X number of crafted attachments/allies/sidequests into play.\" or \"Response: After No-named Craftman commits to the quest, remove 1 progress token to play a Crafted trap attachment on the active location\".\n\nYou can also limit the number of tokens that enter play each round buy putting a limit on the actions to keep them balanced.\n\nOPTION B\n\nGain progress tokens activelly.\n\n \n\nHard-working Craftman\n \nResponse: After Hard-working Craftman commits to the quest/attacks/defends/enters play from your hand, put 1 progress token on him.\n \nAction: Remove 1 progress token from Hard-working Craftman to choose one: attach a Steelforged Blade crafted attachment to a character, or attach a Well-crafted Shield crafted attachment to a character. (Limit once per round/phase, if needed to prevent abuse)\n \nAspiring Alchemist\n \nResponse: After Aspiring Alchemist commits to the quest/attacks/defends/enters play from your hand, put 1 progress token on her.\n \nAction: Remove 1 progress token from Aspiring Alchemist to play a Rejuvenating Brew crafted event from your crafting area as if it were in your hand. (Limit once per round/phase, if needed to prevent abuse)\n\nThis option can be more flexible as you can decide when and how your craftmen get their tokens, but the text can become more cumbersome.\n\n\nEither way, I'm looking forward to whatever this ends up.\nEdited December 22, 2016 by xchan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553627","commentId":2553627,"userName":"Distractionbeast","timestamp":1482343858,"content":"I like the concept - specifically building on the mechanics of Ranger of the North.  \n\n \n\nI don't think that splintering the card base too much is the best way to do this however.  I actually think Ranger of the North would be more effective if there were multiple versions (as previously mentioned).  This is the same effect we see with character-specific attachments: Vilya ONLY works with Elrond, etc.  It severely reduces the ability for players to utilize the precious few cards produced in each cycle.  And the special case rules make them difficult to work with and interact with other cards.\n\n \n\nPerhaps a more general approach would be better?  Like creating a specific class of sideboard cards - like your \"token\" cards - which can be drawn into play by other cards, but otherwise obey the other rules of the game.  However, what I'd propose is perhaps NOT requiring an actual sideboard, but simply allowing players to draw the card in from their collection.  This would provide the ability to dynamically react to a scenario without having to build those cards into your deck beforehand.  As a balance, these cards would probably need a steeper cost curve to offset their adaptability and accommodate an expandable pool of such cards.  It would not be wise to balance them in such a way as to encourage most decks to use them for each scenario.  But a dynamic, adaptable class of cards might be sustainable within the game.  I haven't thought through the details though.\n\n \n\nFor example:  \n\n \n\nA dwarf ally \n\n0/1/0/2  2 cost\n\n \n\nSpend 2 resources to add a token weapon or armor attachment to your hand. Limit once per round.\n\n \n\nGet the attachment from anywhere out of the game.  Add it to your hand.  Once in hand, it acts just like any other card and its cost must be paid to put it into play.  This is a limited example, but hopefully it gets the idea across.  It could also be cards added to the encounter deck or put directly into play, etc.\n\n \n\nFeel free to disagree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553719","commentId":2553719,"userName":"dr00","timestamp":1482346929,"content":"> dr00, Lindir case sounds perfectly fine to me, because, if we take currently presented tokens, a hand full of +1atk/def attachments and 0 costs heal 1 events is not that much of a hand to begin with. Old Bogey stories are simple: You shuffle all of your non-token cards into your deck and draw 6 cards.\n\nmy point is that you need to add new rules for these possible future scenarios, adding further complexity to the token rules\n\n \n\n\n\n> No, adding cards to hand - of anything, that is not overly complicated.\n\ni never said it was. did you even read my post?\n\n \n\n\n\n> I bring up Dunland as a main offender, there are plenty of hand-discarding stuff to go around in many different quests.\n\nthis doesn't really do anything to comment on the actual point i was making\n\n \n\n\n\n> Why not make ally that discards itself fof heal? How is it remotely the same as having an event that healds separately from the ally that brought it to life? That ally might be gone by the time you trigger that event. That ally can do various things after you trigger that event. That ally doesn't needs to be in play when you trigger it. The list goes on.\n\ni don't think you understand my point, but at this point in my reply, i'm starting to think that you're choosing not to\n\n \n\n\n\n> Yes, I considered that option. There are honestly plenty of more powerful things to do with the Dwarve tomb than bringing a Blacksmith back and forth for those little attachments :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nand yet you did not answer my question\n\n \n\n\n\n> I don't agree on your thematic point. Blacksmith is not an outfitter. Giving you a weapon or armor piece that you can then attach to anybody who seems fit is more thematic in my book for a craftsman than instatntly equipping it as soon as it pops.\n\nlol i'm so done. have a good day, sir."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553734","commentId":2553734,"userName":"John Constantine","timestamp":1482347419,"content":"> lol i'm so done. have a good day, sir.\n\nI am currently sick, so pardon me if I interpret incorrectly anything you say. But you are done anyway, so no biggie.\n\n \n\nI'll get to responding to the several other posts above when I have time and clear enough head.\n\nEdited December 21, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2553750","commentId":2553750,"userName":"chrsjxn","timestamp":1482348152,"content":"I dig the idea of tokens. Could have really made Fili/Kili easier to use, for example.\n\n \n\nBut there's a reason other games that use tokens like this just add them to play directly. They look like cards, they usually physically are cards, but it's confusing to have them not behave like cards when doing card things. Like sitting in your hand.\n\n \n\nWhy not just have the tokens come into play in exchange for a bit of extra cost on the ally? Rejuvenating Brew could be a token attachment on the Aspiring Alchemist you have to discard to activate. And if you're worried about paying for everything at once if you want an effect with lots of tokens, you can give a discount. Gathering a bunch of resources in LOTR is more annoying than other games, so very expensive cards should generally be more powerful per resource than cheap ones.\n\n \n\nOr why not just let them behave like cards? There are already cards that really gas up the Noldor archetype, and those fill your hands with better cards than these tokens. (They draw from your deck...)\n\n \n\nBasically: I like the idea, but I don't see why it needs to have more rules attached to it"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2555324","commentId":2555324,"userName":"John Constantine","timestamp":1482431449,"content":">  \n> \n> > dr00, Lindir case sounds perfectly fine to me, because, if we take currently presented tokens, a hand full of +1atk/def attachments and 0 costs heal 1 events is not that much of a hand to begin with. Old Bogey stories are simple: You shuffle all of your non-token cards into your deck and draw 6 cards.\n> \n> my point is that you need to add new rules for these possible future scenarios, adding further complexity to the token rules\n> \n>  \n> \n> > No, adding cards to hand - of anything, that is not overly complicated.\n> \n> i never said it was. did you even read my post?\n> \n>  \n> \n> > I bring up Dunland as a main offender, there are plenty of hand-discarding stuff to go around in many different quests.\n> \n> this doesn't really do anything to comment on the actual point i was making\n> \n>  \n> \n> > Why not make ally that discards itself fof heal? How is it remotely the same as having an event that healds separately from the ally that brought it to life? That ally might be gone by the time you trigger that event. That ally can do various things after you trigger that event. That ally doesn't needs to be in play when you trigger it. The list goes on.\n> \n> i don't think you understand my point, but at this point in my reply, i'm starting to think that you're choosing not to\n> \n>  \n> \n> > Yes, I considered that option. There are honestly plenty of more powerful things to do with the Dwarve tomb than bringing a Blacksmith back and forth for those little attachments :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n> \n> and yet you did not answer my question\n> \n>  \n> \n> > I don't agree on your thematic point. Blacksmith is not an outfitter. Giving you a weapon or armor piece that you can then attach to anybody who seems fit is more thematic in my book for a craftsman than instatntly equipping it as soon as it pops.\n> \n> lol i'm so done. have a good day, sir.\n> \n>  \n\n \n\nOk, dr00, today I took my time to re-read your post, my repsponse to it, and your response to my response, and I find most of my answers to be on point or at least around it, so I den't get what are you getting so offended about. \n\n \n\n1. Those scenarios are not future, they are present, and I believe my current ruling covers most of them, if not all of them. The only problem I can see being risen from this is the case when a player is not supposed to have anything in his hand, or when all cards with a specific trait are supposed to get pulled from hand, but none of there any longer matters because everybody seems to be willing to sacrifice potential balance issues for the sake of less complicated rules. I down with it.\n\n \n\n2. Yes, I did. Or do you think I googled random sentences and responded to them, while pretending I'm responding to your post?\n\n \n\n3. If I am not mistaken, your point there was that \"some archetypes are strong against something but weak against something else\", which I responded to with \"it's not all about archetypes, because cards being discarded from hand is something common, while flooding your hand with tokens is a direct counter to that common thing (the more useless **** you have in your hand - the more is the chance it'll get discarded instead of something you actually care about).\n\n \n\n4. So what exactly I did not understand in your post about ally discarding for heal?\n\n\"why not just make an ally that can be discard for the potion effect?\n\ni don't see a reason, but if there were a choice in events, that would help.\"\n\nThis question/statement makes little other sense to me than the one I responded with. \n\n \n\n5. I did. The answer was: I don't care. If a person is willing to waste a valuable Dwarven Tomb to replicate a +1 atk attachment - it's his funeral. Sheet, he can go further and use Map of Earnil to make it 9, I wonder where he'll be sticking all those blades and shields.\n\n \n\n6. Yes, a thematic disagreement is a thing to be done about, sure. Have a nice one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2555342","commentId":2555342,"userName":"John Constantine","timestamp":1482431930,"content":"xchan, I appreciate the effort, but I did not intend the player card tokens to be a craftsman-specific endavor, I just used them to present it. \n\n \n\nAbout your idea, funny thing, in one of my earlier installments of this Esgaroth expansion, craftsmen used to have Craft X (or something) keyword, which gave the allies permission to hold resources, which can only be used to trigger/pay for stuff printed in their text boxes. I ultimately scrapped that keyword because of the tideousness.\n\n \n\n \n\nDistractionbeast, well, as this is purely fan project which will be used (by me) in some digital (OCTGN) simmulator, production value is out of the table :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nTake note, however, that the way I have it in mind, several different player cards might interact with the same token.\n\n \n\nI'm not sure how user-friendly would be drawing a card from your collection, however. I like the idea of a side-board because when you put a card that creates Rejuvenating Brew tokens, you add respective Rejuvenating Brew tokens to your side board for the time that you need them.\n\n \n\n \n\nchrsjxn, yeah. The Kili might as well be a token :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nI've seen plenty of games adding tokens to player's hand. And there is always a scenario when a tokens get returned to your hand. \n\n \n\nLong story short: I don't like being limited to just directly adding tokens into play. I'll just drop the extra rules.\n\n \n\n \n\n \n\nAnd just disclaimer (probably too late, eh): I'm not against the player card tokens entering play directly, in fact I got plenty of cards doing it already, I just want to have player tokens that go to the hand too, and people seems to find the best solution is for them to not go into hand.\n\nEdited December 22, 2016 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/237213-card-tokens-prototype-need-opinions/?do=findComment&comment=2559677","commentId":2559677,"userName":"Distractionbeast","timestamp":1482769731,"content":">  \n> \n> I'm not sure how user-friendly would be drawing a card from your collection, however. I like the idea of a side-board because when you put a card that creates Rejuvenating Brew tokens, you add respective Rejuvenating Brew tokens to your side board for the time that you need them.\n> \n>  \n\n \n\nInteresting idea.  So the idea is potentially to have a smaller number of sideboard cards and larger number of cards that interact with them?  Still not sure if I'm a fan of the extra complexity this adds to the game, but it's an interesting idea to explore."}]}