{"url":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/","title":"2017 wishes/predictions for LOTR LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2567319","commentId":2567319,"userName":"Gizlivadi","timestamp":1483304096,"content":"Starting a thread so people can post the things they would like or expect too see in the game for 2017 or beyond. Can be in terms of quests, player cards, community events, whatever. For my part these are my top wishes:\n\n \n\n1) Exploration of the Artifact trait.\n\n \n\nWe've gotten Titles, Traps, even Skills lately. Why can't we have more Artifacts? One of Tolkien's chiefest themes is the corruption of wealth and artifice. Powerful, risky magical objects like the Palantiri, Lesser Rings and other jewels should IMO be in the game, as in an actual mini-theme or archetype (not even gonna bother mentioning the current Palantir card), and the forsaken Doomed keyword would be a thematic home run to unify these themes. I want to use more my The Seeing-stone and Keys of Orthanc!\n\n \n\n*As an bonus, I'd really like to see \"saga only\" artifacts such as Sting, Phial of Galadriel, etc as player cards as well.\n\n \n\n2) More Istari heroes.\n\n \n\nRadagast and Saruman need new versions; I think a fair number of people would agree with that. Now that we have Gandalf hero, I think Radagast and Saruman heroes are not too much of a stretch. The latter wizard would ideally work with the Doomed/Artifact theme while Radagast can revitalize Eagles or Creatures (or, as I did in my custom version, deal with resource and sphere matches as a \"changer of hues\"). Alatar and Pallando are, sadly nothing more than a pipe dream at this point.\n\n \n\n3) Bombadil and Goldberry allies.\n\n \n\nI know most players would not like to see these characters as heroes or allies for obvious reasons, but IMO a game that's based on the LOTR novels and aims to be encyclopedic in its detail (taking very obscure characters and places and expanding on them) and DOESN'T have a Goldberry card is doing something wrong. Sure, I'd be against having them as straight up heroes or allies, but IMO the perfect way to incorporate them would be giving them another botched keyword in the game, the Encounter keyword. As soon as I saw the Ranger of the North I thought this mechanic would be just perfect to use with Bombadil and Goldberry allies. Sure, if not playing a quest set in the Shire there's some thematic concessions to be made (isn't the game full of those though?), but for such whimsy characters the Encounter keyword is perfect. You're not calling them outright to your cause, but instead relying a bit on luck to have them pop up on their own will from the encounter deck, which is thematically perfect IMO. An event like \"Hey Dol, Merry Dol\" that shuffled Bombadil into the encounter deck would be so great. And yeah, the Ranger did not receive a great response, but I still think there's easily a way to make them playable and balanced.\n\n \n\n4) Good/player locations\n\n \n\nLong explanation is in dragoncymru's thread. I'd just like to have a card type that represents actual good and helpful locations in the game. If locations are not gonna be \"neutral\" as in MECCG, for thematic reasons I think it'd be fair to have good locations such as Edoras/Minas Tirith, Lórien, etc.\n\n \n\nWhat are your wishes for the future life of the game?\n\nEdited January 1, 2017 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2567841","commentId":2567841,"userName":"Yepesnopes","timestamp":1483366551,"content":"I definitely would like to see heroes make allies, like it was the case with Legolas, Gimli and Sam. I would love to see Aragorn, Elladan and Elrohir allies.\n\nI would like \"official erratas\" for cards which are not used in the game. I don't see the reason why it is accepted the practice to nerf cards but not the practice to \"improve\" cards, Brook Ironfist, Radagast...\n\nI agree regarding the locations, there are some good locations, but very few.\n\nSome eagle heroes\n\nAnother delux expansion :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nAnother saga expansion :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2567871","commentId":2567871,"userName":"Network57","timestamp":1483368634,"content":"More Encounter keywords. I see the need to keep them minimal since they are quite powerful, but only having the Ranger of the North, leaves me wanting more. He's just too good. Consider if he were a regular ally. How much would you pay for a 2/2/2/3 Ranged and Sentinel, with an enters play ability of 2 progress or 2 damage? 5 or 6? And here he costs 1 with the minor drawback of having to be patient for him to cycle through the encounter deck. It's borderline auto-include for any deck that likes Allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2567949","commentId":2567949,"userName":"zeromage","timestamp":1483375894,"content":"1. A good radagast hero first and foremost.\n\n2. Saruman. He should be game changing like Gandalf erestor or boromir too.\n\n3. Heroes for gwahir, landroval, quickbeam, and other ents\n\n4. A new powerful galadriel hero maybe with victory display shenanigans (probably lotr and have some text that gives her spirit if she has nenya).\n\n5. A new Elrond hero\n\n6. Go back to basics ... let's go back to middle earth proper no more pirates or deserts (I know they're in the books but it doesn't have the right feel for me anyway)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2567973","commentId":2567973,"userName":"dragoncymru","timestamp":1483378030,"content":"I'd love to see some more of The Shire and also more of Dale/Esgaroth.\n\n \n\nA visit to Thranduil's hall, the woodland Realm and a Thranduil Hero/Ally\n\n \n\nPlus Havens of course!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2568009","commentId":2568009,"userName":"Bullroarer Took","timestamp":1483381256,"content":"I wish that the game continues to die at the same rate it has been."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2568048","commentId":2568048,"userName":"Khamul The Easterling","timestamp":1483384504,"content":"A return of Richsabre and Glaurung days"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2568106","commentId":2568106,"userName":"Hawkstrike","timestamp":1483388475,"content":"1. Rosie Cotton hero\n\n2. The Scouring of the Shire\n\n3. A campaign in the Norther Wilderlands around Esgaroth, Dale, the Iron Hills, the Grey Mountains, and the Withered Heath (with maybe a stop in the Woodland Realm)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2568107","commentId":2568107,"userName":"Estel Edain","timestamp":1483388496,"content":"This year should see the release of the final Lord of the Rings saga box, The Mountain of Fire. I get the impression that many players have been waiting for the sixth box to come out before starting their main campaign (rather than continuing a paused campaign). I'm hoping for an epic finale and some strong thematic player cards in 2017 to support campaign playthroughs.\n\n \n\nMy goal for my campaign is to recreate the books as closely as possible. Since I'll play most quests solo (with some two or three-handed where that better fits the story) and I want to minimize swapping heroes, I'm hoping to get ally versions of several key thematic characters. Specifically, I'd love to get ally versions of Aragorn (for A Knife in the Dark and Flight to the Ford), Merry and Pippin (for The Ring Goes South and Journey in the Dark), Éomer (for The Uruk-hai), and the twins (for The Flame of the West quests).\n\n \n\nHelm's Deep is an epic quest that I'd like to play two-handed. so I'm also hoping for a hero version of either Gamling (who'd fit together with Théoden, Éomer, Háma, and the Three Hunters) or Grimbold (who'd fit into a reinforcements deck with Gandalf and Erkenbrand). A Spirit hero version of Sam would be nice for The Shadow of the Past, to get willpower out more quickly (to pair with Spirit Pippin; Merry wasn't present in those chapters, and I'd love to avoid fighting Nazgûl with Out of Sight, Hobbit-sense, and A Elbereth Githoniel).\n\n \n\nMore generally, I'm hoping to see more support for secrecy/low-character/hobbit decks this year, like Strider and Taste it Again! I would love to complete the Frodo and Sam quests (not counting Journey to the Cross-roads) with my only other characters representing support from afar: hero Galadriel and non-permanent allies Gandalf and Elrond. I'm also hoping to see more support for some of the weaker traits, like Rohan, and I'm excited about Rider of Rohan, spoiled in the preview for Beneath the Sands.\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2568363","commentId":2568363,"userName":"soullos","timestamp":1483404032,"content":"More support for Doom and Encounter keywords player cards.\n\n \n\nMore dwarven \"mining\" archetypes.\n\n \n\nCreature player cards (give us a reason to dust off ol' Radaghast)\n\n \n\nRe-do on Eagles and finally some Eagle heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570090","commentId":2570090,"userName":"Authraw","timestamp":1483503629,"content":"I predict that this year will bring us new versions of Sam and Eomer as heroes--I'm thinking Eomer will be the hero in The Black Serpent, but he might be in the Saga box instead... we'll see.\n\n \n\nI'm still hoping for a Thranduil hero, but I have no reason to believe he'll be in this cycle over any other cycle. Same goes for further development of the Dale trait; I would love it if the next Saga box basically put Dale on the map as a cohesive tribe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570112","commentId":2570112,"userName":"pmdoug","timestamp":1483505460,"content":"> I predict that this year will bring us new versions of Sam and Eomer as heroes--I'm thinking Eomer will be the hero in The Black Serpent, but he might be in the Saga box instead... we'll see.\n> \n>  \n> \n> I'm still hoping for a Thranduil hero, but I have no reason to believe he'll be in this cycle over any other cycle. Same goes for further development of the Dale trait; I would love it if the next Saga box basically put Dale on the map as a cohesive tribe.\n\nGood picks. Thranduil is the most notable missing character, and is long overdue for an appearance. Sam deserves a second hero version and would fit wonderfully in Tactics, Spirit, or Fellowship. I hope that the new Eomer is in Leadership, and that his ability complements Tactics Imrahil's. The bond between a father-in-law and son-in-law must never be broken! \n\n \n\nBut the birth of an actual Dale trait is my greatest hope. The final Saga box is on the horizon, and I'm a bit afraid of having an anticlimactic cycle released around or after The Mountain of Fire drops. I think it would be a great solution to focus the next cycle on the war in the north that happens concurrent to the main story of the Lord of Rings. The heroes that don't typically fit into players' thematic Saga fellowships would get a chance to shine.\n\nEdited January 4, 2017 by pmdoug"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570343","commentId":2570343,"userName":"Rajam","timestamp":1483531391,"content":"Gollum hero"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570355","commentId":2570355,"userName":"Crabble","timestamp":1483532538,"content":"An eagle hero would be so nice!!! Eagles are still good and can be played but they are just so daimn expensive. An attachment to give Prince Imrahil the eagle trait would be nice too but I figure that will not gonna happen (or will it?! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] ).\n\nEdited January 4, 2017 by Crabble"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570372","commentId":2570372,"userName":"Rajam","timestamp":1483533618,"content":"Attachment that gives the Hobbit trait. That + 3x Fast hitch would be awesome"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570527","commentId":2570527,"userName":"PocketWraith","timestamp":1483539883,"content":"Well, we're gettig Mountain of Fire this year. Some people have speculated that maybe the final quest will be a dual thing - fighting at the Black Gate at the same time that Frodo is trying to destroy the Ring. If this is the case, then I think that would be an excellent place for them to re-use the Epic Multiplayer rules from Siege of Annuminas (as an option, obviously, not a compulsory thing)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570775","commentId":2570775,"userName":"awp832","timestamp":1483547413,"content":"Mostly looking forward to the Saga box.   I would really like to see:\n \n\n1.  Eagles.  Would be a perfect time to do it.  Eagles have pretty much gotten nothing since the end of the first cycle, and they're still pretty okay.   But now you can generally do the same thing as Eagles better in some way,  so I want to see the Eagles come back, especially since they have a nice little role in RotK.  I don't know how,  whether it's a Gawahir hero, or Eagle cards of other spheres, or just some more solid cards that are Eagles or interact with the Eagle or Creature type, doesnt much matter.  But I'd like to see a return to the birds, I really would.\n\n2.  Ally versions of the Eowyn/Eomer/Theoden/Merry/Pippin.   I would be thrilled to death with any or all of these.  Rohan has to choose their heroes so carefully you just often don't get to play with some of the big storyline characters because none of them have ally versions.  I don't run Eomer in my Rohan deck and that's just sort of a shame because I really like Eomer, but he never shows up on the table because I need those hero slots.  My #1 choice for an ally here would be Eomer, but I would accept Eowyn or Theoden too.\n\nMerry and Pippin just seem like natural allies to me.  The seem to have the feel of allies in the RotK.  Frankly, we already have allies for most of the fellowship, Gandalf, Boromir, Legolas, Gimli, Sam.  I should think we could get a Merry and Pippin. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2570943","commentId":2570943,"userName":"Calyx","timestamp":1483551499,"content":"I am really hoping that we can explore Dale. I'd like to see that trait fleshed out, and it would be fantastic to have a cycle around Dale and the Lonely Mountain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2571172","commentId":2571172,"userName":"Bullroarer Took","timestamp":1483556432,"content":"I really thought we'd see a \"Red Arrow\" card in the last saga box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2571455","commentId":2571455,"userName":"Gizlivadi","timestamp":1483563632,"content":"Yes, the Red Arrow is another important artifact that still hasn't appeared yet. I could see it in the last saga box much like we saw Gamling and Snowmane and other \"out of storyline\" things in The Land of Shadow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2572153","commentId":2572153,"userName":"Zura","timestamp":1483604353,"content":"Finish the saga, thraduil and gandalf the white hero. Only things that are \"missing\" right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2572705","commentId":2572705,"userName":"rsdockery","timestamp":1483633459,"content":"Hero Smeagol\n\nScouring of the Shire\n\nMore Hobbits"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2573028","commentId":2573028,"userName":"NathanH","timestamp":1483642852,"content":"I hope for some good quests and some good but not too powerful player cards.\n\n \n\nParticularly I just want more playable player cards! Over New Year, my friend and I played a fun variant where we played the whole of Core Set + Shadows of Mirkwood with a rule that whenever we use a particular card in a deck, it isn't available for the rest of the cycle (we have 1x everything + an extra core set + 1 extra copy of each 2x card in the core set). This was really entertaining but there don't quite seem to be enough cards to do this for the harder cycles yet. It is nice to get to use all the cards that are decent but generally outclassed by another card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2581853","commentId":2581853,"userName":"xchan","timestamp":1484082688,"content":"I don't know much about LotR lore so I can't comment on that, but I would love to see new products and mechanics for the game, being them official or fanmade. I'm relativelly new to the game, so maybe some of those have already been done, if so, I appologize.\n\n \n\n1-. New card type: Havens. I agree with Gizlivadi that there should be positive locations to play and deckbuild around. There have been some fanmade atempts, but I would like for the devs to try to figure them out.\n\n \n\n2-. New card type: Agendas. This has also been done by fans, but I thorougly enjoy the deckbuilding options that they bring for games like AGoT 2.0 and would like to see similar versions for LotR. Something like if your heroes share a trait/sphere, you get X benefit and Y penalty. \n\n \n\n3-. The revival of Treasure cards. I know that they were transformed into Boons and Burdens for the LotR Saga expansions, but what I would like to see is a new mechanic that works around the scoring system/victory points. My take on the Treasure cards would be similar to the loot system of RPGs. Everytime you defeat an enemy/explore a location, you place one random card from the loot/treasure deck on the victory/loot display (separate them to avoid interactions with existing cards?). At the end of the quest, if the players were successful, they as a group can buy X victory points worth of Treasure cards. They can add them to their decks for the rest of the campaign (see below). \n\n \n\n4-. New POD product: Saga/Campaign decks. A deck of 20/40/60 cards for each cycle consisting of new Campaign cards, Boons and Burdens to tie each quest together as a Saga, and Havens, Treasure cards, and Agendas to improve the thematic experiense. They seem to be willing to revisit old quests with the nightmare decks, so there's already a precedent. This new Saga/Campaign decks could attract a whole new bunch of players that were underwhelmed by the lack of campaign (and progress) in the base game, and have the potential to increase the replayability of the cycles. \n\n \n\n5-. Revised core set. The core set could benefit from a revised edition with an improved rule book, a new reference rule book (like they are doing for every new LCG) containing all the new keywords, word descriptions, action timings and the FAQ entries that are exception to the rules; and revised versions of underpowered/overpowered the cards and distribution of the cards. A POD conversion kit could be sold separatelly for the old players who already own their cores.\n\n \n\nThis has already been done by the community on several occasions, but I would like for them to make it official. They have done revised edition for other board games and they have no issues on updating the errata cards on future printings.\n\n \n\n6-. Tied to the point above: Improved solo rules. The solo gamers are a huge part of the player base, however, the official rules don't cater to them at all. It's obvious that the game is designed and tested as a 2 player co-op game which can make the solitaire experience not so great/balanced. There have been some attempts by the fans (the Fellowship variant on BGG comes to mind) to improve the expeirence. So official rulings in the new rule book wouldn't hurt. Adding new game variants in it wouldn't kill me either.\n\nWill update when I have something else to add.\n\nEdited January 10, 2017 by xchan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2589831","commentId":2589831,"userName":"Yepesnopes","timestamp":1484424340,"content":"Ally Aragorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2590465","commentId":2590465,"userName":"dragoncymru","timestamp":1484478568,"content":"> I don't know much about LotR lore so I can't comment on that, but I would love to see new products and mechanics for the game, being them official or fanmade. I'm relativelly new to the game, so maybe some of those have already been done, if so, I appologize.\n> \n>  \n> \n> 1-. New card type: Havens. I agree with Gizlivadi that there should be positive locations to play and deckbuild around. There have been some fanmade atempts, but I would like for the devs to try to figure them out.\n> \n>  \n> \n> 2-. New card type: Agendas. This has also been done by fans, but I thorougly enjoy the deckbuilding options that they bring for games like AGoT 2.0 and would like to see similar versions for LotR. Something like if your heroes share a trait/sphere, you get X benefit and Y penalty. \n> \n>  \n> \n> 3-. The revival of Treasure cards. I know that they were transformed into Boons and Burdens for the LotR Saga expansions, but what I would like to see is a new mechanic that works around the scoring system/victory points. My take on the Treasure cards would be similar to the loot system of RPGs. Everytime you defeat an enemy/explore a location, you place one random card from the loot/treasure deck on the victory/loot display (separate them to avoid interactions with existing cards?). At the end of the quest, if the players were successful, they as a group can buy X victory points worth of Treasure cards. They can add them to their decks for the rest of the campaign (see below). \n> \n>  \n> \n> 4-. New POD product: Saga/Campaign decks. A deck of 20/40/60 cards for each cycle consisting of new Campaign cards, Boons and Burdens to tie each quest together as a Saga, and Havens, Treasure cards, and Agendas to improve the thematic experiense. They seem to be willing to revisit old quests with the nightmare decks, so there's already a precedent. This new Saga/Campaign decks could attract a whole new bunch of players that were underwhelmed by the lack of campaign (and progress) in the base game, and have the potential to increase the replayability of the cycles. \n> \n>  \n> \n> 5-. Revised core set. The core set could benefit from a revised edition with an improved rule book, a new reference rule book (like they are doing for every new LCG) containing all the new keywords, word descriptions, action timings and the FAQ entries that are exception to the rules; and revised versions of underpowered/overpowered the cards and distribution of the cards. A POD conversion kit could be sold separatelly for the old players who already own their cores.\n> \n>  \n> \n> This has already been done by the community on several occasions, but I would like for them to make it official. They have done revised edition for other board games and they have no issues on updating the errata cards on future printings.\n> \n>  \n> \n> 6-. Tied to the point above: Improved solo rules. The solo gamers are a huge part of the player base, however, the official rules don't cater to them at all. It's obvious that the game is designed and tested as a 2 player co-op game which can make the solitaire experience not so great/balanced. There have been some attempts by the fans (the Fellowship variant on BGG comes to mind) to improve the expeirence. So official rulings in the new rule book wouldn't hurt. Adding new game variants in it wouldn't kill me either.\n> \n> Will update when I have something else to add.\n\nI hope you stay tuned to my 'Road Goes ever on' blog?\n\n \n\nIt ties in directly to many of your points and I'd love to hear your opinions on my versions of solo rules, havens, modified early cards etc. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2598693","commentId":2598693,"userName":"pohpohpoh","timestamp":1484854580,"content":"It would be nice in 2017 they ran a complete print run for all the cycle packs. I started late to this game and despite it still being active (given deluxe expansions are still being released) it's impossible to get some of the older/original cycles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2600413","commentId":2600413,"userName":"Otherworlder","timestamp":1484931488,"content":"> Ally Aragorn\n\n \n\nYES. \n\n \n\nA spirit hero then the ally. I'm greedy like that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2602573","commentId":2602573,"userName":"bdavis96","timestamp":1485069714,"content":"1) Fill in Hero version/Ally version cards of Hero Only or Ally Only cards, specially thematic characters like all the dwarves from The Hobbit and the Fellowship from The Lord of the Rings.  I would love to be able to pick any 3 dwarves (of the 13 from the unexpected party) as heroes and have the rest of the dwarves playable as Ally cards, or any 3 of the fellowship as heroes and have the rest of the fellowship playable as Ally cards. \n\n \n\n2) A \"2nd edition\" of LotR LCG that doesn't obsolete the \"1st edition\" but instead provides new/different game mechanics that allow for a Player VS Player (PVP) aspect.  I have been seeing some discussion about introducing Havens and good locations, a game mechanic that was used by Middle Earth Collectible Card Game (MECCG) that was produced from 1995 through 1999.  Utilizing most \"1st edition\" player cards, the \"2nd edition\" can add cards that could create a PVP aspect to the LotR LCG game (maybe similiar to MECCG or other CCG formats)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=2603843","commentId":2603843,"userName":"PigsAreOurEquals","timestamp":1485161554,"content":"> It would be nice in 2017 they ran a complete print run for all the cycle packs. I started late to this game and despite it still being active (given deluxe expansions are still being released) it's impossible to get some of the older/original cycles.\n\nAll cycles are still being reprinted. So anything that goes out of stack is sually back 2-3 months later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238453-2017-wishespredictions-for-lotr-lcg/?do=findComment&comment=3887464","commentId":3887464,"userName":"Gibby","timestamp":1580938784,"content":"Apologies for the necro. I just stumbled across this thread in a google search and couldn’t help but be amazed at how many wishes have come true three years later.\n\nSaga completed, ally Merry and Pippin, Dale trait explored, hero Radagast and Saruman, famous artifacts, agendas (in the form of contracts), Thranduil hero, Rosie ally (and she delivers!), Smeagol hero, revised core set (HoG fixed, but SoG left untouched in its imba glory), heck we even got a versus mode of sorts!\n\n "}]}