{"url":"https://community.fantasyflightgames.com/topic/238518-breaking-of-the-fellowship-quest-stage-2a-and-removing-characters/","title":"Breaking of the Fellowship quest: Stage 2A and removing characters","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/238518-breaking-of-the-fellowship-quest-stage-2a-and-removing-characters/?do=findComment&comment=2568256","commentId":2568256,"userName":"Rajam","timestamp":1483396764,"content":"In the quest \"Breaking of the Fellowship\", stage 2A says:\n\n \n\n\"When Revealed: Remove the Ring-bearer, and each card attached to it, from the game (treat The One Ring's text as blank while resolving this effect).\"\n\n \n\nLater in the game, you must obtain the objective card \"Frodo's Choice\", which says:\n\n \n\n\"When Revealed: Take control of the first player token and the Ring-bearer (and each card attached to it).\"\n\n \n\nMy questions are:\n\n- What happens with damage and resource tokens on the Ring-bearer when he leaves/re-enters play?\n\n- What happens if the Ring-bearer was ready/exhausted when he is removed? when he re-enters game-play, does he re-join in that same condition, or exhausted no-matter-what, or ready no-matter-what?\n\nEdited January 2, 2017 by Rajam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238518-breaking-of-the-fellowship-quest-stage-2a-and-removing-characters/?do=findComment&comment=2568319","commentId":2568319,"userName":"RichardPlunkett","timestamp":1483400994,"content":"What a lovely question.\n\nBy default, when cards leave play they lose all tokens, state, history, etc.\n\nIn this instance a clear exception is being made for attachments, but no other exception is listed. It follows, that the rules most likely require that we remove all resource and damage tokens and he enters play ready.\n\n \n\nIs this the intent? I have no idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238518-breaking-of-the-fellowship-quest-stage-2a-and-removing-characters/?do=findComment&comment=2568760","commentId":2568760,"userName":"krokodiler","timestamp":1483443892,"content":"Here is Caleb's answer for a question I've asked once (with my emphasis on Frodo's part):\n \n\n> Q: Black Riders: When I travel to Weather Hills I can place an enemy card facedown under that location. What about attachments like Pale Blade that are attached to Nazgul enemy then? Are they also placed facedown and return to play when that enemy returns to staging area, or are simply discarded? Also, if that enemy would have any damage tokens, what about them? Do they stay or are discarded? The same - regarding damage - with Frodo in 1st scenario of the Road Darkens, when he is captured by the Watcher.\n> A: When you place an enemy facedown under the Weather Hills, that enemy leaves play. Any cards attached to it, or tokens on it, are discarded at that time. The rules for Frodo and the Watcher are different because it specifically says that each card attached to him stays attached. However, damage is discarded when he is turned facedown.\n> \n>  \n\n \n\nI'd say that, as damage is discarded, so are resources then.\n\nI'd also say that when he comes back to the in-play state, he comes ready, no matter what was his state before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238518-breaking-of-the-fellowship-quest-stage-2a-and-removing-characters/?do=findComment&comment=2570359","commentId":2570359,"userName":"cmabr002","timestamp":1483532925,"content":"I think it is worth pointing out that resource tokens are not placed on heroes (despite many of us doing this anyway for convenience) so there is merit to the argument that resources would not be discarded.  I still think you would discard them however.\n\n \n\nWe probably need a ruling from the developers to clarify that when a hero leaves play, so does its resource pool and that when a resource pool leaves play, all resource tokens in it are discarded."}]}