{"url":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/","title":"New to the game (The 1st Cycle/Saga-Deluxe)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2568827","commentId":2568827,"userName":"Tom1132","timestamp":1483448572,"content":"Hello, everyone!\n\n*Caution: Onslaught of noob questions*\n\nI frequent the X-WIng forums but this is my first venture over into these parts. Namely because my girlfriend (CJ from here on) got the game for me for Christmas. We are now *both* thoroughly addicted and are trying to get our hands on the first cycle of adventure packs! We are both completionists, so we'd rather play all the stuff in order rather than jump ahead, but it's looking like we might need to go ahead to Khazad-Dum and the second cycle sometime soon because we cannot find them ANYWHERE.\n\n[REGARDING ADVENTURE PACKS]\n\nI'm aware they're awaiting reprint, but there is no indication as to how long that will take. And we need our fix! We did find 'A Journey to Rhosgobel' on Amazon (the last of 3 copies), but the others are proving elusive. I am also aware that about half of the first cycle is considered sub-par as far as quests go, but for the sake of collecting the player cards - it's my understanding that they still have value in that sense.\n\nSo I thought I'd ask, are there any sites (besides Amazon) that my fellow UK/Ireland people use to keep an eye out for this stuff? So far I know and use Wayland Games, but they're all listed as 'Available to Order' - which translates to 'Out of Stock for goodness knows how long until it's reprinted' :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nOn a side note; is it generally recommended to play chronologically in terms of having the best experience?\n\n \n\nFrom what I understand, the best of the original 6 are;\n\n1) Conflict at the Carrock\n2) A Journey to Rhosgobel\n3) Return to Mirkwood\n\n\n[REGARDING SAGA & DELUXE EXPANSIONS]\n\nAs someone entering the game at this stage in its life, it is really daunting to see the number of releases that this game has - and decide where to go after the awesome Core Set. Nothing else represents this dilema better than the Saga/Deluxe conundrum. From what I can tell; the Saga expansions follow the story of LOTR, while the Deluxe expansions are original adventures; each containing different Heroes and player cards etc.\n\nNow, the Hobbit Heroes don't overly appeal to us from what we've seen (The Black Riders - which I assume is the first), so we are leaning heavily towards Khazad-Dum right now (CJ loves Dwarves). But I'm interested to know, is there anything important we are missing out on by not going the 'Saga' route early on? I guess what I'm asking is; can a case be made to go the Saga route over the Deluxe route?\nIf it helps, at the minute it's looking like I'm mainly using Leadership & Lore, while CJ is using Spirit & Tactics.\n\nThanks for reading guys if you got this far; there's a lot to take in (on top of the actual rules of the game!) when deciding how to expand the experience. We're loving the game and can't wait to sink our teeth into it some more!\n\nP.S. - The Hive Tyrant's Progression Series on YouTube has been a great primer for the game and I'd recommend it to any other new players who happen to read this. It's great to hear opinions on cards in their original context and we were made aware of some combos that we didn't even think of in the Core Set.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2568844","commentId":2568844,"userName":"Qaanaaq","timestamp":1483449942,"content":"Seem to have a few:\n\nHunt for Gollum https://www.ihrysko.sk/kooperativne-hry/hunt-for-gollum-the-lord-of-the-rings-the-card-game.html?page_id=4986 [https://www.ihrysko.sk/kooperativne-hry/hunt-for-gollum-the-lord-of-the-rings-the-card-game.html?page_id=4986]\n\nDead Marshes https://www.fantasyobchod.cz/lord-of-the-rings-lcg-the-dead-marshes-p-5659.html [https://www.fantasyobchod.cz/lord-of-the-rings-lcg-the-dead-marshes-p-5659.html]\n\nHills of Emyon Muil https://www.planetaher.cz/detail/sberatelske-karetni-hry/the-lord-of-the-rings-the-hills-of-emyn-muil [https://www.planetaher.cz/detail/sberatelske-karetni-hry/the-lord-of-the-rings-the-hills-of-emyn-muil]\n\nShadows of Mirkwood http://www.svet-deskovych-her.cz/produkty/1664/lotr-lcg-return-to-mirkwood-shadows-of-mirkwood-6 [http://www.svet-deskovych-her.cz/produkty/1664/lotr-lcg-return-to-mirkwood-shadows-of-mirkwood-6]\n\nEdited January 3, 2017 by Qaanaaq"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2569957","commentId":2569957,"userName":"Hawkstrike","timestamp":1483493104,"content":"There are some great Dwarf cards in the Hobbit Saga boxes.\n\nI got in the last time the Mirkwood saga were out of print so I went Core, Hobbit Saga, Khazad-dum, then Mirkwoodand on into the FotR saga -- which worked out pretty well because I like dwarves.\n\nThough now I'm getting my posterior handed to me the Angmar Awakened cycle and am seriously frustrated with the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2574111","commentId":2574111,"userName":"Tom1132","timestamp":1483705973,"content":"> There are some great Dwarf cards in the Hobbit Saga boxes.\n> \n> I got in the last time the Mirkwood saga were out of print so I went Core, Hobbit Saga, Khazad-dum, then Mirkwoodand on into the FotR saga -- which worked out pretty well because I like dwarves.\n> \n> Though now I'm getting my posterior handed to me the Angmar Awakened cycle and am seriously frustrated with the game.\n\n \n\nI attempted to order 'Over Hill and Under Hill' from a local FLGS but unfortunately they are out of stock with the supplier. We may have to wait for a reprint (a recurring theme with this game, it seems :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]) Will definitely keep an eye out for it though, as it looks really good.\n\n \n\nIn the meantime, Khazad-Dum just arrived and should satisfy our Dwarven mischief, for now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2581148","commentId":2581148,"userName":"ParinorB","timestamp":1484062895,"content":"Hi Tom\n\n \n\nFirst some resources that might be interesting to you. You will probably have seen some of them already, but if you haven't, they might be useful.\n\n 1. Since you mentioned the black riders as \"maybe the first\" Saga expansion: Here [https://boardgamegeek.com/filepage/113707/lotr-card-game-list-expansions-release-dates-and-p] you can download a list of all the releases with the times they were released. I believe that the Hive Tyrant will play the Saga Boxes whenever they were released to have the \"real experience\" of someone playing scenarios as they come out.\n 2. Check out the New player buying guide [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] from the Tales from the Cards if you want some more opinions\n 3. I like this Quest Companion [http://lotr-lcg-quest-companion.com/]as a nice resource\n\nThe Saga versus Deluxe is a tough one and you will likely hear different opinions from different people. I have so far only played the Hobbit 1&2 and the Black Riders (including the Print on Demand Scenarios that cover the Tom Bombadil story), and I really liked these Quests. They are generally well-done and capture the stories that they tell. However, you will be less surprised in terms of the story then playing the Deluxe cycles. In terms of player cards, the Hobbit boxes have a huge amount of dwarf cards and then a few cards (staples?) that I am using in several other decks (Foe Hammer, A very good tale, Expert Treasure Hunter, The Black Arrow) but buying the box just for these cards might not be what you want to do. The two LOTR1 boxes have fun cards. I just played those quests with a Merry, Pippin, Sam Deck and a Gandalf Deck on the other side (build with cards with everything up to Numenor cycle and then the four Saga boxes (Hobbit and LOTR 1)) and they have been some of the most fun to play!\n\n \n\nI think in general there is no harm at all in skipping Mirkwood until it is back in print. I would try to get the Hobbit Boxes as you are playing Khazad Dum and then have the full Dwarf Action. I got a bit bored with Dwarves after that but I was happy to play them through the Hobbit and parts of Khazad Dum. In that case you can also try to see how you like the feel of playing the Saga Expansions and decide if you like to continue with LOTR. You probably know that one of the bonuses of the Saga Boxes is to play the Boxes in Campaign mode with boons and burdens that can be gained throughout the campaign. Since the Hobbit is a campaign separate from LOTR, it is a good starting point to see, if you like that concept.\n\n \n\nOnce you hit Isengard, the story from the Deluxes starts being more woven together and you might want to take them in order. Oh and you probably heard that before but before you start playing Numenor, it might be worth having a good card pool (maybe a bit more than just core and Khazad Dum) or you might become frustrated.\n\n \n\nHappy playing!\n\nEdited January 10, 2017 by ParinorB"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238569-new-to-the-game-the-1st-cyclesaga-deluxe/?do=findComment&comment=2608132","commentId":2608132,"userName":"kaisergav","timestamp":1485355972,"content":"Sorry if it's too late to be useful, but I've found www.boardgameextras.co.uk to have some of the best stock and pricing at the moment.\n\nBoardgameguru.co.uk doesn't have as much stock at the moment, but is also good. "}]}