{"url":"https://community.fantasyflightgames.com/topic/238635-pathless-country-and-tireless-hunters/","title":"Pathless Country and Tireless Hunters.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/238635-pathless-country-and-tireless-hunters/?do=findComment&comment=2569827","commentId":2569827,"userName":"Fluke Starbucker","timestamp":1483486758,"content":" \nThis is a convoluted question so I apologize if I don't articulate it well.\n \nLast night a friend of mine running his Dunedain deck was the 3rd (of 4) player questing A Knife in the Dark (from The Black Riders).  During the combat phase, after he assigned his blocker, he revealed Pathless Country as his shadow card.  The normal attack resolved and he passed the enemy over to the 4th player to finish resolving the shadow effect.  But before the shadow effect attack on player 4 could begin, player 3 immediately plays Tireless Hunters to harpoon the enemy back to himself.  I have several questions regarding this.  \n \nFirst... does the shadow effect attack get a shadow card?\n \nSecond... is this harpoon attempt even legal?  Doesn't the original shadow effect have to resolve before another action (Tireless Hunters) can be played?\n \nThird... if the shadow effect attack does get it's own shadow card, does it follow the enemy back to player 3?  And if so, does it get discarded by Tireless Hunters text?\n \n \nPathless Country\nPathless Country gets +4 quest points while in the staging area.\nShadow: After this attack, the attacking enemy engages the next player then makes an immediate attack.\n \nTireless Hunters\nPlay before resolving the enemy attacks step.\nCombat Action: Choose an enemy not engaged with you. Engage that enemy. Then, discard a shadow card from that enemy, if able.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/238635-pathless-country-and-tireless-hunters/?do=findComment&comment=2569845","commentId":2569845,"userName":"NathanH","timestamp":1483487784,"content":"I think that the \"enemy attacks\" step has already begun at this point, so the whole thing doesn't work to begin with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/238635-pathless-country-and-tireless-hunters/?do=findComment&comment=2569849","commentId":2569849,"userName":"Fluke Starbucker","timestamp":1483488022,"content":"Nathan, that was my take as well.  I think Tireless hunters was meant to be played after Shadow cards are dealt, but before the enemies actually start attacking.\n\n \n\nCan anyone second this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/238635-pathless-country-and-tireless-hunters/?do=findComment&comment=2570026","commentId":2570026,"userName":"GrandSpleen","timestamp":1483498261,"content":"Yeah definitely Tireless Hunters can't be played once you begin to resolve enemy attacks.\n\n \n\nIf you did drag the enemy away however, say with Quick Strike + Aragorn (Tactics) taking down a different enemy, the shadow effect should still resolve.  \n\n \n\nIn that scenario, you would start resolving the original attack, then reveal the Pathless Country shadow card.  Then, another player would do Quick Strike + Aragorn and defeat some other enemy, and drag the original enemy over to him.  The original attack would finish resolving (against the original player, even though it is no longer engaged with that player).  Then, the shadow effect does its thing: the enemy will go to the next player (presumably the \"next player\" in relation to the original player who revealed the shadow effect, and attack.  Moving the enemy around won't prevent the attack."}]}