{"url":"https://community.fantasyflightgames.com/topic/239764-winning-rhosgobel-without-any-athelas/","title":"Winning Rhosgobel without any Athelas","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/239764-winning-rhosgobel-without-any-athelas/?do=findComment&comment=2589696","commentId":2589696,"userName":"Randyman","timestamp":1484416633,"content":"I finally won Rhosgobel after four tries....I think?  I was able to get Radagast in play early to save up some healing points and on the final turn, I sacrificed him and played two copies of Lore of Imladris so that Wilyador was cleared of all damage tokens going into the quest phase. After successfully questing and moving on to stage 3B, there was no damage on Wilyador, so I think the winning conditions were met even though I was unable to claim any Athelas cards (one copy was still in the staging area, guarded by a King Spider).  Can anyone confirm if indeed this is a legal victory?   It feels a little empty, since I was unable to gather any Athelas... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/239764-winning-rhosgobel-without-any-athelas/?do=findComment&comment=2589717","commentId":2589717,"userName":"987654321","timestamp":1484418095,"content":"The only requirement is full-health Wilyador. Athelas are just for help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/239764-winning-rhosgobel-without-any-athelas/?do=findComment&comment=2594900","commentId":2594900,"userName":"PsychoRocka","timestamp":1484694801,"content":"If anything rather than feeling like a hollow victory it should feel like one hell of a hard earned one. You managed to win without needing a single copy of Athelas and by using your own clever healing scheme!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/239764-winning-rhosgobel-without-any-athelas/?do=findComment&comment=2597285","commentId":2597285,"userName":"Randyman","timestamp":1484791177,"content":"You're right, PR -- with a little more time to reflect on this, I've actually grown quite proud of the accomplishment!  I am a relatively inexperienced player and this was my first attempt at deck-building.  I put together a deck with only the core set + 1st three Mirkwoods and it worked very well on the very first attempt.  After I posted this,  I tweaked the deck slightly and rattled off three more wins so I know now that its a solid deck (even if only for this scenario).   For me, making the leap from playing this game with deck suggestions from others vs. actually constructing my own deck has opened up an entire new level of enjoyment/obsession with this game.  I'm afraid I'm completely hooked now.\n\n \n\nSo anyway, I appreciate your kind words of encouragement!"}]}