{"url":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/","title":"How to get rid of those pesky Goblin Archers...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2605686","commentId":2605686,"userName":"Randyman","timestamp":1485235446,"content":"I am playing the Seventh Level and trying to build a deck that includes a few different ways to kill those pesky Goblin Archers who have a defense strength of 4, cannot be optionally engaged, and have an Engagement cost of 48 (!).  Also, they can only be attacked by ranged characters while in the staging area.  I realize that a good choice of Hero would be Thalin who can kill the Goblin Archers (who only have 1 hit point) upon being revealed but I would like to use other Heros on this quest.  I am only using cards from core + Mirkwood cycle + Khazad-dum expansion and since all the ranged characters have attack strengths less than 4, I am finding very few lethal possibilities.  Several questions arise:\n\n \n\n1) Since Gandalf is not ranged, can he still deal 4 damage when he enters play and wipe out the Goblin Archer ?\n\n2) Similar to Gandalf -- can I Sneak attack Longbeard Orc Slayer in for a point of damage even tho he is not ranged?\n\n3) If I can damage an engaged enemy, can I play Infighting to move damage to the Goblin Archers even though they are still in the staging area?\n\n4) Dunedain Cache would add the ranged ability to any character but I don't really want to add 3 of these to the deck if I don't have to -- Are there any other combinations I have overlooked?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2605719","commentId":2605719,"userName":"Authraw","timestamp":1485237779,"content":"1) Nothing on the card prevents damaging the Archer, just optionally engaging it, which is a framework effect which happens during the Encounter phase. Anything else is fair game, so Gandalf is A-OK.\n\n2) Yup, Longbeard Orc Slayer works fine.\n\n3) Yup, nothing stops you from damaging an enemy in the staging area.\n\n4) Take a look at Son of Arnor (whose effect is not the same as an \"optional engagement\" since \"optional engagement\" is a specific framework effect), but you can also just go with the simplest solution of putting an attack bonus (Blade of Gondolin, Dunedain Mark, Dwarven Axe) on a ranged character like Legolas or Brand Son of Bain."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2607623","commentId":2607623,"userName":"Randyman","timestamp":1485318378,"content":"Thanks -- I will try adding Son of Arnor to the deck.  I am also finding that this quest is pretty challenging if you are trying to stick to Dwarf heroes.  Many more losses than wins at this point..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2608298","commentId":2608298,"userName":"PocketWraith","timestamp":1485359865,"content":"Yeah, direct damage like Gandalf/Orcslayer doesn't count as an attack so you don't need Ranged for it. Same goes for moving damage with Infighting. There are a couple of other options in this area - Descendant of Thorondor and Beorning Beekeeper - though they're both a bit expensive. More possibilities turn up as the card pool expands as well. Attack boost on a Ranged character or simply having multiple Ranged characters band together is probably your easiest option though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2608339","commentId":2608339,"userName":"Crabble","timestamp":1485361098,"content":"Agree! Sneakattacak+Orcslayer (a great Combo in this scenario) works fine but if you want consistency you should go back to good old Thalin. I made a deck with Dain/Thalin/Bifur out of the card pool you mentioned and it worked just fine. If you can grab a Gondorian-Speerman in your opening hand and Thalin questes every round you're good to go against the horde of 2-hitpoint Goblins without even attacking (and thus avoiding nasty shadow effects). Cave-troll would be a problem but I guess that will be the case in most solo-games against this scenario ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2609591","commentId":2609591,"userName":"Randyman","timestamp":1485405597,"content":"OK -- does Thalins ability also put a hit point on the Goblins/Orcs as they are added to the staging area as a result of a Shadow effect? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2609643","commentId":2609643,"userName":"Kakita Shiro","timestamp":1485408678,"content":"> 50 minutes ago, Randyman said:\n> \n> OK -- does Thalins ability also put a hit point on the Goblins/Orcs as they are added to the staging area as a result of a Shadow effect? \n\nI suspect not; Thalin's ability is only good for enemies from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2609746","commentId":2609746,"userName":"rmunn","timestamp":1485417560,"content":"To be more specific, Thalin's ability only triggers while he's committed to the quest. Once you commit a character to the quest, they remain committed until the end of the Quest phase. So the answer to \"what if they're added as a result of a Shadow effect?\" depends: is it still the Quest phase? (This could happen if there are any \"When Revealed: (name of card) makes an immediate attack against the first player\" effects in the encounter deck). Most of the time, Shadow effects would show up during the Combat phase, when Thalin is no longer in effect. But if an attack happens during the Quest phase, and that attack's Shadow card reveals another card from the encounter deck (and that card turns out to be a Goblin Archer), then (and only then) Thalin would kill that Goblin Archer as it shows up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2609755","commentId":2609755,"userName":"Crabble","timestamp":1485418726,"content":"> 3 hours ago, Randyman said:\n> \n> OK -- does Thalins ability also put a hit point on the Goblins/Orcs as they are added to the staging area as a result of a Shadow effect? \n\nThat's why the Thalin / Spearman combo is so good in this scenario. :) Thalin puts a point of damage on these 2-hitpoint-Goblins when they're revealed in the quest phase and the spearman kills them when he is declared as the defender in the combat phase thus avoiding shadow effects that may put other pesky goblins in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/240696-how-to-get-rid-of-those-pesky-goblin-archers/?do=findComment&comment=2609988","commentId":2609988,"userName":"PocketWraith","timestamp":1485436712,"content":"> 5 hours ago, rmunn said:\n> \n> To be more specific, Thalin's ability only triggers while he's committed to the quest. Once you commit a character to the quest, they remain committed until the end of the Quest phase. So the answer to \"what if they're added as a result of a Shadow effect?\" depends: is it still the Quest phase? (This could happen if there are any \"When Revealed: (name of card) makes an immediate attack against the first player\" effects in the encounter deck). Most of the time, Shadow effects would show up during the Combat phase, when Thalin is no longer in effect. But if an attack happens during the Quest phase, and that attack's Shadow card reveals another card from the encounter deck (and that card turns out to be a Goblin Archer), then (and only then) Thalin would kill that Goblin Archer as it shows up.\n\nAs an addendum to this, the shadow effects cause those Goblins to be added to the staging area, not revealed, so even if the attack did happen in the Quest phase Thalin wouldn't do anything, as he triggers only when enemies are revealed."}]}