{"url":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/","title":"How to get into the game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2614482","commentId":2614482,"userName":"zuck515","timestamp":1485691209,"content":"Hello everyone,\n\nI'm a bit lost with all the sets and expansions and all. Where do I start?\n\nIt seems like buying the core set is the first step to take, but how does it work in relations to the advendure sets, or other expansions?\n\nCan you mix all the cards that have come out over the years or are you limited to the cycles? Can I get the core set, then a random adventure pack I like the sound of? \n\nWhen you have bought 1000 cards, do you still use the core set?\n\n \n\nThank you ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2616348","commentId":2616348,"userName":"jjohnson111","timestamp":1485796428,"content":"The Core Set should be the first option to buy.  In it, it includes 3 quests.\n\nThe Shadows of Mirkwood Adventure Pack cycle \"tie in\" with the Core set cards, as you use quest cards from the core set to build the Mirkwood Adventure Packs.  \n\n \n\nEach Adventure Pack comes with player cards + quest cards.  In order to play the adventure pack's quest, you will need quest cards from the Core Set (for Mirkwood Cycle) or from the Deluxe Box (example: Khazad-Dum) in order to play the quests found in the Adventure Packs from the Dwarrowdelf cycle.\n\n \n\nKhazad-Dum + Dwarrowdelf Adventure Pack Cycle\n\nHeirs of Numenor + Against the Shadow Cycle\n\nThe Voice of Isengard + The Ring Maker Cycle\n\nThe Lost Realm + Angmar Awakened Cycle\n\nThe Grey Havens + Dream-Chaser Cycle\n\nSands of Harad + Haradrim Cycle (current cycle the game is on)\n\nThere is no rotation cycle, like there is in the other LCG's (Netrunner, Star Wars) as the game is not competitive.  So once you buy the cards, they can be used in any deck.  There are core set cards that are definite staples in every deck, and depending on how you deck build, you could also use the heroes from the core set too.  There are a good handful of core set cards that will always see use.  \n\nThe Saga Expansions, just to add follow the stories of the books.  We are awaiting the last Saga expansion, due to be released this year, likely at GenCon.  The Saga expansions include player cards, but the quest cards will only be mixed within the saga expansions, and the player cards join the card pool that is available to players too.  \n\n \n\nEdited January 30, 2017 by jjohnson111"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2616354","commentId":2616354,"userName":"Willange","timestamp":1485796608,"content":"You definitely need a core set.  It has some of the most useful and OP cards there are... it also has a solid foundation of tools for you to build off of.  \n\nAfter the core, you can go basically any direction you want.  You will be able to use the player cards in ANY pack/box.  The quests are a different story though.... If you buy a pack then you'll be able to use the player cards, but you'll need the deluxe box corresponding to the pack in order to play the quest (and you'd want it anyway for story continuity).  The saga boxes as best played in the order they came out with the exception of the 2 hobbit boxes which you can get after the lotr saga boxes if  you want.\n\nHope that helps.\n\n \n\nEDIT: Ninja'd by jjohnson111's superior more detailed post.\n\nEdited January 30, 2017 by Willange"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2617578","commentId":2617578,"userName":"zuck515","timestamp":1485845476,"content":"Thank you very much! It really helps. I've ordered the core set ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nThanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2619342","commentId":2619342,"userName":"Iskander4000","timestamp":1485909565,"content":"I highly recommend this article:\n\n \n\nhttps://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\n \n\nPersonally I'm still working my way through it in release order (having to take a break due to waiting for Ringmaker Cycle reprints) but if you want to jump into later cycles or build specific deck types, that article will help you. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/241234-how-to-get-into-the-game/?do=findComment&comment=2822105","commentId":2822105,"userName":"JonG","timestamp":1496672842,"content":"Ooops, posted in the wrong thread!\n\nEdited June 5, 2017 by JonG"}]}