{"url":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/","title":"New Player questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2615793","commentId":2615793,"userName":"Rozy","timestamp":1485773531,"content":"1. How does Warden of Healing and Elrond work together. Do they heal 2 and 2 or 2 and 1 damage?\n\n2. Just to be sure. Enemies that are guarding something do not make engagement checks, correct?\n\n3. Is there any window to take actions at the beginning of the game? More specifically before I turn from 1A quest side to 1B?\n\n3b. - Example that happened to us: On 1A side of the Escape from Dol Guldur quest is to put the 3 Objectives to staging area. In our game one of those objectives was guarded to nasty Spider Web that does not allow you to ready the hero unless you pay 2 at the end of the round. We resolved that treachery right away and attached it to hero and since the Objective was not guarded anymore we wanted to attach it to the same character. On 1B of the quest we have to imprison on of our heroes. So can we put the Web + the Artifact to one hero and than imprison it?\n\n \n\nEdited January 30, 2017 by Rozy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2615982","commentId":2615982,"userName":"GrandSpleen","timestamp":1485786768,"content":"1. 2 and 2.\n\n2. Enemies guarding objectives still make their usual engagement checks.  Think of the Guarded objective as an attachment on the enemy or location (even though the rules lead you to think otherwise).\n\n3. There is no action window during setup, which is when you would follow quest instructions.  The Resource phase is your earliest opportunity.  You can still trigger Responses turning setup, though.\n\n4. You can put the Web on an hero if it is revealed during setup per 1A's text.  But on 1B you're selecting a hero to imprison at random (unless you're house ruling it and selecting one yourselves)  -- so yes it could end up being that hero who has the Web, or it could be a different hero. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2619492","commentId":2619492,"userName":"Rozy","timestamp":1485921632,"content":"Thanks. Any tips on how to beat the scenario? I think we missed the rule about random hero. That makes it even harder. BTW when does the Nazgul come into the staging area? The quest only says we need to defeat it.\n\nEdited February 1, 2017 by Rozy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2619547","commentId":2619547,"userName":"GrandSpleen","timestamp":1485927358,"content":"When you elect to rescue the hero, the Nazgul swoops in. That comes from this text on the Nazgul itself: \"Forced: When the prisoner is 'rescued', move Nazgul of Dol Guldur into the staging area.\" Note that rescuing the prisoner happens as Response effect when you place progress on stage 2.  Response effects are always optional, so you don't have to rescue him/her until you are ready to face the Nazgul.  Build up your forces first.  \n\nThe major challenge to building up an army of allies is the restriction of only being able to play 1 ally per turn, as a group.  So, you use card effects to get around the restriction.  You are free to use cards like Elrond+Vilya, Stand and Fight, Caldara, and A Very Good Tale to put allies into play and bypass that restriction.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2619549","commentId":2619549,"userName":"GrandSpleen","timestamp":1485927409,"content":"By the way, it's a very hard scenario with just the Core set.  I wasn't able to score a win until I had bought several packs from the Shadows of Mirkwood cycle of adventure packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2619757","commentId":2619757,"userName":"Crabble","timestamp":1485946024,"content":"> 6 hours ago, Rozy said:\n> \n> Thanks. Any tips on how to beat the scenario? I think we missed the rule about random hero. That makes it even harder. BTW when does the Nazgul come into the staging area? The quest only says we need to defeat it.\n\nIf you have a strong hero lineup and don't \"need\" the prisoner you can just let him rot in Dol Guldurs dungeon for good. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] That could be considered cruel but hey if you score a win that's a price you can pay. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited February 1, 2017 by Crabble"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2620208","commentId":2620208,"userName":"GrandSpleen","timestamp":1485968310,"content":"Nah you have to rescue the prisoner eventually, you can't advance past stage 2 until you have done so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2621740","commentId":2621740,"userName":"Crabble","timestamp":1486040318,"content":"Daaaiiing, see haven't played that quest in a very looooong time. Was sure that you could let him rot, grab all 3 objectives and move on. Welp then prepare for the Nazgul ;) [https://community.fantasyflightgames.com/uploads/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2637669","commentId":2637669,"userName":"Rozy","timestamp":1486963667,"content":"So I bought some new packs up to Shadow and Flame with exception of the first two APs that are out of stock. Still having trouble to beat that scenario. Playing two player game. Tried Lore + Tactics decks and failing before we can even save the hero. It feels like unless the game goes very very easy on us it's very hard to get going due to the ally restrictions and one player basically missing 1/3 of his power. Any further tips? We basically have to beat the first round with 5 cards (3 from objectives and 2 more we draw in first questing phase) in staging area with only 5 heroes. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/241311-new-player-questions/?do=findComment&comment=2637692","commentId":2637692,"userName":"Authraw","timestamp":1486966176,"content":"The first round is the hardest, I think. It's pretty common for me to underquest on the first round and/or take an attack undefended early on. My goal in the first few rounds is to get control of the board, usually by killing off the enemies, I think.\n\nIt's a really tough quest, though -- I would expect it to take multiple tries even with a solid strategy."}]}