{"url":"https://community.fantasyflightgames.com/topic/242632-prince-imrahil-ally-a-journey-in-the-dark/","title":"Prince Imrahil Ally - A journey in the dark","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/242632-prince-imrahil-ally-a-journey-in-the-dark/?do=findComment&comment=2640830","commentId":2640830,"userName":"antonick","timestamp":1487123615,"content":"Tonight we had an overall great gaming experience playing \"A journey in the dark\" Saga Adventure.\n\n \n\nHowever, we came across a -problem trying to presume the interaction of \"Prince Imrahil\" Ally card with the \"The Great Bidge\" location.\n\n \n\nPrince Imrahil reads: \"While there is a hero in your discard pile, Prince Imrahil loses the ally card type and gains the hero card type.\"\n\nThe Great Bidge reads:  \"Response: When The Great Bridge is explored, discard a hero from play to deal X damage to The Balrog. X is that hero's threat cost. Then, The Balrog loses all keywords for the remainder of the game. Any player may trigger this response. \"\n\nOf course I had a hero in my discard pile, so I guess that if I discard Prince Imrahil Balrog loses keywords but I do 0 damage to it.\n\n \n\n \n\nAnother question about changing from ally to hero is about attachments that can be attached to a hero. Are they discarded if Imrahil becomes ally again? \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/242632-prince-imrahil-ally-a-journey-in-the-dark/?do=findComment&comment=2641555","commentId":2641555,"userName":"Watcher in the Water","timestamp":1487173671,"content":"I'm not completely sure what the ruling would be for sacrificing Ally Imrahil, but I would suspect that you are right. He doesn't have a printed threat cost, so I assume that you would deal 0 damage. This problem could also come up if you use The Fall of Gil-Galad, but again I think that his threat cost should be assumed to be zero. \n\nYour second question is easier to answer. Attachments only check whether they have a legal target when they are played, so if you play an attachment that only attaches to a hero, and then you use Fortune or Fate to return the hero to play, Imrahil will keep the attachment, however if it only attached to a hero, it probably won't be very useful to him as an ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242632-prince-imrahil-ally-a-journey-in-the-dark/?do=findComment&comment=2641859","commentId":2641859,"userName":"dalestephenson","timestamp":1487180692,"content":"There's actually one attachment that gets better when Imrahil loses hero status -- Dark Knowledge's response would still work, but it would lose the -1 willpower penalty.  There's a few other hero attachments that still function on an ally, but it's very much the exception and not the rule."}]}