{"url":"https://community.fantasyflightgames.com/topic/242994-cannot/","title":"CANNOT","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2647836","commentId":2647836,"userName":"Courchevel","timestamp":1487504699,"content":"Hey there,\n\n \n\nlong time since i have posted.\n\ni just want to check as i had a ruling on which Beorn hero getting his text blanked by a card effect (encounter) would be eligible for attachment. However, i can see in the faq :\n\n(1.14) The word “cannot”\n\nIf a card effect uses the word \"cannot”, then it is an absolute: that effect cannot be overridden by other effects. \n\nI would understand that this would prevent (even from an encounter card) to remove the \"cannot\" part of his text. Thus Beorn would never be able to get attachment. Is this an evolution from ruling ? \n\nWhat would be possible then ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2647864","commentId":2647864,"userName":"Noccus","timestamp":1487509338,"content":"If his entire text is removed, then also the word \"cannot\" is removed. This means you can suddenly play all kinds of attachments on Beorn.\n\nThere are decks out there that actually try to use this rule on Beorn in certain quests that blank out text boxes.\n\nBest part: once the attachments are on you don't have to discard them once his text is back.\n\n \n\nEdited February 19, 2017 by Noccus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2647892","commentId":2647892,"userName":"Lecitadin","timestamp":1487513735,"content":"> 1 hour ago, Noccus said:\n> \n> Best part: once the attachments are on you don't have to discard them once his text is back.\n\nAre you sure? Beorn has passive effects, I think that when the text comes back, attachments must be removed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2647978","commentId":2647978,"userName":"GrandSpleen","timestamp":1487520917,"content":"I do believe you have to discard them once the text is un-blanked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2648000","commentId":2648000,"userName":"Noccus","timestamp":1487523752,"content":"I'm quite sure you don't; as I was baffled by the ruling back then. \n\nBut that's how I remember it, I could be wrong.\n\nAnyone want to look it up? I'm too lazy :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2648115","commentId":2648115,"userName":"NathanH","timestamp":1487531850,"content":"There is some discussion here [https://community.fantasyflightgames.com/topic/173757-dark-knowledge/#comment-1590839] that makes reference to a conversation with Caleb. I couldn't find an official rules response for this though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2648249","commentId":2648249,"userName":"PocketWraith","timestamp":1487540282,"content":"When Beorn's text comes back, he will lose the attachments. There definitely was a ruling on this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2648272","commentId":2648272,"userName":"GrandSpleen","timestamp":1487541715,"content":"Funny that I  was taking the opposite position back then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2648834","commentId":2648834,"userName":"Crabble","timestamp":1487592826,"content":"Passive abilities always check the game status. So when Beorn gets his text back, any attachment will be discarded immediately. It's different to restrictions on attachments because a condition like \"can only be played on a lore hero\" is only checked when you want to play that kind of attachment. Once it's down you don't need to pay the cost for that attachment anymore and since it's attached to a character you don't need to \"play\" that attachment again.\n\nI hope you guys understand what I tried to say here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2649509","commentId":2649509,"userName":"Noccus","timestamp":1487620249,"content":"> 7 hours ago, Crabble said:\n> \n> Passive abilities always check the game status. So when Beorn gets his text back, any attachment will be discarded immediately. It's different to restrictions on attachments because a condition like \"can only be played on a lore hero\" is only checked when you want to play that kind of attachment. Once it's down you don't need to pay the cost for that attachment anymore and since it's attached to a character you don't need to \"play\" that attachment again.\n> \n> I hope you guys understand what I tried to say here :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nYes, that's how I read into the rules back then when the discussion was going on. And it feels logical.\n\nThat's why I seem to remember it so well being an odd ruling.\n\nMaybe I'm getting old and just mixed up Beorn's specific passive with the rest of the ruling. :huh: [//content.invisioncic.com/Mfantflight/emoticons/default_huh.png]\n\nI wanted to find that ruling now, just to know if my memory failed me and put some effort in it: here it is by our own Danpoage & Caleb:\n\nPosted April 16, 2015 [https://community.fantasyflightgames.com/topic/150667-tactics-aragorn-ready-for-errata/?do=findComment&comment=1573827] (edited) · Report post [https://community.fantasyflightgames.com/topic/150667-tactics-aragorn-ready-for-errata/?do=reportComment&comment=1573827]\n\n> On ‎16‎-‎4‎-‎2015 at 2:00 PM, alogos said:\n> \n> If is text is unblanked, though, he will lost his attachment.\n\nThis is actually not true. With Caleb looking on, I was playing my Beorn deck at GenCon two years ago, and I engaged The Lord of the Dead [http://hallofbeorn.com/Cards/Details/The-Lord-of-the-Dead-TSoE]. The next round (with the Lord still engaged) someone played Citadel Plate on Beorn and Caleb and I were joking about how funny that was - a bear running around in a suit of armor. He specifically mentioned that after I kill the Lord, the attachment does not fall off. His immunity to player card effects would prevent the attachment from giving him any bonus hit points, so it doesn't really matter in the grand scheme of things. Still, for purposes of determining a valid target the immunity is only checked at the time the attachment is played, it does not cause the attachment to fall off later.\n\nEdited April 16, 2015 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2649515","commentId":2649515,"userName":"Noccus","timestamp":1487620453,"content":"Here's the actual link. Page 5, 2nd post:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2649789","commentId":2649789,"userName":"PocketWraith","timestamp":1487628642,"content":"You are correct Noccus - however that ruling was later reversed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2650528","commentId":2650528,"userName":"Lecitadin","timestamp":1487684366,"content":"So... any non-Lore hero that gets Burning brand attached to it via Nori's Belt or another card effect (like Gandalf hero) must lose Burning when the card that gave him Lore is not active anymore?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2650640","commentId":2650640,"userName":"NathanH","timestamp":1487689021,"content":"> 1 hour ago, Lecitadin said:\n> \n> So... any non-Lore hero that gets Burning brand attached to it via Nori's Belt or another card effect (like Gandalf hero) must lose Burning when the card that gave him Lore is not active anymore?\n\nNo, text that says \"Attach to\" only checks at the point of attaching. Beorn's text is more restrictive: he cannot have attachments on him, ever.\n\n \n\nIt's a bit confusing, but Burning Brand is restricting the act of attaching, whereas Beorn is restricting the state of being attached."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2650959","commentId":2650959,"userName":"Noccus","timestamp":1487699740,"content":"> 19 hours ago, PocketWraith said:\n> \n> You are correct Noccus - however that ruling was later reversed.\n\nOh I must have missed out on that one.\n\nAnybody got a link?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2651316","commentId":2651316,"userName":"danpoage","timestamp":1487709666,"content":"I believe that the relevant ruling here is the (reversal) that was made around cards like Ancient Mathom and locations with \"Immune to Player Card Effects\". It used to be that the Ancient Mathom would stay, but at some point Caleb reversed that so that the Ancient Mathom falls off (if you manage to attach it while a location does not have immunity, but the location later gains immunity). It is correct that \"Cannot have attachments\" is only checked when playing the attachment on Beorn, so if he was blank through some effect, you could attach an attachment to him and it would not fall off when he regains \"Cannot have attachments\". Since that passive is only checked for when the card was first played, it doesn't matter that he regains that text at a later time. However, if you are staying consistent with the ruling for Ancient Mathom and immune locations, any attachments would fall off of Beorn once he regains \"Immune to Player Card Effects\" since that is what happens to locations with player card attachments when they gain immunity. This is my interpretation, based on the latest rulings, but we really should confirm this with Caleb.\n\nEdited February 21, 2017 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2651334","commentId":2651334,"userName":"danpoage","timestamp":1487710178,"content":"For reference, the FAQ entry 1.47 (page 8 of the PDF) gives some more details about \"immune to player card effects\" and attachments:\n\nhttps://images-cdn.fantasyflightgames.com/filer_public/64/ee/64ee44ca-825d-4c14-b77b-b0ad7581ee31/lotr_faq_18.pdf [https://images-cdn.fantasyflightgames.com/filer_public/64/ee/64ee44ca-825d-4c14-b77b-b0ad7581ee31/lotr_faq_18.pdf]\n\nEdited February 21, 2017 by danpoage"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2653108","commentId":2653108,"userName":"cmabr002","timestamp":1487796184,"content":"> Quote\n> \n>  \n> \n> Hi,\n> \n> If you attach Elf-friend to Bill the Pony when his text box is blank, what happens to the attachment when his text box is returned?\n> \n> Thanks,\n> \n> Chris\n> \n>  \n\n> Quote\n> \n> Hi Chris,\n> You have to discard all attachments from Bill the Pony once his text box becomes active again.\n> Cheers,\n> Caleb\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2654453","commentId":2654453,"userName":"TwiceBorn","timestamp":1487876179,"content":"cmabr002... what was the date of Caleb's reply to your question regarding Bill the Pony?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2655905","commentId":2655905,"userName":"danpoage","timestamp":1487955161,"content":"Now I am very confused. I thought \"Cannot have attachments\" was only checked at the time a card was attached. Do we have a definition of the \"Cannot have attachments\" (e.g. a rules sheet) which explains that it is a passive effect that is constantly checking? Is this a ruling reversal on Caleb's part? I can't find anything about it in the FAQ, so I'm just confused where this is coming from. Perhaps the word \"cannot\" makes the effect a passive one which is constantly checked? Understanding the rules for this game sometimes feels like studying for a law degree..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2655927","commentId":2655927,"userName":"Teamjimby","timestamp":1487955756,"content":"This is consistent with how I have always played and understood the game.  Cards like Burning Brand that have requirements to attach only check during the initial attaching, but \"Cannot have attachments\" always checks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2656033","commentId":2656033,"userName":"dalestephenson","timestamp":1487959581,"content":"If only Beorn's text said \"Cannot attach attachments\" instead of \"cannot have attachments\", we'd be OK.  If Burning Brand said \"cannot be attached to non-lore characters\" it would fall off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2656350","commentId":2656350,"userName":"cmabr002","timestamp":1487971902,"content":"> On 2/23/2017 at 1:56 PM, TwiceBornh said:\n> \n> cmabr002... what was the date of Caleb's reply to your question regarding Bill the Pony?\n\nIt was two days ago. \n\nEdited February 24, 2017 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2656439","commentId":2656439,"userName":"TwiceBorn","timestamp":1487975703,"content":"> 1 hour ago, cmabr002 said:\n> \n> It was two days ago. \n\nOkay, that's as recent as it gets (wasn't sure if you had asked the question some time ago and just posted the QA now). Thanks for that.\n\nReally hope this QA finally makes it into the next FAQ. It's been an issue long enough, and if that's the final answer, then I'd like to see it made \"official.\" Like Danpoage said, the amount of \"legal research\" required to play this game correctly can be unnecessarily frustrating. \n\nEdited February 24, 2017 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/242994-cannot/?do=findComment&comment=2656899","commentId":2656899,"userName":"Seastan","timestamp":1488028585,"content":"We need to put an end to this myth.\n\nHaving followed this ruling for a while, it seems to have all started several years ago when danpoage got his Beorn blanked at GenCon, and Caleb, looking on, allowed the attachments to stay when he became un-blanked.\n\nWhat I think happened there is that Caleb forgot about the text \"Cannot have attachments\" thinking only that Beorn had the text \"Immune to player card effects.\" If this were the case, then you would indeed be prevented from attaching player cards to him, but if you managed to do so while he was blank, they would stay on when he becomes un-blanked. However as Beorn becomes unblanked he would also become immune to his attachments, making most attachments worthless anyway. i believe Caleb mentioned as much at the time, reinforcing this idea that Caleb was only concerned about the \"immune to player card effects\" text.\n\nAs others have mentioned, \"Cannot have attachments\" is actually the relevant text here. It is passive, and absolute.\n\nBack in April 2016 we had a big fight about this on Discord, with one side arguing based on the aforementioned \"GenCon ruling\" and the other side (basically just me) arguing that it made no sense. I have posted the whole discussion below. Be sure to read to the end, and note that Feonix is Matt Newman, co-developer of the game.\n\n \n\n> Quote\n> \n> [11:28 AM] Seastan: A player event that can blank text boxes could be afun way of handling it. Blank Beorn for a turn.. he loses his defensive ability but allows you to heal him up. As long as it was difficult to repeat like WotW it could be balanced.\n> [11:28 AM] AtaruSlash (Sean): Getting a citadel plate on him is an achievement unlocked moment.\n> [11:28 AM] Seastan: But pretty milimted use outside of that\n> [11:28 AM] AtaruSlash (Sean): Panzer-Beorn\n> [11:29 AM] barahir: Wouldn't he still be immune to the blanking event?\n> [11:29 AM] PocketWraith: Nah, what you want is to get him a Raven-winged Helm, a Song of Wisdom and A Burning Brand.\n> [11:29 AM] PocketWraith: Because all of those would continue working once he gets his text back.\n> [11:29 AM] PocketWraith: Well, the Song wouldn't, but the Brand would.\n> [11:29 AM] Seastan: !ringsimg Beorn t:hero\n> [11:29 AM] ♦ Botomir: Cards found: 1\n> [11:29 AM] ♦ Botomir: \n> \n> [11:30 AM] gandalfDK: !rings wotw\n> [11:30 AM] ♦ Botomir: Alas, the Horn of Gondor couldn't bring forth your cards.\n> [11:30 AM] Seastan: Once he gets his text back he drops all attachments\n> [11:30 AM] PocketWraith: Nope.\n> [11:30 AM] AtaruSlash (Sean): Nerp\n> [11:30 AM] chrsjxn: lol. No attachments and Immune to player card effects. They really want to shut that down\n> [11:30 AM] gandalfDK: Nope\n> [11:30 AM] PocketWraith: It's only checked when you're attaching them.\n> [11:30 AM] AtaruSlash (Sean): ^^\n> [11:30 AM] PocketWraith: Confirmed by Caleb.\n> [11:30 AM] Seastan: @PocketWraith no, its a passive. \"Cannot have attachments\"\n> [11:30 AM] gandalfDK: He keeps the immune though, so it doesn't matter\n> [11:30 AM] PocketWraith: So if you attach them while he's blank he can keep them.\n> [11:30 AM] AtaruSlash (Sean): Hmmm\n> [11:30 AM] PocketWraith: Did you read what I said? CONFIRMED BY CALEB.\n> [11:31 AM] Seastan: there are other effects that say \"Attachments cannot be played on///\"\n> [11:31 AM] Seastan: Where?\n> [11:31 AM] gandalfDK: Email, FFGforumws\n> [11:31 AM] PocketWraith: Well, @gandalfDK, that's why you do the Helm and the Burning Brand, because they don't target him, they target the damage and the shadow effects respectively.\n> [11:31 AM] gandalfDK: Yup\n> [11:32 AM] gandalfDK: Poweeerrr Up\n> [11:32 AM] barahir: So does immune mean targeting only\n> [11:32 AM] barahir: or does it stop global effects too?\n> [11:32 AM] Some Sort: @PocketWraith Maybe in terms of raw power, but not in terms of design flexibility. Shadow gets you the tools to make one deck type. Granted, a powerful one! But Watcher / Foundations enable a lot more different archetypes, IMO.\n> [11:32 AM] barahir: I thouhgt it was the latter\n> [11:32 AM] PocketWraith: Also as I recall Beorn (blogger, not hero) asked Caleb about it at GenCon while playing Stone of Erech.\n> [11:32 AM] Some Sort: @barahir Immune shuts down everything. In Magic, they had \"cannot be the target of cards\", which still let through global effects. Can't think of anything like that in LotR offhand.\n> [11:33 AM] barahir: In which case, it wouldn't matter if you had \"Blank all heroes' boxes\" or whatever\n> [11:33 AM] barahir: I think Magic started out with complete immunity, but they changed it after it caused too many rules problems\n> [11:33 AM] Seastan: I can't find this Beorn ruling\n> [11:33 AM] PocketWraith: Yeah, immune means they can't be affected or targeted by player card effects.\n> [11:34 AM] Some Sort: If the developers wanted to open up Beorn, all they need is a card that says \"target card can be affected by player cards. This card can affect targets that are immune to player cards\".\n> [11:34 AM] gandalfDK: Yeah  @PocketWraith @Beorn  asked this\n> [11:34 AM] aristal: you all keep arguing, I'm going back into my Campaign Mode hole from yesterday... :smiley:\n> [11:34 AM] Some Sort: (Or \"target card's text box is blank\". Really you just need to add something on the card that explicitly states it can target cards that are immune to player effects.)\n> [11:34 AM] gandalfDK: He mentioned it on the Greyco podcast\n> [11:34 AM] Seastan: What does it even mean for an ability to be passive then\n> [11:35 AM] gandalfDK: @Feonix could you help out here maybe?\n> [11:36 AM] chrsjxn: Attachments are just weird in LOTR. They only check validity when you attach them. Though FFG got smarter about this for Thrones 2e\n> [11:36 AM] barahir: If you have an \"immunity-breaker\" keyword\n> [11:36 AM] barahir: It's a matter of time before you add \"Super immunity\"\n> [11:37 AM] Feonix: Sup?\n> [11:37 AM] AtaruSlash (Sean): Yeah I actually think lotr is the only one(that I've played anyway) that doesn't continually check for attachment eligibility\n> [11:37 AM] AtaruSlash (Sean): Oh ****, we Beetlejuiced Matt\n> [11:37 AM] gandalfDK: @Feonix do you have the ruling on blanking Beorn and then attaching attachments on him?\n> [11:38 AM] gandalfDK: I did\n> [11:38 AM] Feonix: Haha\n> [11:38 AM] Feonix: Like, if you blank beorn, can you then give him stuff?\n> [11:38 AM] Seastan: So this guy's victory display ability is useless as long as you play all your attachments on the trolls before killing him?\n> http://hallofbeorn.com/Cards/Details/Stuart-CatCN [http://hallofbeorn.com/Cards/Details/Stuart-CatCN]\n> [11:39 AM] gandalfDK: Yes and if they are still taking effect like Burning Brand and Raven winged Helm\n> [11:39 AM] gandalfDK: Caleb ruled tgis\n> [11:39 AM] gandalfDK: But we can't seem to find it\n> [11:39 AM] gandalfDK: This*\n> [11:39 AM] Feonix: He'll keep any attachments you give him while blanked, because attachments don't \"fall off\" when he regains his immunity. But once he's no longer blanked many attachments will cease to function because his immunity will prevent them from giving affecting him\n> [11:39 AM] gandalfDK: Thank you\n> [11:40 AM] Seastan: The question isnt whether you can put stuff on him while blank, but whether it stays attached once he's un-blanked\n> [11:40 AM] gandalfDK: Well, he gave an answer to that as well\n> [11:40 AM] Seastan: Ok I see you just answered that\n> [11:40 AM] Feonix: Like, you could give him Dunedain cache while he's blanked and he'll get ranged. And once he's un-blanked he'll keep the cache. But it will no longer give him ranged\n> [11:41 AM] AtaruSlash (Sean): Ahhh rules.\n> [11:41 AM] gandalfDK: No but the Burning Brand will still be active because it targets the shadows and not Beorn\n> [11:41 AM] AtaruSlash (Sean): @Seastan was right in spirit, but not in letter\n> [11:41 AM] gandalfDK: Like Raven Winged targets the damage\n> [11:41 AM] Seastan: So, how come, the passive ability on Dain checks itself continually but not Beorn?\n> [11:42 AM] Feonix: Hm, possibly. I thinkyou are correct on that. But I'll have to double check with Caleb\n> [11:42 AM] Seastan: As soon as Dain becomes un-blank all the dwarves regain their boost immediately\n> [11:43 AM] Feonix: Beorn's ability constantly checks itself too. The difference is that in LOTR attachments only check for their legal target at the time you play them\n> [11:43 AM] gandalfDK: The player card effect is not having an attachment but playing an attachment?(edited)\n> [11:43 AM] Feonix: Like, if you play \"attach to an ally\" on an ally and then sword-thain them, the attachment stays\n> [11:44 AM] AtaruSlash (Sean): Oh ****, Swordthain of Morthond just became a thing\n> [11:44 AM] Seastan: How would you phrase it if it was the intention to drop the attachments then... it seems like this is the language you would use.\n> [11:44 AM] Beorn: Let's call it what it really is: discrimination against bears\n> [11:44 AM] Feonix: Immunity prevents an attachment from being played on you, but it doesn't necessarily prevent you from having an attachment. It does prevent you from being affected by an attachment though\n> [11:44 AM] gandalfDK: Yes, okay\n> [11:45 AM] Seastan: @Feonix Right but Beorn also has the specific text \"Cannot have attachments\"\n> [11:45 AM] Seastan: not just player card immunity\n> [11:45 AM] Beorn: \"Sword-thain of Morthond\" doesn't work, btw\n> [11:45 AM] Beorn: the second sentence on the sword:\n> \n> \n> Attached ally gains the Outlands trait.\n> [11:45 AM] Beorn: stops working when the ally becomes a hero\n> [11:46 AM] AtaruSlash (Sean): ...dammit\n> [11:46 AM] Feonix: Yeah, the effect calls out ally as well as the restriction\n> [11:46 AM] gandalfDK: !rings morthond\n> [11:46 AM] ♦ Botomir: Lord of Morthond\n> Leadership Attachment - Cost: 1\n> Title.\n> Attach to a Gondor or Outlands hero.\n> If each hero you control has a printed [leadership] resource icon, Lord of Morthond gains: \"Response: After you play a [lore], [spirit], or [tactics] ally, draw 1 card.\"\n> \"The Captains of the Outlands are expected up the South Road ere sundown. Come with us and you will see.\"  – Bergil, The Return of the King\n> \n> \n> Sword of Morthond\n> Leadership Attachment - Cost: 1\n> Item. Weapon.\n> Attach to a Gondor ally.\n> Attached ally gains the Outlands trait.\n> The Morthond Valye made a great bay that beat up against the sheer southern faces of the mountains.\n>  – The Return of the King\n> \n> [11:46 AM] AtaruSlash (Sean): Way to crush my dreams, guys.\n> [11:46 AM] Beorn: with my giant paws :smiley:\n> [11:47 AM] Feonix: Anyway, hope that helps. You can always email Caleb if you want the two of us to discuss it. Haha\n> [11:47 AM] gandalfDK: Haha\n> [11:47 AM] gandalfDK: @Seastan will you send an email?\n> [11:47 AM] gandalfDK: Otherwise I will\n> [11:48 AM] Seastan: I would understand the ruling if Beorn were just immune to player card effects. But the additional text \"Cannot have attachments\" seems harder to reconcile with the ruling.\n> [11:48 AM] PocketWraith: I think the answer is that the phrasing on cards is not always consistent.\n> [11:49 AM] AtaruSlash (Sean): That's gotta be so hard to get right as a designer.\n> [11:49 AM] Beorn: Cannot have attachments was specifically defined in A Journey to Rhosgobel to mean \"Players cannot attach player card attachments to this card\" (my wording)\n> [11:50 AM] Beorn: but it is only checked at the time of attaching\n> [11:50 AM] Beorn: I actually had this very issue happen at GenCon, with Caleb watching\n> [11:50 AM] Beorn: (and laughing along)\n> [11:50 AM] Feonix: Oh. You know, I forgot he said cannot have attachments tok\n> [11:50 AM] Feonix: I completely forgot that\n> [11:50 AM] Beorn: My Beorn was blanked by Stone of Erech\n> [11:50 AM] gandalfDK: !rings beorn\n> [11:50 AM] ♦ Botomir: Beorn\n> Tactics Ally - Cost: 6\n> 1 willpower\n> 3 attack\n> 3 defense\n> 6 hit points\n> Beorning. Warrior.\n> Action: Beorn gains +5 [attack] until the end of the phase. At the end of the phase in which you trigger this effect, shuffle Beorn back into your deck. (Limit once per round.)\n> \"I don't need your service, thank you...but I expect you need mine.\"  – The Hobbit\n> \n> \n> Beorn's Hospitality\n> Lore Event - Cost: 5\n> Action: Choose a player. Heal all damage on each hero controlled by that player.\n> \"...and my house is open to you, if ever you come back this way again.\"\n>  – Beorn, The Hobbit\n> \n> \n> Beorning Beekeeper\n> Tactics Ally - Cost: 4\n> 1 willpower\n> 2 attack\n> 1 defense\n> 3 hit points\n> Beorning.\n> Action: Discard Beorning Beekeeper from play to deal 1 damage to each enemy in the staging area.\n> \"We are getting near,\" said Gandalf. \"We are on th eedge of his bee pastures.\"  –  The Hobbit\n> \n> \n> You can see the other 1 cards at http://ringsdb.com/find?q=beorn [http://ringsdb.com/find?q=beorn] or use the advanced search parameters to refine your search.\n> [11:51 AM] Extra: immuse to player card effects is not same as \"cannot have attachement because if the last was not write you could attach attachement but the attachements will be blank :wink:\n> [11:51 AM] Beorn: My understanding was that \"Cannot have attachments\" is only a play restriction\n> [11:52 AM] Beorn: not a passive that is constantly checking\n> [11:52 AM] Beorn: is that not the case?\n> [11:52 AM] Seastan: @Beorn http://hallofbeorn.com/Cards/Details/Great-Cave-troll-KD [http://hallofbeorn.com/Cards/Details/Great-Cave-troll-KD]\n> [11:52 AM] Seastan: The wording is different in that case\n> [11:52 AM] Feonix: Cannot have attachments might cause it to fall off.\n> [11:53 AM] Beorn: Honestly, this kind of word magic is one of the things that drives me a bit crazy\n> [11:53 AM] Extra: attachemnt is not faill off just the attachement will be no effect on beorn\n> [11:53 AM] gandalfDK: @Beorn same here\n> [11:54 AM] Seastan: Like, how would you word it if you really didn't want attachments on the card? \"Super-super can't have attachments! I'm serious!!!1\"\n> [11:54 AM] PocketWraith: If this argument causes that ruling to be changed before I have a chance to pull off my Beorn/Raven-winged Helm/Burning Brand shenanigans, I'm going to be so annoyed.\n> [11:54 AM] gandalfDK: I will email Caleb in a moment\n> [11:54 AM] Beorn: In any case, when I had Beorn blanked playing Stone of Erech, Caleb actually joked about someone attaching Citadel Plate to him - and that it would not fall off after Beorn gets his text box back\n> [11:54 AM] Beorn: but maybe Caleb has changed his mind on this?\n> [11:55 AM] Seastan: @gandalfDK be sure to mention the \"Cannot have attachment\" text. i think it's easy to forget and just assume he's immune to card effects.\n> [11:55 AM] gandalfDK: Or he oversaw the \"cannot have attachments\"?\n> [11:55 AM] gandalfDK: Yupp\n> [11:55 AM] gandalfDK: @Feonix also did it, so Caleb could do the same. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> [11:55 AM] PocketWraith: Well I think Beorn was released in the period when there was that weird ruling that you could play attachments on immune cards even though they wouldn't do anything (which has since been reversed). That or it was put there to stop him having encounter card attachments as well.\n> [11:56 AM] chrsjxn: Interestingly, cannot have attachments makes him immune to some annoying treacheries.\n> [11:56 AM] Beorn: Yeah, \"cannot\" should always be absolute - so I guess it would have to be a passive effect that is constantly checking\n> [11:56 AM] Seastan: @gandalfDK I would link to Great Cave Troll as well to compare the wording.\n> [11:56 AM] Beorn: and the moment his text is not blank, any attachments would have to fall off\n> [11:56 AM] Beorn: otherwise \"cannot\" is not absolute\n> [11:57 AM] Feonix: Yeah sorry, I totally forgot he had \"cannot have attachments\". I thought he was just immune.\n> [11:57 AM] Seastan: Yeah, there is no stronger language in the game\n> [11:57 AM] gandalfDK: Will do! Anything else,  @Seastan I should really not forget?\n> [11:57 AM] Feonix: That changes things. Haha\n\n...\n\n> Quote\n> [12:38 AM] gandalfDK: There it is\n> .eJwFwVEOxBAQANC7-GcYBttr7AE2okKTlobp12bvvu99xTNPsYnGfK8NYD9WHnNXi8dMtag6Rj1Luo-l8rggMafcrtJ5gUHnNXoi54I1kSyCCdq-ECPF4Cx5RIJ3nqX01QZ_UBsvtZOGpPbSBmmNunsVvz9Xzifs.Qa43OhoEJg4nRQu_WTBxTbg7Tbc?width=169&height=301 [https://images.discordapp.net/.eJwFwVEOxBAQANC7-GcYBttr7AE2okKTlobp12bvvu99xTNPsYnGfK8NYD9WHnNXi8dMtag6Rj1Luo-l8rggMafcrtJ5gUHnNXoi54I1kSyCCdq-ECPF4Cx5RIJ3nqX01QZ_UBsvtZOGpPbSBmmNunsVvz9Xzifs.Qa43OhoEJg4nRQu_WTBxTbg7Tbc?width=169&amp;height=301] [https://cdn.discordapp.com/attachments/124602655447318532/170392285874356225/Screenshot_2016-04-15-06-37-31.png]\n\n \n\nEdited February 25, 2017 by Seastan"}]}