{"url":"https://community.fantasyflightgames.com/topic/244650-mablung-vs-raid-leader-grey-havens-card-66/","title":"Mablung Vs Raid Leader (Grey Havens Card 66)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/244650-mablung-vs-raid-leader-grey-havens-card-66/?do=findComment&comment=2679705","commentId":2679705,"userName":"JTG81","timestamp":1489340400,"content":"Just wanted to make sure we played this correctly.\n\nRaid leader has a Forced Effect:When Raid leader engages you, move 1 resource from each of your heroes' resource pool to Raid leader.\n\nMablung has Response: After you engage an enemy, add 1 resource to Mablung's resource pool. (Limit once per phase).\n\nFor reasons we would engage Raid leader while we had no resources to avoid his forced effect which brought to question which happens first, his Forced effect or triggering Mablung response? We played that the response would trigger after the forced and thus Mablung could still collect the resource and avoid giving it to the Raid leader.\n\nEdited March 12, 2017 by JTG81"},{"commentUrl":"https://community.fantasyflightgames.com/topic/244650-mablung-vs-raid-leader-grey-havens-card-66/?do=findComment&comment=2679716","commentId":2679716,"userName":"Watcher in the Water","timestamp":1489340689,"content":"I believe you are correct. Since Raid Leader says \"when ...\" and Mablung says \"after ...\" I'm pretty sure that Raid Leader would trigger first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/244650-mablung-vs-raid-leader-grey-havens-card-66/?do=findComment&comment=2679788","commentId":2679788,"userName":"NathanH","timestamp":1489344709,"content":"If a Forced and  Response effect have the same trigger, the Forced effect triggers first.\n\n \n\nI'm not sure if there's an distinction between \"when\" and \"after\" here, but either there is no distinction and the above rule works in your favour, or there is a distinction that means the Raid Leader's effect goes first anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/244650-mablung-vs-raid-leader-grey-havens-card-66/?do=findComment&comment=2679944","commentId":2679944,"userName":"RichardPlunkett","timestamp":1489353730,"content":"From the FAQ:: (1.37) Timing of effect resolution\nWhen resolving multiple effects with a shared condition, players should use this order of resolution: passive abilities first, Forced effects second, Response actions third. When determining the order of effect resolution among abilities within those categories, players should first resolve abilities that use the word “when” and then resolve abilities with the word “after”\n\nSo it's pretty clear the Raid Leader resource loss (being Forced) happens before the Mablung resource gain, ehich is only a Response.\n\nAnd even if the Mablung resource gain were also Forced it would still be second due to the when/after tiebreaker.\n\n \n\nEdited March 12, 2017 by RichardPlunkett"}]}