{"url":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/","title":"Strategy for Thing in the Depths solo?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2708945","commentId":2708945,"userName":"Trialus","timestamp":1490812313,"content":"Admittedly, I am not the best deck builder or player, but I am finding this quest especially difficult.  I am really struggling to get past even the first stage.  Have tried both sleazy and easy modes to no avail.  I have tried rushing it, thinking that early travel to the Helm and early engagement would make it easiest to quickly quest through first stage, but it any hiccup in that plan means more rounds where they attack and Sahir hits HARD for early game....commonly end up down a hero pretty quick with this strategy.  I have also tried to build up board state before travelling to Helm and engaging, but then they both hit hard and questing through is even tougher.  I am currently using a 3 hunters deck of my own design,  so that might be the problem.  I have considered switching to a low threat trap deck to have time to build up and then maybe forest snare them both to allow me to quest without having to worry about defending their big attacks, but am open to other strategies or deck types as well.\n\nThanks for the help!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2709814","commentId":2709814,"userName":"Seastan","timestamp":1490874611,"content":"Turtling can work for this quest as long as you bring a deck that has a lot of late game willpower. Something like Outlands or an ally swarm with Faramir and Sword that was broken. That way you can clear the Helm and the quest in one go and only have to deal with the corsairs for one turn.\n\nThe downside to doing it this way is that by the time you get to the second stage of the quest you are unstoppable and it becomes too easy.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2709958","commentId":2709958,"userName":"Lecitadin","timestamp":1490880602,"content":"I beat the quest recently with this deck [http://www.ringsdb.com/decklist/view/4774/very-peace-so-thoughts-many-aggro-2.0] (taking Sahir and company early, sacrificing allies)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2710148","commentId":2710148,"userName":"Seastan","timestamp":1490886841,"content":"> 1 hour ago, Lecitadin said:\n> \n> I beat the quest recently with this deck [http://www.ringsdb.com/decklist/view/4774/very-peace-so-thoughts-many-aggro-2.0] (taking Sahir and company early, sacrificing allies).\n\nHuh, that's the opposite of what I'd consider an ideal deck for this quest. Cool that it still worked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2710212","commentId":2710212,"userName":"Trialus","timestamp":1490888644,"content":"Thanks for the help guys!!  I'll work on the turtling strategy and see if I can get built up enough to manage the corsairs for a bit to finish the stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2710777","commentId":2710777,"userName":"donkler","timestamp":1490908528,"content":"Hmmm is Mariner's Compass kind of a silver bullet for the 2nd part of the quest? What happens to the tentacles attached to a location when it is switched with another location in the deck? Are they just discarded like a regular attachment would when the card it is attached to leaves play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2711505","commentId":2711505,"userName":"Lecitadin","timestamp":1490962113,"content":"> 20 hours ago, Seastan said:\n> \n> Huh, that's the opposite of what I'd consider an ideal deck for this quest. Cool that it still worked.\n\nYeah, I just wanted to try (I had the deck in hand), and by taking the 2 enemy allies with only 3 or 4 resources on them, I defended one with Boromir and the other one killed an ally. If you can quest the next turn through the Helm and place 4 progress and go to the next stage of the quest, you're basically done!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2711742","commentId":2711742,"userName":"Calvadur","timestamp":1490969653,"content":"> 16 hours ago, donkler said:\n> \n> Hmmm is Mariner's Compass kind of a silver bullet for the 2nd part of the quest? What happens to the tentacles attached to a location when it is switched with another location in the deck? Are they just discarded like a regular attachment would when the card it is attached to leaves play?\n\nDiscarding would make sense to me.\n\nAn Argument agains that is of Course, that it makes the quest easier/to easy. But as you Need to kill so and so many enemies to finish the last stage you don't \"skip\" the enemies you just delay the combat, what in my opinion should be a viable strategy, in case you got to many attached enemies and are about to loose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246005-strategy-for-thing-in-the-depths-solo/?do=findComment&comment=2712915","commentId":2712915,"userName":"Trialus","timestamp":1491011812,"content":"Just wanted to pop back in and say thanks to all for the help!  Just beat it using my same deck that I had been running.  The key turned out to be just turtling for a LONG time...like 9 turns.  By that time I had a pretty strong group of questing allies (Arwen, handmaidens, Ghan-Buri-Ghan) along with Sword that was Broken and Celebrian's.  Was able to able to throw a chump at the very strong first mate and have Gimli defend against Sahir with a couple of Dunedain Warnings, then quested through stage next turn (just barely with all of the tokens on the Captain and First Mate).  Once past the first stage you guys were spot on...turned out to be pretty easy to finish.  Quite fun though, I really enjoyed the Grapple mechanic and how you had to damage the Thing.\n\nNow onto Temple of the Deceived!  Been really looking forward to this one, map mechanic seems neat.\n\nThanks again!!"}]}