{"url":"https://community.fantasyflightgames.com/topic/246150-haldir-and-quick-strike/","title":"Haldir and Quick Strike","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/246150-haldir-and-quick-strike/?do=findComment&comment=2711640","commentId":2711640,"userName":"Aurion","timestamp":1490967374,"content":"Am I right in thinking that as Haldir's ability is a combat action that you cannot use quick strike to target an enemy in the staging area outside of the combat phase? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/246150-haldir-and-quick-strike/?do=findComment&comment=2711841","commentId":2711841,"userName":"monkeyrama","timestamp":1490971479,"content":"Regardless of any other issues, since Haldir's ability is a combat action that creates its own framework event (an attack) with special rules, and Quick Strike is also an action that creates a framework event (an attack) with special rules, the two cannot combine. This is in addition to the fact that Haldir's combat action only works within the combat phase. In short: you are right!\n\n(If, on the other hand, a hero had the ability to attack an enemy in the staging area whenever they are declared as an attacker, eg Dunhere, then you can combine them, since his ability modifies the rules of a framework event (an attack) which is being activated by another action, in this case Quick Strike).\n\nThis, at least, is how I understand it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246150-haldir-and-quick-strike/?do=findComment&comment=2711969","commentId":2711969,"userName":"Aurion","timestamp":1490974116,"content":"Thanks for the quick response. I wasn't sure if Quick Strike's action was to create a temporary combat window in which combat actions could then be taken, so thanks for clarifying that. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/246150-haldir-and-quick-strike/?do=findComment&comment=2718347","commentId":2718347,"userName":"monkeyrama","timestamp":1491397636,"content":"No problem. I think that this game has slowly developed or adopted technical terminology for certain events and actions, and framework event is a useful one: attacks always have the same framework, but can be initiated either during a specific phase or by certain actions."}]}