{"url":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/","title":"&quot;Immune to player card effects&quot; related to enemies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2721136","commentId":2721136,"userName":"Jban","timestamp":1491506623,"content":"Hi all,\n\n\"Immune to player card effects\" have my mind confused numerous times, so therefore set of questions related to this. As far as I am aware \"Immune to player card effects\" only hold if the following two criteria are met\n\n * The card with \"Immune to player card effects\" is in play\n * The card is targeted by a player card effect. Targeted has to be seen as an active word, so any card that uses wordings as \"Choose an enemy,\" etc.\n\nSo as a consequence of these I want to sketch a few scenarios that illustrate the options.\n\n 1. 'Wait no Longer' and 'Dunedain Hunter' can be used to target an enemy that is \"Immune to player card effects\"\n 2.  'Yazan' and 'Thalin' cannot deal 1 damage to enemies with \"Immune to player card effects\" by their effect.\n 3.  Bard the Bowman, Aragorn (Ta) (both effects) do not affect enemies with \"Immune to player card effects\" by their effect.\n 4. 'Forth Eorlingas', 'Quick Strike' and 'Hands upon the Bow' do work to target enemies with \"Immune to player card effects\".\n 5. 'Knife-Work' does not work to reduce the defense of enemies with \"Immune to player card effects\".\n 6. 'Feint' does not work to prevent an enemy with \"Immune to player card effects\" to attack you.\n 7. 'Hobbit-Sense' and 'Out of Sight' do not target enemies with \"Immune to player card effects\" along all other enemies. So, the enemies enemies with \"Immune to player card effects\" still attack you.\n\nAm I correct in these instances?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2721192","commentId":2721192,"userName":"NathanH","timestamp":1491508531,"content":"You're right with everything except 4. Of the cards listed in 4, only Quick Strike can be used against immune enemies, because reasons."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2721427","commentId":2721427,"userName":"RichardPlunkett","timestamp":1491518862,"content":"As NathanH says, your list is mostly correct. Most of the cards in point 4 are a subject of debate and some discontentment wrt immunity and current rulings. NathanH reported on its current standings, but can imagine it changing in the future (at least I hope at some point we get a more coherent basis for deciding which apply, rather than what seems to me like an ad-hoc ruling on each instance).\n\nBut for your opening two points, the first one is true but the second seems incorrect or irrelevant. Cards immune to player card effects are immune regardless of whether any card would be required to target them in causing its effect. For example, say a Northern tracker adds progress to each staging area location. An immune location in the staging area would receive no token, although its presence wouldn't stop other locations receiving them.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2722112","commentId":2722112,"userName":"Seastan","timestamp":1491572530,"content":"If 4 were true, you could circumvent entire quest mechanics by killing, for example, Bolg or the Thing in the Depths with a staging area attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2723303","commentId":2723303,"userName":"ParinorB","timestamp":1491637900,"content":"Hmm that is interesting and I wasn't aware of that. What is the logic behind \"Hands upon the Bow\" not working and \"Quick strike\" working. In other words, what is the difference between the wording of:\n\nHands upon the bow -> \"against an enemy in the staging area\"\n\nvs\n\nQuick strike -> \"Against an eligible enemy target\"\n\nIs there a logic one can try to remember or is it just something one has to know from the FAQ?\n\nAlso, just to check; can Dunhere still attack enemies immune to player card effects in the staging area? I am uncertain now..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2723311","commentId":2723311,"userName":"NathanH","timestamp":1491639386,"content":"No, Dunhere cannot.\n\n \n\nThe very shaky logic why Quick Strike works is that it creates a standard opportunity to attack, just at an unusual moment. Once this opportunity to attack is created, you can do whatever you could normally do with it. For the other cards, they not only create an opportunity to attack but also change the eligibility of the target. Now, of course you're thinking \"But these cards are just changing the rules on attack eligibility just like Quick Strike, they're just changing the rules in a different way, so they still should work\". This is a reasonable thought. But the true underlying reason why they don't work is that allowing them to work would trivialise some quests. You should always bear in mind the Unwritten Rule: immune to player card effects enemies can never be attacked or damaged by the player while in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2723325","commentId":2723325,"userName":"ParinorB","timestamp":1491641408,"content":"Ok - thanks for the clarification. I guess if they would design the game again, they could clarify that with the word \"target\" or something else. My intuitive understanding would be that anything that \"targets\" a card that is immune cannot be used. But anything that targets your character that you then use to do attack an immune card should work (e.g. attack bonuses, repeat attacks etc.)...\n\nAnyway, I guess we all agree that it could have been made clearer and I will try to remember your unwritten rule. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2723390","commentId":2723390,"userName":"RichardPlunkett","timestamp":1491649158,"content":"Personally, I think \"Immune to player card effects enemies can never be attacked while in the staging area\" or similar would be good text to add to the definition of immunity. It would return the rules+rulings to a sane state rather than the current hash."},{"commentUrl":"https://community.fantasyflightgames.com/topic/246629-immune-to-player-card-effects-related-to-enemies/?do=findComment&comment=2735259","commentId":2735259,"userName":"JusticeLizard","timestamp":1492359632,"content":"Are we sure Thalin doesn't work?  Is the enemy considered to be in play and have its immunity, before its when revealed effects and keywords trigger?"}]}