{"url":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/","title":"Skip the deluxe and play the saga?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2736853","commentId":2736853,"userName":"FrogTrigger","timestamp":1492455303,"content":"I was getting into LOTR about 6 months ago, really enjoyed the game and have played it a lot with a friend who also liked it. I was having a hell of a time tracking down the early packs though, so much so that I decided to stop playing and focused on other games. I've had a hankering to play again so I re played some of the existing scenarios I have (I've got the core + the first wave - conflict) and I decided I would try to play it again but I'm still finding it really hard to get the decks I need. Online shipping to my area adds a good chunk and I prefer to support my LGS. So I was curious, the box expansions seem to be readily available, can I just skip the deluxe boxes and play the saga, all the way to the end? Or will I find myself eventually going up against scenarios that I am not equipped for or can't build the proper deck to beat?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2736869","commentId":2736869,"userName":"dalestephenson","timestamp":1492456000,"content":"You can skip the deluxe boxes and just play the saga.\n\nYou may need to use easy mode to beat some of the quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2736914","commentId":2736914,"userName":"Mauziz","timestamp":1492457260,"content":"I strongly suggest that you not force yourself to play scenarios in the order in which they were published. There are a number of good reasons to not do this:\n\n 1. (As you point out) some of the older expansions are harder to find, and there is simply no reason for you to stop playing because you can't purchase the next expansion.\n 2. This game is so innovative and new that it took the designers a while to find their legs, so to speak. This means that some of the earlier quests just aren't as good as the later ones. Escape from Dul Guldor is a great example of a quest that would never be printed today. In fact there are several other prison-break themed quests that are simply better. This isn't a knock against Nate French or any of the early designers, it's just a fact that they had no template from which to work.\n 3. The player cards are (for the most part) stronger now. If you look at early allies vs the new allies coming out, there are some substantial differences in power. Some of that is a touch of power-creep, but a lot is just fine tuning what an ability is actually worth. Again, Nate French and the early designers were working with a blank slate and they had really no idea that cards like Guard of the Citadel and Horseback Archer would be so... under powered. Cards like these have been replaced with slightly more powerful versions in the later expansions.\n 4. While the quests do get harder, they (for the most part) don't require you to own previous sets to be competitive. Strong decks can be made with a limited pool of cards, and the more recent cycles have done a good job of being more focused. Want a sylvan deck? Make sure you pick up the Ring-maker. This means that you don't have to jump around quite so much to pick up important cards for a specific deck you want to build. As long as you are comfortable playing a quest on easy mode (also called awesome mode) then there are very few quests that would be outside your reach, and most of those are the extremely difficult gencon quests.\n 5. Finally, don't be afraid to proxy specific cards until they are reprinted. If the only think holding you back from playing your beloved Hobbit deck is a reprint of The Dead Marshes so that you can get Fast Hitch, then I highly suggest printing out the missing card on a piece of paper (admittedly, this only really works if you sleeve your decks). This makes sure that you can actually play the game and enjoy it right now. Then just make sure that the next time Dead Marshes is reprinted that you buy a copy.\n\nThe only real rule for quest order is that you need to have the deluxe expansion before you play the associated Adventure Packs. So just pick a deluxe that looks interesting (or solicit advice for people's favorite - Dread Realm and Dream Chaser seem like favorites) and start playing it.\n\nHope that helps. And welcome back, hope you get many fulfilling hours out this great game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2742118","commentId":2742118,"userName":"FrogTrigger","timestamp":1492702193,"content":"Wow thanks for the great response. I always just assumed that buying out of release order would either confuse my decks or leave me under powered.  But that is an interesting idea to just skip ahead and try out any cycle I want.\n\nInteresting.. is there a good description of the cycles posted anywhere? What kind of deck I can expect to build in each, what the scenarios are themed like?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2742205","commentId":2742205,"userName":"ParinorB","timestamp":1492703754,"content":"As always in these threads - here [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] is a link to the New Player buying guide which has a description of all different deluxes and some of the focuses.\n\nAlso, here [http://lotr-lcg-quest-companion.com/] is a website where people can vote on the difficulty of the quests. You can look at this as a guide so you are not surprised if you keep loosing against something like Battle of Carn Dum with just the core and one cycle worth of cards (although maybe its possible?)\n\nI did not play beyond Heirs of Numenor yet and I would just advise you to be careful starting with that one. Some of the deluxe quests are notorious for being nasty- however if you buy the entire cycle you may be able to make a strong Outlands deck that can cope with those quests as well...\n\nStory-wise, there starts to be a somewhat continuing story with, I believe, the Ring Maker - but only really in the sense that the \"travels\" of the heroes pick up where the last cycle ended (as I said, I didn't play those yet)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/247447-skip-the-deluxe-and-play-the-saga/?do=findComment&comment=2742215","commentId":2742215,"userName":"JonG","timestamp":1492703941,"content":"Hi Frogtrigger. It's worth having a look at the Boardgamegeek webpage for LoTR CCG where there's loads of threads and info for new players. It's also a super community and people are incredibly helpful.\n\nJust one online guide for new players is here https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\nApologies to ParinorB who answered before me!\n\nEdited April 20, 2017 by JonG"}]}