{"url":"https://community.fantasyflightgames.com/topic/248003-the-mumakil-first-stage/","title":"The Mumakil (First Stage)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/248003-the-mumakil-first-stage/?do=findComment&comment=2748870","commentId":2748870,"userName":"jmbostwick","timestamp":1493003475,"content":"TL;DR: The wording on side 1B of the quest card sets up the possibility for an impossible-to-progress quest, and I'm curious if this is intentional (in order to dramatically increase the difficulty of the quest) or if it's simply an oversight.\n\nLong version: I believe there may be a problem with the first stage of the quest for The Mumakil. To begin the game, you set four Wild Mumak cards out of play, and add one different location per player to the staging area. Stage 1B requires 12 points to progress, and the text in question states \"Forced: After the active location leaves play as an explored location, shuffle 1 set aside Wild Mumak into the encounter deck. The players cannot advance unless the number of Wild Mumak in play is equal to the number of players.\" The possibly game-halting situation centers on the bolded second sentence, because you could run into a situation where you cannot possibly get the number of Wild Mumak to be equal to the number of players.\n\nImagine two people playing this quest. They could easily (in the normal course of the game) clear three or four active locations while trying to complete the quest. That means three or four Wild Mumaks are being shuffled into the deck - and, with bad luck, could mean three or four Wild Mumaks being revealed by the encounter deck and then added to the staging area like normal, before players get at least 12 points of progress on the quest. Now, given that the Wild Mumaks are Indestructible, these two players could be stuck in an impossible situation (because they'd have no possible way to reduce the number of Wild Mumakil in play). The only cards that exist in the game to remove the Wild Mumak are cards which don't enter play until Stage 2.\n\nIn other words, rules-as-written, you have to be incredibly careful with how many active locations you explore: in an N-player game, exploring any more than N active locations leaves you vulnerable to getting completely screwed if you reveal more than N Mumaks (with the exception of 4-player, since there are only 4 Wild Mumak cards). However, that seems incredibly picky and against the spirit of the quest (which involves searching through the wild jungle to find and tame the Mumaks) - and it seems possible (though by no means certain) that the bolded text was intended to say \"at least equal to the number of players\" instead, which would get around the problem nicely.\n\nI'm curious if there's been any official word on this from the developers - is it intended that this be a very difficult, strategic quest in this way, or is it simply an oversight? How have you handled this stage in your own games (and has anyone had the ill luck to have this situation happen to them)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248003-the-mumakil-first-stage/?do=findComment&comment=2749609","commentId":2749609,"userName":"Watcher in the Water","timestamp":1493045537,"content":"I believe this topic has been brought up before, however I don't remember the answer they arrived at. To my knowledge the devs haven't said anything about this, but I would suggest trying to find the other thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248003-the-mumakil-first-stage/?do=findComment&comment=2749701","commentId":2749701,"userName":"RichardPlunkett","timestamp":1493047547,"content":"But without response from the developers, I would have to agree with you that the quest must be undertaken with care to avoid risking it becoming unsolvable.\n\nEnsuring you don't run into too many Mumakil until you have enough progress seems easy enough, as long as you think of it in time. If you don't, then you get to enjoy another attempt, slightly wiser.\n\n "}]}