{"url":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/","title":"The Dead Marshes - Sneak Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2752109","commentId":2752109,"userName":"Hitbaz","timestamp":1493134802,"content":"About Adventure Pack \"The Dead Marshes\": \n\nIf I use Sneak Attack to put Gandalf in the Quest Phase, can he participate in the Escape Test before returning to my hand? (Escape Test forced by Gollum )\n\n \n\n \n\nEdited April 25, 2017 by Hitbaz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2753188","commentId":2753188,"userName":"RichardPlunkett","timestamp":1493160667,"content":"Sneak-Gandalf returns to hand at the end of the phase he enters. Escape tests cause by Gollum are at the end of the quest phase. Generally, the first player chooses the order of simultaneous events. So assuming a rational and helpful first player Gandalf can, if untapped, participate.\n\n \n\nEdited April 25, 2017 by RichardPlunkett"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2753301","commentId":2753301,"userName":"cmabr002","timestamp":1493164258,"content":"> 56 minutes ago, RichardPlunkett said:\n> \n> Sneak-Gandalf returns to hand at the end of the phase he enters. Escape tests cause by Gollum are at the end of the quest phase. Generally, the first player chooses the order of simultaneous events. So assuming a rational and helpful first player Gandalf can, if untapped, participate.\n> \n>  \n\nThe timing resolution for effects that share the same condition is Passive > Forced > Response (Section 1.37 in FAQ).  So I am pretty sure that, in this case, the passive effect created by Sneak Attack will return him to your hand before the Escape test is triggered so he wouldn't be able to participate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2753678","commentId":2753678,"userName":"RichardPlunkett","timestamp":1493191565,"content":"hmm, overlooked the whole forced/passive thing.\n\nThat reasoning makes me squirm, but I can't find any flaws in it. Poor Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2753885","commentId":2753885,"userName":"Hitbaz","timestamp":1493207584,"content":"Perfect, guys. \n\nOfficial answer (Caleb):\n\n\"Sneak Attack creates a passive effect that forces you to return Gandalf to your hand at the end of the round. Passive effects in LotR LCG are always checking the game state to see if they trigger and resolve instantly when they do. If a passive effect and a Forced effect like Gollum’s share the same trigger (in this case ‘the end of the quest phase’), the passive effect must be resolved first before the Forced effect has the opportunity to resolve. \nI’m afraid that means Gandalf will be returned to your hand before you resolve the Escape test.\nI hope you’re enjoying the Shadows of Mirkwood cycle!\nCheers,\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2754841","commentId":2754841,"userName":"Hitbaz","timestamp":1493231957,"content":"Another question about this: \n\nIf I discard 1 card to give Éowyn +1 Willpower, this action continues to the Escape Test (Forced by Gollum)?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2755477","commentId":2755477,"userName":"RichardPlunkett","timestamp":1493254717,"content":"By the same reasoning as for Sneak Attack, any bonus Will you give Eowyn earlier in the phase will wear off before the Escape Test occurs. However, escape tests come with their own action window between commit and resolve, so you could use Eowyn's action then and thus have it impact the test."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2756084","commentId":2756084,"userName":"dalestephenson","timestamp":1493297320,"content":"In the case of Sneak Attack and Gollum, both effects are happening \"at the end of the phase\", while Eowyn's is \"until the end of the phase\".  Intuitively I see \"at the end of the phase\" effects happening within the phase itself, while \"until the end of phase\" effects persist until the phase is *over* -- that is, \"until\" includes the end point, not excludes it.\n\nIf it were not so, the action window between committing and resolve would do you no good for Eowyn's action.  You discard the card, but the passive effect for \"until the end of the phase\" would immediately be checked, meet its end condition, and remove the willpower.  You also couldn't use Faramir, Protector of Lorien, Longbeard Map-Maker, Astonishing Speed, Durin's Song, and many others for any good effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2756596","commentId":2756596,"userName":"TwiceBorn","timestamp":1493311147,"content":"I've always found Eowyn to be a great candidate for Unexpected Courage in The Dead Marshes. It's the only quest I have never lost against."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2756606","commentId":2756606,"userName":"PocketWraith","timestamp":1493311341,"content":"> 3 hours ago, dalestephenson said:\n> \n> In the case of Sneak Attack and Gollum, both effects are happening \"at the end of the phase\", while Eowyn's is \"until the end of the phase\".  Intuitively I see \"at the end of the phase\" effects happening within the phase itself, while \"until the end of phase\" effects persist until the phase is *over* -- that is, \"until\" includes the end point, not excludes it.\n> \n> If it were not so, the action window between committing and resolve would do you no good for Eowyn's action.  You discard the card, but the passive effect for \"until the end of the phase\" would immediately be checked, meet its end condition, and remove the willpower.  You also couldn't use Faramir, Protector of Lorien, Longbeard Map-Maker, Astonishing Speed, Durin's Song, and many others for any good effect.\n\nExcept quest resolution doesn't happen at the end of the phase? There's another action window after resolution before the end of the phase. Not saying you're necessarily wrong, but your second paragraph is totally irrelevant as it's based on a faulty premise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2756752","commentId":2756752,"userName":"dalestephenson","timestamp":1493315304,"content":"I wasn't speaking of quest resolution, but of committing to and resolving Gollum's escape test (a forced test \"at the end\" of the quest phase).  If effects that increase willpower until the end of the phase have their end triggered before Gollum's escape test is triggered, the automatic passive check would end them as soon as you did them during Gollum's escape test.\n\nI agree quest resolution happens before the end of the quest phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2756787","commentId":2756787,"userName":"dalestephenson","timestamp":1493316154,"content":"A similar issue would be in Black Riders, with \"Doom, Doom, Doom\" forcing a balrog attack \"at the end of the phase\".  If \"until the end of phase\" effects are ended simply by being at the end of the phase, effects that could be used for temporary defense boosts would be neutralized."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2757360","commentId":2757360,"userName":"Hitbaz","timestamp":1493332177,"content":"Official answer, guys. Thank you all! \n\n\"Great question! Eowyn’s ability creates a lasting effect that lasts until the end of the quest phase. This type of effect ends immediately when its timer is reached. The Forced effect on Gollum that triggers the Escape test therefore triggers immediately after Eowyn’s ability has switched off, meaning she loses her +1 willpower bonus just before you make the test. \nThe rules for the Escape test say that players may take actions after committing characters to the test, so you can trigger Eowyn’s ability after committing her to the test, but only if you haven’t already triggered her ability that round because of its limit.\nI hope you’re enjoying the Shadows of Mirkwood cycle!\nCheers,\nCaleb\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2757680","commentId":2757680,"userName":"RichardPlunkett","timestamp":1493346111,"content":"Yay, right on both counts this time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2758454","commentId":2758454,"userName":"dalestephenson","timestamp":1493389722,"content":"Can you ask Caleb when Eowyn's willpower boost would expire if you trigger it during Gollum's escape test?  It is, after all, already at the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2759266","commentId":2759266,"userName":"Hitbaz","timestamp":1493409529,"content":"Yes, Dale, I'll ask.\n\nI think if you trigger Éowyn's Action in the Escape Test, then the effect would expire at the end of the Escape Test (Resolution)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2759372","commentId":2759372,"userName":"dalestephenson","timestamp":1493412888,"content":"I suspect that'll be the answer, but I don't know how to justify it with \"ends immediately when its timer is reached\" and \"Passive effects in LotR LCG are always checking the game state to see if they trigger and resolve instantly when they do\".  Maybe there'll be an official ruling that the end-of-phase magically un-ends for the duration of Gollum's escape test or the Balrog's attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2760670","commentId":2760670,"userName":"RichardPlunkett","timestamp":1493523879,"content":"I am not sure there can be two end-of-phases trigger points in the same phase. In my group, I would argue for it to expire at the end of the following phase but have little idea of what Caleb would say. It is also hard to see the difference making much difference in this case.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2764896","commentId":2764896,"userName":"Hitbaz","timestamp":1493764996,"content":"The Dead Marshes - Action Window - Escape Test:\n\nQ: What happens if you trigger Eowyn's or Faramir's ability during the action window provided by the Escape Test triggered by Gollum's Forced effect?\n\nOfficial Answer\nThe +1 willpower boost will last until the end of the following phase, in this case the Travel phase.\nCheers,\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2765183","commentId":2765183,"userName":"RichardPlunkett","timestamp":1493786345,"content":"So, that suggests there isn't a second bite at end-of-phase (which for some reason I think we already knew), and for effect like this expiring, any end-of-phase will do, even if it's not the one you were nominally in when you used the ability.\n\n \n\nI think this thread also shows that when there is community consensus it tends to correctly predict Caleb's results.\n\nEdited May 3, 2017 by RichardPlunkett"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2766695","commentId":2766695,"userName":"cmabr002","timestamp":1493844803,"content":"I have posed the following questions to Caleb and will report back once an answer is received (in the mean time, feel free to discuss):\n\n1.  What phase are the players in, if any, during the Escape test action window provided by Gollum's Forced effect in the Dead Marshes scenario?\n\n> Quote\n> \n> The players are in the very last step of the quest phase when they resolve “at the end of the quest phase” effects such as Gollun’s Escape test. So, any effects that last until “the end of the phase” will have expired, but if the encounter deck were to run out of cards, it would automatically be reset because the players are still in the quest phase.\n> Cheers,\n> Caleb\n\n \n2.  Assuming a player has an effect that is limited to \"once per phase\" would the player be allowed to trigger this ability during the action window provided by Gollum's Escape Test and then also trigger it during the Travel phase, potentially stacking the effects that would both subsequently expire at the end of the Travel phase?\n \n> Quote\n> \n> And in that review I found that it [the Escape Test from Gollum's Forced effect] takes place in a narrow window of the last step of the quest phase... It also means that any lasting effect triggered during the Escape test that expires at ‘the end of the phase’ will expire immediately after the Escape test resolves and the phase ends. \n\n3.  Also, does this ruling also apply to \"Until the end of the round effects\" and \"At the end of the round effects\"? In Battle of Carn Dum, for example, it is possible for Thaurdir to attack you as a result of flipping.  This flip is triggered by the Forced effect on the quest card that triggers \"At the end of the round\".   This attack provides the players with an opportunity to trigger actions during the attack steps.  So, if a player triggered an action that \"lasts until the end of the round\" during an attack made \"At the end of the round\" would it persist through the entire next round?  If so, my first question also applies here.  Could you stack multiple limited \"once per round\" \"until the end of the round\" effects?\n\n> Quote\n> \n> cmabr002: No formal answer was received but see answer to question 4.  While the end of the round and the end of a phase are different, it is possible the same ruling applies.\n\n \n4. Would Beorn (ally) shuffle back into your deck if you used his action during such an action window, since Beorn specifically says \"At the end of the phase in which you trigger this effect, shuffle Beorn back into your deck.\", I assume he would stay in play and wouldn't even shuffle back in at the end of the Travel phase (in the example with Gollum).\n \n> Quote\n> \n> The Escape Test and the action window it creates temporarily suspend the ‘end of the phase’ - they have to otherwise every other ‘end of phase’ effect would trigger in the middle of the Escape Test. Because of this, you can trigger effects such as Beorn’s if you wanted to, but once the test resolves and the ‘end of phase’ resumes, he would be shuffled back into your deck.\n\n5.  When you are resolving \"At the end of the round\" effects, are you considered to be in any phase?  If so, what phase?\n\n \n> Quote\n> \n> The ‘the beginning of the round’ and ‘the end of the round’ can be thought of as bookends to the entire round. The beginning of the round is the moment just before the resource phase begins, and the end of the round is the moment immediately after the refresh phase ends. They are not a part of any phase and there are no normal action windows or opportunities for players to take actions during those times.\n\n6a.  What happens if you trigger Beorn's ability during an action window provided by an attack \"At the end of the round\" or \"At the beginning of a round\" since neither is a \"phase\" and Beorn's ability specifically says \"At the end of the phase in which you trigger this effect...\"\n\n> Quote\n> \n> If you trigger Beorn’s ability during an action window triggered by an attack at the end / beginning of a round, Beorn would be shuffled into your deck at the end of the next phase (the resource phase).\n\n6b.  If Beorn stays in play, can you trigger his ability a second time in the Resource Phase of the round and have +16 attack from both triggers of his ability?\n\n> Quote\n> \n> Beorn’s ability is limit once per round, so you could not trigger at the beginning of the round and again during the resource phase. Although, if you triggered it at the end of the previous round, then you could trigger it again during the resource phase.\n\n6c.  What happens, for that matter, if you trigger any \"until the end of the phase\" or \"At the end of the phase\" effect during an action window provided by an \"end of the round\" or \"beginning of the round\" attack since you are not actually in a phase?\n\n> Quote\n> \n> The effect will last until the end of the next phase (the resource phase).\n\n7.  With respect to Full Sail Ahead and the Weather Turns Foul quest cards in Flight of the Stormcaller, what, if anything, prevents the players from being Forced to place progress on Full Sail Ahead at the end of the round, immediately advance, and then have to also place progress on the Weather Turns Foul? \n\n> Quote\n> \n> The Forced effect on The Weather Turns Foul will not trigger in this case because it was not in play when its timing trigger would have triggered. You should only resolve Forced effects that are in play and active at the time of their trigger.\n\n8a. You said that Eowyn's ability would end right before Gollum's Forced effect started if you had chosen to trigger it during the quest phase.  Is this still true?\n\n> Quote\n> \n> Yes. Effects that share a timer are still resolved Passive > Forced > When Revealed > Response.\n\n8b. If this is still true is it fair to say that if any \"at the end of phase\" or \"until the end of the phase\" effects are activated within that \"suspension timing\" you mentioned, that once the players resume play, they will start resolving all remaining effects (those that still needed to be resolved before the suspension and those that were started within it) in Passive  > Forced > Response order?\n\n> Quote\n> \n> Yes. Once the action window that interrupted the end of the phase is concluded, the end of phase continues to resolve in the same Passive > Forced order.\n\n9. What happens if an action window is provided by an end of phase effect (like in the example with Gollum's Forced Escape test) and during that \"suspension timing\" a new encounter card is revealed that happens to have an \"end of phase\" effect?  Will it also be immediately resolved once you continue play?\n\n> Quote\n> \n> Yes. If a ‘when revealed’ effect triggers an ‘until the end of the phase' effect during a limited action window such as an Escape Test, it’s effects will also end when the end of the phase resumes after the action window closes.\n\n \n10.  I asked Caleb about a potential inconsistency in rulings and asked him to explain why the two situations resolved differently.  The following answer was received:\n \n> Quote\n> I think the inconsistency that you are noticing comes from the difference between lasting effects vs Forced effects. A lasting effect constantly searches the game state for its end condition and switches off automatically when it occurs. So a lasting effect triggered during an odd action window such as an Escape test will switch off as soon as the end of the next phase is reached. \n> A Forced effect works differently because it has a very specific timing trigger and if the effect isn’t in play / active at that time then it will not trigger.\n\n11. Would Beorn ally's effect be considered a lasting effect AND a passive effect or just a passive effect (assume you trigger his action during the Eowyn / Gollum Escape Test example).  Specifically, the part that says \"At the end of the phase in which you trigger this effect...\" \n\n \n> Quote\n> \n> Beorn’s effect is a lasting effect. \n\n11a. To my knowledge, \"lasting effects\" are a subset of passive effects and are typically structured with the following wording: \"Until the end of the phase, X\".  Is this correct?\n\n> Quote\n> \n> Lasting effects are a subset of passive effects. They function the same except that lasting effects start and stop whereas most passive effects are always on.\n\n12. If you use Vilya to put Dwarven Sellsword into play during an attack made by Thaurdir flipping \"at the end of the round\" in the Battle of Carn Dum, I assume based on the Forced effect ruling you would not have to trigger the Forced effect on Dwarven Sellsword that round since it was not in play at the time its specified trigger was met.  Is this correct?\n\n> Quote\n> This is correct. The Dwarven Sellsword’s Forced effect will only trigger if it was in play when the ‘end of round’ happened.cleardot.gif [https://ssl.gstatic.com/ui/v1/icons/mail/images/cleardot.gif]\n\n \n\nEdited May 18, 2017 by cmabr002"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2766851","commentId":2766851,"userName":"Hitbaz","timestamp":1493849041,"content":"Nice job :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI'm waiting for the answers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2770707","commentId":2770707,"userName":"cmabr002","timestamp":1494007883,"content":"I have posted the answers to the questions I asked.  I also asked many more questions which I have added to the list (starting at question 6a)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2770803","commentId":2770803,"userName":"dalestephenson","timestamp":1494010964,"content":"> On 4/28/2017 at 4:54 PM, dalestephenson said:\n> \n> I suspect that'll be the answer, but I don't know how to justify it with \"ends immediately when its timer is reached\" and \"Passive effects in LotR LCG are always checking the game state to see if they trigger and resolve instantly when they do\".  Maybe there'll be an official ruling that the end-of-phase magically un-ends for the duration of Gollum's escape test or the Balrog's attack.\n\nHey, I'm psychic!  As of the last response, the end-of-phase magically un-ends for the duration of Gollum's escape test."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248142-the-dead-marshes-sneak-attack/?do=findComment&comment=2771123","commentId":2771123,"userName":"Hitbaz","timestamp":1494021218,"content":"Another question, guys.\n\nIf I use Sneak Attack to put Gandalf at the beginning of the quest phase, can he participate in the Escape Test forced by stage 2b? I think so because the Escape Test forced by stage 2b does not happen at the end of the phase, but immediately after the resolution of the quest. Right? But if I lose this final Escape Test, Gandalf comes back to my hand before the regular Escape Test forced by Gollum, because this Escape Test happens at the end of the phase. Right?\n\nEdited May 5, 2017 by Hitbaz"}]}