{"url":"https://community.fantasyflightgames.com/topic/248143-leadership-denethor-and-dol-guldur/","title":"Leadership Denethor and Dol Guldur","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/248143-leadership-denethor-and-dol-guldur/?do=findComment&comment=2752133","commentId":2752133,"userName":"Onidsen","timestamp":1493135351,"content":"Hello all,\n\nJust a quick question here. I'm trying Escape from Dol Guldur with Ld Denethor in the hero lineup, and I had a question about order of operations:\n\nDoes Denethor collect his 2 resources before the prisoner is determined? ( I think he does, but I wanted to make sure)\n\nFollow-up question:\n\nIf he does, and he is chosen as the prisoner, what happens to those resources?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248143-leadership-denethor-and-dol-guldur/?do=findComment&comment=2752197","commentId":2752197,"userName":"Watcher in the Water","timestamp":1493137038,"content":"I'm pretty sure that you can choose the order set up happens, for example, I always find a side quest off of thurindir before I do the quest set up. However, I'm not sure where the resources go. If you go by the way The Long Arm of Mordor worked, the resources would disappear, but I'm not completely sure if that is right since it is a different quest. Thematically though, the quests are extremely similar, so I would say the resources disappear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/248143-leadership-denethor-and-dol-guldur/?do=findComment&comment=2753613","commentId":2753613,"userName":"Onidsen","timestamp":1493184446,"content":"Thanks! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/248143-leadership-denethor-and-dol-guldur/?do=findComment&comment=2753923","commentId":2753923,"userName":"dalestephenson","timestamp":1493209921,"content":"> 19 hours ago, Watcher in the Water said:\n> \n> I'm pretty sure that you can choose the order set up happens, for example, I always find a side quest off of thurindir before I do the quest set up. However, I'm not sure where the resources go. If you go by the way The Long Arm of Mordor worked, the resources would disappear, but I'm not completely sure if that is right since it is a different quest. Thematically though, the quests are extremely similar, so I would say the resources disappear.\n\nI'd argue that the resources remain.  The resource pool is near the hero card, it had resources in it during setup, and nothing in stage 1b of Dol Goldur indicates that resources disappear.  The effects of being a prisoner are simply:\n\n\"The hero is now considered a \"prisoner\", cannot be used, cannot be damaged, and does not collect resources, until it is \"rescued\" (as instructed by card effects) later in this quest.\"\n\nSo the resources from LeDenethor -- or a starting resource if you're playing early mode -- should *not* disappear, but it will be unspendable until the hero is rescued.\n\nOf course, in \"The Long Arm of Mordor\" there's also no directive that resources *disappear*.  The 1A there states:\n\n\"For the remainder of the game, heroes in the staging area are in play but under no player’s control, immune to player card effects, and their text boxes are considered to be blank.\"  I don't see from that why a hero who already had resources in his resource pool (LeDenethor or easy mode) would have them actually disappear.  Has there been a ruling on this?  Obviously they wouldn't collect resources in the resource phase, since those are added only to a player's heroes."}]}