{"url":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/","title":"Burning Brand clarification","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/?do=findComment&comment=2763031","commentId":2763031,"userName":"Randyman","timestamp":1493680794,"content":"A Burning Brand text reads:  \"While attached character is defending, cancel any shadow effects on cards dealt to the attacking enemy\".\n\nSo I am not sure if it can be used to cancel a shadow effect dealt to an enemy attacking one of your other heroes?  Specifically, I'm playing Road to Rivendell and I've got BB attached to Elrohir.  I'm attacked by 3 enemies and Elrohir successfully defends against two of them (burned a resource for the 2nd defense) but then Glorfindel's attacker gets a Sleeping Sentry as a shadow effect.  I am hoping I can use the BB attached to Elrohir to cancel this nasty effect.... legal play?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/?do=findComment&comment=2763142","commentId":2763142,"userName":"CJMatos","timestamp":1493687463,"content":"No, your intention to use A Burning Brand to cancel the shadow effect against Glorfindel is not a legal play.\n\nA Burning Brand will only cancel the shadow effects of atackers that are defended by the hero who has it attached.\n\nEdited May 2, 2017 by CJMatos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/?do=findComment&comment=2763156","commentId":2763156,"userName":"Randyman","timestamp":1493688026,"content":"Ouch -- I cannot figure out a way to beat this quest without using a Spirit deck - even with Burning Brand in play, I have managed to go down to defeat 4 times in a row.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/?do=findComment&comment=2763196","commentId":2763196,"userName":"CJMatos","timestamp":1493691168,"content":"Yeah, Road to Rivendell has some nasty treachery cards.... Sleeping Sentry being the worst.\n\n \n\nYou definitely need some treachery cancelation, when revealed effects cancelation or much scrying effects that allow you to manipulate the encounter deck.\n\n \n\nDon't know if you are playing in order and only using cards up to that specific quest, but here are some cards that might help you scrying the encounter deck [http://hallofbeorn.com/LotR?Category=Encounter%20Scrying].\n\n \n\n \n\nCarlos José Matos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/248632-burning-brand-clarification/?do=findComment&comment=2763254","commentId":2763254,"userName":"Randyman","timestamp":1493694754,"content":"Yes -- I am trying to play them in order (also, I've been buying them in order so thats all I have!) -- I've been using H. Riversong and Rumour from the Earth but to make it all work, I still think you need a fair bit of luck to get thru this one.  Thanks for the advice -- now I'm looking forward to some of those cards from later releases!"}]}