{"url":"https://community.fantasyflightgames.com/topic/249305-is-laketown-meant-to-be-part-of-the-saga/","title":"Is Laketown meant to be part of the Saga?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/249305-is-laketown-meant-to-be-part-of-the-saga/?do=findComment&comment=2777745","commentId":2777745,"userName":"Fluke Starbucker","timestamp":1494353564,"content":"Likek the Old Forest and Barrow Downs is to LOTR... is Laketown meant to be played with The Hobbit Saga quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/249305-is-laketown-meant-to-be-part-of-the-saga/?do=findComment&comment=2777865","commentId":2777865,"userName":"TwiceBorn","timestamp":1494356952,"content":"No, there's nothing in the quest that links it to the Hobbit saga. But nothing stops you from doing so. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/249305-is-laketown-meant-to-be-part-of-the-saga/?do=findComment&comment=2778289","commentId":2778289,"userName":"Calvadur","timestamp":1494369644,"content":"Lake town can be played completely on it's own. However it covers a part of the hobbit's story (Smaug's Attack on lake town). Therefore the manual of \"On the doorstep\" mentions (or at least mine does :D), that you can play it after the second quest of the box (the lonely mountain iirc) and before you advance to the battle of the five armies.\n\nKeep in mind that it is a stand-alone scenario and you shouldn't use hero Bilbo for this quest (he is at the mountain, not in laketown). I am unsure if you are allowed to use any treasure cards you might have. It wouldn't make sense for me (and I don't use them for this quest) as no characters, who picked some up are present during smaug's attack, but the LOTR Campaign takes these kind of things really loose (as it is perfectly fine for your heroes to jump from Isengart to the dead marshes and back from cirith Ungol to the path of the dead :D) and it is a really challenging scenario, so you can defenitly use some advantages like teleporting heroes and weapon's;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/249305-is-laketown-meant-to-be-part-of-the-saga/?do=findComment&comment=2778322","commentId":2778322,"userName":"Fluke Starbucker","timestamp":1494371258,"content":"Cool!  Thanks guys!"}]}