{"url":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/","title":"Just to make sure Im playing this game right solo with one deck..","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/?do=findComment&comment=2784626","commentId":2784626,"userName":"BattleZone","timestamp":1494635128,"content":"I noticed that some cards like \"O'Lorien\" are worthless if you play one deck and not two. Mainly because due to the action window you would never get to use O Lorien on another player since you cant use it on yourself.\n\nYou can only play allies and attachments in that particular phase...THEN actions are done.  So as a single player I play my allies and attachments in that phase....then can play actions. Exhausting her does no good since I have already played my attachments (and thus cannot bring in a Sylvan Ally) and the phase is about to end. I could see where its good for 2 players but not one.\n\nI also noticed that RANGED characters are worthless as well (unless they have good abilities) since you cannot shoot any creatures that are engaged against someone else since....there is no one else but you and your deck\n\n \n\nEdited May 13, 2017 by BattleZone"},{"commentUrl":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/?do=findComment&comment=2784652","commentId":2784652,"userName":"PocketWraith","timestamp":1494636201,"content":"You are right about Ranged characters (though there are some player cards which specifically work with Ranged characters like Hands Upon the Bow), but wrong about things like O Lorien! If you look at the timing chart in the back of the rulebook in the Core Set, the section where you play allies and attachments during Planning is green, meaning that you are free to take actions at any time during that section. So you can exhaust O Lorien before playing a Silvan ally and benefit from the discount."},{"commentUrl":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/?do=findComment&comment=2784666","commentId":2784666,"userName":"BattleZone","timestamp":1494637018,"content":"How come they INDENT Player actions after that step to make it look like its the only time to play actions like that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/?do=findComment&comment=2784857","commentId":2784857,"userName":"GrandSpleen","timestamp":1494651553,"content":"Dunno, but the explanation of the color code in the manual is clear enough.  The indent doesn't have a meaning so don't let it fool you.\n\n \n\nShortly someone will be along with a link to a detailed timing chart.  I don't have the links because I don't use them personally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/249645-just-to-make-sure-im-playing-this-game-right-solo-with-one-deck/?do=findComment&comment=2787785","commentId":2787785,"userName":"dalestephenson","timestamp":1494870546,"content":"Page 30-31 says green is \"Any player can take actions generally, or between the game steps stated in the rules.\"  Resolving Attacks and Attacking Enemies have steps, but the Planning Stage does not have steps stated in the rules.  Therefore it falls under the \"Any player can take actions generally\" clause."}]}