{"url":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/","title":"Remaining Tolkien-created heroes we might see in the game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2803942","commentId":2803942,"userName":"Estel Edain","timestamp":1495642890,"content":"As we approach the end of the Lord of the Rings saga expansions, we've seen most of Tolkien's significant characters appear as player cards, and many of them as heroes. To avoid too many duplicate versions of characters, we've been seeing more FFG-created heroes: the Dreamchaser cycle was the first to have 3 FFG-created heroes, and there's a decent chance that we'll have three FFG-created heroes in the Haradrim cycle. Círdan is the only Tolkien-created hero in The Grey Havens + Dreamchaser cycle who hadn't appeared in the game before (although Galdor and Elfhelm hadn't appeared as heroes before), and I wouldn't be surprised if Hirgon is the only hero in The Sands of Harad + Haradrim cycle who's  a Tolkien-created character new to the game. I thought this might be a good time to take stock of the Tolkien-created characters who haven't yet appeared as heroes, but have a decent chance of doing so.\n\n \n\nHere's a list of characters who we haven't yet seen in the game and seem to me to have a decent chance of appearing as heroes (there are license problems for the Blue Wizards). I expect most of these characters to appear as either heroes or allies at some point:\n\nThranduil\n\nThorin Stonehelm\n\nBard son of Brand (could potentially appear with Thorin Stonehelm in a new saga expansion focused on the battles of Dale and Erebor, like the fan-created scenarios Matt Newman was designing before he joined FFG)\n\nGrimbeorn the Old\n\nHúrin the Tall\n\nBergil\n\nAngbor the Fearless\n\nSeveral other Outlands/Gondor possibilities; Duinhir or his sons Duilin and Derufin seem likeliest\n\nLeaflock (one of the three oldest Ents, although he's described by Treebeard as \"grown sleepy, almost tree-ish\")\n\nPaladin, Thain of the Shire\n\nFarmer Cotton\n\nRosie Cotton\n\n \n\nHere's a list of characters who have appeared only as allies, but I expect have a decent chance of appearing as heroes:\n\nQuickbeam (perhaps in The Crossings of Poros)\n\nSkinbark (seems likelier than Beechbone, as one of the three oldest Ents)\n\nSaruman\n\nRadagast\n\nGwaihir (likely in Mountain of Fire)\n\nGildor Inglorion\n\nRumil\n\nOrophin\n\nBofur (less likely, since two ally versions)\n\nAnborn (less likely, since two ally versions)\n\nForlong (probably without the Outlands trait)\n\nDéorwine (stands out among the many Rohan allies as chief of Theoden's knights)\n\nGamling (also stands out for his commanding role at Helm's Deep)\n\nGrimbold (also stands out; he was key in defending the Fords of Isen after Théodred fell, and led one of the first three companies in the battle of Pelennor Fields)\n\nGhân-buri-Ghân\n\nFarmer Maggot\n\n \n\nThere are also characters who have appeared as heroes, but I think there's a good chance of getting another hero version of that character (these seem the most likely, but many others are possible):\n\nAragorn (so many people have requested Spirit Aragorn, and it would fit for Aragorn to be the one hero with versions in all four spheres)\n\nFrodo Baggins\n\nSam Gamgee\n\nÉomer (mentioned in the announcement article for Mountain of Fire; very likely to be a hero there)\n\n \n\nDid I miss any likely hero candidates? Which Tolkien-created heroes are you most interested in seeing? Which heroes would you like to see appear in another sphere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804019","commentId":2804019,"userName":"dalestephenson","timestamp":1495644480,"content":"Widfara is one of the few Rohirrim with actual dialogue and no appearance in the game yet.  As to him \"the air brings messages\", Lore/scout would be appropriate.  There are some other  Rohirrim with no lines, but mentioned in the Mounds of Mundburg song:\n\nHarding, Herefara, Herubrand, Horn, Fastred\n\nLobelia Sackville-Baggins is the most prominent hobbit with no appearance in the game.  Hey, Grima has a hero card, why not Lobelia?\n\nThe Thain, the Master of Buckland, and the Mayor are all prominent hobbits without representation, only Paladin is mentioned above of the three."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804540","commentId":2804540,"userName":"Rajam","timestamp":1495656099,"content":"Smeagol hero"},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804556","commentId":2804556,"userName":"Authraw","timestamp":1495656460,"content":"I very much want another Sam hero, and another Frodo would be great as well. The completionist in me wants a Bofur hero. Grimbeorn is a great idea, I had forgotten about him. \n\nI understand why they're divisive, but I'd like to see Tom Bombadil and Goldberry as player cards at some point too.\n\nGaffer Gamgee would be a good fit, maybe better as an ally, though. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804592","commentId":2804592,"userName":"pmdoug","timestamp":1495657835,"content":"Bilbo Baggins deserves another hero version. Lore Bilbo is certainly playable, but he was released such a long time ago and his high threat cost runs counter to the hobbit archetype. A Leadership or Spirit Bilbo would be great. \n\nI agree that Sam and Frodo should get new hero versions, preferably Leadership/Lore for Frodo and Tactics/Spirit for Sam. \n\nI'd actually prefer to get Tactics Glorfindel before Spirit Aragorn. I know Glorfy is an odd choice since he already has three iterations, but I can't stand his Spirit hero version. I'd love to have a Tactics Noldor outside of the twins. \n\nI wonder if our eagle hero might be Meneldor rather than Gwaihir. We already have a Gwaihir ally, so maybe they'll avoid that card conflict. \n\nGuthlaf or Gleowine could be added to the long list of possible Rohan heroes.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804762","commentId":2804762,"userName":"Edheliad","timestamp":1495663495,"content":"I'd rather see a Tauriel than another FFG created character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2804818","commentId":2804818,"userName":"Gizlivadi","timestamp":1495666528,"content":"Saruman hero. Nuff' said."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2805145","commentId":2805145,"userName":"Estel Edain","timestamp":1495693719,"content":"I think we have a good chance of getting Widfara and Lobelia Sackville-Baggins player cards, but they might only be allies. A Rohan Lore Scout would be interesting; so far Gléowine and Gríma are the only Lore Rohan cards. I could see them making Lobelia a hero, partly to include a female hobbit hero (although Rosie's another possibility).\n\n> 12 hours ago, dalestephenson said:\n> \n> The Thain, the Master of Buckland, and the Mayor are all prominent hobbits without representation, only Paladin is mentioned above of the three.\n\nPaladin Took was involved in the Scouring of the Shire; he led a group of hobbits to fight ruffians further south during the battle of Bywater. Will Whitfoot bravely protested the changes Lotho was making, and was the first hobbit to be locked up in Michel Delving. With the nickname of \"Flourdumpling,\" Will did not lead hobbits in combat; he might be a better fit as an ally. Saradoc Brandybuck, Master of Buckland, is a less developed character; it's also not clear how much Buckland (which was further from the ruffian's base of operations) resisted against the ruffians, while we know that Tookland resisted. I don't expect to get many hobbit heroes from an older generation. Paladin seems likeliest of those holding official roles, since he was active in story events , and Farmer Cotton plays an important role in the battle of Bywater. We might also get a Thain, Mayor, or Master of Buckland attachment (like Steward of Gondor or Lord of Morthond).\n\nAnother hero version of Bilbo would certainly be welcome. I wonder how many characters will end up with 3+ hero versions. I could imagine getting a Leadership Merry hero with the Rohan trait and a Tactics Pippin hero with the Gondor trait, who would fit for a Scouring of the Shire scenario (together with a cheap hobbit archer ally). I could also  imagine the designers deciding to have Aragorn be the only character with more than two hero versions (not counting Baggins/Fellowship versions).\n\n> 9 hours ago, pmdoug said:\n> \n> I wonder if our eagle hero might be Meneldor rather than Gwaihir. We already have a Gwaihir ally, so maybe they'll avoid that card conflict. \n\nIt's possible, but if we get an eagle hero in The Mountain of Fire, then there's a good chance that we'll also get an eagle ally (since saga heroes typically share a racial trait with an ally that shares their sphere). That would work with a Gwaihir hero and Meneldor ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2805409","commentId":2805409,"userName":"dalestephenson","timestamp":1495714176,"content":"If the creators consider the quests as happening \"between Hobbit and LOTR\" instead of just immediately prior to LOTR, there's a number of humans that would be good choices for heroes (Battle of Five Armies is 2941, LOTR starts 3017):\n\nBain, king of Dale (son of Bard, d. 3007)\n\nEcthelion II, Steward of Gondor (father of Denethor, patron of Thorongil, d. 2984)\n\nGilraen the Fair (mother of Aragorn, d. 3007)\n\nEomund, father of Eomer and Eowyn, d. 3002)\n\nThengel, King of Rohan (father of Theoden, d. 2980)\n\nHildifons Took (went on journey and never returned, b. 2844)\n\nHowever, the only heroes we currently have that were not alive in 3017 are the Hobbit-saga heroes, so I don't expect to see any of these.  Dis, mother of Kili and Fili, was still alive in 3017 and is the only named female dwarf in existence, but since their women \"seldom walk abroad except at great need\" I'm not sure she'd be tapped for a hero.\n\nI would very much like to see another saga dealing with the beginning of the third age, featuring Elendil, Gil-Galad, Isiludur and Anarion heroes.  Though a quest featuring combat with Sauron himself -- wearing the ring -- would be difficult to balance with the existing card pool, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2805516","commentId":2805516,"userName":"987654321","timestamp":1495719733,"content":"They can do what they want as long as I get my Barliman Butterbur hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2805621","commentId":2805621,"userName":"Edheliad","timestamp":1495722553,"content":"Spirit Barliman hero, Nob (recover ally from discard pile) & Bob (search top 5 cards for Mount) allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/250589-remaining-tolkien-created-heroes-we-might-see-in-the-game/?do=findComment&comment=2808711","commentId":2808711,"userName":"DurinVoronwe","timestamp":1495869246,"content":"I want Saruman!\n\nTo name a few other potential allies;\n\nTargon (a soldier in Beregond's company)\n\nGolasgil (one of the outlands captins)\n\nThe other hobbits in the \"Cotton\" family\n\nGalion (from the Hobbit, but should be alive, since he is an elf)"}]}