{"url":"https://community.fantasyflightgames.com/topic/252220-coming-back/","title":"coming back","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2837479","commentId":2837479,"userName":"SauronTheGreat","timestamp":1497547082,"content":"hey yall, so basically i got into the game bout 4ish years ago and really enjoyed it!  unfortunately, i kinda got burned out a bit and got tired of spending all my money on cards, especially since i started about a year and a half after the game did.  anyway, im thinking about getting back into the game but really dont know where to start.  like i say the last pack i bought was one of the ring makers sets.  I don't know what to buy if i buy anything, and it also doesn't help that since apparently this game became popular while i was gone, everything cost about 50% more than when i left.  anyway, what packs are good, worth buying or have good player cards.  I have sets most of the way through ring makers cycle as well as saga through black riders pack.  Thanks fam, missed you a lot!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2837503","commentId":2837503,"userName":"Kakita Shiro","timestamp":1497548352,"content":"Definitely Dread Realm. Hero Arwen, Elven Light, and Tale of Tinuviel. Should probably get Lost Realm to go along with that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2837505","commentId":2837505,"userName":"John Constantine","timestamp":1497548435,"content":"Voice from the past\n\nJoining yours and mine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2837634","commentId":2837634,"userName":"dalestephenson","timestamp":1497553221,"content":"Echo Dread Realm for player cards.  Some other packs with multiple cards I really like:\n\nWastes of Eriador (Angmar) has hero Merry and Honour Guard.\n\nFlight of the Stormcaller (Dreamchaser) has hero LeDenethor, plus Heed the Dream and Glorfindel ally\n\nTemple of the Decieved (Dreamchaser) has hero Elfhelm, plus Rhovanian Outrider and Armored Destrier\n\nDrowned Ruins (Dreamchaser) has Marksman of Lorien, Dunedain Remedy and Dwarven Sellsword\n\nBeneath the Sands (Haradrim) has Hirgon and Red Arrow.\n\nThe Road Darkens has hero Gandalf and his toys, plus allies Galadriel and Elrond\n\nTreason of Saruman has Spirit Theoden and Treebeard heroes, plus Legolas, Gimli, and Quickbeam allies\n\nLand of Shadow has Damrod hero, Gamling, Snowmane, Staff of Lebethron\n\nFlame of the West has spirit Beregond and tactics Eowyn, plus Prince Imrahil ally, Roheryn, and Ghan-buri-Ghan.\n\nNo matter what kind of deck you want to build, there's cards from the last couple cycles and the saga that would go well in them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2837755","commentId":2837755,"userName":"Bullroarer Took","timestamp":1497556495,"content":"Agree.  Start back up with Dread Realm and that cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2838404","commentId":2838404,"userName":"Rouxxor","timestamp":1497610364,"content":"dalestephenson start to describe all that packs contain. I'm too lazy to do that so I prefer to ask you: what is a good card to you? What scenario do you like? Without knowing it will be hard to tell you what is a good pack for you, we only can tell you what we personally like ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2840499","commentId":2840499,"userName":"tyrion003","timestamp":1497712067,"content":"From my point of view, the Lost Realm was the most boring cycle, most the the quests were too ordinary, without anything special, so I really won´t recommend this one. For me this is the only cycle, that could be skipped. Grey Havens and Ringmaker were the best cycles. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2840851","commentId":2840851,"userName":"SauronTheGreat","timestamp":1497730656,"content":"> On 6/15/2017 at 1:40 PM, John Constantine said:\n> \n> Voice from the past\n> \n> Joining yours and mine\n\ndude yeah you are one of the names i remember from when i used to be active on this site.  i actually really loved this community as well as this game.  really just needed a break.  the game play was getting old and i had overplayed many of the quests.  but its good to be back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252220-coming-back/?do=findComment&comment=2840857","commentId":2840857,"userName":"SauronTheGreat","timestamp":1497730801,"content":"> On 6/16/2017 at 6:52 AM, Rouxxor said:\n> \n> dalestephenson start to describe all that packs contain. I'm too lazy to do that so I prefer to ask you: what is a good card to you? What scenario do you like? Without knowing it will be hard to tell you what is a good pack for you, we only can tell you what we personally like ;).\n\ntbh I really like good quests better than good cards.  that doesn't mean i dont like player cards though.  I enjoy overpowered combos as well as creative deck ideas.  Strong player cards and a lot of combat is what it comes down to.  leadership is my favorite sphere followed by probably tactics."}]}