{"url":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/","title":"Disappointed by Over Hill and Under Hill","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838350","commentId":2838350,"userName":"Chimpy","timestamp":1497602350,"content":"While I am waiting for the Dwarrowdelf reprint to arrive in stores, I thought I'd give the saga expansions a whirl, so picked up OHaUH to scratch my itch. I have 2 cores and all the Shadows of Mirkwood packs so I have a reasonably small card pool. I play solo and prefer to play single handed. With this in mind I expectantly made up a solo dwarf deck (Dain, Nori, Oin), but after finally completing all the scenarios, I have to say I didn't really enjoy them. The first scenario, We Must Away Ere Break of Day is horrendous for a solo player, as it doesn't scale at all. I managed it on easy mode. The last one, Dungeons Deep and Caverns Dim, forced me to ditch a thematic deck (which the expansion encouraged!) to make up a bizarre hodgepodge spirit deck just to do the riddles. Very frustrating. Again I did it on easy mode just to complete the darned thing.\n\nOn the plus side, there are some good dwarf cards in the set, and the 2nd scenario was quite enjoyable.\n\nDo the later saga expansions improve?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838388","commentId":2838388,"userName":"Calvadur","timestamp":1497608341,"content":"I feel you. Ohauh might be might least favourite box ever. While the first quest is only relevant for getting the treasures, which can be a total pain just by luck of the draw, the Second quest might be the best in the box as it just features annoying cards (discard attachments, surging deal damage), without annoying mechanics. The last quest is complete agony. It enforces a specific kind of deck and you could still loose if you don't run something like \"everything costs 1\"-deck. This quest singlehandedly surpresses any intend of me playing the hobbit saga in order ever again.\n\nBut to come to your question: As I said this box for me is the worst. They got better with on the doorstep, but there are still some unique mechanics. The first quest is only half the fun when playing solo. The second is similiar to the first ohauh quest in that it's just about getting as many treasures as possible, while you only really care about one or two (or at least we did). You could throw in battle of lake-town here if you have it (it's a Print on demand quest and VERY challenging). THe last quest feature multiple staging areas and is among the harder quests of the game. All in all I would say \"true\" solo players don't get the max from on the doorstep. The player cards aren't that strong when compared to ohauh, either (or at least much more niche in their applications).\n\nHowever things get much better in the lotr-sagas as they feature very good and memorable quests (a knife in the dark, Moria, breaking of the fellowship, Helm's Deep, Battle of the pellenor just to count my absolute highlights of the so far released ones), pretty much always great player cards (black riders pretty much singlehandely enables the \"hobbit-deck\", next one comes with Gandalf etc.).\n\nSumming up: Maybe check out one or two videos about on the doorstep to see if it fits your style. Otherwise 100% recommend The black riders.\n\nFor more information/a second opinion check out: https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/#Saga [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/#Saga] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838412","commentId":2838412,"userName":"Rouxxor","timestamp":1497611035,"content":"@Chimpy [https://community.fantasyflightgames.com/profile/210391-chimpy/] I agree with Calvadur as OHaUH is the worst deluxe I play. I really like the second quest but the two others are annoying. The first one is similar to carrock, play all your deck and decrease your threat before go to stage 2 and you will win by killing the troll one after the other. The third is a pain but there is cheat too (like make stats, use Gandalf or imladris stargazer). The next deluxe have also a terrible scenario (lonely mountain), better than the riddle (who is may be the worse scenario ever) but worse than the troll because it needed the same cheat that the riddle for burglar test. The first one is okay. And battle of the five armies is kind of the best scenario ever for me. He is very harsh tough so you may not like it.\n\nI just find that deluxe + cycle are better than saga box as they describe a whole new story and because in average the scenario are better. My advice would be to complete the hobbit saga but to play all the cycle before to start the lotr saga."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838423","commentId":2838423,"userName":"soullos","timestamp":1497611741,"content":"That first quest soured me on the game for a long time. Didn't play again until Easy mode rules were released (in the following year I believe). I took another crack at it and after much frustration, I finally completed it (I play solo). Stupid trolls... Doubt I'll ever play that quest again. The 2nd quest was alright but forgettable. And the Riddle one was very annoying too. Good news is, the Sagas don't get any worse than this. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838437","commentId":2838437,"userName":"dalestephenson","timestamp":1497613018,"content":"I'll echo the annoyance factor from the riddle quest (I don't think I've beaten that without remaking my deck to be easier to guess).  It's a clever mechanic, but I found it too hard to keep Bilbo alive if the riddles were tough, while the quest was extremely easy if the deck is modified to be easy to guess.\n\nThe annoyance factor from the troll quest for me doesn't come from actually defeating the trolls (I think it's akin to Conflict at the Carrock, where setup is key), but the fact that if you can handle the trolls, it's too easy to \"win\" without getting the treasures -- and you *really* want the treasures for subsequent quests.\n\nI like the Smaug quest in the second hobbit box better, even though it also has a treasure-hunt aspect to it, for two reasons:\n\n1) Getting the treasures isn't as important as it is with the troll quest.  I think the troll treasures are better and you can use them in five subsequent scenarios, and not one.\n\n2) Smaug is a tough enough cookie that I'm content to win the quest without getting all of the treasures!\n\nBattle of Five Armies is tough, but I think it's my favorite quest in the entire Hobbit box.  The spider quest can be annoying, but it's annoying in a game-hates-me kind of way common to many quests, rather than the \"remake your deck or lose\" annoyance of the third quest, or the \"win in the wrong way and you lose\" annoyance of the first quest.\n\nI don't think any of the LOTR saga quests are mechanically annoying in a similar way, though it's chock-full of annoying quests in the game-hates-me kind of way.  The boons and burdens acquisition is more automatic than luck-based; however the penalty for having a fallen hero makes it so you can \"win the wrong way and you lose\" if a hero dies -- but that's more thematic and punishes you for struggling rather than for winning too quickly.\n\nThere's also no quest (so far) that mandates a specific type of deck, though hero Erestor is unusable in one of the quests (you lose if you have no cards in hand), and Thalin is completely nerfed in another (all enemies are immune to his ping)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838444","commentId":2838444,"userName":"Calvadur","timestamp":1497613818,"content":"You could always kill off Erestor before the last stage and revive him during the last round ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838636","commentId":2838636,"userName":"Chimpy","timestamp":1497623238,"content":"> 3 hours ago, soullos said:\n> \n> That first quest soured me on the game for a long time.\n\nYeah same here - luckily I've had a lot of fun with the game in the past so I know it can be lot better. I feel sorry for any players new to the game coming at it, though.\n\nEdited June 16, 2017 by Chimpy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2838949","commentId":2838949,"userName":"Gizlivadi","timestamp":1497631028,"content":"Yeah, the Hobbit sagas are IMO pretty bad in general. The only quest I like from is the Battle of Five Armies, which, while hard, actually lets you make decisions as opposed to depend on drawing the Key, or not drawing a shadow card with a burgle effect, or changing your whole deck to win the riddles. I don't think I've replayed anything except for BOTFA  since I got them. Now that I think of it, I dont think I've even touched my OHAUH cards for years. The only reason I got that box was the player cards and my completionist OCD."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2839002","commentId":2839002,"userName":"Bullroarer Took","timestamp":1497632964,"content":"Just popping in to remind people that the game was pretty young then and the designers were still experimenting with what worked and what didn't.\n\nSome great player cards in the boxes though especially if you like dwarves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2839052","commentId":2839052,"userName":"TwiceBorn","timestamp":1497634147,"content":"I'm clearly in the minority. I don't remember having nearly as awful a time playing the Hobbit Saga as most of you, and I have always played the quests exclusively with dwarf heroes (the recommended \"thematic decks\" weren't very good, as I recall). In fact, I remember getting way more pissed off at many of the quests from Heirs of Numenor/Against the Shadow (Peril in Pelargir, Into Ithilien and The Morgul Vale in particular) than at any of the Hobbit quests, but having access to all the cards from Khazad-Dum/Dwarrowdelf (which the OP didn't) may have made The Hobbit saga a little more enjoyable. \n\nI actually really like both The Lonely Mountain and The Battle of Five Armies, they're both among my favourites (though I did find the latter to be quite hard at the time). I have never killed Smaug in The Lonely Mountain, but have always run off with all five treasures in hand to a nail biting \"run for your life\" finale. \n\nAnd for me, The Battle of Lake-Town is another favourite.\n\nDifferent strokes and all that...\n\nEdited June 16, 2017 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2839136","commentId":2839136,"userName":"dalestephenson","timestamp":1497636254,"content":"Morgul Vale and the stupid \"The Master's Malice\" also seriously annoyed me.  I see The Master's Malice as akin to the riddle mechanism -- it is harmless against certain deck builds, but can be devastating to the deck you brought.\n\nSleeping Sentry, especially in shadow form, also really annoys me, and I see that as comparable to the treasure collection in the first hobbit quest -- success or failure has more to do with where a few key cards happen to be in the deck, not your decisions.\n\nWith that said, I've played six different decks (some one-handed, some dual) against each of the Hobbit quests and don't plan on skipping them in the future.  While I think the treasure and riddle mechanisms are flawed and annoying, I enjoy the story of the Hobbit and the riddle quest I think *thematically* is quite good; I've just never ran against it with a deck where the guessing is balanced, so out of frustration I resort to the all-2-cost-allies deck and steamroll it.\n\nIIRC, Battle of Five Armies did quite well in the quest tournament a while back."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2839699","commentId":2839699,"userName":"Yepesnopes","timestamp":1497653655,"content":"I played the whole Hobbit saga with my girlfriend with two Dwarf decks (Oin, Thorin, Dain and Gimli, Dori, Nori) and we absolutely loved it! I remember it was a blast when we recovered the Arkhenstone on the fifth quest :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited June 16, 2017 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2840493","commentId":2840493,"userName":"tyrion003","timestamp":1497711864,"content":"I don´t think that Hobbits have the worst scenarios. I liked riddles (funny and thematic and mainly because it needed to build brand new decks for this one) and first quest against troll wasn´t bad, too. The second quest was weak, nothing special. What annoys me, personally, is the art on most of encounter cards - that is the thing that is most terrible on this expansion - the trolls, goblins, almost everything..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2863156","commentId":2863156,"userName":"rajatz","timestamp":1499007060,"content":"Ok, I read this post twice and took some notes on how to defeat this saga. Actually, I own only the first box (Ohauh) and i'm facing the first adventure yet. I'm two handed solo player and atm i'm using this fellowship I build based on my cardpool http://ringsdb.com/fellowship/view/2736/fellowship-songs [http://ringsdb.com/fellowship/view/2736/fellowship-songs]\n\nI'm on my third try on this adventure playing on normal mode. I'm following the plan of setup on the 1b quest and then deal with Trolls on 2b. My problem is the 3b quest. I got 4 heroes sacked and couldn't get rid of those sacks before my treat reaches 50. I'm starting to think about play it on easy mode but I'd like to hear some tips before and maybe try it again on normal mode to see what I could do. \n\n \n\nEdited July 2, 2017 by rajatz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2863312","commentId":2863312,"userName":"Rouxxor","timestamp":1499017503,"content":"Your problem cannot be the quest 3b, since it is only write than you won the game. Problem is probably to win on 2b. Why do you have to get rid of the sack? With enough allies you are supposed to be able to defeat the troll and then go straight to 3b and win.\n\nBut I see why you have threat problem: you play too few way to reduce your threat. With your building options I rather play Lore / Energy with Nori and Leadership / Tactics with sneak attack and 3xgandalf of the core set + 3x sneak attack (or 2 if you have only one core set and don't want to make proxy). Gandalf II is overkill in your deck. It allow you not only to survive at threat but also to engage one after the other the troll at the 2b stage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2863407","commentId":2863407,"userName":"rajatz","timestamp":1499024888,"content":"> 1 hour ago, Rouxxor said:\n> \n> Your problem cannot be the quest 3b, since it is only write than you won the game. Problem is probably to win on 2b. Why do you have to get rid of the sack? With enough allies you are supposed to be able to defeat the troll and then go straight to 3b and win.\n> \n> But I see why you have threat problem: you play too few way to reduce your threat. With your building options I rather play Lore / Energy with Nori and Leadership / Tactics with sneak attack and 3xgandalf of the core set + 3x sneak attack (or 2 if you have only one core set and don't want to make proxy). Gandalf II is overkill in your deck. It allow you not only to survive at threat but also to engage one after the other the troll at the 2b stage.\n\nDude u can't believe. I did read the card again and I yes I won hahaha. I just read it wrong at the first time. I understood that was needed to get rid of the sacks but in fact the mission card do that when revelead.\n\nI'll look my decks again and i'll probably make some adjustments based on your suggetions. I have only one core set yet but i'm providing one more soon. \n\nNow that I just discovered that actually I won this adventure, I'm felling more excited to play the next one hahah. \n\nI'm laughing here bymyself because of that misunderstanding"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2863605","commentId":2863605,"userName":"Rouxxor","timestamp":1499041535,"content":"You are welcome :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865231","commentId":2865231,"userName":"Chimpy","timestamp":1499147664,"content":"I did the quests in At The Doorstep over the weekend. I thought they were just as bad as OHaUH. The Lonely Mountain quest seems especially broken, with the burgle mechanic needing a contrived deck made up for it, and when Smaug attacks, a string of multiple burgle shadow cards can wipe an attempt.\n\nI think one of my largest complaints with these sets is that they scale very poorly for solo play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865254","commentId":2865254,"userName":"TwiceBorn","timestamp":1499149818,"content":"Chimpy, there is a card released during the Shadows of Mirkwood cycle that can neutralize Smaug's machine gun attacks by discarding one of his shadow cards (play it before flipping over the first shadow card dealt to him during an attack).\n\nJust in case you overlooked it.\n\n \n\nDawn Take You All \n\n \n\n \n\nEdited July 4, 2017 by TwiceBornh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865441","commentId":2865441,"userName":"Chimpy","timestamp":1499165887,"content":"Ah I wasn't aware of that card - I do have it in my collection. I managed that particular quest without it after going 2-handed, a lot of tries and some luck. I think my criticisms still stand, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865471","commentId":2865471,"userName":"rajatz","timestamp":1499168427,"content":"I think this isn't the right topic but would be pretty nice to have one with a list of favorite solo adventures to play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865478","commentId":2865478,"userName":"Chimpy","timestamp":1499168733,"content":"I think the later cycles are much better for solo play from my understanding - I don't have them yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2865776","commentId":2865776,"userName":"Rouxxor","timestamp":1499189544,"content":"> 8 minutes ago, rajatz said:\n> \n> I think this isn't the right topic but would be pretty nice to have one with a list of favorite solo adventures to play\n\nIt will depend of what you expect from a adventure ;). I have a list of my favorite, who are also the hardest ^^. I can post it here but it is in french, my favorite is the last one, my second favorite is the one before, ect...\n\n\nFondations de pierre cauchemar\nUn voyage dans l'obscurité cauchemar\nCourse en Harad\nLa traversée des landes d'Etten cauchemar\nTempête sur les havres de cobas\nLes collines venteuses cauchemar\nUn voyage dans l'obscurité cauchemar\nFuite vers le gué cauchemar\nAu-dela des montagnes froides et embrumées cauchemar\nLe Secret de Celebrimbor cauchemar\nLa Couronne d'Andouillers cauchemar\nLes craintes de l'intendant cauchemar\nLe Sang du Gondor cauchemar\nLes désolations d'eriador cauchemar\nBagarre à pélargir cauchemar\nLa bataille de Carn Dum\nÉvasion de Dol Guldur\nLes Trois Épreuves cauchemar\nL'ombre et la flamme cauchemar\nLa chaussée des morts cauchemar\nBataille de Carn Dun cauchemar\nLe gouffre de Helm cauchemar\nLes ruines de Belegost\nLes Nîn-in-Eilph cauchemar\nPiégé au Pays de Dun ! cauchemar\nLa Bataillle des Champs du Pelennor\nEn Ithilien cauchemar\nDéfense de Cair Andros cauchemar\nRetour à la forêt noire cauchemar\nRencontre à Amon Dun cauchemar\nBataille des cinq armées cauchemar\nÉvasion de Dol Guldur cauchemar (le plus compliqué du jeu)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252260-disappointed-by-over-hill-and-under-hill/?do=findComment&comment=2866266","commentId":2866266,"userName":"Khamul The Easterling","timestamp":1499219512,"content":"Its incredible how much improved the Lotr Saga quests are from The Hobbit saga quests.  "}]}