{"url":"https://community.fantasyflightgames.com/topic/252921-gen-con-whats-going-to-be-available/","title":"Gen-con - what&#039;s going to be available?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/252921-gen-con-whats-going-to-be-available/?do=findComment&comment=2853830","commentId":2853830,"userName":"Slothgodfather","timestamp":1498488057,"content":"Do we know if there will be any early access stuff at Gen-con this year?   I know there is another epic-POD event happening correct?\n\nEdited June 26, 2017 by Slothgodfather"},{"commentUrl":"https://community.fantasyflightgames.com/topic/252921-gen-con-whats-going-to-be-available/?do=findComment&comment=2854215","commentId":2854215,"userName":"Estel Edain","timestamp":1498501898,"content":"Since 2012 there's always been an adventure pack or a saga expansion available early at GenCon. Last year Flame of the West was released shortly before GenCon, but The Drowned Ruins was available early at GenCon.  In 2015 The Land of Shadow was available early at GenCon, and Escape from Mount Gram was released shortly before GenCon. In 2014 The Road Darkens had been intended to be available early at GenCon (the CEO of FFG incorrectly said it was available during his In Flight report), but at least Trouble in Tharbad was available early. In 2013 The Black Riders was available early at GenCon (Assault on Osgiliath had recently been released),  and at GenCon 2012 The Hobbit: Over Hill and Under Hill was available early (Shadow and Flame had been released recently). GenCon 2011 was the first GenCon since the game was released, and there was no pack available early (although Conflict at the Carrock had been released recently).\n\nI think as the conclusion of the campaign (and especially since two of its quests can played in epic multi-player mode together), The Mountain of Fire has a good chance of being available at GenCon, either in pre-release or as a recently released expansion. The Black Serpent is probably going to be available later this week. Depending on the release schedule, we might see The Dungeons of Cirith Gurat released in late July and The Crossings of Poros available early at GenCon, The Dungeons of Cirith Gurat released shortly before GenCon, or even (if there are delays) The Dungeons of Cirith Gurat available early at GenCon. I think the likeliest scenario (considering the relatively slow release schedule recently) is to have The Dungeons of Cirith Gurat be released shortly before GenCon, and have The Mountain of Fire available early at GenCon.\n\nThe GenCon PoD quest this year is Attack on Dol Guldur. Its description is:\n\n> Quote\n> \n>  Rally your heroes for an epic battle against the forces of Sauron! Attack on Dol Guldur, is a unique, epic 12 player scenario!\n\nPresumably it will be like the Siege of Annuminas, and can be played in standard mode with one team of 1-4 players, or in Epic Multiplayer Mode, with three teams of 1-4 players."}]}