{"url":"https://community.fantasyflightgames.com/topic/253465-custom-mission-mapping-out-a-forgotten-island/","title":"Custom Mission: Mapping Out a Forgotten Island","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/253465-custom-mission-mapping-out-a-forgotten-island/?do=findComment&comment=2865637","commentId":2865637,"userName":"Flrbb","timestamp":1499180853,"content":"Mapping Out a Forgotten Island\n\nMy play group does like the new effects/rules from the Dreamchaser's sailing and those double sided locations, too. Sadly these missions are limited to one cycle. So I decided to create such a mission on my own. Now I want to share a version 1.0 with you guys. My play group had lots of fun so far, I hope you will have fun, too. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  This Version was mainly tested with two players, I am yet not sure how well it scales with the number of players.\n\n \n\nCards Needed\n\nThis scenario uses none of the official encounter sets, all cards have to be printed first. The provided downloads contain a file for the double sided quest cards, a file for some double sided locations (each of those locations does have the \"Forgotten Island\" back side) and a set of the normal encounter cards. Also, you'll need two other encounter set decks: Raven and Spiral. I just namend them after the symbol on the cards. Ain't I great? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\n \n\nStory & Game Play\n\nDuring this mission you land on a island and you will try to explore it. You will be hindered by some nasty undead. I am not that much familliar with the whole Tolkien-Universe, so pardon me if the narrative is not so much perfect.\n\nAs you may have noticed in my sneak peak of an earlier version (https://community.fantasyflightgames.com/topic/252842-custom-mission-pofessional-printing-beta-testing/ [https://community.fantasyflightgames.com/topic/252842-custom-mission-pofessional-printing-beta-testing/]) you are playing some sort of \"Memory\" (at least in Germany it is called this way) with 6 pairs, which should not be that difficult on its own. But it gets harder because you have to have a focus on the enemys, too.\n\n \n\nDifficulty\n\nThis mission needs some time to play. Basically you do have a \"round 1\" to make a bit of a set up, then you'll have ti find the 6 pairs, which will take at least 6 more rounds. Then - with a perfect play - you'd need 2 to 4 rounds to finish the end boss. To sum up, this makes at least 9 to 11 rounds to play. As all of our decks contain some sort of threat reduction (e.g. Gandalf ally) we never lost due to high threat, but sometimes it gets close.\n\nAnyhow, I am absolutly unsure how to rate the difficulty of this scenario. While testing, I raised the threat of the cards until we almost lost the fight against the end game boss. Probably some of you will have better decks than we are used to play with - I hope it will not be too much of a walk in the park for you. In case the game is to difficult for you; just play easy mode (yes, some cards do have the golden circle - not tested, just estimated). In that case you are allowed to take notes on the positions of the locactions ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n \n\nLicensing and Stuff\n\nAs I am not a artist, I took all the images from the internet/google. In the left lower corner of the cards you'll find some sort of short name to the source of the images. I tried to be as serious as possible on this copyright-thingy. Please don't blame me.\n\n \n\nFiles\n\nFinaly, here are the files you need to print. Have fun, good luck!\n\nCardDeck_Memory_DoubleSidedLocations.pdf [https://www.file-upload.net/download-12588151/CardDeck_Memory_DoubleSidedLocations.pdf.html]\nCardDeck_Memory_QuestCards.pdf[ [https://www.file-upload.net/download-12588150/CardDeck_Memory_QuestCards.pdf.html]\nCardDeck_Memory.pdf [https://www.file-upload.net/download-12588152/CardDeck_Memory.pdf.html]\nCardDeck_Raven.pdf [https://www.file-upload.net/download-12588153/CardDeck_Raven.pdf.html]\nCardDeck_Spiral.pdf [https://www.file-upload.net/download-12588154/CardDeck_Spiral.pdf.html]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/253465-custom-mission-mapping-out-a-forgotten-island/?do=findComment&comment=2872328","commentId":2872328,"userName":"rajatz","timestamp":1499563678,"content":"I'd suggest you to align all the cards into a 3x9 table instead of 2x4. I have downloaded and i'll try it later.\n\nEdited July 9, 2017 by rajatz"},{"commentUrl":"https://community.fantasyflightgames.com/topic/253465-custom-mission-mapping-out-a-forgotten-island/?do=findComment&comment=2872569","commentId":2872569,"userName":"Flrbb","timestamp":1499595079,"content":"In general, I am unsure which is the best way to provide the cards. Single images or a easy printable pdf with pre-aligning the cards...\n\nWith the size of Din A4 (common paper format in germany) 2x4 is better to be set up for most of the printers - because of borders the printers need. As far as I know at least USA is used to a different paper layout. Is that why you suggest 9 cards per sheet, rajatz?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/253465-custom-mission-mapping-out-a-forgotten-island/?do=findComment&comment=4000540","commentId":4000540,"userName":"littlebear","timestamp":1602549375,"content":"@Flrbb [https://community.fantasyflightgames.com/profile/245439-flrbb/]\n\nHi! The link has been expired.\n\nCould you upload a new one? Or Sent them to my email: 490189269@qq.com\n\nI really want to try, Thank you very much!!"}]}