{"url":"https://community.fantasyflightgames.com/topic/254410-new-art-spoilers/","title":"New art spoilers","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/254410-new-art-spoilers/?do=findComment&comment=2885668","commentId":2885668,"userName":"Estel Edain","timestamp":1500328508,"content":"The French website for FFG recently added several new LOTR LCG avatar options, including some (such as Elrohir, Orc Disguise, and the Mouth of Sauron) which are from the Mountain of Fire. Here's the link: http://imgur.com/a/0El2q? [http://imgur.com/a/0El2q?]\n\nAside from Arwen, I think none of this art has appeared in released products (please correct me if I'm wrong). The art named Elfhelm (http://www.charroart.com/#4 [http://www.charroart.com/#4]) that Gizlivadi found is there (perhaps he'll be an ally in the Mountain of Fire), as are some new pieces of art. The second from the right image in the bottom row might be art for Rosie Cotton, and the old character next to Arwen might be Gaffer Gamgee or Farmer Cotton. Any other speculation?\n\n(If you want to see the avatars yourself, you can login to http://www.fantasyflightgames.fr [http://www.fantasyflightgames.fr] using the same name and password as the FFG forums. Click on \"Mon Profil\" in the dropdown menu in the top right, click on \"Éditer / Voir mon Profil,\" and then under \"Image du joueur\" choose \"Le Seigneur des Anneaux LCG.\")"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254410-new-art-spoilers/?do=findComment&comment=2885762","commentId":2885762,"userName":"Gizlivadi","timestamp":1500332573,"content":"Yes, I had seen that art for Elfhelm before, posted it on Discord. My guess is that it was a piece originally comissioned for Elfhelm but ended up unused, so they will reuse it most likely on Éomer (or as someone said, Éometh, but I think it unlikely)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254410-new-art-spoilers/?do=findComment&comment=2885923","commentId":2885923,"userName":"Authraw","timestamp":1500341771,"content":"Rosie Cotton! That would be awesome. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254410-new-art-spoilers/?do=findComment&comment=2891298","commentId":2891298,"userName":"987654321","timestamp":1500629578,"content":"The orc below left looks like Hugo Weaving's Elrond."}]}