{"url":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/","title":"Best Nightmare Mode recommendations?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2895144","commentId":2895144,"userName":"JYoder","timestamp":1500908029,"content":"While I love this game two-handed, I've found going back to older quests becomes almost too easy with newer card synergies. (Tried Escape from Dol Guldur the other night with my 2 latest decks and didn't even break a sweat.) So I'm starting to look at Nightmare mode options.\n\nI've bought 2 for a couple of past quests that are far too easy (Emyn Muil and Dead Marshes) but I'm looking to maybe get a few more. I looked through this guide, but it's dated now, with 2 more years of content now out...\n\nhttps://talesfromthecards.wordpress.com/2014/02/21/nightmare-buying-guide/ [https://talesfromthecards.wordpress.com/2014/02/21/nightmare-buying-guide/]\n\nSo I'm wondering, is there an overall user rankings of the quests somewhere (outside of the \"official\" joke FFG rankings) to gauge the best Nightmare mode candidates? I seem to remember Amon Din was pretty easy... and maybe Across the Ettenmoors? I don't know. My memory is foggy so I'll take any thoughts.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2895731","commentId":2895731,"userName":"Rouxxor","timestamp":1500924497,"content":"I never see a guide for nightmare adventure. I made by myself my own guide of cool adventures classed from the easiest to the hardest:\n\nFondations de pierre\nUn voyage dans l'obscurité\nLa traversée des landes d'Etten\nLes collines venteuses\nUn voyage dans l'obscurité\nFuite vers le gué\nAu-dela des montagnes froides et embrumées\nLe Secret de Celebrimbor\nLa Couronne d'Andouillers\nLes craintes de l'intendant\nLe Sang du Gondor\nLes désolations d'eriador\nBagarre à pélargir\nLes Trois Épreuves\nL'ombre et la flamme\nLa chaussée des morts\nBataille de Carn Dun\nLe gouffre de Helm\nLes Nîn-in-Eilph\nPiégé au Pays de Dun !\nEn Ithilien\nDéfense de Cair Andros\nRetour à la forêt noire\nRencontre à Amon Din\nBataille des cinq armées\nÉvasion de Dol Guldur\n \nIt is French. I have no idea if you can translate by yourself the name in english. Ask me if some are too tricky :).\n \nAnd yeah Encounter at Amon Din is one of the most difficult. Even more than described because I think there is a gap between the first 3 adventures and the others one. And the normal version is one of the more annoying quest in the whole games so it is pretty surprising ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2896852","commentId":2896852,"userName":"JYoder","timestamp":1500994595,"content":" \n\nThanks for the list! Translated below, with some guesses I'm not sure about...\n\nFoundations of Stone\nAcross the Ettenmoors\nThe Windy Hills (The Hills of Emyn Muil?)\n Journey into Darkness\nFlight to the Ford\nOver the Misty Mountains\nCelebrimbor's Secret\nAntlered Crown\nThe Steward's Fear\nThe Blood of Gondor\nThe Wastes of Eriador\nPeril in Pelargir\nThe Three Trials\nShadow and Flame\nThe Pavement of the Dead (The Dead Marshes?)\nThe Battle of Carn Dum\nHelm's Deep\nThe Nin-in-Eilph\nTrapped in the Land of Shadow\nInto Ithilien\nThe Siege of Cair Andros\nBack to the Black Forest (The Druadan Forest?)\nEncounter at Amon Din\nBattle of Five Armies\nEscape from Dol Guldur\n\nNo other thoughts from others? I assume then that only a small handful of players actually get Nightmare decks?\n\n \n\nEdited July 26, 2017 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2897647","commentId":2897647,"userName":"Rouxxor","timestamp":1501019294,"content":"Thanks a lot. It is hard for me because I barely know the names of the quests in english. I correct those who are not intuitive. Please tell me if any of those names is still incorrect :).\n\nFoundations of Stone\nAcross the Ettenmoors\nThe Weather Hills\nJourney into Darkness\nFlight to the Ford\nOver the Misty Mountains\nCelebrimbor's Secret\nAntlered Crown\nThe Steward's Fear\nThe Blood of Gondor\nThe Wastes of Eriador\nPeril in Pelargir\nThe Three Trials\nShadow and Flame\nThe Dead Marshes\nThe Battle of Carn Dum\nHelm's Deep\nThe Nin-in-Eilph\nThe Dunland Trap\nInto Ithilien\nThe Siege of Cair Andros\nReturn to Mirkwood\nEncounter at Amon Din\nBattle of Five Armies\nEscape from Dol Guldur\n\nI think also there is only a few part of players who get nightmare. And even few who can actually hard test them. But there is still few and I would be really interested to know their point of view. It is not obvious to have a clear view from nightmare since some adventures doesn't get really upgraded (like battle of carn dum) and some other become so difficult (Encounter at Amon Din). The more strange is Druadan forest who become a brand new adventure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2898024","commentId":2898024,"userName":"Authraw","timestamp":1501042535,"content":"I've been playing through the Nightmare quests in order on my blog:\n\nhttps://darklingdoor.wordpress.com/thematic-nightmare/ [https://darklingdoor.wordpress.com/thematic-nightmare/]\n\nSo far, I'd break the quests down like this:\n\nMediocre quests made significantly better in Nightmare: Passage Through Mirkwood, The Hills of Emyn Muil, Flight from Moria, The Redhorn Gate\n\nGreat quests that are still great in Nightmare: Conflict at the Carrock, Foundations of Stone, Shadow and Flame\n\nQuests where Nightmare challenges the ideal strategy: Peril in Pelargir, Into Ithilien\n\nSo far, I have only encountered two quests that I prefer in non-Nightmare: The Seventh Level (where the Nightmare version adds a new mechanic that falls flat for me) and Watcher in the Water (where they force you to both kill the Watcher and clear the Doors of Durin--so it has fewer interesting decisions).\n\nIn general, though, I think it's worthwhile to buy the Nightmare version for just about any quest you already enjoy. The Nightmare versions of the quests tend to be better focused, and I have found the increase in difficulty to be welcome without being extreme. Some of them even fix \"bugs\" in the quest that can lead to infinite loops or cheap wins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2898082","commentId":2898082,"userName":"JYoder","timestamp":1501049306,"content":" \n\nGood stuff! That's the kind of break down I'm curious about as I've no desire to own all the NMs -- just want to patch up the weak original quests. I'll keep following your blog. Thanks!\n\nSo for those you didn't put in a category (such as Journey Along the Anduin, Hunt for Gollum, etc.) are you saying they don't add much to the original?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2898094","commentId":2898094,"userName":"Authraw","timestamp":1501050148,"content":"> 2 minutes ago, JYoder said:\n> \n>  \n> \n> Good stuff! That's the kind of break down I'm curious about as I've no desire to own all the NMs -- just want to patch up the weak original quests. I'll keep following your blog. Thanks!\n> \n> So for those you didn't put in a category (such as Journey Along the Anduin, Hunt for Gollum, etc.) are you saying they don't add much to the original?\n> \n>  \n\nI wouldn't say that—I just wouldn't put either of those quests on a \"favorite quests\" list personally. If you enjoy those quests today, you'll probably find that the Nightmare versions are even better.\n\nJourney Along the Anduin almost made my \"Great quests\" list, actually, but I took it off in an attempt to focus the list. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] The Nightmare version is good too—although it suffers from some of the same swinginess as the original. \n\nHunt for Gollum is also better in Nightmare, but it still isn't terribly difficult. With today's card pool it's still pretty easy to trounce it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2901871","commentId":2901871,"userName":"Rouxxor","timestamp":1501203118,"content":"Error: double post\n\nEdited July 28, 2017 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2901872","commentId":2901872,"userName":"Rouxxor","timestamp":1501203180,"content":"As I make a post in another subject I just write something that feel even more appropriate here.\n\n> Quote\n> \n> Into Ithilien and Defense of Cair Andros was my two favorite quest until recently. They bring the game in a new whole level. This is the moment the game came to maturity. From now I felt every quest on cycle 1 and 2 (and especially the 2) is annoying. But since they even create more sophisticated dynamics. Time counter was brilliant. It take me time to realise how it give rythm to the game but it became my favorite cycle more than one year ago. Cycle 5 have a lot of great thing too and may be I will realize how great it is soon too.\n\nAnd this have been not enough fixed by the nightmare packs realeased. They may have upgrade a lot the corresponding adventures but they still are way under later cycle adventures.\n\nIf you want number I put 5 adventures of each of cycle 3, 4 and 5 in my list against 2 of cycle 1 and 2. And even among this selection I rather play the ones from cycle 3, 4 and 5.\n\nYou talk about getting old adventure with a whole new design thanks to the nightmare. Don't be that enthusiast ^^. They rarely change global rules and goal of the quest(s). Sometime a new design make everything different (like encounter at Amon Din, shadow in flame, foundation of stone) but this is very rare. In the major part good adventure stay good adventure with their nightmares and that's it.\n\nAs Authraw I don't regret any buy from a nightmare since I enjoy playing those quest again in the new way but it is also because I have a huge commitment to this game. If you have a small budget or a small amount of time don't buy medium quest in first cycle who become medium+ quest with their nightmare, buy later cycle, you won't regret ;).\n\nEdited July 28, 2017 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254868-best-nightmare-mode-recommendations/?do=findComment&comment=2915613","commentId":2915613,"userName":"tomtom","timestamp":1502041905,"content":"In contrary to Authraw, I think highly about 7th Level Nightmare; Sometime last year I played it at least 50 times and never got bored. I also think higly about all Heirs Of Numenor NM Pack: PiP with its upgraded mechanics gives tons of fun, while other two quests are hard, but not overly frustrating. And there really are some nightmare quests that force me to give it up, sell my collection, burn the boxes and tear up the playmat:\n\nBlood Of Gondor\n\nTo Catch An Orc\n\nNin-In-Eilph.\n\nThose are plain unfair designs."}]}