{"url":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/","title":"Is Mountain of Fire the end?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898022","commentId":2898022,"userName":"khadorstrong","timestamp":1501042258,"content":"I haven't played for a while, but I was thinking about starting to pick up many of the sets I'm missing, BUT then I was reading the synopsis of the latest Saga set coming out, and it makes it seem that this is the last thing being released. \nPlus there is no new cycle shown, is this the end of the game??"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898032","commentId":2898032,"userName":"jnicol","timestamp":1501043002,"content":"I think FFG will keep the game going for as long as it is profitable. The community activity around the game is still very active - by comparison, when FFG pulled the plug on Cthulu CCG its forums had something like 1 or 2 active threads each month. Also they just reprinted the core set, Mirkwood and Dwarrowdelf cycles, which indicates that there are still plenty of new players joining the game.\n\nPeople have been speculating for years that the game would end when the final saga expansion was released, but the game existed before the sagas, so there is no reason it can't continue once they finish.\n\nIf FFG don't announce anything new at GenCon then it might be time to start worrying..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898046","commentId":2898046,"userName":"khadorstrong","timestamp":1501044962,"content":"Thank you for that info. \nEven if it does end, I suppose there's MORE than enough out now. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898052","commentId":2898052,"userName":"jnicol","timestamp":1501045827,"content":"That's right! I am still hacking and slashing my way through Moria, so I've got a good few years ahead of gameplay ahead of me even if FFG finished the game with Mountain of Fire.\n\nIf the game did finish what would make me sad is that presumably the community would dwindle away as people move on to other games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898062","commentId":2898062,"userName":"Authraw","timestamp":1501047146,"content":"We seem to have indications that there is another cycle planned for release after the current one, both because the last pack of the current cycle was leaked and its rulebook hints at a future cycle, and because some of the product ID numbers seem to have left room for a full cycle's worth of additional packs.\n\nNone of that is conclusive, of course—FFG could theoretically decide to pull the plug on any of their unannounced games if felt they had a good reason to do so. But at least we can feel fairly confident that a new cycle is in development.\n\nI haven't seen anything to indicate that the game is going away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898077","commentId":2898077,"userName":"JonG","timestamp":1501048856,"content":"Let's hope that it isn't  the end, and we get to see Dale and the Withered Health. I still have visions of the last quest being heroes travelling to the Grey Havens, and the last card being a pic of the Undying Lands. Would be a fitting end!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898225","commentId":2898225,"userName":"phorcys12","timestamp":1501060610,"content":"After the gray havens and the harad I am ready to be surprised. There are unexplored places near the Rhovanion, the Rohan, the peripheral regions of Gondor (Lamedon, Enfalas ...) and Eriador (Forochel) and completely new places, Iron Mountain, Rhun, Khand, Mordor. What to hold for a long time ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898293","commentId":2898293,"userName":"Edheliad","timestamp":1501063921,"content":"> 4 hours ago, JonG said:\n> \n> Let's hope that it isn't  the end, and we get to see Dale and the Withered Health. I still have visions of the last quest being heroes travelling to the Grey Havens, and the last card being a pic of the Undying Lands. Would be a fitting end!\n\nNot if your heroes aren't Elves or ringbearers (or Gimli)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898632","commentId":2898632,"userName":"ParinorB","timestamp":1501079775,"content":"> 8 hours ago, Authraw said:\n> \n> We seem to have indications that there is another cycle planned for release after the current one, both because the last pack of the current cycle was leaked and its rulebook hints at a future cycle, and because some of the product ID numbers seem to have left room for a full cycle's worth of additional packs.\n> \n> None of that is conclusive, of course—FFG could theoretically decide to pull the plug on any of their unannounced games if felt they had a good reason to do so. But at least we can feel fairly confident that a new cycle is in development.\n> \n> I haven't seen anything to indicate that the game is going away.\n\nI am curious about the issue of the ID numbers. I have no clue how they work so this question is probably very dumb but does \"there is room for at least one more cycle\" mean there is no room for TWO more cycles with the current series of ID numbers? Seems strange.\n\nI have also been curious about the lack in announcement of the next thing to come. As far as I remember FFG has been a little faster in the past (may be wrong) but if the story seems to be continuing judging from the rule book that seems a very strong hint that there were at least plans at some point to continue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898691","commentId":2898691,"userName":"JonG","timestamp":1501081962,"content":"> 4 hours ago, Edheliad said:\n> \n> Not if your heroes aren't Elves or ringbearers (or Gimli).\n\n\"And tales and rumours arose along the shores of the sea concerning mariners and men forlorn upon the waters who, by some fate or grace or favour of the valour, had entered in upon the straight way and seen the face of the world sink below them, and so had come to the lamplit quays of Avallone, or verily to the last beaches on the margin of Aman, and there had looked upon the White Mountain, dreadful and beautiful, before they died.\" (Silmarillion p339)\n\nMaybe not quite the same, but it doesn't seem such a stretch that Heroes of renown would be allowed to leave ME. \n\nIt's also an opportunity to enjoy Prof T's wonderful prose!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898716","commentId":2898716,"userName":"dalestephenson","timestamp":1501082824,"content":"Sands of Harad was announced 7 July 2016.  City of Corsairs (last pack in Dreamchaser) was announced 8 Jun 2016.  City of Corsairs finally came out in October 2016.  So it looks like the next cycle announcement is delayed relative to this cycle (Crossings of Poros was announced 7 February), and I assume will be out within 2-3 months.  However, since we know the next cycle *is* coming, I'm not that worried about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898768","commentId":2898768,"userName":"Onidsen","timestamp":1501084202,"content":"> 1 hour ago, ParinorB said:\n> \n> I am curious about the issue of the ID numbers. I have no clue how they work so this question is probably very dumb but does \"there is room for at least one more cycle\" mean there is no room for TWO more cycles with the current series of ID numbers? Seems strange.\n\nActually, I can't find anything on ID numbers.  From what I remember, the argument went \"the end of the haradrim cycle was product #x, and mountain of fire is product number x+7, so there's a whole cycles worth of product numbers unaccounted for.\"\n\nBut crossings of poros is product number 61, and mountain of fire is 62, so either my memory is wrong or FFG changed their product numbers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898803","commentId":2898803,"userName":"PocketWraith","timestamp":1501085131,"content":"> 11 hours ago, khadorstrong said:\n> \n> is this the end of the game??\n\nNo. /thread\n\n> 11 minutes ago, Onidsen said:\n> \n> Actually, I can't find anything on ID numbers.  From what I remember, the argument went \"the end of the haradrim cycle was product #x, and mountain of fire is product number x+7, so there's a whole cycles worth of product numbers unaccounted for.\"\n> \n> But crossings of poros is product number 61, and mountain of fire is 62, so either my memory is wrong or FFG changed their product numbers\n\nHowever Siege of Annuminas, the GenCon/Fellowship event quest from last year, has the product code 72, which leaves more than enough room for another cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898943","commentId":2898943,"userName":"Onidsen","timestamp":1501088894,"content":"> 58 minutes ago, PocketWraith said:\n> \n> No. /thread\n> \n> However Siege of Annuminas, the GenCon/Fellowship event quest from last year, has the product code 72, which leaves more than enough room for another cycle.\n\nThat was it! I knew I was missing something, because I'm pretty sure that FFG doesn't mess with product numbers. Thanks!\n\nHmm...10 products in between the 2 - Thats a deluxe box, a cycle, and 3 left over. Future GenCon or Fellowship quests are more than likely to be post-72, so we may have two full cycles in development at the present time.\n\nWhile it's possible that FFG could pull the plug on the game without releasing everything under development, the game is still selling very well, and still attracting new players. I do not find it likely. I expect there to be at least two full adventure cycles left in the game, and perhaps more.\n\nOf course, while the gamer in me loves that idea, my pocketbook is less sanguine about the whole thing. But I try to keep my pocketbook quiet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898976","commentId":2898976,"userName":"Authraw","timestamp":1501089624,"content":"> 4 minutes ago, Onidsen said:\n> \n> Hmm...10 products in between the 2 - Thats a deluxe box, a cycle, and 3 left over. Future GenCon or Fellowship quests are more than likely to be post-72, so we may have two full cycles in development at the present time.\n\nThere are actually 9 products between 62 and 72 (Because 72 is already \"taken\"). 7 of those 9 would fit a full cycle.\n\nI'm going to guess that one more of those is a Scouring of the Shire POD (seems likely to me that they would have put it into development shortly after Mountain of Fire). If I'm right, that leaves room for one more product.\n\nIt will be interesting to see what product number this year's GenCon event has. Anyone want to place any bets? I'm guessing 71."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2898988","commentId":2898988,"userName":"Onidsen","timestamp":1501089894,"content":"> 1 minute ago, Authraw said:\n> \n> There are actually 9 products between 62 and 72 (Because 72 is already \"taken\"). 7 of those 9 would fit a full cycle.\n\nOh good heavens! I obviously need a nap, or something.\n\nStory of my life - going through a 4-year degree in physics may have given me the ability to do advanced mathematics, but it ruined my ability to do basic arithmetic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2899024","commentId":2899024,"userName":"Bullroarer Took","timestamp":1501091158,"content":"Onidsen I think you should watch the video here:\n\nIn it Caleb says that MoF is the last saga box but not the end of LOTR LCG.\n\nAnd in this thread:\n\nOne of the lucky people who scored a copy of Crossing tells us where we are probably going next.\n\nI don't think we'll keep up the same pace of material as before, but I do think the game is going to keep going."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2899211","commentId":2899211,"userName":"Buhallin","timestamp":1501097547,"content":"> 1 hour ago, Bullroarer Took said:\n> \n>  \n> \n> I don't think we'll keep up the same pace of material as before, but I do think the game is going to keep going.\n\nThe pace has already slowed down to half what it was - Harad is releasing bimonthly, as opposed to the previous monthly (as near as I can find).\n\nWhether we get another cycle or not, it seems as if FFG is shifting resources - both design and production - away from LOTR, and the game is in the home stretch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2899212","commentId":2899212,"userName":"monkeyrama","timestamp":1501097582,"content":"I do enjoy the Millenialism that strikes this game towards the end of each cycle. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] It struck me that other LCGs that have been shut down tend to either lose their licence or be getting pretty creaky. Given this game has both the licence and a slower player card release speed, it still has some way to go. That is the real problem: how do we store it all? :/"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2899396","commentId":2899396,"userName":"donkler","timestamp":1501103076,"content":"Let's just hope they are slowing the releases a bit while they finish negotiating that Silmarillion license :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2900343","commentId":2900343,"userName":"sappidus","timestamp":1501161365,"content":"I never particularly welcome seeing any \"dead/dying/DEATH??\" posts -- no offense to OP, but what *is* it about this game that spurs these thoughts? Yet I find it comforting that, when in other expandable game communities I follow, the main issue always seems to be whinging about the state of the meta, this or that is OP, the game hasn't been fun for n cycles... the issue here is mostly \"I love this game, and I'm hand-wringing about something happening to it, don't take it from me!\"\n\nA far better problem to have, IMHO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2900461","commentId":2900461,"userName":"Edheliad","timestamp":1501165640,"content":"There are still some pretty major gaps in the roster (heroes and allies) it will be annoying if it dies before they're filled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2906412","commentId":2906412,"userName":"Mixxathon","timestamp":1501496219,"content":"While there is nothing that points to the death of this game, no matter how conclusive it feels that the Saga is coming to a close (all tales must have an end after all) - there is something to be said about how long the game can be maintained in it's present form.\n\nI am talking about the shear amount of product that has been released and how difficult it is to keep it in stock. It is completely possible to find only packs and no deluxe expansion in a store, making the packs unplayable. That is very off-putting for a gamer and perhaps said gamer is curious about the possibility to play a co-op card game look towards the very much more manageable Arkham Horror LCG.\n\nUntil FFG gives us a possibility to buy a whole cycle in a single box after a cycle has been completely released, to make it easier for both the customers and the stores, this type of game has a limited lifespan. For completionists, and lets face it - Tolkien fans are like that - to begin this game right now is something of a nightmare, not least from an economical point of view.\n\nAnd finally, the game is beginning to show it's age. There is just so much that can be done within the games framwork, as opposed to Arkham Horror LCG that has a much more open design and built-in mechanics that allow for the adventures to be designed in a multitude of ways. LoTR quests are saddled with the (monotone) Quest phase and the (boring) Locations and no clear campaign structure, while AH LCG has solved all that in a very beautiful way.\n\nIf the game would end to be replaced by something fresh and new set in Middle Earth, I for one would welcome it. I have around a 1000 hours of LoTR LCG under my belt and still come back for more each week, but it would be nice to get a game in Tolkienverse that dripped of theme as much as Arkham Horror LCG does, and a fresh start would taste like Lembas in this old elfs mouth :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 31, 2017 by Mixxathon"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2906877","commentId":2906877,"userName":"Hannibal_pjv","timestamp":1501518563,"content":"So Lotr Lcg 2nd edition? Not likely just yet, but I would be very happy to see it some day :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\na combination and bettered version of Lotr and arkham game system would be my favorite game. But not likely to happen. Game of Thrones managet to do it because the tv series did help a lot to gather new players.\n\nHarder to see why new players would pick up new version on Lotr though. Well maybe we will get Silmarillion card game with those new rules ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nthat would be avesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907049","commentId":2907049,"userName":"donkler","timestamp":1501523888,"content":"I would definitely be cool with a reboot at some point. Just as long as it wasn't another competitive collectible dice game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907074","commentId":2907074,"userName":"Willange","timestamp":1501524502,"content":"Just thought I should chime in and point out that we actually already have products 63 and 64 as standalone scenarios being belegost and murder.  That leaves 7 slots (65 - 71) for another cycle plus deluxe.  I kept seeing people mention 9 slots, but there's only 7."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907353","commentId":2907353,"userName":"Authraw","timestamp":1501533989,"content":"> 2 hours ago, Willange said:\n> \n> Just thought I should chime in and point out that we actually already have products 63 and 64 as standalone scenarios being belegost and murder.  That leaves 7 slots (65 - 71) for another cycle plus deluxe.  I kept seeing people mention 9 slots, but there's only 7.\n\nAha! Good catch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907402","commentId":2907402,"userName":"Bullroarer Took","timestamp":1501536042,"content":"I really thought I was going to like AH LCG, but I began to dread all of the overhead required to play.  I doubt we will ever get a reboot, but if we do I hope it's not like AH.  LOTR is much more abstract and strategic than AH and I like that.  AH is more tactical and immediate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907503","commentId":2907503,"userName":"banania","timestamp":1501541621,"content":"The game has been dying since it was born."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907548","commentId":2907548,"userName":"Buhallin","timestamp":1501543839,"content":"> On 7/27/2017 at 6:16 AM, sappidus said:\n> \n> I never particularly welcome seeing any \"dead/dying/DEATH??\" posts -- no offense to OP, but what *is* it about this game that spurs these thoughts?\n\nI don't think it's unreasonable to ask the question at all.  As for what it is that invites the question:\n\n- Saga is a bounded product set, and soon to be complete\n- There's already a huge amount of content for the game, and entry is daunting for new players\n- 5-6 years seems like a good lifecycle for FFG products\n- FFG has other products in a similar vein (Arkham Horror) with obvious inspiration from LOTR\n- Content we do get is getting more and more fringe.  Hardcore Tolkien fans may recognize the Gray Havens or Harad, and the characters with them, but many don't.\n- Pace of new content has been cut in half, once Saga is done it'll be running about 30% of what it was a few years ago\n- Mechanics are reaching the limit of what they can do with the structure.  They're still finding new ways to break molds, but only so much of that\n\nIn most games, doomsaying comes about because people are unhappy.  \"I don't like what they've done, so nobody else will either!!  The game's doomed!\"  That really doesn't seem to be the case here.    People in the game love the game, including the ones who look at the state and think it's winding down.  It's not some left-field invented prediction of doom.  Maybe three cycles ago, but today?  Honestly, there's more evidence that the game's close to done than there is that it's got another 3-4 cycles to go.\n\nSadly, while the origin of the \"doomsaying\" is different, the defensive responses seem to be very much the same.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907550","commentId":2907550,"userName":"Buhallin","timestamp":1501543891,"content":"> 2 hours ago, Bullroarer Took said:\n> \n> I really thought I was going to like AH LCG, but I began to dread all of the overhead required to play.\n\nI'm curious what overhead you mean?  I know a lot of the reasons people don't like AH, but this is a new one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907579","commentId":2907579,"userName":"Bullroarer Took","timestamp":1501545002,"content":"I mean the setup time and keeping track of experience.  I know that AH is young, but I didn't enjoy it as a solo game and playing it double fisted was really not for me.  (I didn't really mind the chaos bag though many others did.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907901","commentId":2907901,"userName":"Trialus","timestamp":1501569913,"content":"I think Bulhallin's point are all pretty spot on... I'm sure the change in release tempo, end of the Saga boxes, lack of hard info on a next cycle and the LCG distribution model in general all play a role in stirring up \"game is dying\" sentiments, but I think a lot is also just worrying about how long such a good thing can last and steeling your self for the end, so it hurts a bit less. \n\nMy solace is that with the success of LOTR, and now AH, I find it pretty likely that there will be a co-op/solo LCG in the line up for a very long time and that, just as AH grew out of LOTR, something new will be inspired from AH.  \n\nAs an aside... when the game does end, would folks rather see a pretty quick reboot/2nd Ed (like GoT) or let LOTR rest and see a new co-op/solo LCG emerge? Obviously there a ton of other possibilities besides these two, but they seem like the most generally desirable outcomes of LOTR ending.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2907937","commentId":2907937,"userName":"Buhallin","timestamp":1501573006,"content":"I'm honestly not sure how I'd feel about a 2nd Edition for LOTR. To be honest, I don't really think the game needs it. While there are a few balance issues, they don't bother me the way they seem to some.\n\nThe game certainly isn't in a broken enough state to need a reboot. I don't think there's much to be improved by a new edition, and if they were to reboot it now, it would need to be something dramatically different to feel like anything but a cash grab."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2908098","commentId":2908098,"userName":"Trialus","timestamp":1501588217,"content":"Agreed.  While I'd be said to see it end, if it has to then I'd rather they explore new horizons.  Going straight back into ME with it pretty well explored in the current edition would feel a bit off."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2908154","commentId":2908154,"userName":"jnicol","timestamp":1501590918,"content":"> 5 hours ago, Trialus said:\n> \n> As an aside... when the game does end, would folks rather see a pretty quick reboot/2nd Ed (like GoT) or let LOTR rest and see a new co-op/solo LCG emerge? Obviously there a ton of other possibilities besides these two, but they seem like the most generally desirable outcomes of LOTR ending.\n\nPersonally I do not want a reboot, for entirely selfish reasons. I still have years worth of unplaced scenarios ahead of me, and I hate the idea of the rest of the community going off and playing v2.0 while I am stuck playing v1.0 by myself! Basically I don't like the idea of investing so much time and money into a game only to have it made obsolete overnight.\n\nIn any case, I agree with previous commenters who have pointed out that the game is not broken, and therefore doesn't need a reboot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2908211","commentId":2908211,"userName":"dalestephenson","timestamp":1501594105,"content":"I wouldn't mind a reboot that was backwards compatible, but that would difficult to manage and calls into question the necessity for a reboot.  If there's an incompatible LOTR LCG 2.0, I would prefer the setting be incompatible -- ideally in the time of the Silmarillion, but with rights to that not at all likely, perhaps set at the end of the second age and beginning of the third age, where we have Appendices content to fall back on.  (I'd also love to see a new saga set at this time.)\n\nThe end of the saga will (necessarily) slow down the release of content, and Harad seems to be coming out more slowly than a regular deluxe.  But the game began before there were any rights to a saga, so I don't think the saga's end presages the end of the game.\n\nThe amount of content available must be daunting for new players, yet it seems like there's a continual stream of new players posting on boardgamegeek.  With the next cycle set in the Hobbit's old stomping grounds, we're not in unfamiliar territory, and there's still other places we haven't seen that I'd like to see.\n\nHow the game's longevity compares to other LCGs I don't know.  Because the player card pool grows so slowly, I'm curious how the number of distinct player cards compares to other active/retired FFG LCGs, I'd be surprised if it were at the top.  And the cooperative nature of the game makes all player cards relevant in a way that's not true in a competitive game.\n\nAll things come to end sometime, especially licensed products.  But without knowledge of the licensing situation at all and only a vague impression of the financials, I must say that I don't see a sag either in popularity or quality of new releases to think that the end *should* come soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2908859","commentId":2908859,"userName":"Willange","timestamp":1501614540,"content":"Not sure if I'd buy a reboot or not.  That would greatly depend on the types of changes they made.  I would like to be able to play the stealth side of the game a little more without my threat just ticking up and up and up because I keep sneaking past the enemies rather than kill them.  Big systems changes like that, if they enable more diverse approaches to various quests, would be welcome and would probably justify a new edition.  \n\nBut even assuming new systems were in place, I sort of feel like this current edition might continue to be enough for me.  My main enjoyment in this game comes from making themed decks and just enjoying being the in LOTR universe.  I love that a new Ent hero is coming because now my Ent deck can get even more thematic!  An eagle hero would have me revisiting my eagle themed decks.  As long as they continue to reinforce strong themes, I'll be more than happy with the game as it now is I think.  Because of this, I think I would also need this edition to die for a few years at least before I'd be motivated to buy into a new edition of it, but even then that's only a maybe.  If they ever do make a 2nd edition, then I certainly hope it would do well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2909296","commentId":2909296,"userName":"Authraw","timestamp":1501637950,"content":"I'd like to see a Core Set 2, that is better balanced for new players and gives them an easy entry point into the modern card pool. If it happened to include rebalanced versions of cards like Steward of Gondor or Glorfindel (either version) I certainly wouldn't complain. No need to errata the old versions, just let them coexist and players can use whichever version they prefer. I'd also be okay with them doing a few major rule tweaks so long as the older cards remain playable under the new rules. \n\nBut I don't think the game needs a full 2.0 reboot, honestly, just a better way to enter the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2920320","commentId":2920320,"userName":"banania","timestamp":1502298007,"content":"I'd like to see :\n\n- 1 or 2 Saga Expansions focused on The War of the Ring and expanding Campaign Mode\n\n- a Print on Demand set of quest cards only, reusing existing encounter sets from the whole collection of expansion to build new scenarios\n\n- a Print on Demand with side quests for the early cycles, when Side Quests did not exist\n\n- a Core Set-sized expansion with a generic campaign mode, boons, burdens"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2920476","commentId":2920476,"userName":"taylorcowbell","timestamp":1502303432,"content":"> On 8/1/2017 at 7:28 AM, dalestephenson said:\n> \n>  With the next cycle set in the Hobbit's old stomping grounds, we're not in unfamiliar territory, and there's still other places we haven't seen that I'd like to see.\n> \n>  \n\nApologies if this is a stupid question, but how do you know this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2920611","commentId":2920611,"userName":"dalestephenson","timestamp":1502307999,"content":"Crossing of Poros (final Harad quest) was accidentally leaked in Europe.  It hints where we will be going next."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2920986","commentId":2920986,"userName":"Rouxxor","timestamp":1502325276,"content":"> 7 hours ago, banania said:\n> \n> I'd like to see :\n> \n> - 1 or 2 Saga Expansions focused on The War of the Ring and expanding Campaign Mode\n> \n> - a Print on Demand set of quest cards only, reusing existing encounter sets from the whole collection of expansion to build new scenarios\n> \n> - a Print on Demand with side quests for the early cycles, when Side Quests did not exist\n> \n> - a Core Set-sized expansion with a generic campaign mode, boons, burdens\n\nAll this seem very great but I don't think there is any chance they do something like that. It is only material for people who get everything, have already play to everything and want to mix some experiences. It is even more specific than nightmare packs. The saga you mention seem the most plausible and it is perfect since it is also the most exciting stuff to me in your list :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2922157","commentId":2922157,"userName":"banania","timestamp":1502392003,"content":"I agree with you :-)\n\nWas just listing wishes but I have no illusion for them to be being ever printed, except as you mentioned, The War of the Ring stuff.\n\nEdited August 10, 2017 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2922163","commentId":2922163,"userName":"Rouxxor","timestamp":1502392337,"content":"The good point is that we don't fully rely on developer to make adventures. We can create our own cards :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2923862","commentId":2923862,"userName":"Boris_the_Dwarf","timestamp":1502480766,"content":"I've played this game since the beginning. I own everything. Most of the adventures are on a box in the back of the closet. For the last 4 years, I have had exactly 2 decks that work in tandem beautifully and the only time I ever change cards out is when something is released that is definably better than a card in one of the decks. I've tried building other decks but nothing really matches the pair my wife and I play routinely, against the scenarios that are either the most fun, the most challenging, or both. Out of roughly 40 scenarios, I would say about 10 have stood the test of time.\n\nSo yes, we love this game at my house but seeing it come to an end won't impact that in the slightest. It's had a great run and they've done a great job with it overall. It's okay with me if they decide to stop. I'd be able to try out some of the other games they are making."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2923935","commentId":2923935,"userName":"Beneldir","timestamp":1502484154,"content":"> On 9.8.2017 at 7:00 PM, banania said:\n> \n> I'd like to see :\n> \n> - a Print on Demand set of quest cards only, reusing existing encounter sets from the whole collection of expansion to build new scenarios\n\nI would like to see just quests too, with or without existing encounter-decks. And I think people would buy them more then nightmares. Personaly, I've everything that is released besides nightmares.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2924506","commentId":2924506,"userName":"alexbobspoons","timestamp":1502526176,"content":"I would not buy a 2.0\n\nI've so much content still to play I'll be playing 1.0 for years and will always buy 1.0 packs but a reboot would stop me buying. I would steer my money elsewhere. \n\n \n\nA new coop lcg in another setting may well get bought by me depending on the setting. \n\n \n\nI love the idea of the adventures that mix older encounter sets :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2924536","commentId":2924536,"userName":"Maktorius","timestamp":1502530608,"content":"I would definately be interested in buying a pack of rebalanced and updated versions of older player cards instead of a 2.0. I really feel that completely over/under powered card don't contribute to a fun game.\n\nI have been using the rebalanced cards from the rework projekt (available here on the forums and linked from Hall of Beorn's blog). But the perfectionist and rules lawyer in me would be more at rest with an official release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2924987","commentId":2924987,"userName":"Flrbb","timestamp":1502568672,"content":"> 22 hours ago, Boris_the_Dwarf said:\n> \n> I have had exactly 2 decks that work in tandem beautifully and the only time I ever change cards out is when something is released that is definably better than a card in one of the decks.\n> \n> ...Out of roughly 40 scenarios, I would say about 10 have stood the test of time.\n\nDo you mind posting the two decks (or at least the archetype and the used heroes)? As well as your 10 quests? I'd love top hear about them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2925506","commentId":2925506,"userName":"Rouxxor","timestamp":1502622453,"content":"> On 8/9/2017 at 7:00 PM, banania said:\n> \n> - a Print on Demand with side quests for the early cycles, when Side Quests did not exist\n\nHere is an exemple of what we can do in Strange Eons to create our own Side Quests. The most difficult part is to find an image, I pick one who don't fit very well just for the example:\n\nDivisés-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2017_08/599032929a5f0_Diviss-Front-Face.jpg.3ab85d074447a9d61b3b659c5c2975c2.jpg] [//content.invisioncic.com/Mfantflight/monthly_2017_08/599032929a5f0_Diviss-Front-Face.jpg.3ab85d074447a9d61b3b659c5c2975c2.jpg]\n\nSplitted-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2017_08/Splitted-Front-Face.jpg.4e708645e55b16168e31e2e87498bc04.jpg] [//content.invisioncic.com/Mfantflight/monthly_2017_08/Splitted-Front-Face.jpg.4e708645e55b16168e31e2e87498bc04.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2925563","commentId":2925563,"userName":"Rouxxor","timestamp":1502630784,"content":"Another example:\n\n \n\nStuck-on-the-web-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2017_08/Stuck-on-the-web-Front-Face.jpg.19fb9e2654af5aa0e5f0ba59e0afc341.jpg] [//content.invisioncic.com/Mfantflight/monthly_2017_08/Stuck-on-the-web-Front-Face.jpg.19fb9e2654af5aa0e5f0ba59e0afc341.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2925668","commentId":2925668,"userName":"Boris_the_Dwarf","timestamp":1502642202,"content":"> 20 hours ago, Flrbb said:\n> \n> Do you mind posting the two decks (or at least the archetype and the used heroes)? As well as your 10 quests? I'd love top hear about them.\n\nMy favorite quests include:\n\nConflict at the Carrock, the Morgul Vale, Flight From Moria, peril in pelargir, the three trials, the Drudan forest, and encounter at Amon din. Top of the list though, is journey down the anduin from the core set. To be honest, we haven't really played the ones from the current cycle too much so I'm not sure how they measure up.\n\nWe also enjoy the saga box sets and have worked through the campaign a handful of times. Really looking forward to the last box coming out so we can play the entire campaign!\n\nI'll try to post the deck list today or tomorrow, but the gist of it is Legolas, haldir, and mirlonde running a combat team with core set eowyn, glorfindel, and core set denethor handling the willpower/questing. The tactics/lore deck drops a gondorian shield on denethor and then support cards like arwen and protector of Lorien pump his defense so high he's darn near untouchable. Legolas is great as pushing past quests when willpower alone isn't enough to break threat strength.\nEdited August 13, 2017 by Boris_the_Dwarf"},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2940312","commentId":2940312,"userName":"BigKahuna","timestamp":1503303530,"content":"One thing that can be said about Lord of the Rings the card game is that if it did in fact end with Mountain of Fire and the current Cycle, its doubtful they would stop printing the existing game.  From a perspective of history, FFG rarely stops printing their franchise games unless they lose the license to do so.  More importantly what we have today with Lord of the Rings is a massive collection of sets that is expanded far beyond what most cards games achieve.   If they ended it now, we would still have a fantastic, very complete game to enjoy for years, so unless you are one of those guys that has everything and eagerly awaits each new expansion, there is plenty to collect.  I venture to guess that if they continue to release at the rate they are now and I continue to acquire sets at the rate I do, I will always be 2-3 cycles behind.  If they stopped releasing new content I would probably still be collecting packs for the next 2-3 years if I wanted to complete the entire collection."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2941266","commentId":2941266,"userName":"Bullroarer Took","timestamp":1503333879,"content":"Some of us have been on it since the beginning though and we eagerly await every new quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2942810","commentId":2942810,"userName":"John Constantine","timestamp":1503385643,"content":"I'll never get tired from new player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/254987-is-mountain-of-fire-the-end/?do=findComment&comment=2942947","commentId":2942947,"userName":"tomas.daniel","timestamp":1503394223,"content":"> On 7/31/2017 at 6:29 PM, Hannibal_pjv said:\n> \n> So Lotr Lcg 2nd edition? Not likely just yet, but I would be very happy to see it some day :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n> \n> a combination and bettered version of Lotr and arkham game system would be my favorite game. But not likely to happen. Game of Thrones managet to do it because the tv series did help a lot to gather new players.\n> \n> Harder to see why new players would pick up new version on Lotr though. Well maybe we will get Silmarillion card game with those new rules ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> that would be avesome!\n\nI don't believe FFG will ever do the second edition of this game. It would be kind of pointless as it's not a competetive game and there is nothing what they should fix in any way. But if they do i think it will be rather a different game more like AH LCG or maybe something totally new.\n\nIt would be great if they will make last one cycle for the game and than end it in a big fashion(as it was already told here, each story must end). I would still be satisfied. I own every card of LotR LCG and it's my most played game of all time, we still play it each week or two with our group of friends and we love it. And there is still so much quests we didn't try and so much content we can still play with."}]}