{"url":"https://community.fantasyflightgames.com/topic/255123-saga-quests/","title":"saga quests","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2901877","commentId":2901877,"userName":"SauronTheGreat","timestamp":1501203340,"content":"do people think saga quests are any good?  Is it worth going for over the normal cycles?\n\nEdited July 28, 2017 by SauronTheGreat"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2901993","commentId":2901993,"userName":"Authraw","timestamp":1501210105,"content":"In general, the saga boxes are excellent. The player cards are almost universally good, and the quests tend to be really fun too, with Land of Shadow being the only one that perhaps falls a little flat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902245","commentId":2902245,"userName":"Rouxxor","timestamp":1501228384,"content":"I think that normal cycles are way better than saga. There is very cool adventures in both but cycles are more regular and introduce a cool new story."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902270","commentId":2902270,"userName":"Calvadur","timestamp":1501230231,"content":"Personally the most important thing for sagas is: Do you talk about the hobbit or Lotr ones?\n\nThe Lotr ones are great expansions, which many players love, and contain scenarios like Helm's Deep, which are completely unique, so you won't really find something compareable outside of the saga. They also come with the option of campaign mode, in which you more or less commit to a group of heroes. Therefore I would strongly advice anyone to be them in order. \n\nThe Hobbit ones have a more mixed reputation. They are often unique in their design, too, but use mechanics that easily become annoying.\nSome people enjoy the really specific decks the Hobbit sometimes needs (note that there isn't a campaign (just some \"treasures\" you can collect, like sting your Bilbo's ring) mode so you are always free to change your heroes.\n\nMake sure to check out this article, as I found the reviews to be pretty fair and neutral: https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/#Saga [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/#Saga]\n\nOne last thing to keep in mind: Both sagas can be extended by some PoD-quests: The Hobbit with the battle of Lake-town featuring the epic showdown between (originally) bard and Smaug and Lotr with the old-forest, having you run circles until you encounter old man willow and fog on the barrow-downs, trying to flee from the undead Tom warned you about. \n\nI would recommend every fan of the game to check the sagas out.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902395","commentId":2902395,"userName":"JonG","timestamp":1501238765,"content":"I haven't yet played the LoTR sagas (waiting until they're all available), but I have to say that that I didn't enjoy the Hobbit ones so much. They weren't terrible but 'annoying' is a good word I think. Depending upon how much you already have I'd get Khazad Dum first and then other cycles afterwards.\n\nWatch out for Heirs of Numenor - that one has a reputation for being pretty tough. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902415","commentId":2902415,"userName":"Edheliad","timestamp":1501240314,"content":"The first two LotR saga boxes are probably my favourite sets they've released and definitely my most played.\n\nThe campaign aspect is great. Would have been cool to see it added to the other cycles that tell a straight story. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902819","commentId":2902819,"userName":"SauronTheGreat","timestamp":1501253067,"content":"ok thx guys!  good to hear!  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255123-saga-quests/?do=findComment&comment=2902825","commentId":2902825,"userName":"donkler","timestamp":1501253157,"content":"I love the saga quests, although I am not quite caught up on the main Lord of the Rings one yet. I was kind of discouraged after the extreme difficulty of some of the quests though in the later boxes. My plan is to play through them all in easy, campaign mode once the last one comes out.\n\nI actually really enjoy The Hobbit saga too, but I seem to be in the minority there. I enjoy running 2 dwarf decks and just monstering through them."}]}