{"url":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/","title":"Carn Dum ... help?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2904681","commentId":2904681,"userName":"Hawkstrike","timestamp":1501355969,"content":"So I'd given up on LotR several months ago, partway through the Angmar Awakened cycle, because the difficulty had ramped up to the point where every game felt like being punched in the face and I just wasn't having fun. (Aside: I play pure solo.  I've made it through the Mirkwood cycle, Dwarrowdelf, the Hobbit Saga, the Fellowship and Two Towers parts of the LotR Saga, and skipped Numenor because I'd heard it was brutal).\n\nI finally picked the game back up a few days ago, and after a few plays was rewarded with finally making it through Treachery of Rhudaur by the skin of my teeth.\n\nSo I break out the next pack, Battle of Carn Dum,  and get started with my three heroes (Spirit Glorfindel, Spirit Merry, Loragorn).\n\nW. T. F.\n\nTotally buried and crushed.  My heroes can't repel firepower of that magnitude! Enemies building up in the staging area, threat off the charts ... at least with +10 engagement and my low starting threat (and Loragorn reset) I can call them out one at a time, but the only hero who can seem to survive a shot from an Orc Captain or Werewolf of Angmar is Gandalf. Six attack vs 2 defense, draw a shadow card with +1 attack, poof goes Aragorn (let alone Glorfindel, or Merry).\n\nBoggled. Tempted to put the game on another six month hiatus and go back to Arkham Horror LCG which is far less soul-crushing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2904770","commentId":2904770,"userName":"Authraw","timestamp":1501363477,"content":"I wasn't a fan of Battle of Carn Dum either--it's really really hard, but not in a \"Ruins of Belegost\" or \"Seige of Annuminas\" sort of way, where the quest is as unique as it is difficult. I suspect Carn Dum was made for those players who like to build super-powerful decks and feel like the game is too easy, but it doesn't tend to jive well with people who have other playstyles.\n\nIIRC, the shadow effects are the worst part of this quest, so A Burning Brand can work wonders as long as you can manage to get it set up. My partner and I beat it (2 player) with a trap deck and a Caldara deck. I'm not sure what the best solo strategy would be for this quest, since most of the play reports I've read played it 2-handed. It looks like Seastan was able to beat it solo [http://ringsdb.com/decklist/view/5756/minimum-purchase-the-battle-of-carn-dm-1.0] (min-purchase style, no less) on easy mode.\n\nYou can always skip it, like you did with Heirs of Numenor. Battle of Carn Dum was the last quest I can recall not liking on account of its difficulty. The Grey Havens + The Dreamchaser and Sands of Harad + The Haradrim cycles have been my two favorite cycles so far, so if you're anything like me then the best is yet to come."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2904928","commentId":2904928,"userName":"Yepesnopes","timestamp":1501374254,"content":"So, which is in particular the help you are asking for? Do you want ideas for decks to beat the quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2904937","commentId":2904937,"userName":"Rouxxor","timestamp":1501375345,"content":"Playing solo is really hard. The games difficulty is designed for two players, it seem obvious. One solution to get the game more easy is to play two handed.\n\nIn another hand you can copy killers decks. I work currently on a list of decks I play who are the best for playing solo. I can give you the list I came to for the moment in pre-release by private message. I haven't play Carn-Dum a lot so I can tell you wich of my decks can defeat it but since I play only versus nightmare adventures most (if not all) of them can probably defeat it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2904942","commentId":2904942,"userName":"Rouxxor","timestamp":1501375714,"content":"Oh and I forget to say that Carn Dum is rated as the most difficult not-nightmare adventure ever by http://lotr-lcg-quest-companion.com/home.html [http://lotr-lcg-quest-companion.com/home.html]\n\nEdited July 30, 2017 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2905200","commentId":2905200,"userName":"Trialus","timestamp":1501406529,"content":"If you are looking for deck recommendations, I managed to get through it on easy mode using Seastan's Dunedin Trappers deck (also one of the most fun decks I've played...link below) with a Favor of the Valar included for the near-endgame threat raise.  Brutal even on easy.\n\n \n\nhttp://ringsdb.com/decklist/view/28/dunedain-trappers-1.0 [http://ringsdb.com/decklist/view/28/dunedain-trappers-1.0]\n\n \n\nJust for reference...I am also a pure solo player.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2905375","commentId":2905375,"userName":"Lecitadin","timestamp":1501427775,"content":"I managed to beat (not in the first try) the nightmare version in pure solo with this deck: http://www.ringsdb.com/deck/view/61788 [http://www.ringsdb.com/deck/view/61788]   ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nEdited July 30, 2017 by Lecitadin"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2905859","commentId":2905859,"userName":"Hawkstrike","timestamp":1501456765,"content":"Thanks for the suggestions; good to know it is possible to win solo -- though I don't have all of the cards for either of the suggested decks (no Gondor, Isengard, Grey Havens, or Harad cycle cards). Maybe I can substitute a few cards.\n\nThough knowing it's the hardest quest in the game, and with no desire to play two handed solo -- I've tried it, and it was OK in the first cycle, but now there are just too many effects to keep up with to make it fun -- I may just park this one.\n\nEdit: Follow-up...  \n\nI decided to skip on past Carn Dum for the moment, pending deck suggestions I can implement, and break out the next pack in the cycle, The Dread Realm. I swap Arwen for Merry, and change out some cards (dropping all my Hobbit-related ones).  Then try the new adventure.\n\nWhew -- tough one.  I'm getting buried in reanimated dead, and can't seem to generate allies fast enough to take care of them while still questing enough to clear locations ... pretty soon I'm buried under undead and the undefended attacks kill me. Should I be running a dwarf deck? That worked great in the Dwarrowdelf and Hobbit cycles, but I don't want to go back to it -- the idea was to run Noldor and Dunedain for Angmar, which (other than Carn Dum) has worked well thus far. Still, there might be some hope here; this isn't as immediately soul-crushing as Carn Dum, if I can just stay ahead of reanimated dead and locations. Where's Light of Valinor when I need it?\n\nIt takes three games before I can even break into stage 2 ... and then the undead boss, Dechenar (or whtever his name is) comes in and hits like a freight train. 12 health, 5 defense, four attack plus a ton of boost from sorceery and shadow cards? Who writes these things? I can survive a couple attacks, but it takes my whole party to push through damage -- it's like I simultaneously don't have enough attack, enough defense, enough allies, and enough card draw (though at least Steward of Gondor, Arwen, and Silver Harp keep me flush with resources).\n\nAnother game ... scoop ... another. Finally, I seem to catch a break ... I get into stage 2 with no reanimated dead on the board and all other locations clear, and have a stack of Gandalfs and Sneak Attack in my hand.  It's so, so cheesy, but ol' Gandalf tanks Dechenar (who thankfully can take damage from Gandalf popping in), while every one else piles on for a whopping two damage a round. Eventually, with some close calls from reanimated dead, Dechenar goes down. The Witch of Angmar I flip up at the start of staging is going to be a pain, until I realize I just have to clear the last location to win, so I pour everything into the quest and just skate by with two nasty monsters waiting in the staging area to pounce (and Arwen about to croak if I don't clear that last location). Clear the Altar ... win. Done, read the Epilogue.\n\nStill wondering if I should go back to Carn Dum, or break out another cycle. Numenor, Isengard, or Grey Havens next?\n\nEdited July 31, 2017 by Hawkstrike"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2906222","commentId":2906222,"userName":"ricedwlit","timestamp":1501478392,"content":"> 5 hours ago, Hawkstrike said:\n> \n> Still wondering if I should go back to Carn Dum, or break out another cycle. Numenor, Isengard, or Grey Havens next?\n\nGo for Grey Havens.  It was refreshing after Angmar which, although I completed it (two handed solo), overall I found much less fun than any of the prior cycles (including Heirs of Numenor)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255242-carn-dum-help/?do=findComment&comment=2906435","commentId":2906435,"userName":"Calvadur","timestamp":1501499692,"content":"From the three listed cycles, I suggest the Grey Havens, too. The start of Numenor is very though and the final quest also is on the harder side. Isengart has a timer mechanic and loves to punish slower decks. The Havens are a very balanced cycle. You might find one or two situations a little bit mean when playing pure solo, but nothing to bad."}]}