{"url":"https://community.fantasyflightgames.com/topic/255218-are-progress-tokens-finite/","title":"are progress tokens finite?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255218-are-progress-tokens-finite/?do=findComment&comment=2904174","commentId":2904174,"userName":"Schmiegel","timestamp":1501313725,"content":"I'm playing The Redhorn Gate and have exceeded the number of progress tokens required to win (13) but haven't attained five victory points (also required to win). I have placed 20 progress tokens on the final quest card. As a result, I only have six progress tokens left in my \"progress token bank\". There is now a location active that will require seven progress tokens (and also is worth two victory points...) to explore. I haven't found anything in the rules stating whether tokens are finite.  If they are, it may not be possible to get the seven progress tokens on this final location that is required to win the quest. (Unless a card appears that removes progress tokens from the quest card..) Or can I \"proxy\" the tokens? Thanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255218-are-progress-tokens-finite/?do=findComment&comment=2904201","commentId":2904201,"userName":"NathanH","timestamp":1501315590,"content":"Not sure there's an official ruling, but finite tokens would provide lots of silly situations, so assume they are infinite."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255218-are-progress-tokens-finite/?do=findComment&comment=2904274","commentId":2904274,"userName":"Rouxxor","timestamp":1501327573,"content":"They are infinite. If they are finite there must be a point in the rules that state how many you can use of them (in case you lost some, or if you have multiple core set and shuffle the tokens).\n\nPhysical tokens are just a representation, you can use whatever you want to proxy them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255218-are-progress-tokens-finite/?do=findComment&comment=2905453","commentId":2905453,"userName":"sappidus","timestamp":1501434360,"content":"It would be more precise to state that the number of available tokens can be assumed to be an arbitrarily large finite number. An infinite number is not necessary. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n- signed, pedantic former math major\n\nEdited July 30, 2017 by sappidus"}]}