{"url":"https://community.fantasyflightgames.com/topic/255370-seventh-level-setup-and-book-of-mazarbul/","title":"Seventh Level setup and Book of Mazarbul","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255370-seventh-level-setup-and-book-of-mazarbul/?do=findComment&comment=2907681","commentId":2907681,"userName":"JYoder","timestamp":1501550179,"content":" \n\nThe setup says, \"Search the encounter deck for Book of Mazarbul, and have the first player attach it to a hero of his choice. Shuffle the encounter deck.\"\n\nThe Book of Mazarbul says, \"Action: Exhaust a hero to claim this objective. Then, attach Book of Mazarbul to that hero. (If detached, return Book of Mazarbul to the staging area.)\"\n\nI take this to mean the hero has it attached for \"free\" at setup without exhausting, but wondering if that's right. My thought is, it would seem odd that you'd have to follow the card text to attach it (given that Actions are a choice you can take -- not forced) so when the setup says to simply attach it, it seems you simply do it without any payment. But maybe I'm missing some ruling, so thought I'd  ask.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255370-seventh-level-setup-and-book-of-mazarbul/?do=findComment&comment=2907716","commentId":2907716,"userName":"jnicol","timestamp":1501552745,"content":"I have always played it that you get to attach the book for free during quest setup. I found this old thread which debates this point:\n\nThe consensus seems to be that you do attach the book for free, and this post seems quite relavent:\n\n\"Note that the Book of Mazarbul has 2 parts to it's action, exhausting a hero to claim the objective and THEN attaching the book. The quest text says to attach it to a hero, not to exhaust a hero nor to \"claim the objective\", just to attach it. It also does not specify to use the action on the book.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/255370-seventh-level-setup-and-book-of-mazarbul/?do=findComment&comment=2907932","commentId":2907932,"userName":"NathanH","timestamp":1501572434,"content":"The Setup instruction and the Action are completely separate, so you do not exhaust the hero at Setup."}]}