{"url":"https://community.fantasyflightgames.com/topic/255659-setup-for-4-players-including-new-players/","title":"Setup for 4 players (including new players)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255659-setup-for-4-players-including-new-players/?do=findComment&comment=2914412","commentId":2914412,"userName":"Tom1132","timestamp":1501928644,"content":"Hi guys,\n\n \n\nI'll be playing with 3 other players tonight and I'm curious as to what you think the most efficient setup is.\n\n \n\nI've tried it before where 2 people are seated on opposite sides on the long edge of the table; with the staging aread at one end (usually *my* end, since I'm the most experienced and quickest at managing the encounter deck-related stuff).\n\n \n\nThe only problem we ran into is that for the other end of the table, it can be difficult to see exactly what's in the staging area. Especially with them being newer players, I can't just say \"Dol Guldur Orcs\"... I have to describe each and every card as it comes off the deck. Which is fine for learning, but when they can only vaguely see the card, it's much harder for them to familiarize themselves when they have no 'art to put to the name', so to speak.\n\n \n\nIs it at all viable to have the staging area in the centre of the table; within equal reach of everyone? The only issue I see here is that for half the table the cards are upside down. I could alleviate that somewhat by seating myself on the 'upside down' side of the table (since I know tue cards anyway) but that still puts one of *them* in that position too.\n\n \n\nI'm thinking that it would help things along to have the round order breakdown from the back of the rulebook printed off and nearby as an aide. But are there specific rules for multiplayer that are often overlooked that help bring some order to the chaos of having 4 players?\n\n \n\n*Bonus Question*\n\nOut of the Core Set, the first cycle, Khazad-Dum and Over Hill and Under Hill; what is a good 4 player scenario that isn't too complex for beginners? (2 have played before and 1 is completely new to the game). I'm planning on doing Passage through Mirkwood to get the new player aquainted before throwing in more complex objectives, but what would be a good follow-up quest?\n\n \n\nAnd finally, any tips for 4 olayer games in general? I want everyone to have a good time so any tips on running a multiplayer game smoothly would be appreciated.\n\n \n\nLooking forward to hearing your thoughts.\n\nEdited August 5, 2017 by Tom1132"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255659-setup-for-4-players-including-new-players/?do=findComment&comment=2914556","commentId":2914556,"userName":"Flrbb","timestamp":1501941247,"content":"my table has space for two ppl per side. most the times we use opposite sides when playing with 4. we place the cards in the center of the table in a way that everyone has to tilt the head by 90° to re-read. the encounter deck stays at one side of the table, so most of the time it is just one player who reveals cards. that takes a bit out of the tension of the game (especially with the Peril keyword) but it is faster this way.\n\nwhen playing with 4, there is always one player who is not that much into the game (and the rules). in my experience it keeps the flow of the game up if that person sits the closest to the staging area.\n\nwe always play simultaneously (planing phase and battle phase), that fasten up the game a lot. only when it comes to shadow cards and the encounter deck comes to an end, it matters who is first player. there are only some quests which need an eye on the correct order of each player defending, then attacking. e.g. those who pass enemies to the next player.\n\nthe first two quests from kazard dun are very easy, but with the spawning of enemies through the shadow effects could get a bit messy on the table. a good quest (not so much special rules, still fun) is the second from the core: travel along the Anduin. in that case it would be important, that each player has a lower threat than 30...\n\nhave fun :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n"}]}