{"url":"https://community.fantasyflightgames.com/topic/255882-journeys-end/","title":"Journey&#039;s end","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919234","commentId":2919234,"userName":"987654321","timestamp":1502227718,"content":"https://www.fantasyflightgames.com/en/news/2017/8/8/journeys-end/ [https://www.fantasyflightgames.com/en/news/2017/8/8/journeys-end/]\n\nI wanna see COTR destroy this quest since the beginning and then at the end losing cuz of the quest effect.:P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919270","commentId":2919270,"userName":"sappidus","timestamp":1502228728,"content":"For the sake of the fan base, they should've reconsidered that article title, lol.\n\nN.B.: Of course we've gotten wind of this in interviews and product codes before, but always nice to see spelled out...\n\n> Quote\n> \n> The Mountain of Fire is not the end of The Lord of the Rings: The Card Game, but it is the end of your Saga Campaign.\n\nEdited August 8, 2017 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919351","commentId":2919351,"userName":"Gizlivadi","timestamp":1502232672,"content":"Wow, the art on The Black Gate is, like, straight out of the movies. Like, there's not even a sign of trying to cover it up. It's pure John Howe \"fin-like\" Mordor designs. I don't like it. I could give this absurd ridiculousness [http://imgur.com/LTSIs4E] a pass, but this is just shameful. I thought this game was supposed to intentionally deviate from the movies?\n\nWho the **** is the art director for this game and why does she/he blatantly steal from New Line Cinema?\n\nEdited August 8, 2017 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919552","commentId":2919552,"userName":"Mikayhu","timestamp":1502247314,"content":"> 4 hours ago, Gizlivadi said:\n> \n> Wow, the art on The Black Gate is, like, straight out of the movies. Like, there's not even a sign of trying to cover it up. It's pure John Howe \"fin-like\" Mordor designs. I don't like it. I could give this absurd ridiculousness [http://imgur.com/LTSIs4E] a pass, but this is just shameful. I thought this game was supposed to intentionally deviate from the movies?\n> \n> Who the **** is the art director for this game and why does she/he blatantly steal from New Line Cinema?\n\nTo be fair, John Howe and Alan Lee's work on illustrating Tolkien's world predates the films."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919591","commentId":2919591,"userName":"Gizlivadi","timestamp":1502250233,"content":"I had a kinda long discussion about this on COTR's Discord channel.\n\nIn short, I am aware that Howe's work predates the movies (it was even used in MECCG, years before the movies as well). BUT, as soon as Howe's depictions of Middle Earth were used for the movies, they became inseparable to the mainstream eye and soon his Middle Earth designs became the common image everyone thinks of when thinking of LOTR, i.e. when people think LOTR, they think the movies and thus Howe's designs. Now, his designs are great, but they are now way too attached to the movie phenomenon. Meanwhile, and after the death of LOTR TCG, you can see how FFG initially tried to make a new LOTR game that offered a new and fresh perspective of LOTR different from the movies (the prime example being Legolas hero being changed from having blonde hair to dark hair). When referred to the likeness of some Hobbit heroes to their actors in the movies during an interview, Caleb Grace explicitly said that they understand the movies as being a different product than the books, which I interpret as, the LCG being based on the books, presumably it should look for the most part different from the movies. Now, there's the argument that some elements in the LCG look like the movies in order to attract more public only familiar with them, which is somewhat understandable. Also, many of the artists working in the game will have the movies as their biggest reference, as well. My issue is with the fact that the premise of the game was to give a new, book-inspired Middle Earth experience, with obscure characters and places completely absent from the movies, and stuff looking as it looks like in the movie is really distracting and removes me from that experience. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919609","commentId":2919609,"userName":"Bullroarer Took","timestamp":1502251971,"content":"> 6 hours ago, sappidus said:\n> \n> For the sake of the fan base, they should've reconsidered that article title, lol.\n> \n> N.B.: Of course we've gotten wind of this in interviews and product codes before, but always nice to see spelled out...\n\nWell that settles it... The game is dying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919619","commentId":2919619,"userName":"Authraw","timestamp":1502253587,"content":"> 6 hours ago, sappidus said:\n> \n> For the sake of the fan base, they should've reconsidered that article title, lol.\n\nIt did actually give me a tiny heart attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919726","commentId":2919726,"userName":"roguefrog","timestamp":1502265121,"content":"What about The Scourging of the Shire dammit!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919740","commentId":2919740,"userName":"Rouxxor","timestamp":1502266590,"content":"We hope this will be a Print on Demand on some occasion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919747","commentId":2919747,"userName":"DurinVoronwe","timestamp":1502268120,"content":" Could someone please explain to me why/how the black gate reveales encounter cards? It om raises its/your threat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2919778","commentId":2919778,"userName":"987654321","timestamp":1502272525,"content":"> 1 hour ago, DurinVoronwe said:\n> \n>  Could someone please explain to me why/how the black gate reveales encounter cards? It om raises its/your threat. \n\nMaybe it was the first idea? Changed after playtesting?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920178","commentId":2920178,"userName":"JJ48","timestamp":1502293391,"content":"> 7 hours ago, roguefrog said:\n> \n> What about The Scourging of the Shire dammit!\n\nScouring*\n\nBut yeah!  The journey's not over until we fix the problems back home!  >:-("},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920261","commentId":2920261,"userName":"philkav","timestamp":1502295906,"content":"> 6 hours ago, 987654321 said:\n> \n> Maybe it was the first idea? Changed after playtesting?\n\nOr it's something on the quest card(s) that does it. Something like \"Forced: At the end of the staging step, the first player reveals an encounter card for each resource on The Black Gate.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920348","commentId":2920348,"userName":"Mikayhu","timestamp":1502299165,"content":"> 13 hours ago, Gizlivadi said:\n> \n> I had a kinda long discussion about this on COTR's Discord channel.\n> \n> In short, I am aware that Howe's work predates the movies (it was even used in MECCG, years before the movies as well). BUT, as soon as Howe's depictions of Middle Earth were used for the movies, they became inseparable to the mainstream eye and soon his Middle Earth designs became the common image everyone thinks of when thinking of LOTR, i.e. when people think LOTR, they think the movies and thus Howe's designs. Now, his designs are great, but they are now way too attached to the movie phenomenon. Meanwhile, and after the death of LOTR TCG, you can see how FFG initially tried to make a new LOTR game that offered a new and fresh perspective of LOTR different from the movies (the prime example being Legolas hero being changed from having blonde hair to dark hair). When referred to the likeness of some Hobbit heroes to their actors in the movies during an interview, Caleb Grace explicitly said that they understand the movies as being a different product than the books, which I interpret as, the LCG being based on the books, presumably it should look for the most part different from the movies. Now, there's the argument that some elements in the LCG look like the movies in order to attract more public only familiar with them, which is somewhat understandable. Also, many of the artists working in the game will have the movies as their biggest reference, as well. My issue is with the fact that the premise of the game was to give a new, book-inspired Middle Earth experience, with obscure characters and places completely absent from the movies, and stuff looking as it looks like in the movie is really distracting and removes me from that experience. \n\nI can understand that.  I'm just on the other side, since Alan Lee and Howe's work since the early 90s when I first starting reading Tolkien is how I've always envisioned things.  So changing things up from that has the same effect on me, it takes me out of it since I feel like they both captured the world so well.  Why change perfection to be more like the books when they used only the books as their source material?\n\nI don't think the movies should get credit for the visuals that were established before they even existed.  I'm all for new art for things not already established though, and I think the LCG artists have done a great job on that front."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920628","commentId":2920628,"userName":"DurinVoronwe","timestamp":1502308452,"content":"> 3 hours ago, philkav said:\n> \n> Or it's something on the quest card(s) that does it. Something like \"Forced: At the end of the staging step, the first player reveals an encounter card for each resource on The Black Gate.\"\n\nThat was what I thought. \n\nEdited August 9, 2017 by DurinVoronwe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920697","commentId":2920697,"userName":"Edheliad","timestamp":1502310650,"content":"> 3 hours ago, Shadin said:\n> \n> I can understand that.  I'm just on the other side, since Alan Lee and Howe's work since the early 90s when I first starting reading Tolkien is how I've always envisioned things.  So changing things up from that has the same effect on me, it takes me out of it since I feel like they both captured the world so well.  Why change perfection to be more like the books when they used only the books as their source material?\n> \n> I don't think the movies should get credit for the visuals that were established before they even existed.  I'm all for new art for things not already established though, and I think the LCG artists have done a great job on that front.\n\nBecause their work isn't \"perfection\". A lot of it actually sucks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920799","commentId":2920799,"userName":"Yepesnopes","timestamp":1502314789,"content":"> 17 hours ago, Gizlivadi said:\n> \n> My issue is with the fact that the premise of the game was to give a new, book-inspired Middle Earth experience,\n\nI think they missed that train already with the core box, when they included the \"citadel plate\" card, and posteriorly with all the heroes and allies that are depicted wearing plate armor like in Peter Jackson's movies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920892","commentId":2920892,"userName":"Kakita Shiro","timestamp":1502318796,"content":"> 2 hours ago, Edheliad said:\n> \n> Because their work isn't \"perfection\". A lot of it actually sucks.\n\nJust your opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2920947","commentId":2920947,"userName":"Gizlivadi","timestamp":1502321788,"content":"> 1 hour ago, Yepesnopes said:\n> \n> I think they missed that train already with the core box, when they included the \"citadel plate\" card, and posteriorly with all the heroes and allies that are depicted wearing plate armor like in Peter Jackson's movies.\n\nDon't even get me started on those. Heck, the very back of every encounter card is pure Jackson. The Eye of Sauron is never described as this literal wall of fire originating from a slit in the middle. It's described as an actual, glassy cat-like eye surrounded by flame, not made up of it. Sadly there's lots of these movie references, but I still insist based on just the Core set that the game was intended, at least in theory, to give a different experience from the movies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2921131","commentId":2921131,"userName":"Estel Edain","timestamp":1502339603,"content":"Caleb's love for the books and his excitement in designing the campaign (especially with the Sam quote at the beginning of the article) clearly come across in the article. Some of this was already covered in his interview with Team Covenant, but I'm impressed at how well the campaign fits together (with boons, burdens, and other consequences like the Haradrim enemies who escape to the Black Gate coming back) and captures the key moments of the books while building to an epic conclusion.\n\nI love that Shagrat can steal your boons. It seems likely that we won't get any new boons in this box, but it will be a bit of a challenge to hold on to your boons for the final quests. If Shagrat has four Item boons attached to him in a four-player campaign, it's possible to lose all the item boons from the beginning of The Road Darkens (though one-shot boons could be used instead), which would really hurt. In my thematic campaign I'll play this quest solo, and I plan to lose Mithril Shirt to reflect the books. I expect it won't be too hard to kill Shagrat, but if you think you might lose the boons and you want to game the rules, I think you could include Palantir of Orthanc in your deck if you have it (even though you can't play it).\n\nIf you don't play the final two quests in epic multiplayer mode, the second quest gives the opportunity to remove Wraith on Wings burdens, but taking the time to do that might mean you don't survive as many rounds. (It seems that The Black Gate combos with another card to increase the number of encounter cards revealed each round by 1, which will make surviving many rounds very difficult. The best option to power-game this unwinnable scenario might be a degenerate combo deck that recurs Out of the Wild to remove the entire encounter deck, although even then threat would go up by at least 2 each round from The Black Gate and the refresh phase, less 1 from threat reduction.) Since the burden set for Wraith on Wings is included in Mount Doom, there's a decent chance it will be included in The Tower of Cirith Ungol. That would make sense, since when the Watchers wailed after Sam and Frodo escaped, a winged Nazgûl replied and swooped down, hunting them.\n\nI love how important threat is for Fortitude tests, and also how Fortitude tests can only use heroes (further encouraging a thematic focus on heroes in this quest). The article indicates that there will be multiple ways to support the Ring-bearer leading up to the final Fortitude test (including, of course, buying more time and easing pressure with The Black Gate Opens). I'm sure Gollum will be part of this, but at the moment the ending appears unthematic. The players lose if the Ring-bearer claims the Ring, but in the books the Ring was destroyed only after Frodo had claimed the Ring. On Discord, PocketWraith suggested that there might be two different versions of the final stage, and the version shown is used only if Gollum is dead (assuming there's an option to kill him during the final quest). If Gollum is alive, however, and the final Fortitude test is failed, then there's a fallback way to win. That would fit with what Gandalf told Frodo at the beginning of The Fellowship of the Ring:\n\n> Quote\n> \n>  \n> \n> My heart tells me that [Gollum] has some part to play yet, for good or ill, before the end; and when that comes, the pity of Bilbo may rule the fate of many - yours not least.\n> \n>  \n\nEven if PocketWraith is correct (or there's some other mechanic that enables Gollum to convert a failed Fortitude test into a success), I'm not thrilled with the idea of the Ring-bearer completing his quest out of sheer willpower/fortitude. It doesn't fit with Tolkien's theme of eucatastrophe,  namely unlooked-for victory snatched from the jaws of defeat. It letter 246, Tolkien writes about Frodo's failure to destroy the Ring, and  how victory depended on the mercy shown to Gollum:\n\n> Quote\n> \n> At the last moment the pressure of the Ring would reach its maximum - impossible, I should have said, for any one to resist, certainly after long possession, months of increasing torment, and when starved and exhausted. Frodo had done what he could and spent himself completely (as an instrument of Providence) and had produced a situation in which the object of his quest could be achieved. His humility (with which he began) and his sufferings were justly rewarded by the highest honour; and his exercise of patience and mercy towards Gollum gained him Mercy: his failure was redressed.\n\nOf course, eucatastrophe (and not achieving victory on your own) can be difficult to translate into game mechanics. I hope, however, that mercy towards Gollum which helps to destroy the Ring is a significant part of the campaign's final quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2921526","commentId":2921526,"userName":"dalestephenson","timestamp":1502373194,"content":"Here's the description of the eye from the Mirror of Galadriel:\n\n\"The Eye was rimmed with fire, but was itself glazed, yellow as a cat's, watchful and intent, and the black slit of its pupil opened on a pit, a window into nothing.\"\n\nThis doesn't say that the eye is \"cat like\", only that it is yellow as a cat's, but since the pupil is a slit I think the vertical narrow black pupil is typically chosen.  I would agree that it should be a glazed yellow surrounded by fire rather than giving the impression of fire within the eye itself, though if you do interpret the eye as being cat like, the mottling effect may not make a yellow eye very distinguishable from yellow fire.\n\nThe encounter back could be lifted from Jackson's eye, but the novel part of Jackson's lidless eye isn't how the eye is depicted -- it's making it huge and visible at the top of Barad-Dur, the entirety of Sauron's physical presence.  This is inconsistent with the text -- but the back of the encounter cards are restricted to the eye itself -- the only part of Sauron we see, fleetingly, in the text.\n\nI don't consider plate mail in Middle Earth to be a Jackson innovation, either.  This had already entered Middle Earth art before Jackson, I suspect filtering back from the high fantasy tropes inspired by Tolkien.  One card with \"Citadel Plate\" isn't going to attract Jackson fans to the game, an anachronism (nearly every armor in the text is clearly ring or chain mail) that wouldn't raise an eyebrow for any high fantasy reader.  What would attract Jackson fans are cards that clearly invoke *only* the movie, and that means mirroring the depictions of the *characters* in it (or worse, adding Jackson-invented characters to the game).  This the game clearly does not do.\n\nI think it's reasonable to challenge the artistic depiction of a number of cards in the game as being out of place for Middle Earth.  But the most recent AP gave as hero named Fastred for a cycle that ends at the Crossing of Poros--that doesn't happen accidentally.  The attention to textual detail in this game I find thoroughly remarkable, and not at all based on the (distracting and unnecessary) changes made by Jackson in his movies.\n\nEdited August 10, 2017 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2921762","commentId":2921762,"userName":"GrandSpleen","timestamp":1502380641,"content":"There are a few hero cards that resemble the actors from the movies.\n\nPersonally I don't have a dog in this race, but on the whole I don't think the card art is heavily inspired by the movies.  There are traces of it often, but it's not the main thrust of the artwork.  And certainly there are pieces of art that look to have been neatly lifted out of a still frame from the movies, I won't contend that.;"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2922906","commentId":2922906,"userName":"rbaker1978","timestamp":1502425475,"content":"> 23 hours ago, Estel Edain said:\n> \n> Even if PocketWraith is correct (or there's some other mechanic that enables Gollum to convert a failed Fortitude test into a success), I'm not thrilled with the idea of the Ring-bearer completing his quest out of sheer willpower/fortitude. It doesn't fit with Tolkien's theme of eucatastrophe,  namely unlooked-for victory snatched from the jaws of defeat. It letter 246, Tolkien writes about Frodo's failure to destroy the Ring, and  how victory depended on the mercy shown to Gollum:\n> \n> Of course, eucatastrophe (and not achieving victory on your own) can be difficult to translate into game mechanics. I hope, however, that mercy towards Gollum which helps to destroy the Ring is a significant part of the campaign's final quest.\n\nI completely agree with this, and really hope that there's more to winning or losing the scenario (and campaign!) than what Caleb wrote. Much of the time, I've felt the designers' have translated Tolkien's vision and theme in some clever, insightful ways. This news left me feeling disappointed.\n\nIt reminds me very much of the end of DM of the Rings [http://www.shamusyoung.com/twentysidedtale/?p=1297], where the author pokes fun of the idea of an entire campaign simply won or lost on a single roll."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2923239","commentId":2923239,"userName":"dalestephenson","timestamp":1502454950,"content":"If we want to be true to the text, no amount of Frodo's willpower should enable him to throw the ring into Mount Doom.  Frodo was incapable of throwing the ring into his own harmless fire at the very beginning of the work; his long travels with the ring had only made doing so much, much more difficult.\n\nStill, a fortitude check seems appropriate -- Frodo's great accomplishment was getting the ring to Sammath Naur, where a miracle could happen.  Yes, his mercy shown to Gollum enabled Gollum to play his role -- and Sam's mercy likewise on Mount Doom.  But in my opinion, the voice coming out of the fire at Frodo's breast was the will of the ring itself, promising Gollum \"If you touch me ever again, you shall be cast yourself into the Fire of the Doom.\"  It was the hubris of the ring itself that foreordained its own destruction.  I don't know a good way to simulate that with game mechanics.\n\nEdited August 11, 2017 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2923244","commentId":2923244,"userName":"sappidus","timestamp":1502455181,"content":"> On 8/8/2017 at 5:45 PM, sappidus said:\n> \n> N.B.: Of course we've gotten wind of this in interviews and product codes before, but always nice to see spelled out...\n\nA minor additional note, from the FFG interview with their head Andrew Navaro (who's apparently been installed since the beginning of the year? I sure didn't know), put on their site yesterday:\n\n> Quote\n> \n> Long term, I’m looking forward to building on the great success of FFG, to continuing to be a valuable licensee for our great partners like Lucasfilm, Middle-earth Enterprises, Bethesda, 2K, and George R.R. Martin by making lavish, richly themed games that push the boundaries of what most people expect from licensed products...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2923519","commentId":2923519,"userName":"Bullroarer Took","timestamp":1502467676,"content":"That IS good to hear.  I just hope their parent feels the same way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2923563","commentId":2923563,"userName":"Rouxxor","timestamp":1502469740,"content":"There is, each year a lot of LOTR games made by FFG. Even without our LCG it make sense to guarantee to continue to work with middle-earth material."},{"commentUrl":"https://community.fantasyflightgames.com/topic/255882-journeys-end/?do=findComment&comment=2923603","commentId":2923603,"userName":"donkler","timestamp":1502471361,"content":"> 4 hours ago, sappidus said:\n> \n> A minor additional note, from the FFG interview with their head Andrew Navaro (who's apparently been installed since the beginning of the year? I sure didn't know), put on their site yesterday:\n> \n>  \n\nI believe this is the video: \n\n\n\n \n\n \n\nIt's interesting they mention how nice it is in games like Netrunner where you can always \"click\" for cards or resources. I often wish there was something similar in LotR to smooth out those bad draws where you don't get your card draw/resource engine pieces in your opening hand."}]}