{"url":"https://community.fantasyflightgames.com/topic/256153-placing-progress-counter-on-location-and-quest-card/","title":"Placing Progress Counter on location and quest card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/256153-placing-progress-counter-on-location-and-quest-card/?do=findComment&comment=2925009","commentId":2925009,"userName":"Emilius","timestamp":1502570745,"content":"Hello, I have a doubt!\n\nI'm at stage 3B of The Siege of Annuminas.\n\nThe quest card say: \"Progress cannot be placed here while Battering Ram is in play\"\n\nBattering Ram is a location with 5 progress point to clear it.\n\n \n\nMy question is:\n\nif I quest succesfully with a result of +15, can I put the eccessing 10 progress on the quest card or I need to win the next questing phase?\n\n \n\nIn others words:\n\n- the progress are put simultaneously, so I can't put progress on the quest because the location is stil in play?\n\n- or first I have to put progress on the location, explore and discard it and then put the remaining progress on the quest?\n\n \n\nThank you for your reply"},{"commentUrl":"https://community.fantasyflightgames.com/topic/256153-placing-progress-counter-on-location-and-quest-card/?do=findComment&comment=2925069","commentId":2925069,"userName":"NathanH","timestamp":1502574216,"content":"A ruling for a similar situation in The Thing In The Depths allows you to place the remaining progress on the Quest. The sequence for placing progress, exploring locations, and so on, is rather non-intuitive. As far as I can tell, it goes\n\n1) Calculate progress tokens to be placed\n\n2) Resolve any Responses to questing successfully\n\n3) Place progress on the active location\n\n4) If enough progress is placed, remove the location from play\n\n5) Place remaining progress on the quest\n\n6) Progress to the next quest stage if appropriate.\n\n7) Resolve any When Revealed effects from the new quest stage\n\n8) Resolve any Responses to the quest being completed, if appropriate (e.g. The Long Defeat)\n\n9) Resolve any Responses to the location being explored, if appropriate (e.g. Ancient Mathom)\n\n \n\nSomewhere in there is \"Resolve any Responses to progress being placed on the active location\" and \"Resolve any Responses to progress being placed on the quest\" but I don't know where they fit in exactly.\n\nEdited August 12, 2017 by NathanH"}]}