{"url":"https://community.fantasyflightgames.com/topic/256737-first-player-elimination-timing-question/","title":"First Player Elimination timing question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/256737-first-player-elimination-timing-question/?do=findComment&comment=2938681","commentId":2938681,"userName":"JYoder","timestamp":1503202500,"content":" \n\nI'm playing Fords of Isen (two-handed) which has the Grima ally-objective that moves with the first player. (His card says, \"If free of encounters, the first player gains control of Grima.\")\n\nDuring staging, I drew a card that eliminated the first player. The rules say when a player is eliminated \"his hands, all of the cards he controls, and his deck are placed in their owner's discard piles.\" So I assumed I lost, as Grima is considered under the control of the first player.\n\nHowever, the FAQ (1.30) says, \"If the player with the first player token is eliminated, the first player token immediately passes clockwise to the next eligible player.\" The \"immediately\" seems to imply the token (and therefore Grima) first moves to the next player, making it possible for that player to still win.\n\nSo which happens first when a player is eliminated -- the passing of the first player token, or all cards you control are discarded?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/256737-first-player-elimination-timing-question/?do=findComment&comment=2938772","commentId":2938772,"userName":"Emilius","timestamp":1503209930,"content":"All cards you control are discarded in the same time (when) you are eliminated, so Grima included.\n\nThen the first player token passes to next player, but in this situation you lost \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/256737-first-player-elimination-timing-question/?do=findComment&comment=2939989","commentId":2939989,"userName":"sappidus","timestamp":1503282673,"content":"> 20 hours ago, Emilius said:\n> \n> All cards you control are discarded in the same time (when) you are eliminated, so Grima included.\n> \n> Then the first player token passes to next player, but in this situation you lost \n\nI'm basically just seconding this via Caleb's explicit words to me when I asked him about this once:\n\n> Quote\n> \n> If a player is eliminated while in control of something like The One Ring or an objective-ally with game text that will cause the players to lose if it leaves play, then the players will lose the game because all of the cards under that player's control are immediately removed from the game when he is eliminated.\n> Cheers,\n> Caleb\n\n(N.B.: I do think Caleb misspoke slightly here -- you don't RFG attachments owned by other players, for example -- but in any case, the developer intent is clear.)"}]}