{"url":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/","title":"Is random good or bad for a co-op card game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2945928","commentId":2945928,"userName":"John Constantine","timestamp":1503498114,"content":"Hi. I'm still doing that Innistrad MtG mod for LotR LCG I mentioned long ago. And while doing it, I met an interesting dilemma. \n\nNow, before I continue, I want you to know that I consider any kind of additional (printed) random on cards in competitive card games like Thrones or Netrunner a cancer, and absolutely despise it in any form.\n\nBut co-op is a whole another realm, and one with lots of possibilities. So I wanna ask - would you actually prefer or scorn printed random effects in a co-op card game? On player cards? On encounter cards.\n\n \n\nTo provide an example, I'll give you a weapon that in original MtG transforms into the demon once the weilder damages the opposing player. In co-op realm, however, I decided to make it a very powerful weapon which harms owner every time it is used. Here is a non-RNG version:\n\nnewR5Iu.jpg [http://i.imgur.com/newR5Iu.jpg]\n\nIt provides stable cost to each attack within your choice of a card being discarded each strike.\n\n \n\nAnd here is a RNG variant:\n\nc5KqaPs.jpg [http://i.imgur.com/c5KqaPs.jpg]\n\nIt boasts bigger attack value, but every card you discard is random and there is a chance that you'll accidentely lose this weapon and summon a powerful demon to prey on you, making using this weapon a dance with the Devil it's supposed to be.\n\n \n\nSo, what do you think on the whole topic?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2946010","commentId":2946010,"userName":"dalestephenson","timestamp":1503500106,"content":"I think the first card is clearly more useful.  1 extra attack isn't worth the chance your attachment will spontaneously combust and launch an enemy besides.\n\nBut terrible consequences aside, discarding a \"random\" card instead of a chosen card is certainly acceptable for a co-operative game, Mirror of Galadriel does exactly that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2946044","commentId":2946044,"userName":"Calvadur","timestamp":1503500793,"content":"As a Hearthstone player: I hate random discards (from my hand). Card games already feature a ton of randomness, what defenitly is part of their charm, but I think whenever you can, you should give the player the choice what he wants to do.\n\nThe lotr LCG already features random discards and I think all of them are effects that punish the player. And that is fine, because you will feel punished most of the times you don't discard exactly the card you wanted to. \n\nTo sum it up: Encoutercards (and to an extend quest cards) can do whatever they want as they aren't ment to care for my feelings. Playercards however I prefer low on randomness. Even powerful stuff like a very good tale I didn't use for some time because discarding random cards felt bad to me (I am over this now :D) and discarding hand cards is on an whole other level. \n\nIt surely is possible to make good/useful or fun cards with random effects, I just wanted to say that I personally don't like them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2946194","commentId":2946194,"userName":"donkler","timestamp":1503503535,"content":"I think Randomness is fine as long as it doesn't exist in a vacuum and leads to interesting player choices. A Very Good Tale has a random element, but you probably aren't going to choose to include it unless you have a deck stacked with lots of allies. I think the second Elbrus is on the better side of randomness since you can change your odds by having a large hand of cards. Like if it was just something like roll a D6 and on a 6 something bad happens I think that is far less interesting than something that interacts with existing game mechanics."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2946424","commentId":2946424,"userName":"dalestephenson","timestamp":1503510029,"content":"The problem with the second Elbrus card is that the effect is so punishing that I doubt Elbrus would be used.  I've found Mirror of Galadriel an exceedingly useful card, but if it self-destructed and spawned an enemy if the \"wrong\" card was randomly discarded, I wouldn't use it.  I don't think there's anything inherently wrong with a risk/reward player card, but if the risk side is too high it may be a dead card, and that's bad.\n\nThere's also a bit of ambiguity in recognizing whether the card you choose was the one randomly discarded.  If I have three Sneak Attacks in my hand, and a Sneak Attack gets discarded, did it discard the one I picked or not?  This could be resolved by different wording (e.g. \"same name\"), of course.\n\nPlayer card randomness need not be constricted to discarding random cards or from top of deck, of course.  Ravens of the Mountains, used blind, generates 0-N progress tokens while peeking at the top card of the encounter deck.  This sort of variable benefit associated with what's otherwise a positive thing (peeking at the top encounter card) is interesting, though given the extra cost of the card (hero exhaustion) it's not likely to be used blind.\n\nAny deck including multiple copies of a unique card signals a preference for consistency over variability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2947660","commentId":2947660,"userName":"John Constantine","timestamp":1503560575,"content":"Just to be clear, +4 attack is helluva lot, usually a 1-cost weapon gives +1 attack, with an additional ability, or an opportunity for conditional another +1 attack. Also, in my revised set of rules, given character cannot have more than 1 Weapon equipped at a time.\n\nThat said, the \"+4 attack summon a demon on fail\" version currently resides in a folder called \"Trash\", while the \"+3 stable\" version is among other cards preparing to release. I don't like random, and I didn't make a single other random card yet, this Elbrus just reminded me a lot of Standpoint Demon from Pathfinder ACG (there was an item that scried, but you rolled a d20 each time and on 1 you lost the card forever and summoned a huge freaking demon), so I took the opportunity to design an alternative random version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2947978","commentId":2947978,"userName":"dalestephenson","timestamp":1503578502,"content":"+4 attack is a lot.  It's not a lot more than +3 attack, so the first version of Elbrus is much more attractive.  However, if the second Elbrus were the only version available, I likely wouldn't use it, and a revised rules allowing only one weapon would make me want to use it even less.  I'd like it more if the benefit and penalty were framed as a response rather than forced.  If you don't want to use Mirror of Galadriel because of the forced discard, you just don't use it.  If you want to avoid the forced discard, you *can't attack*, and that's no small thing when this card is intended for dedicated attackers.  Still, the forced discard and even a random discard aren't a dealbreaker to me because the attack value is so high -- it's the self-destruction and enemy spawning that I really don't like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2948203","commentId":2948203,"userName":"Bullroarer Took","timestamp":1503584816,"content":"Without going in to the power of the card, we already have a number of encounter card effects that are random, including discarding a random card from your hand. So I don't think that in particular is a problem.  In general I too believe that card games are games of \"managed probability\" and pure random effects should be used very sparingly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2948539","commentId":2948539,"userName":"Willange","timestamp":1503591749,"content":"> On 8/23/2017 at 9:06 AM, Calvadur said:\n> \n> As a Hearthstone player: I hate random discards (from my hand). Card games already feature a ton of randomness, what defenitly is part of their charm, but I think whenever you can, you should give the player the choice what he wants to do.\n\nHello\n\n- Discard Warlock Player"},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2953264","commentId":2953264,"userName":"John Constantine","timestamp":1503763228,"content":"> On 24.08.2017 at 3:41 PM, dalestephenson said:\n> \n> +4 attack is a lot.  It's not a lot more than +3 attack, so the first version of Elbrus is much more attractive.  However, if the second Elbrus were the only version available, I likely wouldn't use it, and a revised rules allowing only one weapon would make me want to use it even less.  I'd like it more if the benefit and penalty were framed as a response rather than forced.  If you don't want to use Mirror of Galadriel because of the forced discard, you just don't use it.  If you want to avoid the forced discard, you *can't attack*, and that's no small thing when this card is intended for dedicated attackers.  Still, the forced discard and even a random discard aren't a dealbreaker to me because the attack value is so high -- it's the self-destruction and enemy spawning that I really don't like.\n\nBy the way, I forgot to ask. You said that the fact that each character being able to have only 1 weapon makes you want Elbrus even less, but this doesn't makes any sense to me, because having only 1 available weapon slot per character makes higher attack weapons more desirable. Why did you say that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2955488","commentId":2955488,"userName":"ppsantos","timestamp":1503898549,"content":"I'm against fiddly randomness like this, as it might complicate the game and would undoubtedly prolong the game (even for just a few seconds, due to 'mechanical' operation).  It's at least a 2-step process, possibly 4.  You choose, and you randomly discard.  Then possibly, spawn and discard weapon. Of course, there is this incentive not to 'randomly discard' the chosen card (But that's up to the player's honesty).  There might be unintended consequences/interaction (in future encounter/quest cards, maybe?)  when an enemy engages you, or when an attachment is discarded, etc.\n\nThe other problem I see is the usefulness of the card.  If I only have one card in hand, then it's guaranteed the enemy will be spawned.  If I have 2, then 50%, and 3, 33%, etc.  Usually, in my games, I only have very few cards in hand, so there's a high chance  I might trigger the spawning,   What happens if I dont' have any cards in hand when I attack?\n\nSpawning an enemy token is off the spirit of the game.  Usually, bad things are conveyed via threat increase, signifying 'corruption'.  Would it be more in keeping with the spirit of the game if the negative effect is via threat increase?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2955636","commentId":2955636,"userName":"John Constantine","timestamp":1503911630,"content":"Well, it's in color blue, which is not known for it's weapons. Or attack capabilities for that matter, so attack value this big is very enticing.\n\nIn my mod, you draw 2 cards per turn, and card draw is not hardcoded into one sphere, so there will be less likely scenarios of having no cards in hand, however I think in situation with 0 cards in hand the weapon may be used without the chance of summoning an enemy.\n\nI don't think what you're saying has anything to do with the spirit of the game, because the same can be easily said about a lot of mechanics that original lotr already has, like seeding player cards into the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2955781","commentId":2955781,"userName":"dalestephenson","timestamp":1503924040,"content":"> On 8/26/2017 at 0:00 PM, John Constantine said:\n> \n> By the way, I forgot to ask. You said that the fact that each character being able to have only 1 weapon makes you want Elbrus even less, but this doesn't makes any sense to me, because having only 1 available weapon slot per character makes higher attack weapons more desirable. Why did you say that?\n\nIt also makes randomly self-destructing and self-punishing weapons less desirable.  YMMV."},{"commentUrl":"https://community.fantasyflightgames.com/topic/257039-is-random-good-or-bad-for-a-co-op-card-game/?do=findComment&comment=2955786","commentId":2955786,"userName":"John Constantine","timestamp":1503924194,"content":"> 1 minute ago, dalestephenson said:\n> \n> It also makes randomly self-destructing and self-punishing weapons less desirable.  YMMV.\n\nBut it also makes high attack weapon more desireable, because you no longer can stick one character with two weapons."}]}