{"url":"https://community.fantasyflightgames.com/topic/258303-several-questions/","title":"Several questions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975597","commentId":2975597,"userName":"Rajam","timestamp":1504922447,"content":"About 'The Three Trials' quest:\n\nIf the last trial (2A-2B quests) you finish is \"Trial of Strength\" by defeating the respective guardian during combat phase, you'd then move onto stage 3, in which all guardians come back and engage you (I'm assuming solo play); you'd advance quest stages during combat phase, and my question is: do the just-added-guardians attack you asap? can you attack them asap?\n\n---\n\nHow was it that \"double-Guarded\" work? (you reveal a Guarded objective, and the encounter card revealed to guard it is another objective with the Guarded keyword) \n\n---\n\nDuring questing, there is only 1 card remaining in the encounter deck. It has \"Surge\". I'm assuming you immediately shuffle the discard pile and then reveal another card; my question is: the last card revealed before shuffling is also shuffled, or remains in the discard pile? Same question for sailing test: what happens if you commit, for example, 6 characters to a sailing test and there's only 4 cards in the encounter deck?\n\n---\n\nAbout Elevenses + Hobbit Pony:\n\nYou commit three hobbit heroes to the quest. After the staging step, you play Elevenses [http://ringsdb.com/find?q=elevenses]. Then, before quest resolution, you commit some Hobbit heroes again to the quest with Hobbit Pony [http://ringsdb.com/find?q=hobbit+pony]. Is this legit?\n\n---\n\nWhen enemies revealed from the encounter deck make immediate attacks, do you have an action window to prepare your defense (ready characters, play events, etc)? Can you attack them back?\n\n \n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975645","commentId":2975645,"userName":"RichardPlunkett","timestamp":1504925089,"content":"For the Trials. If you progress the quest by destroying an enemy (and presumably adding it to the victory display) during one of your attacks, then you are still in the combat phase, but more particularly in the part of the combat phase where you are allowed to declare attacks.\n\nThis means these enemies can be attacked and that they have missed their chance this round to attack you.\n\nEven the one that you just killed can be attacked, since it has left play and returned so its considered a new copy of the card, and thus you haven't declared an attack against it yet this turn.\n\nHowever, this all does suppose you kill the guardian during one of your attacks, if you kill it at some other time eg. with an event card or Gondorian Spearman, then a different result would occur."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975650","commentId":2975650,"userName":"RichardPlunkett","timestamp":1504925249,"content":"Re Double-Guarded: answer withdrawn, see GrandSpleen below for correct answer\n\nEdited September 9, 2017 by RichardPlunkett"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975656","commentId":2975656,"userName":"RichardPlunkett","timestamp":1504925540,"content":"About Elevenses + Hobbit Pony:: Yep you are complete fine with that. Elevenses has left your hobbit Ready and non currently committed to the quest, which are the two effective requirements to trigger the Hobbit Pony."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975670","commentId":2975670,"userName":"RichardPlunkett","timestamp":1504926201,"content":"Re:: When enemies revealed from the encounter deck make immediate attacks, do you have an action window to prepare your defense (ready characters, play events, etc)? Can you attack them back?\n\n1) Yes, you have an action window to prepare defenses.\n\nFrom the FAQ:: (1.28) Enemy attacks outside of the combat phase\nIf an enemy attacks outside of the combat phase, it is still dealt a shadow card at the beginning of the attack. Then follow the 4 steps under Phase 6 “Combat” in the rules. There is an action window after each step. Any shadow cards dealt to the attacking enemy are discarded after the attack resolves.\n\nThe four steps it's referring to are the \"resolving enemy attacks\" steps on page `18. Note the first of these four steps is \"choose an enemy\" which is completely redundant since the enemy has been forced, but you still get the action window that comes with it. That said, you probably don't get an action window before the shadow card is dealt, but you definitely get one before you have to declare a defender.\n\n2) No, you can't attack them back. This is just a single enemy attack, not a whole attack phase.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975719","commentId":2975719,"userName":"GrandSpleen","timestamp":1504928585,"content":"The rule book says: if you have a Guarded keyword and have a guarded objective come up as the reveal, you put that objective in the staging area (you don't attach it to the original card).  Then you reveal another card and use that as the guard for the original guarded keyword.  After you're done with that, remember that the guarded keyword says you are revealing a card, so now you also have to resolve the Guarded keyword on that second objective.  So no, you don't end up with a 3-card chain, you'll end up with 2 separately guarded objectives.\n\n\"If another objective card comes up\nwhile attaching a card for the guarded keyword, place\nthe second objective in the staging area, and use the\nnext card of the encounter deck to fulfill the original\nkeyword effect.\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2975725","commentId":2975725,"userName":"GrandSpleen","timestamp":1504928834,"content":"As for reshuffling in the quest phase on a Surge card: I believe reshuffling the encounter take takes precedence over other actions.  So you'd reveal the last card, then immediately reshuffle before resolving any of its effects.  If that was an event card, it will wind up in the now empty discard pile after being resolved -- not reshuffled into the deck.\n\nSailing tests are different. The Grey Havens manual says you reshuffle the deck BEFORE the sailing test, if you determine there are not enough cards to complete your sailing test.  So, you'd reshuffle it after you commit characters to the test:\n\n\"If the encounter deck does not\ncontain enough cards to look at, shuffle the encounter discard\npile back into the encounter deck first.\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2976071","commentId":2976071,"userName":"PocketWraith","timestamp":1504964315,"content":"Hmm. I was sure there was a ruling saying that when the last card of the encounter deck was revealed, you finished resolving its effects before reshuffling (unless a reshuffle would required in order to resolve the card's effects). However I can't find this ruling. I don't think I imagined it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2976184","commentId":2976184,"userName":"Rouxxor","timestamp":1504969491,"content":"As I remember there was first the GrandSpleen ruling, who was overuled by the one that PocketWraith say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258303-several-questions/?do=findComment&comment=2976487","commentId":2976487,"userName":"GrandSpleen","timestamp":1504984878,"content":"Hmm, well its counterintuitive to me to have a \"do this unless this\" for a core game mechanic.  Sure there are plenty of counterintuitive rulings in LotR, but if I can avoid one more, I'll try to do so..."}]}