{"url":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/","title":"Added to Staging Area meaning","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=2978905","commentId":2978905,"userName":"JYoder","timestamp":1505160055,"content":" \n\nCan a trigger for when an enemy is \"added to the staging area\" only occur when it first enters play? Or does it also trigger when sent back to the staging area (such as via Guardian of Ithilien or Fastred)?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=2978936","commentId":2978936,"userName":"NathanH","timestamp":1505160855,"content":"I think that being added to the staging area is something that occurs only when a card enters play and is distinct from \"enters the staging area\" which can happen later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=2979120","commentId":2979120,"userName":"JYoder","timestamp":1505166013,"content":" \n\nIndeed, via FAQ 1.35, that's how I understand \"enters the staging area\" -- it's applicable in various scenarios. However, I'm not convinced about \"adding\" being different... but I'm not unconvinced either. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nI lean toward what you say, but wondered if there's an official ruling somewhere.\n\nThe FAQ (pg 13) says \"adding\" is the same as \"placing\", though I believe that ruling has been for encounter cards that reveal or add/place a card into the staging area. I understand those. But I'm not so clear on player cards that use the \"added\" wording.\n\nFor instance, if when Fastred returns an enemy to the staging area, then if that's considered \"adding\"/\"placing\" that card, then ally Anborn Leadership (or Fresh Tracks) could trigger to give it a wound.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3261378","commentId":3261378,"userName":"GrandSpleen","timestamp":1522042060,"content":"Any other insights on this? I might send in a rules question.  Was just thinking about Fastred/Anborn myself and couldn't come up with an answer in the FAQ, then I found this old thread."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3261579","commentId":3261579,"userName":"Wandalf the Gizzard","timestamp":1522068077,"content":"I don’t know for sure, but I’d be surprised if added to and entering the staging area are the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3261980","commentId":3261980,"userName":"Authraw","timestamp":1522084012,"content":"Heh, that's funny, since I'd rule that \"added to the staging area\" and \"enters the staging area\" are the same event. Sounds like a good candidate for a question!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3262317","commentId":3262317,"userName":"GrandSpleen","timestamp":1522094977,"content":"Submitting now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3262591","commentId":3262591,"userName":"CJMatos","timestamp":1522106094,"content":"From FAQ:\n\n(1.35) “Enters the staging area”\n\nEnters the staging area is a term that applies to a card (enemy, location, objective, etc) that is placed in the staging area.\n\nThis term applies whether the card in question has been revealed from the encounter deck, placed in the staging area from out of play, returned from the discard pile or from engaged with a player, or by other means.\n\n \n\nFrom FAQ page 14:\n\nQ: What is the difference between “adding” a card to the staging area versus “placing” a card in the staging area?\n\nA: There is no difference between “adding” a card to the staging area versus “placing” a card in the staging area. These words are used interchangeably and mean the same thing in all instances.\n\n \n\nWith these in mind, i would say that entering staging area and adding to stagging area is the same and, thus, any effect that trigger by entering the staging area would trigger despite the place where the card came from (engagement, discard, encounter deck, victory pile, etc).\n\n \n\nOn the other hand, an effect that needs the card to be revealed only occurs if the card comes from encounter deck or if the effect that places that card in staging area specifically uses the word \"reveal\"\n\n(1.45) “Reveal” vs “Reveal and add”\n\nAny time encounter cards are “revealed” from the encounter deck, the players should follow the rules for staging as explained on page 14 of the rulebook and rule (1.39) of this document.\n\nIf a card effect uses the phase “Reveal and add to the staging area”, it means the same as simply using the word “reveal”, and the above steps should still be followed (i.e. treachery cards should still be discarded after resolving its effects, unless otherwise indicated by the card’s text)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258460-added-to-staging-area-meaning/?do=findComment&comment=3262755","commentId":3262755,"userName":"GrandSpleen","timestamp":1522122012,"content":"And the result: \n\n-----------\n\n\nWhen an enemy is ‘returned’ to the staging area, it is not ‘added.’ Enemies are added to the staging area after they are revealed by the encounter deck, or put into play by an effect. Essentially, for an enemy to be ‘added’ to the staging area, it has to originate from some out-of-play state.\nCheers,\nCaleb\n\n------------\n\nSorry, no janky Fastred/Anborn decks..."}]}