{"url":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/","title":"Are these good sleeves for this game? (Newbie sleever)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2983864","commentId":2983864,"userName":"JYoder","timestamp":1505425406,"content":" \n\nI don't want to sleeve my cards -- I like the feel of them -- but it seems the time has come where I have to. After years of playing, scuffing is occurring more and more on the back edges, and some are getting a bit \"sticky\", which seems odd and I'm not sure why. (Is that normal or odd?) I'm new to sleeves and have read various posts here trying to figure it all out. What I do know...\n\n1) I only want to sleeve my player cards.\n\n2) I want clear sleeves.\n\n3) I don't want penny sleeves as I don't want to keep replacing them, nor do I want really expensive ones.\n\n \n\nThat said, after some digging, I'm wondering about these at the Amazon link below...\n\nhttps://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear [https://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear]\n\nSome questions...\n\n1) Do they fit the LotR cards well?\n\n2) Are they pretty good sleeves that I shouldn't have to replace often?\n\n3) Is this a good rate for these at the Amazon price? (600 for $26.60)\n\n \n\nIf the answer is \"Yes\" to those 3 questions, I believe if I got 4 of these (2400 sleeves) it would take care of all my player cards. I hate to spend $100, but if it saves my all-time favorite game, then it's a worthwhile investment. Thanks.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2983896","commentId":2983896,"userName":"Maktorius","timestamp":1505426819,"content":"You need the 63x88 mm sleeves, the same as magic the gathering. I've tried a bunch of models and found Dragon shield matte clear to be clear favourites. They have clear front but textured back (minimizes stickiness). Their models without textured back seems to become sticky. \n\nKMC hyper mattes are generally of the same quality but a bit tighter fit and more expensive (in Sweden). Actually their super fit inner sleeve, which is cheap, is usable as is, but might get a bit sticky.\n\nI think all Ultra pro I've gotten had issues, though I have not tried their newest model.\n\nMayday premium are fine, but edges are a bit sharp and pretty much priced as Dragon shields here. They aren't textured, but not that sticky anyway.\n\nI'll ad more later if I remeber."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2983935","commentId":2983935,"userName":"Bullroarer Took","timestamp":1505428536,"content":"Those sleeves are fine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2984159","commentId":2984159,"userName":"JYoder","timestamp":1505444712,"content":" \n\nMaktorius -- In measuring the LotR cards, they are 62.5 x 88.5.  How can they fit in a 63 x 88 sleeve? Or is that not the actual sleeve measurement, but the size of card it allows?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2984308","commentId":2984308,"userName":"Rouxxor","timestamp":1505460789,"content":"The sleeve you link are those indicated by maktorius. It is the measurement of the sleeves. The 0.5 and 2.5 mm are the mandatory margin. I'm personally find them very easy to broke so I need to change some very often. Dragon shield are way more strong but also really more expensive. To me the others are not in competition because of the complexity of finding the same sleeves the next time you want them or just because they are low quality regarding their price.\n\nI also advice you not to order on amazon, but it is not about price or quality but about company who don't give enough respect to they employees."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2984413","commentId":2984413,"userName":"monkeyrama","timestamp":1505470328,"content":"FWIW I use Ultrapro penny sleeves for my encounter decks and haven't had any issues, but I use FFG sleeves for my player cards. I can't recall now why I made that decision."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2985196","commentId":2985196,"userName":"JYoder","timestamp":1505503397,"content":"> 8 hours ago, Rouxxor said:\n> \n> The sleeve you link are those indicated by maktorius. It is the measurement of the sleeves. The 0.5 and 2.5 mm are the mandatory margin.\n\nI don't follow. The sleeves I linked say they are 66mm x 91mm, so how can they be the same as those indicated by Maktorius when he said 63x88. (Sorry, but this is all new territory for me.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2985468","commentId":2985468,"userName":"Rouxxor","timestamp":1505516356,"content":"You right. They are two sizes announced here. So let see what we got:\n\n1- What you talk about is 66x91 (approximately, each brand have a small difference). They are the most common sleeves for card games and the one I recommend you to buy. I get all my LoTR cards in sleeves of this sizes (quests in ultra pro, decks in dragon shield). There is a chance that maktorius speak about this since clear matte is a reference of sleeve of this size\n\n2- There is also smaller sleevees (among 64x89) who are made to sleeve cards that are on a binder, or to put two sleeves on each cards (like for really expensive cards). They are not made for be played alone but some people do it anyway. It won't protect well the cards so even if it is cheaper so I would not recommend it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2985738","commentId":2985738,"userName":"Khamul The Easterling","timestamp":1505545201,"content":"Hey there JYoder, \n\nI totally understand the balance of wanting a nice sleeve yet not too expensive.  I needed to sleeve my 3,000+ cardpool and I ended up going with this option https://www.miniaturemarket.com/mdg7105.html [https://www.miniaturemarket.com/mdg7105.html]\n\nI honestly was a little skeptical, but after much research, these seemed like a good option, so i went with them.  After using them for quite some time, I am extremely happy with the fit, the durability, and the feel.  I was curious if they would easily split or rip as many cheap sleeves do, so I used a couple sleeves as a test, and after tugging, pulling, and putting significant force attempting to tear them, they refused to split or tear.  Overall, I am very happy with them, and they get the job done and then some.  As far as the price goes, Im not sure how many sleeves your looking to buy, but if you were to compare to the Ultra Pro's you have linked above, these would come out to $7 for 600 sleeves compared to the $26 price tag on the ultra pros.  \n\nI do hope this helps and best of luck on your sleeving mission!;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2985923","commentId":2985923,"userName":"Rouxxor","timestamp":1505570436,"content":"The ones you mention are very thin so they don't protect as much. I personally put them only on small games that I don't use often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2986501","commentId":2986501,"userName":"Khamul The Easterling","timestamp":1505617994,"content":"Any sleeve that is over a card protects the card from any liquid, food, chipping, oils, fade and wear.  Size, feel, durability and price are the factors that go into sleeves.  But fair enough, if you want a thicker sleeve, (which will mean a much taller deck that can sometimes tip) than Ive heard many good things about the Mayday Premium.  Other brands are good too, but they will be much much more expensive.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2987814","commentId":2987814,"userName":"JYoder","timestamp":1505747745,"content":"> On 9/15/2017 at 5:59 PM, Rouxxor said:\n> \n> There is also smaller sleevees (among 64x89) who are made to sleeve cards that are on a binder, or to put two sleeves on each cards (like for really expensive cards). They are not made for be played alone but some people do it anyway. It won't protect well the cards so even if it is cheaper so I would not recommend it.\n\nWhy don't the smaller sleeves (64x89) protect playing the cards as well? It seems to me that a more snug fit would cause less chance of bending when doing the \"smash together\" shuffling, but is the opposite true?\n\nAlso, I called my FLGS, and he kind of recommended a BCW brand, which I assume are these linked below. Anyone reason to get (or avoid) these? He seemed to think they were a bit better than other \"penny sleeves\" he had, as these were $1.50 for 100, rather than other brands he had that were $1.00 for 100. (Though some reviews said these seem to stick together a bit, which would be bad for shuffling.)\n\nhttps://www.amazon.com/BCW-Brand-Trading-Polypropylene-Sleeves/dp/B005LJX3ZE/ref=sr_1_10?ie=UTF8&qid=1505746762&sr=8-10&keywords=bcw+clear+card+sleeves+1000 [https://www.amazon.com/BCW-Brand-Trading-Polypropylene-Sleeves/dp/B005LJX3ZE/ref=sr_1_10?ie=UTF8&qid=1505746762&sr=8-10&keywords=bcw+clear+card+sleeves+1000]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2988051","commentId":2988051,"userName":"Rouxxor","timestamp":1505756901,"content":"Because one of the face is almost not covered. Cards move is the sleeve so without any margin they slip out and get in contact with the outside and take all damage. Plus they are not as rigid as the first you link so they absorb less against all that kamul have listed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2988238","commentId":2988238,"userName":"JYoder","timestamp":1505762519,"content":"Thanks everyone. Sorry for all the questions, but I can't order local, but need to do online, so I want to make sure I get this right...\n\nI'm thinking between the \"Ultra PRO Clear Deck Protectors Sleeves\" I initially linked and \"Mayday Premium\". Both appear better than penny sleeves and I can sleeve all my player cards for $100.\n\nAlso, the Ultra PRO are 66 x 91, but the Mayday Premium are 63.5 x 88. Does either fit the LotR cards better? (Or is the latter dimension bad, no matter what quality sleeves you get?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2988565","commentId":2988565,"userName":"Rouxxor","timestamp":1505774839,"content":"You might want another point of view since I already answer to all that in my previous post. I will anyway answer in case this help you.\n\nThe size of the ultra pro is the perfect one. Smaller mean no margin so cards will start to get out of the sleeves too often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2990061","commentId":2990061,"userName":"Maktorius","timestamp":1505859844,"content":"> On 2017-09-18 at 9:21 PM, JYoder said:\n> \n> Also, the Ultra PRO are 66 x 91, but the Mayday Premium are 63.5 x 88. Does either fit the LotR cards better? (Or is the latter dimension bad, no matter what quality sleeves you get?)\n\nI believe those are the same size, one advertising card dimension and the other sleeve dimensions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2993511","commentId":2993511,"userName":"jnicol","timestamp":1506060705,"content":"I use the Ultra Pro standard sleeves that are shown in the eBay listing. I give them a thumbs up.\n\nIf you are unsure then buy a single pack from your local gaming store and try them out before purchasing a bulk lot.\n\nEdited September 22, 2017 by jnicol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2993644","commentId":2993644,"userName":"Rouxxor","timestamp":1506074170,"content":"> On 18/09/2017 at 9:21 PM, JYoder said:\n> \n> Thanks everyone. Sorry for all the questions, but I can't order local, but need to do online, so I want to make sure I get this right...\n\nThat is why he got many questions ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2999332","commentId":2999332,"userName":"JYoder","timestamp":1506467881,"content":" \n\n I got a package of the Ultra Pro sleeves I linked in the first post. As someone expected, the 66mm x 91mm on the package was in reference to the actual size of the card. In contrast, I borrowed 50 sleeves from a friend that are FFG standard American, where the sleeves themselves are a bit bigger.\n\nI've sleeved 50 cards in each. Both feel fine, but the smaller Ultra Pro sleeves, when stacked, are a bit lopsided -- the bottoms of the sleeves are higher than the tops, making it slope a bit. Is that because the fit inside is tighter? Or from the little hologram symbol at the bottom? In contrast, the FFG ones, when stacked, lay perfectly flat, and stand about 15% shorter than the Ultra Pros. Also, when I press down on the Ultra Pros (feels like I'm squeezing air out) they go down to the same height as the FFG, but then they slowly rise back up to their original height.\n\nSo I'm curious -- what's the logistics in why the Ultra Pros stack are higher and \"inflate\" when you flatten them (and are lopsided)? While the FFG lie flat and you can't press them down any flatter? (For the record, I'm torn -- I prefer the size of the Ultra Pros sleeves as they fit in my boxes better and aren't as spendy, but I like that the FFG lay flat, and take up less space vertically, and seem less likely to slip apart when I pick them up.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=2999376","commentId":2999376,"userName":"sappidus","timestamp":1506470278,"content":"> 37 minutes ago, JYoder said:\n> \n> So I'm curious -- what's the logistics in why the Ultra Pros stack are higher and \"inflate\" when you flatten them (and are lopsided)? While the FFG lie flat and you can't press them down any flatter? (For the record, I'm torn -- I prefer the size of the Ultra Pros sleeves as they fit in my boxes better and aren't as spendy, but I like that the FFG lay flat, and take up less space vertically, and seem less likely to slip apart when I pick them up.)\n\nI don't have any specific thoughts on which might be better for you, but remember that sleeved cards \"age\", and both the airspace and the feel of sleeve-on-sleeve will change over a relatively short period."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=3003185","commentId":3003185,"userName":"Stavo343","timestamp":1506697700,"content":"I use the Ultra Pro Deck Protectors for all my player cards and haven't really noticed any slope to a stack after using them for a few games. I've only had 1 split in 2 years, and I love the fit and feel of these sleeves. cheapmagicsleeves.com has been the best price I've found to buy them in bulk.  I hadn't taken the plunge to try sleeving all encounter cards until yesterday. Mayday Games is having a moving sale, and packs of 80 are $1.40 (plus 10% off if you join their email club). I don't know if they have completely clear sleeves, though, and I haven't tried them out for quality. I went ahead and got them since the only other method cheap enough for me to consider would be penny sleeves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=3004285","commentId":3004285,"userName":"sappidus","timestamp":1506773705,"content":"> 20 hours ago, Stavo343 said:\n> \n> I use the Ultra Pro Deck Protectors for all my player cards and haven't really noticed any slope to a stack after using them for a few games. I've only had 1 split in 2 years, and I love the fit and feel of these sleeves. cheapmagicsleeves.com has been the best price I've found to buy them in bulk.  I hadn't taken the plunge to try sleeving all encounter cards until yesterday. Mayday Games is having a moving sale, and packs of 80 are $1.40 (plus 10% off if you join their email club). I don't know if they have completely clear sleeves, though, and I haven't tried them out for quality. I went ahead and got them since the only other method cheap enough for me to consider would be penny sleeves.\n\nMayday is a common choice for LotR—my own player card collection is sleeved up in Mayday Premiums. AFAIK they're actually most known for their clear, glossy sleeves, which are not currently discounted. (Until now I wasn't even aware they made those opaque-backed ones that are on sale. Now I'm tempted to try some…)\n\nFWIW I'm quite happy with the Premiums, especially for sale price—Mayday has big sales every so often on their site. I had started with Mayday Standards but found them too flimsy for heavy play; I now use those for less-frequently played board games instead. I disagree with Rouxxor in that I feel that the Ultra-Pros are a little too big, and the Mayday Premiums are the perfect size, but it all depends in how you handle your cards, I suppose. (e.g., My Netrunner cards are in these cheapo LaTCG inner sleeves, ostensibly to be slipped into bigger ones for double-sleeving during tournaments, but I find that for the kitchen table, the inner sleeves alone work just fine for me.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=3004904","commentId":3004904,"userName":"JYoder","timestamp":1506835861,"content":"\nSuch great thoughts from everyone. So very appreciated!\n\nsappidus -- You were spot on about the sleeves \"aging,\" which I'm glad for. Thanks for that.\n\nStavo343 -- I also like the feel of these Ultra Pro sleeves. There isn't much room at top, which doesn't bother me, but with so little wiggle room, they don't feel bulky, and I can even riffle shuffle them. (Though I'm trying to get a new \"sleeve card\" shuffle down.) And that site does appear to have the best prices. Thanks!\n\nI've tried the FFG standard American, and while they seem to protect the cards best (with lots of wiggle room) they feel big and flimsy around the edges. Don't really like the feel, and given they are spendier, I'll axe them.\n\nThe only other candidate is the Mayday Premium. I should at least try them, especially as their price is simliar. Hopefully my FLGS has some, as I don't want to order a single pack online and pay for shipping.\n\nsappidus -- You say the Mayday Premiums have even less wiggle room than the Ultra Pros... does that mean they slip right up to the top even more the Ultra Pros do? Or what do you mean regarding \"how you handle your cards\" that matters? Shuffle style? Or how much you use them in general? Ultra Pros seem pretty snug, so it's interesting that the Mayday are even more.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=3010897","commentId":3010897,"userName":"JYoder","timestamp":1507219878,"content":"I think I'll go all in with Ultra Pro. After a week of play, they lay flat, I like the fit and feel, and they don't break my wallet.\n\nOne last question -- are the cards at these 2 links the same?\n\nhttps://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear [https://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear]\n\nhttp://www.cheapmagicsleeves.com/bulk-ultra-pro-clear-sleeves-1800ct/ [http://www.cheapmagicsleeves.com/bulk-ultra-pro-clear-sleeves-1800ct/]\n\nSeems they are, but Amazon is packs of 50, with the cheapmagicsleeves in packs of 100 and they aren't listed as \"Deck Protector\". (I bought the Amazon 600 count, so to finish off what I need, I could get the 1800 count at CMS if it's the same product.)\n\nThanks again everyone!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258664-are-these-good-sleeves-for-this-game-newbie-sleever/?do=findComment&comment=3016353","commentId":3016353,"userName":"Stavo343","timestamp":1507554881,"content":"> On 10/5/2017 at 11:11 AM, JYoder said:\n> \n> I think I'll go all in with Ultra Pro. After a week of play, they lay flat, I like the fit and feel, and they don't break my wallet.\n> \n> One last question -- are the cards at these 2 links the same?\n> \n> https://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear [https://www.amazon.com/Ultra-Protectors-Sleeves-Standard-Colors/dp/B00HOI5KSS/ref=sr_1_1?ie=UTF8&qid=1505423899&sr=8-1&keywords=Ultra+Pro+Deck+Protectors+clear]\n> \n> http://www.cheapmagicsleeves.com/bulk-ultra-pro-clear-sleeves-1800ct/ [http://www.cheapmagicsleeves.com/bulk-ultra-pro-clear-sleeves-1800ct/]\n> \n> Seems they are, but Amazon is packs of 50, with the cheapmagicsleeves in packs of 100 and they aren't listed as \"Deck Protector\". (I bought the Amazon 600 count, so to finish off what I need, I could get the 1800 count at CMS if it's the same product.)\n> \n> Thanks again everyone!\n\nThey're the same. You can even zoom in on the pic at cms to see that it says \"Deck Protector\" on the packages."}]}