{"url":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/","title":"Is it ok to print bold triggers near keywords?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/?do=findComment&comment=2986924","commentId":2986924,"userName":"John Constantine","timestamp":1505670914,"content":"Hi there. I got a little dilemma. From one point of view, printing bold triggers right next to keywords feels extremely wrong. From the other point, it frees a lot of free space in the text box. For example, I would have to get rid of a quote on this card if I wouldn't print Forced directly after the keywords:\n\n 0h7fr42.jpg [https://i.imgur.com/0h7fr42.jpg]\n\n \n\nWhat do you people think? Also, LotR LCG vets, did FFG printed any cards like this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/?do=findComment&comment=2986932","commentId":2986932,"userName":"stimpaksam","timestamp":1505671407,"content":"Maybe a little unusual but not wrong. It doesn't say anywhere in the rules about proper card text formatting. It might seem a little confusing at first for newbs but I think vets would easily be able to differentiate between the keywords and bold triggers on the fly. FFG does this for their Alt Hero cards because of space limitations... Legolas [https://talesfromthecards.files.wordpress.com/2016/05/legolas-alt-art.jpg]\n\nEdited September 17, 2017 by stimpaksam\nfixed link"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/?do=findComment&comment=2986945","commentId":2986945,"userName":"Bullroarer Took","timestamp":1505672905,"content":"Put a carriage return after Skulk, and then put  -- Uta Falkenwrath on the same line as the quote.  Everything fits?\n\n \n\nOr maybe I misunderstand?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/?do=findComment&comment=2986950","commentId":2986950,"userName":"Authraw","timestamp":1505673115,"content":"I think it makes it a little easier to miss those keywords, but I don't think it's always wrong. I would say it's to be avoided when possible, but if you really need that quote to pull your theme together properly, then I think it's acceptable.\n\nIt might be possible to wordsmith it a bit to get it all to fit, though. You could probably save a line by changing the word \"creatures\" to \"things\" or moving \"Uta Falkenwrath\" to the end of the quote. You might be able to save some space in the \"Forced\" effect, too, depending on how it looks on its own line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/258853-is-it-ok-to-print-bold-triggers-near-keywords/?do=findComment&comment=2986973","commentId":2986973,"userName":"John Constantine","timestamp":1505675638,"content":"STIMPAKSAM, THAT'S A RELIEF TO KNOW THAT FFG DID IT THEMSELVES, ON PLAYER CARDS EVEN. THANK YOU.\n\n \n\nBullroarer Took, the last part of the quote wouldn't fit. And the question is not about this particular card, but about the way to print text boxes in general, because I am getty plenty of those dilemmas.\n\n \n\nAuthraw, yup, keyword visibility has gone down significantly... but is this evil a necessary enough one?\n\nThe thing is, I want a consistent way of print to use on all of my text boxes, not to break my about each individual text box. Right now, it looks like bold triggers right after keywords is best solution, however if there is a passive non-bold effect after the keyword, then any bold trigger should follow after an empty line, like this:\n\nJfbXC2Z.png [https://i.imgur.com/JfbXC2Z.png]\n\nEdited September 17, 2017 by John Constantine"}]}