{"url":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/","title":"Bought the core game &amp; love it - What&#039;s next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3005891","commentId":3005891,"userName":"HunterEatsHunter","timestamp":1506952224,"content":"I bought the core game and it's amazing. I'm ready to get some more, but not sure what to buy as there are so many options and I don't know what any of it means and whether or not it should be bought in any order. \n\nWhat's the difference between Deluxe Expansions, Saga Expansions, Standalone Scenarios, Nightmare Decks, and all of the Cycles? Is there a smart way to approach and buy stuff in a certain order?\n\nAny advice is appreciated.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3006150","commentId":3006150,"userName":"Authraw","timestamp":1506962247,"content":"Terminology\n\nDeluxe Expansions are bigger than Adventure Packs, containing 3 quests instead of just 1 and more player cards as well.\n\nThe game is broken up into cycles. The first consists of the Core Set + the 6 Adventure Packs of the Shadows of Mirkwood cycle. Every subsequent cycle starts off with a Deluxe Expansion followed by 6 linked Adventure Packs. You need the Deluxe in order to play its linked Adventure Packs.\n\nThe cycles are mechanically independent from one another, meaning you can theoretically start with whichever cycle you like. Each cycle has its own narrative, though, so if you care about the storyline then it's usually best to play the packs of any given cycle in the correct order. The only two cycles that narratively flow one into the other are The Grey Havens / Dreamchaser + Sands of Harad / Haradrim.\n\nThe Saga Expansions are a set of Deluxes that are associated with each other (with no Adventure Packs) that follow the storyline of the books. These are probably best purchased in the order of the narrative.\n\nStandalone Scenarios (or \"Print on Demand Quests\") are just quests with no player cards. They're originally designed for special events, and tend to be pretty hard.\n\nNightmare Decks are \"Upgrades\" for older quests to fix design flaws, make them more thematic, and make them harder for the modern card pool.\n\nWhat you should buy\n\nRight off the bat, I would skip Nightmare Decks and Standalone Scenarios--they come with no Player Cards, and they're meant for players who are looking for a challenge rather than those just starting out.\n\nThe usual advice is to play the game in release order, because that's what most of us have done and we've all had fun with it. That would mean that your first purchase after the Core Set would be the Shadows of Mirkwood Adventure Packs.\n\nBut sometimes the packs go out of print and you might have to wait months to find the next pack in release order. I'm currently working on a blog series to investigate which expansions would make good second purchases after the Core Set and which ones wouldn't, which might be helpful to you if you're interested in playing things out of release order: https://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3006161","commentId":3006161,"userName":"Thanatopsis","timestamp":1506962502,"content":"The blog Tales from the Cards has a new player buying guide that you might find helpful.\n\nhttps://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\nAlso, feel free to purchase expansions that enable deck strategies that interest you. If you love hobbits, purchase The Black Riders, etc\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3018910","commentId":3018910,"userName":"BigKahuna","timestamp":1507657878,"content":"I always look at things from a perspective of \"game night\"... which is to say, if you and a friend or two or three sit down to play the game, which adventure (s) would I pull out to make it a fun evening.  The answer is almost always The Saga Expansions.  Its a familiar story, its an ongoing-connected story... its the good stuff.\n\nFrom a perspective of doing it solo, its the same, saga expansions all the way.  Again, its got more umpf if you will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3022814","commentId":3022814,"userName":"cheapmate","timestamp":1507833107,"content":"The Saga Expansions are a good second buy after the core set. I preferred the Lord of the Rings over The Hobbit expansions, but either is good.\n\nOtherwise, just pick up a Deluxe Expansion based on your preference, be it setting or heroes included, and follow-up with cycle that follows it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3024242","commentId":3024242,"userName":"GravyK","timestamp":1507907551,"content":"I've had the most fun going through the saga deluxe expansions with one other player. It's been a great time, and I can't wait to just start it all over once it's done with different decks. I would definitely recommend the saga boxes. That's not to say the regular cycles and adventure pack scenarios aren't fun - I just like the experience that the saga delivers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3026311","commentId":3026311,"userName":"Rouxxor","timestamp":1508019162,"content":"I personally recommend any cycle over saga, because I love both story and mechanic introduced in them, and even more in the most recent ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3027814","commentId":3027814,"userName":"JJ48","timestamp":1508157884,"content":"> On ‎10‎/‎2‎/‎2017 at 0:37 PM, Authraw said:\n> \n> Terminology\n> \n> Deluxe Expansions are bigger than Adventure Packs, containing 3 quests instead of just 1 and more player cards as well.\n> \n> The game is broken up into cycles. The first consists of the Core Set + the 6 Adventure Packs of the Shadows of Mirkwood cycle. Every subsequent cycle starts off with a Deluxe Expansion followed by 6 linked Adventure Packs. You need the Deluxe in order to play its linked Adventure Packs.\n> \n> The cycles are mechanically independent from one another, meaning you can theoretically start with whichever cycle you like. Each cycle has its own narrative, though, so if you care about the storyline then it's usually best to play the packs of any given cycle in the correct order. The only two cycles that narratively flow one into the other are The Grey Havens / Dreamchaser + Sands of Harad / Haradrim.\n> \n> The Saga Expansions are a set of Deluxes that are associated with each other (with no Adventure Packs) that follow the storyline of the books. These are probably best purchased in the order of the narrative.\n> \n> Standalone Scenarios (or \"Print on Demand Quests\") are just quests with no player cards. They're originally designed for special events, and tend to be pretty hard.\n> \n> Nightmare Decks are \"Upgrades\" for older quests to fix design flaws, make them more thematic, and make them harder for the modern card pool.\n> \n> What you should buy\n> \n> Right off the bat, I would skip Nightmare Decks and Standalone Scenarios--they come with no Player Cards, and they're meant for players who are looking for a challenge rather than those just starting out.\n> \n> The usual advice is to play the game in release order, because that's what most of us have done and we've all had fun with it. That would mean that your first purchase after the Core Set would be the Shadows of Mirkwood Adventure Packs.\n> \n> But sometimes the packs go out of print and you might have to wait months to find the next pack in release order. I'm currently working on a blog series to investigate which expansions would make good second purchases after the Core Set and which ones wouldn't, which might be helpful to you if you're interested in playing things out of release order: https://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]\n\nExcellent advice.\n\nI would just clarify that Nightmare Decks require the non-nightmare version of a deck in order to play (e.g. Nightmare Trouble in Tharbad requires that you have the Trouble in Tharbad adventure pack, which itself requires that you have the Voice of Isengard deluxe expansion).  I wouldn't advise getting Nightmare packs until you are very comfortable with the game and are looking for greater challenge.\n\nOne thing I'll add about the Saga Expansions is that not only do they follow the narrative, but they also have a Campaign Mode that can be rather fun.  In Campaign Mode, you play each quest of the Sagas, in order, using the same Player Deck(s).  Along the way you will earn various Boon (positive) and Burden (negative) cards to include in your deck during that campaign (you're not really supposed to include those particular cards in your deck if you're not doing a campaign). \n\nAs others have suggested, I'd recommend focusing on one cycle at a time (a Deluxe and its associated Adventure Packs).  In theory, you should be able to go for any that appeal to you, but in practice, you may want to check which ones are available at your local game store."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259779-bought-the-core-game-love-it-whats-next/?do=findComment&comment=3029036","commentId":3029036,"userName":"divinityofnumber","timestamp":1508192617,"content":"I always recommend buying the products in the order in which they were originally released, so you get the organic feel of the way that the game progressed. Others will disagree. I am biased toward my own awesome experience with the game. I started playing when the game was released, and I had an excellent experience playing with new cards as they came out. \n\nFor example, if you have a friend or two that is willing to play, you can build decks with Core Set stuff, play until you feel you've gotten enough out of the Core Set, and then agree to get the next adventure pack. Then, you both modify your decks and play the new scenario, etc. If you buy in the order of release, the decks in your playgroup should develop in a synergistic way.  \n\nEdited October 16, 2017 by divinityofnumber"}]}