{"url":"https://community.fantasyflightgames.com/topic/259878-leadership-eomer-and-immune-to-player-card-effects/","title":"Leadership Eomer and immune to player card effects","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/259878-leadership-eomer-and-immune-to-player-card-effects/?do=findComment&comment=3008452","commentId":3008452,"userName":"Onidsen","timestamp":1507085983,"content":"Is Eomer's ability a player card effect that an enemy can be immune to, or is it like Dunhere and Quick Strike, where I can still attack an enemy immune to player card effects in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259878-leadership-eomer-and-immune-to-player-card-effects/?do=findComment&comment=3008481","commentId":3008481,"userName":"dalestephenson","timestamp":1507088430,"content":"Dunhere can't attack immune enemies in the staging area, with or without Quick Strike.  See for example here:\n\nhttps://boardgamegeek.com/thread/1086021/official-ruling-dunhere-hands-upon-bow-and-enemies [https://boardgamegeek.com/thread/1086021/official-ruling-dunhere-hands-upon-bow-and-enemies]\n\nHands Upon the Bow works -- Great Yew Bow does not.  LeEomer's wording seems almost exactly like Hands Upon the Bow to me, so maybe LeEomer will work against immune staging enemy pests.\n\nHUTB: Exhaust a character you control with ranged to immediately declare it as an attacker (and resolve its attack) against an enemy in the staging area.\n\nLeEomer: After Éomer commits to the quest, spend 1 resource from his resource pool to immediately declare him as an attacker (and resolve his attack) against an enemy in the staging area.\n\nDunhere: Dúnhere can target enemies in the staging area when he attacks alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259878-leadership-eomer-and-immune-to-player-card-effects/?do=findComment&comment=3008498","commentId":3008498,"userName":"GrandSpleen","timestamp":1507090120,"content":"Short answer: You can't use Hands Upon the Bow, or Dunhere, or leadership Eomer against immune enemies. You can use Quick Strike.\n\nLong answer:\n\nAlways check your time stamp.  That forum thread is from 2013 and outdated by several versions of the FAQ and ruling reversals.  Immunity is a murky subject, and even in the FAQ itself they allow Quick Strike to work versus immune enemies, while Hands Upon the Bow does not, and cite wording differences as part of the reason, even though HUtB and QS are nearly copy/paste similar, with the exception of the phrase \"staging area.\"\n\nAnyway, for immune enemies, you are basically disallowed from using any cards which use a form of the word \"target\" or cause you to \"choose\" an enemy (except Quick Strike... Quick Strike is fine, because reasons).  That's here in the FAQ:\n\n\"This means that any player card that uses a\nform of the words “target” or “choose” cannot choose\na card that is immune to player card effects as its\ntarget.\"\n\nDunhere uses the word \"target\" and therefore cannot be used against immune enemies.\n\nEomer does not use the word \"target\" or \"choose.\"  But he uses the word \"staging area,\" which is basically what disqualifies you from using \"Hands Upon the Bow,\" according to the FAQ, so Eomer would not be legal versus immune enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/259878-leadership-eomer-and-immune-to-player-card-effects/?do=findComment&comment=3008540","commentId":3008540,"userName":"NathanH","timestamp":1507097242,"content":"Remember the Unwritten Rule: Immune enemies in the staging area that are not considered to be engaged cannot have damaged placed on them by any player-card trick you think you might have come up with.\n\nEdited October 4, 2017 by NathanH"}]}