{"url":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/","title":"Buying saga/deluxe expansions or adventure packs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3035414","commentId":3035414,"userName":"burek277","timestamp":1508487932,"content":"Hi everyone!\n\nI own Khazad-um, Over Hill and Under Hill and The Heirs of Numenor, as well as two adventure packs (The Steward's Fear and The Watcher in the Water). I haven't played in a while, but I'm looking to expand my collection a bit and start playing again with my girlfriend.\n\nWhat do you suggest I buy next? Should I get some more box expansions (the Grey Havens and The Black Riders look cool) or adventure packs from the ones I already have? Which add more value in terms of building decks and in terms of fun quests?\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3035577","commentId":3035577,"userName":"Rajam","timestamp":1508498980,"content":"The Black Riders has both good player cards and fun quests. You should definitely get it next.\n\nAvoid The Hobbit sagas (Over Hill and Under Hill, On the Doorstep). They have good player cards, but other than Battle of Five Armies, the quests are not good.\n\nYou can't go wrong with The Grey Havens cycle :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nFor adventure packs, I recommend Foundations of Stone"},{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3035801","commentId":3035801,"userName":"dalestephenson","timestamp":1508507644,"content":"Since you already have Over Hill and Under Hill, I would recommend On the Doorstep.  The quests are better than OHUH, and it will give you more cards for your dwarf decks.  The APs you would need to fill out your dwarf decks would be Return to Mirkwood (for Dain), Road to Rivendell (Lure of Moria), and Shadow and Flame (We are Not Idle).\n\nI agree Black Rider has good quests and cards and would be a great expansion to get.  I also like Grey Havens.  With your current pool, you can buy any deluxe and also 16 unbought adventure packs from the Mirkwood/Dwarrowdelf/AgainstTheShadow cycles.  Deluxes are twice the price of APs, but have three times the quests and twice the heroes -- but in non-hero player cards, an adventure pack typically has 9 different cards, while deluxes don't have twice that (the ones you don't have 13 cards, except for Sands of Harad with 11).  So if you mostly want more quests the Deluxes are better, while if you want more player cards the APs are better.\n\nAlso note that the Deluxes tend to introduce new deck types, but the APs in a cycle tend to support a couple of previous introduced deck types, so getting a new deluxe will enable a new tribal deck without giving enough cards to make it very strong; but filling out a cycle will give you make a couple different traits much stronger.\n\nThe cycles also tend to tell a connected story, from Heirs of Numenor on directly connected to the story begun in the deluxe box.  If that's a consideration to you, filling out the Shadow cycle will give you a good story; and in Dwarrowdelf getting the final three packs will finish the story started in Watcher in the Water.  Foundation of Stone also may the most powerful single AP for player decks, though cards like Warden of Healing (Long Dark) and hero Elrond (Shadow and Flame) are no slouches.\n\nHere are some of my favorites general-purpose or common sideboard cards from packs you could plausibly get next\n\nConflict at the Carrock:  Burning Brand, Dunedain Warning\n\nRedhorn Gate: Spirit Bofur\n\nLong Dark: Warden of Healing\n\nFoundation of Stone: Daeron's Runes\n\nVoice of Isengard: Power of Orthanc\n\nIf you decide to get either Black Riders or On the Doorstep, picking up The Dead Marshes for Fast Hitch wouldn't hurt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3035846","commentId":3035846,"userName":"Chrysagon","timestamp":1508508925,"content":"If you are interested in strengthening your player decks, you could add some adventure packs in the Dwarrowdelf Cycle. \n\n \n\n\n\n * The Watcher in the Water-- Aragorn, Arwen Undómiel, Elrond’s Council, Legacy of Durin, Resourceful, Rivendell Bow, Sword That Was Broken\n * The Long Dark-- Erebor Battle Master, Warden of Healing, Ring Mail, Erestor\n * Foundations of Stone-- Glorfindel, Light of Valinor, Asfaloth, Daeron’s Runes, Healing Herbs, Heavy Stroke, Imladris Stargazer\n * Shadow and Flame--  Elrond, Vilya, Hands Upon the Bow, Hardy Leadership, Master of the Forge, Miruvor, Peace and Thought, We Are Not Idle\n\nIn the Mirkwood Circle, Conflict at the Carrock gives you Frodo, A Burning Brand, Song of Wisdom, Dunedain Warning. If you like Dwarves, Dain Ironfoot is a very powerful hero in Return to Mirkwood (reportedly a hard quest in solo mode)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3039957","commentId":3039957,"userName":"burek277","timestamp":1508742380,"content":"Thanks for your help, everyone! I was wavering between FoS and CatC, but my LGS didn't have FoS so I ended up getting Conflict at the Carrock for now. The quest was a lot of fun and I used Frodo to decent effect, so a great start altogether. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I will try to fill out some APs for what I have and pick up The Black Riders at some point for the story.\n\nOne more thing: is the Campaign mode good? It looks like a lot of fun, but I've never tried it before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/261256-buying-sagadeluxe-expansions-or-adventure-packs/?do=findComment&comment=3040280","commentId":3040280,"userName":"dalestephenson","timestamp":1508763395,"content":"I find the campaign mode very enjoyable."}]}