{"url":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/","title":"Another hideous timing question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?do=findComment&comment=3058317","commentId":3058317,"userName":"Boromore","timestamp":1509547572,"content":"Or two. I've just started on the frustrating Tower of Cirith Ungol, in Campaign mode. A couple of times I have encountered \"The Ring Draws Them\" - cue mass engagement, multiple forced \"after engages\" effects, and with Sam Gamgee in play, multiple \"after engage an enemy\" responses. Staged enemies: Gorbag (\"after Gorbag engages you, it makes an immediate attack\"), Orc of Mordor (\"after Orc of Mordor engages you, exhaust a character you control\") and Uruk Soldier (\"after Uruk Soldier engages you, raise your threat by 2\")\n\nI've seen there is an answer basically allowing multiple uses of the bonus part of Sam's response (i.e engaging 3 enemies of higher threat allows +3 bonus). \n\nI know Forced trumps Response in the order, but:-\n\n (1)  do I treat engagements in this context 1 by 1  (i.e. engage first enemy, resolve Forced, resolve Response, go to next enemy)?\n\n (2)  if Gorbag is an enemy, his Forced effect is an attack. If I chose to resolve his forced effect first, opening the attack window allows actions - but what about responses? Are they still stacked pending the completion of the attack?\n\n (3)  with Orc of Mordor (threat 28), can I ready Sam from a previous response (if allowed), exhaust him to satisfy the the Forced effect, then ready him via his Response to engagin Orc of Mordor?\n\n (4)  with Uruk Soldier, if the added threat pushes my threat to 28, does that mean I can no longer use my response to engaging Orc of Mordor, even though I engaged him initially at a low enough threat level?\n\nBasically I'm trying to work out how I can maximise Sam's self-preservation (hopefully legitimately!).\n\nEdited November 1, 2017 by Boromore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?do=findComment&comment=3058813","commentId":3058813,"userName":"naverag","timestamp":1509562845,"content":"So I think 2,3,4 are all clear if you know 1:\n\nIf the answer to (1) is that you engage the enemies one by one, resolving Forced and Response to each before engaging the next, with you choosing the order, then the answers are:\n\n(2) no, the responses wait until after the Forced effect clears\n\n(3) yes\n\n(4) if you had 26 threat at the start, and chose to engage the Uruk Soldier first, then your threat would be 28 when you engaged the Orc of Mordor, and can't use Sam's Response. But you could always engage the Orc of Mordor first.\n\nHowever, if the answer to (2) is that you engage all the enemies at once, then resolve all the Forced effects, then all the Responses, then the answers are:\n\n(2) still no, and this time you have to clear *all* the Forced effects before any of the Responses come through\n\n(3) You can't ready him with a previous response but the rest is fine\n\n(4) I *think* the event sets up the Response and then they all trigger, rather than checking if the event still happened when you're looking for Responses, so you would be able to use Sam's ability for all of the enemies in this case.\n \n\nWhich the answer to (1) is, though, I wouldn't want to say."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?do=findComment&comment=3060809","commentId":3060809,"userName":"GrandSpleen","timestamp":1509655272,"content":"Yep, hideous!  \n\nI think all the engagement will happen simultaneously, which will then cue up a series of Forced effects that need to be resolved  one by one.  You will choose the order in which you can resolve the Forced effects.  It also cues up Sam's effect at the same time, so you'll get the benefit from his Response regardless of any subsequent threat raising.  You'll just resolve all of his Responses after you finish resolving all of the Forced effects. What mattered was your threat level at the time that The Ring Draws Them was resolved (end of quest phase) and the simultaneous engagement occurred.  \n\nFor Gorbag: I think you'll resolve his Forced effect by initiating the attack: deal him a shadow card, then you're free to resolve the next Forced effect (or if there are no more, you're free to trigger Sam's response).  I think so because we've previously had rulings which stated you could take actions (such as readying Boromir) before you declare the defender if an enemy makes an attack as the result of a When Revealed effect.  A Forced effect should work the same way.  If you're free to trigger actions at that point, that means you're free to trigger Responses, which should be done before you take any Actions.  And Forced effects trigger before Responses, so ... I would structure the timing that way.  1) engage Gorbag, 2) deal him a shadow card to \"initiate\" the attack, 3) resolve each other Forced effect, 4) resolve Sam's response(s), 5) delcare a defender and complete Gorbag's attack.\n\nIf Sam is exhausted at the time you engage enemies, it seems you won't be able to use him to satisfy the exhaustion effect from Orc of Mordor, using that timing structure.\n\n \n\nEdited November 2, 2017 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?do=findComment&comment=3095950","commentId":3095950,"userName":"Boromore","timestamp":1511636450,"content":"Hi. Apologies for the delayed reply. Just to say thank-you for the responses - the idea of resolving any pending Forced effects then Responses once an Action window opens makes sense to me, and saves having either outstanding for too long."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?do=findComment&comment=3551373","commentId":3551373,"userName":"Boromore","timestamp":1543494612,"content":"This cropped up again for me in Black Riders now I have begun the LOTR Campaign in Nightmare mode (hmm), so I checked with FFG. And GrandSpleen was spot on about sorting it all out when the attack action window opens.\n\nFor reference, the response I received (albeit to a less complicated scenario) was: \n\n\"Response effects must be triggered at the first opportunity. Those opportunities are the action windows highlighted in our online rules reference. There are still some cases that are sort of niche, like the one you describe. In the event that an enemy has a Forced effect that causes it to attack after it engages you, the first opportunity to trigger a Response will come while resolving the attack.\n\nWhen an enemy makes an attack outside of the combat phase, it still follows all the steps of enemy attacks, and there are action windows after each one. So your first opportunity to trigger Sam’s Response will be after Step 1 – Choose an Enemy. During that window you can ready Sam so that he is available to be declared as a defender in Step 2. This applies regardless of whether the enemy engages you during the encounter phase or the combat phase.\n\nCheers, Caleb\"\n\nEdited November 29, 2018 by Boromore"}]}