{"url":"https://community.fantasyflightgames.com/topic/262608-lore-control/","title":"Lore Control","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065221","commentId":3065221,"userName":"Bullroarer Took","timestamp":1509934505,"content":"I'm talking about a deck that uses The Door is Closed, None Return etc... to shut out the encounter deck.  I've tried it a few times and it has NOT been successful (at least in two player).  Does it work better in 3 or 4 player?  Or is this a fringe strategy that only works against weaker quests? My feeling is the latter, but maybe there is a cohesive strategy that makes it work.  ( I want to believe. )\n\nWhat say the Council?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065270","commentId":3065270,"userName":"Teamjimby","timestamp":1509938751,"content":"It's definitely better in 3-4 player because you go through the deck more often.  Also, other players can cover for your lack of combat.  But yeah, even then I think it's still largely a fringe strategy.  I wouldn't say it only works against weaker quests, but it can be very good against quests that have specific cards that you want to remove from the deck, like Sleeping Sentry for example."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065278","commentId":3065278,"userName":"Network57","timestamp":1509939686,"content":"If you build one that starts in secrecy with Rossiel, Glorfindel, and Mirlonde (although Rossiel is unimportant and any Lore hero that lets you start in secrecy is OK), with Resourceful, Out of the Wild, and the other Victory Display events, it works as a solid B tier deck when paired with a Combat deck. I think I ran mine with a Scorpagorn/Amarthiul/Halbarad deck across the table and had decent success on the Angmar cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065301","commentId":3065301,"userName":"Mr_Underhill","timestamp":1509942391,"content":"This one is really good.\n\nhttp://ringsdb.com/decklist/view/5524/flawless-victory-1.0 [http://ringsdb.com/decklist/view/5524/flawless-victory-1.0]\n\nIt doesn't quite \"shut out\" the encounter deck but it does make good use of the cards you mentioned.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065454","commentId":3065454,"userName":"Rouxxor","timestamp":1509959447,"content":"It is not a very effective deck. But it can do stuff. The most important card to me is gildor's counsel who help on the same time to know better what is going on (since you have to scry one less) and to deal with cards that still come out.\n\nI have a deck (http://ringsdb.com/decklist/view/5636/mono-lore-scrying-for-multiplayer-1.0) [http://ringsdb.com/decklist/view/5636/mono-lore-scrying-for-multiplayer-1.0] and I play it with 2 players (with a Gandalf or Caldara or Dwarf, a deck that can manage both quest and fight) or with 3 players with a fight deck and a quest deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065524","commentId":3065524,"userName":"NathanH","timestamp":1509966555,"content":"If you go mono-lore you can fill the deck with Ents and it can be effective at the normal parts of gameplay too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065682","commentId":3065682,"userName":"Network57","timestamp":1509977322,"content":"> 2 hours ago, NathanH said:\n> \n> If you go mono-lore you can fill the deck with Ents and it can be effective at the normal parts of gameplay too.\n\nIt doesn't have to be mono-Lore. The deck I mentioned above starts in Secrecy and takes advantage of Resourceful to get enough resources to play Ents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065714","commentId":3065714,"userName":"dalestephenson","timestamp":1509978440,"content":"I paired Rossiel with a cancel-themed deck here:\n\nhttp://ringsdb.com/fellowship/view/141 [http://ringsdb.com/fellowship/view/141]\n\nIt made it successfully through the 3rd through 5th quests of Khazad-Dum, but had to drop to easy mode in order to defeat Shadow and Flame.  I think if the cancel deck had been a stronger combat deck that wouldn't have been necessary; the fellowship's weakness was reliance on allies for attack power.  In practice I used Out of the Wild more to enhance Rossiel's questing or defense than to fish out obnoxious cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065762","commentId":3065762,"userName":"PocketWraith","timestamp":1509980235,"content":"Encounter deck manipulation can be a very effective strategy, but it is very much for higher player counts. With less than 3 players you run into problems because the long term benefits of your encounter deck manipulation do little to help with the orc who is attacking you right now. You can still use bits of the approach but they have to be mixed in with more normal direct approach stuff. As a third or fourth deck when the basics of questing and combat are already covered though, it can be a very effective option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3065794","commentId":3065794,"userName":"donkler","timestamp":1509981309,"content":"I would agree that 3 and 4 player games would be the ideal case, especially where everyone has copies of Keen as Lances."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3066051","commentId":3066051,"userName":"Teamjimby","timestamp":1509987927,"content":"> 1 hour ago, donkler said:\n> \n> I would agree that 3 and 4 player games would be the ideal case, especially where everyone has copies of Keen as Lances.\n\nFor sure.  If 4 players are running Keen as Lances, that card is insane."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3066265","commentId":3066265,"userName":"JusticeLizard","timestamp":1509993302,"content":"My Rossiel experience:\n\n \n\nWhen The Lost Realm came out I tried to play though that cycle with a deck based off the new Dunedian theme.  I quickly leads that the card pool wasn't deep enough for it to be viable.  I could not beat The Wastes of Eriador.  So when Mount Gram came out, I started over with Rossiel.  I ran her with spirit Glorfindel and Galadriel.  The encounter deck control worked pretty well solo, although I didn't target things specifically.  If I could get a Door Is Closed off no matter what was hit, it would mean a turn without any encounter cards.  Galadriel would keep my threat down so I only encountered enemies when I wanted to, plus the card draw would help get to critical cards that much quicker.  In the end it felt more like a silvan ally deck then a control deck, but those cards definitely played a role.  The deck ended up working so well I didn't even realize how tough The Battle of Carn Dum was until I played though the cycle again, a year later with my wife."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3066787","commentId":3066787,"userName":"antonick","timestamp":1510006012,"content":"Very nice ideas in this thread!\n\n \n\nThe only time I tried to play this kind of deck, I went Secrecy with Thurindir (makes a good combo if you can get done the \"double back\" side quest, gives you extra rounds of secrecy), Glorfindel (Spirit) and Pippin (it is crazy how much you need the extra early game card draw).\n\nAsfaloth helps a lot and Gandalf (Saga Version) once you have gone out of secrecy gives a great boost!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3067274","commentId":3067274,"userName":"GrandSpleen","timestamp":1510031046,"content":"I used control effectively in a couple of very different decks.  Both were in saga campaigns, different campaigns, but both of them 2-player.  Neither were secrecy decks.  As PocketWraith mentions above, they were effective because they mixed control with other standard aspects of the game.\n\nIn one of them, I had a combat tactics/lore deck and snuck in some Out of the Wilds and The Door is Closed -- I think only those two.  It only had one Lore hero, but it was Grima with Keys of Orthanc attached, so paying for Out of the Wild wasn't so bad.  I think I only ran that setup for one scenario, which was Passage of the Marshes, although I might have played it for more.  In that scenario, I am pretty sure I removed We Hates Them [http://hallofbeorn.com/LotR/Details/We-Hates-Them-TLoS] from the encounter deck, and then cancelled it later.   A good card to use The Door is Closed on, because it has Surge and effectively you are cancelling two cards.  I might also have removed Bitter Reek [http://hallofbeorn.com/LotR/Details/Bitter-Reek-TLoS].  The other duties of that deck included most of the attacking, and a little bit of the defense, but only a drop of willpower.  The companion deck handled 90% or more of the questing, and most of the defense with Erkenbrand and some other cards.\n\nIn another game, I had Galadriel/Haldir/Damrod and again used Out of the Wild with The Door is Closed.  That deck was paired with a combat deck which supplied Haldir with weapons.  The Galadriel deck did 80% or so of the willpower, plus control (which included some control through Traps).  I think I used it for the entire Land of Shadow box, but mostly I remember it being very very useful against Shelob.  I definitely removed and then repeatedly cancelled Rage and Hunger [http://hallofbeorn.com/LotR/Details/Rage-and-Hunger-TLoS].  That deck also used Ranger Bows to whittle her down.  I also used that deck against The Dread Realm.  \n\nSo there are a couple of different decks that fit control in effectively.  Very different decks, but they didn't wholly specialize in control.  You can pepper it in and still enjoy a big benefit, while also seriously changing the flavor of your deck and your goals while playing.\n\nedit: just checked my quest log and the control version of the Galadriel deck originated with Journey to the Cross-roads, where it was instrumental in helping me win with a very low escape count (only 1 Man of Harad escaped).  It removed a Man of Harad [http://hallofbeorn.com/LotR/Details/Man-of-Harad-TLoS], Marching Up the Road [http://hallofbeorn.com/LotR/Details/Marching-Up-the-Road-TLoS], and Dark Lord's Summons [http://hallofbeorn.com/LotR/Details/The-Dark-Lord%27s-Summons-TLoS], then later cancelled Dark Lord's Summons with The Door is Closed (that's a Peril card, so I must have gotten lucky with turn order).  Not to mention some cancels with A Test of Will.\n\nEdited November 7, 2017 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3067289","commentId":3067289,"userName":"Authraw","timestamp":1510033165,"content":"Y'all are making me want to bring Out of the Wild / The Door is Closed to the Attack on Dol Guldur Fellowship event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3067292","commentId":3067292,"userName":"Bullroarer Took","timestamp":1510034258,"content":"That's why I brought it up.  This past weekend I played Dol Guldur with Seastan and another player.  There are a couple of treachies that are just brutal.  And there is another forced effect that can cut down on your ability to cancel as well.  I've been thinking about what the fourth deck should look like and asked the question.  An early Out of the Wild to put one of the really bad cards in the victory display would work wonders.\n\nI'm being deliberately vague obviously because I know some people don't want spoilers.  If you do, go read Darkling Door for a great write up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3120608","commentId":3120608,"userName":"Bullroarer Took","timestamp":1513019437,"content":"So we manage to put a team together for the Fellowship event and in the end I took the blue-green control deck.  I managed to play Out of the Wild three times, A Test of Will five times, The Door is Closed! once (I lost two more during a forced discard), two Thror’s Maps (one got discarded) and one Heir of Earendil.  (I think I should have played another along the way.)  I had both None Return and Leave No Trace in my hand at times, but never managed to play them for various reasons.\n\nSo in the end I think the deck pulled its weight, but that was only possible because all four decks were coordinated to work together.  Along the way I took the deck through multiple configurations and ended up settling on Arwen, Mirlond and Berevor.  The low starting threat helped keep enemies off of me and the Elrond’s Councils balanced out the Heirs.  It wasn’t really a victory display deck though.  I never felt there was enough room for Keen as Lances and it felt more win more.  I was always discarding it early to Arwen in testing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3120789","commentId":3120789,"userName":"Kakita Shiro","timestamp":1513024146,"content":"> 1 hour ago, Bullroarer Took said:\n> \n> So we manage to put a team together for the Fellowship event and in the end I took the blue-green control deck. \n\nLink to a decklist, or are you keeping it under wraps?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3120954","commentId":3120954,"userName":"Bullroarer Took","timestamp":1513028097,"content":"> 1 hour ago, Kakita Shiro said:\n> \n> Link to a decklist, or are you keeping it under wraps?\n\nhttp://www.ringsdb.com/decklist/view/7135/earendil-control-purple-1.0 [http://www.ringsdb.com/decklist/view/7135/earendil-control-purple-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262608-lore-control/?do=findComment&comment=3120958","commentId":3120958,"userName":"Bullroarer Took","timestamp":1513028224,"content":"You won't see Heir of Earendil in there's it is proxies by Tale of Tenuvial.  W made a last minute adjustment and added a third copy."}]}