{"url":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/","title":"Custom Campaign PODs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3068146","commentId":3068146,"userName":"PeterW89","timestamp":1510081452,"content":"Over the last year or so I've been working on a set of custom campaign expansion modeled on the saga campaign. My idea was that they should be about the size of the Nightmare POD expansions, so I set myself a twenty card limit: 9 campaign cards, 9 boons and burdens, and a set of Trait/Skill boons like those found in The Black Riders/Treason of Saruman. I'm not a big fan of the +1 threat penalty, as it seems to penalize certain deck types a lot more than others, so I decided to use victory points as a sort of XP which could be used to get upgrades and take the place of the threat penalty.\n\nI've finished working on the first three cycles as well as the hobbit, and have tested each of them a couple times now on a couple different difficulty levels, and I'm at the point where I'd love to get some feedback. I actually did a test print of the first two cycles through Artscow, and they turned out very well, but I ended up revising them all and need to print them out again.\n\nI've written up a bunch of my design ideas for the first two cycles, and am planning to write up my thoughts on the rest, but I'd love to hear what you guys think of what I have so far. If you have any ideas on how to improve the systems, or specific cards, or if you have any ideas for future cycles, please let me know!\n\nYou can check out all the stuff I have so far at my site here [https://pwcooper.wordpress.com/2017/11/07/lord-of-the-rings-lcg-the-campaign-project/]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3068989","commentId":3068989,"userName":"Rouxxor","timestamp":1510126735,"content":"Great job! The campaign cards you made are beautiful.\n\nI don't think that using the victory point as a mechanic to gain cards is a viable thing to do. In the first cycle it seem to have been thinking that way: difficult cards have victory value so it, at some point, reflect the difficulty of winning. But, if they are the goal (and if they feed you) there is a lot of decks who can intentionally stall the game in order to gain a maximum of points, with encounter cards that are not longer a challenge since they are all their deck in play. And that why LoTR quickly change their point calculation system to take into account how many turns you take. And no longer after that they just drop the victory point as a guide to how difficult a scenario was. It just have the purpose to take aside cards that you are not suppose to see another times. So they put victory one on a bunch of cards, and sometime another value of victory (like 50 for the Balrog) because no one really care about scoring anymore. I'm almost certain that playing with scenario further that cycle 4 with your system will be a total nonsense since their is almost no more victory cards. And I have the feeling that, in fact, only the first cycle is really built with a coherent distribution of victory point on encounter cards.\n\nBut it is in fact not a big deal. You award point in the campaign cards anyway, so if I was you I will just enforce that and don't rely anymore on victory point anymore. Trust you: you will be able to balance how many points player will win with a more accurate sight than the designer will do.\n\nI think that the boons cards are too powerful. It is true about the official ones and it is even more true with yours. Since they are here on the beginning of the game your can make your strategy around them and it will work every time (compare Hama to forge master and you will understand why I think there is a problem ^^: no sphere limitation, no action needed to do it, you draw one card and produce one resource each turn. And Hama is a card that work well). You can make something that remove them from the campaign pool (but it would be frustrating) or make most small specific effects. This way player can add them every 2 scenarios and have small choices added each times. Here is the kind of card I think about:\n\n- Cealess Guard: Attach to a hero with sentinel. Encounter action: exhaust Cealess Guard to engage an enemy\n\n- Repeal the shadow: Attach to a ranger hero. Response: After an encounter card raise your threat by any value add 1 resource token on repeal the shadow. Action : Remove two resource token from repeal the shadow to reduce the threat of any player by one.\n\n- Give a trait to a hero and reduce the beginning threat by 1.\n\n- Action: Spend 1 resource to add one willpower to the attached hero. Any player may trigger this action. (Limit once per phase).\n\n[Same cards for defense, attack, sentinel, ranged. Could vary with \"discard a card\" instead of paying one resource]\n\nI also don't understand if we are supposed to begin the campaign of the cycle 2 with the cards gained in the first cycle or if we reset everything on each cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3070143","commentId":3070143,"userName":"PeterW89","timestamp":1510170066,"content":"Yeah, I agree that the boons are definitely too much. Thinking of a couple fixes, Ceaseless Guard would require you to exhaust the attached hero, Master of the Bow would be a combat action, and Forge Master would increase the cost of the card by one instead of decreasing it, since it's already a big advantage getting to play attachments from discard and outside of planning.\n\nAs for the victory points, I think you're probably right about that too. I was dreading trying to figure out what to do with all those 10 victory side quests... I've been thinking it over, and I redid the campaign cards quick to use \"favor\" instead of victory, which would be a special campaign resource used for buying upgrades. Some of the quests give favor equal to the victory points on the display, while others grant it for more specific actions. It needs more testing to get the values right, but it definitely seems like it will allow tighter control over the heroes power curve, preventing them from getting lucky or gaming the system to earn powerful boons too early in the campaign. I'll put then up after I have a chance to give it a run though and see how it works.\n\nAs for linking the campaigns, it's not something that I'd considered. I think it would end up being a whole other project. These are envisioned as contained 9-quest experiences."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3071069","commentId":3071069,"userName":"Lancastrianer","timestamp":1510227730,"content":"Wow, thank you very much for sharing your thoughts and work. I've planned for a long time to do nearly the same and your ideas are quite usefull.\n\nI really love the idea of a map-based expansion with shelter-locations wich the players can earn during the campaign. That maybe would help a lot to connect the differnt cycles. Like Rouxxor I refuse the Idea to use Victorypoints as a main mechanic. But possibly they can help in choosen szenarios to gain that \"favor-points\" you mentioned.\n\nA campaign like this would be a great gift on Christmas for my wife. So I've to start very soon. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] I want to translate your cards into german language. It is possible to get the templates so I can convert them easily? Did you make them with Strange EON? Were you've got the Burden-Sidequest-Template from? \n\nIf you're intrestet I could share my detailed thoughts while the working process with you.  \n\nEdited November 9, 2017 by Lancastrianer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3071492","commentId":3071492,"userName":"PeterW89","timestamp":1510246747,"content":"Here are the PDF files [https://drive.google.com/drive/folders/1DQgmi7RyW9ZYf6fF86AplYbfV_vJr5JN?usp=sharing] for the current version. I will be adding the updated \"Favor\" versions of those cards and SE files shortly.\n\nAs for the Burden Side-Quests - and Burden Enemies as well, as those have not been added to Strange Eons -  I made them myself, and am working on templates for Boon Side-quests and Boon Heroes, which I'd also be happy to post, although they aren't quite up to the standard of some of the other stuff out there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3072894","commentId":3072894,"userName":"Lancastrianer","timestamp":1510307385,"content":"That would be great. Wich software did you used? Is it possible to get the templates from you? As said I really want to translate them, becouse my wife is not quiete used with English language. \n\n \n\nEdited November 10, 2017 by Lancastrianer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3074439","commentId":3074439,"userName":"PeterW89","timestamp":1510370252,"content":"Files are all updated! [https://drive.google.com/drive/folders/1DQgmi7RyW9ZYf6fF86AplYbfV_vJr5JN?usp=sharing] The new Favor system hasn't been tasted yet, so it will still likely need some adjustment, but it's good to go if anybody is interested in printing them out and playtesting. It shouldn't be much of a change in terms of design, but the player's power curve should be a bit smoother now. Let me know what you think. SE files are all available as well for anybody who's interested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3076905","commentId":3076905,"userName":"Flrbb","timestamp":1510565729,"content":"I allways love custom made quests and even more: campagins. Anyhow, I had no time yet to read cards&rules of yours. I Just want to add that I do think neither the +1 penality nor that fallen heroes thing is well designed: you cannot play any Caldra decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3076971","commentId":3076971,"userName":"dalestephenson","timestamp":1510572364,"content":"I've actually played through Black Riders and two POD quests with a Caldara fellowship.  In several cases we had to stall the end of the quest until a copy of Fortune and Fate popped up.  If the campaign rules penalized you for a hero *ever* being in the discard pile they'd be badly designed for Caldara, but as an end-of-quest penalty it's only a minor roadbump.  This is especially true since there's no penalty for repeating a quest that you've \"won\", if the consequences of winning are undesirable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3077128","commentId":3077128,"userName":"PeterW89","timestamp":1510581201,"content":"There is a precedent for the distinction between discarded and destroyed, I believe. You could play where heroes are only added to the list when destroyed. Since we're on the topic, what do people think about unique allies being added to fallen heroes? Thematically I'd love it, but it seems like too much bookkeeping and too big a deck building restriction to actually work. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3077321","commentId":3077321,"userName":"Flrbb","timestamp":1510588119,"content":"Not sure, but there is no distinction.\n\nPersonaly I'd like to see such restriction for allies in decks. If a hero is fallen then that character should not be resurected as ally and vice versa. But there has to be a distinction between destoyed and discarded (e.g. Rohan allies which can be easily resurected from discard, Caldara) and also some rule for e.g. having a copy of a card in the discard and another one on table. And also fofo\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/262737-custom-campaign-pods/?do=findComment&comment=3077467","commentId":3077467,"userName":"PocketWraith","timestamp":1510592482,"content":"> 1 hour ago, Flrbb said:\n> \n> If a hero is fallen then that character should not be resurrected as ally\n\nPretty sure this is already in the rules (though the reverse is not). You can't use the ally version of a Fallen Hero."}]}