{"url":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/","title":"Time for a new forum game?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3090931","commentId":3090931,"userName":"CaffeineAddict","timestamp":1511335082,"content":"The forum seems to have turned fairly negative of late, and I miss the positivity there used to be here.\n\nPerhaps its time for a new forum game to give people something fun to discuss?\n\nI enjoyed Seastan's Random walk to Mordor a couple of years ago:\n\nAnyone up for something similar again?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091190","commentId":3091190,"userName":"PigsAreOurEquals","timestamp":1511356963,"content":"Yeah why not. I quitte like the deckbuilding puzzles. \n\nHas anyone ever tried building an encouter deck and seeing if you can beat your own best decks? \n\nJust a random thought, I haven't put any thought into how well this would work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091250","commentId":3091250,"userName":"dalestephenson","timestamp":1511359687,"content":"I don't need a custom encounter deck to beat my own best decks, the tougher quests do fine on their own...\n\nI do wonder what the effect would be of swapping out encounter sets.  For example:\n\nPassage Through Mirkwood uses the Spiders of Mirkwood and Dol Goldur Orcs encounter sets in addition to its own.  Its own set (Forest Spider, Old Forest Road) and Spiders of Mirkwood (Ungoliant's Spawn) are required.  But Dol Goldur Orcs are not.  What Orc-using encounter set would make Passage Through Mirkwood most difficult, if just dropped into the quest?\n\nBattle of Carn Dum uses Dark Sorcery, Angmar Orcs and its own encounter set.  Its own set is required, but the other two are not.  If we substituted a different orc-using encounter set and a different set with at least three treacheries, which would make the quest easiest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091338","commentId":3091338,"userName":"PocketWraith","timestamp":1511362666,"content":"> 48 minutes ago, dalestephenson said:\n> \n> I don't need a custom encounter deck to beat my own best decks, the tougher quests do fine on their own...\n> \n> I do wonder what the effect would be of swapping out encounter sets.  For example:\n> \n> Passage Through Mirkwood uses the Spiders of Mirkwood and Dol Goldur Orcs encounter sets in addition to its own.  Its own set (Forest Spider, Old Forest Road) and Spiders of Mirkwood (Ungoliant's Spawn) are required.  But Dol Goldur Orcs are not.  What Orc-using encounter set would make Passage Through Mirkwood most difficult, if just dropped into the quest?\n> \n> Battle of Carn Dum uses Dark Sorcery, Angmar Orcs and its own encounter set.  Its own set is required, but the other two are not.  If we substituted a different orc-using encounter set and a different set with at least three treacheries, which would make the quest easiest?\n\nMy immediate impulse answer would be to just swap them. Put Angmar Orcs into Passage and Dol Guldur Orcs into Carn Dum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091390","commentId":3091390,"userName":"Rajam","timestamp":1511364363,"content":"Build an encounter deck with all the cards having surge :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091422","commentId":3091422,"userName":"dalestephenson","timestamp":1511365512,"content":"Build an encounter deck with nothing but 1-hp enemies.  Then run Thalin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091473","commentId":3091473,"userName":"dalestephenson","timestamp":1511367067,"content":"> 58 minutes ago, PocketWraith said:\n> \n> My immediate impulse answer would be to just swap them. Put Angmar Orcs into Passage and Dol Guldur Orcs into Carn Dum.\n\nThat'd be my impulse too, but I think one of the Goblin encounter sets from OHUH may be easier -- while the enemies are also orcs, they ramp up with Goblins/Caves, which would do limited damage in Carn Dum.  Dol Goldur Orcs is easier than Angmar Orcs, but Necromancers Reach would still be bad and Dol Goldur Beastmaster's extra shadow card wouldn't be good.\n\nSwapping out Angmar Orcs for the set from HoN with Orc Arsonist and Orc Rabble would probably make Carn Dum harder.  Orcs that get powered up by shadows and hand out extra shadows to engaged enemies would be bad news in that quest.  But with Passage of Mirkwood's easier shadows, I'm not sure it'd be the worst set for that quest.  I think the hardest to add to passage might be the Uruk-hai from Treason of Saruman: Isengard Uruk, Uruk-Hai fighter, and Fighting Uruk-Hai treachery.  Nothing like a little toughness and archery to make Passage more of a challenge, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091703","commentId":3091703,"userName":"Authraw","timestamp":1511372866,"content":"I really like where this thread is going. I have always been disappointed that my encounter cards don't see use outside of the handful of quests that they're meant to be a part of. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3091965","commentId":3091965,"userName":"Authraw","timestamp":1511379589,"content":"Okay, here's a game:\n\nQuest Mash-Up\n\n1. Randomly select two quests that you own. Botomir from the COTR Discord channel may be useful here. \n\n2. Fetch all of the encounter cards from those two quests. If you have the Nightmare version of either quest, fetch those cards too. Put them in a single pile, called the \"mash-up deck\". \n\n3. Pick one of the two quests to actually play. \n\n4. Flip through its quest stages and remove any cards from the mash-up deck that are explicitly named in the quest cards for your selected quest. Set those cards aside. \n\n5. Shuffle the mash-up deck.\n\n6. Divide the mash-up deck into two equal piles.\n\n7. Randomly select one pile to be the encounter deck. Set the other pile back in the box, it will not be used. \n\n8. Shuffle the set-aside cards from step 4 into the encounter deck.\n\n9. Play your chosen quest with the newly formed encounter deck. \n\n10. Come back here and tell us how it went! What crazy narrative moments occurred? Were there any unexpected combos between the two quests? \n\nRepeat as many times as is fun! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3092535","commentId":3092535,"userName":"Rouxxor","timestamp":1511393562,"content":"I'm really afraid that some quests will, in fact, loose the spirit who bind the encounter cards one with the other. But I'm interested to know the result if someone accept to play this way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3092610","commentId":3092610,"userName":"Authraw","timestamp":1511396543,"content":"> 38 minutes ago, Rouxxor said:\n> \n> I'm really afraid that some quests will, in fact, loose the spirit who bind the encounter cards one with the other. But I'm interested to know the result if someone accept to play this way.\n\nOh I'm sure that they will. But half the fun is in seeing just how cohesive /  not cohesive the result is! \n\nI asked Botomir for two quests and got Foundations of Stone and Shelob' s Lair. I'm going to have to figure out what to do with the double-sided Gollum / Smeagol card, but from a mood standpoint I like the idea of randomly running into an invincible spider in the depths of Moria, or terrible nameless horrors in the tunnels of Cirith Ungol. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3092940","commentId":3092940,"userName":"Khamul The Easterling","timestamp":1511414081,"content":"I remember Tolkien Lore Riddle game back in the day, that was the best :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3093171","commentId":3093171,"userName":"PigsAreOurEquals","timestamp":1511428596,"content":"> 4 hours ago, Khamul The Easterling said:\n> \n> I remember Tolkien Lore Riddle game back in the day, that was the best :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png]\n\nCare to link or explain how that went?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3093994","commentId":3093994,"userName":"divinityofnumber","timestamp":1511473960,"content":"Building an encounter deck would be absolutely brutal. I would include a ton of the following:\n\n1) Multi-sphere hate cards AND mono-sphere hate cards, so there is no way to get around some massive damage in that respect\n\n2) Tons of surge\n\n3) Cards that don't let heroes ready\n\n4) Tons of archery\n\n \n\nIf I were to build an encounter deck with no restrictions or limitations or restrictions, it would absolutely destroy just about any player deck or decks. For example, I could just include all cards with surge, aside from brutal condition effects that make heroes useless, or things that do mass damage or mass threat increase. \n\nEdited November 23, 2017 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3094134","commentId":3094134,"userName":"Hawkstrike","timestamp":1511481541,"content":"Pull the five most useless cards you can think of, and put two of each of them in your deck. Build the rest of the deck to make Brok Ironfist shine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3094216","commentId":3094216,"userName":"Khamul The Easterling","timestamp":1511489711,"content":"> 16 hours ago, PigsAreOurEquals said:\n> \n> Care to link or explain how that went?\n\nThe good ol' forum game: https://community.fantasyflightgames.com/topic/82387-forum-game/ [https://community.fantasyflightgames.com/topic/82387-forum-game/]\n\nIt was quite involved and fun, consisted of one member at a time creating riddles and clues, and everyone trying to guess who or what the Middle earth related answer was.  Good Lore tester haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3095468","commentId":3095468,"userName":"donkler","timestamp":1511581068,"content":"Play the Saga but with Fellowship Aragorn and he has the Ringbearer trait. Also, your other 3 heroes must be the Lore/Tactics/Leadership Aragorns and your deck cannot have allies. The \"Aragorn just does it himself Challenge\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3095900","commentId":3095900,"userName":"dalestephenson","timestamp":1511632210,"content":"I did a mash-up with Carn Dum and Passage Through Mirkwood.  I've only played the Passage side so far, with my Black Serpent Fellowship 2.0, which while better than 1.0 still isn't very good:\n\nhttp://ringsdb.com/fellowship/view/3537 [http://ringsdb.com/fellowship/view/3537]\n\nI started with Gather Information, which I've learned is the critical starting quest to pull in Arwen ally (for Fastred) and Firefoot (for Eomer).  Then I took out Orc Ambush.  I continued the turtling with Send for Aid and Prepare for Battle.  At this point I'm a good shape, I've cancelled a nasty Carn Dum treachery and although my heroes are banged up, my board state is pretty good and there's no enemies left.  I was questing for over 20 at this point, so I could work on the main quest for a change and should cruise to victory, but...\n\nThere was yet another side quest in the staging area, taunting me.  Furious Charge was sitting there, it wouldn't trigger the non-existent Thaurdir, there were no enemies in play, and I could clear stage one while bumping Thurindir's willpower to seven.  The only fly in the ointment was that Fastred had two hits already, so even though he was shadow-immune, with -2 defense he could only safely handle 4 attack.  But it would be winning in style...\n\nSo I did it, and out on cue popped two enemies, one of which was Angmar Captain, with his 5 attack and attack-again if ally is discarded ability.  Eomer and Khaliel were ready, but with -2 defense he would kill either.  He would kill Fastred.  So I had to chump and hope for the best.  Down went Khaliel's Tribesman, attack again.  Down went Yazan, attack again.  Down went Jubayr -- and I finally discarded a non-ally from the top of the deck before a hero had to die.  Khaliel and Eomer took him down, but I was down to one Harad ally.\n\nStill, I had enough questing power to power through the last two stages (Beorn's Path turned out to be the final stage).  One last strick was in store for me -- Hummerhorns came out in my stage two turn, and one deck had already crept over 40 (Song of Earendil hadn't come out and some doomed Carn Dum treacheries drove the threat up).  If I'd been sub-40 Eomer could've easily disposed of him the next turn, but that wasn't possible so poor Idraen had to die.\n\nI still haven't done the other half of the mash-up -- I think it won't go well.  Thaurdir's just too tough for this fellowship.\n\nEdited November 25, 2017 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118256","commentId":3118256,"userName":"dalestephenson","timestamp":1512874683,"content":"I got around to doing the other half of the mash-up, and as I expected it didn't go well.  Even with a bunch of core encounter cards, the sorcery events were still the death of me....\n\nWith my Black Serpent fellowship, they rely on an initial side-quest being cleared (I've learned the critical quest is Gather Information, to pluck out Arwen ally for Fastred and Firefoot for LeEomer).  The heroes actually quest better in Battle mode than normal, but the allies are heavily tilted towards willpower.  So I absolutely need to clear Accursed Battlefield early.  The treachery that discards cards from each deck came out, added 10 threat to staging, causing threat to go up massively and leading to location lock.\n\nI tried it in easy mode, but removing the gold cards leaves lots of nastiness, like the card that flips Thaurdir, which caused a hero to die (Fastred was ready, but without defensive help can't survive the six attack -- and the -10 engagement cost for the other enemies means other heroes would be taken undefended attack.  I scooped.\n\nSo I went for the ultimate mashup, and did Carn Dum with *only* the mentioned cards (Carn Dum Garrison, Thaurdir, and Accursed Battlefield), and the rest of the cards from the Passage from Mirkwood quest (minus Forest Spider, Ungoliant's Spawn, and Old Forest Road -- the cards mentioned on that side).  This turned out to be a walk in the park, since with no sorcery treacheries around to hand out shadows, Thaurdir just sits tamely in the staging area for all of stage one along with two 1-threat Garrisons.  Better yet, the two key cards for me (Arwen and Firefoot) each showed up in my opening hand. That was my call to turtle by leisurely completing four or five player side quests and building up a massive army, plus build up Fastred's defense to the point were he could take two attacks (one at 6 at one at 5) with no shadow.  I did have to dispose of a couple of Caught in the Web, but the Hummerhorns came out before they had to engage and Eomer was able to kill them easily in staging.  Finally I ended by clearing stage one in a single turn, then clearing stage two in the next turn and taking down Thaurdir.  It's really the sorcery treacheries that make Carn Dum lethal for me.\n\nSo with Carn Dum requiring sorcery treacheries to power up Thaurdir, what other encounter sets could it use instead of its own?  Here's the card count:\n\nDark Sorcery (used by Carn Dum): 2x Dark Sorcery, 3x Terror of the North, 3x Heavy Curse\n\nCarn Dum:  2x The Sky Darkens, 3x Vile Affliction\n\nDeadman's Dike set: 2x Unnatural Fog\n\nDread Realm: 4x Death and Calamity, 2x Possession, 2x A Fell Dread \n\nTreachery of Rhuadar: 3x Curse of the Years, 3x Dark Covenant, 3x Haunting Fog\n\nBattle of the Pelennor Fields: 2x Spells of Ruin, 2x Dread and Despair, 2x Shadow of Mordor\n\nIt looks like trading Dark Sorcery's 8 treacheries out for any generic set would make Carn Dum easier, but there's three other quests that have more sorcery treacheries in their set than Carn Dum does.  It's possible a mash-up with any of those three sets might actually make Carn Dum worse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118317","commentId":3118317,"userName":"sappidus","timestamp":1512880153,"content":"Just wanted to say that I'm really amused by this idea, and plan to get around to trying something in this style after all my local Fellowship stuff has wrapped up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118561","commentId":3118561,"userName":"PocketWraith","timestamp":1512909657,"content":"> 9 hours ago, dalestephenson said:\n> \n> The treachery that discards cards from each deck came out, added 10 threat to staging,\n\nUnless you revealed multiple copies of it, this is impossible, as there are only four different card types you can discard for a maximum of 8 threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118578","commentId":3118578,"userName":"dalestephenson","timestamp":1512910891,"content":"I've consistently been doing that treachery wrong, I think.  I interpreted it as contributing 2 threat for *each player* according to the types revealed.  I guess all my Carn Dum losses are tainted now ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118833","commentId":3118833,"userName":"Rajam","timestamp":1512925221,"content":"we should play Mafia"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3118931","commentId":3118931,"userName":"Onidsen","timestamp":1512931583,"content":"> 1 hour ago, Rajam said:\n> \n> we should play Mafia\n\nSome of us already are in the Star Wars: Armada subforum on this site. You're welcome to join us."},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3119146","commentId":3119146,"userName":"Rajam","timestamp":1512945451,"content":"> 3 hours ago, Onidsen said:\n> \n> Some of us already are in the Star Wars: Armada subforum on this site. You're welcome to join us.\n\nlink?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/263708-time-for-a-new-forum-game/?do=findComment&comment=3119262","commentId":3119262,"userName":"Onidsen","timestamp":1512951350,"content":"> 1 hour ago, Rajam said:\n> \n> link?\n\nTry this [https://community.fantasyflightgames.com/topic/253489-day-0-thread-mafia-discussion/?do=findComment&comment=3119260]."}]}