{"url":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/","title":"To the MOD - Digital version.. WHAT ARE YOU THINKING?!!!! Please do the REAL rules!!!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117897","commentId":3117897,"userName":"TragicTheBlathering","timestamp":1512850352,"content":"So after years and years of waiting for a digital game... WHY THE BLUE **** ARE YOU CHANGING THE RULES?\n\n \n\nOnly 2 phases? Simultaneous attacks? new deck building rules? The list goes on.\n\n \n\nI mean what are you thinking? Why are you doing this..\n\n \n\nJUST MAKE IT THE REAL GAME...\n\nWhy go to all this trouble and not actually give us the game we love to play?\n\nEdited December 9, 2017 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117901","commentId":3117901,"userName":"sappidus","timestamp":1512850552,"content":"> 1 minute ago, TragicTheBlathering said:\n> \n> So after years and years of waiting for a digital game... WHY THE BLUE **** ARE YOU CHANGING THE RULES?\n\nI am obviously not FFG/FFI, but presumably they are thinking of appealing to a different (read: bigger) audience than the passionate tribe of players that are deeply into the physical card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117914","commentId":3117914,"userName":"TragicTheBlathering","timestamp":1512850966,"content":"That is just BS.. stop making excuses. i develop computer games for a living and I know exactly what is up. This is a cash grab.\n\nThe rule changes are just to make the game easier to produce at a production level. Go into any digital card game community and everyone is asking FOR complexity.. not the removal of it. I mean look at the Magic the Gathering steam app.. every version they had to add more and more of the original functionality to the app to restore the game.\n\nI can live with F2P, I have nothing agaist that.. guys gotta eat and pay rent.. so that is fine... but this is NOT LoTR and it pisses me off. After all this time of waiting and hoping fora digital version.\n\nAnd you know what? People would play it with the original rules.. the player base would be just as large, maybe bigger as pretty much anyone who loved the game but stopped playing will get it. The idea that digital players want dumbed down simple versions of boardgames is so wrong it is beyond laughable and loops into ignorant idiocy.\n\nRespect your audience and give us the real darn game\n\nEdited December 9, 2017 by TragicTheBlathering"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117930","commentId":3117930,"userName":"sappidus","timestamp":1512851996,"content":"> 11 minutes ago, TragicTheBlathering said:\n> \n> The idea that digital players want dumbed down simple versions of boardgames is so wrong it is beyond laughable and loops into ignorant idiocy.\n\nWhile this is not technically an ad hominem attack, it veers close enough to one that I feel disincentivized to pursue this discussion further."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117946","commentId":3117946,"userName":"TragicTheBlathering","timestamp":1512852792,"content":" \n\n> 11 minutes ago, sappidus said:\n> \n> While this is not technically an ad hominem attack, it veers close enough to one that I feel disincentivized to pursue this discussion further.\n\nYou're right its not.. I made no personal attack of any kind. But I get it, it is nearly impossible to make any kind of cogent argument for the gutting of the rule system. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117947","commentId":3117947,"userName":"Gandalf196","timestamp":1512852821,"content":"I'd like to add that allowing players to \"import\" their physical expansions/packs would definitely be the correct move. Buying something you already have seems absurd to me.\n\nEdited December 9, 2017 by Gandalf196"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117968","commentId":3117968,"userName":"John Constantine","timestamp":1512853846,"content":"> 15 minutes ago, Gandalf196 said:\n> \n> I'd like to add that allowing players to \"import\" their physical expansions/packs would definitely be the correct move. Buying something you already have seems absurd to me.\n\nBut you don't have the digital game, you have the physical game =O\n\nWhat seems absurd to me is you expecting the company to invest helluva load of money and time into developing something, and then just give it away for free to you.\n\n \n\nAs for the game and how it feels and plays... I won't be saying much until I try it myself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117980","commentId":3117980,"userName":"Gandalf196","timestamp":1512855268,"content":"> 16 minutes ago, John Constantine said:\n> \n> But you don't have the digital game, you have the physical game =O\n> \n> What seems absurd to me is you expecting the company to invest helluva load of money and time into developing something, and then just give it away for free to you.\n> \n>  \n> \n> As for the game and how it feels and plays... I won't be saying much until I try it myself.\n\n2 things: first, obviously I did not mean that I'm paying for the same thing. The product is evidently different, no question about it, but it seems reasonable to me that FFG, let's say, at least facilitate the acquisiton to their faithful costumers. Second point: certanily they are aiming for a larger audience, so giving a discount or even giving some packs for free, as you say, to those who already own the physical copies certainly would'nt ruin their business."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3117989","commentId":3117989,"userName":"John Constantine","timestamp":1512855679,"content":"> 6 minutes ago, Gandalf196 said:\n> \n> 2 things: first, obviously I did not mean that I'm paying for the same thing. The product is evidently different, no question about it, but it seems reasonable to me that FFG, let's say, at least facilitate the acquisiton to their faithful costumers. Second point: certanily they are aiming for a larger audience, so giving a discount or even giving some packs for free, as you say, to those who already own the physical copies certainly would'nt ruin their business.\n\nBonus for owners of physical products would be a nice touch, but importing your entire collection? Effectively reducing their revenue to 0? Sorry, that's ridiculous."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118014","commentId":3118014,"userName":"ParinorB","timestamp":1512857621,"content":"I guess I don't know the details of the rules but perhaps they want to use the digital game as an opportunity to make somewhat of a \"second edition\" of the game that deals with some of the quirks of the original game (e.g. location management etc.) - all by not destroying the successful card game.\n\nIn other words, it sounded to me the idea was not to make a digital version of the card game but to make a different game that can exist alongside the card game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118018","commentId":3118018,"userName":"Kakita Shiro","timestamp":1512857791,"content":"From what I can see, it's the difference between Elder Sign and Arkham Horror. Similar themes, different games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118036","commentId":3118036,"userName":"Bunston","timestamp":1512858714,"content":"All I care is that the game is good and the prices are fair. I'm curious how they address player snowballing and location lock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118039","commentId":3118039,"userName":"GrandSpleen","timestamp":1512858870,"content":"We've talked on the forum before about how it would be hard to implement a digital version of the game because of all the grey rules areas.  The software developers would have to make a call on every single one of those grey areas, there isn't room for \"would this work?\" in an automated digital product.  The game either allows it or it doesn't (or it glitches out).  So: I had been wondering, if they did make a digital version, how many of those rules judgments would conflict with rulings that have been made for the physical game?  Would there be repercussions for players of the physical game?\n\nLooks like we'll never know.  They did a clean side-stepping of the issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118081","commentId":3118081,"userName":"xchan","timestamp":1512860963,"content":"I want to try this game out before judging it. The changes to deckbuilding and combat doesn't bother too me much and make the game play faster, which is great for mobile gaming. The removal of questing though (unless I'm missinterpreting the info) is a big change and I'm not sure one that I can get behind. I don't want to play a game that revolves entirely around combat, there are plenty of other game cards for that.\n\nEdti: Upon further inspection, it looks like they haven't removed questing entirelly. What they have removed is the defense value. Characters have strenght, willpower and health (which looks like previous hp+def stat). Willpower is used to \"fight\" locations, while strenght is used to fight enemies. No info on quests though.\n \n\n> 33 minutes ago, ParinorB said:\n> \n> I guess I don't know the details of the rules but perhaps they want to use the digital game as an opportunity to make somewhat of a \"second edition\" of the game that deals with some of the quirks of the original game (e.g. location management etc.) - all by not destroying the successful card game.\n> \n> In other words, it sounded to me the idea was not to make a digital version of the card game but to make a different game that can exist alongside the card game.\n\nThat's a nice way to look at it. It does seem to be LotR 2.0, whithout actually being LotR 2.0. \n\nIt seems that location managment is quite different now, as there's no questing phase at all. They behave as enemies that we can \"fight\" at will, allowing us to remove them quicker.  Will see how it works.\n\nIn that train of thought, I'm wondering if we can adapt the Sauron's deck so we can make a competitive variant for our tabletop version (or if they will eventually release a \"play as the enemy\" mode for the digital app). They have introduced draw and resources for the encounter deck, which could be their way to prevent enemies showing up early in the game, improving on the quests pacing, but also opens the possibility to activelly pilot the encounter decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118159","commentId":3118159,"userName":"Lecitadin","timestamp":1512866504,"content":"I'm just happy that the digital version is like a light version of the physical card game, so it won't cannibalise the physical game. It's a smart move from them to produce a cash grabber, like Tragic calls it. It may also make some new players of the digital version try the real cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118395","commentId":3118395,"userName":"staz0801","timestamp":1512889450,"content":"> 10 hours ago, TragicTheBlathering said:\n> \n> So after years and years of waiting for a digital game... WHY THE BLUE **** ARE YOU CHANGING THE RULES?\n> \n>  \n> \n> Only 2 phases? Simultaneous attacks? new deck building rules? The list goes on.\n> \n>  \n> \n> I mean what are you thinking? Why are you doing this..\n> \n>  \n> \n> JUST MAKE IT THE REAL GAME...\n> \n> Why go to all this trouble and not actually give us the game we love to play?\n\nYou got worked up in a hurry, huh? As somebody who also develops digital games, and having put 6 out to market in the past few years, I can tell you you're a little off base with the whole complexity over simplicity argument. Its not the right comparison. Streamline, approach-ability, and accessibility reign on these kinds of games. If complexity always won out, how in the world did Hearthstone shoot to a far and away #1 in the digital card game space? So, that whole argument falls apart immediately. Also, its extremely rare that a game translates from one medium to another 1:1 successfully. Its also rare for books to movies and vice versa. Its a different platform and its a different audience to a degree. They are making a different game for a different platform and targeting an expanded audience. THAT is what they're thinking.\n\nWhy would they go to the trouble of giving you the same game you already own on a different platform? You already own it. If I could give you some advice, it would be to just have an open mind and try this game out on its own terms. I know you want a very specific product, despite any problems in translation to a new medium or gaining adoption with new players. But, that's not what they're making. And, just maybe, they know what they're doing and it'll all work in the end."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118396","commentId":3118396,"userName":"Seastan","timestamp":1512889532,"content":"If this had been the announcement I would have been disappointed. I already have two ways to play this game with the full rules (with cards and with OCTGN). Not to mention, as GrandSpleen said and as I've mentioned before, the rules for this game are nowhere near being clear and precise enough to be digitized. I mean, just look at my attempt to make sense of one fraction of one step of one phase of this game (the revealing of an encounter card): https://goo.gl/LKVZ7C [https://goo.gl/LKVZ7C]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118417","commentId":3118417,"userName":"jacenat","timestamp":1512891554,"content":"> 9 hours ago, Bunston said:\n> \n> All I care is that the game is good and the prices are fair. I'm curious how they address player snowballing and location lock.\n\nSeems that locations are not part of the encounter deck anymore. And not being able to chose defenders might kill your ability to keep your ball rolling. Really depends on the exact changes and balance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118421","commentId":3118421,"userName":"ssgorik","timestamp":1512891863,"content":"I'm someone who plays the game for the story and an easy time so I house rule the crap out of it to actually win. From what I've read this digital version really appeals to me. Even though the streamlining and the \"plays in 10-20 minutes\" bit make me think it will be easier than the physical version, I hope there are difficulty levels including one for folks like me who want a super easy difficulty. If there is one that's easy enough and I like playing it then I'll look at a more difficult version, but I'd always play easiest first to get my kicks on the story. To me having to play a bunch of times to win isn't fun. I realize this is not the case for a lot of folks, but I'm one of \"those\" people. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] I get upset when the easy \"I just want to experience the story\" difficulty in Arkham Horror LCG causes me to lose a couple times first (I don't house rule that one, I did start taking out some of the -2 tokens and replacing them with 0's though, but the rules are still the same)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118425","commentId":3118425,"userName":"CEOWolf","timestamp":1512892557,"content":"So are all card game mmos except a few... HS clones? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118430","commentId":3118430,"userName":"Cold Iron1","timestamp":1512893163,"content":"While I can understand not liking some aspects of this adaptation, such as the change to resources and pools, other provide an interesting challenge particularly in deck building. For instance with the requirement that to have a card in a deck you must have a hero of matching sphere. This means that for, lets say, a dwarf deck you wound really need to pick between Thorin and Dain as with two leadership and one other it would be hard to have an effective number of dwarfs or abilities. Of cores that leaves questions over what this will mean for cards that granted heroes other spheres. Also the idea that some cards can only be used while you have multiples of the same sphere pose an interesting challenge. Also some changes might be made so you can do something silly, like remover the encounter deck from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118440","commentId":3118440,"userName":"John Constantine","timestamp":1512894143,"content":"For cards that granted other spheres, it is simple: they will either dissapear, or be reworked into something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118445","commentId":3118445,"userName":"jacenat","timestamp":1512894721,"content":"> 12 hours ago, TragicTheBlathering said:\n> \n> some random drivel\n\nWhy did I fully expect this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118480","commentId":3118480,"userName":"Aiwendil","timestamp":1512900731,"content":"I'd strongly suggest giving the game a chance before voicing such a strong opinion. To me it was an exciting announcement, if they did a digital copy of the physical game then that would render my physical collection almost obsolete. The reduced hassle of drawing and set-up time would be a great benefit for me. I love that these will be two different games, it suits different playstyles. This way I will keep collecting the physical game and hopefully also expand the digital game if I like it.\n\n \n\nTo me it sounds similar to how the new Star Wars Imperial Assault app introduces a new way to play the game rather than replace the existing game. Honestly I'm very much looking forward to trying out this digital version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118810","commentId":3118810,"userName":"Hannibal_pjv","timestamp":1512924609,"content":"> 20 hours ago, Gandalf196 said:\n> \n> I'd like to add that allowing players to \"import\" their physical expansions/packs would definitely be the correct move. Buying something you already have seems absurd to me.\n\nVery unlikely. I have newer seen that happens. Different company is making this game, so they will gather as much money as they can with it...\n\nThat is why it has store in it.\n\n \n\nThe interesting part is how they make it. Those one time use card that you have to buy, sounds a lot like play to win...\n\nAnother card game did try this (Pathfinder adventures). It is also coup and because it is coup, nobody was willing to pay for having extra boost, because you was gaming against a system, not against another person, who had better deck that you have... So no need to put money to upgrades. They did swing from free to play, to normal buy the game and play, because they have to...\n\n \n\nSo either this games forces you to buy content so that you can make progress. (Pay to win) or other vice make money, so it is interesting to how they are planning to get money. Normal competative \"I have also get better cards\" does not work in coop environment. So they have to invent other means to make money. \n\nEdited December 10, 2017 by Hannibal_pjv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118854","commentId":3118854,"userName":"cyberkeith","timestamp":1512926890,"content":"> 20 hours ago, Gandalf196 said:\n> \n> I'd like to add that allowing players to \"import\" their physical expansions/packs would definitely be the correct move. Buying something you already have seems absurd to me.\n\nthis is what everyone was wanting with that new D&D Beyond, but they said \"nope, two different products\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118881","commentId":3118881,"userName":"Freeman","timestamp":1512928762,"content":"> 21 hours ago, TragicTheBlathering said:\n> \n> So after years and years of waiting for a digital game... WHY TH\n> \n> I mean what are you thinking? Why are you doing this..\n> \n> Why go to all this trouble and not actually give us the game we love to play?\n\nBecause I already have the game in digital format covered by OCTGN.\n\nThe real question is: why would people pay for something they already havefor free? \n\nThey need to create something different because they know most people wouldn't pay for a refined digital version of OCTGN. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118912","commentId":3118912,"userName":"werdnaegni","timestamp":1512930474,"content":"Man. What a post. We have the card game. We have OCTGN, which is a chore to play imo, which isn't OCTGN's fault, it's the fault of trying to make an app for a game that just isn't conducive to being an app.\n\nI'm glad they're changing it. I'll play this with an out-of-town friend who has never played the physical game, and be thankful that we don't have to tackle all the gray areas and management over an app. It would just be clunky imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118922","commentId":3118922,"userName":"wolframius","timestamp":1512931108,"content":"> 37 minutes ago, Freeman said:\n> \n> Because I already have the game in digital format covered by OCTGN.\n> \n> The real question is: why would people pay for something they already havefor free? \n> \n> They need to create something different because they know most people wouldn't pay for a refined digital version of OCTGN. \n\nIt is an entirely different game. The favor of the lady in the digital game will probably be completely different from the physical version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3118926","commentId":3118926,"userName":"Freeman","timestamp":1512931404,"content":"> 1 hour ago, wolframius said:\n> \n> It is an entirely different game. The favor of the lady in the digital game will probably be completely different from the physical version.\n\nI know it is an entirely different game, that was exactly my point: if they were the same, they'd probably need to shut down LOTR under OCTGN in order to sell this, which could be perceived negatively by some players.\n\nEdited December 10, 2017 by Freeman"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3119353","commentId":3119353,"userName":"JJ48","timestamp":1512957246,"content":"> On 12/9/2017 at 4:34 PM, Gandalf196 said:\n> \n> 2 things: first, obviously I did not mean that I'm paying for the same thing. The product is evidently different, no question about it, but it seems reasonable to me that FFG, let's say, at least facilitate the acquisiton to their faithful costumers. Second point: certanily they are aiming for a larger audience, so giving a discount or even giving some packs for free, as you say, to those who already own the physical copies certainly would'nt ruin their business.\n\nIt's an interesting thought, but how would they verify that someone owns the physical copy?  The easiest way to do this would be to have unique codes inside each pack to register, but that's impossible with packs that have already been purchased.  Something like cutting out and sending in a proof-of-purchase could work, but besides the logistics of it, you'd also upset a good many players who haven't saved all their packaging over the years.\n\nI like the idea of giving discounts to existing players, but I'm just not sure how feasible it is.\n\n> On 12/9/2017 at 3:22 PM, TragicTheBlathering said:\n> \n> That is just BS.. stop making excuses. i develop computer games for a living and I know exactly what is up. This is a cash grab.\n\nInteresting opinion.  One could also take the view that simply taking the cards they already have and translating them directly to an app with no changes was a \"cash grab\".  One could probably come up with a reasonable argument for any product a company puts out being a \"cash grab\".  It seems to me that most people just throw out the term \"cash grab\" as a general insult whenever a company does something they don't like, regardless of what the company's actual motivation was.\n\n(And yes, companies are out to make money.  This doesn't mean that they're not also trying to genuinely appeal to consumers, too.)\n\n> 8 hours ago, Hannibal_pjv said:\n> \n> Very unlikely. I have newer seen that happens. Different company is making this game, so they will gather as much money as they can with it...\n> \n> That is why it has store in it.\n> \n>  \n> \n> The interesting part is how they make it. Those one time use card that you have to buy, sounds a lot like play to win...\n> \n> Another card game did try this (Pathfinder adventures). It is also coup and because it is coup, nobody was willing to pay for having extra boost, because you was gaming against a system, not against another person, who had better deck that you have... So no need to put money to upgrades. They did swing from free to play, to normal buy the game and play, because they have to...\n> \n>  \n> \n> So either this games forces you to buy content so that you can make progress. (Pay to win) or other vice make money, so it is interesting to how they are planning to get money. Normal competative \"I have also get better cards\" does not work in coop environment. So they have to invent other means to make money. \n\nPersonally, I'd hope for something much like the current LCG system, where you'd pay up-front for a new series of adventures, which would also include new cards for you to use.  If there are one-time-use cards, I hope they're:\n\n1) Useful, but not required\n\n2) Available for purchase with in-game currency that can be gained at a slow pace just through playing (or quicker if you want to actually pay for it).\n\nOverall, I'm cautiously excited about this new app, especially if they keep up the storytelling and lore-referencing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3119355","commentId":3119355,"userName":"Gandalf196","timestamp":1512957470,"content":"> 1 minute ago, JJ48 said:\n> \n> It's an interesting thought, but how would they verify that someone owns the physical copy?  The easiest way to do this would be to have unique codes inside each pack to register, but that's impossible with packs that have already been purchased.  Something like cutting out and sending in a proof-of-purchase could work, but besides the logistics of it, you'd also upset a good many players who haven't saved all their packaging over the years.\n> \n> I like the idea of giving discounts to existing players, but I'm just not sure how feasible it is.\n\nEvery expansion/pack I've bought comes with a proof of purchase certificate, either as a separate piece of card paper or printed on the back of the manuals. I had this in mind when I advanced my argument, thank you for considering it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3130242","commentId":3130242,"userName":"cheapmate","timestamp":1513528535,"content":"> On 9-12-2017 at 9:12 PM, TragicTheBlathering said:\n> \n>  \n> \n> Why go to all this trouble and not actually give us the game we love to play?\n\nBecause you already have the game you love to play, right?\n\nWhy make an identical digital and physical game? Why would you buy one if you already had the other? Having another game in the same setting seems like a good thing to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3130336","commentId":3130336,"userName":"En9a9e","timestamp":1513533449,"content":"For those of you here who haven't and for the sake of a more properly informed argument , I'd advise watching the FFI twitch stream archive before posting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3132648","commentId":3132648,"userName":"JJ48","timestamp":1513628539,"content":"> On ‎12‎/‎17‎/‎2017 at 0:57 PM, En9a9e said:\n> \n> For those of you here who haven't and for the sake of a more properly informed argument , I'd advise watching the FFI twitch stream archive before posting.\n\nWhat's the Twitch channel name?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3133431","commentId":3133431,"userName":"En9a9e","timestamp":1513644794,"content":"> 4 hours ago, JJ48 said:\n> \n> What's the Twitch channel name?\n\nFFI just posted an important links announcement on steam here http://steamcommunity.com/gid/103582791460941068/announcements/detail/2380580896621471058 [http://steamcommunity.com/gid/103582791460941068/announcements/detail/2380580896621471058] \n\nGives you twitch and some other good places to check out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265053-to-the-mod-digital-version-what-are-you-thinking-please-do-the-real-rules/?do=findComment&comment=3133785","commentId":3133785,"userName":"divinityofnumber","timestamp":1513663558,"content":"> On 12/17/2017 at 8:35 AM, cheapmate said:\n> \n>  \n> \n> Why make an identical digital and physical game? Why would you buy one if you already had the other? \n\nSeemed to work out well for WotC.     :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"}]}