{"url":"https://community.fantasyflightgames.com/topic/265288-no-half-trolls-a-nerdy-rant-on-the-haradrim-cycle/","title":"No Half-Trolls? A nerdy rant on the Haradrim cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/265288-no-half-trolls-a-nerdy-rant-on-the-haradrim-cycle/?do=findComment&comment=3122952","commentId":3122952,"userName":"Gizlivadi","timestamp":1513115880,"content":"Ok, so first of all, full disclosure: this is a post expressing some of the thematic letdowns for me this cycle. I'm not trying to say that this cycle is bad or disappointing as a whole at all. It's still a good story, and the quest design is more slick (if punishing) as it's ever been. The thoughts written in this post, while still important to me, are more or less details and don't totally ruin the cycle for me. \n\nThe thing is, I think so much more could've been done themtically this cycle. A few months before the announcement of the Sands of Harad, we were pretty much sure the next expansion would take us to Harad, and obviously my expectations were very high. Think of all the possibilities a place like Harad offers! It has the perfect amount of information and the perfect amount of mystery, allowing for the developers to really be creative while staying in a specific interpretation of what we know about it. But, as the cycle was announced and (very slowly) spoiled, I was incresingly disappointed in the thematic direction it took. Not really for what it was, but for what it could have been. Now, this is obviously only related to the quests (now that we have image spoilers for Poros as well as Cirith Gurat) and not to the player cards. \n\nWhen I thought of Harad, I thought mostly about the different cultures that inhabit it, as well as the different enviroments. Now, for the Sands of Harad box itself I can say it's very good, exploring the 3 main things I was also expecting for it to do: Umbar, the desert itself with weather effects (were-worms also are great), and a quest set in some kind of Haradrim settlement. The following adventure, The Mumakil also nailed one of the spots I wanted when exploring Harad (jungle), but as the next 5 adventures were announced I was more and more shocked by how, and I hate to use this word, thematically generic they are. I mean, think of it. It's Harad, there are so many cultures and places you can explore, like for instance I thought about a pack involving the fight with a tribe of \"Half-trolls of Far Harad\" as Tolkien names them, which is also a theme that could've been easily fitted in Race Across Harad or Cirith Gurat. Another one of the things I was expecting for the most was actually going to a big Haradrim city and infiltrating or attacking a Haradrim palace, overthrowing a Harad lord, something like that. Or, think the fact that, for Sauron's followers, Sauron is a god. Imagine how cool it would've been if we fought in a Haradrim settlement against a Priest of Sauron enemy. There was so much that could have been done with the culture of the Haradrim, but they didn't, and probably we'll never get a chance again.\n\nNow, I get that for story continuity reasons the heroes had to get back to Gondor by the end of the cycle, but, they still could've explored all this and still have the heroes return to Middle Earth in the end. To me, and no offense to Caleb, but it's just that the whole \"Orcs on Wargs\" theme was a hugely uncreative thing to do, especially in Harad. Like, I get that the theme is Haradrim and Free Peoples allying against Sauron, but if the enemies had been other evil, wealthy and powerful Haradrim lords it would've been much more interesting, plus it would've carried the message much more strongly. Some orcs I don't mind, but to me the cycle felt more like \"Orcs with a splash of Haradrim\" instead of \"Haradrim with a splash of Orcs\", which is what I would've expected for the Haradrim cycle. Or, if you are doing an equivalent of Orcs for the main enemies, why not Half-trolls? Or anything else really? Like, so many of these quests fall under the overly repeated persecution Orc quest category, like Mount Gram, To Catch an Orc, etc. That, in Harad, is a real disappointment to me. The whole Orc with Warg theme combined with a Spider focused quest really made the whole thing feel like Mirkwood or Arnor except it's in the desert.\n\nI know that many people will disagree with this, and I can see the argument for that. It'still a good cycle, but I think that a cycle should explore stuff you can see nowhere else in Middle Earth, and now probably our only chance of seeing Half-trolls and more Haradrim is in Nightmare decks for this cycle. Bummer. I really hope this next cycle they don't waste any opportunities and explore the most exotic aspects of Rhovanion, like the Withered Heath and the Woodmen.\n\nSo, as usual any responses welcome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265288-no-half-trolls-a-nerdy-rant-on-the-haradrim-cycle/?do=findComment&comment=3122997","commentId":3122997,"userName":"Jekzer","timestamp":1513117028,"content":"I had the same feeling of \"we're seeing more orcs than haradrim in the Haradrim cycle\". And that surprised me. The spider quest for me was a bit out of place. The others were between good and excellent (hoping for the best with Poros), because at least they gave continuity to iconic enemies like The Black Serpent.\n\nDidn't remember about half-trolls!\n\nI think they decided to be more conservative with this cycle for the sake of not going wild and forcing too much the \"out-of-place\" feeling of deviating from Tolkien lore an aesthetics. That delivered a nicely woven story but at the cost of being less risky.\n\nBut for me, they were less brave compared with the 2 previous cycles, where we explored interesting regions too but battled against fresh foes. Heck, even in Grey Havens/ Dreamchaser we didn't see any orcs!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265288-no-half-trolls-a-nerdy-rant-on-the-haradrim-cycle/?do=findComment&comment=3123008","commentId":3123008,"userName":"dalestephenson","timestamp":1513117232,"content":"I can see the point, but since there are player cards (and even one hero) dependent specifically on orcs, I don't mind orcs showing up in cycles where they reasonably could be left out.\n\nEdited December 12, 2017 by dalestephenson"}]}