{"url":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/","title":"Sneak Attack in the digital version","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122339","commentId":3122339,"userName":"jacenat","timestamp":1513099005,"content":"Thinking a bit about the differences between the physical and digital versions over the past few days, I think this is what I fear the most so far.\n\nIf you are out of the loop on that one, Sneak Attack in the digital version works pretty different. I think caleb mentioned it during the annoucement stream. What it boils down to is that currently it kinda works like this:\n\n> Quote\n> \n> Cost: <unknown>\n> Action: Put into play any ally from the game until the end of the round. If it is still in play at the end of the round, discard it from play.\n\nNow this fits into what Caleb said is exciting about the digital card game: more chance to introduce randomness. Now I am not against the randomness in the card. What I really dislike is how it can pull any ally, regardless if you own the card or not or if you did put it in your deck or not. I understand that this can be exciting, but I also see why the card is included. Hearthstone uses this mechanic from the start and IMHO the prime reason is to show you cards you do not own yet and show you how powerful they are in an attempt to make them more attractive to you.\n\nNow I think this is a deeper problem than most realize. I see 3 distinct problems:\n\nPlayer Trust\n\nI don't expect FFG to release chances and mechnics of the cards to players. With that, you can never be truly sure on if Sneak Attack will not be biased to show you cards you haven't aquired yet, cards that recently released or just cards that fit the current quest/difficulty. I don't think there is anything FFG can do to remedy this. With adverserial games like Hearthstone this is less of a problem as Blizzard has a large incentive to keep the game fair. In a coop game, this incentive is gone, as the encounter deck doesn't care if some players get an easier or harder go at it.\n\nLimiting Deck Construction\n\nBy pulling from all cards, your choices in which cards to include in your deck do not matter any more. This essentially makes Sneak Attack an anti-combo. You can not rely on it to give you something specific. Which is why it does not matter what else you put into your deck. This makes it fit in every deck archetype. Also this creates the additional problem of the card being either too good value so you probably have to include it in most decks or not enough value making it irrelevant in most decks. Both is bad.\n\nCutting Design Space\n\nA card that can fetch every ally released can break a lot of quest designs. In theory quests in the digital game could restrict the cost of allies to a certain value or value range. Sneak attack would override that by default. Also mechanics that punish unique allies or swarmy decks might be disrupted by Sneak Attack. To be honest, I am not that good of a game designer to see all the implications right now. I just know that in Hearthstone, similar cards were the ones that meant trouble for the game. Thanatos, Mage Portal and Shredder come to mind.\n\nIs there a solution to this? Through secondary channels I was able to bring this concern directly to Caleb (albeit in a limited fashion), and the response was that they are just trying it out. Some tweaks include pulling allies just from your collection or your deck. I would very much prefer to limit it to the player deck, but that also means the flair of the card is mostly gone. So I am not banking on them going that route. Pulling from your collection is promising, but might enable optimization strategies where you try only to get very few allies into your collection but these are very powerful, essentially modifying the value of Sneak Attack through your aquisition strategy. Although this would also mean a tradeoff for the player in reduced deck construction space, it might be too strong to pass up.\n\nSo what are your thoughts? Is this card the problem I see in it? or is it largely okay and I should just not worry?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122367","commentId":3122367,"userName":"shoreless","timestamp":1513099832,"content":"> 9 minutes ago, jacenat said:\n> \n> I think caleb mentioned it during the annoucement stream. What it boils down to is that currently it kinda works like this:\n\nDoes it definitely work like this or does it kinda work like this? To be clear, I don't mean to be confrontational or rude, I'm just genuinely curious if the card was revealed to work like this :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nIf so*, then I agree this cuts creative deck design space. The balance of which is going to be very tricky for this digital game. I hope it's simpler and easier, but I don't want to be completely hamstrung when it comes to deck-building.\n\n \n\n*Everything depends on how the game actually plays, which none of us have experienced (I guess tune into the Twitch stream later today)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122383","commentId":3122383,"userName":"Seastan","timestamp":1513100441,"content":"I don''t get it. This is a co-op deckbuilding game. If you don't like the randomness of a certain card, no one is forcing you to include it in your deck. The only problem I could see if certain scenarios are so hard that the only way you can possibly beat them is to use sneak attacks and get super lucky each time. Then in a way it is forcing you to use a card you don't like. But there's no way that this is actually going to be the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122517","commentId":3122517,"userName":"JJ48","timestamp":1513103882,"content":"As someone who primarily builds thematic decks, I'm just considering how funny it will be to have my Dunedain deck going against Angmar, and then have some random Harad ally show up during a Sneak Attack.  XD"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122558","commentId":3122558,"userName":"John Constantine","timestamp":1513104912,"content":"Just my thoughts which I already posted in another thread:\n\nRandomness for the sake of randomness is bad, and this new Sneak Attack is a great example of how good, decisive card simply turned into \"random\" button. Any possible deckbuilding and planning behind the card - completely gone.\n\nJudging by my experience from other digital card games, this card will start gathering dust as soon as the card pool grows and there will be enough decent non-random cards to fill the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122581","commentId":3122581,"userName":"Authraw","timestamp":1513105466,"content":"Randomness mitigation is a part of most games. Shuffled decks, dice rolls, and token cups are all ways to introduce uncertainty to a game. A good player learns how to play the odds, knowing when to take big risks and when to play it safe.\n\nSneak Attack (as revealed to us) is no different. You don't play Sneak Attack hoping for Gandalf, you play it hoping for a chump blocker, or someone with an extra point of attack or willpower or something. Then you're pleasantly surprised if you do get Gandalf, but you aren't counting on it.\n\nOf course, if you're about to lose, you can also pop Sneak Attack in the distant hope that it will just happen to save your bacon. Wouldn't that be a great story to tell later! \n\nFrom a deck construction standpoint, it's kind of a totally different card from the Sneak Attack we know and love, but it's hard to say just how good or bad it will turn out to be. \n\nTotally with you on it potentially being a sort of marketing tool, though. Normally hidden marketing really bothers me, but for some reason this one feels a little more benign to me. Not sure why. I think I will have to see it in action. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122582","commentId":3122582,"userName":"JJ48","timestamp":1513105499,"content":"> 10 minutes ago, John Constantine said:\n> \n> Just my thoughts which I already posted in another thread:\n> \n> Randomness for the sake of randomness is bad, and this new Sneak Attack is a great example of how good, decisive card simply turned into \"random\" button. Any possible deckbuilding and planning behind the card - completely gone.\n> \n> Judging by my experience from other digital card games, this card will start gathering dust as soon as the card pool grows and there will be enough decent non-random cards to fill the deck.\n\nI respectfully disagree.  Random cards aren't terribly reliable, but they can be fun in the right decks.  I play Plants vs Zombies Heroes, and my absolute favorite Zombie deck is one that relies on lots of random summons and transforming Zombies into random other Zombies.  It doesn't have the most consistent win rate, but it's very enjoyable to play.\n\nI don't anticipate the new card to be the most popular card in the meta, but I'd still include it in a deck.\n\n> Just now, Authraw said:\n> \n> Of course, if you're about to lose, you can also pop Sneak Attack in the distant hope that it will just happen to save your bacon. Wouldn't that be a great story to tell later! \n\n\"There we were, trying to get down the Anduin when a massive troll showed up!  We attacked it fiercely but it still clung to life, to the dismay of our party.  Just at that point, who should come charging out of the woods but Farmer Maggot himself!  'I was just on my way to see my good friend Tom and got a wee bit turned around,' he said, 'Of course, when I saw decent folk such as yourself in a bit of a bind, I figured that since it was naught worse than a Hill Troll I may as well pop over for a bit to help out.'\"\n\nEdited December 12, 2017 by JJ48"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122591","commentId":3122591,"userName":"John Constantine","timestamp":1513105650,"content":"> Just now, JJ48 said:\n> \n> I respectfully disagree.  Random cards aren't terribly reliable, but they can be fun in the right decks.  I play Plants vs Zombies Heroes, and my absolute favorite Zombie deck is one that relies on lots of random summons and transforming Zombies into random other Zombies.  It doesn't have the most consistent win rate, but it's very enjoyable to play.\n> \n> I don't anticipate the new card to be the most popular card in the meta, but I'd still include it in a deck.\n\nYou respectfully disagree with what exactly? Random cards not being played for their inconsistencey is a fact you can't respectfully (or in any other way) disagree with, and this Sneak Attack is the worst kind of random - uncontrollable. There is nothing you can do to control it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122602","commentId":3122602,"userName":"JJ48","timestamp":1513106094,"content":"> 3 minutes ago, John Constantine said:\n> \n> You respectfully disagree with what exactly? Random cards not being played for their inconsistencey is a fact you can't respectfully (or in any other way) disagree with, and this Sneak Attack is the worst kind of random - uncontrollable. There is nothing you can do to control it.\n\n\"...this card will start gathering dust as soon as the card pool grows and there will be enough decent non-random cards to fill the deck.\"\n\nI disagree that it will be unplayed.  Not everyone builds their decks in these games to be as powerful as possible.  Some people enjoy playing around with mechanics, especially random ones.  If there are enough random cards available, I expect there will be some decks that rely on them primarily.  Other decks will just have one or two thrown in either for fun or as a final hope when all other hopes fade.  It won't be an auto-include in every deck, or by every player, but I doubt it'll be too rare for someone to play it, either."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122622","commentId":3122622,"userName":"donkler","timestamp":1513106512,"content":"I am all for cards that do things that simply would not be feasible in the physical version, even if they are random. However if they are changing the ability on it, they ought to at least change it so the title is an accurate description of what it's doing. Like it still doesn't make any sense thematically that a \"Sneak Attack\" could involve a questing character. The app seems like a good opportunity to change some of these things."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122625","commentId":3122625,"userName":"John Constantine","timestamp":1513106864,"content":"> 11 minutes ago, JJ48 said:\n> \n> \"...this card will start gathering dust as soon as the card pool grows and there will be enough decent non-random cards to fill the deck.\"\n> \n> I disagree that it will be unplayed.  Not everyone builds their decks in these games to be as powerful as possible.  Some people enjoy playing around with mechanics, especially random ones.  If there are enough random cards available, I expect there will be some decks that rely on them primarily.  Other decks will just have one or two thrown in either for fun or as a final hope when all other hopes fade.  It won't be an auto-include in every deck, or by every player, but I doubt it'll be too rare for someone to play it, either.\n\nBut this is what happens with all random cards in all others digital card games. Sure, some memers (like you, I presume) might still play it, but main populus (people who play to win) cannot afford any wildcards in their deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122627","commentId":3122627,"userName":"Jekzer","timestamp":1513106914,"content":"> 14 minutes ago, Authraw said:\n> \n> Randomness mitigation is a part of most games. Shuffled decks, dice rolls, and token cups are all ways to introduce uncertainty to a game. A good player learns how to play the odds, knowing when to take big risks and when to play it safe.\n> \n> Sneak Attack (as revealed to us) is no different. You don't play Sneak Attack hoping for Gandalf, you play it hoping for a chump blocker, or someone with an extra point of attack or willpower or something. Then you're pleasantly surprised if you do get Gandalf, but you aren't counting on it.\n> \n> Of course, if you're about to lose, you can also pop Sneak Attack in the distant hope that it will just happen to save your bacon. Wouldn't that be a great story to tell later! \n> \n> From a deck construction standpoint, it's kind of a totally different card from the Sneak Attack we know and love, but it's hard to say just how good or bad it will turn out to be. \n> \n> Totally with you on it potentially being a sort of marketing tool, though. Normally hidden marketing really bothers me, but for some reason this one feels a little more benign to me. Not sure why. I think I will have to see it in action. \n\nAnd that's an answer I totally share.\n\nYes, totally random cards give pure uncertainty, but the scenario in where you decide to play one of those cards has to be one that gives you some \"momentum\".\n\nAlso they give a layer of fun in that unpredictability, something I discovered I enjoyed the most on others digital card games.\n\nOf course you'd rather prefer using another card when you build a deck to tackle against the hardest quests. Even more after having played a long game. But that fun factor gives sometimes true epic moments of victory or painful defeat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122708","commentId":3122708,"userName":"JJ48","timestamp":1513109274,"content":"> 45 minutes ago, John Constantine said:\n> \n> But this is what happens with all random cards in all others digital card games. Sure, some memers (like you, I presume) might still play it, but main populus (people who play to win) cannot afford any wildcards in their deck.\n\nI'm not sure what a \"memer\" is, but if it's a casual player who doesn't really care about having the most powerful deck, it may describe me.\n\nI understand that a lot of people play primarily to win, and don't care about theme or tricks/combos, except where such things are incredibly powerful.  Those people may even make up the majority.  I just think you're severely underestimating how many people play for other reasons.  You have your experience telling you one thing, and my experience from talking to people in my play groups is that most people tend more towards the \"tricky stuff is fun\" side.  Maybe it's just a matter of like hanging out with like; I don't know.\n\nI believe that as long as the adventures aren't so ridiculously difficult that only a finely-tuned, optimized deck can stand any chance of beating them, random cards will still see play by a not-insignificant number of players.\n\nEdited December 12, 2017 by JJ48"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122750","commentId":3122750,"userName":"dalestephenson","timestamp":1513110068,"content":"> 48 minutes ago, John Constantine said:\n> \n> But this is what happens with all random cards in all others digital card games. Sure, some memers (like you, I presume) might still play it, but main populus (people who play to win) cannot afford any wildcards in their deck.\n\nSurely it makes a difference that this is a cooperative/solo game, not a head-to-head game?  In competitive games you can't afford whimsy because you'll get crushed when you do.  But in solo that doesn't apply -- if you're content with lowering your win percentage by playing a more interesting but less powerful card, why not?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122792","commentId":3122792,"userName":"John Constantine","timestamp":1513111161,"content":"> 17 minutes ago, JJ48 said:\n> \n> I'm not sure what a \"memer\" is, but if it's a casual player who doesn't really care about having the most powerful deck, it may describe me.\n> \n> I understand that a lot of people play primarily to win, and don't care about theme or tricks/combos, except where such things are incredibly powerful.  Those people may even make up the majority.  I just think you're severely underestimating how many people play for other reasons.  You have your experience telling you one thing, and my experience from talking to people in my play groups is that most people tend more towards the \"tricky stuff is fun\" side.  Maybe it's just a matter of like hanging out with like; I don't know.\n> \n> I believe that as long as the adventures aren't so ridiculously difficult that only a finely-tuned, optimized deck can stand any chance of beating them, random cards will still see play by a not-insignificant number of players.\n\nA memer is someone who picks his perception of fun over actual value. Original LotR LCG at least for me is a very harsh environment (for solo play) which allows very little to none \"fun\" scenarios. If digital environment will be anything close to the board one, I doubt there will be a lot of memers, at least not until they beat the game with efficient decks and start screwing around with meme stuff.\n\n \n\n> 4 minutes ago, dalestephenson said:\n> \n> Surely it makes a difference that this is a cooperative/solo game, not a head-to-head game?  In competitive games you can't afford whimsy because you'll get crushed when you do.  But in solo that doesn't apply -- if you're content with lowering your win percentage by playing a more interesting but less powerful card, why not?\n\nRemember old times when Journey Down the Anduin was the bane of our existence? Would you afford to take something you cannot rely on there? There are plenty unforgiving quests even without nigthmare, and judging by stream there is already Hard mode implemented by default, so unless the game itself is easy overall, deck space will be pretty tight for the stuff you can rely on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122805","commentId":3122805,"userName":"JJ48","timestamp":1513111813,"content":"> 3 minutes ago, John Constantine said:\n> \n> A memer is someone who picks his perception of fun over actual value. Original LotR LCG at least for me is a very harsh environment (for solo play) which allows very little to none \"fun\" scenarios. If digital environment will be anything close to the board one, I doubt there will be a lot of memers, at least not until they beat the game with efficient decks and start screwing around with meme stuff.\n> \n> Remember old times when Journey Down the Anduin was the bane of our existence? Would you afford to take something you cannot rely on there? There are plenty unforgiving quests even without nigthmare, and judging by stream there is already Hard mode implemented by default, so unless the game itself is easy overall, deck space will be pretty tight for the stuff you can rely on.\n\nI don't know; as soon as I started playing the game I was looking for fun decks over power decks.  I may not have the best win record, and I certainly don't take on Nightmare decks too often, but fun decks aren't completely non-viable, either.\n\nAlso, this is pure guessing on my part, but I doubt the quests will be as difficult as the physical games', as a whole.  For one thing, they seem to be going for a wider audience, which probably means they'll balance it a bit more so as not to drive too many people away.  For another, the format makes it much easier to implement multiple difficulties for people to play at.  They could vary setup, vary card stats, and even vary AI decisions much easier and more seamlessly than in the physical game.  I suppose at this point, we can only wait and see how things go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122879","commentId":3122879,"userName":"Seastan","timestamp":1513113405,"content":"> 1 hour ago, John Constantine said:\n> \n> But this is what happens with all random cards in all others digital card games. Sure, some memers (like you, I presume) might still play it, but main populus (people who play to win) cannot afford any wildcards in their deck.\n\nSo, in summary, some people will like the card and will include it their decks. Others will not like it and won't.\n\nAre we going to start a new thread like this for every card now? Or is the lack of legitimate criticism for the DCG making people turn their complaints toward the general concept of deckbuilding?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122884","commentId":3122884,"userName":"dalestephenson","timestamp":1513113510,"content":"> 23 minutes ago, John Constantine said:\n> \n> A memer is someone who picks his perception of fun over actual value. Original LotR LCG at least for me is a very harsh environment (for solo play) which allows very little to none \"fun\" scenarios. If digital environment will be anything close to the board one, I doubt there will be a lot of memers, at least not until they beat the game with efficient decks and start screwing around with meme stuff.\n> \n>  \n> \n> Remember old times when Journey Down the Anduin was the bane of our existence? Would you afford to take something you cannot rely on there? There are plenty unforgiving quests even without nigthmare, and judging by stream there is already Hard mode implemented by default, so unless the game itself is easy overall, deck space will be pretty tight for the stuff you can rely on.\n\nI don't see LOTR LCG as inherently a very harsh environment.  Some quests are brutal, other quests are far easier.  There are quests I've never beat without resorting to easy mode, there are quests I've never lost to on normal mode.  I don't play nightmare, so I don't need to have super-efficient decks, and doubt I've ever *played* a super-efficient deck.  My Beorn's Path descendant decks bloat regularly as I try out new and interesting cards, my Dori fellowships almost without exception would be more effecitve with TaBeregond dropped in as a straight substitution.  But where's the fun in that?\n\nIf you go to LOTR quest companion and look at the ratings of individual quest, you see there is a *wide* spread in difficulty.  And for any individual quest, the difference between easy/normal/nightmare is substantial.\n\nI've put *plenty* of things in decks that I can't rely on.  Combo pieces that are useless without part of the combo, cards like Galadriel that may or may not dig up something good, cards like Zigil Miner or A Very Good Tale that can whiff completely, cards like Free to Choose or Power of Orthanc that are utterly dead weight unless the right treachery comes out.\n\nOne of the things I *routinely* put in my deck that I can't rely on is none other than Sneak Attack.  This is potentially an awesome card if used with core Gandalf, or Beorn, or Hama -- but it's a combo piece and is *utterly worthless* if you don't have an ally in hand worth sneaking.  It routinely sits in my hand sometimes, waiting for core Gandalf to show up.  The digital Sneak Attack isn't a combo piece, but it's apparently 100% reliable -- play it and you'll get *something*.  I am not in a position to evaluate how great that value is compared to the other digital cards available and in the new environment, but I certainly don't think we have enough information to pronounce it not only not a staple, but effectively worthless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3122904","commentId":3122904,"userName":"John Constantine","timestamp":1513114234,"content":"I am not saying it is effectively worthless. I am saying it belong to the department of uncontrollable, unpredictable random. You never know what you will get, you have absolutely no way to influence it. It is useful because you'll always get a body, but since now you don't even declare defenders, and you summon some 0/0/1 dud, AI might not even decide to attack it. All I'm saying is that the bigger card pool gonna get, the less enticing this version of Sneak Attack will grow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265267-sneak-attack-in-the-digital-version/?do=findComment&comment=3123025","commentId":3123025,"userName":"jacenat","timestamp":1513117494,"content":"> 4 hours ago, shipwreck said:\n> \n> Does it definitely work like this or does it kinda work like this?\n\nWe don't know for sure. The response from Caleb also was that these things can change if needed and specific effects of cards should not be taken for granted right now.\n\nAlso: This thread is not \"OMG change is bad!\" I picked the specific card because I can see it doing harm in the long term. I will open threads about other changes, some of which I see in a very positive light. It's important that we talk about changes level headed. I am not on a firm position that the card is bad now or will become bad later. I just saw what similar cards did in Hearthstone and how some of them really discouraged me from running them. There is a very real psychological aspect to such effects and how they can shape engagement with the card, player decks and the game as a whole.\n\nI'd rather talk about all of this now than wait after the EA period."}]}