{"url":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/","title":"LOTR Digital streams discussions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3125989","commentId":3125989,"userName":"Jekzer","timestamp":1513286275,"content":"Hello all!\n\nI decided to create a separate topic to talk about FFI LOTR digital card game (or Living Card Game, following the correct name), so we can discuss whatever is commented in here. Of course there's CORT Discord's channel, but we can retro-feed each other!\n\nWatched today's stream, which you can see again in here [https://www.twitch.tv/ffigames].\n\nA mixed bag of feelings for me. And that is a good thing, since it keeps me pushing to test its Early Access when it hits Steam in Q1 2018 and see if what I like is as good as it seems and give feedback for the things I dislike (even if they won't change, I want to help FFI, they are baking a good cake here).\n\nIn terms of gameplay, there are several things I found interesting: first, how you play cards. As it was explained on the FFI web, they are using a level system to cards, so depending the level a card has it can be played for a matching number of heroes (tactics card level 2 --> you need 2 tactics heroes, from a total of 3 heroes in game). That, added to having only 3 resources per turn that replenish each turn, are giving me a sense of tactical deckbuilding and playing the game that I love, because you can't trivialize playing cards piling up dozens of resources and that makes resources more meaningful each turn. For the level of cards, that's also a thing that helps developers balancing the power of cards (powerful level 3 cards mean that you have to dedicate your deck to a mono-sphere one).\n\nSecond, one thing that shook me is that favor cards could be also a total with a layer of decision, but first we need to know all the favor cards and how they work. I see some potential in things like \"should we use this favor to swarm Sauron or should we use that other Favor to have a source of draw since I'm lacking at it. It's a double-edged sword, I hope it doesn't determine how decks are build and are more like a \"second layer\" of decision-making. Oh, and they repeated that will not be necessary, just be used to make things easier for people not so used to these games.\n\nIn terms of aesthetics, here's where my heart languishes a bit, and that could be a problem because, well, they're personal likes. Backgrounds are good, but I think that can be improved (leaves traversing the board, low quality textures in some objects). Card backs are just plain awful for me. Rounded cards: I don't see that as a problem. In general, cards need are informative. For instance, sentinel creates a glow in the shape of a shield, that's cool. Also I don't remember is there's an indication in which phase you are on screen (only when you change phases). Voice-over range from OK to \"ohmygodshutup!\", sorry but I hate the \"FOR RIVENDEL\" Arwen's quote. I don't know if they are final, but they sounded a bit off for me.\n\nOverall, as I said, really interested in play in Early Access."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3126325","commentId":3126325,"userName":"Authraw","timestamp":1513300665,"content":"I feel more or less the same. My biggest concerns have been largely assuaged, and I'm intrigued enough to want to try it out. I like the aesthetics more now that I have seen the animations, although I still have nitpicks here and there. \n\nI'm super impressed with how open and honest FFI has been throughout the unveiling process. They seem really eager to get feedback and excited to show the game off to us. It's refreshing in a world of carefully crafted marketing messages and one-way communication. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127088","commentId":3127088,"userName":"Lecitadin","timestamp":1513348140,"content":"Yep, I saw the demo and I quite liked it, feels different and difficult enough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127199","commentId":3127199,"userName":"shoreless","timestamp":1513351357,"content":"I agree with everything you guys have said so far. I don't mind the Hearthstone \"eggs\", except that they remind us of Hearthstone -- as does the sentinel shield border thingy (I hope and believe the excessive green effect will go away). As Tim (?) said, they're still tweaking a lot of the graphics.\n\nI watched the first half of the stream last night and finished it this morning. Last night I found myself amazed at how much it felt like LOTR in spite of the differences. The table talk those dudes were having was the same kind of discussion we have around the table. Similar decision-making (who to send questing, what's the \"deck\" going to do, etc.), just a change in keywords and some mechanics. This morning, however, I got worried that this is just one big Hearthstone adventure. \n\nI certainly don't think it will be, but the comparisons are inevitable.\n\nOne other comparison is the recent Star Trek: Discovery. Though on a smaller scale, this digital game holds the same weight of expectation from a very devoted and specific audience. Like DSC, it will be its own thing and it will piss purists off and it will have the potential for greatness.\n\nBased on the teeny tiny bit we've seen, I really do think FFI are going to hit the balance between maintaining the \"vibe\" of the card game and making it accessible as both a digital game and a \"revised\" (2.0?) version of its physical counterpart. It all depends, however, on actually getting our digital mitts on the cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127631","commentId":3127631,"userName":"Edheliad","timestamp":1513363495,"content":"Voice-overs? Has to be the most expensive videogame feature to do right, and when you get it wrong it's always a disaster that most of the playerbase will hate. Why do so many first-time developers try to implement it?\n\nFools and their money, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127672","commentId":3127672,"userName":"shoreless","timestamp":1513364323,"content":"> 12 minutes ago, Edheliad said:\n> \n> Voice-overs? Has to be the most expensive videogame feature to do right, and when you get it wrong it's always a disaster that most of the playerbase will hate. Why do so many first-time developers try to implement it?\n> \n> Fools and their money, I guess.\n\nThe voice overs aren't god-awful; they're just \"yelly\". I think they're on par with Hearthstone (though not as funny, of course)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127794","commentId":3127794,"userName":"Authraw","timestamp":1513366842,"content":"I'm kinda hoping there's a setting to turn them off. They're fun the first 100 times, but if I really get into this game, it's going to get old hearing the same lines over and over again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3127883","commentId":3127883,"userName":"Ywingscum","timestamp":1513368563,"content":"And over and over and over..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128103","commentId":3128103,"userName":"Onidsen","timestamp":1513373944,"content":"After watching yesterday's stream, I can say that I'm quite excited for the digital game.\n\nI'll admit that I had been hoping for something like the digital version of Sentinels of the Multiverse - identical to the base game, just with much more automation. But watching the new streams has convinced me. Now to wish that OCTGN could have more automation to it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128169","commentId":3128169,"userName":"Bullroarer Took","timestamp":1513377269,"content":"Devs, please let us turn off the sound effects without having to mute our systems."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128184","commentId":3128184,"userName":"Silvery","timestamp":1513377974,"content":"This game seems pretty cool but i wonder that when it will be released and how much it will cost? I haven't been watching the streams yet so i can't say much about the mechanics but at least it looks great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128458","commentId":3128458,"userName":"shoreless","timestamp":1513389551,"content":"Lots of news out there. For you newcomers, I did a quick roundup of what we know so far.\n\nhttps://greycompanypodcast.com/2017/12/16/lotr-dcg-news-roundup/ [https://greycompanypodcast.com/2017/12/16/lotr-dcg-news-roundup/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128466","commentId":3128466,"userName":"En9a9e","timestamp":1513390264,"content":"For Tim and new cosmetic considerations...\n\nLfkMGRW.jpg [https://i.imgur.com/LfkMGRW.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128783","commentId":3128783,"userName":"John Constantine","timestamp":1513420544,"content":"> 14 hours ago, Ywingscum said:\n> \n> And over and over and over...\n\nJudging by my own experience, that hugely depends on the voice. I find myself rooting for certain cards to be played to hear their voice rather than praying that some card won't get played just to not hear their voice. Since heroes are permanent residents of the deck and board, the devs can give them like 3-5 lines per action, to keep it fresh, but allies I think are fine with 1 line."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3128806","commentId":3128806,"userName":"jacenat","timestamp":1513422329,"content":"> 15 hours ago, Authraw said:\n> \n> I'm kinda hoping there's a setting to turn them off. They're fun the first 100 times, but if I really get into this game, it's going to get old hearing the same lines over and over again.\n\nI played several video games where they are not that bad. Starcraft 2 and WoW a well as Hearthstone all have them and they are not intrusive at all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3129197","commentId":3129197,"userName":"Jekzer","timestamp":1513446710,"content":"> 7 hours ago, John Constantine said:\n> \n> Judging by my own experience, that hugely depends on the voice. I find myself rooting for certain cards to be played to hear their voice rather than praying that some card won't get played just to not hear their voice. Since heroes are permanent residents of the deck and board, the devs can give them like 3-5 lines per action, to keep it fresh, but allies I think are fine with 1 line.\n\nThat. In some games you're waiting for them (in my case even recalling them in my head). \n\nRight now, at least for me, it's not the case.\n\nI think that having sliders for different volume groups (effects, music, master) will solve the problem for all the people.\n\nEdited December 16, 2017 by Jekzer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3129245","commentId":3129245,"userName":"Gandalf_","timestamp":1513449199,"content":"I still don't like the UI at all. I get that they are in Alpha now, but this what they chose to show to their audience and something tells me the end result wont be all that different. I am against the oval character shapes on the board. I would prefer the traditional card shape like Gwent does it for example.\n\nThe card design is a copy paste of the HearthStone design which I find extremely lazy. Even the trait is in the exact same place where HeartStone uses it.\n\nThe other thing that dont like is that they are planning to milk wallets all the way in a typical FFG fashion. The core game will be around 50 cards total and if I understood correctly you get only one campaign which includes 5 quests. This is like two days of gameplay? Maybe a bit more if you try to beat it with more than one decks. Then everything else will cost real money. I don't believe that the in game currency will be generously rewarded either.\n\nI am a bit disappointed with the above which have killed my hype. I am sure the rules will be ok and not as streamlined as people believe. For now I think I will pass, and if the game proves to be good, I'll join in a steam sale (which I hope it will have)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3129991","commentId":3129991,"userName":"Hannibal_pjv","timestamp":1513500032,"content":"That is the way... in game payment is a way to get most money in the games today. Pay ones and play games does not give as much Profit as those micro payment games where you pay to win. But as I have said before, it is much harder to make it work in co-op games than competative games. So really interesting to see how They plan to make money with micro payment in this game... No new content without micro payment (that would be very lcg like). You can not win scenarios without paying (pay to win approuch, much hated by Many players though), ultra slow progress without micropayments (a variation to the previous two. Causes the need to play same scenarios thousends of times without payment, or pay and play scenario ones and you can go to the next. Grind or pay arternative) Pay to get certain uber cards (a variation to pay to win, but not as Harsh) \n\nSo all in all intersting so see how this goes.\n\nEdited December 17, 2017 by Hannibal_pjv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3130151","commentId":3130151,"userName":"Bullroarer Took","timestamp":1513521688,"content":"They repeatedly said the game won't be pay to win, but it probably doesn't have to be. If  its simply pay to get new cards most people will pay."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3130569","commentId":3130569,"userName":"Bradders77","timestamp":1513543210,"content":"Im interested in this idea, but the burning question.... how much will it cost? For me it would have to considerably less then owning an LCG. If its realistically affordable id give it a go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3130644","commentId":3130644,"userName":"En9a9e","timestamp":1513545543,"content":"> 11 hours ago, Bradders77 said:\n> \n> Im interested in this idea, but the burning question.... how much will it cost? For me it would have to considerably less then owning an LCG. If its realistically affordable id give it a go.\n\nIt's FTP, pricing points for founders packages in early access are 9.99, 19.99, and 39.99 with more details about the tiers coming. Founders package price points were revealed near the end in their 12/14 twitch stream.\n\nEdited December 18, 2017 by En9a9e"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3133789","commentId":3133789,"userName":"divinityofnumber","timestamp":1513663891,"content":"I am of the mind that it is a quite different game and a different experience. Nothing digital can match the feel of being around the table with all of the cards spread out and counters, dice, beer, etc. For me, if I do play the digital game, I will think of one as that awesome, real life, in person, kitchen table type of experience, and the other as that thing that I can play on the bus/train and while I lie in bed at night. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3134207","commentId":3134207,"userName":"JTG81","timestamp":1513692353,"content":"Who should I follow for more information on the next stream? I've been searching but havent found any information."},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3134212","commentId":3134212,"userName":"Ywingscum","timestamp":1513692582,"content":"I play 1 digital card game currently. 0 video games. Everything table top for me.\n\nthe one game I play is Spellfire.  Which is a quick 5 minute or less duel with a computer.  Which can be played while sitting on the john, or were ever you have 5 minutes.  So this game I expect to be a little longer but not much I would think.\n\nthe actual game is as mentioned above a much richer and deeper experience.\n\nso they fill different roles for me as well"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3134598","commentId":3134598,"userName":"Authraw","timestamp":1513704323,"content":"> 3 hours ago, JTG81 said:\n> \n> Who should I follow for more information on the next stream? I've been searching but havent found any information.\n\nThey're at 11am on Tuesdays and 4pm on Thursdays, CST. The only place I know that they have announced that is in the other Twitch streams, and probably on Twitter too. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3134668","commentId":3134668,"userName":"John Constantine","timestamp":1513706156,"content":"So, in how many hours is this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3134680","commentId":3134680,"userName":"sappidus","timestamp":1513706386,"content":"> 2 minutes ago, John Constantine said:\n> \n> So, in how many hours is this?\n\n1 hour from this post.\n\nYou may find this link helpful:\n\nhttps://www.timeanddate.com/worldclock/converter.html?iso=20171219T190000&p1=159 [https://www.timeanddate.com/worldclock/converter.html?iso=20171219T190000&p1=159]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3138400","commentId":3138400,"userName":"Jekzer","timestamp":1513888101,"content":"Saw both videos on their channel.\n\nTuesday was more about showing the core Spirit hero: Frodo Baggins. Nicely tied to theme: low threat, low stats and gains +2 willpower whenever Sauron resource pool is depleted. So more brave the moment Sauron exhausts all of his tricks. Oh and it has stealth (IIRC it means that is the last to be targeted, so first target will be sentinels, then normal ones and then stealth ones).\n\nYesterday's stream was more or less the same, first quest, same heroes from first streams... they showed an action bar hidden on the right of the screen that tells who attacked who and what was triggered. Good to have it so we can see how previous turns went.\n\nOh, they also commented about threat not only being a timer, but triggering other things that they haven't revealed yet.\n\nI hope is not only \"access\" to bigger enemies. I'm thinking more about giving to Sauron more advantage, maybe gaining more resources or sonething like that. That kind of design could open lots of possibilities to make a better structure for difficulty levels, new mechanics in new adventures, and so on.\n\nEdited December 21, 2017 by Jekzer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/265454-lotr-digital-streams-discussions/?do=findComment&comment=3140469","commentId":3140469,"userName":"shoreless","timestamp":1514031611,"content":"> On 12/21/2017 at 3:28 PM, Jekzer said:\n> \n> I hope is not only \"access\" to bigger enemies. I'm thinking more about giving to Sauron more advantage, maybe gaining more resources or sonething like that. That kind of design could open lots of possibilities to make a better structure for difficulty levels, new mechanics in new adventures, and so on.\n\nWell hopefully they're not too worried about keeping it different to steal ideas from the tabletop game. They've played with threat in so many ways!"}]}