{"url":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/","title":"Oath of Eorl","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3140557","commentId":3140557,"userName":"sappidus","timestamp":1514038721,"content":"> Quote\n> \n> Response: At the beginning of the combat phase, you resolve the step in which you attack enemies before resolving enemy attacks this phase. (Each other player resolves the combat phase as normal after you resolve your attacks.)\n\nHow does this card, uh, work?\n\nWhat I mean is this… Let's say we have players A, B, and C. The normal attack order is this:\n\n\nA resolves enemy attacks\nB resolves enemy attacks\nC resolves enemy attacks\nA resolves player attacks\nB resolves player attacks\nC resolves player attacks\n\nWe can abbreviate this as Ae, Be, Ce, Ap, Bp, Cp.\n\nIf C plays Oath of Eorl, does that change the order to Cp, Ae, Be, Ce, Ap, Bp? i.e., does the effect simply move that player's attacks before all other attacks in the combat phase, and the order of everything else is undisturbed? (This would be like reading the card as \"you attack enemies before resolving any enemy attacks.\")\n\nOr is it Ae, Be, Cp, Ce, Ap, Bp? (This is reading it as, \"you attack enemies before resolving your enemy attacks.\")\n\nEdited December 23, 2017 by sappidus\nformatting"},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3141353","commentId":3141353,"userName":"dalestephenson","timestamp":1514088968,"content":"I think it's Cp first, before any enemy attacks.  Reasoning is as follows:\n\n1) The response is at the beginning of the combat phase, obviously before *any* enemy attacks occur.\n\n2) The parenthetical clearly says the other players \"resolve the combat phase as normal\" *after* you resolve your attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3142519","commentId":3142519,"userName":"GrandSpleen","timestamp":1514227153,"content":"Agreed, it’s a response and the trigger occurs at the beginnng of the combat phase.  It couldn’t go anywhere else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3142526","commentId":3142526,"userName":"Authraw","timestamp":1514227491,"content":"Tagalong question: do you get to attack before or after Archery damage?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3143041","commentId":3143041,"userName":"PachiLOTR","timestamp":1514281908,"content":"> 15 hours ago, Authraw said:\n> \n> Tagalong question: do you get to attack before or after Archery damage?\n\nArchery (and Shadow cards being dealt) will happen first because they are both passive effects and the card effect is a response.  Any potential Forced effects that trigger \"at the beginning of the combat phase\" will also happen before you can trigger this event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3156241","commentId":3156241,"userName":"sappidus","timestamp":1515179798,"content":"Another Oath of Eorl question! Players A (first), B, C (last). C plays Oath of Eorl. Now he declares a ranged attack against an enemy engaged with A.\n\n 1. Can A's characters join in on the attack?\n 2. Can B's ranged characters join in on the attack?\n\nA reminder on ranged (Core p. 24):\n\n> Quote\n> \n> A character with the ranged keyword can be declared by its controller as an attacker against enemies that are engaged with other players. A character can declare ranged attacks against these targets while its owner is declaring attacks, or it can participate in attacks that are declared by other players. In either case, the character must exhaust and meet any other requirements necessary to make the attack.\n\nThere doesn't seem to be any provision for #1 to be true—A is not declaring the attack—but how about #2? C is declaring an attack, so the boldfaced text might lead one to believe B's ranged characters can participate too. But perhaps the underlined text prohibits it after all, somehow. Thoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3156274","commentId":3156274,"userName":"NathanH","timestamp":1515180922,"content":"I would allow it, but I can see why this might not be right,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3156301","commentId":3156301,"userName":"dalestephenson","timestamp":1515181521,"content":"There's an interesting if old thread here:\n\nhttps://boardgamegeek.com/thread/711353/uses-ranged [https://boardgamegeek.com/thread/711353/uses-ranged]\n\nInitially there was a ruling that if Quick Strike was used by player C for a ranged character against an enemy engaged with A, ranged B could join in the Quick Strike attack, since after all it was an attack, made by other players, against an enemy not engaged with them.  However, that ruling was undone in a subsequent FAQ:\n\n---\n\nNo. There is no opportunity for other characters to join a Quick Strike attack. One character is exhausted to pay for the cost of Quick Strike, and the effect is that the exhausted character is immediately declared as an attacker against the target enemy. The card’s resolution does not allow for a standard declaration step in which other characters can declare.\n\n---\n\nThis reasoning clearly implies that player B's ranged players *could* have joined the attack if it was a \"normal\" attack that allowed other characters to participate besides the exhausted character -- if Quick Strike allowed player C to declare any number of eligible attackers, then B *could* join in the fun if it was a ranged attack.  That's clearly the case with Oath of Eorl.  This is still the language in the current FAQ, so until the inevitable contrary ruling is received, I'd suggest it would be legal for other player's ranged characters to join in what is (after all) a legally declared and normal ranged attack; albeit one happened a bit earlier than is usually the case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3156487","commentId":3156487,"userName":"Teamjimby","timestamp":1515188216,"content":"image.png?width=341&height=606 [https://images.discordapp.net/attachments/198495871115984896/323950542428700694/image.png?width=341&amp;height=606]\n\nThis ruling was in respect to enemies engaged with each player, but I think it applies here.  Either way, it wouldn't hurt to get an official answer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/266051-oath-of-eorl/?do=findComment&comment=3157408","commentId":3157408,"userName":"Kakita Shiro","timestamp":1515255545,"content":"I think it's fine since Oath of Eorl doesn't create a special attack window; it just allows you to resolve combat in a different order."}]}