{"url":"https://community.fantasyflightgames.com/topic/267022-aragorn-and-anduril-with-enemy-getting-additional-attack/","title":"Aragorn and Anduril, with enemy getting Additional Attack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/267022-aragorn-and-anduril-with-enemy-getting-additional-attack/?do=findComment&comment=3158809","commentId":3158809,"userName":"JYoder","timestamp":1515365004,"content":" \n\nAragorn (with Anduril) is defending. The shadow effect on the attacker says, \"Attacking enemy makes an additional attack after this one.\"\n\nI assume Aragorn can first attack right away, and only if the enemy survives does it get to attack again. Correct?\n\nMy reasoning is the additional attack happens \"after this one\" and once that has resolved is when Anduril allows its attack.\n\nThe response text on Anduril: \"After an attack in which the attached hero defended resolves, exhaust Anduril to target the enemy that just attacked...\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/267022-aragorn-and-anduril-with-enemy-getting-additional-attack/?do=findComment&comment=3158912","commentId":3158912,"userName":"GrandSpleen","timestamp":1515371919,"content":"I think you're fine to do Anduril.  Even if you have to begin the 2nd attack, you'll be able to resolve Anduril's Response before the 2nd attack resolves. \n\nEither you trigger Anduril before the second attack even begins, or you do Anduril after initiating the 2nd attack.  I lean toward the 2nd interpretation.  \n\nI suppose the shadow effect is creating a passive effect which queues up the 2nd attack.  You would have to resolve that before the Response on Anduril, which means you'd deal a shadow card and resolve any Forced effects that have the trigger \"When this enemy attacks.\" But then Anduril would let you kill the enemy before it can finish its 2nd attack.\n\nAs always, I could be wrong!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267022-aragorn-and-anduril-with-enemy-getting-additional-attack/?do=findComment&comment=3800093","commentId":3800093,"userName":"ruchlas","timestamp":1570275477,"content":"My opinion after thought when facing this problem also, is that you attack first and then the enemy makes its additional attack..\n\nWhat if another character defenses at that additional attack? Do you come to trigger Anduril's response afterwards? It does not make sense. Every attack made is a different action. After the first attack you trigger Anduril's response, attack, and if the enemy is still alive to attack again, you defense again and re-trigger the response!"}]}