{"url":"https://community.fantasyflightgames.com/topic/267960-newbie-help/","title":"Newbie help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3177451","commentId":3177451,"userName":"psocks","timestamp":1516390311,"content":"So I am taking the plunge and buying the core set. So what do I get next? Help a newbie out with a product buy list please!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3177491","commentId":3177491,"userName":"divinityofnumber","timestamp":1516391366,"content":"You're going to get a few different answers. And, those answers will be colored by the experiences that the authors have had and their own journeys into the game. Here is my bias...\n\nI have played the game since it was released. I have had insane amounts of fun with it. My experience was getting each new thing as it was released. So, I am in favor of new players getting a core set, playing that thoroughly, and then buying new stuff in the order in which it was originally released. You get the real, organic feel for how the game has progressed and developed that way. Play, play, play, until you feel you have exhausted the \"freshness\" of the things that you have, and then by another adventure pack or two, etc. \n\nHowever, there are other completely valid arguments that some of the stuff early on in the game wasn't among the \"best\" that the game has had to offer, and more fun can be had by moving from the core set into some of the later deluxe expansions. \n\nEdited January 19, 2018 by divinityofnumber"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3177650","commentId":3177650,"userName":"Kakita Shiro","timestamp":1516395960,"content":"https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3177901","commentId":3177901,"userName":"Wandalf the Gizzard","timestamp":1516404683,"content":"Congratulations psocks! You are now a LotR LCG player (that's a big deal to us LotR LCG players)!\n\nHere is a breakdown of the different kinds of expansions:\n\nDeluxe Expansions are the \"big box\" expansions. To play a given cycle of Adventure Packs, you must have the corresponding Deluxe. Core Set to to play Shadows of Mirkwood Cycle, Khazad-dum to play Dwarrowdelf cycle, etc. They include around fifteen new player cards and three new quests.\n\nAdventure packs are the meat and potatoes of this card game. They make up cycles of six packs each. The eighth cycle is TBR. Each AP includes ten new player cards and one new quest.\n\nSaga Expansions are like Deluxe boxes, but have no linked cycle. They directly follow the events of the books. They include a neat campaign mode that you record and play in order.\n\nStandalone Scenarios simply include one new quest, no player cards. They are usually quite hard to beat. If you can pick them up at Gen Con or a Fellowship Event before public release, they come with an awesome alternate art hero card.\n\nI personally recommend buying and playing chronologically, as shown in the popular progression series. This gives the unique experience of seeing the cardpool grow, but you won't be up to date with the community for a while (unless you cave and blow your budget). Alternatively, you could jump in at any cycle or Saga box that you think you'd enjoy the most, or the current cycle. You will have a very limited cardpool and have a harder time beating quests, though. If you take this second approach, check out the Path Less Traveled series on the Darkling Door blog to get a feel for where to jump in.\n\nAt any rate, have fun with the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3178866","commentId":3178866,"userName":"Authraw","timestamp":1516482296,"content":"Lots of us old veterans played the game in the order of release, and we're all still here so you know it's a solid way to go. Things aren't always in print, though, so playing in order isn't always practical. And if you're not committed to being \"all-in\", then the earliest expansions aren't really representative of the best this game has to offer (don't get me wrong though, they're still good).\n\nI'm working on a blog series to investigate how the game would play if you took a non-chronological approach to things. You might find it handy:\n\nhttps://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]\n\nEDIT: Somehow I missed that Wandalf referenced my blog above, too. Thanks for the mention Wandalf!\n\nEdited January 20, 2018 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3190214","commentId":3190214,"userName":"teakinator","timestamp":1517180582,"content":"Is it appropriate to take the player cards from any expansion and use them on other expansions (such as Khazad-dum)? If yes, I was thinking I would keep all of the player cards in the core box (along with the Mirkwood cycle) and leave the enemies and quest cards in the expansion boxes. Is that what others do? Thanks in advance.\n\nEdited January 28, 2018 by teakinator"},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3190885","commentId":3190885,"userName":"Kakita Shiro","timestamp":1517241726,"content":"> 16 hours ago, teakinator said:\n> \n> Is it appropriate to take the player cards from any expansion and use them on other expansions (such as Khazad-dum)? If yes, I was thinking I would keep all of the player cards in the core box (along with the Mirkwood cycle) and leave the enemies and quest cards in the expansion boxes. Is that what others do? Thanks in advance.\n\nIf you determine that you want to do that, you may. That's the beauty of this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3190979","commentId":3190979,"userName":"Authraw","timestamp":1517244396,"content":"> 17 hours ago, teakinator said:\n> \n> Is it appropriate to take the player cards from any expansion and use them on other expansions (such as Khazad-dum)? If yes, I was thinking I would keep all of the player cards in the core box (along with the Mirkwood cycle) and leave the enemies and quest cards in the expansion boxes. Is that what others do? Thanks in advance.\n\nNot only is it appropriate, it's the intended experience! You're supposed to have an ever-expanding pool of player cards to choose from. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/267960-newbie-help/?do=findComment&comment=3192227","commentId":3192227,"userName":"Wandalf the Gizzard","timestamp":1517321503,"content":"> On 1/28/2018 at 6:03 PM, teakinator said:\n> \n> If yes, I was thinking I would keep all of the player cards in the core box (along with the Mirkwood cycle) and leave the enemies and quest cards in the expansion boxes. Is that what others do?\n\nThat is what I was planning to do with my storage solution, but ran into two problems. 1: eventually, you will have so many player cards in the core box that it will be cumbersome to pick through them to build a deck. At some point down the road there will just be no more space left. I had to cave and buy one of those fancy Ultra Pro binders. 2: I had trouble finding a reliable way of fitting the quest/encounter cards from the deluxe expansion in that box, let alone the corresponding cycle. I printed off some custom deckboxes from BGG"}]}