{"url":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/","title":"Adventure Packs and Expansions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3178315","commentId":3178315,"userName":"kezzzza","timestamp":1516438564,"content":"Hi new player here just finishing playing the core game set. I have the first expansion and all the related adventure packs.\n\nI cannot find if we should be playing the  Adventure packs one by one or if i should be adding them all in together.\n\nAny thoughts on best gameplay?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3178603","commentId":3178603,"userName":"Rouxxor","timestamp":1516462168,"content":"What do you mean by \"playing one by one\"? The scenario is already made: you have to add only the encounter cards with the indicated symbols.\n\nAbout player cards my advice si to add cards to your pool each time you play a new adventure. So even if you buy 6 news packs play the first one with the cards of this pack, and on the second you will have the cards of the first and the second."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3178614","commentId":3178614,"userName":"Wandalf the Gizzard","timestamp":1516462646,"content":"By \"first expansion\" do you mean Hunt for Gollum or Khazad-dum? And by \"related adventure packs\" do you mean the Dwarrowdelf cycle?\n\nI would follow Rouxxor's recommendation and play the quests in order chronologically, only using cards in your player decks that were available at the time of that quest's release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3178751","commentId":3178751,"userName":"Network57","timestamp":1516473532,"content":"/r/arkhamhorrorlcg has a New Player FAQ stickied at the top. The section on What is an LCG is applicable to the Lord of the Rings as well. You may want to check that out for an explanation of Deluxe vs Adventure Packs (called Mythos Packs in Arkham but same thing) and how they work with player cards vs encounter cards, deckbuilding, how to purchase, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3178870","commentId":3178870,"userName":"Authraw","timestamp":1516482733,"content":"Assuming you're asking about whether or not to add the new player cards to your pool all at once or little by little, there's not really a wrong answer.\n\nSome people get overwhelmed having too many options all at once, so they like to add the packs one at a time so they have a chance to get to know what each one does before adding more in. Other people do this because it emulates how it felt to be playing the game at the time those packs first came out.\n\nI like to add the cards one full cycle at a time. The Deluxe and its associated Adventure Packs are all designed at once and then split across multiple releases, so you can think of them as a sort of \"cohesive whole\" that all goes together. I like doing it this way since there are often synergies across the cycle that only come to fruition by the end of the cycle, and it lets me play with the whole thing longer.\n\nStill others just toss together all of the player cards they own so that they have the maximum number of options while deckbuilding.\n\nThere's not really a wrong answer here, it's going to depend on your personal play habits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3179213","commentId":3179213,"userName":"kezzzza","timestamp":1516513323,"content":"Thank you everyone i was confused about that\n\nYes i was referring to \"one by one \" as being each single pack in the cycle and the expansion i was referring to was Khazad-dum.\n\nHubby has decided to go with authraw's suggestion of one full cycle at a time.\n\nNetwork57 do you have the full link to the post you were referring to as i couldnt find it, found a couple of newbie posts but dont think they were what you were referring to??\n\nI did find a similar at another site /r/arkhamhorrorlcg/wiki/faq [https://www.reddit.com/r/arkhamhorrorlcg/wiki/faq] is this it?\n\nAgain thank you so much for taking the timeout to assist with my queries..\n\nEdited January 21, 2018 by kezzzza"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268006-adventure-packs-and-expansions/?do=findComment&comment=3179447","commentId":3179447,"userName":"Network57","timestamp":1516542147,"content":"> 8 hours ago, kezzzza said:\n> \n> Thank you everyone i was confused about that\n> \n> Yes i was referring to \"one by one \" as being each single pack in the cycle and the expansion i was referring to was Khazad-dum.\n> \n> Hubby has decided to go with authraw's suggestion of one full cycle at a time.\n> \n> Network57 do you have the full link to the post you were referring to as i couldnt find it, found a couple of newbie posts but dont think they were what you were referring to??\n> \n> I did find a similar at another site /r/arkhamhorrorlcg/wiki/faq [https://www.reddit.com/r/arkhamhorrorlcg/wiki/faq] is this it?\n> \n> Again thank you so much for taking the timeout to assist with my queries..\n\nYep that's exactly what I meant."}]}