{"url":"https://community.fantasyflightgames.com/topic/268591-forced-effect-on-active-location-during-setup/","title":"Forced effect on Active Location during setup","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/268591-forced-effect-on-active-location-during-setup/?do=findComment&comment=3190000","commentId":3190000,"userName":"JYoder","timestamp":1517165787,"content":" \n\nI've finally reached Mount Doom... and immediately have a question. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThe setup says to \"Make Brake of Thorns the active location.\" On Brake of Thorns is, \"Forced: After Brake of Thorns becomes the active location, each player assigns X damage among characters he controls, where X is the tens digit of his threat dial.\"\n\nDoes this effect trigger right away during setup?\n\nI know via the FAQ that \"When Revealed...\" effects are to take place, but not sure if \"Make Brake of Thorns the active location\" is kind of like the \"put into play\" (FAQ 1.16) in which case I can ignore it.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/268591-forced-effect-on-active-location-during-setup/?do=findComment&comment=3190712","commentId":3190712,"userName":"Wandalf the Gizzard","timestamp":1517231652,"content":"I think that the same rule for enemies being put into play engaged with you and their forced effects would apply here. In that case, you would deal the damage. You are correct that added to the staging area does not trigger when revealed effects, though.\n\nI think thematically, this location is tying or capture the part of the book when Frodo and Sam stumble off the road to Cirith Ungol, and land on a brake of thorns. I hope Mount Doom goes well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268591-forced-effect-on-active-location-during-setup/?do=findComment&comment=3191166","commentId":3191166,"userName":"JYoder","timestamp":1517249806,"content":" \n\nAs no one had replied for a while, I emailed Caleb, and turns out you're correct. His response...\n\nYou are required to resolve the Forced effect on Brake of Thorns when you make it the active location during Setup. The idea is that Mordor is a terrible place and you begin the adventure already damaged from exhaustion. You are correct that you do not resolve ‘when revealed’ effects when instructed to ‘put them into play’ because they are not revealed in those instances. Forced effects work differently because their trigger is not tied to being revealed. With Forced effects, you must resolve them whenever their specified trigger condition is met. In this case, it is making Brake of Thorns the active location.\n\n "}]}