{"url":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/","title":"Complete noob, event help","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3197642","commentId":3197642,"userName":"taylorcowbell","timestamp":1517624590,"content":"Hello, My girlfriend and I are considering attending our LGS's Fellowship event. However, we are both very new. Like, playing progression series and up to Conflict at the Carrock new (skipped Escape from DG until after the mirkwood cycle). However, I have every set, and 3 cores (bought a collection from a friend), so I have everything we might need to be able to be good, without the experience or decks aha.\n\nI was wondering, how hard would it be for us to netdeck 2 decks, ply a few missions to get practised with them? And read the rules a bunch of times in the next day or so to familiarize ourselves with timing windows and such. Thoughts? We'd rather not be complete and total liabilities or annoyances.\n\nEdited February 3, 2018 by taylorcowbell"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3197674","commentId":3197674,"userName":"Authraw","timestamp":1517627281,"content":"You should do it!\n\nOf course, this year's Fellowship event, Attack on Dol Guldur, destroyed just about everybody. Nobody won at all the entire time they ran it at GenCon, and from what I've heard a lot of people weren't able to beat it at their FLGS during the Fellowship event either. It's a monster of a quest, so go in prepared that y'all may not win.\n\nThat being said, the Lord of the Rings LCG community is hands-down the best community I have been a part of--people are super friendly and I bet you they'd love to have you there. I've never known anyone to be ostracized for being a \"liability\" or an \"annoyance\"--mostly we just love to find out that there are more players out there. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nFellowship Events are fun just because you get to go out and meet the community, and they only happen once a year. I'd seize the opportunity and go do it!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3197725","commentId":3197725,"userName":"taylorcowbell","timestamp":1517633532,"content":"Awesome we'll check it out. Anyone have good recommendation for netdecks to try with it? Because nice community or not, Id rather not roll up with my Basically-every-red-and-green-card-in-the-core deck and her rolling up with the blue-and-purple-with-no-cohesion deck haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3197931","commentId":3197931,"userName":"Wandalf the Gizzard","timestamp":1517662824,"content":"I’ve been that liability before and I know how it feels to not want to be one!\n\nA couple different blogs have reviews on that specific quest like Warden of Arnor, Warriors of the West, and Darkling Door as well, if I remember correctly (feel free to correct me, Authraw).\n\nOn RingsDB, there are a few two or four player fellowships tailor made for this quest that should serve you well.\n\nMy advice is to get at least ten progress on stage one by the end of the third round (without dying to undefended attacks), and always have at least five progress at the end of each round on stage three.\n\nI hope it goes well!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3197942","commentId":3197942,"userName":"Rouxxor","timestamp":1517663558,"content":"Here is some good fellowship I usually play and recommand:\nRohan + Gondor: http://ringsdb.com/fellowship/view/4197 [http://ringsdb.com/fellowship/view/4197]\n\nVilya deck + Boromir deck: http://ringsdb.com/fellowship/view/2589 [http://ringsdb.com/fellowship/view/2589]\n\nOutlands + Dunedain: http://ringsdb.com/fellowship/view/2615 [http://ringsdb.com/fellowship/view/2615]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3199302","commentId":3199302,"userName":"Seastan","timestamp":1517782407,"content":"This is a tough quest for an unprepared group (almost impossible I'd say), but with proper planning it's pretty manageable. We took a look at the quest beforehand and crafted decks specifically to counter what we considered the hardest cards in the encounter deck:\n\nhttp://ringsdb.com/fellowship/view/4216/attack-on-dol-guldur-successful-fellowship [http://ringsdb.com/fellowship/view/4216/attack-on-dol-guldur-successful-fellowship]\n\nIf you can't coordinate your whole group of 4, you could just lift the two combat decks out of that fellowship. In my opinion, combat decks are good for new players because the more experienced players in the group can help you optimize your actions during the combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3199346","commentId":3199346,"userName":"Authraw","timestamp":1517785580,"content":"> On 2/3/2018 at 5:00 AM, Wandalf the Gizzard said:\n> \n> A couple different blogs have reviews on that specific quest like Warden of Arnor, Warriors of the West, and Darkling Door as well, if I remember correctly (feel free to correct me, Authraw).\n\nWhy yes I did, in fact! Here's a collection of links if you're the researching sort (I couldn't find one on Warriors of the West):\n\n * My post on the quest itself [https://darklingdoor.wordpress.com/2017/08/24/spoiler-alert-attack-on-dol-guldur/]\n * My post on the decks we built to beat it [https://darklingdoor.wordpress.com/2017/12/04/victory-against-attack-on-dol-guldur-standard-mode/]\n * Warden of Arnor's post on his play experiences [https://wardenofarnor.wordpress.com/2017/12/21/fellowship-event-2017-attack-on-dol-guldur/]\n * Warden of Arnor's review of the quest [https://wardenofarnor.wordpress.com/2017/12/23/attack-on-dol-guldur-review/]\n\nI'd second Seastan's suggestion of taking his combat decks along, though. Two decks that were built to synergize well will go a long way!\n\nEdited February 4, 2018 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3200234","commentId":3200234,"userName":"dalestephenson","timestamp":1517843573,"content":"I'm curious about the sideboard cards in the purpose-built fellowship.  Are those there in case you are going after a different quest?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3200637","commentId":3200637,"userName":"Seastan","timestamp":1517854801,"content":"> 3 hours ago, dalestephenson said:\n> \n> I'm curious about the sideboard cards in the purpose-built fellowship.  Are those there in case you are going after a different quest?\n\nNo, just a couple suggestions in case you don't have the required cards, which is likely because that fellowship takes more than 1 card pool. Also, when I'm trimming down a deck I'll often move stuff to the sideboard rather than cutting it completely.\n\nEdited February 5, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3203125","commentId":3203125,"userName":"taylorcowbell","timestamp":1517976771,"content":"Just a follow up, we ended up doing the quest. It was Sunday afternoon so we ran with the outlands and dunedain combo suggested by Rouxxor. \n\nWe had a full 12 people so a full Epic experience. Our table ended up having awesome synergy, as the last 2 decks were rounded out with a dwarf deck, and a ranged tactics deck. The outlands draws were insane, and turn 2 it was questing for 40 and turn 3 quested for 79. \n\nUnfortunately the other tables around us died twice and ended the quest early, but it was safe to say our table was the power house.. One turn putting 33 seige on dol guldur through the siege quest. \n\nAll in all a good bit of fun, but now that I have 1 alt art card i fear i might have to start searching out the others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3203276","commentId":3203276,"userName":"Rouxxor","timestamp":1517995903,"content":"Glad it could help you :). Good luck with your quest to get the promotional cards ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/268969-complete-noob-event-help/?do=findComment&comment=3203810","commentId":3203810,"userName":"Wandalf the Gizzard","timestamp":1518026595,"content":"Great job!"}]}