{"url":"https://community.fantasyflightgames.com/topic/269359-dungeons-of-cirith-gurat-quest-card-1b-question/","title":"Dungeons of Cirith Gurat, Quest card 1B Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/269359-dungeons-of-cirith-gurat-quest-card-1b-question/?do=findComment&comment=3205242","commentId":3205242,"userName":"monkeyrama","timestamp":1518109606,"content":"Now that I've beaten DCG, I have a question about the end of quest Stage 1. The card reads:\n\nForced: After any number of characters are rescued, reveal an encounter card.\nThis stage cannot be defeated while a guarded objective is in play.\n\nThe quest card also needs 10 quest points. Now, usually I am completing this stage by freeing the last captured ally, since it's easier to get the quest points on before then getting the extra reveals. My question is basically do I reveal an encounter card when rescuing the last captured ally if that also triggers completing the quest stage?\n\nI think that completing the quest stage is a passive effect requiring certain actions be achieved (in this case progress and rescues). These come before Forced effects, and so I don't think that the last freed character does trigger the effect, since the moment the card is freed I immediately progress to Stage 2A before triggering Forced effects, and since that text is no longer in play it cannot trigger anyway. The other reason is from a broader design POV: Stage 2A adds one card per player anyway.\n\nAm I playing this right? Thanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/269359-dungeons-of-cirith-gurat-quest-card-1b-question/?do=findComment&comment=3205739","commentId":3205739,"userName":"GrandSpleen","timestamp":1518126821,"content":"That is how I played it.  You would immediately advance to stage 2, so the Forced effect on stage 1 does not get resolved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/269359-dungeons-of-cirith-gurat-quest-card-1b-question/?do=findComment&comment=3206461","commentId":3206461,"userName":"Wandalf the Gizzard","timestamp":1518184885,"content":"As long as advancing the quest is a passive effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/269359-dungeons-of-cirith-gurat-quest-card-1b-question/?do=findComment&comment=3207625","commentId":3207625,"userName":"monkeyrama","timestamp":1518271603,"content":"Thanks @GrandSpleen [https://community.fantasyflightgames.com/profile/177891-grandspleen/], that's what I thought! I'm pretty sure it is a passive effect, since this was one of the rules queries about The Thing in the Deep with placing the progress on the location to clear Stage 1.\n\nIt does make the first stage have an element of timing. Also means that I legitimately (I hope) beat the quest! Phew!"}]}