{"url":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/","title":"Attacks &amp; Defense with Exhausted Characters?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3218937","commentId":3218937,"userName":"Son0fArathorn","timestamp":1518978790,"content":"Hello all,\n\nI am new to this game. I've got through the first 2 scenarios in the Core Set but am stuck on Dol Guldur. It's tough! I need a couple of rules clarified if anyone can help please?\n\nWhen enemies engage my characters - can more than one enemy engage the same character?\n\nIf a character is already committed to the quest, can an enemy engage them?\n\nOnce my active character attacks an enemy, can he attack a 2nd enemy in the same phase?\n\nCan a character committed to a quest be delcared as a defender? I don't think they can but I wanted to check.\n\nLastly - the Dol Guldur scenario asks me to put 3 enounter cards on each objective. Does this mean that they are all in the staging area and add their threat whilst questing?\n\nAll help is greatfully received.\n\nJ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3221951","commentId":3221951,"userName":"GrandSpleen","timestamp":1519161334,"content":"Hi! Welcome to the game.  I'll do my best to give some clear answers:\n\n \n\n-Enemies don't engage characters.  They engage players!  During the encounter phase, you'll \"engage\" an enemy by taking it out of the staging area and putting it into your play area.  It has not engaged any characters.  It has engaged YOU, the player.  Character readiness/exhaustion, and having characters committed to the quest does not factor in here.\n\n-When you delcare an attack against an enemy, you exhaust a character (or multiple characters).  If you can ready one of those characters later on (example: Unexpected Courage [http://hallofbeorn.com/LotR/Details/Unexpected-Courage-Core]) then yes, you may use that character to attack another enemy that is engaged with you.\n\n-If your character is READY, you can delcare it as a defender.  You have to exhaust the character when you delcare it as a defender, so it needs to be ready first.  When you commit your characters to the quest, you exhaust them.  So generally, characters who quest cannot later defend an attack.  Again, if you can ready that character through a card effect, like Unexpected Courage or Aragorn's [http://hallofbeorn.com/LotR/Details/Aragorn-Core] ability, then you can use that character to defend.\n\n-You'll put 1 encounter card on each objective (not 3 on each objective) in Dol Guldur.  Total of 3 encounter cards with 3 objective cards.  Yes, the encounter cards will contribute their threat to the staging area.  It's a very very hard quest with just the Core set box, honestly just prepare to lose a lot.  \n\nFor more community resources, see: Beorn's Path https://hallofbeorn.wordpress.com/beorns-path/ [https://hallofbeorn.wordpress.com/beorns-path/]\n\nTales from the Cards' buying guide: https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/]\n\nRingsdb for other peoples' decks.  You can filter the search results so that they only show you decks which were built with cards that you own!\n\nhttp://www.ringsdb.com/ [http://www.ringsdb.com/]\n\nWelcome again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3221954","commentId":3221954,"userName":"Rouxxor","timestamp":1519161478,"content":"Hello,\n\n1/ An enemy always engage a player, not a character. A player can only choose to engage one enemy each turn, then all the enemy make engagement check and they all engage you if you are the only player and if you threat is high enough.\n\n2/ This question doesn't have sense cf 1 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n3&4/ An exhaust character can't quest, defend or attack. This probably answer also what you mean in 2.\n\n5/ The quest ask you to guard each objective with one cards, so 3 cards in total. They all are in staging area and it make this scenario almost impossible to achieve solo play if you have only cards of the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3222199","commentId":3222199,"userName":"Ywingscum","timestamp":1519172411,"content":"Helps to think of allies as disposable "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3289485","commentId":3289485,"userName":"Son0fArathorn","timestamp":1524076113,"content":"I'm finally getting back to this thread after being mad busy with work and am able to play again. Thanks very much to all for repsonding to my questions.\n\nThat's helped clear a few things up for sure. I think I might skip Escape From Dol Guldur and go to Hunt for Gollum, as I'm playing solo.\n\nActually a good question would be...\n\nWhich expansions would you recommend for someone who is playing solo and doesn't want the really tough scenarios? I like a challenge, but Dol Guldur was crazy :-) What do you guys recommend?\n\nThanks again,\nJames"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3290376","commentId":3290376,"userName":"Wandalf the Gizzard","timestamp":1524141456,"content":"It depends on what buying route you want to go. Some of the expansions with tougher quests also have really good player cards, so you may still want them if you are going to get the entire collection. If you just want to skip around cycles, the Darkling Door blog has a great \"Path less Traveled series.\" Also check out the Tales from the Cards \"New player buying Guide.\"\n\nIf you just want thematic experiences with a good chance of winning and fun quests, pick up Return to Mirkwood for Dain, then Khazad-Dum to build a strong dwarf deck. Then with the Hobbit Saga expansions, you get more dwarf goodies and a great quest experience. Or you could go with the LotR saga expansions, but you might want to pick up the Dead Marshes for Fast Hitch first.\n\nI personally would recommend just getting everything at some point as it becomes available. Open it and play progression style, playing quests in chronological order, only using player cards that were released at that point.\n\nHowever you decide to collect, have fun. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3290629","commentId":3290629,"userName":"Authraw","timestamp":1524152736,"content":"Dol Guldur is a bit of an outlier on the difficulty curve, there aren't many quests like that. (Off the top of my head, \"Return to Mirkwood\", \"The Battle of Carn Dum\", and many of the \"Print on Demand\" quests are a few others). For the most part, you should find other quests to be much more reasonable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3290686","commentId":3290686,"userName":"Son0fArathorn","timestamp":1524154922,"content":"Thanks Wandalf and Authraw. That makes a lot of sense. Good to know it's not all like Dol Guldur.\nYes I enjoy playing the thematic stories and want to build up a good Ranger / Dunedain deck.\n\nI've just ordered the Hobbit Saga and Black Riders expansions and we shall see how they go.\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3290804","commentId":3290804,"userName":"Wandalf the Gizzard","timestamp":1524159061,"content":"If you like the Dunedain, you should pick up the Lost Realm, even though its quests are hard. The Land of Shadow is also a must for Rangers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270035-attacks-defense-with-exhausted-characters/?do=findComment&comment=3291249","commentId":3291249,"userName":"mewmartigan","timestamp":1524181875,"content":"If you haven't watched it yet, the tutorial does a very good job of explaining the basic rules in video form. It goes over exhausting characters for various phases of the game, etc.\n\nhttps://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/ [https://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/]\n\nfollow the link and select \"tutorial\" just under the game banner at the top of page. "}]}