{"url":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/","title":"My thoughts on Mountain of Fire quests. Yours?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227291","commentId":3227291,"userName":"JYoder","timestamp":1519511011,"content":"The final saga has great ideas, and I finally beat them with the 2 most recent decks I've been taking through the saga, but I've some concerns and seeing what others think. (Minor spoilers following)...\n\nMy first two concerns are intertwined. One, is they are so hard, on par with many nightmare quests. And two, because they are so hard, all 3 quests had to allow you to switch out all 3 heroes without penalty.\n\nFor the saga finale, I didn't expect they'd be easy, but only somewhat harder than earlier saga quests. But making them so hard I need the option to swap out all heroes feels... off to me. For one, I want to take all 6 of my original heroes to the end. With the 6 heroes I had, I was finally able to, but with my 2nd batch of 6 heroes (from a prior saga run-thru I'm returning to) it may be impossible. (Not sure yet, or at least it'll be that much harder.) I already had to reluctantly swap out 1 hero to get through Quest 16, and I'd like to avoid more.\n\nThe thing is, I banged my head against the last 2 quests and failed so many times (even with heroes that could handle it well) that it kind of took some momentum out of my sails. And also, knowing I can swap out all 6 heroes without penalty, I could create two \"dream teams\" designed specifically for those last 2 quests (where no heroes are dependent on any permanent boons) defeat each, and then every time I get to them with a different set of heroes think, \"I know I can beat them with these two entirely different decks... so rather than take the time to create them and replay them -- just to go through the motions -- I can again say I won.\"\n\nThat's lame and not the path I want, as I'd much rather take my original heroes through them all... but again, the quests are so hard and specific, especially as I don't see my current heroes (average willpower, high-reliance on allies, and no Spirit) making it through. I enjoyed failing and defeating prior saga quests with some deck tweaking... but they didn't take dozens of attempts.\n\nAnyway... I'm not looking for hero/deck advice, and I know I should step away from these for a while and return to some past quests, etc. But mainly, I'm wondering if any have similar thoughts with Mountain of Fire (especially the last 2 quests) in kind of resenting their very high difficulty, possible requiring you to completely change up the heroes you've taken to the very brink... yet finding they possibly can't take you all the way.\n\nEdited February 25, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227330","commentId":3227330,"userName":"Rouxxor","timestamp":1519514981,"content":"The final quests are that hard, really hard. On the same level that the hardest nightmares of the game (escape from dol dulgur and battle of the five armies) in solo but it a different way: it need to build a specific deck. Without allies. With 2 player it is a little bit less punishing to play allies but you still need to put some attachment to add willpower to heroes or you couldn't manage to win.\n\nIt is, I agree with that, frustrating to be face on such quest at the end of the saga. There is a huge gap between this two quest and most of the saga, who is supposed to be played only with a core set. It doesn't make any sense. That is why there add the possibility of changing all heroes, who does not fit at all to the lore for the final quest.\n\nI personally go otherwise and play my entire campaign (with the solo deck I like) only for optimizing for this one so I finish with only a few boons, several attachment that boost willpower. That way it was way more easy in campaign mode. But I only manage to beat it because I was able to win without any problem all those who are before. It was not very interesting either ^^."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227394","commentId":3227394,"userName":"Hawkstrike","timestamp":1519520127,"content":"I haven't opened the box yet.  This doesn't encourage me to -- I've been doing the Saga expansions solo, thematically,, keeping my heroes and doing relatively minor revisions to decks.\n\nIt sounds like the last box can't be played that way. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227485","commentId":3227485,"userName":"Rouxxor","timestamp":1519527894,"content":"I never do revisions to my decks in solo but for this one I had to take off all my allies and some others cards so I change more than 50% of my deck. There is not a lot of options against this one, you don't have so much restrictions on heroes as long as they have a lot of willpower but your cards in your deck will be willpower boost and untap no matter wich heroes you choose. I'm a little bit pessimist since you can probably find some other builds but the major part of solo deck who succeed will rely on this I thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227611","commentId":3227611,"userName":"GrandSpleen","timestamp":1519547183,"content":"You seem to be assuming that the designers allow you to switch heroes between quests because the quests are hard.\n\nI don't think that is the reason.\n\nAlmost certainly you get to switch heroes for Cirith Ungol because you are switching from an 'Aragorn' quest (Battle of Pelennor Fields) to a 'Frodo' quest (Cirith Ungol).\n\nAlmost certainly you get to switch heroes for Black Gate Opens because you're coming from a Frodo quest and moving into an Aragorn quest.\n\nAnd again, you're switching heroes again because you're going into Mount Doom (a Frodo quest) after completing Black Gate Opens (an Aragorn quest).\n\nPretty sure throughout the entire Saga campaign, there is no point where you get to switch quests because \"the quest is hard.\"  There is always a thematic reason for permitted hero swapping."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227718","commentId":3227718,"userName":"Rouxxor","timestamp":1519562701,"content":"To me the change allowed by campaign cards always were symbolized by a break moment during the journey. That was the reason of the possible change on the first ( The Ring Goes South ), a peaceful moment in rivendel. I was only thinking about moment where the group can rest (generally Aragorn group after a battle, the very same moment where we switch to Frodo group). With that theory being able to change between Black Gate Open and Mount Doom was really surprising ^^.\n\nWhat you say is right: at each moment we go from a Frodo quest to a Aragorn quest we are allowed to change without penalty, except for Huruk-kai (it will have not worked with the captive thing) who have been postponed in Helm's deep. I haven't realized that.\n\nIt still could have work the opposite way: since you can switch heroes they feel free to make a scenario were a lot (even more than some other quests) of heroes were irrelevant.\n\nEdited February 25, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227817","commentId":3227817,"userName":"JYoder","timestamp":1519573995,"content":"GrandSpleen,\n\nSwapping out 1 hero vs 3 is a huge difference. (Only Grey Company also let's you do all 3.) I've never felt I've had to take those options until these last 2-3 quests. They are hard and need specific builds.\n\n \n\nMaybe I'm alone in wanting to take my same 6 heroes all the way, but I don't like the idea of taking Heroes A all the way thru the first 1-15 or 16 quests, then having the option to always reach for Heroes B for 17, and Heroes C for 18.\n\nI've gone thru quests 1-15 with 3 different groups of heroes (including a Rossiel/Mirlonde secrecy deck) and I think these last 2 quests feel more nightmare than not, and I don't see all my original heroes being able to handle them as they have other quests.\n\nI'm just kind of bummed about it, but like I said, maybe I'm alone in wanting to take my same heroes all the way via deck building, without having to actually change heroes.\n\nEdited February 25, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3227853","commentId":3227853,"userName":"GrandSpleen","timestamp":1519578137,"content":"> 1 hour ago, JYoder said:\n> \n> (Only Grey Company also let's you do all 3.) \n\n \n\nI think you've been making this harder on yourself!  Any time the campaign card lets you switch heroes without a threat penalty, you can change all of you heroes. Not just 1 hero.  That happens at the 1st quest in every saga box, except for The Uruk-hai, they put it at Helm's Deep instead.  Tough call, but probably both of those quests should have allowed hero changes.  It messes with the storytelling if Sam is with you during that hunt.\n\nAnd you can swap heroes for free in every quest of the Mountain of Fire box because each quest represents 2 different groups of characters moving through the story.\n\nI haven't played through Moutain of Fire yet (that's my goal for the next couple of weeks actually, I have a bit of extra time). My own campaign is thematic, so I appreciate those moments where you can swap heroes for free.  For a thematic campaign, you can't bring the same group of heroes through all of the quests.\n\nOn the other hand, I do have a campaign going with a friend in which we DO want to bring the same group of heroes from the 1st quest all the way to the last quest.  We've taken them up to Pelennor so far, so I hear you: I hope we can bring them all the way to the end.\n\n \n\nEdited February 25, 2018 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228273","commentId":3228273,"userName":"JYoder","timestamp":1519612206,"content":" \n\nOK, so I'm in the minority in wanting to take the same heroes all the way. Didn't expect that, as I dislike knowing you can always have go-to decks for the last 3 quests, but so be it.\n\nThanks for all the feedback.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228303","commentId":3228303,"userName":"soullos","timestamp":1519613686,"content":"> 11 minutes ago, JYoder said:\n> \n>  \n> \n> OK, so I'm in the minority in wanting to take the same heroes all the way. Didn't expect that, as I dislike knowing you can always have go-to decks for the last 3 quests, but so be it.\n> \n> Thanks for all the feedback.\n> \n>  \n\nyeah, I'm with you. I've only played the first few quests (with the additional PODs too) of the 1st saga box, but I was under the assumption that the quests were designed for a set of heroes who take on the grueling challenge from beginning to end. When I do a campaign mode, that's what I hope to do. Shame the final quests buck that notion... O_o Do permanent boons also transfer when you swap heroes for free in these instances? I would hope so."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228310","commentId":3228310,"userName":"Rouxxor","timestamp":1519613998,"content":"So far I'm counting hawstrike and me who, like you, want to keep all heroes until the end (and I play it entirely) and only grandspleen who enjoy changing his team according to events.  So you are not alone :).\n\nBoons does not transfer if you change your heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228381","commentId":3228381,"userName":"JYoder","timestamp":1519617925,"content":"For the record, I hope I'm wrong, and others are getting through the last 2-3 quests with their same heroes (or at least with few hero changes) and mainly only deck-tweaking.\n\nIn fact, I'm trying to prove my suspicions wrong, but wondered if others have experienced similar to what I suspect, given the much higher difficulty and blatant option to use completely different decks.\n\nDon't get me wrong -- I was super excited to finally defeat the quests (great sense of accomplishment) but I felt lucky in that I'd been running an elite group of heroes during my latest run, thereby making it feasible.\n\nEdited February 26, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228484","commentId":3228484,"userName":"GrandSpleen","timestamp":1519631148,"content":"How did you get around the Wraith on Wings?  I'm seriously stuck on Tower of Cirith Ungol, which I thought wasn't going to be that hard.  I'm playing 2-handed here, so I start with 2 Wraiths in the staging area.  The only thematic requirement I've put on myself is that Sam must be present.  I tried a number of times with several different decks and I can't even manage to place progress on stage 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228496","commentId":3228496,"userName":"JYoder","timestamp":1519633465,"content":"Tower of Cirith Ungol is the \"easiest\" of the 3, so enjoy the rest. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nSpoilers of what I did...\n\nShort version: Before traveling to Two Watchers (and deal with that enemy) I killed the Wraiths ASAP as I couldn't deal with their growing threat.\n\nLong version: I had Glorfindel, Tactics Beregond, Beorn, and Cirdan, Arwen, Lanwyn. If no Feints, Beregond defended against Wraiths (7 armor with boons and Shield of Gondor) and if get Unexpected Courage on him, all the better. Beorn covered minor enemies when needed, protected by Honour Guard if possible. Glorfindel and Beorn attack for 8, with Lanwyn +3, and once I was lucky enough to draw my 1 Black Arrow in my starting hand for her, putting out 16 damage and taking out one Wraith the first round. They are nasty, but until I took them down quick and fast, I couldn't do much with stage 2 either. Though that may mean location build-up to deal with later, etc, but I think that's why locations are -1 threat during the first stage.\n\nKeep us posted in how it goes!\n\nEdited February 26, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228509","commentId":3228509,"userName":"Calvadur","timestamp":1519636373,"content":"Ever since the release of Land of shadow I felt slightly unhappy with how the quests were designed. \n\nThe Black Riders is and probably will always be my favourite box, as it nailed theme and challenge for me. The Road darkens upped the difficult a little bit (at least the visit in Moria was the hardest Lotr-Saga quest up to that date). And Treason of Saruman brought us the best quest yet (if I remember Seastan's quest survey correctly) with Helm's Deep.\n\nThen came Land of Shadow. The dead marshes weren't too spectacular of a quest, but the ranger ambush in the next one pretty much set the tone for the remaining quests with it being nearly impossible to finsih \"perfectly\" with your standard deck. Shelob had an annoying damage shield as well.\n\nFlame of the west started great with the grey company \"recruiting\" the army of the dead, but only to be followed by the siege of Gondor. Multiple times it wasn't possible (for me, playing solo) to finsih it in the minimum number of turns, because the necessary locations just didn't show up. The Pellenor battle felt like a \"badass\" version of Helm's Deep without feeling as \"smooth\" as the former siege. And it was really hard.\n\nNow in mountain of fire I don't really feel the difficulty increasing (haven't played the last quest though) as ever since crossroads I finished the Saga quests mostly by the skin of my teeth. But I have to say I didn't like the way they handled minas morgul. The orcs discarding each other is just to hit or miss. One game you have five different ones in the staging area and in an other they clear themselves every round. They could have just made them attack each other like the shadow card does. More predictable and less vulnerable for extrem results as the orcs would mostly only injure and not kill each other. The Black gate opens is great from a design point of view (even if it is sad they you aren't rewarded for questing successfully, if I am not mistaken), but I will have to see how \"easy\" it is to get enough turns for the final quest. Right now I managed  six, but was aiming for 8 at least... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228578","commentId":3228578,"userName":"Rouxxor","timestamp":1519647663,"content":"> 4 hours ago, GrandSpleen said:\n> \n> How did you get around the Wraith on Wings?  I'm seriously stuck on Tower of Cirith Ungol, which I thought wasn't going to be that hard.  I'm playing 2-handed here, so I start with 2 Wraiths in the staging area.  The only thematic requirement I've put on myself is that Sam must be present.  I tried a number of times with several different decks and I can't even manage to place progress on stage 2.\n\nI think the question wasn't for me, but I will still answer. I 100% agree that tower of cirith ungol is the easier. Basically you have almost only wraith on wings to kill of at the beginning (on the next one wraith on wings have too many friends :x). I only have one since I'm playing solo and I'm putting my threat down right away on turn one and wait 2/3 turns, taking 2 threat because I needed Frodo to quest and to play a lot of allies and only then engage and kill it.\n\n@Calvadur [https://community.fantasyflightgames.com/profile/258336-calvadur/] For what I see (survey I run on a french forum) Pelennor was the most popular quest in the whole saga. Land of shadow is the saga that people enjoy the less with mountain of fire (who have not enough data since most people have been unable to play or have not enough try to compare)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228652","commentId":3228652,"userName":"monkeyrama","timestamp":1519653022,"content":"I am also about to embark on trying these quests, and am attempting to do so with the decks I've taken all the way through. They have actually changed over time, but there's a core of 4 heroes who have come the whole way (Gandalf and Glorfindel in one, Theoden and Eomer in the other). I lost Haldir in the mines, and have rotated the third hero for Gandalf and Glorfindel throughout (just can't settle on one that works). For the Rohan deck it changed from using Galadriel to using Tactics Eowyn when she was released. So I'm hoping these can cope with the final three quests (maybe foolishly I'm also trying out the new Eomer in these quests...).\n\nTactics Eowyn has always been my way of dealing with one of those Wraiths on Wings, since you only need 6 more attack to kill it with her attacking, and thanks to boons Eomer is already at 4 withouth any attachments. It does look like I'm going to be stomped, so maybe I'll end up building specially to take these on.\n\nOne question I have is how much people running the same heroes tweak the actual decks? I've done a lot of that, adding in cards or putting in some to deal with some quests specially. For the Passage of the Grey Company I used all Tactics Rohan so that my heroes had all high willpower (eg)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228656","commentId":3228656,"userName":"JYoder","timestamp":1519653154,"content":"> 4 hours ago, Calvadur said:\n> \n> The Black gate opens is great from a design point of view (even if it is sad they you aren't rewarded for questing successfully, if I am not mistaken), but I will have to see how \"easy\" it is to get enough turns for the final quest. Right now I managed  six, but was aiming for 8 at least... \n\nThat's the real kicker, as I didn't find 6 enough for my heroes. (And I assume you still axed the Wraiths so they wouldn't move on?) After playing and gauging the final quest a few times, I set my mind on getting 8 resources in the prior quest, as I felt 7 would still be very hard for my heroes. I eventually squeaked out 8, and was very glad to have that bit of breathing room for the final quest. I'm very curious to know if your build can handle 6 turns, as it would require a lot of willpower, while still dealing with enemies and not being able to cancel the first treachery each round, which also always gains surge. Just nasty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228662","commentId":3228662,"userName":"JYoder","timestamp":1519653351,"content":"> 3 minutes ago, monkeyrama said:\n> \n> One question I have is how much people running the same heroes tweak the actual decks? I've done a lot of that, adding in cards or putting in some to deal with some quests specially. For the Passage of the Grey Company I used all Tactics Rohan so that my heroes had all high willpower (eg).\n\nI'm constantly tweaking my decks to accommodate the current quest, as I find that part of the struggle and fun. My two sideboards during the saga quests are always quite huge. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228668","commentId":3228668,"userName":"monkeyrama","timestamp":1519653538,"content":"> 1 minute ago, JYoder said:\n> \n> I'm constantly tweaking my decks to accommodate the current quest, as I find that part of the struggle and fun. My two sideboards during the saga quests are always quite huge. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nYes! I was rebuilding my saga decks this week in order to start the last box, and started out with near enough 150 cards in each. That took some trimming...\n\nIn the Black Gate Opens, you add the resource at the start of the quest phase, so it's a case of aiming to survive 7 rounds (since in the 8th round you if you lose you still added the token)? Or did I misunderstand? Seems like a beastly quest. I hope the new Eomer is stronger than people think (although I doubt it a little). I like to try the new cards!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228674","commentId":3228674,"userName":"Wandalf the Gizzard","timestamp":1519654168,"content":"I don't understand why you would want to keep the same heroes in every single quest. The company was split! It wouldn't make sense to have Legolas, Gimli, Frodo, and Sam win the Battle of Helm's Deep and then teleport to the Dead Marshes. Not wanting to switch heroes between quests in the same character/story thread (Aragorn path vs. Frodo path) I completely understand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228683","commentId":3228683,"userName":"JYoder","timestamp":1519654712,"content":"> 3 hours ago, monkeyrama said:\n> \n> In the Black Gate Opens, you add the resource at the start of the quest phase, so it's a case of aiming to survive 7 rounds (since in the 8th round you if you lose you still added the token)? Or did I misunderstand? Seems like a beastly quest. I hope the new Eomer is stronger than people think (although I doubt it a little). I like to try the new cards!!\n\nCorrect. I was so glad to have barely survived that 7th round... only to get waxed in the 8th.\n\n \n\n> 3 hours ago, Wandalf the Gizzard said:\n> \n> I don't understand why you would want to keep the same heroes in every single quest. The company was split! It wouldn't make sense to have Legolas, Gimli, Frodo, and Sam win the Battle of Helm's Deep and then teleport to the Dead Marshes. Not wanting to switch heroes between quests in the same character/story thread (Aragorn path vs. Frodo path) I completely understand.\n\nYeah, I get why people would prefer not to, but for me, it's two-fold. One, I feel attached and want to take them through everything. And two... I just don't want to keep redoing my decks! I still feel immersed, and if I tried to adhere so strictly to theme, I wouldn't do half of the card plays I do, such as playing my \"Ho! Tom Bombadil!\" card during the final quest that I'd held onto forever!\n\nEdited February 26, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3228750","commentId":3228750,"userName":"Rouxxor","timestamp":1519658322,"content":"> 1 hour ago, monkeyrama said:\n> \n> One question I have is how much people running the same heroes tweak the actual decks? I've done a lot of that, adding in cards or putting in some to deal with some quests specially. For the Passage of the Grey Company I used all Tactics Rohan so that my heroes had all high willpower (eg).\n\nNEVER! Like never. I sometime decline having an additional hero or objective-ally because my decks is playing the same character ^^. I accept to put additional cards win in the campaign. And I had to make a complete specific (just keeping the same heroes) deckbuild against the last quest. And I allowed myself to remove my useless galadhrim's greeting in the black gate to some grindy option like Aragorn's banner, sword that was broken and Faramir to have enough willpower to stand one or two turn longer ^^.\n\n> 1 hour ago, Wandalf the Gizzard said:\n> \n> I don't understand why you would want to keep the same heroes in every single quest. The company was split! It wouldn't make sense to have Legolas, Gimli, Frodo, and Sam win the Battle of Helm's Deep and then teleport to the Dead Marshes. Not wanting to switch heroes between quests in the same character/story thread (Aragorn path vs. Frodo path) I completely understand.\n\nBecause I don't care who get to those battle. I don't planned to remake the books. I make a new story. And because I'm way more interested by testing decks I want to play in any adventures (saga or not) that to follow the story. Especially in saga, where the story is less exciting that in cycle to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3229810","commentId":3229810,"userName":"JYoder","timestamp":1519705844,"content":"As I said earlier, I at least wanted to try and prove myself wrong... but I've failed...\n\nWith my 2nd group of heroes from a prior run-thru (no Spirit) I've tweaked and played The Black Gate Opens several times, until I finally had an ideal card draw and good options with an early Steward, 2 early Gildor's Counsels, etc. However, with average willpower and not enough readying effects or cancellation, I only got 6 resources on the Black Gate. For these heroes, it's likely possible to do a bit better with builds I'm not seeing and a bit more luck (Gwaihir never showed), or maybe these heroes can somehow do the final quest in 6 rounds in ways I'm not seeing... but the fun factor has quickly dwindled, and I love the game too much to risk burn out by getting hung up on trying to force these heroes all the way.\n\nSo IMHO, the last 2 saga quests feel Nightmare-level (which I never felt in prior saga quests) which, to me, means they require specific builds, possibly beyond the heroes you've brought so far. (I found Spirit had excellent options to deal with the last couple of quests, with 4-6 cards being key). Of course, for those who welcome changing heroes, it doesn't matter. But it's deflating to me, knowing you can create go-to decks for these last 3 quests from the ground up, without penalty, which in my mind, undermines the campaign experience.\n\nStill, there's lots of thematic goodness in these quests, as mechanically, they are very clever.\n\nEdited February 27, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3229885","commentId":3229885,"userName":"NathanH","timestamp":1519714300,"content":"BTW, how do you actually earn Gwaihir? According to the campaign card you earn him if he is controlled by the first player. But the scenario ends with all players eliminated, so the first player can't control him, being dead."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3229911","commentId":3229911,"userName":"GrandSpleen","timestamp":1519718035,"content":"Finally pulled off a win aganist The Tower of Cirith Ungol.  I ended up using Sam (my one thematic requirement), Treebeard, and Beregond (Tactics), along with Arwen, Eowyn (Spirit), and Elrond.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3229991","commentId":3229991,"userName":"Rouxxor","timestamp":1519729432,"content":"> 6 hours ago, JYoder said:\n> \n> As I said earlier, I at least wanted to try and prove myself wrong... but I've failed...\n> \n> With my 2nd group of heroes from a prior run-thru (no Spirit) I've tweaked and played The Black Gate Opens several times, until I finally had an ideal card draw and good options with an early Steward, 2 early Gildor's Counsels, etc. However, with average willpower and not enough readying effects or cancellation, I only got 6 resources on the Black Gate. For these heroes, it may be possible to do better with better builds and a bit more luck (Gwaihir never showed), or maybe these heroes can somehow do the final quest in 6 rounds, but the fun factor has quickly dwindled, and I love the game too much to risk burn out by getting hung up on trying to force these heroes all the way.\n> \n> So IMHO, the last 2 saga quests feel Nightmare-level (which I never felt in prior saga quests) which, to me, means they require specific builds, possibly beyond the heroes you've brought so far. (I found Spirit had excellent options to deal with the last couple of quests, with 4-6 cards being key). Of course, for those who welcome changing heroes, it doesn't matter. But it's deflating to me, knowing you can create go-to decks for these last 3 quests from the ground up, without penalty, which in my mind, undermines the campaign experience.\n> \n> Still, there's lots of thematic goodness in these quests, as mechanically, they are very clever.\n\nSpirit is alway good because it is the better way to have willpower, but not only: spirit do everything very well recently. But the best spirit card (test of will) is pretty weak in the last two quest: it trigger a 6 attack on black gate opens (never played until now) and in mount doom the first treachery is impossible to cancel in step 1 and 3, but it also get reninforcement so you can counter if another one came up after (that the best use of test of will), the quest 2 is a one turn in all my games, but it it the only moment you can cancel free because step 4 just forbid to cancel.\n\n> 4 hours ago, NathanH said:\n> \n> BTW, how do you actually earn Gwaihir? According to the campaign card you earn him if he is controlled by the first player. But the scenario ends with all players eliminated, so the first player can't control him, being dead.\n\nAs usual, rules doesn't work so you have to deal with logical sense, who is a pretty bad things to do when you conceive a game.\n\n> 3 hours ago, GrandSpleen said:\n> \n> Finally pulled off a win aganist The Tower of Cirith Ungol.  I ended up using Sam (my one thematic requirement), Treebeard, and Beregond (Tactics), along with Arwen, Eowyn (Spirit), and Elrond.  \n\nHurrah! Now you will have to face the worst part! I recently try to play just Sam on mount doom and it doesn't lack that much to win. But I probably won't be able to win this way. It would have been nice to be able to win only with Sam and Frodo :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230128","commentId":3230128,"userName":"JYoder","timestamp":1519740951,"content":"> 6 hours ago, GrandSpleen said:\n> \n> Finally pulled off a win aganist The Tower of Cirith Ungol.  I ended up using Sam (my one thematic requirement), Treebeard, and Beregond (Tactics), along with Arwen, Eowyn (Spirit), and Elrond.  \n\nNice! You (and others) keep us posted on your progress!\n\nAgreed, Rouxxor, that Test of Will had more limited use, but I still found it very useful at times. I was mainly thinking of different cards I'd never used before.\n\nI'm curious -- for those who completed the last 2 quests, how many resources did you get on Black Gate that let you make it through Mt Doom? I really wanted 8 with my first heroes, which I finally got, but I suppose with more tweaking, maybe I could have done Mt Doom in 7 turns, but it would have been quite a bit harder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230581","commentId":3230581,"userName":"Rouxxor","timestamp":1519759607,"content":"With my Elrond Gandalf Arwen I was getting 5 resources on my first try but I wasn't satisfied because it also cost me a valuable boons so I replay it and stand until I got 9 resources without spending any once per campaign effect (I was able to keep them all for the last). I also gain an eagle and get rid off a nazgul on wings.\n\nAnd when I play mount Doom I succeed using 5, 8 and 6 resources. And get approximately the same amount of defeat ^^. It was the two only time in the whole saga that I have to play more than once a quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230686","commentId":3230686,"userName":"JYoder","timestamp":1519763093,"content":"Very powerful willpower deck, and finishing Mount Doom in 5 rounds is super impressive. So you must have cleared the 1st stage turn 1, the 2nd stage turn 2, then over 2 turns passed fortitude tests to put more than 5 progress on the 3rd stage, then cleared Mt Doom in the 5th round and passed a fortitude test? Yeah... there's NO chance any of my current saga heroes could manage that. Not even close to that much willpower. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n \n\n> 44 minutes ago, Rouxxor said:\n> \n> It was the two only time in the whole saga that I have to play more than once a quest.\n\nYou're better than me! When taking new heroes through the saga, I often don't defeat quests on the first try. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230720","commentId":3230720,"userName":"Rouxxor","timestamp":1519764065,"content":"5 counters mean 6 turns. I always get the same pattern:\n\n- 2 Turns on the first step (almost every time 5 progress where put on the first try, some coincidence ^^);\n\n-1 on the second\n\n- 1 on the last (mount doom get out of the staging area so it is easy to make huge questing success)\n\nAnd the rest on step 3, the most annoying with his 20 progression, his test at the beginning of the quest (not easy to figure when to try to succeed or just accept only put 5 counter AND have drawback from cards you reveal because you failing a test this phase), the reinforcement and can't be countered for the first treachery AND his test when traveling to mount doom. I do in 2 turns in an incredible situation but it take me 3 and 5 turns in others try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230730","commentId":3230730,"userName":"JYoder","timestamp":1519764373,"content":"You say 5 counters means 6 turns, but I'm not tracking. You take 1 resource off at the end of each round, and if there are none left, you lose. 5 counters = 5 rounds. Am I missing something?\n\nEdited February 27, 2018 by JYoder"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230763","commentId":3230763,"userName":"Rouxxor","timestamp":1519765166,"content":"I never finish the round where I'm winning. So when I win on turn 6 i spent only 5 resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3230773","commentId":3230773,"userName":"JYoder","timestamp":1519765361,"content":"But you can't have a 6th turn as it's too late -- you'd lose at the end of the 5th round, right after you remove the 5th resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3231321","commentId":3231321,"userName":"Rouxxor","timestamp":1519804612,"content":"You are right. That is why I wasn't satisfied with my 5 resources on black door opens, it means I have to win using only 4 resources, witch almost mean one turn per step and is barely impossible. I probably get confused about this when I post this ^^. Since I get 9 resources on my good run, my following performance of 8 resources spend work well.\n\nAn easy way to picture it is to represent us as playing epic mode: when I die during quest phase in door opens I'm only allowed to finish the same turn with mount doom team."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3231691","commentId":3231691,"userName":"Boromore","timestamp":1519833024,"content":"I can see the case for keeping the same \"fellowship\" - I generally play 2-deck, and try to keep the same heroes throughout a cycle, for example. But with the Saga, especially the last 3 quests, I tended to keep a few core heroes, and draft in others just to stay in the game.  And yes, that was hard! I agree, the quests all need a good run of luck to be beaten, at least by me.\n\nGot to 7 resources and Gwaihir on my third try at The Black Gate - top priority was always clipping the wings of both wraiths, as I knew I couldn't face Mount Doom with them in play. Took me 14 attempts to finish Mount Doom, and that was out of time (8 rounds). Finally, on the 15th attempt I did it on my sixth round - so a whole round to spare!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3231778","commentId":3231778,"userName":"Ywingscum","timestamp":1519836238,"content":"So the 15th time it was too easy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3232735","commentId":3232735,"userName":"GrandSpleen","timestamp":1519885606,"content":"I played The Black Gate Opens.  The first two times I messed up: first time I forgot to reveal extra cards for the first two rounds, so I scrapped the game.  2nd time I forgot to add enemies to the staging area as part of the Stage 2 \"When Revealed\" effect, so I scrapped the game.\n\nThe third time was pretty satisfying.  So what do you think, gents: I got 7 resources and I managed to kill both of the Wraiths on Wings (playing 2-handed here, so there are 2 of them).  Do I need to push more and get 8 or 9 resources?  Or is the removal of both Wraiths enough of an accomplishment that I can try Mount Doom now?\n\nI used Gimli (T), Eowyn (S), and Beregond (T), along with Denethor (Le), Imrahil (Le), and Damrod.  \n\nThe hero lineup was pretty close to a thematic lineup, so I was satisfied.  The heroes who wouldn't physically be present at the battle (Eowyn: wounded, Denethor: dead) would be serving as inspiration for the other heroes.  That's pretty much how you have to justify most of the Same & Frodo quests, so I can take the same approach here.\n\nEowyn has Esquire of Gondor, so Denethor can pass her resources and she quests for 5 at the start of the game, alongside the Gondor deck.\n\nGimli has Intimidation, which I never got to use during this game.  The plan is to set him up with a Rohan Warhorse + one Citadel Plate, but I never drew either card.  Gimli also has Esquire of Rohan.  If I can ready Eowyn, he gets an attack bonus.  Ideally she gets a Steed of the Mark and Herugrim.  She got her steed in this game but no Herugrim.\n\nLegolas ally hit the table, which was also a thematic win.\n\nAragorn has Leader of Men, and I think he even used it successfully on the first round.\n\nThe 2nd to last round was very satisfying because one Wraith was already dead, I had 8 enemies engaged (4 per player), I think four of them were Nazgul.  The remaining Wraith on Wings had 5 damage on it already.   I used undefended attacks to annihilate the Gondor deck, leaving only Aragorn alive on that side of the table.  By the end of enemy attacks, only Gimli was alive on the other side (except for allies).  Gimli for 6 attack, Legolas for 3, and Gwaihir for 3 finished off the last Wraith.  It was also nicely thematic that Gwaihir made an appearance.\n\nI had 90 threat or so at that point.  But I didn't make it through staging during the next turn -- The Mouth of Sauron attacked a couple of times and finished me off.\n\nMy campaign doesn't have any of the one-time boons left, I used 1 in Pelennor and 1 in Helm's Deep.  I do still have Palantir of Orthanc though.\n\nFun game, satisfying result, but I'm wondering how important it is that I push for 8 or 9 tokens on The Black Gate.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3232824","commentId":3232824,"userName":"Rouxxor","timestamp":1519895242,"content":"It is hard to say. First you will have to learn how to beat Mount doom, now matter how many turns it will take. Tips: remove allies and add attachments ;). 7 counter seem a minimum though, a little bit hard but possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3232846","commentId":3232846,"userName":"Boromore","timestamp":1519897887,"content":"I think you should be okay. I was happy with 7 resources on my third attempt. You can usually recognise when you've had a good run on the cards, and played them to the best. Both wraiths down is good, and Gwaihir is a bonus.\n\nI took the view that if 7 wasn't enough, I could always go back and retry, once I had a target in mind from Mount Doom. (Although I can understand if you don't like that \"revisionist\" approach). In the (long) end, I only actually needed 6 - but again, that was all the luck staying with me on Mount Doom.\n\nOften I try to play each scenario 5 times, win or lose, as the scenario changes greatly with card draw, with some new nasty twists. After that I tend to get deja vu."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3232964","commentId":3232964,"userName":"JYoder","timestamp":1519909016,"content":"Well done. 7 is doable, as you'll find. Maybe my original 6 heroes could have done it, but I was really glad to have 8. I won't spoil anything as assume you want to figure it out. Enjoy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3233096","commentId":3233096,"userName":"GrandSpleen","timestamp":1519917151,"content":"I'm not against trying Mount Doom and then replaying The Black Gate Opens if it looks like I need more time.  Alright, then.  Looks like I'm forging ahead to the mountain of fire next."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3237144","commentId":3237144,"userName":"GrandSpleen","timestamp":1520154357,"content":"I beat it!  22 attempts, whew.  There were 2 resources remaining on the campaign card when I won (2 rounds on stage 1, 2 on stage 2, 1 on stage 3, then finished on the 6th round). Family's visiting relatives abroad, so I obsessed over finishing my campaign for a few days.  Exhausted now. \n\nThere were a couple of key cards that unlocked my victory.  It took me a while to find them.  I was able to complete it mostly thematically, with only 1 concession.\n\nCirith Ungol also took 22 attempts, while strangely I got a good result from The Black Gate Opens after only 1.  I was worried that it would feel anticlimactic after Cirith Ungol took me so long, but I was worried over nothing.  That was **** hard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3237178","commentId":3237178,"userName":"Rouxxor","timestamp":1520160128,"content":"Well done! Can you post your decklist?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3237358","commentId":3237358,"userName":"JYoder","timestamp":1520181038,"content":"Way to go! It's certainly a great feeling of accomplishment. And 5 rounds -- impressive!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3237427","commentId":3237427,"userName":"GrandSpleen","timestamp":1520186398,"content":"I'll have to make the decklist first, hah! I started with a shell on Ringsdb and then changed the deck bit by bit physically, so I don't currently have a digital list.  I'll make and put it in a separate spoilery thread later on when I have some time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3237752","commentId":3237752,"userName":"GrandSpleen","timestamp":1520207337,"content":"This deck seems to be fairly spoiler-free, so I made another thread to discuss decks and strategy for Mount Doom, spoilers welcome!  Thread is here [https://community.fantasyflightgames.com/topic/270992-mount-doom-strategy-spoiler-laden/].\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270439-my-thoughts-on-mountain-of-fire-quests-yours/?do=findComment&comment=3384545","commentId":3384545,"userName":"JYoder","timestamp":1529943254,"content":"Been a few months, so thought I'd re-visit this thread. I know many said they have no problem swapping out their heroes, but I really enjoy the boons I've earned -- having to drop heroes and their boons feels very un-saga-ish to me. But I'm also realizing I don't always play with \"dream teams\" (as many do) but I like to experiment. To me, it feels like the saga gives you that wiggle room... up until the very end.\n\nAnyway, now that I assume more have completed the entire saga, I was curious if there were any more thoughts."}]}