{"url":"https://community.fantasyflightgames.com/topic/270735-sagas/","title":"Sagas","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/270735-sagas/?do=findComment&comment=3233134","commentId":3233134,"userName":"Ywingscum","timestamp":1519919455,"content":"I've played both Hobbit sagas.  Very enjoyable.  I have one core, 5 Mirkwood packs.  And I have player cards from heir of Numenor.\n\nSo I ordered all the LoTR sagas.\n\nGuess I have two questions.  Do I have a deep enough card pool to play through the whole thing?\n\nSecond question, if all sagas aren't available, I guess you need to play them in order or not at all?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/270735-sagas/?do=findComment&comment=3233484","commentId":3233484,"userName":"NathanH","timestamp":1519930200,"content":"I don't think I'd like to play the last two boxes with that card pool, they are rather difficult. The earlier boxes should be winnable but might take quite a few attempts per quest. You can play individual quests in the sagas without playing the previous ones, just like a normal quest, but you won't be able to play them in Campaign Mode. Campaign Mode is fun, but it's not a huge change to the game, so you can still get most of the fun out of the boxes even if there's one missing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270735-sagas/?do=findComment&comment=3233775","commentId":3233775,"userName":"Calvadur","timestamp":1519937488,"content":"If memory serves the dwarrowdelf cycle had some excellent player cards and I recommend to pick them up (most quests are fun, too!) regardless.\n\nAs NathanH said, the first two boxes are 100% doable, one or two quests might take a while though. Second and fourth box depend on your skill I would say. If you bring good decks and play well it should be doable, but I only played those with a full cardpool.\n\nLast two boxes have some of the hardest quests of the game, so good luck. \n\nSome people like to play quests in a minimal purchase mode (e.g. Seastan, check out his youtube if you like), meaning they only use the cards from one core and the necessary expansions to play a specific quest (=box + AP;/only the box for sagas). I don't know exactly which quests he did so far, but think some were quite tuff. That's just ment as a reminder, that most quests can be brought down with enough tries, regardless of your cardpool's size."},{"commentUrl":"https://community.fantasyflightgames.com/topic/270735-sagas/?do=findComment&comment=3234136","commentId":3234136,"userName":"Ywingscum","timestamp":1519949939,"content":"Thank you for the insights, I have to wait and see what comes in.\n\nbut I guess best bet to progress with other expansions a bit first.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/270735-sagas/?do=findComment&comment=3243414","commentId":3243414,"userName":"CaffeineAddict","timestamp":1520583613,"content":"Don't forget you can play the quests on easy mode. Easy doesn't really mean \"easy\", they're still tough, but more manageable for smaller card pools. "}]}