{"url":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/","title":"Did I jump to far ahead?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3260214","commentId":3260214,"userName":"FrogTrigger","timestamp":1521923449,"content":"I've got the core and the first complete cycle, I've been waiting and waiting for a re print to ship to my lgs so I can either move forward with the next saga expansion or deluxe. \n\nYesterday I got sick of waitin and grabbed the closest saga expansion to the core which was treason of Saruman. \n\nIve only had time to try the first mission once but I got my but kicked. Am I to far behind in cards to make this quest playable? Do I just suck ( I haven't played in a while)? I had read that each saga expansion is balanced around the core only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3260251","commentId":3260251,"userName":"NathanH","timestamp":1521927022,"content":"First of all, I wouldn't take too seriously the idea that all the saga expansions are fully playable with just core + expansion only. This might be arguable for the first one or two but they get progressively more difficult. So don't be thinking you must be bad if you can't win with your current pool.\n\nI think The Uruk-Hai is probably winnable with your card pool. My experience with the quest is that it is not technically that hard but it has a different rhythm to your average quest and so it might take a while to work out. I haven't played it much and have typically lost once without much hope the first time I have tried with any given deck. It will be difficult and will probably take some playing and tweaking but you should be able to get there in the end. Helm's Deep on the other hand is one of the harder quests in the game, although outside of Campaign Mode taking a risk on Poisoned Counsels is tempting and powerful. Still, even in standalone mode it is more than capable of crushing decks built with the full card pool, so you might find yourself having to resort to Easy Mode for this one. Finally, Road To Isengard can also be difficult but it has a sneaky trick that can make it much easier once you work it out. It is still likely to be a stern challenge though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3260645","commentId":3260645,"userName":"Rouxxor","timestamp":1521971170,"content":"Like NathanH I would say that only the first two saga are made to be playable with core set. And even like this it is not that easy (but core set is quite hard). The two following are probably playable with core and the previous saga. And the two last contain quest really hard even with all saga and core set, especially the two last who are among the most difficult in the game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3260697","commentId":3260697,"userName":"Wandalf the Gizzard","timestamp":1521979468,"content":"I'd say just listen to what they said."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3261228","commentId":3261228,"userName":"FrogTrigger","timestamp":1522026321,"content":"Hrmm well that is both interesting and disappointing. It advertises right on the box as designed to be balanced with the core box.. but it clearly is not lol. I will still attempt the new missions, might just have to go to easy mode to get it done then. Should still be a challenge on easy mode if it is 'unwinnable' in regular mode.\n\nHurry FFG and ship some new product!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3261468","commentId":3261468,"userName":"cheapmate","timestamp":1522053894,"content":"> 7 hours ago, FrogTrigger said:\n> \n> Hrmm well that is both interesting and disappointing. It advertises right on the box as designed to be balanced with the core box.. but it clearly is not lol. I will still attempt the new missions, might just have to go to easy mode to get it done then. Should still be a challenge on easy mode if it is 'unwinnable' in regular mode.\n\nIt is not “unwinnable” with only a core and that expansion, even though it might be harder.\n\nI can imagine it is difficult to design an expansion that is both balanced with only a core and challenging for players who own everything. So the straightforwardness of just questions/defending/attacking from the core and the first expansions has been replaced with something that takes a bit longer to grasp.\n\nAny card game seems to get “easier” as your cardpool grows, but I would say your skill (which is mostly experience) is the more important part of being able to “win” a given scenario.\n\nSo I would suggest to try it again (and again if needed), with the cards at your disposal and see where the weakness in the scenario is and beat it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3261695","commentId":3261695,"userName":"dalestephenson","timestamp":1522074130,"content":"There's no shame in easy mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3261872","commentId":3261872,"userName":"BigKahuna","timestamp":1522081043,"content":"The thing about Lord of the Rings and really all of the Living Card games is that you can’t approach collecting with a ”I’m doing this in order” approach unless you are caught up to the current set.  If you try to do that you will be extremely irritated as there is always an expansion or two ”currently” not available anywhere and you will spend all of your time waiting on re-prints.. when the thing you have been waiting for becomes available, the next thing that has been available last time you checked is now out of print and your back to waiting again.\n\nMy advice on collecting now is as followed.\n\n1.  Whenever you have some cash to blow, pick up the Deluxe or Saga Expansions that are available first.  The reason for this is simple, if you have the deluxe box, you can buy into the cycle and you won’t get quests asking for cards you don’t have.  Don’t worry about order here, just get what is available.\n\n2. When you buy into mini (quest expansions) buy whole sets if you can.  Usually when they print a cycle, they print the whole thing at the same time so when its available, grab the whole thing.  \n\n3. At some point you will get to a point where you just can’t rely on order at all, at which point just buy what is available.\n\nThere are two things you can count on in the future. \n\n1. At some point this game will be expired.  Might be this year, might be in 3 year, eventually it will.  So if you are just now getting into it and you intend to collect.... I suggest not wasting any time.\n\n2. At some point we might see a second edition.. brace yourself for that day, your guards may one day be rendered obselete.\n\n3. Buy on discount.  If you aren’t too picky, even buy used sets, but generally at this point you can get most things at a discount.\n\nAs for the difficulty vs. Card pool.  While larger cardpools help, generally speaking the game is not terribly well balanced for solo play.  Its doable, but its clearly a game designed with two players in mind hence playing most quests solo is inhumanly difficult.\n\nThere are various solo play variants, I’m personally working on unofficially publishing my own but finding ways to adapt the rules a bit in your favor will make the game a little bit easier (if you want that of course).  In general though if you are winning 10%-20% of your solo games (1-2 in 10) your doing well.\n\nOne thing I can tell you is that playing straight by the rules requires very focused decks designed to beat specific quests.  Once your card pool gets bigger you can create decks that can carry a wider range of quests but with a small pool after playing the quest a few times, getting the jist of how it works... get into that card pool and expose its weaknesses with a well thought out deck.\n\nAs for the entire Saga Expansion, doing it solo striaght up, is BRUTAL,especially trying to do it with a single deck.  But most LoTr players will tell you that, every quest is beatable with the right approach and there are a few ”ultimate decks” that can crush even the toughest quests solo.  Suffice to say learning the nuances of the game and getting better at it helps, however no matter how you look at it LoTr is a tough game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262031","commentId":3262031,"userName":"stimpaksam","timestamp":1522085292,"content":"Great advice, BK.\n\n> 1 hour ago, BigKahuna said:\n> \n> In general though if you are winning 10%-20% of your solo games (1-2 in 10) your doing well.\n\nThe way I've always looked at it was treating it like batting average in baseball. If I can play a quest and win it 3 times out of ten that's a .300 batting average and considered pretty dang good!\n\nEdited March 26, 2018 by stimpaksam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262087","commentId":3262087,"userName":"Hannibal_pjv","timestamp":1522087435,"content":"> 9 hours ago, cheapmate said:\n> \n> It is not “unwinnable” with only a core and that expansion, even though it might be harder.\n> \n> I can imagine it is difficult to design an expansion that is both balanced with only a core and challenging for players who own everything. So the straightforwardness of just questions/defending/attacking from the core and the first expansions has been replaced with something that takes a bit longer to grasp.\n> \n> Any card game seems to get “easier” as your cardpool grows, but I would say your skill (which is mostly experience) is the more important part of being able to “win” a given scenario.\n> \n> So I would suggest to try it again (and again if needed), with the cards at your disposal and see where the weakness in the scenario is and beat it.\n\nYep. More cards almost automatically make game somewhat easier, because of so many cards that can co-operate with each others... So bigger card pool will definitely make the game easier.\n\nAnd even the first cycle was hard until I learned how to play the game efficiently and make decks according to that... So easy mode is good at the beginning and when you  find out what cards and played how will help you to win specific scenario, it is time to go normal.  In LOTR lcg each scenario is a puzzle. When you finfd it out, it becomes much easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262095","commentId":3262095,"userName":"Authraw","timestamp":1522087727,"content":"In my experience, most Deluxe expansions are beatable with just a Core Set--especially on Easy mode (that's what Easy mode is there for, after all). But that doesn't mean that it's going to be easy; the game is generally quite difficult, but also individual quests can have wildly different difficulties from one another. This is an intentional design choice, I'm sure, since different people have different tastes.\n\nThe second quest of Treason of Saruman is one of those big setpiece battles from The Lord of the Rings, and those tend to be among the harder quests in the game. I would expect it to take some time to figure out regardless of your card pool. You'll need to try different types of decks, tweaking what you have as you discover which cards are helpful against the quest and which ones feel like dead weight.\n\nI run a blog series called \"Path Less Traveled\" [https://darklingdoor.wordpress.com/path-less-traveled/] in which I analyze the difficulty of different quests if you only had a Core Set + that expansion. I haven't tackled Treason of Saruman yet, but you may find it helpful to see how I construct different decks with a limited card pool.\n\nIt's also worth noting that the game is quite playable solo--I do it all the time, almost always with some additional deckbuilding constraint that limits me to only using portions of my card pool (because I find that constraints aid in the creative process). In my Thematic Nightmare blog series [https://darklingdoor.wordpress.com/thematic-nightmare/], I try to build a deck capable of getting a 3 / 5 win rate solo against a Nightmare quest, and I'm generally able to do so. The trick is that I tailor each deck to the quest that I'm playing, rather than trying to take the same deck up against everything. I think that's one of the major differences between solo play and multiplayer--in solo, every card counts, so there's not a lot of wiggle room. In multiplayer, you can kind of cover each other's weaknesses, so it's a little easier to just pick a favorite deck or two (preferably with sideboards) as long as the players collectively have all of the bases covered.\n\nBigKahuna's advice to just buy what you find in stock is solid--unfortunately, gone are the days where most of the game comes into stock at one time. FFG seems to be having trouble with their print schedules lately (even to the point of making it hard to find recently released packs sometimes) so you'll just have to buy what you can when you can get it. (I'm not really worried about the game disappearing, though--the game still sells out quickly, and with the new Amazon series coming up the LotR franchise is only going to get more popular again).\n\nGood luck, and welcome to the community!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262471","commentId":3262471,"userName":"Wandalf the Gizzard","timestamp":1522099908,"content":"-\n\nEdited March 26, 2018 by Wandalf the Gizzard\ndouble post"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262481","commentId":3262481,"userName":"Wandalf the Gizzard","timestamp":1522100125,"content":"> 5 hours ago, BigKahuna said:\n> \n> The thing about Lord of the Rings and really all of the Living Card games is that you can’t approach collecting with a ”I’m doing this in order” approach unless you are caught up to the current set.  If you try to do that you will be extremely irritated as there is always an expansion or two ”currently” not available anywhere and you will spend all of your time waiting on re-prints.. when the thing you have been waiting for becomes available, the next thing that has been available last time you checked is now out of print and your back to waiting again.\n\nThat's me. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\n \n\n> 5 hours ago, BigKahuna said:\n> \n> In general though if you are winning 10%-20% of your solo games (1-2 in 10) your doing well.\n\nReally? I win closer to 60% of mine, and I don't consider myself that good.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262505","commentId":3262505,"userName":"BigKahuna","timestamp":1522100975,"content":"> 9 minutes ago, Wandalf the Gizzard said:\n> \n> That's me. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n> \n>  \n> \n> Really? I win closer to 60% of mine, and I don't consider myself that good.\n> \n>  \n\nWell I suppose it depends on the quest/expansion.  I find boxes like Heirs of Numenor to be extremely difficult solo and getting through Saga with a single set of heroes is also extremely challenging, in particular if you don't do deck changes between certain quests.  Other stuff like Mirkwood cycle, I can beat fairly consistently.   I would say on average though ...20% is about right for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3262614","commentId":3262614,"userName":"Rouxxor","timestamp":1522107488,"content":"> 1 hour ago, Wandalf the Gizzard said:\n> \n> That's me. :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n> \n>  \n> \n> Really? I win closer to 60% of mine, and I don't consider myself that good.\n> \n>  \n\nIf win more probably 90%* of my game and I play only nightmare for quest available in nightmare. And I don't think it is that much related to \"be good\", as \"make the best choice during games\". It is also a lot about card that you own, how much you know the quest before playing it (so the more you play the more you will win), how you like to build a deck (I don't care about thematic), how much you are looking about other people build (I compare a lot of decks on the thematic I build)... I make every choice that increase my chance of winning on this list so, of course, I'm winning a lot ^^.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272151-did-i-jump-to-far-ahead/?do=findComment&comment=3263063","commentId":3263063,"userName":"Wandalf the Gizzard","timestamp":1522156358,"content":"Fair points.\n\nMost of my losses come from early game bad luck. Surge chains, unexpected undefended attacks, location lock followed by threat spike, etc."}]}