{"url":"https://community.fantasyflightgames.com/topic/272310-win/","title":"Win %","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3262982","commentId":3262982,"userName":"sappidus","timestamp":1522152100,"content":"This came up in another topic, but I thought it might be worth exploring on its own: what's your winning percentage in this game? Are you satisfied with it?\n\nI actually log all of my plays: the data shows I'm around 50% (including all scoops). I'm quite happy with this number. I have little doubt it could be higher, but (as my published RingsDB decks show) I spend a lot of time in this game testing out janky ideas, which naturally pulls down the win rate.\n\nFor me, the essential appeal of this game is in the losing anyway—if I named my top 5 most memorable quest playthroughs, 4 of them would be losses. Maybe 5. After all, the beauty of a game so soloable is that the usual winwinwin shackles imposed by gaming can be subordinated to other considerations, if you so desire.\n\nEdited March 27, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3262999","commentId":3262999,"userName":"Denison","timestamp":1522153459,"content":"10% if I'm being generous. So many scoops. But I also play the Nightmare decks.\n\nMy last game, for instance,  things were going fine until surge effects brought six encounter cards into play. I went into \"Alternate Universe\" just to see how it might play out differently (still lost.)\n\nIt's not the destination...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263041","commentId":3263041,"userName":"dalestephenson","timestamp":1522155339,"content":"If I averaged my win percentage for each quest, it's probably over 50%.  If I averaged every time I played, it's probably under 20%.  I tend to play a quest until I win it, so Encounter at Amon Din has been played only twice and Morgul Vale over 30 times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263067","commentId":3263067,"userName":"Wandalf the Gizzard","timestamp":1522156723,"content":"I'm around sixty percent, not counting first turn scoops (which probably brings it to 35). Granted, I haven't caught up with the more recent cycles, so I'm facing easier quests.\n\nHere's what I said in the topic the OP mentioned.\n\n> 2 minutes ago, Wandalf the Gizzard said:\n> \n> Most of my losses come from early game bad luck. Surge chains, unexpected undefended attacks, location lock followed by threat spike, etc.\n\n \n\n \n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263159","commentId":3263159,"userName":"monkeyrama","timestamp":1522159822,"content":"I think being realistic I'm about 33%. I have a similar situation to dalestephenson  in that I tend to play a quest until I beat it and then move on, partly because of limited playing time. And I usually beat quests on or around the 3rd attempt.\n\nI also don't play decks much after I've got them refined, since I want to try out more cards. If I ran my good decks against more scenarios I might have a higher %, but I'm happy at 33%. I've had some pretty memorable losses, but way more boring wins. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] So I'm all for a fun loss over steamrolling quests. \n\nDo we count The Black Gate Opens in these stats, since you can't win...?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263162","commentId":3263162,"userName":"monkeyrama","timestamp":1522159966,"content":"I also tend to play thematic over power decks, and have a fondness for weaker themes (traps, e.g.). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263174","commentId":3263174,"userName":"Ywingscum","timestamp":1522160311,"content":"I'm at about 25% but some days it feels like 10.\n\nI have a number of wins were early mid game I'm convinced I'm going to lose but I push and and pull out a win!  Those are sssoooo satisfying."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263185","commentId":3263185,"userName":"GrandSpleen","timestamp":1522160663,"content":"I keep a spreadsheet and have logged maybe 80% of the games I've ever played.  All of the 2-player games that I've done here at home, but none of the 3- and 4-player games I've done at meetups that I go to.\n\nMy raw win percentage is 282 out of 637 games played, 44.27%  Took a mean hit after the Mountain of Fire box!  For a good long while it hovered around 50%.  \n\nI also get the average win percentage for each individual quest.  Just to see how things are different, my spreadsheet also gets the mean percentage for all of those individual percentages, and it's 55.76%."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263350","commentId":3263350,"userName":"Bullroarer Took","timestamp":1522166818,"content":"I don't have any records, but for the saga expansions my win% is bad.  Well below 50%, and probably below 20%.  But I play the saga expansions very thematically and that makes it extra hard.  I've never beaten Pelennor with my self imposed rules for example.\n\nFor the normal cycle quests I play the power decks and my win% is probably over 80%.\n\nI have all of the Nightmares, but usually don't break them out.  (I play paper almost exclusively.)  I've played Belegost over 20 times but have no wins to show for it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263526","commentId":3263526,"userName":"PocketWraith","timestamp":1522173890,"content":"I have no records, but my estimate would be somewhere around 80%, even including deck testing, weird jank, and Nightmare quests.\n\nOf course, it's possible my estimate is wrong because when I lose quickly it tends not to stick in my mind too much, but that's what I think anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263731","commentId":3263731,"userName":"Seastan","timestamp":1522182130,"content":"I don't keep super detailed records, but I know I'm somewhere around 90% regular, 75% nightmare (+/- 5%). Thats if I take the average win rate for each quest then get the average of those numbers. I think this is a fair way to do it, otherwise my win rate would be like 1% because of the 50,000 times I scooped against NM Attack on Dol Guldur.\n\nEdit: Escape, not Attack\n\nEdited March 28, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263776","commentId":3263776,"userName":"GrandSpleen","timestamp":1522183513,"content":"> 28 minutes ago, Seastan said:\n> \n> I don't keep super detailed records, but I know I'm somewhere around 90% regular, 75% nightmare (+/- 5%). Thats if I take the average win rate for each quest then get the average of those numbers. I think this is a fair way to do it, otherwise my win rate would be like 1% because of the 50,000 times I scooped against NM Attack on Dol Guldur.\n\nYep.  That's why peoples' numbers vary so much I think.  My own numbers include all scoops.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263844","commentId":3263844,"userName":"Ywingscum","timestamp":1522185718,"content":"I'm not counting scoops in my 25% win rate  haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3263955","commentId":3263955,"userName":"TXCanuck","timestamp":1522190050,"content":"Excluding Carn Dum - I’d guess between 40-50% win rate\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272310-win/?do=findComment&comment=3264269","commentId":3264269,"userName":"Rouxxor","timestamp":1522213919,"content":"> 8 hours ago, GrandSpleen said:\n> \n> Yep.  That's why peoples' numbers vary so much I think.  My own numbers include all scoops.  \n\nIt is not about counting scoops. It is about playing 20% of our game on a scenario where no one is able to win more than 10% (if you were speaking about NM escape from dol guldur and not attack like I suppose). For example recently I was doing:\n\n26 win over 30 games with my vilya in saga (loose only against the two last);\n\n9 wins over 12 games against crossing of poros\n\n4 wins overs 51 games with vilya on Dol Guldur nightmare\n\n7 wins on 7 games on my test on newest nightmare with several decks\n\nIn total that made 100 games and 46 wins. So 46%. But if we look for how many % I made for each adventure and then average it will be 25 times 100%, two times 50%, 75%, 8% and six times 100% again so 93,8% of win in average. Pretty different isn't it?\n\nOf course there is not any good way to count. It is just not meaning the same things ^^.\n\nEdited March 28, 2018 by Rouxxor"}]}