{"url":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/","title":"Cards being revealed and the &quot;in play&quot; state","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3266990","commentId":3266990,"userName":"sappidus","timestamp":1522379797,"content":"So with the new Rules Reference, I went straight to the entries that have to do with the fraught topic of revealing cards. An excerpt from the entry for Staging:\n\n> Quote\n> \n> The staging of each encounter card follows these steps:\n> \n>  1. Reveal the encounter card by turning it faceup so that its game text is visible.\n>  2. Resolve any keywords and/or when revealed effects on the encounter card.\n>  3. Place the encounter card in the appropriate game area. If the revealed encounter card is an enemy, location, or objective it is placed in the staging area. If the revealed encounter card is a treachery card, it is placed in the encounter discard pile.\n\nSo, a non-treachery is not placed into the staging area until Staging step #3: okay.\n\nNow, let's look at In Play and Out of Play:\n\n> Quote\n> \n> Faceup cards in the staging area or a player’s play area are considered “in play.” Additionally, the top card of the quest deck and the active location are also in play.\n> \n> “Out of play” refers to the cards in a player’s hand, deck, and discard pile, the encounter deck, encounter discard pile, cards in the victory display, cards set aside, and cards removed from the game.\n> \n>  * Card abilities only interact with, and can only target, cards that are in play, unless the ability text specifically refers to an out-of-play area.\n>  * Card abilities can only be initiated or affect the game from an in-play area unless they specifically refer to being used from an out-of-play area, or require that the card be out of play for the ability to resolve. Play restrictions and permissions are an exception that may affect how a card may or may not be deployed or used.\n>  * A card enters play when it moves from an out-of-play origin to a play area.\n>  * A card leaves play when it moves from a play area to an out-of-play destination.\n\nNow, here's my question: is a card at Staging step #2 in play, out of play, or neither? The state is not specifically listed in the in play definition above, after all.\n\nPossibly it is still out of play because you've turned it faceup [Staging step #1], but it's still considered part of the encounter deck (an out-of-play area)? No, that seems crazy, e.g., many When Revealed effects cause a search and shuffle of the deck, and we are certainly not meant to shuffle the card containing the When Revealed back into the deck.\n\nSo did they forget to list this state in the in play definition? Or, conversely, was it mistakenly left out of the out of play definition?\n\nAlso, does any of this matter? Let's take Thalin as an example: \"While Thalin is committed to a quest, deal 1 damage to each enemy as it is revealed by the encounter deck.\" It was a longstanding ruling in the old FAQ that Thalin destroyed Eastern Crows before they could Surge, which makes it seem like he should resolve after Staging step #1. So doesn't the card being revealed have to be in play to be affected by Thalin's ability?\n\nAh, but a devil's advocate might point to this in the Ability section:\n\n> Quote\n> \n> Card abilities only interact with, and can only target, cards that are in play, unless the ability specifically refers to an out-of-play area OR ELEMENT.\n\n(Emphasis added.) Thalin refers to an \"enemy as it is revealed\", which might be argued to be a specific (if implicit) reference to an out-of-play element… if you believe such cards are out of play in the first place.\n\nI'm thinking myself in circles here. What do you think?\n\nEdited March 30, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3266996","commentId":3266996,"userName":"sappidus","timestamp":1522380174,"content":"I note for the record that we shouldn't be misled too much by the phrase out of play, whose natural English meaning seems to imply it shouldn't be able to affect much. Again from the Ability entry:\n\n> Quote\n> \n> Event cards implicitly interact with the game from an out-of-play area, as established by the rules of the event card type.\n\nSo merely being out of play doesn't mean a card can't have effects. (This is why I've tried to be careful to use a lot of italics, to remind us that these are game terms, not necessarily intuitive English phrases. Another example: When the entry for Staging Area states, \"When an enemy, location, or objective is revealed, it is added to the staging area\", this is natural English, NOT an invocation of the When game term that is separately defined elsewhere in the When entry of Rules Reference.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3267240","commentId":3267240,"userName":"Wandalf the Gizzard","timestamp":1522414092,"content":"I think treacheries being resolved should be considered to be in the same play state as cards in a players hand. Out of play, but able to trigger as actions or responses.\n\n \n\nYou are overthinking things . . . I respect that. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3267380","commentId":3267380,"userName":"sappidus","timestamp":1522420170,"content":"The question is more about enemies/locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3267470","commentId":3267470,"userName":"Wandalf the Gizzard","timestamp":1522424059,"content":"The same thing would happen. Except they'd get added to the staging area instead of being discarded after their \"when revealed\" effects (and surge and doomed) resolved."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3267513","commentId":3267513,"userName":"sappidus","timestamp":1522426298,"content":"> 35 minutes ago, Wandalf the Gizzard said:\n> \n> The same thing would happen. Except they'd get added to the staging area instead of being discarded after their \"when revealed\" effects (and surge and doomed) resolved.\n\nPrepare for a whole can of worms with \"Immune to player card effects\", then. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3267939","commentId":3267939,"userName":"NathanH","timestamp":1522445957,"content":"I think it is neater to consider them In Play immediately.\n\nI also think that there is something a bit dubious about stage 3 of the revelation process quoted above. It seems that this stage should have a \"unless it was placed in another zone already in stage 1 or stage 2\". Otherwise .e.g. cards with When Revealed effects that cause them to immediately engage would go back to the staging area later."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3268195","commentId":3268195,"userName":"Seastan","timestamp":1522468863,"content":"> 6 hours ago, NathanH said:\n> \n> I think it is neater to consider them In Play immediately.\n> \n> I also think that there is something a bit dubious about stage 3 of the revelation process quoted above. It seems that this stage should have a \"unless it was placed in another zone already in stage 1 or stage 2\". Otherwise .e.g. cards with When Revealed effects that cause them to immediately engage would go back to the staging area later.\n\nMight that be covered under \"Instead\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3268408","commentId":3268408,"userName":"Wandalf the Gizzard","timestamp":1522500689,"content":"> 20 hours ago, sappidus said:\n> \n> Prepare for a whole can of worms with \"Immune to player card effects\", then. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nHow so?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3268478","commentId":3268478,"userName":"GrandSpleen","timestamp":1522506710,"content":"If the card is \"out of play\" while being revealed, that means its text is inactive (which is weird since you're actively resolving its 'when revealed' text while you reveal it).  Anyway, that would mean 'immunity' text is not active, so you could use card effects on normally 'immune' cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272543-cards-being-revealed-and-the-in-play-state/?do=findComment&comment=3268843","commentId":3268843,"userName":"Wandalf the Gizzard","timestamp":1522535309,"content":"Ah, I see. Thanks.\n\nEdited March 31, 2018 by Wandalf the Gizzard\n-"}]}