{"url":"https://community.fantasyflightgames.com/topic/272968-new-blog/","title":"New Blog","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3273807","commentId":3273807,"userName":"RedSpiderr","timestamp":1522934092,"content":"Hi guys, I've started a new blog going through a thematic narrative playthrough of the Saga Campaign. Would appreciate any/all feedback.\n\nhttps://theroadlotr.wordpress.com/ [https://theroadlotr.wordpress.com/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3273854","commentId":3273854,"userName":"wolframius","timestamp":1522936287,"content":"Hello!\n\nVery nice blog, but I have an observation: why did you start with a starting hand of 5 cards? It should be 6.\n\nI also encourage you to post the link of the new blog on the Cardboard of the rings discord server."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3273859","commentId":3273859,"userName":"RedSpiderr","timestamp":1522936499,"content":"The Gandalf's Delay burden reduces your starting hand by one.\n\nhttp://hallofbeorn.com/LotR?Query=Gandalf's Delay [http://hallofbeorn.com/LotR?Query=Gandalf%27s%20Delay]\n\nThank you, I will do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3273862","commentId":3273862,"userName":"wolframius","timestamp":1522936572,"content":"> Just now, RedSpiderr said:\n> \n> The Gandalf's Delay burden reduces your starting hand by one.\n> \n> http://hallofbeorn.com/LotR?Query=Gandalf's Delay [http://hallofbeorn.com/LotR?Query=Gandalf%27s%20Delay]\n> \n> Thank you, I will do.\n\nI knew I was missing something! never mind, then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3282671","commentId":3282671,"userName":"RedSpiderr","timestamp":1523549459,"content":"I know its been a while, but I've just finished the narrative write-up of the first scenario, A Shadow of the Past.\n\nLet me know what you guys think? Too long, too short, doesn't follow the cards closely enough, more/ less pictures? \n\nAgain, all feedback is appreciated. Thanks guys!\n\nhttps://theroadlotr.wordpress.com/a-shadow-of-the-past/ [https://theroadlotr.wordpress.com/a-shadow-of-the-past/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3283196","commentId":3283196,"userName":"Wandalf the Gizzard","timestamp":1523580476,"content":"Now that's a proper wall of text! Nice work!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3283431","commentId":3283431,"userName":"Fingolfin Fate","timestamp":1523609297,"content":"Hi, I only had time for a quick read of the play-through (and a bit of the story telling). It looks so nice. Just be careful with some cards. I believe you made a few mistakes. You seemed to apply that the Nazgul Steed is a free card, in a way, but it also has surge, so it's actually quite bad. Also, you cannot play attachments on the Nazgul. I will try and help more when I find time.\n\nAbove all though, it is excellent to see something so passionate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3285413","commentId":3285413,"userName":"Authraw","timestamp":1523743442,"content":"I just finished reading through the whole narrative. I love the concept of taking a playthrough and turning it into a story! Great job coming up with an alternative LotR concept to play through, I'm looking forward to seeing how this version plays out!\n\nThe post itself is a little long; as much as I enjoyed reading it I wasn't able to find the time to get through it in one chunk. I could easily find myself unable to find the time to read the narration at some point--which would be a shame, since that's the best part!\n\nIt might be nice if you broke it up into multiple separate posts, or if you condensed the narrative somehow, perhaps by combining multiple turns together into a single narrative scene, rather than breaking each round up into its own mini-chapter.\n\nKeep it up! I can't wait to see where it goes from here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3285814","commentId":3285814,"userName":"RedSpiderr","timestamp":1523801905,"content":"> On 13/04/2018 at 9:48 AM, Fingolfin Fate said:\n> \n> Hi, I only had time for a quick read of the play-through (and a bit of the story telling). It looks so nice. Just be careful with some cards. I believe you made a few mistakes. You seemed to apply that the Nazgul Steed is a free card, in a way, but it also has surge, so it's actually quite bad. Also, you cannot play attachments on the Nazgul. I will try and help more when I find time.\n> \n> Above all though, it is excellent to see something so passionate.\n\nThank you very much for your feedback, it's great to hear folk actually paid attention to what I wrote as opposed to just dismissing it out of hand!\n\nI fully admit to the Secret Vigil blunder, and addressed that in the article, thank you for keeping me honest. As for the Black Steed, I didn't clarify this enough in the text, but what I meant was that at that point in the game it would be better to see the treachery than later on when I might not be able to survive a lower engagemnt cost Black Rider. But again, thanks so much for the attention to detail you've afforded me, I really do appreciate it! \n\n> 16 hours ago, Authraw said:\n> \n> I just finished reading through the whole narrative. I love the concept of taking a playthrough and turning it into a story! Great job coming up with an alternative LotR concept to play through, I'm looking forward to seeing how this version plays out!\n> \n> The post itself is a little long; as much as I enjoyed reading it I wasn't able to find the time to get through it in one chunk. I could easily find myself unable to find the time to read the narration at some point--which would be a shame, since that's the best part!\n> \n> It might be nice if you broke it up into multiple separate posts, or if you condensed the narrative somehow, perhaps by combining multiple turns together into a single narrative scene, rather than breaking each round up into its own mini-chapter.\n> \n> Keep it up! I can't wait to see where it goes from here.\n\nI'm glad you enjoyed reading the narrative. Sorry its a wee bit long, there was three chapters of Fellowship to cover, condense and adapt and there were so many beats to the game I wanted to cover. \n\nI'll try and make the next one, The Old Forest, a more managable length. Hopefully with the company all together instead of strung out over the Shire this should be a lot easier! Thank you again for taking the time to read this, it means a lot to me that other folk seem to be enjoying it as I am. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3285920","commentId":3285920,"userName":"Fingolfin Fate","timestamp":1523812497,"content":"You are welcome. And really I cannot stress enough how nice it is to see something so passionate.\n\nOne suggestion, though I would not be sure about it myself. It is really just a thought, and feel free to ignore it. I was thinking you could show the round how it happened exactly (as you do in the play-through) with all the detail what you drew and played. And then below it have a paragraph of the story (based on the play-through).\n\nOn a different note, if you ever feel like discussing the deck-building for saga, just pm me. I have played the saga quests a hundred times each maybe (up to the last box)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286096","commentId":3286096,"userName":"RedSpiderr","timestamp":1523823553,"content":"I do like the idea, but I think that's the format that Tales From The Cards took with their own saga playthrough and I wanted to do something a bit different for the community. \n\nAs for deckbuilding, I will probably take you up on your offer later on in the campaign. This is my first saga  playthrough, I'm playing each scenario myself for the first time and I'm expecting getting my teeth kicked in by some of the later scenarios!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286138","commentId":3286138,"userName":"Fingolfin Fate","timestamp":1523825761,"content":"I see. Makes sense.\n\nAs for now, why not Raise the Shire? It seems a perfect combo for Farmer Maggot... I know you said you do not have all the cards yet, but this one is in the same set as Tom Cotton."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286481","commentId":3286481,"userName":"RedSpiderr","timestamp":1523866864,"content":"I felt I didn't have enough hobbit allies in my deck to pull this off consistently, I've only got Farmer Maggot (x2) and Curious Brandybuck (x2) in my tactics deck with very few enemies to be engaged with. Of course all the enemies bar two would have had a higher engagement cost than my threat, and I'd forgotten about the bonus hobbits get for that, so I suppose I should have stuck it in there. I didn't put it into my decks for The Old FOrest (playthrough report coming soon), but for a quest like Fog On The Barrowdowns, where there are more enemies to be engaged with, this event will definitely be in there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286496","commentId":3286496,"userName":"Fingolfin Fate","timestamp":1523868244,"content":"Yes. With a low threat, you only need one ally in the deck: Farmer Maggot. You will find him, deal 2 damage and he attacks for 4. The problem then, of course, is to draw all the copies of the Farmer before. I would suggest having 3 copies of him.\n\nCan you tell me what cards you have, I can make a suggestion for a few tweaks, keeping it as thematic as possible, of course.\n\nPS. You are using 3 copies of Captains of the West, but you have no Noble heroes in your line-up.\n\nEdited April 16, 2018 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286540","commentId":3286540,"userName":"Rouxxor","timestamp":1523874048,"content":"I suggest no to play 3 farmer maggot. I'm a HUGE fan of Tom Cotton and raise the shire and I don't even play farmer maggot at each time in them! There is many hobbit who goes well with raise the shire and, since you can already attack with the hobbit who arrive, the effect of Farmer Maggot is not always that smooth. Since you can choose among the whole deck the best is to have different allies for different cases.\n\nThe best ally to pair with raise the shire is, to me, Bilbo baggins, who look for hobbit pipe, another excellent cards, go back in hand and next turn bring another pipe. But you play it as an hero in the other deck. Rosie Cotton and Halfast Gamgee are also good choices if you play leadership, and you can play them with Tom Cotton ability (in case you can't beat the enemy).\n\nMy advice will to be play 1 famer and 1 Rosie and 1 wandering took.\n\nRingsdb experience some trouble with flame of the west cards numbers. If I remember right all the \"friends of friends\" became captain of the west in my decklist too. So it is probably captain of the west."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3286620","commentId":3286620,"userName":"Fingolfin Fate","timestamp":1523882326,"content":"There are many options. But Bilbo is not among, as he is the hero. Also, the card pool..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3288024","commentId":3288024,"userName":"Rouxxor","timestamp":1523972130,"content":"I spoke first about general consideration and then advice for what he could play in his decklist. Wandering took is in the core set and rosie is in the same set that raise the shire. I don't see how card pool could be a problem here..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3288476","commentId":3288476,"userName":"Fingolfin Fate","timestamp":1523992965,"content":"It is hard to understand what you are saying sometimes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3288902","commentId":3288902,"userName":"Fingolfin Fate","timestamp":1524035466,"content":"... Halfast is in neither, the core or Mountain of Fire, that was the card-pool reference. Wandering Took makes little sense to me, the stats are not bad but not as good as Farmer's, and the ability a lot weaker, especially when you Raise the Shire because you engage here and thus you probably do not need him with the other player. Rosie is just a great card to have in play from the start, thus three copies are almost essential, and then she is a very bad target for the event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3289230","commentId":3289230,"userName":"sappidus","timestamp":1524063921,"content":"> 7 hours ago, Fingolfin Fate said:\n> \n> Wandering Took makes little sense to me, the stats are not bad but not as good as Farmer's, and the ability a lot weaker, especially when you Raise the Shire because you engage here and thus you probably do not need him with the other player.\n\nWandering Took's ability is good for activating Tom Cotton's for a little longer, as well as keeping Raise the Shire powered up. (If he's Raised into play, you can trigger him sometime between his attack contribution and the end of the round.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3289486","commentId":3289486,"userName":"Fingolfin Fate","timestamp":1524076129,"content":"I do not see it. Please explain. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3290125","commentId":3290125,"userName":"GrandSpleen","timestamp":1524113144,"content":"He means you need low threat for Raise the Shire and Tom Cotton to work well.  Wandering Took can lower your own threat.  As long as the other player doesn't mind taking it.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3290196","commentId":3290196,"userName":"Fingolfin Fate","timestamp":1524121572,"content":"Ok. Thanks. Of course that. I almost thought I was really missing something. Still seems not very strong, especially in this case, compared to 2 damage and one extra point of attack. The thing is, normally, I would like to engage more with Sam and Pippin, but then it would need a whole re-build. If you do not got for secrecy with them, using Folco, then Tom could be the third hero there, trying to pull all the enemies to them, having two potential defenders. Then of course, Merry would be missing his blows, but the deck could perhaps create enough hitting power with the allies and Tom's attacking bonus (and Sam can hit whenever he does not need to defend)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3291414","commentId":3291414,"userName":"Rouxxor","timestamp":1524200402,"content":"I do my best to be clear but my English is sometime too poor.\n\nI first say what is best with raise the shire. It is not specifically intended to Redspiderr. And the best target is Bilbo baggins. Then farmer maggot is a decent choice but close to halfast, rosie or took.\n\nSince raise the shire allow you to look in your entire deck it is very useful to have different targets. It allow you more choice. If you want a to attack at your partner took can attack at 3, if you don't need as much damage than Tom allow but to ensure to block safely with Tom Rosie can be good. And for big enemies There is Tom of course. And sometime you will just be concerned by the sphere of the resource staying on your heroes for playing it the next round.\n\nBut even if you want to look for farmet maggot 9 times on 10 (what was absolutely not my case) what the point to have 3? You will make a raise the shire on the start of the game on a farmer maggot, and you will play it fast after that. What are you doing with the others raise the shire and farmer maggot? You need to have different hobbits for avoiding that.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3291477","commentId":3291477,"userName":"Fingolfin Fate","timestamp":1524208143,"content":"I understand this. When I build a deck with Raise the Shire, I like to have many options too. And of course, there will be situations when Halfast is a better get than Farmer, or Bilbo.\n\nHowever, it is also good to look how these are generally playable without Raising the Shire. Bilbo, for instance, is a very good early card, 2 willpower for 2 resources is still a great deal (given the ability, even better). In comparison, Maggot is not so good to play from hand. Usually very pricy. But for a single resource, it seems much, much better.\n\nAnd in my experience, Rosie is vital to get Hobbits going, both for extra defense and even more for attack. So I would always like to have her out early, and thus no longer applicable for Raising. With Bilbo it makes more sense to chump, if you have more copies, yes.\n\nAnd yes, Wandering Took is nicely flexible with a potential sentinel/ranged built in his ability.\n\nAs for having multiple Maggots in a deck. I am not saying I would want him 9 out of 10, but I think I want him more than others, surely. Then, one copy seems bad if you draw it early. Three copies, I am not so sure, but I would not go below two, certainly. \n\nEdited April 20, 2018 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3291994","commentId":3291994,"userName":"Rouxxor","timestamp":1524245307,"content":"At some point I'm not talking theoretically. I have playing Tom with raise the shire in 4 different decks with something like 10 games each. That how I see that, no matter how farmer maggot is theoretically stronger (I was initially thinking he was as strong as Bilbo before seeing him as a second-range target), we often prefer smaller allies, because farmer is overkill on the turn so we prefer enjoy some effects, and be able to play the hobbit the next turn.\n\nYou absolutely must play distinct hobbit allies. If you want to also play multiple farmer maggot (I think 3 is nonsense since you will almost never get 2 in hand/discard pile when you want the third) it have to be in addition. I understand this, I often play 2 Bilbo for the same reason.\n\nHere is some decklist illustrating how I build those hobbit deck:\nhttp://ringsdb.com/fellowship/view/4494 [http://ringsdb.com/fellowship/view/4494]\nhttp://ringsdb.com/fellowship/view/4495 [http://ringsdb.com/fellowship/view/4495]\nhttp://ringsdb.com/fellowship/view/4500 [http://ringsdb.com/fellowship/view/4500]\nhttp://ringsdb.com/fellowship/view/4501 [http://ringsdb.com/fellowship/view/4501]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/272968-new-blog/?do=findComment&comment=3292790","commentId":3292790,"userName":"Ywingscum","timestamp":1524320565,"content":"That's one tough farmer.  Stay out of his crops!"}]}