{"url":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/","title":"Thinking about  playing this","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3277934","commentId":3277934,"userName":"Bradders77","timestamp":1523223817,"content":"Hi everyone. I’ve been playing SW destiny and netrunner, but I can more often than my gaming buddy so was thinking of getting the lord of the rings card game. Is it any good for single player and is it a really hard game to play?\n\nCheers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3277960","commentId":3277960,"userName":"BigKahuna","timestamp":1523226341,"content":"Welcome.  Lord of the Rings is very different from Destiny and Netrunner, being a cooperative game your always facing a sort of AI built into the encounter deck that makes up each unique quest in the game (of which there are a metric ton at this point).  I think opinions vary but most people will call it anything ranging from \"crazy hard\" to \"impossible\".  If your looking for a card building challenge, Lord of the Rings is as tough as they come.\n\nIts a very good solo game, I personally play 95% of the time solo and prefer it that way.  Strictly speaking when I have a partner we tend to want to play games vs. each other.  There are two official ways to do it.. some just do it straight solo, which is brutally hard and some do double fisted (aka playing solo but with two hands simulating a 2 player game).  Both work and are fun, there are also several single player variants .. essentially rulesets designed to make the game a bit easier.  Unless you get hard into the game and get really good you will find that you will lose 90% of your games.  For some that is a bit too much so unofficial variants to simplify the game have been created.  There is also an official easy mode that makes it a bit easier as well.. but generally you will find that 90% of the quests have a pretty high level of difficulty.  In fact of the 3 quests in the core set you will probably spend months trying to be 2 out of 3 of them, on the first is reasonably easy, the other two are tough, one of them is arguably one of the toughest quests in the game.\n\nIn any case in terms of solo games there aren't that many good collectible card games.  From FFG you have this one and Arkham Horror, both are very good, Arkham Horror is considerably easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3278491","commentId":3278491,"userName":"Wandalf the Gizzard","timestamp":1523277977,"content":"Yes, this game is quite hard. You will either have to not mind losing or get really good. There are the odd comments around the forum saying the game is \"too easy,\" and while that is ridiculous, I personally don't think it's as hard as most make it out to be.\n\nIf you do jump in, I highly recommend checking out Beorn's Path on Hall of Beorn Blog to help you get started. That blog also has a community page with a list of extremely helpful online resources and blogs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3278524","commentId":3278524,"userName":"Ywingscum","timestamp":1523280448,"content":"It's great solo.  I mostly play two hand solo, sometimes true solo.  The encounter decks are difficult but I like the challenge.  There's plenty of expansions to get so you'll never get bored.  There is also lots of online resources to help with the particularly challenging quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3278567","commentId":3278567,"userName":"monkeyrama","timestamp":1523282150,"content":"> 1 hour ago, Wandalf the Gizzard said:\n> \n> Yes, this game is quite hard. You will either have to not mind losing or get really good. There are the odd comments around the forum saying the game is \"too easy,\" and while that is ridiculous, I personally don't think it's as hard as most make it out to be.\n\nIt's a funny game, because if you play with certain decks that use a lot of doomed cards then it is really close to 'too easy', but if you play thematic decks, or decks that don't use the most powerful versions of every card type, the game has a nice level of challenge. The 'too easy' comments do stem from the intent to build decks that crush (Seastan's ability to break the game is really quite amazing), but most decks can't hit that level.\n\nIt is hella hard when you first start. The advantage, to my mind, is that this gives you something to work towards. I am by no means a great player, but I've managed to get to the point where I feel confident I can at least challenge even very hard quests with a bit of thinking.\n\n@Bradders77 [https://community.fantasyflightgames.com/profile/314633-bradders77/], one thing to know is that the early quests in the game tend to front-load the difficulty. This means that once you clear the opening stages not that many quests can really push you. The designers have got much better in recent cycles at keeping quests consistently challenging, and challenging at the level the designers intended, so very hard quests start and finish hard, and easier quests are similarly well-designed. One challenge of getting into the game is that the early quests are not as good as the recent ones in terms of design, but some key player cards are in the early boxes and expansions. Following guides (like Beorn's or any good buying guide) can allow you to strategically purchase the packs that give the best/most useful player cards and also the better quests. I love this game, and have played since it was first released, but some quests are just bad, especially early on. I am *very* impressed by recent cycles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3279304","commentId":3279304,"userName":"Rouxxor","timestamp":1523310623,"content":"In solo it is a hard game at the start (as usual for such a complex game, but you can't even start slowly by challenging with another beginner since you play against environment ^^). After some time there is plenty of choices, both from deck that you can build and quest that you face. So you can do as you please.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3279846","commentId":3279846,"userName":"BigKahuna","timestamp":1523360127,"content":"I think there is something to be said about your card pool as well.  Many people buy 2 or even 3 core sets for example to get 2-3 copies of some of those core power cards found in that set.  Then there are certain packs that offer some key cards that can make a big difference in terms of options for deck building.\n\nGenerally though the word \"hard\" is probably the most common adjective used to describe the game.  I agree with Wandalf the Gizzard here when it comes to the \"easy\" comments, seems more like boasting than something you can hang your hat on.  Certainly skill level will play a part in how you describe it, but easy is not a word I would ever associate with Lord of the Rings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3279863","commentId":3279863,"userName":"Wandalf the Gizzard","timestamp":1523362138,"content":"Easy to be master, perhaps, but that still doesn't make it easy to win. That's how I would put it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3280645","commentId":3280645,"userName":"Rouxxor","timestamp":1523395443,"content":"For players who play also in tournament of versus card game, who agree to use any exploit available (including allowing them any number of cards needed, so 12 of the same if needed in 4 decks) to win the game like I did the game is a little bit too easy after some times. Even in nightmare. It is a lot about how you like to play with card games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273199-thinking-about-playing-this/?do=findComment&comment=3280695","commentId":3280695,"userName":"Bradders77","timestamp":1523397563,"content":"Thank you everyone for the comments. I like the sound of it so will pick up a core. Also liking the sound of Arkham horror for solo play."}]}