{"url":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/","title":"New to game, 3 hero mandatory?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3282463","commentId":3282463,"userName":"profparm","timestamp":1523539948,"content":"I've been looking at this game a lot in the last week and my core arrives in the mail today.  I will mostly be playing solo, might play with the gf a little.\n\n \n\nI noticed that the rules say each deck can have 1-3 heroes, but ive never seen a deck with less than 3 heroes.  Do these exist?  (Maybe some sort of tricksy low-threat turbo quest deck?). I can see why the lower resources would be limiting, plus the 3 roles to cover, but I wasn't sure if there was some alternative.  I mostly didn't want to waste time experimenting with less than 3 heroes if it will never work.\n\n \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3282487","commentId":3282487,"userName":"Rouxxor","timestamp":1523541216,"content":"Playing less than 3 hero is something pretty unusual. But we can sometime see it. Here is some example:\n- The card Stridder give a lot of bonuses if we play less than 3 heroes;\n\n- Some decks who want to play big heroes AND have access to secrecy mechanic and/or enjoy a better LoAragorn effect\n\nAmong the deck with 3 heroes some will in fact play with only 2 because they will sacrificed in early game one to enjoy their abilities (Caldara and Folco)\n\nI personally have only 3 heroes deck except one One hero deck (http://ringsdb.com/deck/view/60874) build only for the challenge, and who is not that bad ^^. [http://ringsdb.com/deck/view/60874]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3282519","commentId":3282519,"userName":"DurinVoronwe","timestamp":1523542424,"content":"Two hero decks work sometimes, but you will need a much bigger card pool. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3282526","commentId":3282526,"userName":"profparm","timestamp":1523542782,"content":"That Sam deck looks interesting.\n\n \n\nI am building my card pool up some, with karad dun and Hobbit over and under Hill to have a good dwarf base.  If I like the game, I'll likely pick up every deluxe expansion I can get my hands on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3282599","commentId":3282599,"userName":"Bullroarer Took","timestamp":1523546162,"content":"My answer is a somewhat cryptic \"It is now, but it wasn't then.\"  What I mean is that many more people tried making home rules that allowed 4 heroes than just trying 2 in the early days of the game when just the core was available.  During the Dwarrowdelf cycle \"Secrecy\" cards were introduced and they have continued to drip out since then.  With the introduction of the \"Strider\" card 2 hero really went from fringe to playable and I have an Arwen/Core Aragorn deck that's pretty good now.  But I could never have made it without a lot of cards that aren't in the core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3283194","commentId":3283194,"userName":"Wandalf the Gizzard","timestamp":1523580313,"content":"With a modern card pool, two hero decks can be quite powerful, and there are even playable decks with only one hero. These are only truly viable, however, once you start collecting the second cycle of packs. For now, I don't recommend it. Have fun with the game however you play, though!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3284922","commentId":3284922,"userName":"Rajam","timestamp":1523707375,"content":"With the inclusion of Folco I don't see the point in making decks with less than 3 heroes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273462-new-to-game-3-hero-mandatory/?do=findComment&comment=3285082","commentId":3285082,"userName":"Rouxxor","timestamp":1523719895,"content":"For the challenge, that is the whole point of my one hero deck for example. Could also be against some specific quest (Folco ability is not useful in black gate opens/mount doom)."}]}