{"url":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/","title":"Exciting Times in a Difficult Era","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3283413","commentId":3283413,"userName":"Fingolfin Fate","timestamp":1523607238,"content":"The title is not as much a paraphrase to the current world situation, and although it would describe my personal situation perfectly, it rather refers to the state of the LotR lcg.\n\nIt is difficult to get so little preview, in such a low frequency, but at the same time the contents (to me, of course) seem very exciting. I am so looking forward to see more Beornings and Bardings.\n\nThe one card alone previewed in the Withered Heath article, Beorn's Rage, makes all decks with the Beorn hero better, I feel. I mostly play 2-player coop, and Beorn is a great hero to help all the power decks (Noldor, Galadhrim) in the early stages.\n\nGrimbeorn will be another great defender: 3 defense, 5 hit points, sentinel, is just very special to start with. It is second only to Beregond (and only by a whisker), I feel, but the retaliation capacity makes it even more amazing.\n\nFinally, for now, I have already tried some of the new Dale cards, and I have a feeling, this will soon rival the strongest decks. The new Brand's ability, combining card draw and extra willpower seems super strong. And all the cheap attachments just got so much better.\n\nWell, how do the rest feel? Let us create some community excitement before we see more products coming toward our doorsteps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3283454","commentId":3283454,"userName":"Rouxxor","timestamp":1523613485,"content":"I already post a Grimbeorn and a Dale deck because I'm already playtesting this card. Is it enough demonstration of excitement? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3283514","commentId":3283514,"userName":"Wandalf the Gizzard","timestamp":1523620371,"content":"I'm really excited, especially about the art, it continues to amaze me. On of the locations spoiled even looks like a book illustration! And yes, Dale decks and Grimbeorn are top-tier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3284325","commentId":3284325,"userName":"Bullroarer Took","timestamp":1523650321,"content":"While I think the spoiled cards are good, I believe some of our emotion is basically caused by starvation.  It's like Wile E. Coyote looking at the Road Runner and seeing a complete turkey dinner.  We've been starved for so long that anything looks great.  (I mean... have you ever seen a real road runner?)\n\nFrom there my feelings get even more complex, but the short version is that I believe the loyalty of LOTR fans is essentially being taken advantage of with this new foray into digital.  And I'm not happy about it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3284411","commentId":3284411,"userName":"Wandalf the Gizzard","timestamp":1523654361,"content":"Yeah, the digital game is falling flat for me too. I’ll probably still try it out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3284836","commentId":3284836,"userName":"Fingolfin Fate","timestamp":1523691680,"content":"I totally see the point. I used to come here in 2011, though I signed up later. Up to maybe 2013 it was a really cheerful place. In 2012 we were getting a preview every Monday, more or less. Me and my friend even used to call it PreviewMonday. It was great.\n\nI really am a Tolkien addict of sorts, I love to play card/board games, but I do not have that much time to invest in more than those Tolkien-flavoured. I have almost the entire card pool, so I believe I will play the game for years to come, and then maybe with my son when he grows up.\n\nThat said, it is really a pity to get so little from the ffg. Even if they only release one cycle per year now, we could get four to five articles before the deluxe, and then two or three before each adventure pack. And preferably early enough before someone lays his hands on the actual cards. Plus maybe a strategy article every season? It would not be so much. Many years ago I even offered ffg that I would write such preview articles, given a spoiled card or two, for free of course. They were not interested.\n\nOf course, it probably is not so important any more, because the number of people coming here is pitiful. But there used to be a time with maybe a hundred frequent visitors.\n\nPS The digital game means very little to me. I do not really see the point when it is so close to the original, just less sophisticated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3285384","commentId":3285384,"userName":"Authraw","timestamp":1523741287,"content":"> 13 hours ago, Fingolfin Fate said:\n> \n> Of course, it probably is not so important any more, because the number of people coming here is pitiful. But there used to be a time with maybe a hundred frequent visitors.\n\nFor what it's worth, I think we still have a pretty large and vibrant community--it's just not all in one place. These forums used to be the de-facto place to go to socialize about this game, but even though they've been flagging a bit more lately, there are still a bunch of great conversations happening daily over on the Cardboard of the Rings Discord channel. And I've noticed a bit of an uptick of activity over on the lotrlcg reddit lately too. There are pretty active discussions going on at the Facebook group and over on Boardgamegeek as well.\n\nI usually try to keep up to date with all of the discussions I can find about this game, but lately I haven't been able to stay on top of them all! Some of that may be due to how busy my life is right now, but I think it also speaks to just how active this community continues to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3285731","commentId":3285731,"userName":"sappidus","timestamp":1523790735,"content":"> 13 hours ago, Authraw said:\n> \n> For what it's worth, I think we still have a pretty large and vibrant community--it's just not all in one place. These forums used to be the de-facto place to go to socialize about this game, but even though they've been flagging a bit more lately, there are still a bunch of great conversations happening daily over on the Cardboard of the Rings Discord channel. And I've noticed a bit of an uptick of activity over on the lotrlcg reddit lately too. There are pretty active discussions going on at the Facebook group and over on Boardgamegeek as well.\n\nAgree with all of this. I'm a pretty active Discorder myself; it's great.\n\nAt the same time, I do appreciate that chat programs like Discord and Slack, due to the impermanence of the discussion, tend to accent feelings of community disengagement if you are not checking them often. I'm going to try to post more regularly here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3286226","commentId":3286226,"userName":"Gizlivadi","timestamp":1523832802,"content":"Honestly to me it's not a matter of whether the community cares about the game or not, and where and when they talk about it. It's more about the fact that FFG doesn't care about the game. The community itself has been great and extremely loyal to the game, to the point that I think FFG is clearly taking way too much advantage of that. The problem is not us (we talk and contribute to the community ALL the time), the problem is FFG's obvious neglect for the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3286480","commentId":3286480,"userName":"Fingolfin Fate","timestamp":1523866812,"content":"Yes, I feel the same. It is a bad customer service in a way. I do not want to sound ungrateful, the game has been too great for that. But they could keep giving us a little more to go with the product. And really, for me a cycle per year is enough of the main course, I would just like to have more appetizer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3286553","commentId":3286553,"userName":"Jekzer","timestamp":1523875574,"content":"I feel the same too.\n\nYes, the game has its age but right now, more than ever, should be a good moment to promote external articles from well-known (or not so well-known) blogs by FFG. Even better, give some bloggers the opportunity to write original material (maybe with some spoilers) for FFG news.\n\nSure there are other places that actively promote the game, but for people that is less soaked in those blogs and just use the main page from the company that created the game, this could be a win-win condition: more news for us, good image for FFG with this part of the community."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273507-exciting-times-in-a-difficult-era/?do=findComment&comment=3286626","commentId":3286626,"userName":"Wandalf the Gizzard","timestamp":1523882888,"content":"Guys, we just got a bunch of playmats and a spoiler for the next adventure pack. Try not to be so huffy.\n\nYes, FFG could learn a lot about PR, but let's be positive.\n\nAfter all, they're the only company that makes the LotR LCG! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nTheir lack of enthusiasm probably has to do with the fact that the game is not competitive or \"new and shiny.\" They feel that most of this playerbase found its way to AH LCG"}]}