{"url":"https://community.fantasyflightgames.com/topic/273713-the-next-one/","title":"The Next One","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287191","commentId":3287191,"userName":"Wandalf the Gizzard","timestamp":1523904639,"content":"https://www.cnet.com/news/j-r-r-tolkien-book-fall-of-gondolin-will-be-published-in-august/ [https://www.cnet.com/news/j-r-r-tolkien-book-fall-of-gondolin-will-be-published-in-august/]\n\nYYYYYYEEEEAAAAAAAAAAAAAAAAAAAAHHH!\n\nI know what I'm getting for my birthday. I just hope this has nothing to do with the new TV show."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287198","commentId":3287198,"userName":"Wandalf the Gizzard","timestamp":1523904925,"content":"Oh, by the way:\n\nhttps://www.cnet.com/news/70-year-old-tolkien-poem-reveals-early-lord-of-the-rings-character/ [https://www.cnet.com/news/70-year-old-tolkien-poem-reveals-early-lord-of-the-rings-character/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287207","commentId":3287207,"userName":"Fingolfin Fate","timestamp":1523905158,"content":"Yes, such a surprising and good news."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287238","commentId":3287238,"userName":"Network57","timestamp":1523906690,"content":"Am I the only one who hopes it's not like the Beren and Luthien book that came out recently? In that it was a series of drafts in chronological order intersparsed with notes from Christopher about the typographical and dramatic development and changes. I kind of just want a story. Reading a story about the story just loses all magic for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287444","commentId":3287444,"userName":"Wandalf the Gizzard","timestamp":1523913842,"content":"I actually liked the compilation style in Beren and Luthien. We had the full story in the Silmarillion, so it would have been odd otherwise; unless they did what they did for I-narn-i-chin Hurin; which was just a longer version. But yeah, in this case, I hope this is a full story, given that we've never seen it before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287868","commentId":3287868,"userName":"Fingolfin Fate","timestamp":1523951558,"content":"I too would prefer the style of Children of Hurin, but I read it will be just like Beren and Luthien. It is a harder read, but exciting nonetheless. I guess the latter two would not be much different than their short versions in the Silmarillion if done like the Children."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3287989","commentId":3287989,"userName":"Wandalf the Gizzard","timestamp":1523969467,"content":"I don't care what it is! It's more pure, non-awful-movie Tolkien!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3288475","commentId":3288475,"userName":"Fingolfin Fate","timestamp":1523992812,"content":"Funny, I have heard a few times from people around that movies based on Tolkien's writing are the only adaptations better than the books. I feel almost the opposite, I usually like movie adaptations better than the books, but not for Tolkien. That said, I think they are amazing adaptations nonetheless. Yes, there are things I would like to see different, especially with the Return of the King (Denethor, Army of the Dead) and even the Fellowship (which I find the best of the movies but still is missing my favourite parts of all the books: much of Book I), but my anticipation could not have been much greater when they were coming out, and I was never disappointed. So I am already looking forward to the TV show even more than to the new publication.\n\nEdited April 17, 2018 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3289064","commentId":3289064,"userName":"Wandalf the Gizzard","timestamp":1524054443,"content":"The LotR movies were very good, it’s the Hobbit “trilogy” that I can’t stand. If you enjoy the films more or think they are better adaptations than the books themselves is two different stories all together. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3289086","commentId":3289086,"userName":"Fingolfin Fate","timestamp":1524055955,"content":"As I said, I think they are very good adaptations, but for the most part, I prefer the books with Tolkien -- unlike with other authors.\n\nI know the reaction to the Hobbit movies was torn. I think it has a lot to do with the timing. I believe if they came first -- though they obviously would have been different -- it would be a different story. But that is all hypothetical. I really enjoyed many aspects of those adaptations as well, the casting especially (which I found at least as good as LotR), as I cannot imagine a better Bilbo or Smaug, and perhaps Bard and Thranduil, not to mention Thorin. And for example the way they differentiated the Dwarves from one another was just amazing (especially compared to the original text in which many of the 13 get very little to do or become). I would like to see a little less Legolas and more Beorn (though the former certainly had his place there and the latter actually gets a similar role in the books, especially if you count the extended version of the Desolation). But this is all very subjective and probably for a different forum.\n\nEdited April 18, 2018 by Fingolfin Fate"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273713-the-next-one/?do=findComment&comment=3290384","commentId":3290384,"userName":"Wandalf the Gizzard","timestamp":1524141949,"content":"> 23 hours ago, Fingolfin Fate said:\n> \n> I prefer the books with Tolkien\n\nWe agree."}]}