{"url":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/","title":"Which recent full set to get?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/?do=findComment&comment=3287209","commentId":3287209,"userName":"profparm","timestamp":1523905251,"content":"I got the game on Friday (core box, kazad dun, over and under Hill).  I love the game already, but I really want more cards for deckbuilding, so I plan to pick up as many deluxe editions as I can find in stock this paycheck.  So far, I feel I can make some decisions, but I basically put in every somewhat viable card and then have maybe 4-5 cards to cut.\n\n \n\nHowever, I was also thinking of picking up all the adventure packs for one cycle, assuming the connected quests would tell a story.  My options are harad or dream chaser, as everything else is out of print.  Any thoughts on which of these cycles is funner for quests?\n\n \n\nFor the record, I plan to get Black Riders, Lost Realm, Voice of Isengard, Sands of Harad, and Grey Havens for deckbuilding purposes.  I'd go to the new players guide for this, but it stops just after Sands of Harad, before the rest of that cycle.\n\n \n\nThanks!\n\nEdited April 16, 2018 by profparm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/?do=findComment&comment=3287882","commentId":3287882,"userName":"PigsAreOurEquals","timestamp":1523953798,"content":"Welcome, maybe you found this one already but it should be mentioned in thread like this:\nhttps://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/?do=findComment&comment=3287965","commentId":3287965,"userName":"profparm","timestamp":1523966478,"content":"That is very helpful, thanks!  I was just going off of https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/ [https://talesfromthecards.wordpress.com/2013/09/13/new-player-buying-guide/] but as I said it stops at the sands deluxe.  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/?do=findComment&comment=3288425","commentId":3288425,"userName":"CaffeineAddict","timestamp":1523989721,"content":"If your choosing between harad and dreamchaser , I'd definitely recommend dream chaser, as the quests themselves are so much fun. You'd need The Grey Havens, though, as that contains cards needed for the whole cycle (similarly Sands of Harad for the head cycle)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/273715-which-recent-full-set-to-get/?do=findComment&comment=3291438","commentId":3291438,"userName":"Rouxxor","timestamp":1524202628,"content":"As he said he will buy Sand of Harad and Grey havens anyway so he can choose between the two cycles. Both are great to play, they have a connected stories and, at the opposite of the core set and the first two cycles, a lot of texts explaining what happens to the company.\n\nI will personally prefer the Harad cycle, especially for a new players because there is a wider range of quest: one threat centered, one about exploration, two about running away, one where you regain your heroes step by step (and no as violent as Dol Guldur), one about fight, two hard to describe with so little words. It give you a full vision of what the game propose, including quest already done before (what you don't care but was not welcome by experienced players).\n\nIn dreamchaser cycle you have basically two kind of quest: the one in a boat (5x) and the one in a mysterious island (3x). It explore different way to do that, it do it well but you will get bad deckbuilding habits since you will face the same kind of problematic.\n\nThe developers now know well what to do with their game so the major part of the recent quest have a lot of smart design choice I found. So again: no matter what you will choose you will not be disappointed."}]}