{"url":"https://community.fantasyflightgames.com/topic/274103-orc-grunt-and-blade-of-gondolin/","title":"Orc Grunt and Blade of Gondolin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/274103-orc-grunt-and-blade-of-gondolin/?do=findComment&comment=3294291","commentId":3294291,"userName":"Boromore","timestamp":1524490717,"content":"In the dreaded Battle of Carn Dum (take 87), I'm engaged with 2 Orc Grunts. There is an active location. Boromir with a Blade of Gondolin kills Orc Grunt 1 - can I trigger the blade's response to put one progress on the active location, or does Orc Grunt 2 prevent it? (i.e. does Orc grunts ability \"Any time progress is placed on the current quest reduce the amount of progess by 1\" include the active location?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/274103-orc-grunt-and-blade-of-gondolin/?do=findComment&comment=3294310","commentId":3294310,"userName":"GrandSpleen","timestamp":1524491632,"content":"Since it's only going on the active location, you can place the progress."},{"commentUrl":"https://community.fantasyflightgames.com/topic/274103-orc-grunt-and-blade-of-gondolin/?do=findComment&comment=3294403","commentId":3294403,"userName":"Boromore","timestamp":1524495491,"content":"So the flow would be:\n\n * Trigger response on Blade of Gondolin to place one progress on current quest\n * Framework rule diverts progress to active location\n * Passive (or as it now seems to be known, constant) effect on Orc grunts is no longer relevant.\n\nMore than happy to play it that way - was just curious because Blade and Orc Grunts both use the same language (re: place progress on the current quest), and the case doesn't quite fit FAQ 1.05 (Removing progress from quests).\n\nThanks for the reply!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/274103-orc-grunt-and-blade-of-gondolin/?do=findComment&comment=3294979","commentId":3294979,"userName":"GrandSpleen","timestamp":1524515332,"content":"It's because \"placing\" progress on the quest and \"assigning\" progress to the quest are different things.\n\nWhen you have progress tokens that go on the quest card, you first \"assign\" progress to be placed on the quest.  Then you \"place\" it.   If there is an active location, you will \"place\" it there first before you \"place\" it on the quest. \n\nSo actually you never \"placed\" progress on the quest with Blade of Gondolin-- you \"assigned\" it, and then \"placed\" it on the active location, neither of which get reduced by Orc Grunts."}]}