{"url":"https://community.fantasyflightgames.com/topic/274958-help-wanted-apply-within-noob/","title":"Help Wanted, Apply within. (noob)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/274958-help-wanted-apply-within-noob/?do=findComment&comment=3309781","commentId":3309781,"userName":"BKNFAN","timestamp":1525291667,"content":"Greetings,\n\nI'm a super noob to card games . (Please try not and laugh when you read this.)\n\nI'm in my first game playing just the tactics deck. I have 3 location cards out from my encounter deck. I'm losing 3 points per round as I don't have enough will power to keep up. There is nothing to do in the encounter phase or even combat. So I am refreshing, and seem to be in this endless loop of not enough will power to push the game forward.\n\n \n\nI have cards out like the veteran axehand and the Gondorian Spearman. However, these guys have no will power to aid in stopping the loop I'm in.\n\nAm I playing this correctly going from quest phase to refit as I have no actions?\n\n \n\nAgain, Very sorry for the basic rule question. The rules read as if I will have something to do in the encounter/combat phases.\n\n \n\nThank you in advance.\n\n \n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/274958-help-wanted-apply-within-noob/?do=findComment&comment=3310156","commentId":3310156,"userName":"NathanH","timestamp":1525299613,"content":"The tactics deck doesn't work well on its own for exactly the reason you have discovered. If you take a look at the other decks, you'll see that both their starting heroes and their allies have more willpower than the tactics equivalents. If you don't have a friend to play two-player with, you should use one of the other decks instead (any of them should be playable). When you have played a bit with the starter decks, you can try making a multi-sphere deck that makes use of some Tactics cards and includes another sphere to provide the willpower.\n\nIt is worth noting that even with the other decks this can sometimes happen. If you get unlucky and draw a constant stream of locations, you still might not have enough willpower to escape the location lock. But the non-tactics decks are less vulnerable to this, thanks to higher willpower and some cards that interact with locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/274958-help-wanted-apply-within-noob/?do=findComment&comment=3310186","commentId":3310186,"userName":"Ywingscum","timestamp":1525300525,"content":"Just to confirm, you can travel to a location and explore it.  With a tactics deck it is best to travel every opportunity you can to keep the staging area locations to a minimum.\n\n \n\nif you still don’t have enough willpower, I would remove 1 tactics hero and replace with a good quester like spirit Eowyn.  Or play using 2 decks.  I use 2 decks all the time.\n\n \n\nedit: encounter phase is just engaging enemies (if any) in the staging area and then fighting them in combat\n\nEdited May 2, 2018 by Ywingscum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/274958-help-wanted-apply-within-noob/?do=findComment&comment=3310342","commentId":3310342,"userName":"BKNFAN","timestamp":1525304027,"content":"Thank you both for the quick response!\n\nI've taken the first quest on again. This time with the Lore Deck. I plan to do the first challenge with all the decks so I can get a feel for their capabilities. Lore seems to be able to draw a lot of cards and the Will Power is much better.\n\nGood advice, I'll finish out the exploration of each sphere, then play the game with two as if I was two players.\n\nbe will mates\n\nBKNFAN\n\n "}]}