{"url":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/","title":"Organizing cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3326675","commentId":3326675,"userName":"daverayjord","timestamp":1525991340,"content":"Hi all, as my collection of lotr lcg cards grows I’m wondering what is the best way to organize my player cards. Should I divide into types eg spirit heroes, spirit allies, spirit events etc. or should I keep cards from expansions together and organize chronologically? Not exactly a rules question I know but I’d appreciate some advice on this. Thanks. Dave. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3326788","commentId":3326788,"userName":"Wandalf the Gizzard","timestamp":1525999640,"content":"I would recommend sorting them by sphere, then type, then chronological order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3326897","commentId":3326897,"userName":"dalestephenson","timestamp":1526006359,"content":"I sort in card binders, first by sphere, then by type, then by cost.  I don't play older quests in \"progression style\" (using cards only released to that point), so chronological sorting has no value to me, I would probably go to alphabetical if I felt the need to break it down further."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3326898","commentId":3326898,"userName":"dalestephenson","timestamp":1526006406,"content":"An exception is the heroes -- I keep all of them in a single deck, ordered by sphere first and alphabetically second."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3326905","commentId":3326905,"userName":"daverayjord","timestamp":1526006736,"content":"Thanks a lot guys. Much appreciated. Dave. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3327191","commentId":3327191,"userName":"Seosaidh","timestamp":1526038255,"content":"I go sphere, type, alphabetical. I have the cards in the core box, although I'm about to move the spirit cards to a binder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3327215","commentId":3327215,"userName":"monkeyrama","timestamp":1526039976,"content":"I store all my scenario cards in cardboard boxes designed for trading cards, and do it roughly by cycle chronologically, since it would be a pain to reorganise them into, eg, sagas vs standard cycles.\n\nMy player cards are all stored in one of these boxes:\n\nhttp://oplaser.co.uk/shop/lotr-vertical-storage.html [http://oplaser.co.uk/shop/lotr-vertical-storage.html]\n\nIt's a little pricey but it's very nice as a way to store the cards. I have everything so far, and it *just* fits, so I may need to get an additional box. It also comes with nice dividers to help separate out card types.\n\nI store by sphere, with dividers separating heros, allies, attachments, events, and cards currently partly used in decks (i.e. extra copies of a card that is 1x in a deck). Heroes are arranged by threat and, where possible, by trait, and allies etc. are arranged by trait and then by cost. For events that's impossible, so I have an insane system in my head for what goes where.\n\nI also have a final column of storage for secrecy, doomed, valour, neutral, and songs, so that I can quickly find those cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3327579","commentId":3327579,"userName":"Authraw","timestamp":1526053063,"content":"I have found deckbuilding with boxes to be really tedious, so I have five binders (one for each sphere). In those binders, I arrange them into sections with a little space between them so that I don't have to redo the whole binder when I get some new cards.\n\nThe major sections are:\nHeroes (by threat cost)\nAllies (with separate sections for each developed tribal trait, ordered by cost)\nAttachments (by cost)\nEvents (with separate sections for 1-cost, 2-cost, 3-cost and 4+ cost)\nSide Quests (by cost)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3327838","commentId":3327838,"userName":"afteryule","timestamp":1526059481,"content":"> 5 hours ago, monkeyrama said:\n> \n> I also have a final column of storage for secrecy, doomed, valour, neutral, and songs, so that I can quickly find those cards. \n\nAs my collection has grown, I've started to do this as well, also adding dividers for traits like Outlands, Eagles, Ents, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3328492","commentId":3328492,"userName":"Onidsen","timestamp":1526087413,"content":"I generally do almost all of my deckbuilding online, so my organization pattern is slightly different, and oriented more towards towards keeping a decently logical setup so I can find the cards I want while minimizing the need for re-ordering as new cards get released.\n\nThat said, I order my cards first by sphere (obviously), then by type (hero, ally, attachment, event), and then by cycle of release - core set first, then saga expansions, then each deluxe plus adventure packs in order.\n\nAllies also get ordered by trait before cycle of release."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3329136","commentId":3329136,"userName":"Kakita Shiro","timestamp":1526151277,"content":"Because RingsDB allows it, I sort my cards chronologically, exempting Saga player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3329624","commentId":3329624,"userName":"NathanH","timestamp":1526204519,"content":"My method has been to remove every card I don't expect to use and put them all in one expansion box, then sort by sphere and then by theme (healing, eagles, ...). Each theme gets put into a little bag, then all the sphere's cards get put into one expansion box. Cards that are frequently used don't get put back into the bags after use, they live in a few deckboxes sorted by sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3329746","commentId":3329746,"userName":"Lecitadin","timestamp":1526217593,"content":"I keep all my cards in a garbage bag, I shuffle them all and the just draw 50 cards from the bag and then choose my heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3330417","commentId":3330417,"userName":"dalestephenson","timestamp":1526253474,"content":"> 9 hours ago, Lecitadin said:\n> \n> I keep all my cards in a garbage bag, I shuffle them all and the just draw 50 cards from the bag and then choose my heroes.\n\nThis actually sounds like an interesting deckbuilding challenge, though the four spheres would make things tough."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3330617","commentId":3330617,"userName":"Authraw","timestamp":1526274192,"content":"> 5 hours ago, dalestephenson said:\n> \n> This actually sounds like an interesting deckbuilding challenge, though the four spheres would make things tough.\n\nYou could pick a few extra cards and then trim down to 50. Kinda like a Sealed tournament, I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3330651","commentId":3330651,"userName":"NathanH","timestamp":1526277387,"content":"We did something like that once. We generated \"packs\" that contained 1 hero, 1 staple card of the hero's sphere, and then some other number of cards. All cards were assumed 3x. It was quite fun, although tended to lead to fairly vanilla \"efficient\" decks rather than anything particularly interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3330902","commentId":3330902,"userName":"dalestephenson","timestamp":1526303278,"content":"I'm surprised they ended up as an efficient deck.  I've tried making some fellowships using all the cards from a particular pack and they tend to be inefficient, as they try to do too many things once -- I would think a random \"pack\" would be even worse in this regard, unless you can drop some cards completely.\n\nThough this is getting far afield from card organization...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3331426","commentId":3331426,"userName":"NathanH","timestamp":1526322288,"content":"What I meant was that, when faced with a limited pool of random cards, the clearly best option was almost always to judge each card on its own and favour just a collection of the most efficient cards available, rather than attempt any theme, gimmick or synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/275691-organizing-cards/?do=findComment&comment=3331512","commentId":3331512,"userName":"dalestephenson","timestamp":1526326077,"content":"I see what you mean.  I was thinking of it in the opposite direction -- rather than constructing a deck out of a limited pool of random cards, being \"stuck\" with a smaller number of random cards (too few to construct a deck) and being tasked with constructing a deck where including 3x of those cards (or 2x if unique) make sense, drawing on the whole card pool."}]}