{"url":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/","title":"Understanding Playstyle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3333557","commentId":3333557,"userName":"Devaresh","timestamp":1526432019,"content":"Started to consolidate and write out some of my thoughts on playstyle in this latest blog post talking about theme. Check it out and let me know what you think! How does theme contribute to your play style?\n\nhttps://reflectioninhennethannun.wordpress.com/2018/05/16/finding-your-play-style-theme-style/#more-270 [https://reflectioninhennethannun.wordpress.com/2018/05/16/finding-your-play-style-theme-style/#more-270]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3334030","commentId":3334030,"userName":"Eryx_UK","timestamp":1526476177,"content":"An interesting read. I prefer to build decks (and this goes for other games like M:tG as well) around a specific theme. In LotR it would be elves, or rangers, or dwarves...etc but I find the game doesn't lend itself to that very well. To make a good deck you need different abilities and even keywords that quite often don't always fit together thematically. But as I play for the love of the story and not for the challenge of a game I try to make a deck with heroes and allies that makes thematic sense to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3334188","commentId":3334188,"userName":"Devaresh","timestamp":1526481824,"content":"I agree that many of the traits aren’t exactly self sufficient, but a few are pretty close. I think the Silvan or Noldor trait are probably the strongest overall. It’s good to know what you like and what you want from the game though!\n\nWhen we play the stuff we love I think we tend to improve all around as players.  That’s a big part of why I like connecting theme to playstyle in my thinking."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3336523","commentId":3336523,"userName":"icabod","timestamp":1526597458,"content":"Indeed, an interesting read - I look forward to more posts in the series.\n\nI'm new to LotR, and deck-building games in general, having subtly hinted to the wife (by way of frantic pointing and audible gesturing in my local games shop) that she may like to buy it for me.\n\nSo I don't think I have a play-style yet, having only tried the starter decks in the core set, but started the other day to actually build my own deck.  As I'm not really au fait with Middle Earth I'm not currently considering theme so much as \"pick two spheres and filter out cards that won't work in solo play\", but I guess that makes my approach \"no bows-and-arrows\".  Theme is something I would look to integrate when I have expanded my card collection.\n\nBut the blog is a good read.  Cheers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3336585","commentId":3336585,"userName":"Devaresh","timestamp":1526601708,"content":"Thanks, I’m glad you enjoyed the post!\n\nWelcome to the game! Please feel free to let me know if you need any suggestions on getting started or any sort of questions. I play a lot of solo so that is my primary deck building experience. There’s also a lot of very good community resources from other blogs to Ringsdb.com which is a deck building website specifically for the game.\n\nHope you are enjoying it and welcome again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3336819","commentId":3336819,"userName":"OlorinCZ","timestamp":1526621431,"content":"> On 5/16/2018 at 3:09 PM, Eryx_UK said:\n> \n> In LotR it would be elves, or rangers, or dwarves...etc but I find the game doesn't lend itself to that very well. To make a good deck you need different abilities and even keywords that quite often don't always fit together thematically. \n\nI don´´'t think so. \nMany of the traits are capable to hold themselves up. I have thematic/tribal decks (albeit two-handed), which can defeat most quests (with full card pool). \nNoldor, Silvan, Dwarves, Gondor, Rohan, Dunedain, .....\nAll capable to crush Sauron's forces. \n(One or two exceptions, especially in attachements, are of course sometimes needed)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3336967","commentId":3336967,"userName":"Devaresh","timestamp":1526638547,"content":"I agree that there are some strong traits, but I think some would consider playing in two handed, or to have one or two exceptions for attachments show the deficiencies which Eryx_UK was talking about. Of course you could always make the case that not every trait should be able to do everything but that’s a different point I think.\n\nThats great that you’ve got some strong trait based deck you like playing! I’m not sure if I’ve narrowed in on a trait I prefer yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3337005","commentId":3337005,"userName":"Onidsen","timestamp":1526643814,"content":"This goes to show just how much individual playstyle preferences affect your experience of the game.\n\nI play primarily two - handed solo, and mostly non - nightmare quests, because I find it the most enjoyable way to play. Others prefer 4 player multiplayer, or pure solo; some prefer only the hardest quests in the game, and so on.\n\nMy experience has been that the trait - focused decks are sufficiently powerful in the context of my playstyle. I suspect that some of them just don't cut it in pure solo, however."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3337016","commentId":3337016,"userName":"Devaresh","timestamp":1526644781,"content":"Excellent point Onidsen! That thought process is exactly why I started the series talking about playstyle. So many things go into effecting how we think about everything from traits to individual cards!\n\nI’m hoping future posts in the series will help continue these sorts of thoughts and discussions!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3337300","commentId":3337300,"userName":"Authraw","timestamp":1526659666,"content":"It's conversations like this that inspired me to start my blog, actually. (Darkling Door [https://darklingdoor.wordpress.com/thematic-nightmare/]) I have found thematic and trait-based decks to be strong enough to defeat Nightmare quests in solo, often without needing to make any thematic concessions. Not every combination of trait-sharing Heroes is viable, of course, but for the most part I think a lot of the major cultural traits (Dwarf, Silvan, Hobbit, Rohan, Gondor, Noldor, Dunedain, Ent) can build competitive decks with the modern card pool.\n\nThere are actually a lot of generically-themed cards out there that do the same work as a lot of the classic \"staples\". Captain's Wisdom isn't as powerful as Steward of Gondor, for instance, but it's often enough to get me through those first few rounds to set up my board state. Or maybe if I'm having resource problems, I just need to reduce my cost curve a bit; I've come to think of 3-cost cards as being relatively expensive, and anything that costs more than that darn well better have a vital role to play (or a way to cheat it in for cheap) otherwise I usually end up cutting it.\n\nI wrote a post about how I think about archetypal deckbuilding here: Shoring Up Weaknesses in Archetypes [https://darklingdoor.wordpress.com/2017/02/22/shoring-up-weaknesses-in-archetypes/]\n\nA bit of a ramble, but my point is that with the modern card pool I have found it totally possible to defeat really hard quests with thematic decks of all different stripes, even in solo. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3337351","commentId":3337351,"userName":"Devaresh","timestamp":1526661748,"content":"Awesome point! I do think it’s important to ask which traits people are talking about in the discussion. Some of the cultural ones are very strong, whereas some of the vocation ones tend to be secondary (which is probably appropriate).\n\nIt can also be the case that the trait people try doesn’t actually fit their standard style of play for whatever reason, which could make it feel incomplete in their assessment.\n\nAlso, I think when you start thinking toward specific quests you open up even more possibilities, and can complete them even on nightmare without what most people would consider thematic compromises.\n\nI definitely prefer to build more toward a quest (especially getting into nightmare now) then to start playing two handed because I like the puzzle of deck building.\n\nThis is great discussion points on different perspectives! I’ll definitely be including some of these in the next entry!\n\nEdited May 18, 2018 by Devaresh"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3344816","commentId":3344816,"userName":"Otherworlder","timestamp":1527059214,"content":"I care about theme a lot, but I still find myself building decks first around a few actual play style choices, and I will break every conscious and unconscious theme rule I have to maintain my standard deck building choices. For example I care a LOT about turn 1 consistency, probably a habit icarried over from other competitive card games, so I never build tri-sphere unless one of the three heroes is Gandalf. As a result, my Silvan deck never contains Galadriel, as I consider Celeborn and lore sphere to be more essential to Silvan. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3344890","commentId":3344890,"userName":"Rouxxor","timestamp":1527064894,"content":"@otherworlder If you care about turn 1 constency you should probably look for card generation like legacy of numenor (the best one), captain wisdom, Grima+key of orthanc, Leadership Denethor, Arwen Undomiel Hero... Bifur and envoy of pelargir are good too to make a proper resource distribution. In fact Neutral Gandalf is weaker than every cards named below to stabilize your start.\n\nFor example I play Silvan either at Grima / Celeborn / Galadriel with Key of Orthanc, steward of gondor and ô lorien (solo play) or with Haldir / Celeborn / Galadriel with legacy of numenor, steward and ô lorien. I don't even need captain wisdom because I have enough resource smoothing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3346304","commentId":3346304,"userName":"Otherworlder","timestamp":1527120914,"content":"> 15 hours ago, Rouxxor said:\n> \n> @otherworlder If you care about turn 1 constency you should probably look for card generation like legacy of numenor (the best one), captain wisdom, Grima+key of orthanc, Leadership Denethor, Arwen Undomiel Hero... Bifur and envoy of pelargir are good too to make a proper resource distribution. In fact Neutral Gandalf is weaker than every cards named below to stabilize your start.\n> \n> For example I play Silvan either at Grima / Celeborn / Galadriel with Key of Orthanc, steward of gondor and ô lorien (solo play) or with Haldir / Celeborn / Galadriel with legacy of numenor, steward and ô lorien. I don't even need captain wisdom because I have enough resource smoothing.\n\nCool deck! Gandalf is actually strictly in that one three ring bearers deck I have; Gandalf is very consistent in a deck built around him. Also I think I have never played Grima in any deck now thinking of it... He never seems to fit anywhere (thematically)! I am pretty picky about both play choices and themes, which is probably why I don't play that many decks. I wouldn't put Bifur in a silvan deck, for example, though he is super effective. I think my silvan deck has generally been Celeborn and all the green silvans, some times Elrond, thinking of trying Treebeard. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3346646","commentId":3346646,"userName":"Crusaderlord","timestamp":1527151548,"content":"I play solo - one deck . I like adventure stories and building decks with some theme such as dwarf, elf, hobbit rather than going to more clever deck combinations.\n\nI don't include obvious anomolies like ents on ships or mounts going deep into spider burrows or cairns.\n\nSolo can be hard to do without perfect decks so sometimes i tweak quest triggers especially when the scenario is pushing endless staging area additions - often multiple players can cope better with say a boss trigger adding one extra card per turn to staging, but solo usually gets swamped, so i may add every other turn to reflect my lack of ability to share the staging burden. With experience it is not hard to work out where a designed forced effect is unbalanced for solo play to a high level. I try to end up with quest difficulty level where i do not win most of the time, but i can some of the time.\n\nI play for fun, i never score victory points, but tell myself the story of my adventure , hopefully eventually a successful one. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3347068","commentId":3347068,"userName":"asgardianphil","timestamp":1527174631,"content":"Relating to theme... \n\n> 14 hours ago, Otherworlder said:\n> \n> Also I think I have never played Grima in any deck now thinking of it... He never seems to fit anywhere (thematically)! I am pretty picky about both play choices and themes, which is probably why I don't play that many decks. I wouldn't put Bifur in a silvan deck, for example, though he is super effective. I think my silvan deck has generally been Celeborn and all the green silvans, some times Elrond, thinking of trying Treebeard. \n\nI think theme shouldn't get in the way of deck building too. I love theme. For me the game itself is the theme, that what differentiates it from the Arkham Horror lcg, for example. But not having Bifur in a sylvan deck style of choice ,in my mind, is counter thematic to the theme itself. Tolkien story centred around a fellowship of men, elves, dwarves and hobbits.  They collaborated with eagles, and ents too. There are always exceptions too, so elves may generally mistrust dwarves but not all do. Legolas and Gimli case in point. \n\nI guess my point is play how you want but it isn't necessarily thematic by Tolkien's or the game designers standards to always create mono sphere or single trait decks.\n\nThe designers put the most powerful combos across spheres which is why the basic mechanics of the game (card draw, healing, resources, battle, questing and threat reduction are split a cross the four spheres) \n\nThis is a lesson I've learned the hard way and am still learning it on the Wastes of Erriador which I haven't beaten yet despite playing it solid for two weeks and changing my deck about 10 times\n\n?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276018-understanding-playstyle/?do=findComment&comment=3347112","commentId":3347112,"userName":"Ywingscum","timestamp":1527175976,"content":"Sounds good to me!"}]}