{"url":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/","title":"How do you play LOTR LCG?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341522","commentId":3341522,"userName":"kingma15","timestamp":1526888732,"content":"I have played a heap of tcg’s over the years. \n\n \n\nLCGs have always interested me.\n\n \n\nI purchased the lotr game like 5 or 6 years ago and never played it. 2 kids for me and a gaming group of dads and it is much harder to get games happening.\n\n \n\nI dug out LOTR and played it singlehanded. I am addicted. I love the game. The flavour, the mechanics, the quests, the art...all of it!\n\n \n\nI have done some reading up and understand the whole saga expansions, different cycles etc\n\n \n\nMy question is: how do you play this game?\n\n \n\nComing from a tcg background, I am used to the idea of building a deck and playing with it to beat people. But the idea of one deck for all scenarios doesn’t seem to be the thing with this game. \n\n \n\nDo do you play through scenarios with only the cards available at the time of printing or do you use any cards from your collection?\n\n \n\nDo you play through missions of each cycle in order, keeping the same deck?\n\n \n\nI have made a heap of purchases online and while I recognise the quick answer to my question is “play so that you have fun” but I am interested in seeing how other people play.\n\n \n\nCurrently I am playing through the starter set and Mirkwood cycle expansions using only the cards available at the time. I am using the decks from the beorns path series of articles and trying to beat all of the scenarios.\n\n \n\nI look forward to reading your responses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341557","commentId":3341557,"userName":"Rouxxor","timestamp":1526892514,"content":"On the first times I play a quest I do it progression mode: only with the cards available when it is released. I'm playing each quests with several (2 to 10 depending of how many the quest is captivating) decks I like. It is first because I'm playing from the beginning so I have no choice about that ^^, but also an advice I would give to someone who begin. When I get back on that quest (nowadays it is usually when I transform it into nightmare mode) I'm playing with cards release after because I don't want to build new decks for any little game.\n\nI don't look especially to thematic deck building. Many cards create synergies with a specific kind of cards so if I want to optimize my decks I play many different cards anyway.\n\nI don't deck build against a specific quest because I never feel it is mandatory. With the most powerful decks you can defeat all the quests. But I only begin solo with cycle 2 so maybe it is not true yet for you.\n\nI'm playing both solo and multiplayer. Only 4 players games annoy me.\n\nI'm printing in order to keep many decks built on the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341870","commentId":3341870,"userName":"Wandalf the Gizzard","timestamp":1526912377,"content":"Well, you just build a legal deck you like, pick a quest, and play it!\n\n> 6 hours ago, kingma15 said:\n> \n> Do do you play through scenarios with only the cards available at the time of printing or do you use any cards from your collection?\n> \n>  \n> \n> Do you play through missions of each cycle in order, keeping the same deck?\n\nBoth of these are fun to do, but by no means the one way to play the game. If you're looking for a more structured format, try campaign mode in the saga expansions or the competitive format coming out at Gen Con this year.\n\nEdited May 21, 2018 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341878","commentId":3341878,"userName":"farealh","timestamp":1526912576,"content":"In my case –and coming from a background similar to yours in TCGs– my approach has always been to face the greatest challenge possible. In the case of LotR LCG that means, at least for me, playing progression style; i.e. trying to overcome a quest only with the player cards available at the time. So far I've been fascinated by this mode of play, so I totally recommend it! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341890","commentId":3341890,"userName":"Ywingscum","timestamp":1526913149,"content":"I play 2 handed solo mostly.  At the start of a deluxe expansion, I make my deck based mostly off the deluxe and 2 cores.  And try to play the whole cycle with just tweaking the decks but keeping the heros intact.\n\nonce I succeed at that, on to the next cycle.  Or if it goes badly, do it again with Dwarves! Haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341933","commentId":3341933,"userName":"JonG","timestamp":1526915232,"content":"I own just about all of the game. I keep 8 decks permanently set up (Dwarves, leadership-Dunedain, Rohorrim, leadership-Gondor, Gondor-Outlands, Noldor, Sindar, filthy little Hobbitses) plus a sideboard of cards such as ally-Gandalf which go into most of my decks. I play each deck against an AP, unless the AP is so difficult that I know there's no point. \n\nEdited May 21, 2018 by JonG\ncan't spel"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341945","commentId":3341945,"userName":"Authraw","timestamp":1526915805,"content":"My partner and I build new decks at the start of each new cycle according to whatever is our fancy at the time, and then we just tweak those decks as we go until we finish the cycle. \n\nWhen I go back to quests solo, it's usually in Nightmare mode. I use my full card pool, and I typically either build a deck specifically for the quest or choose a deck that I already have built that I think might do well. \n\nWhenever I build decks, I almost always try to stick to a theme of some sort; it's just more fun for me that way. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3341946","commentId":3341946,"userName":"mewmartigan","timestamp":1526915829,"content":"I only have cards up through the Angmar Awakened sequence. I love the game but not deck building. I use my whole collection, find a deck that seems neat on Ringsdb and then try to go through a cycle or more with it. \n\nI like thematic decks. \n\nI am waiting to start a saga run through until I have all the boxes. I only have hobbit and fellowship of the ring so far. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3342371","commentId":3342371,"userName":"Eryx_UK","timestamp":1526931080,"content":"As I only play solo, these days I play in a completely different fashion to how it was intended. But I'm more interested in the story element rather than mechanical."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3342461","commentId":3342461,"userName":"GrandSpleen","timestamp":1526933521,"content":"2-player with a friend or my wife, 3- or 4-player at a meetup.  I play true solo once in a while for deck testing, and sometimes 2-handed for the same purpose.  When I play with other people, I use physical cards, but I mostly use digital (OCTGN) for deck testing.\n\nI play everything progression style out of natural consequence; I own all of the non-nightmare content and buy it as it is released, so I'm playing progression style just by keeping up.\n\nQuirky card interactions interest me the most, I don't usually build thematic decks or power decks, but decks that require me to make a good number of meaningful decisions while I pilot them.  If I lose repeatedly at a scenario, I will build decks specifically to defeat it.  Otherwise I play a new scenario blind using some decks that I already had assembled.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3343338","commentId":3343338,"userName":"kingma15","timestamp":1526993390,"content":"Thanks for the replies everyone.\n\n \n\nIsn’t it fascinating how everyone plays so differently?\n\n \n\nI think it says a lot about the versatility of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276321-how-do-you-play-lotr-lcg/?do=findComment&comment=3346067","commentId":3346067,"userName":"Boromore","timestamp":1527110634,"content":"Another thing to consider if you are playing it on your own, is whether you want to play 1-handed or 2-handed. Playing 2-handed expands the number of cards you are likely to use, plus it brings in the use of sentinel and ranged.\n\nI started off playing 2-handed, progressive style (or contemporary, as I call it), with one core set - mainly in the pig-headed belief that I ought to be able to succeed at the quest as when it was first set. I have a second core set, but try and reserve the handful of extra cards that gives for nightmare scenarios (or now also the GenCon / Fellowship specials) - just to give me extra help when I most need it!.\n\nBut I am revisiting the old scenarios, playing pure solo, and finding a change of tack brings new life to those quests (plus enough time has passed for me to  enjoy them all over again).\n\nBut as you say, the game is versatile enough for you to enjoy it in your own style!"}]}