{"url":"https://community.fantasyflightgames.com/topic/276783-vilya-put-into-play-resource-match/","title":"Vilya, Put into Play, Resource Match","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/276783-vilya-put-into-play-resource-match/?do=findComment&comment=3351748","commentId":3351748,"userName":"Ranger of the Force","timestamp":1527515426,"content":"My friend and I were discussing In Seastan's The One Deck how he is getting steward of Gondor in play without resource match.  I offered that when putting things into play  maybe you ignore resource match, he wasn't so sure.  Is there a place in the rules that addresses this?  Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276783-vilya-put-into-play-resource-match/?do=findComment&comment=3351868","commentId":3351868,"userName":"GrandSpleen","timestamp":1527523360,"content":"You are required to make a resource match when you play a card, unless some other card effect waives that requirement.\n\nThe rules do not ever state that you need a resource match for \"putting a card into play,\" which is a distinctly different action from \"playing\" a card.  \n\nYou also don't need a resource match to discard a card for Protector of Lorien or shuffle Galadhrim Weaver's chosen card back into your deck.  In other words, if there is no place in the rule book which requires a thing, then you don't need that thing.\n\nOther examples of \"put into play\" which don't require a resource match, and would be at least a little broken if you required a resource match, include Fili/Kili, Raise the Shire, and Galadriel ally.\n\nThe wording of Vilya seems to suggest that you have a choice between \"playing\" or \"putting into play\" the revealed card, although that might not have been the intent in writing it.  In any case, I don't really have any doubts that Vilya can get cards into play without a resource match."},{"commentUrl":"https://community.fantasyflightgames.com/topic/276783-vilya-put-into-play-resource-match/?do=findComment&comment=3354550","commentId":3354550,"userName":"Seastan","timestamp":1527703640,"content":"> On 5/28/2018 at 6:50 AM, Ranger of the Force said:\n> \n> My friend and I were﻿ discussing In Seastan's The One Deck how he﻿ is﻿﻿ getting steward of Gondor in play without resource match.  I offered that when putting things into play  maybe you ignore resource match﻿, he﻿ wasn't so sure.  Is there a place in the rules that addresses this?  Thanks. ﻿﻿﻿\n\nVilya is a complicating card. From the FAQ (https://images-cdn.fantasyflightgames.com/filer_public/2e/31/2e3129b3-dc51-4c27-81ed-6a72f13e82f3/lotr_faq_19.pdf [https://images-cdn.fantasyflightgames.com/filer_public/2e/31/2e3129b3-dc51-4c27-81ed-6a72f13e82f3/lotr_faq_19.pdf]\n\n> Quote\n> \n> Q: When I use the ability on Vilya (D 109) to play a\n> card, do I still need a resource match?\n> A: No. Playing a card at “no cost” is different from\n> playing a card for “0 cost.” A 0 cost card still requires\n> a resource match, however, playing a card at “no cost”\n> removes the need for a resource match.\n\nSo no resource match is required for any card.\n\n> On 5/28/2018 at 9:02 AM, GrandSpleen said:\n> \n> The wording of Vilya seems to suggest that you have a choice between \"playing\" or \"putting into play\" the revealed card, although that might not have been the intent in writing it.  In any case, I don't really have any doubts that Vilya can get cards into play without a resource match.\n\nFrom Caleb:\n\n> Quote\n> \n> Q: If you exhaust Elrond and Vilya to reveal an ally on the top of your deck can you : 1) put him into play at no cost, 2) play him at no cost, or 3) choose to play him at no cost or put him into play?\n> \n> A: When you use Vilya’s ability and the top card of your deck is an ally or attachment, you put it into play. The added language about “play at no cost” is there for when the top card of your deck is an event, because you don’t put events into play.\n\nSo the text \"at no cost\" on Vilya is the important factor here. Because if it just said \"You can immediately play or put into play the revealed card.\" then you would have to have a resource match for events (since you play them) but not allies/attachments (since you put them into play).\n\nVilya's \"no cost\" text also applies to additional costs, such as the one of Skyward Volley. It also bypasses play restrictions on attachments like Ent Draught (since you aren't \"playing\" it) but not play restrictions on events like Strength of Arms (since you are \"playing\" it). This was all discussed here: https://community.fantasyflightgames.com/topic/204958-vilya-and-ent-draught/?do=findComment&amp;comment=2094740 [https://community.fantasyflightgames.com/topic/204958-vilya-and-ent-draught/?do=findComment&comment=2094740]\n\nEdited May 30, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/276783-vilya-put-into-play-resource-match/?do=findComment&comment=3354702","commentId":3354702,"userName":"GrandSpleen","timestamp":1527709553,"content":"Nice -- thanks!"}]}