{"url":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/","title":"Why is this forum so quiet?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3359640","commentId":3359640,"userName":"tripecac","timestamp":1528089892,"content":"I remember a few years ago this forum seemed a lot busier.  Does this mean LotR LCG fandom is in a decline?  That seems odd, since outside of this forum I am noticing more and more interest in it.  For example, recently I was looking for Coop games to play with my kids, and LotR LCG kept popping up in the best coop games list (and occasionally at the top).  And I heard in a recent podcast that LotR LCG is one of the most \"popular\" FFG games.  So why does the forum seem so quiet???\n\nMaybe it's just my impression, though.  I've been spending a lot of time on the Steve Hoffman [audiophile] forums, where traffic is so heavy that posts often leave the first page within a matter of minutes.\n\nHas anyone measured the frequently of posts on a per-year basis?  Is there a way to do that on this forum?  Or would we need to query the database?  Not that FFG would let us...\n\nAnyway, do you guys have the impression that the forum has become quieter over the past year or so, or is it just my impression?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3359652","commentId":3359652,"userName":"GrandSpleen","timestamp":1528091363,"content":"I’ve been on this forum for years, and yes I do think it is quieter than it used to be. But I think that mostly just means that the action has moved elsewhere.   \n\nThere is now the Facebook group here: https://m.facebook.com/groups/1524879351170755 [https://m.facebook.com/groups/1524879351170755]\n\nAnd there is the Cardboard of the Rings Discord server.  \n\nPost in either of those and you’ll be getting replies within the hour if not immediately.\n\nI still prefer this place, and only rarely make posts in other places, probably out of habit I suppose.\n\n \n\n \n\nEdited June 4, 2018 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3359920","commentId":3359920,"userName":"Ywingscum","timestamp":1528121861,"content":"nature of a coop game? Casual gaming.\n\ni also think a lot players don’t check here anymore, there’s the FB groups, discord’s, etc.  Seems to me there’s just been a migration away from these forums.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360074","commentId":3360074,"userName":"Wandalf the Gizzard","timestamp":1528128098,"content":"Probably because there's not a whole lot to talk about.\n\nAs to popularity, I keep hearing how popular this game is, but I can't find a single player in a two-hundred mile radius of where I live and have been looking for a while."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360092","commentId":3360092,"userName":"tripecac","timestamp":1528128627,"content":"I see...  Do you know why people are leaving the FFG forums?  Is it just easier for people to post in a Facebook group than on a separate site like this?\n\nWhen I click on that Facebook link, I get a page which says \"Lord of the Rings LCG Players - Closed Group\".  Not sure how to proceed from there. \n\nAlso, the discord servers that I've found for LotR LCG want logins.\n\nSo I am curious: are the facebook group and the discord servers more like IRC chats, or are they organised by topics, like this forum?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360127","commentId":3360127,"userName":"Authraw","timestamp":1528130080,"content":"I think the community is just split. Part of that, I think, is that the nature of conversation is changing. Lots of discussion is moving from \"slower\" formats like forums to more ephemeral mediums like Discord, Reddit, and Facebook. I have found that those places are quite active hubs for discussing this game. \n\nBut the forum communities are split between here and BoardGameGeek, too.\n\nYou should be able to request an invite to the Facebook group and you will get accepted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360432","commentId":3360432,"userName":"GrandSpleen","timestamp":1528142606,"content":"Send a message to the group admin for the Facebook group, and you'll get your invite.\n\nFor discord yes, you'll need to make an account."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360473","commentId":3360473,"userName":"tripecac","timestamp":1528144302,"content":"Are the Facebook, Reddit, and Discord discussions aimed at people who play (and discuss) the game on a regular basis, rather than those of us who only play a couple games a year (if we're lucky) and are looking to periodically \"catch up\" with the latest developments?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360581","commentId":3360581,"userName":"Eryx_UK","timestamp":1528148586,"content":"Unless you are asking about rules this forum has always been quiet. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360606","commentId":3360606,"userName":"Rouxxor","timestamp":1528149544,"content":"I always find a big difference between the time a new product came and the following months. Players seem excited by the newest things and speak about this but tend not to play that much between release of products.\n\nWe also have to accept that the spirit of the game is more about casual, so you will have a really hard time to find a community who do something else that catching up the latest things. And it will become even worst because the % players who own everything decrease (because of the people who stop) and the new players have years to catch up ^^. I have seen events where the major part of the players don't own every cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360718","commentId":3360718,"userName":"Denison","timestamp":1528156778,"content":"A few years ago Discord did not exist. Nearly all of the traffic went there. The community is as vibrant as it ever has been, thanks in large part to the Cardboard of the Rings podcast leadership.  They have done a nice job sustaining interest and enthusiasm with the game through some minor product droughts.  The Discord group is an extremely positive and generous community.  Head over there if you need a constant stream of LOTR LCG chatter!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360966","commentId":3360966,"userName":"banania","timestamp":1528177891,"content":"This is due to the nature of LOTR LCG fandom which is dispersed in several places. The discord channel is super active, the facebook page and boardgamegeek forums see a lot of conversation (and a never ending influx of new players, as I see new faces each time I go there).\n\nA lot of people left the LOTR FFG forums due to the constant negativity and aggressiveness of certain individuals (who have not been the same over time). That's a fact.\n\nEdited June 5, 2018 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3360972","commentId":3360972,"userName":"tripecac","timestamp":1528178714,"content":"Which site(s) do you think are the best for \"forever new\" players like myself?  (I got into the game soon after it came out but still haven't progressed past the first couple Khazad Dum scenarios)? \n\n(I really like this forum, actually, once I got used to the face lift that happened a few months (or is it years?) ago.  There's lots of good info on here, and it doesn't bother me that much of it is \"old\" or \"archive\" level information since I am still wayyyyyyyyyyyyyyyyyy behind you guys!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3361231","commentId":3361231,"userName":"Wandalf the Gizzard","timestamp":1528204359,"content":"I still miss Glaurungs's videos, troll or no."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3361236","commentId":3361236,"userName":"Bullroarer Took","timestamp":1528204753,"content":"I do too.  I don’t view him so much as a troll as very brash.  He was the first player to open my eyes to what a deck could do if you ignored theme and went for pure power.\n\nwith respect to the first question, I think this place will pick up a bit on the 14th."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3361293","commentId":3361293,"userName":"Devaresh","timestamp":1528208430,"content":"Tripecac I think a lot of the blogs (I can give you a couple ideas if you want) would be good places to observe/catch up, but if you ever have specific questions posting here or the CotR discord will get you answers pretty quickly.\n\nYou’ll also find that a lot of people are experiencing what you are as brand new even now because they got into the game after the first couple cycles!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3362726","commentId":3362726,"userName":"dalestephenson","timestamp":1528289794,"content":"The forum may be quiet, but I think this forum still provides quick answers to new player questions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3362839","commentId":3362839,"userName":"sappidus","timestamp":1528295557,"content":"I'm glad these forums are still around. The more long-term archival format lets you go back and revisit, say, the kerfluffle over the Tactics Aragorn-Merry combo and the handful of people who thought it was a travesty that FFG allowed it to exist. Passionate times, those were.\n\nWhen I was totally new, I read through a fair chunk of old stuff here and at BGG to get a sense of the historical development of the game (including oddities like Will of the West infinite combo decks) and its players. The more ephemeral formats like Discord could not have given that experience to me. So I do hope this continues to survive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363683","commentId":3363683,"userName":"Network57","timestamp":1528317771,"content":"> 6 hours ago, sappidus said:\n> \n> I'm glad these forums are still around. The more long-term archival format lets you go back and revisit, say, the kerfluffle over the Tactics Aragorn-Merry combo and the handful of people who thought it was a travesty that FFG allowed it to exist. Passionate times, those were.\n\nBut if you build 4 Very Specific Decks and get into a Very Specific Board State against a Few Specific Quests, Scorpagorn/Merry makes combat too easy!! It's like this game was intended to make players deckbuild to beat a quest, jeez!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363817","commentId":3363817,"userName":"tripecac","timestamp":1528322274,"content":"> It's like this game was intended to make players deckbuild to beat a quest\n> \n> ﻿﻿, jeez!\n\n\n\nThat brings up a question I've had, (and I know this is off topic, but oh well...) and that is:\n\nAre we \"supposed\" to keep changing our decks for each new quest, or are we \"supposed\" to create a single deck that can beat every quest [in a cycle]?\n\nI know I haven't played very far in the game yet, but to me it somehow feels like \"cheating\" to change my deck between quests. \n\nWhen I first try a quest, I tend to lose badly, and then I change my deck to specifically counter whatever beat me.  I try again, repeatedly playing and tweaking until I finally beat the quest.  I proceed to the next quest and repeat the lose-tweak-lose-tweak-win pattern.  And so on.  But each time I do this, I feel like I am \"cheating\" by tailoring my deck to a specific quest... I feel like what I really should be doing is creating a single deck that is robust enough to handle each quest [in a cycle], since each cycle is one \"story\" and in a story it seems strange for the good guys' personnel, items, and abilities to suddenly change in order to perfectly counter the bad things which haven't happened yet.\n\nSo, for those of you who've played many quests (and are at least further than where I am, which is Khazad Dum), do you think changing decks between quests is:\n\na) cheating  (it might be part of the learning process but in order to beat a cycle \"properly\" you should keep your deck the same throughout it)\nb) mandatory  (some cycles are pretty much unbeatable if you insist on playing the same deck all the way through)\n-or-\nc) depends on the cycle  (some are beatable with a single deck, some are not)\n\nWhat are your feelings about this?\n\nAnd if you *do* allow yourself to tweak your deck between scenarios, do you limit the number of cards you can swap in and out of your deck?  And what about heroes - do you allow those to change?\n\n \n\n(Also, since this is so off-topic, should I repost it in a separate topic, or has this already been discussed to death in the past?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363867","commentId":3363867,"userName":"stimpaksam","timestamp":1528323510,"content":"I always thought having to tweak your deck or completely change it to win was how the game was designed. I don't think it's cheating. The shift in theme between some quests within a cycle are so extreme you're forced to have to rethink how to tackle them. Take A Journey to Rhosgobel and The Hills of Emyn Muil for example: two quests right next to each other and yet requiring two completely different deck types to beat consistently. The most fun I have playing this game is finding what's wrong with my deck and fixing it to win whatever quest I'm playing. Once I crack the code and beat a quest I'll then try to beat it again using different Heroes and/or spheres and start the tweaking process over again.\n\nEdited June 6, 2018 by stimpaksam\ngrammar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363927","commentId":3363927,"userName":"Rouxxor","timestamp":1528326302,"content":"There is no such thing as cheating since you determine yourself your challenges. Do you prefer to build a deck who beat all quests? A deck who play fringe cards? A deck that respect a theme? To play with only the cards available at the time of the release of the scenario? They all are great reason to deckbuild.\n\nAnd yes such things as decks that can beat all the scenario exist, nightmare including. Even in solo. And in multiplayer there is thousands of combination that are probably able to do so.\n\nFor my particular case there is only one scenario when I'm allowing myself to make some specific deckbuild: Mount Doom. There is also some decks that I never play against some scenario (tribal decks against escape from Dol Guldur and his \"only one ally per turn for all the players\" rule)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363933","commentId":3363933,"userName":"tripecac","timestamp":1528326504,"content":"I see...  Maybe it's because I'm used to RPGs, where you are free to build your character in whatever way you want, but then you are forced to stick with that build for the whole game.\n\nSo, is this more like a puzzle game, where each quest is supposed to make people think \"outside the box\" of their current \"build\"?\n\nIs frequent deck building a core part of the design (and appeal)?\n\nEdited June 6, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363950","commentId":3363950,"userName":"Ywingscum","timestamp":1528327182,"content":"I play the same 2 decks through a deluxe and it’s cycle.  \n\nI try a couple different things through the deluxe. Once I’m satisfied I take the same decks through the cycle.\n\ni’ve only Done 2 cycles though, Heirs of Numenor and Lost Realms.  But did the same thing for the Hobbit Sagas.\n\nEdited June 6, 2018 by Ywingscum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3363963","commentId":3363963,"userName":"dalestephenson","timestamp":1528327905,"content":"It's definitely not cheating to customize your deck for a specific quest.\n\nBut I find it *annoying* to do so.  I prefer to take the same basic deck(s) against several consecutive quests without too much difference.  Maybe swap in some sideboard cards for specific annoyances.\n\nAs to whether the designers want us to remake our decks, so they do odd things like Shadow and Flame or Escape From Mount Gram -- I don't think it's so much that they want us to remake our decks as that they want to create a new and different experience for a particular quest.  Some decks may be hard hit by the new quest designs, others may fit perfectly with what the deck already does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3364017","commentId":3364017,"userName":"Devaresh","timestamp":1528330116,"content":"I like to keep the same heroes and as much of the same deck as I can in my first go through a cycle but I do keep a small side board of things to switch in as needed.\n\nA big part of this that I haven’t seen someone mention is card pool size. If you have a smaller card pool I think it will become much more difficult to build a deck which will carry you through. If you have all the cards accessible then it’s easier. If you want to play progression I would imagine half of the fun is tweaking and rebuilding your deck as you “unlock” new cards. \n\nIn the end though, do what’s fun for you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3364644","commentId":3364644,"userName":"Wandalf the Gizzard","timestamp":1528376717,"content":"It's definitely not cheating any more than tweaking your CCG deck after losing to another player is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3365581","commentId":3365581,"userName":"PocketWraith","timestamp":1528407649,"content":"> 23 hours ago, tripecac said:\n> \n> Are we \"supposed\" to keep changing our decks for each new quest, or are we \"supposed\" to create a single deck that can beat every quest [in a cycle]?\n\nYes. You are supposed to do one or other of those two things. The choice of which you do is a matter of personal preference."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3365812","commentId":3365812,"userName":"Onidsen","timestamp":1528415549,"content":"> 2 hours ago, PocketWraith said:\n> \n> Yes. You are supposed to do one or other of those two things. The choice of which you do is a matter of personal preference.\n\nHa! I love it.\n\n> On 6/6/2018 at 3:57 PM, tripecac said:\n> \n> Are we \"supposed\" to keep changing our decks for each new quest, or are we \"supposed\" to create a single deck that can beat every quest [in a cycle]?\n\nThe beauty of this game is that you can, by and large, play the game however you like, with whatever restrictions you like.  I've done both.  Sometimes I build decks for a quest.  Sometimes I build decks and then test then against a number of quests. Right now, I'm running a narrative campaign where I follow mostly the same heroes through every quest in the game, and I love the story feel. Whatever way feels most fun to you, play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3367580","commentId":3367580,"userName":"iLiveAGAIN","timestamp":1528509081,"content":"> On 6/4/2018 at 3:24 PM, tripecac said:\n> \n> I remember a few years ago this forum seemed a lot busier.  Does this mean LotR LCG fandom is in a decline?  That seems odd, since outside of this forum I am noticing more and more interest in it\n\nmost of the players with interesting things to say and stuff got banned when one of the fanboys got promoted to community leader... after that he banned everyone he disagreed with. It wasn't exactly SWJ, it was before that.. but it was during the formation of that brutally fascist thing you see a lot of nowadays when everything must be sanitised and conform or you get banned, bullied and harassed because somehow no one should ever feel offended about anything ever. Think like them or **** off.\n\nBasically the entire community starved and slowly turned into what you see now. It was destroyed through miss management. Added to that the game is like nearly a decade old.. so if you are doing the exact same thing now as 10 years ago, you need to re-evaluate your life.\n\nThat being said I have been around from day 1 of the announcement.. but have been lurking on and off for last 5 years or so. (this is my 1st day posting in years) There is just nothing left to say and despite some old school greats like Spleen or PsychoRocka not many of them are still about... very little is said here that has not been said before, nor is there much encouragement for the kind of stuff we used to get.. like 100 page threads on the nature of evil and stuff.\n\nFinally a lot of the tech discussion that brought a lot people here is now on RingsDb directly in the deck threads.\n\n \n\nrichsabre, Glaurung, Mitch the One, Alogos,  Tracker1, Danpoage ... . . .\n\nEdited June 9, 2018 by iLiveAGAIN"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3367853","commentId":3367853,"userName":"Wandalf the Gizzard","timestamp":1528547584,"content":"@iLiveAGAIN [https://community.fantasyflightgames.com/profile/245556-iliveagain/] Is that you Booored?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3367899","commentId":3367899,"userName":"GrandSpleen","timestamp":1528552328,"content":"There is little doubt."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3367917","commentId":3367917,"userName":"Bullroarer Took","timestamp":1528554473,"content":"Seems like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3367939","commentId":3367939,"userName":"Wandalf the Gizzard","timestamp":1528555848,"content":"Well, about time this soft community got some of its good old sourness back into it. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI don't know anything about mismanagement (other than reprint schedules, but that's in Asmodee's court), and if this friendly community's state looks bad to you, then maybe you should find a different one. quite a few \"old school greats\" are still around and there are quite a few new ones, too. No disrespect to you, but we're not looking for another flame war, so if you're hankering for a fight, I'm sorry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277151-why-is-this-forum-so-quiet/?do=findComment&comment=3368507","commentId":3368507,"userName":"Nickpes","timestamp":1528610194,"content":"> On 6/7/2018 at 3:08 AM, Devaresh said:\n> \n> I like to keep the same heroes and as much of the same deck as I can in my first go through a cycle but I do keep a small side board of things to switch in as needed.\n\nThats what I am doing too. Choosing a set of Heroes, trying to be thematic as possible, and then build my deck (again trying to be thematic) but if I find a quest to be unbeatable with my setup I will change things as needed "}]}