{"url":"https://community.fantasyflightgames.com/topic/277265-immune-to-player-cards-and-healing/","title":"Immune to player cards, and healing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277265-immune-to-player-cards-and-healing/?do=findComment&comment=3361853","commentId":3361853,"userName":"Boromore","timestamp":1528232720,"content":"I know there have been rules on allowing Dori and Honour Guard to cancel damage on cards immune to player effects (such as hero Beorn). I've assumed that was because the damage isn't placed if cancelled. But what is the situation about healing on immune cards? \n\nI had assumed healing was NOT allowed, but I've just come across the following section in the online rules (my emphasis):\n\n\"Immune\n\nIf a card is immune to a specified set of effects, it cannot be chosen as the target for or affected by effects that belong to that set.\n◊\nImmunity only protects the immune card itself. Peripheral entities (such as attachments, tokens on the card, and abilities that originate from the immune card) are not themselves immune.\"\n\nIf that includes damage tokens, can they be healed? Or does any attempt fail on the basis that the healing needs to target the immune charatcer (hero, objective-ship, etc) rather than the token?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277265-immune-to-player-cards-and-healing/?do=findComment&comment=3361895","commentId":3361895,"userName":"NathanH","timestamp":1528234259,"content":"It doesn't work because effects only target tokens when the designers have randomly decided that they do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277265-immune-to-player-cards-and-healing/?do=findComment&comment=3362120","commentId":3362120,"userName":"Boromore","timestamp":1528241346,"content":"Well, made me laugh! (Which is more than Race across Harad solo is doing)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277265-immune-to-player-cards-and-healing/?do=findComment&comment=3362264","commentId":3362264,"userName":"Wandalf the Gizzard","timestamp":1528248997,"content":"> 4 hours ago, NathanH said:\n> \n> effects only target tokens when the designers have randomly decided that they do.\n\nAs is the case with Proud Hunters/Beorn."}]}