{"url":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/","title":"Legolas (core) vs Misty Mountain Goblins","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/?do=findComment&comment=3368727","commentId":3368727,"userName":"bitzurock","timestamp":1528644864,"content":"Both cards refer to add/remove tokens on the current quest. But i read that actually \"current quest\" means also a active location for Legolas, but for Misty Mountains Goblins, the active location is not taken into account and the token should be removed from the current quest? Is that right? And are there any cards related to the \"current quest\" that actually affect or not the active location?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/?do=findComment&comment=3368735","commentId":3368735,"userName":"GrandSpleen","timestamp":1528645868,"content":"You are correct-- the active location acts as a buffer for the quest, so if as card effect instructs you to place progress on the quest, the active location will act as a buffer. So Legolas' tokens will go on the location first.\n\nIf a card effect instructs you to remove tokens from the quest, there is no buffer to consider.  So Misty Mountain Goblins will remove progress tokens directly from the quest card even if there is an active location with progress tokens on it.\n\nThe only time a card effect will directly place progress tokens on the quest, even if there is an active location, is when the card uses the language \"bypassing the active location.\"  \n\nThere are other cards that place progress on the quest, such as Gondolin Blade, and they work the same way that Legolas does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/?do=findComment&comment=3368736","commentId":3368736,"userName":"bitzurock","timestamp":1528645980,"content":"Thank you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/?do=findComment&comment=3368895","commentId":3368895,"userName":"NathanH","timestamp":1528660141,"content":"According to a reply from Caleb (regarding the Battle of Pelennor Fields quest):\n\n> Quote\n> \n> The active location only serves as a buffer to player card effects and progress made from questing successfully.\n\nSo according to this, an encounter card effect that places progress on the current quest will bypass the active location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277563-legolas-core-vs-misty-mountain-goblins/?do=findComment&comment=3369242","commentId":3369242,"userName":"GrandSpleen","timestamp":1528686264,"content":"Good to know!"}]}