{"url":"https://community.fantasyflightgames.com/topic/277579-1-core-set/","title":"1 core set","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3368997","commentId":3368997,"userName":"signoftheserpent","timestamp":1528666608,"content":"Do you get enough cards in 1 copy to properly build decks, or is it a fudge just for tutorial purposes as is the case with most of these games?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3369010","commentId":3369010,"userName":"Wandalf the Gizzard","timestamp":1528667307,"content":"Technically, you have enough cards to build tournament legal decks with just one core set, but you’ll have enough trouble trying to build viable thirty card decks. I would advise getting two, if not three to round out a full collection. One is possible, which is what I started with, but by no means easy; which is saying a lot about this brick wall of a game.\n\nExpansions for this game always come with a full card count, though. No need to by multiples unless you want multiple decks with all three copies of the same card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3369075","commentId":3369075,"userName":"icabod","timestamp":1528670886,"content":"I have a single core set, and I decided to get some of the adventure packs to help with my deck building, just to give more options.\n\nThe main issue with the core set is that there are several great cards that you only get one of. Some people have printed out copies of these cards, and put them in sleeves with an unused card as the \"back\". So if you sleeve your cards that could be an option."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3369114","commentId":3369114,"userName":"Rouxxor","timestamp":1528673187,"content":"It is for tutorial (mirkwood) and some regular games (Anduin). And an impossible scenario in solo (escape from dol guldur). You can easily play 10 hours on it, but the urge to get more cards will come after that. I recommend to buy adventure packs way before additional core set though. It increase deck building abilities AND give you new scenario to play.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3369176","commentId":3369176,"userName":"Onidsen","timestamp":1528680437,"content":"These days, the card pool has many more options that can fill in for the powerful one-ofs from the core set. Multiple core sets are absolutely not necessary to make effective and fun decks. The only reason to get multiple core sets is if you want to build specific power decks, and you can easily just print off or proxy the few cards you'd need for that.\n\nDefinitely go for adventure packs before you get a second core set."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277579-1-core-set/?do=findComment&comment=3369610","commentId":3369610,"userName":"dalestephenson","timestamp":1528728450,"content":"A second reason to get multiple core sets is if you expect to eventually be supporting 3+ players with your card pool.  The extra tokens and threat tracker will come in handy, and the extra player cards may be less redundant.\n\nThat aside, I would endorse the majority opinion here -- while getting more core sets has some value, buying expansions will give you more player cards *and* more quests.  I don't regret buying a second core set (on sale) for my own use, but I would never recommend getting it *instead* of expansions.  Some day I may get a third core set if the price is right so that I can have a third copy of Unexpected Courage and Dwarven Tomb -- but the marginal increase in utility from having 3x instead of 2x isn't that dramatic, and the increase in variety of play and deckstyles from it is nonexistent.  The same is true going from one core to two cores -- it's better to have three copies of Test of Will or Steward or Gondor or other staples from the core set, but it will make your decks more efficient, not fundamentally different, while providing more copies of a whole lot of cards who don't need more copies.  Meanwhile adding expansions allows you to make *different* decks, and also play new quests.  Win-win.\n\nSo when just starting out and playing solo, I'd strongly recommend sticking with one core set at least until you've fully bought into the game.  One core set won't let you build a solid 50-card deck -- so don't worry about getting to 50 card decks until you have more expansions."}]}