{"url":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/","title":"LotR LCG - Meta-game / Campaign Ideas","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3371835","commentId":3371835,"userName":"tripecac","timestamp":1528866505,"content":"I would love to see FFG create an official meta-game linking together the various cycles while at the same time going beyond the current, somewhat shallow \"campaign rules\" (which seem to add challenge but not much else).\n\nFor example, it would be neat if the meta-game would include include a map showing where each quest takes place.  You'd put your token on that map to provide a visual indicator of your progress through a cycle (and the campaign).  As you start each new quest, you'd read set of quest-specific instructions in the \"meta-manual\" (or \"campaign manual\").  And here's where it gets interesting.\n\nFor one thing, I like the idea of having to \"earn\" new player cards by beating quests.  This could tie into the difficulty quite nicely.  For example, maybe if you beat a quest in Easy Mode, you earn 1 copy of a new player card.  If you beat it in Normal Mode, you earn 2 copies.  And if you beat Nightmare Mode you earn all 3 copies.  So, you can either beat Easy Mode multiple times (which is ideal for people learning the game), or try to \"blitz\" through the campaign in Nightmare Mode (ideal for experts).\n\nI also think it would be interesting if the campaign would force certain decks on you at times.  For example, imagine if the campaign forces you to play Conflict at the Carrock with a Hobbit-themed deck.  Or maybe you get more rewards for beating a quest with certain deck constraints.  And here's the interesting thing: the deck constraints don't necessarily have to make the quest HARDER.  They can actually be a way to teach you different styles of decks.\n\nAlso, the campaign could rebalance some of the notorious quests.  For example, it could direct you to play \"Escape from Dul Guldur\" one-handed, but with 4 hero cards instead of 3.  This would make that quest beatable solo, and since this instruction would be \"official\", it wouldn't feel like \"cheating\".\n\nAnd between each quest there could be a nice set of narration and illustrations (deeping the immersion), and perhaps also some tips and FAQs (some general, some pertaining to the quest).  This sort of meta-information would make the \"campaign book\" act a bit like the \"casual companion\" book idea I mentioned several years ago:\n\nAnd, while they're at it, they could include copies of any errata'ed cards in the campaign pack, so that we can swap out our old cards for the corrected ones and not have to remember which cards have which errata. \n\nDo you see what I'm getting at here? \n\nA well-planned campaign pack would be a huge boon, providing the following:\n\n- a deeper story\n- a better sense of geography (via a cool looking map)\n- a tangible reward for beating a quest (access to new player cards and advancement on the map)\n- a natural way to reward higher difficulties (while encouraging newer players to stick with a quest longer, gaining familiarity with it)\n- an introduction to different types of deck builds we might not normally use (ideal for teaching)\n- a genuinely fun incentive for people to buy more (or possibly ALL) of the packs, thus ensuring long-term health of the game\n\n \n\nEdited June 13, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3371931","commentId":3371931,"userName":"Yepesnopes","timestamp":1528878007,"content":"I love this aspect in Arkham lcg and I would like very much a similar implementation in the LotR lcg"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3372083","commentId":3372083,"userName":"sappidus","timestamp":1528894233,"content":"Did you notice this little tidbit in FFG's recent State of the LCG post?\n\n> Quote\n> \n> Q: If you could do one thing to improve the game experience, what would it be?\n> \n> Caleb: Campaign play has been very successful and well-received with the saga expansions. Lately I’ve been thinking quite a bit about how we might be able to do more with that idea.\n\nPersonally, while it would clearly be cool, I hope that any campaign expansion remains optional (in the fashion of the Sagas). The essentially required nature of campaign play in most of AHLCG was one of the reasons I didn't delve into it further. One of the appeals of LotR to me is matching player deck(s) and a quest on a whim and seeing how I do—a mandatory campaign limits the scope of doing that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3372397","commentId":3372397,"userName":"tripecac","timestamp":1528907390,"content":"I like the idea of a campaign which focuses on limiting scope in creative and inspiring ways.  For me, the sheer number of options in LotR LCG is intimidating, so anything that can server as a scope-limiting \"guide\" is welcome!\n\nBy \"campaign\" (or \"meta-game\") I'm thinking along the lines of a series of thoughtful tutorials and challenges connected by a narrative (and a visual progress indicator taking the form of a map).  I also like the idea of a \"reward only\" system, where there is no punishment for losing a quest, but there is a reward based on your chosen difficulty.  A very natural reward would be access to new player cards.\n\nI'm not really thinking about hero/item/ally continuity between quests.  Perhaps that could be part of a cycle or two, but to me, enforcing the \"legacy\" style of gameplay primarily serves to reward consistently good (min/max) players and punish the rest of us.  It's especially unappealing to those of us who are trying to introduce other people to the game (such as our kids).\n\nWith a gentle, \"reward only\" system, if my kids drop in for a quest here and there during my \"campaign\", I wouldn't feel like there's anything \"at stake\" if we lose that quest.  This is a good thing, because it helps keep LotR relaxing and encourages frequent play.  A punitive legacy system would do the opposite of that.\n\nSo, I hope when FFG thinks about \"campaign play\" they are thinking about the opportunity to create a relaxing, educational, encouraging guided tour of Middle Earth rather than a stressful min/max slog. \n\nEdited June 13, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3373738","commentId":3373738,"userName":"Authraw","timestamp":1528996177,"content":"Are you familiar with The Tale of Years mod by @banania [https://community.fantasyflightgames.com/profile/252848-banania/]? It might be up your alley:\n\nhttps://boardgamegeek.com/thread/1214867/tale-years-mega-campaign-mode-lotr-lcg [https://boardgamegeek.com/thread/1214867/tale-years-mega-campaign-mode-lotr-lcg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3374116","commentId":3374116,"userName":"tripecac","timestamp":1529016518,"content":"That's really cool, and is KINDA close to what I had in mind.\n\nThe main differences would be:\n\n1) Each quest would have its own page (or, better yet, two facing pages).  This would make it easier to find quests (especially if pages were color-coded by the expansion/cycle).  Also, there would be plenty of space for not only the quest-specific rules (card constraints, reward cards, difficulty options, etc.) but also \"fluffy\" stuff like maps, images, flavour text, tips, FAQs, etc.  I've seen other campaign-based game manuals that show one quest per page and they look awesome.  And I think \"looking awesome\" and \"fluffy stuff\" is a key part of increasing the immersion.\n\n2) The appendix-like material would be at the end of the book rather than the beginning.  I'm referring to the timeline, the reasons the rules were created, etc.  Ideally the book would start with narrative, mood-setting text and images, getting you psyched about playing. \n\n3) I would remove the hero/item/ally persistence rules (such as the fallen deck), because, as I pointed out earlier, I feel like legacy-style penalties add stress and discourage experimentation.  For me (and perhaps others), this game is TOO HARD to enjoy casually.  Especially if you have kids who are interested in playing occasionally.\n\n4) I would remove all custom cards.  The game has enough cards.  The only cards I'd like to see included are errata'ed cards. \n\n5) I would avoid messing with victory points.  If I remember correctly, some encounter cards and quest cards explicitly refer to \"victory points\".  It gets confusing if the encounter cards are talking about \"victory points\" and then the campaign rules are also talking about \"victory points\".  Either we have to keep track of two separate sets of \"victory points\" (quest-specific vs campaign-specific) or we en up with possible balance issues, where victory points earned at the campaign level interfere with the way a quest works.  Instead of rewarding the player with victory points (which act as currency) I would simply reward them with player cards.  Easy peasy.\n\n \n\nI think if you got rid of hero/item/ally persistence you could eliminate the need for a \"currency\" (victory points), which in turn lets you get rid of many (or even most) of the new rules introduced by that document.\n\nAlso, I think the thematic card constraints are interesting (like no eagles in Moria), but I would prefer to see those constraints limited to higher difficulties.  For casual players, having to frequently adjust the deck to adhere to thematic realism is a bit of a pain; they'd probably rather tackle the next quest with the same deck they already have, only swapping in player cards they earned as rewards.  It's more fun to make your deck better than make it worse.\n\n \n\nAside from that, I like the chronological ordering of the quests.  That's cool.  I just wish the sources of each quest would be explicitly listed (and color coded).  For example, it should be immediately obvious that Massing at Osgiliath and Assault on Osgiliath are not available in the same release.  You can bet if FFG were to make a book like this, they'd make the catalog item information very prominent!  And to me, that would be a good thing.  Not everyone has all the cards and quests, so knowing where to get them is a great help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277695-lotr-lcg-meta-game-campaign-ideas/?do=findComment&comment=3376136","commentId":3376136,"userName":"banania","timestamp":1529175332,"content":"That's a good deal of work. But I'd be interested in seeing that kind of thing. I've been claimoring for these things since the beginning of the game."}]}