{"url":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/","title":"Unofficial Official Rulings thread","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3373604","commentId":3373604,"userName":"sappidus","timestamp":1528990480,"content":"For some reason, FFG did not see fit to bestow this forum with an Official Rulings thread (like they did, say, here: https://community.fantasyflightgames.com/topic/277422-legend-of-the-five-rings-official-rulings/ [https://community.fantasyflightgames.com/topic/277422-legend-of-the-five-rings-official-rulings/),]), so I thought it might be useful to have an unofficial one for random little rulings that might not deserve an entire dedicated thread.\n\n(I encourage people to start a new thread if you do indeed want to discuss a specific ruling posted here, just to keep this thread clean.)\n\nEdited June 14, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3373608","commentId":3373608,"userName":"sappidus","timestamp":1528990625,"content":"I'll kick things off with a ruling on a new card.\n\nRe: Bartering... If you use it on a Scroll of Isildur, and you control 3 Lore heroes, is the cost of the next attachment played this phase reduced by 4, or by 1?\n\n> Quote\n> \n> The cost of the Scroll is 4. You reduce the cost to play it by 1 for each Lore hero you control, but you don’t actually reduce its cost while it’s in play.\n\nSo, say, Scroll -> Bartering -> Sword-thain for the princely sum of 1 resource should be doable. (At which point you can even play the Scroll again for free, heh.)\n\nEdited June 14, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3378535","commentId":3378535,"userName":"sappidus","timestamp":1529423435,"content":"This one makes perfect sense to me, but for the record:\n\nFundamentally this is a question about what happens when multiple effects have almost the same timing trigger, but resolving one makes the source of the other effect exit play...\n\nIn Dungeons of Cirith Gurat, I have 10 progress on stage 1B but a single guarded ally still in play. Then I rescue that ally. My understanding is that the constant effect of quest advancement MUST occur before the Forced effect of stage 1B. Does this mean:\n\nA. the Forced effect does not occur because its source is gone before it can trigger, or\n\nB. the Forced effect was queued up to fire because its trigger condition was met, and so it still does happen (after quest advancement).\n\n> Quote\n> \n> You are correct that constant effects resolves immediately when their condition is met, and this take priority over Forced effects. So if you already have the requisite progress needed to advance and the only thing holding you back is the one remaining captive, then you will advance immediately as soon as that last captive is rescued. As a result, the Forced effect on 1B will no longer be in play to trigger.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3378713","commentId":3378713,"userName":"JanB","timestamp":1529433133,"content":"@sappidus [https://community.fantasyflightgames.com/profile/251007-sappidus/]\n \nThanks for you asking .. i got an email, too.\nAsking more precisly:\n \nWe are at stage 1B with over 10 progress tokens on it. This stage cannot be defeated while guarded objectives are in play and has the following force effect: After any number of characters are rescued, reveal an encounter card.\nSeems very straight.\nSo .. we are in the quest phase and our current quest was a side quest. The active location was a prison cell with the last guarded objective attached.\nWe managed to quest successful and explore the active location and defeat the side quest.\nNow the question .. who do we resolve things?\n \nHere is how we done it:\na) the active location (prison cell) leaves play, because it is explored\nb) we defeat the side quest (has a response effect)\nc) we rescue the character from the prison cell\nd) we defeat 1B because we have no guarded objective left\ne) we do, whatever 2A says and flip to 2B\nf) we resolve the response effect from the defeated side quest\ng) we reveal an encounter card because of 1B forced effect, which was in play, when the active location was explored\n \nIs this order correct?\n \n> Quote\n> \n>  \n> \n> In the past I have ruled that progress is placed simultaneously on the active location and quest, but I am reversing that ruling because it was counter-intuitive and created a lot of questions. So from now on, the active location must be fully explored before placing any progress on the current quest. That means you will resolve any effects that trigger as a result of the active location being explored before placing any progress on the quest.\n> In your situation, that would mean: \n> 1. You explore the location and take control of the prisoner\n> 2. You immediately advance to stage 2A and resolve its ‘when revealed’ effect\n> 3. You finish placing progress onto your side quest\n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3379622","commentId":3379622,"userName":"Wandalf the Gizzard","timestamp":1529504730,"content":"4. You add the side quest to the victory display, if completed.\n\n5. You discard the explored location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3408860","commentId":3408860,"userName":"sappidus","timestamp":1531951000,"content":"Since this seems to be relevant lately:\n\n> Quote\n> \n> No, objective-locations do not count as locations when fulfilling the Guarded (location) keyword.\n> \n> I hope you’re enjoying Lost in Mirkwood!\n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558209","commentId":3558209,"userName":"sappidus","timestamp":1544021639,"content":"Resurrecting this idea…\n\n> Quote\n> \n> When you play an event from your discard pile with Map of Earnil, the event leaves your discard pile and resolves its effect, then you place it back in the discard pile. So, if there are 2 copies of Elwing’s Flight [in your discard] when you choose to play one with Map of Earnil, there will only be 1 in the discard pile when you resolve its effect.\n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558210","commentId":3558210,"userName":"sappidus","timestamp":1544021685,"content":"> Quote\n> \n> When you travel to location in Temple of the Deceived, the locations adjacent to the active location are considered to be in the staging area, but they are not \"added\" to the staging area. It's the same as when an enemy in the staging area is \"considered to be engaged\" with you but it has not actually engaged you. So, I'm afraid Thror's Key will not help you in Temple of the Deceived.\n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558212","commentId":3558212,"userName":"sappidus","timestamp":1544021788,"content":"Blast from the past this time... I'm sure you've gotten this question quite a bit. Wargs (OG Wargs, that is) have the text \"Forced: \"If Wargs is dealt a shadow card with no effect, return Wargs to the staging area after it attacks.\" (Very similar wording crops up on Lord Alcaron in his enemy form.)\n\n 1. Does \"a shadow card with no effect\" merely refer to the existence of text that says \"Shadow: ___\" on the card, or does it refer to the possibility of the effect changing the game state? e.g., in Conflict at the Carrock, Wargs could get Roasted Slowly as a shadow card, whose shadow effect is \"Shadow: If attacking enemy is a Troll, remove 2 damage tokens from it.\" Does this count as a shadow card WITH an effect, thus keeping the Wargs engaged?\n 2. Barring considerations such as #1, if you cancel the shadow card's effect with Hasty Stroke or whatnot, do the Wargs return to the staging area?\n 3. If you discard the shadow card before it ever resolves, and it turns out that shadow card had no shadow effect, do the Wargs return to the staging area?\n\n> Quote\n> \n> I love the old questions! Because I know how to answer them ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> \n> 1. A shadow effect is (and must be) denoted by the “Shadow:” text and bar graphic.\n> 2. If you cancel a shadow effect, the Wargs was still dealt a shadow effect.\n> 3. If you discard the shadow card from the Wargs before it attacks, then it never has the opportunity to trigger its effect.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558213","commentId":3558213,"userName":"sappidus","timestamp":1544021830,"content":"> Quote\n> \n> The first part of A Very Good Tale instructs you to shuffle your deck and discard the top 5 cards. You cannot alter the order that those cards are discarded in.\n> \n> \n> Cheers,\n> Caleb \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558215","commentId":3558215,"userName":"sappidus","timestamp":1544021862,"content":"> Quote\n> \n> If a player is eliminated while in control of something like The One Ring or an objective-ally with game text that will cause the players to lose if it leaves play, then the players will lose the game because all of the cards under that player's control are immediately removed from the game when he is eliminated.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558220","commentId":3558220,"userName":"sappidus","timestamp":1544022024,"content":"A question about stacking Doomed... You're playing Massing at Osgiliath and haven't crossed the Anduin. You're sitting at 30 threat with a ready Elfhelm ally out. During staging, you flop two consecutive copies of Massing at Osgiliath, then an arbitrary enemy. That 2nd copy of Massing has gained Doomed 1 [threat now 31], at which point Elfhelm says \"Nope!\" [30]. So far, so good. How about that last enemy? Either: The enemy has gained a total of Doomed 2; that hits [32], and Elfhelm triggers [31]. Or: The enemy has gained \"Doomed 1, Doomed 1\"; the first Doomed hits [31], and Elfhelm triggers [30]; then the second Doomed hits [31], and Elfhelm triggers [30]. Different outcomes. Which one actually happens? (A similar question might be generated for stacked Toughness.)\n\n> Quote\n> \n> If a card gains two instances of Doomed, then it has Doomed 2. In the situation you described, the enemy revealed would have Doomed 2 forcing you to raise your threat by 2, then Elfhelm would reduce it by 1.\n> \n> \n> Cheers,\n> Caleb\n\n(This is actually in RR Keywords now, but I still thought I'd mention it.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558225","commentId":3558225,"userName":"sappidus","timestamp":1544022169,"content":"Haradrim Elite says: \"Forced: When Haradrim Elite enters play, it makes an immediate attack from the staging area against the first player.\" What if you pull one of these guys with a Dunedain Hunter or the new Wait No Longer? Is he engaged with you when he makes his attack against the 1st player? Or in the staging area? Both? Does he make his attack at all?\n\n> Quote\n> \n> Haradrim Elite was written to explain its effect at a time before Dunedain Hunter existed. Around the time that Heirs of Numenor was released, the design team was receiving questions about enemies that made immediate attacks as part of their \"when revealed\" effects. Players wanted to know: \"Does this mean it engages me?\" The answer was always: \"No, not unless its text says it engages you first.\" But the questions kept coming, so the Haradrim Elite received an extra bit of text to clarify that it attacked \"from the staging area.\"\n> \n> \n> Unfortunately, that bit clarification complicated how it interacts with the player cards you mentioned, but it's really not that bad: the enemy will still make an attack, since it has entered play. It is still engaged with you, since nothing explicitly says to move it anywhere else, but its attack will be considered to come from the staging area. \n> \n> \n> The last part is similar to an enemy that is in the staging area but is considered to be engaged with a player. For the duration of the attack, the Haradrim Elite is still engaged with you, but considered to be in the staging area. That may or may not make a difference depending on what card effects are active, but that's how it will resolve.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558226","commentId":3558226,"userName":"sappidus","timestamp":1544022196,"content":"> Quote\n> \n> Yes, you can use Good Meal to reduce the cost to play Stand and Fight by 2. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558230","commentId":3558230,"userName":"sappidus","timestamp":1544022274,"content":"Can you trigger the Erebor Guard's Response (lowering his cost) if you're playing him off the top of your deck with hero Gandalf? The possible issue is that, even if considered part of your hand, the Erebor Guard is still the top card of the deck, so does triggering his Response discard himself but still work? Does it discard the two cards below him? Can you not trigger it at all? If you CAN trigger it, when do you decide on whether you even want to trigger the Response? Gandalf's passive ability \"instantly\" turns the top card of your deck faceup, so perhaps I would use that information to decide whether I want to use the Response or not, if the timing allowed for that.\n\n> Quote\n> \n> Gandalf’s ability lets you play the top card of your deck “as if it was in your hand.” When you play a card from your hand, you place it in front of you and pay its cost before resolving the card. For the instant it takes you to play a card, it is not in your hand or in play - it is being played. \n> \n> \n> So, when you play Erebor Guard, you place it in front of you, pay its cost, and resolve playing the card. Therefore, it is not the top card of your deck when you play it and it cannot be discarded by its own effect.\n> \n> \n> You would, however, immediately turn the top card of your deck faceup as you are playing Erebor Guard with Gandalf’s ability, and that would allow you to decide whether or not you want to resolve the Guard’s Response effect.\n> \n> \n> Cheers,\n> Caleb\n\n(This one still blows my mind.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558231","commentId":3558231,"userName":"sappidus","timestamp":1544022313,"content":"> Quote\n> \n> Exhausting The One Ring and spending 1 fellowship resource is the cost you have to pay in order to trigger Frodo’s cancel ability. That means The One Ring is exhausted when you resolve Frodo’s ability. Therefore, you cannot use Frodo to cancel The Ring Draws Them.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558232","commentId":3558232,"userName":"sappidus","timestamp":1544022358,"content":"If I reveal In Need of Rest at a time when no heroes are committed to the quest, does the treachery whiff entirely? Or did I still have to attach it to a hero (of my choice)? The \"that hero\" of the phrasing gives me pause: does it refer to a hero that's been removed from the quest by the first clause of the effect, or to simply \"a hero\" (with the first clause whiffing but the second clause still able to fire)?\n\n> Quote\n> \n> If there is no questing hero, then In Need of Rest will fail fizzle because there is no eligible target.\n> \n> \n> Cheers,\n> Caleb\n\n \n\nEdited December 5, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558234","commentId":3558234,"userName":"sappidus","timestamp":1544022395,"content":"> Quote\n> \n> No, you cannot exhaust [hero] Beorn to pay for player card effects because choosing him to be exhausted is a form of targeting him, and his immunity prevents him from being targeted by player card effects.\n\n \n\nEdited December 5, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558237","commentId":3558237,"userName":"sappidus","timestamp":1544022455,"content":"> Quote\n> \n> A card with Guarded X must always be attached to the specified card type when it enters play. There is no way to cheat around this unless a card effect specifically tells you to ignore it (ala the Dragon Hoard in The King’s Quest.)\n> \n> \n> The Golden Rule does not override the Guarded X keyword because the keyword itself is card text. \n\nEDIT: Stolen from a ruling given to @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/], somewhat more detail on the precise sequence of occurrences in an oft-asked case… \n\n> Quote\n> \n> You cannot “cheat” guarded attachments. The guarded keyword triggers after it enters play; so no matter what you do, you will have to attach it to an enemy or location. In the case of Well-equipped, it would attach to the Dwarf for a hot second before forcing you to mill for an enemy or location and attach it to that encounter card.\n\n \n\nEdited March 14, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558241","commentId":3558241,"userName":"sappidus","timestamp":1544022531,"content":"If you use a Scroll of Isildur to play Rumour from the Earth and return the Rumour to your hand, does the Scroll's bottoming ability still apply? i.e., does that ability still have \"access\" to the hand (a different out-of-play area than the one explicitly referred to on the card, the discard pile)? (This is all assuming you can even return the Rumour to your hand despite it not having originated from there… But I assume this is doable; otherwise, the Silvan bounce effects would be greatly neutered by the fact that Tree People puts Silvans on the board who have never been in your hand.) \n\n> Quote\n> \n> The passive effect created by Scroll of Isildur does not resolve until after you finish resolving the effect of the event you chose to play. That means if you chose to play Rumor from the Earth and pay 1 to return it to your hand, you would then have to place it on the bottom of your deck.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558243","commentId":3558243,"userName":"sappidus","timestamp":1544022579,"content":"> Quote\n> \n> Gandalf’s ability does not combo with Hirgon or Thranduil because they only target allies in your hand. Gandalf’s ability only makes the top card of your deck count as if it were in your hand at the time that you play it. That means it only works when you would normally play that card. To play an ally with Gandalf’s ability requires you to play it during the planning phase.\n> \n>  \n> \n> Cheers,\n> \n> Caleb\n\n(Ouch!)\n\nEDIT: @naverag [https://community.fantasyflightgames.com/profile/290622-naverag/] further interprets this ruling thusly, which I thought was well-put: \"…Gandalf's ability only modifies the framework effect of playing cards from your hand, whereas Hirgon and Thranduil create non-framework opportunities to play cards from your hand.\"\n\nEdited April 18, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3576681","commentId":3576681,"userName":"sappidus","timestamp":1545945388,"content":"So, Wild Stallion is a very cool card. Its new mechanic has brought up a couple of questions:\n\n1. Once you have attached it to an ally, does it retain its Planning Action to enable it to attach to another ally in the future? Or does it lose all of its original abilities, totally replaced by the \"Counts as\" text?\n\n2. If the ally riding a Stallion leaves play, would Spirit Bard be able to return the Stallion to its owner's hand? Or does it lose the attachment type before that can happen?\n\n> Quote\n> \n> 1. It’s planning action is only active while it is an ally. Once you attach it to an ally, then it becomes an attachment and only its attachment text is active. 2. Wild Stallion can be returned to your hand with Bard’s ability because it counts as an attachment at the time you check for his Response.\n> \n> Cheers, Caleb\n\nEdited December 27, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3586985","commentId":3586985,"userName":"Yepesnopes","timestamp":1547109065,"content":"> On 12/5/2018 at 4:02 PM, sappidus said:\n> \n> Haradrim Elite says: \"Forced: When Haradrim Elite enters play, it makes an immediate attack from the staging area against the first player.\" What if you pull one of these guys with a Dunedain Hunter or the new Wait No Longer? Is he engaged with you when he makes his attack against the 1st player? Or in the staging area? Both? Does he make his attack at all?\n> \n>  \n\nDoes it mean Harad elite triggers Sam and Pippin abilities? Does it mean you can use feint on him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3587046","commentId":3587046,"userName":"dalestephenson","timestamp":1547120562,"content":"Since the ruling was that he was actually engaged (and remained engaged), even though considered to be in the staging area for the purpose of his attack, he would certainly trigger Sam or LoPippin's responses.\n\nHowever, Feint would not work even if Haradrim Elite had been pulled by a play of Dunedain Hunter in the combat phase.  The attack is forced when it enters play, so before you could play an action the attack would have already begun and could not be cancelled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3587409","commentId":3587409,"userName":"Yepesnopes","timestamp":1547143356,"content":"> 6 hours ago, dalestephenson said:\n> \n> Since the ruling was that he was actually engaged (and remained engaged), even though considered to be in the staging area for the purpose of his attack, he would certainly trigger Sam or LoPippin's responses.\n> \n> However, Feint would not work even if Haradrim Elite had been pulled by a play of Dunedain Hunter in the combat phase.  The attack is forced when it enters play, so before you could play an action the attack would have already begun and could not be cancelled.\n\nSam and Pippin just became insanly good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3593751","commentId":3593751,"userName":"sappidus","timestamp":1547668118,"content":"AFAIK your most recent major ruling on progress placement during quest resolution is the following: \"So from now on, the active location must be fully explored before placing any progress on the current quest. That means you will resolve any effects that trigger as a result of the active location being explored before placing any progress on the quest.\"\n\nWhat if the current quest changes as a result of exploring the active location? e.g., Quest 1B of The Withered Heath has 6 progress, no Dragon Sign in the victory display but the active location is guarding a Dragon Sign. I successfully quest with a margin of 1 progress above what it takes to explore the active location. If I'm reading it right, your ruling above indicates that I should place the progress that explores the active location—leaving 1 pending—which frees up the Dragon Sign, which goes to the victory display as a constant effect, which lets the constant effect of quest 1B fire, which advances the current quest to quest card 2. I still have 1 progress pending.\n\nDo I place it on quest 2B? Or was it \"assigned\" to quest 1B, which is no longer around, therefore losing me that progress? Thanks!\n\n> Quote\n> \n> Progress is still placed on the active location and the quest simultaneously. What I addressed in my ruling was the order of resolution from that point. In the past, I interpreted the rules very strictly as written by insisting that if there was enough progress on the quest to advance that players should do that before resolving anything to do with exploring the active location. That proved to be very unintuitive, so I reversed my ruling to say that players should first resolve any consequences of exploring the active location, and then resolve the progress on the quest. \n> \n> However, since the progress is still placed simultaneously, if exploring the active location should cause you to advance to the next stage, any progress you had placed on the previous stage will be lost.\n> \n> Great question! I will make sure that the next FAQ update includes this information.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3600546","commentId":3600546,"userName":"sappidus","timestamp":1548197518,"content":"This is a wild one…\n\nFor Lost in the Wild (WoR 26), what happens if you try to...\n\n * put it into your deck with ally Gildor? (Can a card with an encounter card back enter your deck?)\n * use Message from Elrond to send it to another player? (Does Lost trigger after it has changed hands? For whom? I am thinking of Rider of the Mark here. And at the end of the round, if it's still in hand, is it shuffled into the encounter deck?)\n\nThanks!\n\n> Quote\n> \n> There are currently no rules that prevent you from putting Lost in the Wild into your player deck via Gildor’s ability, or putting it in another player’s hand or deck [sic?] via Message from Elrond. If you did move Lost in the Wild into another player’s hand with Message from Elrond, it would not trigger because it reads “After you play a card…” and it would not be in your hand at that time. It wouldn’t trigger in your teammates hand at that time either because they have not played a card yet.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3628453","commentId":3628453,"userName":"sappidus","timestamp":1550594914,"content":"If I am playing true solo, and Lightless Grotto is the active location with only 1 progress needed to explore it, what happens if I commit to the quest a character holding a Map of Rhovanion? Does the Forced on the Grotto trigger before the Response on the Map? Or are the timing triggers (worded subtly differently) not truly simultaneous?\n\n\n\n> Forced effects always resolve before Response effects when they share the same trigger. Since both the Grotto and the Map trigger “after” you commit characters to the quest, you must resolve the Forced effect on the Grotto first.\n> \n> \n> Cheers,\n> Caleb\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3629484","commentId":3629484,"userName":"sappidus","timestamp":1550683617,"content":"This one is courtesy of Ian from Tales from the Cards, who asked whether a Keys of Orthanc granted Doomed 1 via Gríma could thus trigger itself…\n\n\n\n> No. The Keys of Orthanc must be in play at the time you play a doomed card in order to trigger its effect.\n> \n> Cheers,\n> Caleb\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3637638","commentId":3637638,"userName":"sappidus","timestamp":1551472576,"content":"And this one is courtesy of @Onidsen on the CotR Discord…\n\nHey Caleb - got a rules question for you: When discarding multiple cards from your deck due to a player card effect like A Very Good Tale or Erebor Soldier, we are instructed to put the cards in the discard pile in the order they are discarded. [Ed.: This ruling is reproduced earlier in this thread.] Based on the Rules Reference guide, this would indicate that the cards are not discarded simultaneously, because cards discarded simultaneously are put into the discard pile in the order a player chooses. This leads to my question.\n\nWhen using Dwarf Pipe to place a card that I have just discarded from my deck on the bottom of my deck, do I have to make that choice at the moment I discard the card? For example, if I discard 5 cards with A Very Good Tale, do I have to discard the cards one at a time, making the choice whether or not to exhaust the Dwarf Pipe with each card? Or can I discard all 5 cards for A Very Good Tale as a single instance, and then exhaust the Dwarf Pipe to choose one of the cards I just discarded and place it on the bottom of the deck? Thank you for the tireless work you put in on behalf of this amazing game!\n\n-Samuel\n\n\n\n> Hi Samuel,\n> \n> I would say the correct time to trigger the Response on Dwarf Pipe is immediately after you discard an individual card that you want to put on the bottom of your deck. This is based off the fact that when you discard Mithril Cache or Ered Luin Miner from the top of your deck, you immediately trigger the Response effect before continuing to discard cards. \n> \n> Cheers,\n> \n> Caleb\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3638162","commentId":3638162,"userName":"Onidsen","timestamp":1551548714,"content":"> 21 hours ago, sappidus said:\n> \n> And this one is courtesy of @Onidsen on the CotR Discord…\n\nThanks for compiling it here!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3639624","commentId":3639624,"userName":"sappidus","timestamp":1551754656,"content":"If an enemy with Followed attached changes engagement from with you to with one of your fellow players, does Followed keep on working, or not? As far as I understand, the owning player retains control of traps he played no matter where they travel around the table (thus the wording of Ambush, to skirt around this), so this is really a question about who the \"you\" on Followed refers to. Thanks!\n\n> Quote\n> \n> Control of Followed does not change when the attached enemy disengages you. The “you” on the card refers to the attachment’s controller. So if the attached enemy engages another player or returns to the staging area, you cannot trigger the effect anymore because it is not engaged with you.\n> \n> Cheers, Caleb\n\nEdited March 5, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3658466","commentId":3658466,"userName":"sappidus","timestamp":1553635420,"content":"Song-of-Mocking.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Dead-Marshes/Song-of-Mocking.jpg]\n\nSuppose I have two Songs of Mocking out: one on, say, Aragorn and one on Beregond. I trigger both of the Songs, each one targeting the other hero. What happens when Aragorn takes damage? Does the most recently-triggered Song take priority? Or do I get the choice of where to put the damage?\n\n\n\n> The way Song of Mocking is worded, it redirects damage that is assigned before it is applied. Once it is applied, it does not move. So if you have Aragorn use Song of Mocking to redirect damage to him from Beregond (and vice versa), any time Beregond would take damage from a source other than Song of Mocking it would be applied to Aragorn. And any time Aragorn would take damage from a source other than Song of Mocking, it would be applied to Beregond.\n\n\n\nTo editorialize here: this essentially seems to mean that Song of Mocking intercepts the dealing damage framework of RR Damage at step #2 (assignment) and directly places damage tokens on the attached hero at (the equivalent of) step #3, \"past\" the assignment step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3659156","commentId":3659156,"userName":"Amicus Draconis","timestamp":1553702066,"content":"Or it just creates an infinity loop and your game crashes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3659582","commentId":3659582,"userName":"GrandSpleen","timestamp":1553718593,"content":"> On 1/10/2019 at 10:02 AM, Yepesnopes said:\n> \n> Sam and Pippin just became insanly good!\n\nTo clarify, Haradrim Elite on his own will not trigger Sam and Pippin.  Wait no Longer and Dunedain Hunter may result in you being engaged with Haradrim Elite (or any other enemy), which would then trigger Sam and Pippin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3672910","commentId":3672910,"userName":"GrandSpleen","timestamp":1554839344,"content":"Here's one about Mount Gundabad:\n\nQuestion:\n\nHi, In Mount Gundabad, the instructions on the quest cards tell the player to flip from side 2A to side to 2B at the beginning of the quest phase. However, the rules insert says to do that at the beginning of the staging step, under the 'creating the quest deck' section (which parallels what players did in Flight from Moria). Which is correct? Thank you!\n\n \n\n> Quote\n> \n>  \n> \n> Response:\n> \n> The cards are correct. You should flip the quest cards over at the beginning of the quest phase.\n> \n> I hope you enjoy Mount Gundabad!\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3672954","commentId":3672954,"userName":"sappidus","timestamp":1554841099,"content":"Courtesy of The Purple Wizard on the CotR Discord… The question references an encounter card just released, so to respect not spoiling it, I will redact somewhat. The general principle seemed important to record, though.\n\nThe card in question contains a Forced effect of the form, \"After [trigger condition], [enemy] makes an immediate attack against each player with [another condition].\" Importantly, the phrase \"in turn order\", which often is in such effects, is not present on this card.\n\nThe question was regarding whether the attacks must occur in player turn order anyway.\n\n\n\n> I think it was reasonable for you to assume the “in turn order” was implied, but this is actually a case of “the first player decides.” As the core rules state, when there is more than 1 effect that would resolve at the same time, the first player decides the order they are resolved in. So if more than 1 player is going to be attacked as a result of the Forced effect…, the first player will decide the order in which those attacks resolve.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3679928","commentId":3679928,"userName":"sappidus","timestamp":1555383797,"content":"Citing this interesting ruling [https://community.fantasyflightgames.com/topic/262279-another-hideous-timing-question/?tab=comments#comment-3551373], I asked the following about enemies that make immediate Forced attacks after engaging:\n\nffg_MEC65_35.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_35.jpg]\n\nThere are two Ravenous Spiders (WoR 35) engaged with other players. I, with my low-threat deck, control an exhausted Sam. During the encounter phase, I play The Hammer-stroke, simultaneously engaging those two Spiders. Now, there are two Forced effects and two occurrences of Sam's Response that all share the same trigger condition. How does this end up playing out? Will I be able to get two defenses out of Sam? Just one defense, with doubly-boosted stats?\n\n> Quote\n> \n> The Spiders and Sam share the same trigger condition, but Forced effects always resolve before Response effects. So they do not all trigger at the exact same time. Here’s what will happen when you use Hammer Stroke to engage two Ravenous Spiders at the same time:\n> \n>  1. Both will trigger their Forced effects causing them to initiate an attack.\n>  2. The first player will decide which attack to resolve first.\n>  3. Immediately after the first Spider is dealt a Shadow card, Sam will ready and get + stats as this is the first opportunity for his Response to trigger. He will get the + stats bonus twice because you engaged 2 enemies with engagement cost higher than your threat, but he cannot ready more than once at the same time so the second ready is redundant.\n> \n> In the end, Sam’s ability will only allow you to get 1 defense from him, but with his stats boosted twice.\n> \n> Cheers,\n> Caleb\n\n \n\nEdited April 16, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3679942","commentId":3679942,"userName":"sappidus","timestamp":1555384965,"content":"If someone else puts a Curious Brandybuck into play under my control using its Response, then that player is eliminated… What happens when the active location is explored at some future time? Does the Brandybuck get removed from the game, or do I keep him? Thanks!\n\n\n\n> In the situation you described, the Curious Brandybuck would be removed from the game after you explored the location.\n> \n> Cheers, Caleb\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3690750","commentId":3690750,"userName":"naverag","timestamp":1556442210,"content":"Orcrist and Glamdring have the text \"After attached hero destroys an enemy, ...\". This is different in wording to all previous similar cards, which either say \"After attached hero attacks and destroys an enemy...\" or \"After attached hero participates in an attack that destroys an enemy...\". Does this mean that heroes with the ability to deal non-combat damage - Tactics Bilbo Baggins or Argalad, for example - could trigger the Responses on Orcrist and Glamdring if they destroyed an enemy through that non-combat damage?\n\n> Quote\n> \n> For the attached hero to destroy an enemy, it must attack and destroy that enemy. We just shortened the language to make it fit the card.\n> \n> Cheers, Caleb\n\nEdited April 28, 2019 by naverag"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3695852","commentId":3695852,"userName":"sappidus","timestamp":1556939599,"content":"ffg_MEC65_55.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_55.jpg]\n\nForked Passage has a Response you can trigger before resolving the Deep keyword. Among other things, this Response adds the card to the victory display. If you do this, are you supposed to still resolve Deep anyway? Or does the Deep trigger only if you decline to use the Response? Thanks!\n\n> Quote\n> \n> The Response on Forked Passage allows you to choose which of the top 2 cards of the Caves deck you will get after you travel to Forked Passage. The Deep keyword will resolve whether you trigger this effect or not.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3695854","commentId":3695854,"userName":"sappidus","timestamp":1556939844,"content":"I didn't doubt this would be ruled thusly, but I just wanted to nail it down…\n\nYou said in a Hirgon/Thranduil ruling that hero Gandalf only makes the top card count as if it were in your hand \"at the time you play it\". What about immediately after? That is, if using him to play a card off the top of your deck with an \"after you play [this] from your hand\" ability—e.g., West Road Traveller—can you trigger the ability?\n\n> Quote\n> \n> Yes, you can trigger the ability on West Road Traveler and other similarly worded effects when you play them from the top of your deck with Gandalf because you are playing them as if they were in your hand…\n> \n> Gandalf’s ability does not add the top card of your deck to your hand, which is why it does not work with cards that specifically target a card in your hand. But he does allow you to play that card as if it was in your hand, which will combo with the cards you mention.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3698806","commentId":3698806,"userName":"sappidus","timestamp":1557430611,"content":"The below set of rulings excerpts were obtained during an exchange between the Cardboard of the Rings hosts and Caleb. They were discussed during their podcast (episode 132, https://cardboardoftherings.com/2018/04/29/episode-132-the-bombur/ [https://cardboardoftherings.com/2018/04/29/episode-132-the-bombur/], around the 35:40 mark).\n\n> Quote\n> \n> The ‘phase ends’ box is when the phase ends. There is no ‘beginning of the end’ or ‘end of the end’ - it’s a single point in time. In the example you sent, you highlighted two options. Both are wrong. The phase ends the moment you reach item 3.5 “Quest phase ends.”\n\n> Quote\n> \n> You cannot trigger any effects that last until ‘the end of the phase’ during an attack that was initiated at the end of the phase. You could still trigger effects that last ‘for this attack.’\n\n> Quote\n> \n> If an effect lasts “until the end of the phase” then you must be in a phase in order to trigger that effect. This is consistent with A Game of Thrones where certain effects last “until the end of the challenge.” In that game, if a character is not in a challenge, then he cannot be the target of an effect that lasts until the end of a challenge. Similarly, if you are not in a phase, then you cannot trigger an effect that last until the end of a phase. \n> \n> This may reverse one or two previous rulings I have made about triggering effects outside of a phase, but it is the simplest answer and it helps to avoid other strange interactions.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3699650","commentId":3699650,"userName":"dalestephenson","timestamp":1557523448,"content":"So now end of phase tests are not in a phase at all!  It would have been so much easier just to treat the end of phase as inclusive to the phase, and \"until the end of phase\" as being active at the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3719090","commentId":3719090,"userName":"sappidus","timestamp":1560274139,"content":"Here's a doozy, again courtesy of @Onidsen [https://community.fantasyflightgames.com/profile/294647-onidsen/]…\n\nAssume that I have a warrior character equipped with the attachment Vigilant Guard as well as the Mithril Shirt. If I reveal Necromancer's Reach, which deals one damage to each exhausted character, may I choose to trigger the response on Vigilant Guard every time an exhausted character would take damage, and then reduce each of those instances of 1 damage by one with the Mithril Shirt, thereby doing no damage at all [?]\n\nIf I can do this, can I also do the same thing with archery damage, thus negating all of the damage as long add there are enough characters in play that I can assign only one damage per character?\n\n\n\n> The way Vigilant Guard and Mithril Shirt currently work, you can negate a ridiculous amount of damage. I think everyone forgot about Vigilant Guard during play-testing, including me. I expect this combo will take a hit when the next FAQ finally gets posted. It’s likely that Vigilant Guard will receive a limit of some sort that makes it impossible to redirect damage more than once per phase.\n\n\n\nAbuse while you can, kids!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3719092","commentId":3719092,"userName":"sappidus","timestamp":1560274221,"content":"One more from Onidsen:\n\nThe campaign resolution for the Black Gate Opens… says that if the first player controls Gwaihir at the end of the game, the players add the boon to the campaign pool. Does this mean that if the game ends with the player controlling Gwaihir  as second player, the players do not add the boon to the campaign pool? And if so, was this an intended interaction? Because it seems odd that whether or not you get the boon depends not only on whether or not you reveal it, and not only on whether you can keep it in play until the end, but also on the random chance of whether or not you end the game with Gwaihir controlled by the 'correct' player.\n\n\n\n> It was our intention that if Gwaihir was in play at the end of the game, the players would earn that boon. I think the original version of that Gwaihir had the language “the first player gains control of Gwaihir” so that if he was in play at the end of the game, the first player would always control him.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3724192","commentId":3724192,"userName":"sappidus","timestamp":1560976465,"content":"This one was shared by Marcelf on the CotR Discord, who asked if (the upcoming) Leadership Frodo's second sentence depended on paying the resource to trigger his 1st effect.\n\nmec77_card_frodo-baggins.png [https://images-cdn.fantasyflightgames.com/filer_public/cf/63/cf63d8f1-b41d-4130-af77-c3adc3132a07/mec77_card_frodo-baggins.png]\n\n> Quote\n> \n> The threat reduction is part of his Response effect. So if you do not trigger the Response effect, then you will not lower your threat for questing successfully.\n> \n> Cheers, Caleb\n\nFor hardly the first time, I am sympathetic with a @naverag [https://community.fantasyflightgames.com/profile/290622-naverag/] take: the \"spend 1 resource\" is the cost of triggering the Response—this is to be distinguished from the trigger condition of \"After Frodo commits to the quest…\". So if you do not pay the cost, you don't get to trigger any of the Response, in particular the 2nd sentence.\n\nA similar situation is seen with Gúthwinë's \"After attached hero is declared as an attacker, exhaust Gúthwinë to give that hero +2 Attack for this attack. If this attack destroys an enemy, return a Rohan ally from your discard pile to your hand.\" For further reading, see RR Initiating Abilities / Playing Cards: http://lotr-lcg-quest-companion.gamersdungeon.net/#Rule545 [http://lotr-lcg-quest-companion.gamersdungeon.net/#Rule545].\n\nEdited June 20, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3729101","commentId":3729101,"userName":"sappidus","timestamp":1561577991,"content":"This was shared on the CotR Discord back in 10/2017, but I'm not certain the text has ever been recorded here:\n\nWas I correct in assuming that you could stack Hirgon's ability with Theoden's to play a 2 cost ally for free? (By applying Hirgon's minimum 1 ability first, followed by Theoden's passive minimum 0 ability)?\n\n> Quote\n> \n> When you play an ally with Hirgon's ability, his reduction ability has to be applied first because it's part of his effect. That works out nicely for Theoden since reduction (to a minimum of 0) is then applied after.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3736493","commentId":3736493,"userName":"GrandSpleen","timestamp":1562685414,"content":"I asked a question about when a quest is considered \"defeated\" for the purposes of a card like The Road Goes Ever On: Is a quest card considered 'defeated' if no progress tokens are involved in advancing to the next stage of the quest? (Advancing via an effect printed on the quest card instead)... examples I include advancement when no enemies are in play during Into the Pit 2B, and all of the quest cards in Fate of Wilderland. \n\nAnd the response:\n \n\n> Quote\n> \n>  \n> \n> A quest is defeated when it has progress equal to its quest points. If a quest has game text that says “this stage cannot be defeated unless…” then that stage is defeated when it has no progress remaining and that condition is met.\n> \n> If a quest instructs the players to advance without making progress equal to its quest points, then that stage was not defeated.\n> \n> Cheers,\n> \n> Caleb\n> \n> \n> \n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3736619","commentId":3736619,"userName":"sappidus","timestamp":1562695243,"content":"Here's an intriguing one courtesy of @Jekzer [https://community.fantasyflightgames.com/profile/168482-jekzer/]:\n\nmec77_card_faramir.png [https://images-cdn.fantasyflightgames.com/filer_public/dc/81/dc81df79-88c0-4c27-baa5-0fb4ccd863ca/mec77_card_faramir.png]\n\nI have a question regarding the new spoiled Faramir (A Shadow in the East): if there's a trap unattached on my play area (i.e. Outmatched or Followed) at Planning phase, I play Faramir, engage an enemy and deal damage to that enemy... Do I deal 4 (because in the process of engagement you attach that trap) or just 2?\n\nReading Faramir card it says 'Engage that enemy AND deal 2 damage...' instead of 'Engage that enemy, THEN deal 2 damage...' Not sure if there's a chance to attach a trap if the wording is 'A and B' instead of 'A, then B'.\n\nThanks a lot!\n\n> Quote\n> \n> Both Followed and Outmatched created constant abilities while unattached in your play area. Constant abilities must be resolved instantly when their triggering condition is met, which means that they would be attached to the enemy the instant you engaged it. That means they will attach to the enemy at the same time that the damage is applied. Whenever two effects would resolve at the same time, the first player decides which one to resolve first. So it is up to you if you want to do 2 damage or 4.\n> \n> Cheers, Caleb\n\nEdited July 9, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3737130","commentId":3737130,"userName":"Amicus Draconis","timestamp":1562769562,"content":"I recently had an inquiry for Caleb regarding player cards, that may be added to the encounter deck:\n\nThe rules state, that every player may set up to 3 cards aside, which can potentially be added to the encounter deck: Ranger of the North, Wind from the Sea, Tom Bombadil and Eagle of the North. Now only Ranger Summons asks for \"1 of your set aside\" Rangers, the other events only ask for \"a set aside\" card. Does this mean, I can use cards in my deck, which target the set aside cards of other players, or may everyone only use his own set aside cards?\n\nThe answer I got was:\n\n> Quote\n> \n> You may target you﻿r teammates set-aside cards except in the case of Ranger Summons.\n> \n> Cheers, Caleb﻿\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3771946","commentId":3771946,"userName":"sappidus","timestamp":1566871187,"content":"Courtesy of @carlosm88 on the CotR Discord:\n\nffg_MEC71_148.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC71_148.jpg]\n\nQuestion about archery and Loyal Hound: When assigning archery damage how does Loyal Hound interact with it, more specifically:\n\n 1. Can I assign one archery damage on loyal hound and then discard it to prevent two archery damage on a hero?\n 2. Can I assign two archery damage on loyal hound and discard it before it dies to prevent to archery damage on a hero?\n 3. Can I assign one more archery damage to a hero than his/her HP, to then prevent it with Loyal Hound and bring back to less damage than HP, keeping the hero Alive?\n\n> Quote\n> \n> You cannot over-assign archery damage. You can only ever assign archery damage to a character equal to its remaining hit points. In the case of the Loyal Hound, you assign the archery damage before resolving it. Once it is assigned, you can use the Hound’s Response to discard it and cancel 2 damage that would be dealt to your hero. So if you assign 2 to the Hound and 2 to your hero, the Loyal Hound can essentially absorb 4 archery damage.\n> \n> Cheers, Caleb\n\n[Ed. note: Wow!]\n\nEdited August 27, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3794924","commentId":3794924,"userName":"sappidus","timestamp":1569624563,"content":"Asking about a card not actually released yet…\n\nIt's the Planning phase. I Sneak Attack a Silvan ally into play, then I play Host of Galadhrim. Does the delayed effect on Sneak Attack still \"see\" that same ally and thus return it to my hand at the end of the phase? Or did the process of resolving HoG make the game \"lose track\" of that ally (it left play briefly), thus letting it stick around having been played by HoG? Thanks!\n\n> Quote\n> \n> Sneak Attack says “if that ally is still in play” so I would say that if the ally is still in play at the end of the phase, it should be returned to your hand regardless of what happened to it during the phase.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3794925","commentId":3794925,"userName":"sappidus","timestamp":1569624703,"content":"If Glamdring/Orcrist is guarded by an enemy, and I kill the enemy and immediately attach the weapon to a hero that participated in the attack, is the weapon Response immediately triggerable?\n\n> Quote\n> \n> No. The Weapon must be attached when you resolve the attack in order to trigger its ability.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3795133","commentId":3795133,"userName":"NathanH","timestamp":1569660425,"content":"> 9 hours ago, sappidus said:\n> \n> Asking about a card not actually released yet…\n> \n> It's the Planning phase. I Sneak Attack a Silvan ally into play, then I play Host of Galadhrim. Does the delayed effect on Sneak Attack still \"see\" that same ally and thus return it to my hand at the end of the phase? Or did the process of resolving HoG make the game \"lose track\" of that ally (it left play briefly), thus letting it stick around having been played by HoG? Thanks!\n> \n>  \n\nDon't like this one. It seems much neater if a card that leaves play and then returns is treated as a completely unrelated card. Also leads to unresolvable situations: sneak attack a Silvan Ally, let's call it Bob, during planning, use The Tree People to return it to your hand. Play Drinking Song, shuffle your hand back into your deck and draw a new hand. This hand contains a copy of Bob. Is it the copy of Bob that the Sneak Attack is targeting, or not? We do not know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3795210","commentId":3795210,"userName":"sappidus","timestamp":1569680426,"content":"> 5 hours ago, NathanH said:\n> \n> [Sneak Attack'ed ally leaving play discussion]\n\nTo maintain the cleanliness of this thread, I'm splitting off specific discussion to here:\n\n \n\nEdited September 28, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3836651","commentId":3836651,"userName":"sappidus","timestamp":1574704501,"content":"Some contract clarifications obtained by @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/]:\n\nRegarding the \"Burglar's Turn\" contract: It says that if the attachment has the guarded keyword when you attach it to the active location, you ignore it. But when the active is explored it says to \"you may put each guarded attachment on that location into play at no cost\". Would you then trigger the guarded keyword on a guarded player card?\n\nRegarding the \"Grey Wanderer\" contract: If you start the game by choosing a guarded attachment as your one attachment, what happens? My understanding is that during the setup of the player cards, there is not yet an encounter deck with which to trigger the guarded keyword.\n\n> Quote\n> \n> ``````Burglar’s Turn bypasses the guarded keyword altogether. Once you explore that location, you can attach the guarded attachment to an eligible character.\n> \n> The Grey Wanderer has a Setup ability. This should be resolved after you do the Setup on the quest. There will always be an encounter deck at that point.\n> \n> Cheers, Caleb\n\nNote that the Grey Wanderer part of this ruling implies that contract Setup is resolved at a different time than hero Setup (after setup step #7 and at step #3, respectively). In particular, you already have your post-mulligan starting hand when you do the contract Setup.\n\nEDIT: Implied by the above, but an official small clarification from Caleb:\n\n\n\n> With regard to Grey Wanderer, yes you could end up with the card you want in your opening hand.\n\n\n\nEdited December 20, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3836776","commentId":3836776,"userName":"sappidus","timestamp":1574711441,"content":"Not a ruling, exactly—more of a verbal confirmation Caleb gave during a recent episode of Card Talk… (It also jibes with prior understanding of how this situation plays out, but it was nice to hear him state it plainly.)\n\nIf Sméagol is your last hero, and Stinker flips him to Gollum, you are not eliminated. Any damage that would be dealt from undefended attacks [framework step 6.4.3] while you're in this state evaporates into the ether.\n\nhttps://youtu.be/ri5AtxinPq4 [https://youtu.be/ri5AtxinPq4]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3838080","commentId":3838080,"userName":"RogueSeventeen","timestamp":1574849914,"content":"Some questions on The Burglar's Turn Contract answered:\n\n1) What happens when the Loot card you are about to put on a location is a unique item already in play? Do you place it out of play and draw a new Loot card for the location? Or do you place it out of play and the location gets no Loot card?\n\n2) The second part of the contract says “When the active location is explored, you may put each guarded attachment on that location into play at no cost, or add it to your hand.” What happens if you attach an item to a location by traveling there, but then the location is pushed back into the staging area by a card effect such as Strider’s Path and is explored in the staging area? Do you still get to put the guarded attachment into play per the usual Guarded Objective rules and merely do not have the option of adding it to your hand, or is it placed entirely out of play?\n\n> Quote\n> \n>  \n> \n>  1. The rules for unique cards will prevent the loot from entering play. That will unfortunately cause the effect to whiff that turn.\n>  2. Exploring a location out of the staging area will result in the attachments being discarded. The guarded keyword on attachments put into play by The Burglar’s Turn is ignored.\n> \n> Thanks for playing!\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\n \n\nEdited November 27, 2019 by RogueSeventeen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3839524","commentId":3839524,"userName":"nvbostwick","timestamp":1575044973,"content":"Looking for a ruling on how the cards Elf-Stone and Ranger Provisions work with the new Burglar's Turn contract. When would you get those card effects? I can see it happening as soon as the active location is explored? Or does it need to attach to another location after the active is explored and then when that subsequent location is explored you gain the benefits. Just looking for some clarity. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3840946","commentId":3840946,"userName":"dalestephenson","timestamp":1575302394,"content":"> On 11/29/2019 at 11:29 AM, nvbostwick said:\n> \n> Looking for a ruling on how the cards Elf-Stone and Ranger Provisions work with the new Burglar's Turn contract. When would you get those card effects? I can see it happening as soon as the active location is explored? Or does it need to attach to another location after the active is explored and then when that subsequent location is explored you gain the benefits. Just looking for some clarity. Thanks!\n\nBurglar's Turn contract prohibits the contract deck from having attachments in it, but nothing in it forbids other players from playing attachments on the active location.  Another player could add both Elf-Stone and Ranger Provisions to the active location -- this would result in the active location needing 4 more quest points, 3 from Burglar's Turn effect, and one from Elf-Stone's text.\n\nOnce explored, the forced effect on Burglar's Turn would deal with the attachment from the contract, then the responses to Elf-Stone and Ranger Provisions could be done.  As responses to the same trigger (clearing the active location) those two can be done in any order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3841075","commentId":3841075,"userName":"Amicus Draconis","timestamp":1575310506,"content":"I think, he asks, what happens, when you include Elf-stone and Ranger Provisions in the loot deck and attach them to the active location after travelling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3842017","commentId":3842017,"userName":"sappidus","timestamp":1575418309,"content":"(Besides what's explicitly asked, the below ruling also clears up things like the limit on ally Galdor in the context of triggering him off of hero Erestor's discard, which happens outside a round proper.)\n\nYou had a great interview on Card Talk the other day [https://youtu.be/ri5AtxinPq4 [https://youtu.be/ri5AtxinPq4]]. Thanks for that!\n\nIn it, you are asked about Spirit Dain and \"at the end of the phase\" attacks. You gave an answer that was quite clear, except the audio cut out a little at the end. So just to clarify:\n\nDain defends during the Combat phase, using his action 3 times. Then, an attack occurs at the end of the phase. If Dain is ready somehow and defends against this new attack, he can again use his action up to 3 times, with the \"limit 3 times per phase\" now applying to both this attack (not in a phase) along with the NEXT phase (in this case, the Refresh phase)…?\n\n> Quote\n> \n> You have it correct.\n> \n> Glad you enjoyed the interview. The Card Talk guys are great and real easy to chat with.\n> \n> Cheers, Caleb\n\nEdited December 4, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3888319","commentId":3888319,"userName":"sappidus","timestamp":1581039473,"content":"@PeaceAndThought on the CotR Discord asked about Host of Galadhrim putting out a Galadhrim Weaver and got this ruling:\n\n> Quote\n> \n> Host does not enter your discard pile until you fully resolve its effect. That means it will “float” until you have put all your Silvan allies back into play and resolved their ‘enters play’ effects. [Ed: emphasis added]\n\nI was confused by this, as the Weaver has an \"After… enters play\" trigger condition, and I thought the HoG would be done resolving by the time the Weaver would trigger. So I asked for clarification:\n\nYou recently shared a ruling with a community member re: Host of Galadhrim and a Galadhrim Weaver, stating that the event would still be floating outside the discard pile at the time that the Weaver's Response [could be] triggered.\n\nI just want to clarify this, as the Weaver has an \"after... enters play\" Response—we should consider events as still resolving until all triggered effects due to things the event may have incited (even \"after\"s) have completely resolved as well?\n\nRelated: is it also the case that Sneak Attack and Tree People are still outside the discard pile at the time the Weaver triggers (if a Weaver is the relevant ally put into play)?\n\n> Quote\n> \n> Yes, the rule for playing an event is that you wait until its effect is fully resolved before placing it in the discard pile.\n> \n> Cheers, Caleb\n\n \n\nEdited February 7 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3894584","commentId":3894584,"userName":"sappidus","timestamp":1581734340,"content":"Ally Galadriel puts an attachment into play, as opposed to playing it. Vilya also can do this. Can this attachment be put on another player's character?\n\nOf course, the rules for attachment cards specifically say you can \"play\" them on other players' characters. But RR Ownership and Control [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule562] states \"By default, cards enter play under their owner's control\". I wasn't sure if that was intended to still apply with Galadriel/Vilya.\n\n> Quote\n> \n> If you put an attachment into play with Galadriel’s ability you can still attach that attachment to any legal target. For example, if it says “attach to a hero” that can be any hero in the game, regardless of who controls that hero.\n> \n> Cheers, Caleb\n\nEdited February 15 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3894590","commentId":3894590,"userName":"sappidus","timestamp":1581734884,"content":"(This was a @GrandSpleen [https://community.fantasyflightgames.com/profile/177891-grandspleen/] question, but I submitted the query…)\n\nLots of people are excited about Saruman and his Staff—great design! A question his Staff brings up: suppose you use it to reduce the Doomed value of the next event by 2. Then you want to use the Response on a Steward of Orthanc to give an otherwise vanilla event Doomed 1. This would end up being Doomed 0 because of the Staff's lasting effect… Do you still get to draw a card from that Steward of Orthanc?\n\nThe hesitation comes from wondering whether we really paid the price of \"give it Doomed 1\" or not. Thanks in advance!\n\n> Quote\n> \n> You can combo Steward of Orthanc with Saruman’s Staff. It works like this:\n> \n>  1. Trigger Saruman’s Staff (-2 doomed)\n>  2. Play an event\n>  3. Give it Doomed 1 with Steward of Orthanc (+1 doomed)\n>  4. You end up drawing a card without raising your threat because you reduced the doomed value to 0.\n> \n> Cheers, Caleb\n\nEdited February 15 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3895152","commentId":3895152,"userName":"GrandSpleen","timestamp":1581839450,"content":"So if you use Grima to give an event Doomed 1 and use Steward to give it Doomed 1, then reduce the value by 2 with Saruman’s staff, you get an event at -1 cost and it draws you a card.... without a threat raise. Nice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3901511","commentId":3901511,"userName":"sappidus","timestamp":1582603078,"content":"This is a Caleb ruling back from 2018, but I can't seem to find it recorded on the forum, so I share it now:\n\n> Quote\n> \n> When an effect raises your threat by 1 “for each X” you should calculate the total and then raise your threat all at once. So if you have 5 characters not committed to the quest when Pursued by Shadow is revealed, you would raise your threat by 5 all at once, not by 1 five times. That means Elfhelm’s ability would cause you to raise your threat by 4 instead of 5.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3904009","commentId":3904009,"userName":"sappidus","timestamp":1582890561,"content":"Another ruling from 2018 addressing a simple question, but I couldn't find a similar reference ruling. This one was shared by CotR host Chad:\n\n\n\n> You cannot cancel a Great Barrow with The Door is Closed! because the “immune to player card effects” is active immediately in step 1, which prevents you from targeting Great Barrow with the event.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3905529","commentId":3905529,"userName":"sappidus","timestamp":1583113183,"content":"Still going back through the archives and posting rulings that I'm not sure ever reached the forum… This one is from @McDog3 [https://community.fantasyflightgames.com/profile/223374-mcdog3/], asking in 2019 about enemies \"considered to be engaged with each player\":\n\n> Quote\n> \n> If an enemy is considered to be engaged with each player, it will make an attack against each player during their ‘resolve enemy attacks’ step. In that regard, the rules reference should probably be updated to say “has not yet attacked the active player” in order to make that more clear. I will make a note to do that with the next FAQ update.\n> \n> As for shadow cards, an enemy that is considered to be engaged with each player should be dealt a new shadow card each time that it attacks. I will make a note to clarify that with the next FAQ update as well.\n> \n> Cheers, Caleb\n\n[Please, let there actually be a FAQ update someday…]\n\nN.B.: The shadow card part of this ruling is slightly different from what the Shadow and Flame rules state we should do for Durin's Bane.\n\nEdited March 2 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906124","commentId":3906124,"userName":"Alonewolf87","timestamp":1583185709,"content":"Just got a reply from Caleb about the Setup timings of Contracts\n\n> Quote\n> \n>  \n> \n> Setup effects are resolved during step 7 of the game Setup instructions. You should resolve player card Setup abilities after resolving the Setup instructions for the scenario. That does mean it is possible that you could draw your only copy of a card before that, so it is good to include multiple copies or have a back up plan. It also means that Guarded cards will pull cards from the encounter deck.\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906216","commentId":3906216,"userName":"kainveus","timestamp":1583194678,"content":"Question about Mount Gundabad and Setup\n\nQ1:Several Stage 2B of Mount Gundabad reads \"After characters are commintted to the quest……“ , should it be trigger \"After a player commits characters to the quest……” or \"After the players commit characters to the quest……\" ?\n\n    Q2:About trigger time of \"Setup\" effect.\n\n    There are several \"Setup\" in the game now??Contract cards like \"Messenger of the King\"/\"The Grey Wanderer\" , other player cards like Thurindir/The One Ring , and also quest cards. But when did these effect triggers? Before the players draw their openning hands , or after ?\n\n    Some cards, like Gandalf's Delay ,should be trigger before player draw their hands and mulligan, but how about Thurindir? Should he search for the side quest , and draw the other 5 cards? If so , how to take mulligan ?\n\n    If the \"Setup\" effect triggers after the players draw their hands , If they get the Ally/Attachment for \"Messenger of the King\"/\"The Grey Wanderer\", do that means they had to prepare a Plan B ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906218","commentId":3906218,"userName":"kainveus","timestamp":1583194742,"content":"> 2 minutes ago, kainveus said:\n> \n> Question about Mount Gundabad and Setup\n> \n> Q1:Several Stage 2B of Mount Gundabad reads \"After characters are commintted to the quest……“ , should it be trigger \"After a player commits characters to the quest……” or \"After the players commit characters to the quest……\" ?\n> \n>     Q2:About trigger time of \"Setup\" effect.\n> \n>     There are several \"Setup\" in the game now??Contract cards like \"Messenger of the King\"/\"The Grey Wanderer\" , other player cards like Thurindir/The One Ring , and also quest cards. But when did these effect triggers? Before the players draw their openning hands , or after ?\n> \n>     Some cards, like Gandalf's Delay ,should be trigger before player draw their hands and mulligan, but how about Thurindir? Should he search for the side quest , and draw the other 5 cards? If so , how to take mulligan ?\n> \n>     If the \"Setup\" effect triggers after the players draw their hands , If they get the Ally/Attachment for \"Messenger of the King\"/\"The Grey Wanderer\", do that means they had to prepare a Plan B ?\n\nQ1. “After characters are committed to the quest” is the same as “after the players have committed characters to the quest.”\n\nQ2. Setup abilities should be resolved during step 7 of the Setup rules for the game: “Follow Scenario Setup Instruction.” Resolve the scenario Setup instructions first, and then resolve any player card Setup instructions. The only exception to this is Gandalf’s Delay. That card doesn’t actually work as intended as written, but we have never issued errata because players seem to have intuited how it was meant to work and resolved it on their own. It does however create confusion with regard to other Setup abilities as you pointed out, but if you understand that Gandalf’s Delay is the exception and not the rule, the rest of the Setup effects work as intended.\n\nQ3. It is possible to draw the card you want to search for in your opening hand with Messenger of the King and The Grey Wanderer. In those cases it is prudent to have a backup plan.\n\nCheers,\n\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906474","commentId":3906474,"userName":"dalestephenson","timestamp":1583247400,"content":"So now not only have contracts moved to step 7, but hero abilities as well?  Thurindir's timing was previously in step two.\n\nIt's difficult for me to believe that post step 7 was \"as intended\" for setup abilities, for several reasons:\n\n1) Thurindir was ruled differently in the past\n\n2) The article introducing contracts had it in step 2 with the hero setup.\n\n3) Hero setup abilities logically belong in hero setup (step 2) anyways\n\n4) The necessity for dead cards to find your target with the contract could have been avoided with \"deck or hand\" wording easily *if* that had been intended timing.  Surely Messenger of the King wasn't *meant* to be unreliable, rather than just hero-ify a *predetermined* ally.\n\nAll this seems like a lot of collateral damage just to prevent Guarded player cards from being used with Grey Wanderer.  As has been pointed out, there *is* an encounter deck in play in step two.  I realize pulling an enemy or location in step two that was going to be set aside might make some scenarios behave in an unintended fashion, but I can't think of a quest off the top of my head where it will make it *better* for the player instead of worse."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906516","commentId":3906516,"userName":"EBerling","timestamp":1583251144,"content":"moved\n\nEdited March 3 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3906555","commentId":3906555,"userName":"sappidus","timestamp":1583255608,"content":"You are, of course, free to post wherever you want, but because the original purpose of this thread is to collect rulings in a pretty clean way for posterity, I do want to politely suggest this other thread for further discussion of Setup issues:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3913454","commentId":3913454,"userName":"sappidus","timestamp":1584109529,"content":"Coulda sworn I reproduced this ruling @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/] got back in 2018 somewhere in the forum, but I can't find it… So:\n\nGamling reads: Response: \"After a Rohan ally you control is discarded from play, exhaust Gamling to return that ally to your hand.\" My question is if a non-rohan ally has gained the Rohan trait via Nor am I a Stranger, and gets discarded from play, can they be returned to your hand with Gamling?\n\n> Quote\n> \n> No, you cannot. When a character leaves play, you immediately discard all attachments from it. After the ally in question has left play, it no longer has the Rohan trait; therefore it is no longer a valid target for Gamling.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3921353","commentId":3921353,"userName":"Valhalla Gaming","timestamp":1585511198,"content":"Something I've been wondering as I've played a Saruman deck is if close call:\n\nDoomed X.\nResponse: Cancel X damage just dealt to a hero. \n\nworks beneficially with Saruman's staff:\n\nAction: Exhaust Saruman's Staff [http://hallofbeorn.com/Cards/Search?Trait=Staff.] to (choose 1): Reduce the X value of the next Doomed X event you play this phase by 2, or search the top 5 cards of your deck for a Doomed event and add it to your hand. Shuffle your deck.) \n\nObviously the instinct while playing would be \"hey I want to cancel 3 damage, I'm going to tap the staff, play close call and pay 1 doom because its reduced by 2. However the way its worded if taken as read would imply the staff would reduce the value, thus also reducing the benefit making the staff totally pointless to use. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3927312","commentId":3927312,"userName":"Alonewolf87","timestamp":1586881576,"content":"Just in case someone was thinking otherwise I asked for a clarification about the interaction of Messenger of the King with heroes like Folco or Mirlonde\n\n> Quote\n> \n> Mirlonde's and Folco's abilities do not interact with Messenger of the King at all because the ally does not have its own threat cost. Instead, it is the contract that instructs you to raise your starting threat by the sum of that ally's stats.\n> \n> Caleb\n\nWhereas regarding Lore Aragorn this was the answer\n\n> Quote\n> \n> The Messenger of the King modifies your starting threat, so Lore Aragorn's ability will reset to the modified value.\n\n \n\nEdited April 14 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3945740","commentId":3945740,"userName":"sappidus","timestamp":1590701482,"content":"Courtesy of @Mortendall on the CotR Discord, a clarification re: Under the Ash Mountains. As it has not released in, say, the U.S. yet, I will edit the ruling slightly to minimize quest spoilage for those who haven't played it.\n\nThere is a player elimination condition listed in the rulesheet as being checked only at the end of the round. But the quest cards phrase it in a way that could be interpreted as: if the condition is satisfied at any time, the relevant player is eliminated. However, Caleb clarified:\n\n> Quote\n> \n> The text \"If a player [redacted], he is eliminated from the game\" is part of the Forced Response that only triggers at the end of the round. It is not a separate passive effect. It's only in bold font because we traditionally put our game loss conditions in bold font.\n> \n> Sorry for the confusion. Hope you enjoy the scenario!\n> \n> Cheers, Caleb\n\n \n\nEdited May 28 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3964682","commentId":3964682,"userName":"sappidus","timestamp":1595625240,"content":"@hone on the CotR Discord got the following ruling… This is not a new thing, really, but it does provide modern reinforcement of an ancient ruling [http://www.cardgamedb.com/forums/index.php?/topic/1702-official-nate-rule-clarifications/page-4#entry110974] (further discussion [https://community.fantasyflightgames.com/topic/233754-another-question-about-either-faq-section-144/]) that stated each refers to 1 or more (and not 0).\n\nThe query concerns a location, Tombs of Carn Dûm, with a travel cost: \"Travel: Deal 1 shadow card to each Undead enemy in play to travel here.\" Must there be an Undead enemy in play for the group to be able to travel to this location?\n\n> Quote\n> \n> Yes, you need at least 1 Undead enemy in play to travel to Tombs of Carn Dum.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3972583","commentId":3972583,"userName":"sappidus","timestamp":1597076890,"content":"This one's a pleasant surprise—I thought the ruling would go the other way. Yay for ally Radagast!\n\nCan you use resources from ally Treebeard or ally Radagast to pay to prevent ally Wilyador's Forced discard?\n\n> Quote\n> \n> Yes, you can. Wilyador’s effect does not specify a type of resource or that it must be from a hero, so you could spend a resource from Radagast or Treebeard.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3972585","commentId":3972585,"userName":"sappidus","timestamp":1597077021,"content":"This is kind of a confirmation of something that was in the original rules, but not explicitly stated in the RR:\n\nCan you declare an attack against an enemy with 0 characters you control?\n\nThis can matter if all of your characters are exhausted, and your partner has a Ranged character with readying: the answer to the question determines whether an enemy you have engaged can be attacked once or twice by said Ranged character.\n\n> Quote\n> \n> No, you cannot declare an attack without an attacker. Assigning an attacker and declaring an attack are intertwined.\n> \n> Cheers, Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=4011098","commentId":4011098,"userName":"kainveus","timestamp":1604648628,"content":"> On 8/11/2020 at 12:28 AM, sappidus said:\n> \n> This one's a pleasant surprise—I thought the ruling would go the other way. Yay for ally Radagast!\n> \n> Can you use resources from ally Treebeard or ally Radagast to pay to prevent ally Wilyador's Forced discard?\n> \n>  \n\nSo how about Keeping Count? Can the resources on Keeping Count be paid? And how about Ranger of Cardolan and Hidden Cache?\n\nEdited November 6 by kainveus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=4011174","commentId":4011174,"userName":"sappidus","timestamp":1604674635,"content":"> 7 hours ago, kainveus said:\n> \n> So how about Keeping Count? Can the resources on Keeping Count be paid? And how about Ranger of Cardolan and Hidden Cache?\n\nGood question. If one asked Caleb, I do see an out for him disallowing Keeping Count resources for paying… Heroes, as well as allies like Treebeard, collect resources into a resource pool, whereas Keeping Count merely gets resource tokens placed upon it. Spending may (or may not) require paying from a pool—I don't see an obvious place in the rules that specifies either way for things like Wilyador (though you do have to pay from a pool to play cards).\n\nI would recommend not asking, heh.\n\nEdited November 6 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=4015688","commentId":4015688,"userName":"sappidus","timestamp":1605640765,"content":"Courtesy of @The Purple Wizard on the CotR Discord (& his friend who actually asked):\n\nIn a Bond of Friendship deck, if Bombur is one of the heroes and you start off with five dwarves, can Oin count as the Tactics hero?\n\n> Caleb said:\n> \n> No you cannot. You put your heroes into play all at once before the game begins, so you cannot take card abilities into account when choosing them.\n\nEdited November 17 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=4027900","commentId":4027900,"userName":"sappidus","timestamp":1607621241,"content":"Not sure if this was recorded for posterity here… Wrath and Ruin's 1A text doesn't make it clear whether the Makeshift Fortification made active can be from the initially chosen set of locations in the staging area, or not.\n\nOn the CotR Discord, Caleb himself said:\n\n\n\n> The Makeshift Fortification comes from the encounter deck. In a 4p game there should be 4 non-unique locations in the staging area after setup. Sorry that wasn't more clear. I can see it now that it's been pointed out.\n\n"}]}