{"url":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/","title":"Unofficial Official Rulings thread","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3373604","commentId":3373604,"userName":"sappidus","timestamp":1528990480,"content":"For some reason, FFG did not see fit to bestow this forum with an Official Rulings thread (like they did, say, here: https://community.fantasyflightgames.com/topic/277422-legend-of-the-five-rings-official-rulings/ [https://community.fantasyflightgames.com/topic/277422-legend-of-the-five-rings-official-rulings/),]), so I thought it might be useful to have an unofficial one for random little rulings that might not deserve an entire dedicated thread.\n\n(I encourage people to start a new thread if you do indeed want to discuss a specific ruling posted here, just to keep this thread clean.)\n\nEdited June 14, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3373608","commentId":3373608,"userName":"sappidus","timestamp":1528990625,"content":"I'll kick things off with a ruling on a new card.\n\nRe: Bartering... If you use it on a Scroll of Isildur, and you control 3 Lore heroes, is the cost of the next attachment played this phase reduced by 4, or by 1?\n\n> Quote\n> \n> The cost of the Scroll is 4. You reduce the cost to play it by 1 for each Lore hero you control, but you don’t actually reduce its cost while it’s in play.\n\nSo, say, Scroll -> Bartering -> Sword-thain for the princely sum of 1 resource should be doable. (At which point you can even play the Scroll again for free, heh.)\n\nEdited June 14, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3378535","commentId":3378535,"userName":"sappidus","timestamp":1529423435,"content":"This one makes perfect sense to me, but for the record:\n\nFundamentally this is a question about what happens when multiple effects have almost the same timing trigger, but resolving one makes the source of the other effect exit play...\n\nIn Dungeons of Cirith Gurat, I have 10 progress on stage 1B but a single guarded ally still in play. Then I rescue that ally. My understanding is that the constant effect of quest advancement MUST occur before the Forced effect of stage 1B. Does this mean:\n\nA. the Forced effect does not occur because its source is gone before it can trigger, or\n\nB. the Forced effect was queued up to fire because its trigger condition was met, and so it still does happen (after quest advancement).\n\n> Quote\n> \n> You are correct that constant effects resolves immediately when their condition is met, and this take priority over Forced effects. So if you already have the requisite progress needed to advance and the only thing holding you back is the one remaining captive, then you will advance immediately as soon as that last captive is rescued. As a result, the Forced effect on 1B will no longer be in play to trigger.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3378713","commentId":3378713,"userName":"JanB","timestamp":1529433133,"content":"@sappidus [https://community.fantasyflightgames.com/profile/251007-sappidus/]\n \nThanks for you asking .. i got an email, too.\nAsking more precisly:\n \nWe are at stage 1B with over 10 progress tokens on it. This stage cannot be defeated while guarded objectives are in play and has the following force effect: After any number of characters are rescued, reveal an encounter card.\nSeems very straight.\nSo .. we are in the quest phase and our current quest was a side quest. The active location was a prison cell with the last guarded objective attached.\nWe managed to quest successful and explore the active location and defeat the side quest.\nNow the question .. who do we resolve things?\n \nHere is how we done it:\na) the active location (prison cell) leaves play, because it is explored\nb) we defeat the side quest (has a response effect)\nc) we rescue the character from the prison cell\nd) we defeat 1B because we have no guarded objective left\ne) we do, whatever 2A says and flip to 2B\nf) we resolve the response effect from the defeated side quest\ng) we reveal an encounter card because of 1B forced effect, which was in play, when the active location was explored\n \nIs this order correct?\n \n> Quote\n> \n>  \n> \n> In the past I have ruled that progress is placed simultaneously on the active location and quest, but I am reversing that ruling because it was counter-intuitive and created a lot of questions. So from now on, the active location must be fully explored before placing any progress on the current quest. That means you will resolve any effects that trigger as a result of the active location being explored before placing any progress on the quest.\n> In your situation, that would mean: \n> 1. You explore the location and take control of the prisoner\n> 2. You immediately advance to stage 2A and resolve its ‘when revealed’ effect\n> 3. You finish placing progress onto your side quest\n> \n>  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3379622","commentId":3379622,"userName":"Wandalf the Gizzard","timestamp":1529504730,"content":"4. You add the side quest to the victory display, if completed.\n\n5. You discard the explored location."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3408860","commentId":3408860,"userName":"sappidus","timestamp":1531951000,"content":"Since this seems to be relevant lately:\n\n> Quote\n> \n> No, objective-locations do not count as locations when fulfilling the Guarded (location) keyword.\n> \n> I hope you’re enjoying Lost in Mirkwood!\n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558209","commentId":3558209,"userName":"sappidus","timestamp":1544021639,"content":"Resurrecting this idea…\n\n> Quote\n> \n> When you play an event from your discard pile with Map of Earnil, the event leaves your discard pile and resolves its effect, then you place it back in the discard pile. So, if there are 2 copies of Elwing’s Flight [in your discard] when you choose to play one with Map of Earnil, there will only be 1 in the discard pile when you resolve its effect.\n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558210","commentId":3558210,"userName":"sappidus","timestamp":1544021685,"content":"> Quote\n> \n> When you travel to location in Temple of the Deceived, the locations adjacent to the active location are considered to be in the staging area, but they are not \"added\" to the staging area. It's the same as when an enemy in the staging area is \"considered to be engaged\" with you but it has not actually engaged you. So, I'm afraid Thror's Key will not help you in Temple of the Deceived.\n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558212","commentId":3558212,"userName":"sappidus","timestamp":1544021788,"content":"Blast from the past this time... I'm sure you've gotten this question quite a bit. Wargs (OG Wargs, that is) have the text \"Forced: \"If Wargs is dealt a shadow card with no effect, return Wargs to the staging area after it attacks.\" (Very similar wording crops up on Lord Alcaron in his enemy form.)\n\n 1. Does \"a shadow card with no effect\" merely refer to the existence of text that says \"Shadow: ___\" on the card, or does it refer to the possibility of the effect changing the game state? e.g., in Conflict at the Carrock, Wargs could get Roasted Slowly as a shadow card, whose shadow effect is \"Shadow: If attacking enemy is a Troll, remove 2 damage tokens from it.\" Does this count as a shadow card WITH an effect, thus keeping the Wargs engaged?\n 2. Barring considerations such as #1, if you cancel the shadow card's effect with Hasty Stroke or whatnot, do the Wargs return to the staging area?\n 3. If you discard the shadow card before it ever resolves, and it turns out that shadow card had no shadow effect, do the Wargs return to the staging area?\n\n> Quote\n> \n> I love the old questions! Because I know how to answer them ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> \n> 1. A shadow effect is (and must be) denoted by the “Shadow:” text and bar graphic.\n> 2. If you cancel a shadow effect, the Wargs was still dealt a shadow effect.\n> 3. If you discard the shadow card from the Wargs before it attacks, then it never has the opportunity to trigger its effect.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558213","commentId":3558213,"userName":"sappidus","timestamp":1544021830,"content":"> Quote\n> \n> The first part of A Very Good Tale instructs you to shuffle your deck and discard the top 5 cards. You cannot alter the order that those cards are discarded in.\n> \n> \n> Cheers,\n> Caleb \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558215","commentId":3558215,"userName":"sappidus","timestamp":1544021862,"content":"> Quote\n> \n> If a player is eliminated while in control of something like The One Ring or an objective-ally with game text that will cause the players to lose if it leaves play, then the players will lose the game because all of the cards under that player's control are immediately removed from the game when he is eliminated.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558220","commentId":3558220,"userName":"sappidus","timestamp":1544022024,"content":"A question about stacking Doomed... You're playing Massing at Osgiliath and haven't crossed the Anduin. You're sitting at 30 threat with a ready Elfhelm ally out. During staging, you flop two consecutive copies of Massing at Osgiliath, then an arbitrary enemy. That 2nd copy of Massing has gained Doomed 1 [threat now 31], at which point Elfhelm says \"Nope!\" [30]. So far, so good. How about that last enemy? Either: The enemy has gained a total of Doomed 2; that hits [32], and Elfhelm triggers [31]. Or: The enemy has gained \"Doomed 1, Doomed 1\"; the first Doomed hits [31], and Elfhelm triggers [30]; then the second Doomed hits [31], and Elfhelm triggers [30]. Different outcomes. Which one actually happens? (A similar question might be generated for stacked Toughness.)\n\n> Quote\n> \n> If a card gains two instances of Doomed, then it has Doomed 2. In the situation you described, the enemy revealed would have Doomed 2 forcing you to raise your threat by 2, then Elfhelm would reduce it by 1.\n> \n> \n> Cheers,\n> Caleb\n\n(This is actually in RR Keywords now, but I still thought I'd mention it.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558225","commentId":3558225,"userName":"sappidus","timestamp":1544022169,"content":"Haradrim Elite says: \"Forced: When Haradrim Elite enters play, it makes an immediate attack from the staging area against the first player.\" What if you pull one of these guys with a Dunedain Hunter or the new Wait No Longer? Is he engaged with you when he makes his attack against the 1st player? Or in the staging area? Both? Does he make his attack at all?\n\n> Quote\n> \n> Haradrim Elite was written to explain its effect at a time before Dunedain Hunter existed. Around the time that Heirs of Numenor was released, the design team was receiving questions about enemies that made immediate attacks as part of their \"when revealed\" effects. Players wanted to know: \"Does this mean it engages me?\" The answer was always: \"No, not unless its text says it engages you first.\" But the questions kept coming, so the Haradrim Elite received an extra bit of text to clarify that it attacked \"from the staging area.\"\n> \n> \n> Unfortunately, that bit clarification complicated how it interacts with the player cards you mentioned, but it's really not that bad: the enemy will still make an attack, since it has entered play. It is still engaged with you, since nothing explicitly says to move it anywhere else, but its attack will be considered to come from the staging area. \n> \n> \n> The last part is similar to an enemy that is in the staging area but is considered to be engaged with a player. For the duration of the attack, the Haradrim Elite is still engaged with you, but considered to be in the staging area. That may or may not make a difference depending on what card effects are active, but that's how it will resolve.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558226","commentId":3558226,"userName":"sappidus","timestamp":1544022196,"content":"> Quote\n> \n> Yes, you can use Good Meal to reduce the cost to play Stand and Fight by 2. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558230","commentId":3558230,"userName":"sappidus","timestamp":1544022274,"content":"Can you trigger the Erebor Guard's Response (lowering his cost) if you're playing him off the top of your deck with hero Gandalf? The possible issue is that, even if considered part of your hand, the Erebor Guard is still the top card of the deck, so does triggering his Response discard himself but still work? Does it discard the two cards below him? Can you not trigger it at all? If you CAN trigger it, when do you decide on whether you even want to trigger the Response? Gandalf's passive ability \"instantly\" turns the top card of your deck faceup, so perhaps I would use that information to decide whether I want to use the Response or not, if the timing allowed for that.\n\n> Quote\n> \n> Gandalf’s ability lets you play the top card of your deck “as if it was in your hand.” When you play a card from your hand, you place it in front of you and pay its cost before resolving the card. For the instant it takes you to play a card, it is not in your hand or in play - it is being played. \n> \n> \n> So, when you play Erebor Guard, you place it in front of you, pay its cost, and resolve playing the card. Therefore, it is not the top card of your deck when you play it and it cannot be discarded by its own effect.\n> \n> \n> You would, however, immediately turn the top card of your deck faceup as you are playing Erebor Guard with Gandalf’s ability, and that would allow you to decide whether or not you want to resolve the Guard’s Response effect.\n> \n> \n> Cheers,\n> Caleb\n\n(This one still blows my mind.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558231","commentId":3558231,"userName":"sappidus","timestamp":1544022313,"content":"> Quote\n> \n> Exhausting The One Ring and spending 1 fellowship resource is the cost you have to pay in order to trigger Frodo’s cancel ability. That means The One Ring is exhausted when you resolve Frodo’s ability. Therefore, you cannot use Frodo to cancel The Ring Draws Them.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558232","commentId":3558232,"userName":"sappidus","timestamp":1544022358,"content":"If I reveal In Need of Rest at a time when no heroes are committed to the quest, does the treachery whiff entirely? Or did I still have to attach it to a hero (of my choice)? The \"that hero\" of the phrasing gives me pause: does it refer to a hero that's been removed from the quest by the first clause of the effect, or to simply \"a hero\" (with the first clause whiffing but the second clause still able to fire)?\n\n> Quote\n> \n> If there is no questing hero, then In Need of Rest will fail fizzle because there is no eligible target.\n> \n> \n> Cheers,\n> Caleb\n\n \n\nEdited December 5, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558234","commentId":3558234,"userName":"sappidus","timestamp":1544022395,"content":"> Quote\n> \n> No, you cannot exhaust [hero] Beorn to pay for player card effects because choosing him to be exhausted is a form of targeting him, and his immunity prevents him from being targeted by player card effects.\n\n \n\nEdited December 5, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558237","commentId":3558237,"userName":"sappidus","timestamp":1544022455,"content":"> Quote\n> \n> A card with Guarded X must always be attached to the specified card type when it enters play. There is no way to cheat around this unless a card effect specifically tells you to ignore it (ala the Dragon Hoard in The King’s Quest.)\n> \n> \n> The Golden Rule does not override the Guarded X keyword because the keyword itself is card text. \n\nEDIT: Stolen from a ruling given to @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/], somewhat more detail on the precise sequence of occurrences in an oft-asked case… \n\n> Quote\n> \n> You cannot “cheat” guarded attachments. The guarded keyword triggers after it enters play; so no matter what you do, you will have to attach it to an enemy or location. In the case of Well-equipped, it would attach to the Dwarf for a hot second before forcing you to mill for an enemy or location and attach it to that encounter card.\n\n \n\nEdited March 14, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558241","commentId":3558241,"userName":"sappidus","timestamp":1544022531,"content":"If you use a Scroll of Isildur to play Rumour from the Earth and return the Rumour to your hand, does the Scroll's bottoming ability still apply? i.e., does that ability still have \"access\" to the hand (a different out-of-play area than the one explicitly referred to on the card, the discard pile)? (This is all assuming you can even return the Rumour to your hand despite it not having originated from there… But I assume this is doable; otherwise, the Silvan bounce effects would be greatly neutered by the fact that Tree People puts Silvans on the board who have never been in your hand.) \n\n> Quote\n> \n> The passive effect created by Scroll of Isildur does not resolve until after you finish resolving the effect of the event you chose to play. That means if you chose to play Rumor from the Earth and pay 1 to return it to your hand, you would then have to place it on the bottom of your deck.\n> \n> \n> Cheers,\n> Caleb\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3558243","commentId":3558243,"userName":"sappidus","timestamp":1544022579,"content":"> Quote\n> \n> Gandalf’s ability does not combo with Hirgon or Thranduil because they only target allies in your hand. Gandalf’s ability only makes the top card of your deck count as if it were in your hand at the time that you play it. That means it only works when you would normally play that card. To play an ally with Gandalf’s ability requires you to play it during the planning phase.\n> \n>  \n> \n> Cheers,\n> \n> Caleb\n\n(Ouch!)\n\nEDIT: @naverag [https://community.fantasyflightgames.com/profile/290622-naverag/] further interprets this ruling thusly, which I thought was well-put: \"…Gandalf's ability only modifies the framework effect of playing cards from your hand, whereas Hirgon and Thranduil create non-framework opportunities to play cards from your hand.\"\n\nEdited April 18, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3576681","commentId":3576681,"userName":"sappidus","timestamp":1545945388,"content":"So, Wild Stallion is a very cool card. Its new mechanic has brought up a couple of questions:\n\n1. Once you have attached it to an ally, does it retain its Planning Action to enable it to attach to another ally in the future? Or does it lose all of its original abilities, totally replaced by the \"Counts as\" text?\n\n2. If the ally riding a Stallion leaves play, would Spirit Bard be able to return the Stallion to its owner's hand? Or does it lose the attachment type before that can happen?\n\n> Quote\n> \n> 1. It’s planning action is only active while it is an ally. Once you attach it to an ally, then it becomes an attachment and only its attachment text is active. 2. Wild Stallion can be returned to your hand with Bard’s ability because it counts as an attachment at the time you check for his Response.\n> \n> Cheers, Caleb\n\nEdited December 27, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3586985","commentId":3586985,"userName":"Yepesnopes","timestamp":1547109065,"content":"> On 12/5/2018 at 4:02 PM, sappidus said:\n> \n> Haradrim Elite says: \"Forced: When Haradrim Elite enters play, it makes an immediate attack from the staging area against the first player.\" What if you pull one of these guys with a Dunedain Hunter or the new Wait No Longer? Is he engaged with you when he makes his attack against the 1st player? Or in the staging area? Both? Does he make his attack at all?\n> \n>  \n\nDoes it mean Harad elite triggers Sam and Pippin abilities? Does it mean you can use feint on him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3587046","commentId":3587046,"userName":"dalestephenson","timestamp":1547120562,"content":"Since the ruling was that he was actually engaged (and remained engaged), even though considered to be in the staging area for the purpose of his attack, he would certainly trigger Sam or LoPippin's responses.\n\nHowever, Feint would not work even if Haradrim Elite had been pulled by a play of Dunedain Hunter in the combat phase.  The attack is forced when it enters play, so before you could play an action the attack would have already begun and could not be cancelled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3587409","commentId":3587409,"userName":"Yepesnopes","timestamp":1547143356,"content":"> 6 hours ago, dalestephenson said:\n> \n> Since the ruling was that he was actually engaged (and remained engaged), even though considered to be in the staging area for the purpose of his attack, he would certainly trigger Sam or LoPippin's responses.\n> \n> However, Feint would not work even if Haradrim Elite had been pulled by a play of Dunedain Hunter in the combat phase.  The attack is forced when it enters play, so before you could play an action the attack would have already begun and could not be cancelled.\n\nSam and Pippin just became insanly good!"}]}