{"url":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/","title":"Wilds of Rhovanion available now!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374603","commentId":3374603,"userName":"Wandalf the Gizzard","timestamp":1529067122,"content":"https://www.fantasyflightgames.com/en/news/2018/6/14/into-the-wild-1/ [https://www.fantasyflightgames.com/en/news/2018/6/14/into-the-wild-1/]\n\nHurrah!\n\nMaybe we're back to the good old print schedule."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374618","commentId":3374618,"userName":"Wandalf the Gizzard","timestamp":1529068140,"content":"Hmm, looking at the Dale decks on RingsDB, I noticed none of them include Bartering. Most likely because Dale has no way of playing Lore events. Any ideas for splashing Lore? Lore Allies and Attachments can already be played between Brand and King of Dale."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374673","commentId":3374673,"userName":"Jekzer","timestamp":1529071056,"content":"I am really looking for people experiences about the new quest: what level of difficulty have (if we have a new HoN or TLR type of difficulty) , if they are a temathic win (it seems so), mechanics, etc.\n\nI'll have to weit several weeks before I have my copy..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374678","commentId":3374678,"userName":"dalestephenson","timestamp":1529071279,"content":"How about Thurindir?  Starting with Gather Information can ensure you get King of Dale early, or even fetch a lone copy of Necklace of Girion if you think you can handle the extra card.\n\nDamrod would enable the new Valor of the North card to be useful, but you'd need a complementary deck to play that card.  Broadly fits attachments-R-us theme.\n\nLoDenethor would give you a strong hero defender and powerful solo scryer, and you can play Gondorian Shield on him with Bard\n\nArgalad would be fun, because Bard will let you play tactics attachments to boost his offense.  Haldir would benefit for same reason, but without a complementary deck would be more limited.\n\nBifur would let you play expensive lore allies despite being tri-sphere.\n\nWhen Haldan comes out he'd make a natural thematic fit, but he's not even playable against one or more of the new quests because of the objective ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374725","commentId":3374725,"userName":"Devaresh","timestamp":1529073443,"content":"From what I’ve played with so far turn one King of Dale is very hard to pass up, which is why most of what you’ll see will be Brand + Bard + other spirit Hero. Also the tendency toward low cost attachments reduces the overall utility of Bartering for the specific Dale allies deck that most are using.\n\nill start working on a summary of my impressions of the quests. I enjoyed them a lot, and I would rate them as difficult but feel achievable based one my experience so far!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3374838","commentId":3374838,"userName":"donkler","timestamp":1529076768,"content":"I am wondering why Valour of the North [http://ringsdb.com/bundles/cards/18014.png] is in this pack since it seems like something for a Trap deck. I am guessing maybe because it works with Necklace of Girion [http://ringsdb.com/bundles/cards/18011.png] when it is guarded? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3375337","commentId":3375337,"userName":"Gizlivadi","timestamp":1529093465,"content":"I was considering building a Dale deck with Haldan as the Lore hero. Thematically he's awesome for that (the Northmen deck) but I'm wondering whether he's really compatible with Dale. If you want to take advantage of Haldan you run, say, 9 location attachments (3 of those obviously being Mathom for insane draw), and if you want to take advantage of the Dale mechanic you run at least 20 character attachments, which in the same deck would be an insane amount of attachments. Now is it necessary to run the 9 location attachments? I'd LOVE to make these 3 heroes work together but I'm wondering how solo viable this would be. Any input on this, @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/]?\n\nEdited June 15, 2018 by Gizlivadi"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3375366","commentId":3375366,"userName":"Devaresh","timestamp":1529095171,"content":"I think if you use Haldan you would maybe want to not use brand. His value to you goes way down once you start including attachments that aren’t going on allies. Bard on the other hand and some of those attachments which help blow up locations will go very nicely with him!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3375741","commentId":3375741,"userName":"Seastan","timestamp":1529121013,"content":"@Gizlivadi [https://community.fantasyflightgames.com/profile/185970-gizlivadi/] As you say, Dale demands a bunch of attachments already so the two archetypes are competing for deck space. I think if I were trying to squeeze Haldan into the Dale mechanic I might run Mathom only, with Dwarven Tomb to recur it (since 2 resources for 4 cards is still quite good)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3375750","commentId":3375750,"userName":"Gizlivadi","timestamp":1529123093,"content":"Yeah, I was sort of coming to a similar conlcusion. Didn't even occur to me to recur Mathom with Dwarven Tomb... Maybe even a couple Hammersmiths would be also worth it in that case.  Thanks for that tip! In any case, I am now considering running Thurindir instead, which would be the first time I seriously consider him in solo. I'll have to see who fares better in general."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376245","commentId":3376245,"userName":"Bullroarer Took","timestamp":1529182913,"content":"Just finished a four player run through with a couple other board members.  Really wish we’d had a few side quests early, but not one in 200cards.  It’s a tough quest that really attacks from different dimensions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376269","commentId":3376269,"userName":"Jekzer","timestamp":1529184700,"content":"> 28 minutes ago, Bullroarer Took said:\n> \n> Just finished a four player run through with a couple other board members.  Really wish we’d had a few side quests early, but not one in 200cards.  It’s a tough quest that really attacks from different dimensions.\n\nTough the three? As in The Lost Realm level of tough?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376302","commentId":3376302,"userName":"Bullroarer Took","timestamp":1529186364,"content":"We played Journey up the Anduin.  It’s the only one I’ve tried so far.  All are rated at level 5 and it’s all of that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376369","commentId":3376369,"userName":"Network57","timestamp":1529194685,"content":"> 2 hours ago, Bullroarer Took said:\n> \n> We played Journey up the Anduin.  It’s the only one I’ve tried so far.  All are rated at level 5 and it’s all of that.\n\nBring ways to kill. That quest spits out a lot of enemies, and I'd forgotten how obnoxious those Core Set Wargs are."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376389","commentId":3376389,"userName":"Bullroarer Took","timestamp":1529198558,"content":"I know the first quest can be metagamed, but otherwise it’s pretty obnoxious.  I had a Goblin Sniper out and couldn’t get rid of him (solo).  Eventually I basically didn’t quest for five turns in a row and kept pulling enemies from the encounter deck.  By this time I had a bunch of allies and then got hit with the location that has X threat where X is the number of characters you control.  Game over.  Was this playtested?\n\n \n\nEdit:  Now having explored the quest and box more it really appears that Caleb wanted to force encourage us to use side quests.  Once you do that the threat of sniper lock is strongly mitigated.  If you don't have SQs, bring some engagement effects.\n\nEdited June 20, 2018 by Bullroarer Took"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376413","commentId":3376413,"userName":"Network57","timestamp":1529200747,"content":"> 35 minutes ago, Bullroarer Took said:\n> \n> I know the first quest can be metagamed, but otherwise it’s pretty obnoxious.  I had a Goblin Sniper out and couldn’t get rid of him (solo).  Eventually I basically didn’t quest for five turns in a row and kept pulling enemies from the encounter deck.  By this time I had a bunch of allies and then got hit with the location that has X threat where X is the number of characters you control.  Game over.  Was this playtested?\n\nMy Ent deck failed miserably. Waaay too slow. I'm trying a Haldir/Silvan tonight to see about clearing the staging area enemies, with Hithlain for the locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3376426","commentId":3376426,"userName":"Devaresh","timestamp":1529202628,"content":"I think the first two quests in the box have a much higher variance level then most of the more recent quests (not all of that is bad, some of it lends to replay ability).\n\nThe first one has some particular obnoxious enemy combinations that can come out, you pretty much have to be wiping the field each round or you’ll fall behind quick. I think it probably averages to a 5 but can swing up to a 6 or 7 if it doesn’t go your way. I’m curious to go back and try my dale deck against it again now that I’ve cleared through it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3377321","commentId":3377321,"userName":"Bullroarer Took","timestamp":1529330279,"content":"Having a bunch of side quests at the ready pushes the easy mode button on the first two quests.  Now on to the third..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3379809","commentId":3379809,"userName":"Bullroarer Took","timestamp":1529512180,"content":"I've played all three quests now in solo and think the ratings are \"about\" right.  While all of the adventures are side quest friendly, JutA basically demands them.  If you don't have sides you are in for a beating.  Being able to force engagement to pull down the Goblin Snipers is also really useful.  I like the variance of the second quest and the third really gives you a lot of decision points.  Having lots and lots of threat reduction really helps on the third quest.\n\nPlayer card wise the box is almost entirely centered on developing and making playable the Dale tribe.  And I'm totally good with that.  I don't think there were any Dale decks before this box and now ringsdb is littered with them.\n\nGreat job Caleb & Company."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3384106","commentId":3384106,"userName":"Nickpes","timestamp":1529902172,"content":"Played the first (Anduin) three times to win it. I made a deck with the two Dale heroes and Beravor for Lore. I also took 3 copies of the Dunedain Pipe for her to help even more card draw. Also 3 copies of Bartering (because it was mentioned above) but never used it ... Did not use any side quests, but took 3 Gandalf and 3 Sneak attack \n\nWhen I played King of Dale on the Leadership hero Brand and also Steward of Gondor on him (I think the only non thematic card I used apart from Beravor and Dunedain Pipe) everything was easiers. The Dale allies are ery usefull, all of them, they make a nice deck and their attachments also help. Never used the Neckless though which I wanted, but quest did not help. There are some hard treachury cards \n\nLiked it, maybe not a 5 but I enjoyed it anyway\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3384816","commentId":3384816,"userName":"Calvadur","timestamp":1529952327,"content":"Just finished the third quest, using a dale deck like everyone else.\n\nThe first quest was great. It played with the nostalgia, but the quest itself was 100% up to our \"modern\" standards. I also liked how the core set cards were used. The special beast deck contains some of the nastiest enemies of the core set and most of them are bound to show up, the way the quest is designed. I have mixed feelings about including the old Anduin  set, as it really contains many weak or even benefical cards. Ofc not every quest has to be Carn Dum, but it makes the quest extra swingy (a problem - if you want to say - of the complete box): If your first beast is a hill troll and you get mean encounter cards, the quest can be really challenging. If you get a blank goblin sniper and harmless locations, you have no problem setting up. But all in all the quest did a good job keeping up pressure to not feel like a breeze. Although in my two games I wasn't to far from threating out, so I decided to add sneak attack + Gandalf.\n\nI was worried how the next quest would handle the \"lost in the forest\" feeling as this kind of quest can get annoying really quick. Luckyly it didn't as the quest itself didn't force you to run circles or anything like that. And it has a ton of replayability. Sadly I wasn't really motivated to give it another try as this was the quest that felt the easiest to me, to the point it wasn't a challenge. I don't think Halldan was needed as extra support. Even story wise his company didn't really add much. The older encounter sets made this one even easier than the first quest I felt, especially the passage through mirkwood set.\n\nThe third quest is the one I lost to once, as I got location locked, what was totally my own fault. The quest is location heavy, but the included enemies are annoying and the dragon at the end is a respectable foe. It also has a nice twist when the amount of attackers is limited by your progress. But I ahve to wonder why they included something like dragon scales (the treachery that reduces any damage taken to zero and then is discarded). You just printed a 0-cost bow that popps this form the minimum damage need - one! As long as one attacker has something like this (or you have something like a gondorian spearman defend) it really doesn't do much.\n\nI am excited to play this in multiplayer, as I think the main problem (the swingy encounter card draw) will fix itself once you reveal three instead of one. Story wise I really like this one so far (more than Harad or dream-chaser) as it is a little bit more down to earth and has less dialogue about the characters itself (for me a game manual that has about two pages of to tell the story of one quest and move the plot along can't present the feelings of a character in a way I find engaging) and moves us from one location to another so you get the feeling of constant progression.\n\nThe dale archetype is insanely fun and the most \"complete\" one since the outlands - what shoud be a boon for every new player as he will have a really decent deck, just with the core set. After playing the quests I want healing in my dale deck. I didn't have any, but to tackle harder quests I am sure it will be needed. Until a sentry is set up there isn't really a good defender (everything 2 armor and three hit points - or less), what proofed to be a problem when facing the dragon as dale isn't that great at chump blocking either. I often took soe damage early and could (barely) get away with it, but stuff like the flaming attachment for the dragon could have roasted me. So I am really excited to see what I and everyone else can come up with, especially as more dale cards will be released."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3436352","commentId":3436352,"userName":"silverthorn","timestamp":1533894349,"content":"On a semi-connected matter has the WoR box come out in the UK (or is it just my FLGS's less than stellar track record for getting new FFG stuff)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3436433","commentId":3436433,"userName":"monkeyrama","timestamp":1533903082,"content":"I got mine in the UK about two weeks ago from Element Games (https://elementgames.co.uk/the-wilds-of-rhovanion-expansion-lord-of-the-rings-lcg) [https://elementgames.co.uk/the-wilds-of-rhovanion-expansion-lord-of-the-rings-lcg]\n\nThey still have 4 in stock. I can't speak for their delivery service, since I collect, but it is in the UK!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3436574","commentId":3436574,"userName":"silverthorn","timestamp":1533909935,"content":"Hmm, if the sets out in the UK it makes things more complicated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3436634","commentId":3436634,"userName":"Flrbb","timestamp":1533911914,"content":"> On 6/15/2018 at 3:09 PM, Wandalf the Gizzard said:\n> \n> Hmm, looking at the Dale decks on RingsDB, I noticed none of them include Bartering. Most likely because Dale has no way of playing Lore events. Any ideas for splashing Lore? Lore Allies and Attachments can already be played between Brand and King of Dale.\n\nSplashing Lore: As a natural fit I tried Lanwyn first, but that did not work well. Then I tried Bereavor, because some decks on RingsDB use that core hero as 3rd choice. That would be a lore hero. Anyways, I ended with Galadriel, works perfectly for me. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Also, includes a lore splash.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3457918","commentId":3457918,"userName":"alcuin18","timestamp":1535846091,"content":"So are these quests not playable without side quests because I don't have any as I didn't buy the Harad cycle or Lost Realm cycle? Should I look to buy something else first?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3460804","commentId":3460804,"userName":"Wandalf the Gizzard","timestamp":1536151578,"content":"You should be able to beat them without side-quests. They're just good choices strategically."},{"commentUrl":"https://community.fantasyflightgames.com/topic/277824-wilds-of-rhovanion-available-now/?do=findComment&comment=3460957","commentId":3460957,"userName":"Authraw","timestamp":1536161562,"content":"You'll be fine without Side Quests. I was able to beat each of these quests using just a Core Set + Wilds of Rhovannion for my blog:\n\nhttps://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]\n\nThe player cards that come with Wilds are pretty powerful."}]}