{"url":"https://community.fantasyflightgames.com/topic/278142-what-next/","title":"What next?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3381542","commentId":3381542,"userName":"player1683311","timestamp":1529632679,"content":"Very exciting news today! (The cards part for me anyhow, although pricey)  After all the news lately what's left to be excited about?  This is fun speculation not the game is ending talk. \n\n \n\nPlayer cards-\n\nHero-\n\nSaruman \n\nRadagast \n\nGollum?!\n\nSpirit Aragorn\n\nA New Bilbo \n\nThranduil\n\n(Caleb has mentioned we have a lot of Bilbos, Frodos, and Aragorns with the sagas, so I won't he surprised if we get no more)\n\nLocations\n\nI can't think of any large geographical areas yet unexplored \n\n \n\nConcepts \n\nIt seemed like Caleb teased some kind of campaign play in the state of the lcg article?\n\nAny thoughts?  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3381559","commentId":3381559,"userName":"player1683311","timestamp":1529634980,"content":"Forgot to mention scouring of the shire"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3381753","commentId":3381753,"userName":"dalestephenson","timestamp":1529665321,"content":"We do have a lot of Frodos and Bilbos with the Saga, but if you're not playing saga we have one Frodo and one Bilbo -- and the Bilbo is overpriced.  I want to see regular versions of both.\n\nAnd I think it'd be a shame if there's never a spirit Aragorn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3383822","commentId":3383822,"userName":"Calvadur","timestamp":1529870807,"content":"I have to say, I was a Little shocked we won‘t get scouring for GenCon or the Fellowship Event...\n\nFor the heroes Thranduil is my bet for the 6th AP of the Dale-Cycle (that isn‘t the offical name, is it?). Spirit Aragorn really should be released, with four specific Attachments for him from all spheres it would feel „umfinished“ to leave out Spirit. And Aragorn sure does fit the sphere. \n\nBilbo I feel isn‘t that important (yes, yes he set everything loose in the Hobbit, but as said during the counsel: he‘s out) to justify an other version. For Frodo I can See a Lore version. \n\nI doubt we will See an other Hero Istari (to much hassle to balance/make them pay for cards). Gollum really doesn‘t have something of a hero. \n\nAnd it really looks like we will have visited most regions. I personally miss Nurn (a „Mordor“ Expansion is unlikly though), outside Saga quests in Rohan (Isengart was in Dunland) and one quest in the shire (we had some stuff in breeland, but that isn‘t the same for me, but I guess scouring would cover this). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3383830","commentId":3383830,"userName":"banania","timestamp":1529871422,"content":"I don’t think a mordor cycle is any less likely that say... a Harad one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3383843","commentId":3383843,"userName":"player1683311","timestamp":1529872535,"content":"I tried to upload some cropped  photos but they are too large I guess. \n\n \n\nWe haven't been to the coast and mountains to the west of the shire, or the shire proper.  Except to set out in the grey havens. \n\n \n\nWe haven't been on the southern coast south of Isengard with the exception of dol amroth in storm of cones haven.\n\n \n\nAnd of course a lot of areas in and around rhovanion but that's happening now so I would assume we will explore those now \n\n \n\nOther than that we've gone to most places\n\n \n\nI think if we got Grima we could get Smeagol, although I admit it's unlikely.  Someone made a custom card once that was so awesome. He could search the top cards of your deck and raise your threat by x to put it in your hand, where x was it's cost, the flavor text was look what smeagol find.  That's from memory so I might not have it perfectly. Really cool and thematic. It was from an episode of cardboard of the rings. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3383845","commentId":3383845,"userName":"player1683311","timestamp":1529872618,"content":"Spirit Aragorn  needs set up text, add strider to your hand "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3383850","commentId":3383850,"userName":"Kcall07","timestamp":1529873310,"content":"Before this game ends I'd love a spirit aragorn and lore Legolas. Having more versions of your favourite characters opens up so many more deck building options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3384239","commentId":3384239,"userName":"phorcys12","timestamp":1529918270,"content":"We have a lot of places to visit in fact :\n\nRhûn, a place where we found sauron's minion but without a lot of lore about, not more than Harad. And who contains a Sea.\n\nFor Harad, We have make our way from Umbar to Far Harad, to find the south gondor by the harad road, but we haven't see the Near Harad, who is close to the Khand city, With an oriental flavour.\n\nMordor, With the sea of Nurnen and all the places of strange and torturous wild being and human slaves who could be find on this ground.\n\nIn the north : Ice bay of forochel would be great, and near we have the little island of Himling, blue mountains, Forlindon and Harlindon by make the way on the coast, to the south. Not too far of Dunland we have the Cardolan and the wood of Eryn Vorn.\n\nNear of the Gondor, We have the region of Anfalas, Andrast, Ered Nimrais, Pinath Gelin , Belfalas and Tolfalas, we see them in the stormcaller cycle, but, just a view, not the earth inside.\n\nWe have enough to put the game to 12 cycles ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3384289","commentId":3384289,"userName":"player1683311","timestamp":1529927659,"content":"Yeah I was looking at that, I couldn't get the pics to upload though, thanks for breaking it down better than I did haha.\n\n \n\nDefinitely have material for more cycles, and now we see we can easily revisit areas as well.  I don't want to get into the game is ending talk, but I'm happy with what we have, and it would be awesome to have even more. Seeing the Dale trait come alive is awesome and there are so many other archetypes out there I'm sure.   \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278142-what-next/?do=findComment&comment=3384530","commentId":3384530,"userName":"Will Anderson","timestamp":1529942835,"content":"The most likely place to go next would seem to be Dorwinion/ Rhun/ the East, maybe with a few Mordor-area quests to round out the cycle. And in Dale we're at the logical jumping off point geographically (not that I think that matters much).  I don't expect we'll ever get to see the Blue Wizards as cards, but the East would be a natural place to explore more 'wizardy' stuff; various cults, Sauron trying to influence its peoples via dark magics, etc. Tolkien doesn't give us much, and some details are delightfully contradictory (as to the success of the Blue Wizards for instance) but Caleb has shown his skill in making clever nods to the lore, and that could be easily done without needing to take direct names or quotes from the Silmarillion or other material beyond the license. \n\nAlso interested in phorcys12's suggestion of south Eriador/west Gondor. Like the East, it will require a lot of creation and extrapolation, but I don't have a problem with that. There are areas like Eryn Vorn that look able to hide all sorts of interesting secrets.\n\nI must be the only one not interested in having a spirit Aragorn! In general, I like to see completely new heroes (from the lore or FF-created), and was particularly pleased to see the new Gildor. My wish would be a couple more hobbits like Farmer Maggot or maybe a named Took from the Appendices, Thorin's sister Dis, and lots of ally versions of heroes we already have (Aragorn included!)"}]}