{"url":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/","title":"New Spotlight","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3380684","commentId":3380684,"userName":"Devaresh","timestamp":1529573869,"content":"In this latest Deck Spotlight I could help imagining Galadriel refreshing her mirror hoping for an update on her expected package...come check it out and let me know what you think! Hope you enjoy!\n\n\nhttps://reflectioninhennethannun.wordpress.com/2018/06/21/deck-spotlight-tracking-your-shipment/ [https://reflectioninhennethannun.wordpress.com/2018/06/21/deck-spotlight-tracking-your-shipment/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3380706","commentId":3380706,"userName":"Rouxxor","timestamp":1529577630,"content":"To me you are not playing the best Dale ally: knight of Dale. Sure you will not being often on valor si it won't be the best ally in your decklist but ready him for 1 resource is still great. It is so better than warrior of Dale for example.\n\nYou are also not playing steward of gondor who is as helpful as king of Dale. I have no idea if this is because you want let is to your partner. And that make me realized that I don't remember to see any explication about the context of your playing in your articles. It is sadly very common on deck explanation in our game. But building deck for playing solo, 2 or 4 players is not the same. But it is also true if you are looking for a deck for playing easy mode or a deck for beating nightmare. You have been more complete that I will ever be about describing how precise a play style can be. But you don't say any word about the one who fit the deck. Am I right?\n\nAnd that make me think about something: I don't think any player can be resumed by a single play style. Depending on the deck we made we don't act the same way and choose a play style for the deck. Of course almost everyone have patterns that make all his play style kind of close, but I see people who cover between their different decks the full horizon of the play style you have described ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3380741","commentId":3380741,"userName":"Devaresh","timestamp":1529583880,"content":"Hey Rouxxor, I’ll try and respond to your comments as best I can but keep it brief.\n\ni agree Knight of Dale is excellent, but he is not necessary for this deck. His willpower is covered by the other allies, and warrior of Dale is a much better attacker. Dale is an archetype whose greatest weakness when it comes to raw stats is their attack so I tend to prefer the warrior. Knight of Dale is totally valid though. He was in the original conception of the deck.\n\ni don’t play steward in almost any of my decks because when I bring something to multiplayer I don’t want to have that unique conflict with something my deck relies on. If my deck doesn’t need steward then why include it in the first place? I try to design most of my decks to scale from solo capable up through four players, and I test them as such. This deck can handle the whole range very adequately.\n\ni agree that people can play differently with different decks, but I would make a distinction between deck style and the personal preference of a player. There’s a lot of components within playstyle as I’ve discussed elsewhere so I won’t take up time in a Deck Spotlight to break it down. The basic premise is that players have preferences which we call play style which will mean certain decks will be more or less enjoyable to them.\n\nthis fits me in my preferences as related to theme, complexity, and variance as I’ve discussed elsewhere. The playstyle articles are more of an abstraction related to players but I could look into categorizing certain decks through that same lens.\n\nhope that makes sense and helps understand where I’m coming from! Thank for taking the time to look at the article."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381053","commentId":3381053,"userName":"Bullroarer Took","timestamp":1529600124,"content":"Aside:  The last four or five times we had group sessions nobody brought Steward.  And I think it was more that no one felt they needed it rather than not wanting to step on toes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381080","commentId":3381080,"userName":"Rouxxor","timestamp":1529602669,"content":"Knight of Dale is almost as good as warrior of Dale about attacking (same attack, warrior can have +1 in some case, knight can attack two time each turn when needed, warrior cost 4 but don't rely on having king of Dale first). But it can also quest. Or defend with the good attachment. Or do several things in this list each turn.\n\nIt is absolutely part of my play style to determine the condition where I will play my deck. Without that I can't optimize my decklists. In your deck steward will be very good for solo and double back and legacy of numenor extraordinary powerful in multiplayer.\n\nI also never agree on the steward part with the majority of player I met. You don't need steward? Fine. But you can play it because you have leadership sphere. And may be a non leadership player would use it very well. I don't see the use of playing multiplayer if you can't help them to get the cards he can't play. I'm not interested in having few interaction. That mean having a sideboard because you can also meet a player who play and need his steward. It it probably also part of my play style.\n\n \n\nEdited June 21, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381106","commentId":3381106,"userName":"Devaresh","timestamp":1529604744,"content":"I think I understand where you are coming from and you are probably right that we just are looking at it from different perspectives. \n\nI tend to build with theme in mind as well as complexity and decisions so Steward of Gondor just doesn’t interest me for the most part. But if we ever play together you’ll know it’s open for you ?. \n\nThis particular deck works to keep low threat especially early and I didn’t find I had extra resources in order to trigger knight, and I usually didn’t need his willpower. In the end it’s probably a preference thing but I just found myself using warrior. Like I said before knight was in the initial deck I just never bothered playing him.\n\nthe great thing about the game is there’s such a variety of ways to enjoy it! Thanks again for reading!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381355","commentId":3381355,"userName":"Seastan","timestamp":1529617125,"content":"> 10 hours ago, Rouxxor said:\n> \n> To me you are not playing the best Dale ally: knight of Dale. Sure you will not being often on valor si it won't be the best ally in your decklist but ready him for 1 resource is still great. It is so better than warrior of Dale for example.\n\nInteresting. In my opinion the Redwater Sentry is by far the best Dale ally we have so far. He can take the Hauberk for free and become a 4/4 sentinel defender, or the Raiment for 1 to become a 4/5 sentinel defender, or both to become a 5/6 sentinel defender. The dale trait lacks solid defending heroes, and is generally fine for willpower/attack, so I consider the Sentry ally way more valuable than the Knight of Dale."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381387","commentId":3381387,"userName":"Devaresh","timestamp":1529619305,"content":"I completely agree he is far and away the best!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278106-new-spotlight/?do=findComment&comment=3381397","commentId":3381397,"userName":"Rouxxor","timestamp":1529620331,"content":"I agree that Dale decks lack some defender. It miss so much that I pair Dale with a deck able to defend good. And since I'm only playing in multiplayer for the moment it make me see redwater sentry obviously weaker than it could be. That explain the difference between your favorite and mine ^^.\n\nThanks too for the talk by the way :)."}]}