{"url":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/","title":"Just started... did I screw up?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384375","commentId":3384375,"userName":"Magmaman","timestamp":1529935451,"content":"I found the box core set over the weekend and decided to pick it up.  Had a blast playing it solo and with my brother and immediately looked into more.\n\nApparently I arrived super late to the party.  I've noticed some of the older expansions are out or print with no timetable for a new reprint.  Should I just stick with the core set at this point?  I feel almost overwhelmed at all the cards that have been released, and if I can't even get some of the first ones it almost seems pointless.  Is this game going away?  Will there be a second edition?\n\nI'm sure this has all been discussed many times on this board, I just don't want to jump dive head first into something that I won't even be able to swim around in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384434","commentId":3384434,"userName":"Bullroarer Took","timestamp":1529938918,"content":"The game is now better - and deeper - than it’s ever been.  The existing content keeps getting reprinted and while the rate of new content has slowed somewhat there is no indication that it is stopping or that a version 2.0 is coming.  I’ve been on the game since the beginning, but in a way I am really envious of new players because they have such a broad horizon ahead of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384436","commentId":3384436,"userName":"Magmaman","timestamp":1529939136,"content":"This is good news, thanks for the reply!\n\nI'm mostly concerned about just finding old copies of expansions and packs.  I don't want to have to print out stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384485","commentId":3384485,"userName":"Authraw","timestamp":1529941091,"content":"You are probably fine. They reprint everything periodically, and they continue to announce new content. The recent \"state of the LCGs\" article suggests that there is even more content coming that we haven't even had announced yet, but it doesn't sound like a 2.0.\n\nFurthermore, you don't actually have to buy the expansions in order; it's probably a better idea to pick up whatever Deluxes are in stock right now and their associated cycle. Most of them are playable with just a Core Set, but I'm working on a blog series to suss out which ones work best:\n\nhttps://darklingdoor.wordpress.com/path-less-traveled/ [https://darklingdoor.wordpress.com/path-less-traveled/]\n\nGood luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384489","commentId":3384489,"userName":"JonG","timestamp":1529941166,"content":"A whole bunch of stuff has just been reprinted so you can pick up most cycles. The one which is unavailable is Khazad-Dum and the Dwarrowdelf cycle, and that has just been put back on the reprint list so should be around in the next few months with a bit of luck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384493","commentId":3384493,"userName":"Magmaman","timestamp":1529941223,"content":"This is great news, thanks again everyone!\n\nI didn't realize they didn't have to be played in order of expansion, that makes it way better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384495","commentId":3384495,"userName":"Devaresh","timestamp":1529941253,"content":"I agree with what’s been said. Start with what’s in stock now and you can pick up older stuff as it gets reprinted, then you won’t be waiting for the stuff that sells out of stock while you are waiting for the older stuff!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384505","commentId":3384505,"userName":"Will Anderson","timestamp":1529941704,"content":"As others have said, pick up what you can when it's available and you'll have plenty of content for a long time. I would recommend buying - or at least playing - the Saga expansions in order (these are the ones that trace the narrative from the Hobbit and the Lord of the Rings) but even that isn't strictly necessary. And I don't know where the perception that the game is on the way out comes from (though I'm sure the sudden Netrunner announcement doesn't help). I just watched a new review of LotR LCG on youtube where the reviewer, though he liked the game, seemed to take for granted the fact that it's dying, when all the evidence is very much to the contrary. Oh, and I remember feeling overwhelmed when I started with the game, and only a handful of expansions had been released. But I caught up over the years as I saw packs available or on sale and now I have all the content. Welcome to an amazing game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384532","commentId":3384532,"userName":"Bullroarer Took","timestamp":1529942898,"content":"Regarding the perception that the game is on the way out, Tiny Grimes posted a you tube video where he said \"If I were a Lord of the Rings player I would be really worried and would be looking to sell my collection.\"  (Or words to that effect.)  He doesn't play LOTR so I don't think he realizes that even if the game were to stop - and there is no indication that it's going to! - we can keep playing for a long time.  This might be causing some needless angst.  I think that the motivation to play LOTR cooperatively is very different from playing A Game of Thrones competitively (for example).\n\nOver the weekend I was thinking about all the archetypes I haven't really tried yet in spite of having played the game for so long.  I still have most of the nightmare content in front of me too.  The sky isn't falling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384537","commentId":3384537,"userName":"Wandalf the Gizzard","timestamp":1529943059,"content":"> 30 minutes ago, JonG said:\n> \n> The one which is unavailable is Khazad-Dum and the Dwarrowdelf cycle, and that has just been put back on the reprint list so should be around in the next few months with a bit of luck.\n\nPretty please, ANA :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384583","commentId":3384583,"userName":"Will Anderson","timestamp":1529944369,"content":"> 14 minutes ago, Bullroarer Took said:\n> \n> Regarding the perception that the game is on the way out, Tiny Grimes posted a you tube video where he said \"If I were a Lord of the Rings player I would be really worried and would be looking to sell my collection.\"  (Or words to that effect.)  He doesn't play LOTR so I don't think he realizes that even if the game were to stop - and there is no indication that it's going to! - we can keep playing for a long time.  This might be causing some needless angst.  I think that the motivation to play LOTR cooperatively is very different from playing A Game of Thrones competitively (for example).\n> \n> Over the weekend I was thinking about all the archetypes I haven't really tried yet in spite of having played the game for so long.  I still have most of the nightmare content in front of me too.  The sky isn't falling.\n\nI agree that the competitive model (and mindset) is very different, and in all the talk about the viability of LCGs the strengths and resiliency of Lord of the Rings can be overlooked. Hopefully the success of Arkham Horror will change some of this, but so far the history of competitive LCGs and their problems have definitely conditioned how people think about all LCGs. I'll admit I've had twinges of anxiety from time to time (mainly during the glacial release of the Harad cycle) but we have every reason to feel good about the state and direction of the game at the moment. I'd now be surprised if we don't see at least one more deluxe expansion, and who knows what else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384649","commentId":3384649,"userName":"Magmaman","timestamp":1529946008,"content":"Thanks again!  Glad to hear the general perception is the game should be around for a while yet.  I'm excited for the reprints.  Do you have to buy two-three each of the expansions like I had to do with the core if I'm just playing solo?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384731","commentId":3384731,"userName":"Network57","timestamp":1529948878,"content":"> 47 minutes ago, Magmaman said:\n> \n> Thanks again!  Glad to hear the general perception is the game should be around for a while yet.  I'm excited for the reprints.  Do you have to buy two-three each of the expansions like I had to do with the core if I'm just playing solo?\n\nOnly the Core Set. Everything else contains a full playset (i.e. 3) of every card. And usually, 2 Cores is enough. You'll be missing a 3rd Unexpected Courage, but other than that, none of the other 1-of's are worth paying for the 3rd Core."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384787","commentId":3384787,"userName":"Wandalf the Gizzard","timestamp":1529951260,"content":"If you want to store your cards in the core boxes you will eventually want a third."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3384867","commentId":3384867,"userName":"Rouxxor","timestamp":1529954418,"content":"But if you want only to store your cards you will eventually find better than a third core set ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3385013","commentId":3385013,"userName":"Wandalf the Gizzard","timestamp":1529963328,"content":"> 2 hours ago, Rouxxor said:\n> \n> But if you want only to store your cards you will eventually find better than a third core set ^^\n\nAh, you have uncovered my endless quest :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3390325","commentId":3390325,"userName":"Thaeggan","timestamp":1530327275,"content":"> On 6/25/2018 at 8:39 AM, JonG said:\n> \n> the Dwarrowdelf cycle, and that has just been put back on the reprint list so should be around in the next few months with a bit of luck.\n\nI've been waiting months for the Dwarrodelf cycle, just need two of the packs then I'm done. Getting tired of checking and there are no email alerts ?\n\nEdited June 30, 2018 by Thaeggan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278287-just-started-did-i-screw-up/?do=findComment&comment=3390882","commentId":3390882,"userName":"SpiderMana","timestamp":1530411474,"content":"As another new player, this is certainly a nice topic to stumble upon :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nMy first expansion was actually a random adventure pack, because I wanted to get Merry and it was available at a game store. I still can’t play the quest that came with it, but I don’t really have regrets about buying it?\n\nThat said, my most recent purchases have largely been in the same couple cycles, and that has allowed for immeasurably more cards that combo well together. And having gotten 3 adventure packs under the same deluxe expansion, I figure I’ve got enough quests to last me a while."}]}