{"url":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/","title":"Wait no longer","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/?do=findComment&comment=3383401","commentId":3383401,"userName":"Schrodinger&#039;s Hat","timestamp":1529814853,"content":"This card says: search the top 5 cards of the encounter deck for an enemy and put it into play engaged with you. Then reveal one less encounter card this phase. Shuffle the deck. \n\nSo- my reading is that I don't shuffle the deck until after revealing the cards. Therefore it's a primitive form of scrying; I can tell (for example) whether to use Eleanor on a treachery as I'll know if the replacement card is worse; or how many treacheries are coming so as not to waste A Test of Will on the wrong one. \n\nAm I interpreting this correctly? The shuffle doesn't have a timing but it reads like it happens last. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/?do=findComment&comment=3383408","commentId":3383408,"userName":"Rouxxor","timestamp":1529815916,"content":"You do all the effect when resolving wait no longer. So you shuffle the deck when you play the card, not after.\n\nTo be technical it could have worked differently if anywhere on the card a delayed effect would have been created (the next time you must reveal encounter cards this phase, reveal one card less and shuffle the encounter deck for example), but there is not such effect, even the \"reveal one less encounter card\" effect is resolving instantly, even if you don't see his effect at the moment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/?do=findComment&comment=3383445","commentId":3383445,"userName":"Schrodinger&#039;s Hat","timestamp":1529822681,"content":"That makes sense. It did seem like too beneficial an effect for the cost otherwise. Could do with better phrasing, but that's true of a number of cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/?do=findComment&comment=3383589","commentId":3383589,"userName":"sappidus","timestamp":1529849094,"content":"FAQ 1.21, \"Search Effects\", is future-proofing for all these sorts of effects.\n\n> Quote\n> \n> Whenever a player searches through a deck, that player shuffles the deck after searching it unless a card effect says otherwise. Players do not shuffle or change the order of a discard pile after searching it\n\nOne can quibble about searching through a deck vs. searching a segment of the deck (especially  with regards to ally Galadriel), but IMHO the intent is clear.\n\nEdited June 24, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278219-wait-no-longer/?do=findComment&comment=3384297","commentId":3384297,"userName":"Schrodinger&#039;s Hat","timestamp":1529928904,"content":"Thanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nI hadn't noticed that line in the FAQ"}]}