{"url":"https://community.fantasyflightgames.com/topic/278388-timing-question-traps-and-new-frenzied-creature-treachery-card/","title":"Timing Question: Traps and new Frenzied Creature treachery card","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278388-timing-question-traps-and-new-frenzied-creature-treachery-card/?do=findComment&comment=3386375","commentId":3386375,"userName":"JYoder","timestamp":1530068568,"content":"Interesting situation...\n\nA trap is in staging. The treachery card \"Frenzied Creature\" comes out that says, \"When Revealed: Add the top card of the Evil Creatures deck to the staging area and attach Frenized Creature to it. (Counts as a Condition attachment with the text: Attached enemy gets +1 threat, +1 attack, +1 defense and is immune to player card effects.\"\n\nSo does the creature go into staging as per the first part of the text... then the trap's passive ability first kicks in, trapping the creature (and Damrod draws a card)... and only then does the attachment go on the creature? If so, and the enemy is now immune, does the enemy get out of the trap and the trap stays in play... or does the the enemy still remain trapped?\n\nOr rather than all that, does the creature immediately become immune (by ignoring the strict order of the treachery wording) and never gets trapped to begin with? (I think I'll play it this way as it seems the intent, but seemed interesting enough to warrant a post.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278388-timing-question-traps-and-new-frenzied-creature-treachery-card/?do=findComment&comment=3386435","commentId":3386435,"userName":"GrandSpleen","timestamp":1530074803,"content":"Well, I would like it to go like this, for my sanity:\n\n-Resolve the When Revealed effect on Frenzied Creature in full, without interrupting it. \n\n-Once resolved, the new enemy is in the staging area, with Frenzied Creature attached to it, and is now immune to player card effects.\n\n-This is not eligible for a player card attachment and your trap would ignore it and wait for the next eligible enemy."}]}