{"url":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/","title":"One For All Community Deck Challenge","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3384884","commentId":3384884,"userName":"Devaresh","timestamp":1529955526,"content":"Hey everyone, I had an idea for a new community challenge for July! Please check the idea out here and let me know what you think!\n\nhttps://reflectioninhennethannun.wordpress.com/2018/06/25/one-for-all-community-deck-challenge/ [https://reflectioninhennethannun.wordpress.com/2018/06/25/one-for-all-community-deck-challenge/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3384987","commentId":3384987,"userName":"Calvadur","timestamp":1529961663,"content":"As someone who often tends to give the same deck he played the last 5 quests \"one last round\" I would welcome the idea.\n\nTo not have the same quests played 10 times I think there should be a google sheet (or something like that)  where the beaten quests are noted, which could be linked everywhere (here, RIngdDB, your blog etc.). Ofc everyone is free to play the quests he likes, but for those who would like to go for the one for all this would help I think.\n\nSo count me in! (Even though I only really have the weekends to play)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385196","commentId":3385196,"userName":"Devaresh","timestamp":1529977065,"content":"Awesome! Great suggestions! I will look into implementing them!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385457","commentId":3385457,"userName":"dalestephenson","timestamp":1530016172,"content":"I like the idea a lot, some suggestions:\n\n1) I like the idea of selecting the deck via poll.  I personally am more interested in testing tribal decks rather than power decks, but am certainly willing to leave it to the community.\n\n2) I would encourage players to supply how many attempts it took them to beat a quest -- or if they gave up trying to beat it, how many attempts before they gave up.  While I'm impressed with Seastan's One Deck for beating them all, how many attempts it took is valuable information -- and for a lesser deck that beats them all, that would be even more valuable -- someone looking at the results could say \"Hey, I could take this deck against Ringmaker cycle and be able to beat each quest in a reasonable number of attempts\" or \"Hey, if I take this deck against Against the Shadow I might want to skip Morgul Vale\".  I'd also welcome results on how many attempts a deck took in Easy Mode, especially for tougher quests.\n\n3) Coordinating quests to be attempted has a better chance of coverage, but there's an awful lot of quests.  I like the idea of having a public list so we know what's going to be tried, but it also might be useful if individuals said what they intended to try, so we can spread out a bit from the get go.  I personally like to take a deck against a contiguous cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385485","commentId":3385485,"userName":"Devaresh","timestamp":1530019172,"content":"Thanks for the feedback! I will be looking into implementing these different elements. \n\nOne thing I will be considering is breaking the quests into groups to focus on for the weeks to give a little more focus and perhaps keep the initial selection from overwhelming.\n\nSince this is sort of the first attempt at this and I’m not sure yet what the community response will be like I will be selecting the deck for July with the intent on using a poll process for the following month if it takes off ?. This is mostly because I want to test the waters!\n\ni can tell you I’m narrowing it down and all of the final candidates are tribal in nature.\n\nIm also working on a tier system for grading the success of our endeavors which will take different elements that you mentioned into account?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385511","commentId":3385511,"userName":"dalestephenson","timestamp":1530020900,"content":"The blog also says \"It can be in any player count\".  How would it work for a player count different than one?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385521","commentId":3385521,"userName":"Devaresh","timestamp":1530021610,"content":"It will be built into the tier system of grading the results at the end. So the goal will be true solo testing but a lower tier finish would be with multiplayer wins, in which case the deck would be one of the decks used in the scenario. \n\nOf course we want to see a top tier finish but I want to build in some flexibility to get as much involvement as possible?. \n\nThe cooperative option will be the lowest tier finish for the deck and when I go over the results at the end of the challenge. I’ll try and include a way to include #of attempts, player count and also what other decks were represented.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3385765","commentId":3385765,"userName":"Rouxxor","timestamp":1530031313,"content":"Interesting. I will see what deck is selected and probably play some (or a lot) of quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3388653","commentId":3388653,"userName":"Seastan","timestamp":1530206912,"content":"Great idea @Devaresh [https://community.fantasyflightgames.com/profile/324529-devaresh/]! If you don't get enough volunteers to work through every single quest, you could have them focus on the subset listed here: https://expectingmischief.wordpress.com/2018/05/22/seastans-reduced-quest-gauntlet/ [https://expectingmischief.wordpress.com/2018/05/22/seastans-reduced-quest-gauntlet/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3388746","commentId":3388746,"userName":"Devaresh","timestamp":1530210665,"content":"Thanks @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/]! That’s a good idea! I will look at working it in!\n\nalmost done working out the details and I’m hoping to have everything ready to launch Saturday for July’s One For All challenge!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3389456","commentId":3389456,"userName":"Rouxxor","timestamp":1530261269,"content":"Only 48 hours to wait :). I hope that moving out let my enough time this month.\n\n@Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/] -> Thanks for your list. I like it. Have to try it and to compare with my list, probably update my list thanks to it and then to give you a feedback :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3395991","commentId":3395991,"userName":"Rouxxor","timestamp":1530832461,"content":"@Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/]I'm getting back on the list of scenario for a testing gauntlet that you put here. It was originally put on your blog a week ago but you probably haven't notice it. Feel free to answer where you prefer.\n\nGreat list. Can I have some clarification:\n– It is only for solo play right? I don’t see many people trying to have a One Duo anyway, mostly because it is way more easy to build;\n– Does Druadan forest is the nightmare one? I always found it very easy. Probably because I often steward and/or other resource management. I even found the classic version harder, but only in high player count. In solo it seem easy both in normal and nightmare.\n\n– Battle of carn Dum standard is more interesting. The nightmare version is on the same difficulty, or may be even easier because there is less synergies between encounter effects.\n– About a storm at cobas I presume you haven’t play it with nightmare because you playtest before it release. But city of corsairs is probably in nightmare because it is an addendum, right?\n– You point it out but there is not location control needed in solo. A journey to rhosgobel is where it is the most important. Even tore than heal since every healing cards won’t be very powerful as long as Rhosgobel location is in play.\n– What do you think of steward’s fear as a “have to adapt during game” scenario? You have to either reduce the threat, avoid deck empty or put many to the quest depending of the plot.\n\nThe list will probably be more clear, but also more ugly, if you put next to each scenario if it is nightmare or not. May be using a color code as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278304-one-for-all-community-deck-challenge/?do=findComment&comment=3396701","commentId":3396701,"userName":"Seastan","timestamp":1530893544,"content":"> 16 hours ago, Rouxxor said:\n> \n> @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/]I'm getting back on the list of scenario for a testing gauntlet that you put here. It was originally put on your blog a week ago but you probably haven't notice it. Feel free to answer where you prefer.\n> \n> Great list. Can I have some clarification:\n> – It is only for solo play right? I don’t see many people trying to have a One Duo anyway, mostly because it is way more easy to build;\n> – Does Druadan forest is the nightmare one? I always found it very easy. Probably because I often steward and/or other resource management. I even found the classic version harder, but only in high player count. In solo it seem easy both in normal and nightmare.\n> \n> – Battle of carn Dum standard is more interesting. The nightmare version is on the same difficulty, or may be even easier because there is less synergies between encounter effects.\n> – About a storm at cobas I presume you haven’t play it with nightmare because you playtest before it release. But city of corsairs is probably in nightmare because it is an addendum, right?\n> – You point it out but there is not location control needed in solo. A journey to rhosgobel is where it is the most important. Even tore than heal since every healing cards won’t be very powerful as long as Rhosgobel location is in play.\n> – What do you think of steward’s fear as a “have to adapt during game” scenario? You have to either reduce the threat, avoid deck empty or put many to the quest depending of the plot.\n> \n> The list will probably be more clear, but also more ugly, if you put next to each scenario if it is nightmare or not. May be using a color code as well.\n\nSorry for not noticing your comment on my blog post. I'll reply there as to not derail this thread."}]}