{"url":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/","title":"two separate questions: good harvest &amp; attack sequence in detail","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3386576","commentId":3386576,"userName":"Flrbb","timestamp":1530098417,"content":"1. A Good Harvest reads: \"Name a sphere. Until the end of the phase, you can spend resources of any sphere when paying for cards that belong to the named sphere.\" As far as I read this, a resource match is still needed - meaning you need at least one hero of that colour (or another source which \"enables\" this card, e.g. Bard son of Brand for any item) to play that card, but you can spend resources from any source (maybe except from Treebeard ally, etc.) to pay for that card. As seen many times on ringsdb.com most people ignore the resource match condition completely. Which is the right way to play that card the strict or the lose rule?\n\n2. A question which came up my mind for the new Dale allies. Bow of Yew reads: \"Response: After attached character is declared as an attacker, exhaust Bow of Yew to deal 1 damage to the defending enemy.\" (A similar wording can be found on Yazan.) Anyhow, what appens if Azain Silverbeard has a Bow of Yew attached? a) declare an attack b) deal damage from BoY c) estimate damage from attack itself. Or is it a) c) and then b) ? This matters when b) would be needed to kill the enemy. If its a)c)b), then Silverbeards ability cannot trigger.   edit: this is also relevant for Rohan Warhorse\n\nEdited June 27, 2018 by Flrbb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3386589","commentId":3386589,"userName":"Seosaidh","timestamp":1530100101,"content":"As for your first question, it's the latter. You don't need a resource match. However, there is a caveat: 0-cost cards still require a resource match, since you are not \"spend[ing] resources of any sphere\" when playing it. So you can use A Good Harvest to play Fili when you don't have access to the Leadership sphere, but you can't use it to play A Very Good Tale."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3386596","commentId":3386596,"userName":"Flrbb","timestamp":1530101124,"content":"Hmmm, that feels even more strange to me! But ok..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3386607","commentId":3386607,"userName":"RichardPlunkett","timestamp":1530102289,"content":"From the rules: \"In order for a player to play a card from his hand (or to activate certain card effects), he must pay for it by spending resource tokens from the resource pool of a hero who has a resource icon that matches the card’s sphere of influence. This is called a resource match . Resources that are spent to pay for cards or card effects are taken from their hero’s resource pool and placed in the general token bank.\"\n\nThis is a basic rule, that controls where you can spend resource from to pay for something. Good Harvest loosens this, allowing any almost any hero to spend resources. And if you can legally spend enough resources, the play is legal. There is no constraint anywhere that you own a hero of the relevant sphere at all. This is why Ally Treebeard, or Elrond, or Hirluin can enable playing cards that don't match any heroes you own - the rule is only about spending enough legally.\n\nBut, since this rule would be broken for zero-cost cards, they get an extra rule: \"Cards with a cost of zero do not require a resource to be spent in order to pay their cost, but they do require at least one hero under that player’s control to have a resource icon that matches the card’s sphere.\"\n\nThis is an extra rule that explicitly applies just to zero cost cards. Good Harvest has said nothing to waive this rule and so it doesn't waive this rule. Thus Good Harvest can allow you to pay for 1+ cost cards of a sphere without a matching Hero, but can't enable you playing zero cost cards without a matching Hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3386622","commentId":3386622,"userName":"RichardPlunkett","timestamp":1530103737,"content":"Azain:: Response: After Azain Silverbeard participates in an attack that destroys an enemy, spend 1 resource to deal 2 damage to ...\n\nBow of Yew:: Response: After attached character is declared as an attacker, exhaust Bow of Yew to deal 1 damage to the defending enemy.\n\nThe Bow is responding to you declaring an attacker. That happens way before resolving an attack, so you either trigger the Bow then, or you don't trigger it at all. From your letters: (a) declare an attack, then (b) optionally deal damage from BoY, then (c) calculate damage from attack itself.\n\nIf you trigger the Bow, and it kills the enemy, then you haven't met the conditions for Azain's trigger, since it wasn't 'the attack' that destroyed the enemy. But responses are optional, so just don't use the Bow in those situations if you want to use Azain's trigger."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278403-two-separate-questions-good-harvest-attack-sequence-in-detail/?do=findComment&comment=3389379","commentId":3389379,"userName":"Rouxxor","timestamp":1530248363,"content":"About bow of Yew/azain he was more concerned about being able to kill a 4 defense+HP enemy and deal 2 to another enemy. He can since bow resolve first so it work the way we want :)."}]}