{"url":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/","title":"Canonical decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3388779","commentId":3388779,"userName":"tripecac","timestamp":1530211450,"content":"Is there a site which provides well-tested (and documented) player decks which:\n\n1) can be loaded into OCTGN\n\n2) are aimed at specific cycles/expansions (Khazad Dum and Dwarrowdelf can be considered a whole)\n\n3) follow progression rules (e.g., a deck to tackle Shadows of Mirkwood can't have any Dwarrowdelf cards)\n\n4) try not to completely violate the theme of the cycle (e.g., no eagles in Khazad Dum)\n\n5) are separated into solo decks or [complementary] 2-player/handed decks (one deck is lore/tactics, the other is spirit/leadership)\n\n6) are ordered (by rating, number of downloads, etc.) so that we know which decks to try first\n\n \n\nIt would be great to have \"canonical\" decks to try out first, so that we can get a feel for both the quests we're facing, and the player card synergy, before we embark on our own deck building.\n\n \n\n(I'm mentioning this now because I was reading yesterday about MECCG's official \"challenge decks\", which were a great way to shift the focus away from collection and deck building back to the actual game play.  I know for some people deck building is half the fun, but it also seems to take up half the time, so for those of us with very limited time, a set of \"canonical\" decks would be very welcome!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3388815","commentId":3388815,"userName":"GrandSpleen","timestamp":1530213188,"content":"That is a hefty set of restrictions, so the most realistic answer is no, that doesn’t exist. However, Ringsdb has a Hall of Fame which contains a lot of powerful decks (and some silly ones). Many of them won’t meet the majority of requirements that you are looking for, though. \n\nhttp://ringsdb.com/decklists/halloffame [http://ringsdb.com/decklists/halloffame]\n\nYou can download any deck on Ringsdb in an OCTGN format.\n\nThere are a number of blogs that have progression style deck series, I think, but I couldn’t tell you which ones.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3388852","commentId":3388852,"userName":"Calvadur","timestamp":1530215160,"content":"These restrictions are probably too strict to justify their own website. I don't see the public demand for something like this. But having the option would be nice.\n\nHowever I'd agree that RingsDB is your best bet to find something, as it is the deck builder gold standard at the moment. If you go to decklist and search you have some filters at your hand. For your requests that would be:\n\n1) All Rings DB decks can be downloaded as OCTGN files\n\n2) and 3) I am not sure where the real difference lies here, but you can select which packs shall be allowed for the deck you search. So If you deselect everything past Shadow and flame you will only see decks using cards up to this point, what should be helpful for finding progression style decks. If you want to search for decks the author ment to be played in a specific cycle there is no option for that, but I'd guess by searching for progressions style decks, quite a few will aim to beat the cycle they use the cards of.\n\n4) This won't be an option I fear, but some people have a thematic deck in the title and a quick look at the heroes should give you an idea if there is a chance\n\n5) RingsDB has a fellowship feature, showing the author ment that the two decks should be played together. If decks outside a fellowship are ment to be played alone or together is either specified in the title or can be explained in the deck description. \n\n6) You can sort the search results by likes, reputation of the author, release date etc.\n\nEdit: For Progression style decks you can always check out the lotr lcg progression series (either the old by the tenth nazgul or the new by the hive tyrant - don't get confused it's the same guy). Sadly the old one stopped at the release of the black riders and the new one is on a little bit of an hiatus at the moment and only covers up to the dwarrowdeld cycle. The decks there are always ment to be played together.\n\nEdited June 28, 2018 by Calvadur"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3388883","commentId":3388883,"userName":"tripecac","timestamp":1530216749,"content":"The \"feel\" I'm after is this:\n\nLet's say someone just finished the Shadows of Mirkwood cycle and is now ready to tackle Khazad Dum.\n\nThey would like to start playing right away, without spending any time creating or selecting decks.\n\nSo they download the \"canonical\" (or \"recommended\") deck [or decks, if they prefer to play 2-handed] for Khazad Dum into OCGTN (or, if they prefer to use physical cards, I presume they could follow a written list)... and away they go!  They can immediately start playing, without spending any time building or selecting decks.\n\n \n\nThe idea is to have a \"recommended\" deck (or pair of decks) for each expansion/cycle.  These decks should adhere to the progression rules (no cards from future packs).... but since the decks will be used all the way through the cycle, it would seem \"fair\" to allow cards from any pack in the cycle.  This would make it \"progression\" style at the expansion/cycle level but not at the individual quest level.\n\nFor Khazad Dum I would expect the \"recommended\" deck(s) to be full of dwarf-related cards (from any pack in the cycle/expansion), and devoid of any obviously \"non-thematic\" cards like eagles.\n\n \n\nOf course, if it's not feasible to create a single deck (or pair of decks) which can beat all quests in an expansion/cycle, then maybe the \"recommended\" decks would be presented at the quest level instead.  So, the player would have to load a new player deck for each quest.  Still, at least they don't have to do any building or selecting.  All card selection would be eliminated.\n\n \n\nSo here's a technical question: can OCTGN files store quests and player cards together?  In other words, can you load a single file which includes all the quest cards, plus the player deck(s)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389280","commentId":3389280,"userName":"Wandalf the Gizzard","timestamp":1530237912,"content":"> 5 hours ago, tripecac said:\n> \n> So here's a technical question: can OCTGN files store quests and player cards together﻿﻿?\n\nI've never tried, but when you build a new deck, there is a \"player\" tab (or something to that effect) and a \"global\" tab (for the encounter and quest deck), and two I don't remember; so I assume it could work."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389353","commentId":3389353,"userName":"CDavis7M","timestamp":1530244736,"content":"This is almost like asking someone to play half of the game for you (the deck-building half).  No such resource exists. \n\nYet hope remains while Beorn and RingsDB are true.\n\nExample for Khazad-Dum\n\n(1) http://hallofbeorn.com/LotR?CardSet=Khazad-d%C3%BBm&Sort=Sphere_Type_Cost\n(2) Identify a Hero (e.g., Bifur)\n(3) http://ringsdb.com/decklists/search [http://ringsdb.com/decklists/search]\n(4) Cards User:  Enter Card \"Bifur\" (khazad dum)  (feel free to enter more or different cards, can repeat)\n(5) Then click \"select allowed packs\" (top right of the screen)\n(6) click the ones you need (e.g., progression order)\n(7) Look for ones with lots of hearts\n(8) Thank me later\n\nhttp://ringsdb.com/decklist/view/3470/deck-tech-dwarf-starter-deck-1.0 [http://ringsdb.com/decklist/view/3470/deck-tech-dwarf-starter-deck-1.0]\n\nhttp://ringsdb.com/decklist/view/6912/core-som-and-kd-solo-dwarves-1.0 [http://ringsdb.com/decklist/view/6912/core-som-and-kd-solo-dwarves-1.0]\n\nhttp://ringsdb.com/decklist/view/6773/khazad-dum-buddies-1.0 [http://ringsdb.com/decklist/view/6773/khazad-dum-buddies-1.0]\n\n \n\nOh! I forgot to mention that the Saga quests come with recommended decks in the back of the rule sheet.\n\n \n\nEdited June 29, 2018 by CDavis7M"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389388","commentId":3389388,"userName":"Rouxxor","timestamp":1530250031,"content":"There is part of what you ask that people already do in many blogs (progression style with thematic concern). There is no notation system because there is no compare between them. What is the best? The most thematic? The most powerful? The best explanation of the decks? I feel like it is more about finding wich one of those blogs fit more to you.\n\nYou can usually download the OCTGN file of the deck using a ringsDB link in those article.\n\nIf you want to make it for a cycle instead of each pack, or to follow your complimentary rules I'm afraid that no one can do it except you. Really too specific to be another player concern ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389598","commentId":3389598,"userName":"dalestephenson","timestamp":1530279485,"content":"I don't think there's any chance of beginners being pointed at a \"canonical\" deck, outside of Beorn's Path and the Killer Deck for beginners.  However I do wonder what hero lineup/archetype would be representative of a cycle and be strong enough to stand a good chance against all quests, while not repeating any archetypes.  If restricted to cards from cycle + core, I might try something like this:\n\nMirkwood -- two handed Thalin/Gimli/Beravor [Eagles] and Theodred/Frodo/Eowyn [Rohan]\n\nKD/Dwarrowdelf -- Gloin/Bifur/Dwalin [Dwarves] -- Representative, but without Dain and Hobbit would be a bit underwhelming.  Elrond/Vilya would be stronger, but less tied to theme.\n\nHN/AtS -- LeBoromir/LeAragorn/Hirluin [Outland/Gondor].  The cycle frequently punishes non-monosphere decks.\n\nVoI/Ringmaker -- Celeborn/Haldir/Galadriel [Silvan]\n\nLR/Angmar -- Amarthiul/Arwen/TaAragorn [Dunedain]\n\nGH/Dreamchaser -- Cirdan/Galdor/??? [Noldor].  Being restricted to Cycle and core only allows LoGlorfindel as a third Noldor here.  Eowyn can discard, but without Elven Light that's not as compelling.  Denethor (either one) may be best available defender.\n\nSH/Haradrim -- Khaliel/LeGimli/SpLegolas or Khaliel/Thurindir/Hirgon [Harad].  I like the LeGimli/SpLegolas interaction, but without access to Elven Light I think the latter option may be stronger.\n\nWoR/Ered -- LeBrand/Bard2/??? [Dale] -- Want to see all the heroes in the cycle before deciding which would be the best fill-in for a Dale deck.  I think Gildor might be best of the four we know so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389628","commentId":3389628,"userName":"Rouxxor","timestamp":1530280820,"content":"Progression style mean every card release when the pack first release. Restricted Mode is to play with only core set + this particular set + the deluxe related. I am right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389645","commentId":3389645,"userName":"Wandalf the Gizzard","timestamp":1530281798,"content":"> 10 hours ago, CDavis7M said:\n> \n> I forgot to mention that the Saga quests come with recommended decks in the back of the rule sheet.\n\nDon't try them, though. They are cringe-inducingly weak."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389685","commentId":3389685,"userName":"dalestephenson","timestamp":1530283969,"content":"I've actually tried the \"suggested decks\" in Hobbit and first four LOTR boxes -- sort of.  I didn't want to tear down my main decks I was using, so when they called for something in use elsewhere (like 2x Test of Will -- I only had one spare) I left it out.  But I compensated by adding cards I wasn't using in the main decks.  The modified-suggested-decks were good enough to beat quests on easy mode.\n\nThey may be weak, but they are certainly canonical!\n\nEdited June 29, 2018 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389820","commentId":3389820,"userName":"tripecac","timestamp":1530292140,"content":"Progression vs restricted - This is a good point.  I've been collecting all the cards since the beginning (except Nightmare), so \"progression\" represents my particular buying habits.  Someone new to LotR LCG might not want to buy EVERYTHING up to, say, the first LotR saga quest just so they can try that saga out.  OCTGN might not care what people have actually bought, so progression-vs-restriction is not an issue there, but it doesn't seem right to encourage newcomers to favor OCTGN over physical cards in order to have access to \"canonical\" decks.  Perhaps this is why no progression-style canonical decks have been defined (officially) yet.  Hmmm.  Definitely something to think about!\n\nEliminating deck building - I'm just thinking of what I would love to see, in terms of making the game more \"inviting\" to someone with limited time, space, and/or experience with deck building games.  For me, the fun part is playing the quests (a reactive/tactical activity), not choosing cards (a proactive/creative activity).  I like the idea of deck building, but not the process of it (mechanically).  I also don't like \"throwing things away\"; I don't like removing cards from decks if those cards have proved useful in the past, so I tend to want to play with the same decks over and over.  Being \"forced\" to try radically different decks would be very refreshing for me, and it would not be stressful because someone else would be doing the sorting and \"throwing away\".  Make sense?\n\n \n\nMaybe if/when I create a LotR LCG site, I can add in a feature that lets people submit and rate \"canonical\"/\"suggested\" decks (and pairs of decks) for each quest or cycle.  Each deck (or pair) would need to be flagged as progression vs restricted vs \"open\" (completely unrestricted), and we'd leave it up to the player to decide which \"canonical\" filters to use when finding decks.  (I'd personally play with progression decks since that matches my buying/playing habit.)  Also, there could be varying levels of thematic adherence (no eagles in moria).\n\nBut them again, the more \"flavors\" of decks presented, the less \"canonical\" each deck would seem, which sort of defeats the purpose.  The whole goal is to define a single deck (or pair of decks) for each quest or cycle, with zero options, just pick a quest and start playing immediately (after scanning your player deck to see what was chosen for you).\n\nFor me, it's the elimination of choice that's attractive.\n\nSo here's a question:\n\nHow would you rate the difficulty of each of these restrictions:\n\n1) using a single progression deck per cycle  (any cards from core set through the end of the cycle)\n2) using a single restricted deck per cycle  (any cards in core set, this expansion, and this cycle)\n3) using a single progression deck per quest  (any cards from core set through this particular quest pack, but not later packs in cycle)\n4) using a single restricted deck per quest  (any cards in core set, this expansion, and packs in cycle up through this pack)\n\n \n\nWhich of those restrictions do you think is viable, for coming up with a single canonical deck (or pair of decks) per cycle/quest, aimed primarily at beginner/intermediate players?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389880","commentId":3389880,"userName":"dalestephenson","timestamp":1530295852,"content":"> 47 minutes ago, tripecac said:\n> \n> So here's a question:\n> \n> How would you rate the difficulty of each of these restrictions:\n> \n> 1) using a single progression deck per cycle  (any cards from core set through the end of the cycle)\n> 2) using a single restricted deck per cycle  (any cards in core set, this expansion, and this cycle)\n> 3) using a single progression deck per quest  (any cards from core set through this particular quest pack, but not later packs in cycle)\n> 4) using a single restricted deck per quest  (any cards in core set, this expansion, and packs in cycle up through this pack)\n> \n>  \n> \n> Which of those restrictions do you think is viable, for coming up with a single canonical deck (or pair of decks) per cycle/quest, aimed primarily at beginner/intermediate players?\n\nIt depends on what the goal is.  If we are primarily concerned with the difficulty of *building* the deck, restricted deck(s) per cycle are clearly best.  That requires much more limited purchases and a single construction will allow the play of nine different quests.  If we are primarily concerned with the difficulty of *defeating* a quest, then having recommended progression-style decks per quest will clearly allow the most powerful decks.\n\nOf course, the most powerful deck possible is likely not desirable for beginning players to use against quests that are not the most powerful.  I think archetypal decks of various sorts would be useful for new players so that they can easily try a new type of deck, but it's far less important IMO that they be optimal.\n\nAnd ultimately, any player who would prefer netdecking has a *wide* variety of decks already available to choose from at ringsdb, easily filtered to include only the sets they wish.  You could play LOTR 24/7 for the rest of your life and never run out of interesting decks to try that someone else created, at least while ringsdb stays up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3389989","commentId":3389989,"userName":"tripecac","timestamp":1530301455,"content":"> Quote\n> \n> I think archetypal decks of various sorts would be useful for new players so that they can easily try a new type of deck, but it's far less important IMO that they be optimal.\n\nYeah, this is my feeling too.  As a relative \"beginner\", I am definitely looking to try different deck styles, but don't like having to \"shop around\" for them.  I want to be told \"use this deck\" and then go try it.  In other words, when it comes to player decks, I want more \"direction\" and fewer (or no) options. \n\nI know a request for \"direction\" and \"restriction\" might be the opposite of what deck building fans enjoy about the game.  But honestly, the sheer number of options, blogs, decks, strategies, opinions... it's all a bit overwhelming!  For me, at least.\n\nLet's put it this way:\n\nWhen I get a new video game, the first thing I do (after optimising the graphics) is google \"best build\" or \"best class\" or \"best faction\"... and then I go with whatever the consensus recommends.  I don't like making choices before knowing their ramifications!  So when I'm unfamiliar with something (e.g., a new quest), I prefer to follow the \"safe path of common wisdom\" rather than trying to be inventive.  It's only later, when I feel I have a \"good enough\" understanding of the game, that I start experimenting and \"doing my own thing\". \n\nI'm sure I'm not the only one with risk aversion!  Other Tolkien gamers would probably appreciate the safety of a \"default deck\" (or \"recommended deck\") as well.  Of course, maybe risk averse gamers tend not to choose deck building games, or games with so much randomness!  Maybe they tend to prefer grinding through MMOs like LOTRO, where gradual progress is pretty much guaranteed!  (I've spent about 100 times as many hours in LOTRO as in LotR LCG although I started both around the same time!)\n\nDo any of you feel the same way, or understand that feeling of being presented with TOO MANY OPTIONS?  Do you see how the elimination of deck building decisions could actually make LotR LCG more attractive to certain types of people?\n\nEdited June 29, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390004","commentId":3390004,"userName":"GrandSpleen","timestamp":1530302450,"content":"Since the game is game is built on the idea that you are free to build whatever deck you choose, and the game is designed well enough that you can be successful with many, many different decks, you're not going to find community consensus on \"best build. Your best bet is maybe to select one community member who regularly contributes decks which generate \"buzz\" (meaning, comments, likes, etc) and just pick decks out of that person's published deck lists on RingsDB.  Seastan comes to mind, but he has like 200 published decks so that's probably not what you're looking for.  Beorn from Hallofbeorn?  Anyway, nobody is going to come forward and say \"use this deck\" and eliminate options FOR YOU, there isn't consensus in the community about \"these 5 decks are the best,\" it doesn't exist, so instead YOU have to eliminate options by narrowing your search field.  You can solve this problem without waiting for the community to create a resource which doesn't exist.\n\nOne way to do that? Just search within one established community member's deck lists, as described above."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390117","commentId":3390117,"userName":"Seastan","timestamp":1530307955,"content":"I would recommend just taking a deck from some experienced deckbuilder that has posted their progression-style deck(s) on ringsdb. Here are some examples:\n\nBeorn's Path, by Beorn (up to Return to Mirkwood):\n\nhttps://bit.ly/2Ncc7I8 [https://bit.ly/2Ncc7I8]\n\nThe Progression Series, by TheHiveTyrant (up to the Long Dark):\n\nhttps://bit.ly/2Nemtr4 [https://bit.ly/2Nemtr4]\n\nThe Line Unbroken, by Warden of Arnor (up to the Dread Realm):\n\nhttps://bit.ly/2Ncc538 [https://bit.ly/2Ncc538]\n\nThat last one covers more than 5 cycles, as well as saga quests and nightmare quests, and is still ongoing. I think it satisfies your request:\n\n1) can be loaded into OCTGN\n\nYes, these are RingsDB links.\n\n2) are aimed at specific cycles/expansions (Khazad Dum and Dwarrowdelf can be considered a whole)\n\nYes, these are progression style decks\n\n3) follow progression rules (e.g., a deck to tackle Shadows of Mirkwood can't have any Dwarrowdelf cards)\n\nYes, these are progression style decks\n\n4) try not to completely violate the theme of the cycle (e.g., no eagles in Khazad Dum)\n\nSince these decks are built for quest progression, not cycle progression, they differ from quest to quest throughout the cycle. But since you are playing cycle progression you can simply pick the first deck that you find does not violate the theme (theme is a subjective thing after all).\n\n5) are separated into solo decks or [complementary] 2-player/handed decks (one deck is lore/tactics, the other is spirit/leadership)\n\nYes, the decks I linked are all clearly labelled.\n\n6) are ordered (by rating, number of downloads, etc.) so that we know which decks to try first\n\nAny of the decks linked above were used successfully to beat the quest and were put together by an experienced player, so they can be trusted to work without relying on number of likes. In general, progression decks don't get a ton of attention on RingsDB."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390136","commentId":3390136,"userName":"dalestephenson","timestamp":1530308726,"content":"I'm curious, so these are the most-liked progressive (but non-saga) decks not in a fellowship:  (I'm going to exclude saga so I don't have to remember what saga expansion came out when)\n\nMirkwood:  http://ringsdb.com/decklist/view/951/back-to-basics-a-killer-deck-using-cards-from-1-core-set-1.0 [http://ringsdb.com/decklist/view/951/back-to-basics-a-killer-deck-using-cards-from-1-core-set-1.0]\n\nKD: http://ringsdb.com/decklist/view/3470/deck-tech-dwarf-starter-deck-1.0 [http://ringsdb.com/decklist/view/3470/deck-tech-dwarf-starter-deck-1.0]\n\nAtS:http://ringsdb.com/decklist/view/5593/minimum-purchase-the-siege-of-cair-andros-1.0 [http://ringsdb.com/decklist/view/5593/minimum-purchase-the-siege-of-cair-andros-1.0]\n\nRingmaker:http://ringsdb.com/decklist/view/42/seastan-s-boromir-1.0 [http://ringsdb.com/decklist/view/42/seastan-s-boromir-1.0] (note -- was constructed before Boromir was nerfed)\n\nAngmar: http://ringsdb.com/decklist/view/1107/dneglin-1.0 [http://ringsdb.com/decklist/view/1107/dneglin-1.0]\n\nDreamchaser: http://ringsdb.com/decklist/view/1167/denethor-does-not-care-for-your-bullsh-t-nsfw-1.0 [http://ringsdb.com/decklist/view/1167/denethor-does-not-care-for-your-bullsh-t-nsfw-1.0]\n\nMore serious Dreamchaser: http://ringsdb.com/decklist/view/1782/the-very-wise-captain-1.0 [http://ringsdb.com/decklist/view/1782/the-very-wise-captain-1.0]\n\nHarad: http://ringsdb.com/decklist/view/3807/deck-tech-harad-starter-deck-1.0 [http://ringsdb.com/decklist/view/3807/deck-tech-harad-starter-deck-1.0]\n\nFour of these decks are by Seastan, two are Deck Tech Starter Decks by chrsjxn.  Deck Tech may be the sort of archtype-decks you are looking for, Seastan is well known for power decks that stimulate damaging errata.\n\nIf you want restricted, and insist that it must have cards from APs and not just deluxe, this is what you'd get:\n\nHobbit: http://ringsdb.com/decklist/view/4745/ohauh-hobbit-period-deck-leadership-spirit-1.0 [http://ringsdb.com/decklist/view/4745/ohauh-hobbit-period-deck-leadership-spirit-1.0]\n\nLOTR: http://ringsdb.com/decklist/view/684/ffg-s-the-black-riders-starting-deck-1.0 [http://ringsdb.com/decklist/view/684/ffg-s-the-black-riders-starting-deck-1.0] (Yes, this is the suggested deck from BR)\n\nMirkwood: http://ringsdb.com/decklist/view/306/beorn-s-path-4-the-hunt-for-gollum-leadership-lore-1.0 [http://ringsdb.com/decklist/view/306/beorn-s-path-4-the-hunt-for-gollum-leadership-lore-1.0]\n\nKD: http://ringsdb.com/decklist/view/2781/minimum-purchase-shadow-and-flame-1.0 [http://ringsdb.com/decklist/view/2781/minimum-purchase-shadow-and-flame-1.0]\n\nAtS: http://ringsdb.com/decklist/view/6364/you-need-no-core-set-if-you-have-the-outlands-1.0 [http://ringsdb.com/decklist/view/6364/you-need-no-core-set-if-you-have-the-outlands-1.0]\n\nRingmaker: http://ringsdb.com/decklist/view/8495/deck-tech-grima-starter-deck-1.0 [http://ringsdb.com/decklist/view/8495/deck-tech-grima-starter-deck-1.0]\n\nAngmar: http://ringsdb.com/decklist/view/3147/minimum-purchase-the-wastes-of-eriador-1.0 [http://ringsdb.com/decklist/view/3147/minimum-purchase-the-wastes-of-eriador-1.0]\n\nDreamchaser: Couldn't find one that used APs and had 1+ likes, there were a couple that just used Grey Havens.\n\nHarad: http://ringsdb.com/decklist/view/9060/one-core-harad-cycle-only-kahliel-s-friends-1.0 [http://ringsdb.com/decklist/view/9060/one-core-harad-cycle-only-kahliel-s-friends-1.0]\n\nLots of choices...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390154","commentId":3390154,"userName":"dalestephenson","timestamp":1530309702,"content":"> 8 hours ago, dalestephenson said:\n> \n> I don't think there's any chance of beginners being pointed at a \"canonical\" deck, outside of Beorn's Path and the Killer Deck for beginners.  However I do wonder what hero lineup/archetype would be representative of a cycle and be strong enough to stand a good chance against all quests, while not repeating any archetypes.  If restricted to cards from cycle + core, I might try something like this:\n> \n> Mirkwood -- two handed Thalin/Gimli/Beravor [Eagles] and Theodred/Frodo/Eowyn [Rohan]\n> \n> KD/Dwarrowdelf -- Gloin/Bifur/Dwalin [Dwarves] -- Representative, but without Dain and Hobbit would be a bit underwhelming.  Elrond/Vilya would be stronger, but less tied to theme.\n> \n> HN/AtS -- LeBoromir/LeAragorn/Hirluin [Outland/Gondor].  The cycle frequently punishes non-monosphere decks.\n> \n> VoI/Ringmaker -- Celeborn/Haldir/Galadriel [Silvan]\n> \n> LR/Angmar -- Amarthiul/Arwen/TaAragorn [Dunedain]\n> \n> GH/Dreamchaser -- Cirdan/Galdor/??? [Noldor].  Being restricted to Cycle and core only allows LoGlorfindel as a third Noldor here.  Eowyn can discard, but without Elven Light that's not as compelling.  Denethor (either one) may be best available defender.\n> \n> SH/Haradrim -- Khaliel/LeGimli/SpLegolas or Khaliel/Thurindir/Hirgon [Harad].  I like the LeGimli/SpLegolas interaction, but without access to Elven Light I think the latter option may be stronger.\n> \n> WoR/Ered -- LeBrand/Bard2/??? [Dale] -- Want to see all the heroes in the cycle before deciding which would be the best fill-in for a Dale deck.  I think Gildor might be best of the four we know so far.\n\nOut of curiosity I went looking for my hero lineups on ringsdb, without regard to deck contents:\n\nThalin/Gimli/Beravor -- 5 distinct decks (one was triple published)\n\nTheodred/Frodo/Eowyn -- 5 decks\n\nGloin/Bifur/Dwalin -- 2 decks\n\nLeBoromir/LeAragorn/Hirluin -- not one\n\nCeleborn/Haldir/Galadriel -- 40 decks, not necessarily all distinct\n\nAmarthiul/Arwen/TaAragorn -- not one\n\nCirdan/Galdor/{core/dreamchaser} -- 3 decks (one LeDenethor, two Theodred)\n\nKhaliel/LeGimli/SpLegolas -- 1 deck\n\nKahliel/Hirgon/Thurindir -- not one\n\nBrand/Bard2/{core} -- 3 decks (one Theodred, one Dunhere, one Eleanor)\n\nSo off all my suggested lineups, only one is actually widely used and three combinations have no decks at all.  One of the things I like about this game is that there's a *vast* amount of user-created content -- and yet so many things that have never been publicly tried."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390167","commentId":3390167,"userName":"Seastan","timestamp":1530310074,"content":"@dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] I find that list to be mostly filled with poor recommendations. RingsDB \"likes\" seem like a bad way to select \"canonical\" decks. People give likes to power decks or those that use crazy or unique card combos, not decks that give a regular play experience and are well balanced to the quests.\n\nFor example, no one in their right mind should use my Minimum Purchase decks if they are playing cycle progression. Minimum purchase uses only cards from the sets required to build that specific encounter. It makes the quests very hard. Can't use Winged Guardian against Siege of Cair Andros, for example. Yet, people give the deck likes because it's an interesting challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390333","commentId":3390333,"userName":"dalestephenson","timestamp":1530327813,"content":"Seastan I agree it's not a great list of decks to play, more of a curiosity -- though it really depends on what you're looking for.  I think the \"Deck Tech\" decks are the closest fit to what I would look for in a \"canonical\" deck, clean concept well executed, but not so strong that it will steamroll everything.  Still, I'm not completely clear what level of challenge tripecac wants, and if he is wanting to find power decks sorting by \"likes\" is a good starting point -- the curiosity/joke decks that are highly liked are fewer in number and also pretty obvious.\n\nThere's an ample supply of progression decks to examine at ringsdb.  Core + cycle decks are much rarer, so there are less to choose from.  Minimum purchase decks have the advantage of fitting that criteria; but unfortunately neglect APs they aren't addressing.  I find it odd that so few players choose to construct their decks from the same pool the testers are believed to actually lose; but I don't do it either.\n\nXanalor's Back to Basics deck is a strong core-only deck with 6 vacancies; supplying a six-card sideboard for each quest in a cycle, drawing on the cycle's own card pool might provide a combination of predictable gameplay and by-rote customization.\n\nI've done some deck analysis in the past to estimate usage for all sorts of cards (given the card pool drawn on for the deck), and sometime I'd like to draw on that to find or create the most *stereotypical* deck for each tribe or archtype.  That would be my preference for a \"canonical\" deck, but I don't know if it would interest anyone but me.  And I've got so many decks I've already created I haven't had a chance to play with yet...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3390702","commentId":3390702,"userName":"tripecac","timestamp":1530392467,"content":"I definitely like the \"stereotypical\" deck idea!\n\nIt doesn't have to be the best performing...  it just needs to be one that introduces a deck building \"idea\" to the new[ish] player, but hopefully doesn't put theme over performance so much that it becomes hard to win.  So it'd need a balance between theme and performance.\n\nWhen you play with aggressively themed decks, do they tend to suffer from too-narrow a focus?\n\nIf so, maybe in a \"canonical pair of decks\" (for 2 players or 2-handed solo, which I prefer), one deck could be aggressively themed, and the other  could cover the gaps?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3391088","commentId":3391088,"userName":"dalestephenson","timestamp":1530451696,"content":"When you get into paired decks, the complexity of deckbuilding ratchets up and the clean lines of a \"stereotypical\" deck are likely to be lost.  I think there are exceptions, of course.  Traps and Dunedain go together like peanut better and jelly.  Gondor and Rohan have a strong thematic link, and having both out at once with global Rohan/Gondor buffs can make Mutual Accord powerful.  There's so many dwarven-swarm heroes that Dain's global buff practically demands a fellowship.  But even in these cases supporting the fellowship will make the stereotypical deck less stereotypical.  For quests that scale against the solo player, combining two solo decks with complementary spheres can often work well without any special changes.\n\nMy thinking is that a stereotypical deck designed for new-ish players might go something like this:\n\n1) Identify the stereotypical hero lineup for archetype. (e.g. Rohan -- SpTheoden/SpEowyn/TaEomer is probably the stereotypical lineup).\n\n2) Add staple cards for the sphere(s) used from a single core set\n\n(add 3x Gandalf, 2x Feint, 2x Quick Strike, 2x Test of Will, 2x Hasty Stroke, 1x Unexpected Courage, 2x Galadhrim's Greeting, 1x Dwarven Tomb.  35 cards left.)\n\n3) Add 3x attachments/allies/events essential for the archetype\n\n(3x Gamling.  32 cards left.)\n\n4) Add 2x attachments particularly associated with the heroes\n\n(2x Herugrim, 2x Snowmane, 2x Firefoot.  Guthwine is mightly awesome for a Rohan deck, but we don't have leadership. Windfola is left out because even though it names Eowyn, she gets no special benefit from the card.  26 cards left.)\n\n5) Add other cards associated with the archetype in order of popularity -- 1x for uniques ally/attachments, 3x for non-uniques, unless they are hero attachments.  Try to avoid 1-offs from cycles not already used.  Add 2x unique for especially popular uniques.\n\n(So for Rohan we've used LOTR saga for Theoden, Herugrim, Snowmane, Gamling.  Eomer/Firefoot are from VoI/Ringmaker.  We'll try to avoid using only a single card from cycles other than those two.\n\nAdd 2x Hama, 24 cards left.\n\nAdd 3x Westfold Horse Breeder [VoI 2] 21 cards left.\n\nAdd 2x Rohan Warhorse [VoI] 19 cards left.\n\nAdd 3x Escort to Edoras [Mirkwood] 16 cards left.\n\nAdd 3x West Road Traveller [Mirkwood} 13 cards left.\n\nAdd 2x Hama [Saga] 11 cards left.\n\nAdd 3x Westfold Outrider [Mirkwood] 8 cards left.\n\nAdd 1x Eomund [Mirkwood] 7 cards left.\n\nAdd 1x Golden Shield [Saga] 6 cards left.\n\nAdd 3x Westfold Horse Breaker [Mirkwood] 3 cards left.\n\nAdd 3x Riddermark's Finest [Mirkwood].  Deck complete.\n\nThe \"popularity\" is an estimate, I was using my deck analysis post and falling back on Hall of Beorn's popularity for more recent cards.  I feel bad about leaving out some great Rohan-related events that only make sense in a Rohan deck (Mustering the Rohirrim will only appear in a Rohan deck), and it's a shame to leave out the new Riddermark Knight.  But this should be a reasonably solid solo Rohan deck and it exercises the Rohan style -- discard your Rohan allies, bring them back with Gamling.  And it doesn't take a lot of purchases to build -- Mirkwood cycle, VoI + Dunland Trap, and three saga expansions.\n\nAnyway, that's the sort of thing I have in mind.  There's 22 authors at ringsdb with that exact hero lineup and some are more powerful and some are more thematic (and quite possibly, both)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3941687","commentId":3941687,"userName":"tripecac","timestamp":1589938270,"content":"Back in 2019 I made a point of playing LotR LCG at least once a week.  I made it through Mirkwood, Dwarrowdelf, and the Hobbit saga.  I then started Heirs of Numenor.  And that's where I got stuck.  Over and over I tried to beat \"Peril in Pelargir\" but never got close.  I dutifully smashed  my head against that scenario each weekend, but those sessions lost any semblance of \"fun\".  The frustration was most likely due to the fact that I refused to abandon my Dwarf decks.  I just didn't want to deck build.  I kept hoping I would get a lucky card draw, but it never happened.\n\nThen, for my 2020 New Year's resolution, I decided to finally start Gloomhaven (which I'd bought more than a year ago).  Once I got Gloomhaven unpacked and the rules read, I realised that Gloomhaven is not just a table hog, but a time hog... and that I really didn't have enough time (or mental energy) to play both Gloomhaven and LotR LCG on a weekly basis.  So, I decided for 2020 to focus on Gloomhaven and put LotR LCG on hold (or \"hiatus\"). \n\nAlthough I haven't played LotR LCG since 2019, I still keep reading about it, listening to podcasts, and collecting the new packs and play mats.  It's a terrific game, and I am still passionate about it... even though I don't play it.\n\nBut this brings me back to the top of canonical decks.\n\nOver and over as I listen to podcasts (particularly Card Talk), I think about how nice it would be to deck choosing rather than deck building.  I would much rather decide between one of a handful of pre-constructed themed decks... and not worry about making card choices myself.\n\nGloomhaven has a little bit of deck building, but for level 1 characters your card choices are very limited... For example, for the Brute I think you need to pick 10 of 13 cards.  So you are basically just choosing 3 cards NOT to use.  This choice is very easy and fast compared to LotR LCG, where you have to select 50 cards from a set of many, many hundreds of cards.\n\nWhen I am starting a scenario in LotR LCG, I would like to pick a deck, try it a couple times, and if that doesn't work, pick a different deck.  Nice and easy.  I don't want to have to choose cards.  At least, not until I have A LOT more experience with different deck types.  Right now I just know Dwarves (Dwarrowdelf and Hobbit saga), since I don't really count those sloppy hodge podge decks I played back during the Mirkwood cycle.  Dwarves were the first \"real\" decks I played, and so far remain the only \"real\" decks I've played.  I've never tried decks based on Hobbits, Elves, Eagles, Outlands, or any of the other themes.  Just Dwarves.  And that's because I do not enjoy building decks from scratch.  At all!\n\nSo...  Have there been any efforts recently in getting together some \"canonical decks\"? \n\nFor example, I'd love something that would help me tackle Heirs of Numenor... as long as it's progression-style (at least at the cycle level, if not the pack level) and relatively thematic.  I'm guessing it would be Outlands, since that's the archetype introduced in this cycle.  I don't mind using cards from later in the cycle, so is there a \"canonical\" Outlands deck which is designed to get through this cycle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3941719","commentId":3941719,"userName":"GrandSpleen","timestamp":1589945993,"content":"This discussion seemed to inspire dalestephenson to make his “stereotypical” deck series, in which he analyzes a bunch of published decks for a certain trait or hero or mechanic (like “silvans”), and publishes a deck list that is essentially an “average” of all those decks. Just search for “stereotypical” on ringsdb.\n\nBut this doesn’t your criterion of being 1)progression style or 2) intended to be used to play a particular cycle. So the actual answer is probably no, there is no community effort to create that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=3941836","commentId":3941836,"userName":"dalestephenson","timestamp":1589974356,"content":"You could try to adapt a stereotypical deck to your needs by replacing the cards from later cycles, this may be easier for you than building a deck for scratch.  For example, the Outlands stereotypical deck uses only one distinct card (2x Prince of Dol Amroth) later than Against the Shadow.  One of the heroes is later (LeDenethor), but you can swap him out for Theodred to get resource acelleration.  Gondor was the other main archtype enabled by that cycle, but the Gondor stereotypical deck uses quite a few post-AtS cards and two later heroes (LeDenethor and LeFaramir).\n\nIf you don't mind losing progression then both decks would probably work reasonably well against the cycle, since they're capable of both regular and Battle/Siege questing and they're monosphere.\n\nWhile there's not a canonical Outlands deck identified by the community, there are a LOT of progression decks at ringsdb.  If you enable only the packs through AtS and then search for decks using Hirluin, I think you'll find a lot of Outlands decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4004135","commentId":4004135,"userName":"whittaker007","timestamp":1603333672,"content":"I would love so much to have a menu of preconstructed progression style decks to choose from for a given quest. We have pretty much everything up to Haradrim and we enjoy playing the game but the deck building part just takes too much time and dedication that we just play something else even though we keep wanting to come back to it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4004479","commentId":4004479,"userName":"tripecac","timestamp":1603386821,"content":"Yeah, that would be awesome!\n\nI've been playing deck builders recently (Dominion, Quest for El Dorado), and I have come to realise that I am pretty horrible at choosing cards!\n\nIn a game as hard as LotR LCG, I'd love for someone else to do the building so that I can focus on what I think is the fun part, the playing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4004894","commentId":4004894,"userName":"whittaker007","timestamp":1603421472,"content":"For now we're following The Line Unbroken progression series at https://wardenofarnor.wordpress.com/the-line-unbroken/ [https://wardenofarnor.wordpress.com/the-line-unbroken/] which is pretty close to what we're after in that it follows a progression style (using cards up to and including the current mission) and seeks to highlight cards from the scenario pack you're playing. That means that you get exposed to a whole lot of thematic cards that you wouldn't find in a more hardcore competitive deck, but with choices made to deal with the specific challenges of that quest. So you don't have a lot of overpowered general use combos, but tools appropriate for the job, making the quest a challenge but doable.\n\nIt comes with lists for 2 players which is ideal for us, and works well if you want to solo two-handed. The only issue for us is that while the progression style limits the card pool (a good thing in my opinion) it has no limitations on the number of copies of cards in the pool. In some cases that means there might be two full sets of cards that are 1-offs in the core set, so if you want to use actual cards you'd need 6 core sets! We've only got 2 core sets, so I've printed up a bunch of proxies to fill the gaps. We're 2/3rds of the way through the Mirkwood Cycle, so my assumption is that the number of proxies required will drop as the card pool increases.\n\nBut we're actually playing again, which is the main thing!\n\nThe other thing is, if we manage to play long enough, we'll get familiar with staple cards which are often or always included for particular challenges and eventually will have an understanding of how particular cards and combos deal with those challenges and give us the confidence to start tinkering with the decks provided and tune them to our own preferences. This is stuff that only comes with experience, it's just that getting the experience is difficult when dealing with a daunting monster like LoTR!\n\nEdited October 23 by whittaker007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4005687","commentId":4005687,"userName":"tripecac","timestamp":1603588103,"content":"Thanks for posting that.  It looks promising!\n\nEven though I buy all the cards, I play on OCTGN, so 6 [virtual] core sets is no problem!\n\nA couple questions based on what you've seen before:\n\n1) How often do they use decks which have the players sharing [non-neutral] spheres (for example, each player using Spirit cards)? \n\nI've always given 2 spheres (usually Leadership and Lore) to player A and the other 2 (Tactics and Spirit) to player B.  I got into that habit because I original played the physical version with just one core set, and we pretty much *had* to give each player separate spheres.  I wonder if that's a bad habit.  Seeing how The Line Unbroken addresses that issue could be revelatory!\n\n2) How far did you get before starting over with The Line Unbroken?\n\nPlease keep us updating on your process!\n\nEdited October 25 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4006081","commentId":4006081,"userName":"whittaker007","timestamp":1603706865,"content":"1. From what I've seen they are mostly split 2/2 though occasionally you'll see one deck that's mono or close to it, and sometimes a sphere is splashed across both players. That said we've just gotten started with Line Unbroken so haven't looked too far ahead to see what's in store.\n\n2. Prior to starting it we played through the core set and played up to Conflict at the Carrock, then after getting smashed by the trolls a few times we switched over to The Hobbit and finished that.\n\nEdited October 26 by whittaker007"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278487-canonical-decks/?do=findComment&comment=4006550","commentId":4006550,"userName":"TwiceBorn","timestamp":1603754210,"content":"I've been playing through The Grey Havens and Dream-Chaser cycle, and now through the Sands of Harad using the same heroes throughout, aiming for semi-thematic progression style. Both decks are Lore/Spirit only.\n\nI've founded these hero combos to be really effective:\n\nDeck 1:\n\nAragorn (Lore)\n\nBeravor (Lore)\n\nGlorfindel (Spirit)\n\nStarting threat: 27\n\n \n\nDeck 2: \n\nEleanor (Spirit)\n\nIdraen (Spirit)\n\nFaramir (Lore)\n\nStarting threat: 29\n\n \n\nEach deck usually contains A Test of Will x3, Envoy of Pelargir x3, and Lembas x3 (the latter being put into play by Deck 2 via Elf-Friend). I have occasionally made use of Resourceful for resource acceleration, but I've mostly relied on the Envoys of Pelargir and Songs of Wisdom/Travel for resource smoothing, and have found that's generally all I need. \n\nI haven't used Gandalf at all until reaching The Long Arm of Mordor (quest 3 in the Sands of Harad), where I've found OH&UH Gandalf to be almost essential.\n\nEdited October 26 by TwiceBorn"}]}