{"url":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/","title":"Tried to play with real cards...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3390991","commentId":3390991,"userName":"tripecac","timestamp":1530424993,"content":"In half an hour...\n\nSpent 29 minutes\n\nSorting cards\n\nSigh.\n\nBack to OCTGN.\n\n \n\n...unless someone has tips on making deck building faster???"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391001","commentId":3391001,"userName":"CaffeineAddict","timestamp":1530427985,"content":"I keep the player cards in binders sorted by sphere, type and release order, so I can find any card with minimal effort. When you disassemble a deck, put everything straight back where it should be.\nKnow your decklist up front (i.e. a ringsdb decklist, or whatever), and deck building only takes a few minutes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391006","commentId":3391006,"userName":"banania","timestamp":1530429525,"content":"Looking at those gorgeous cards in their binder and slowly taking them out to build a deck is precisely what OCTGN can’t give you. I also find it helps being creative just because you stumble upon seldom used cards which you’d never have included in a build otherwise.\n\nBut from what I could understand on your topic on canonical deck, you do not enjoy that part of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391007","commentId":3391007,"userName":"John Constantine","timestamp":1530429645,"content":"I don't have binders, but my cards are strictly sorted by type, and within type they are sorted by cost, so I always know what is where."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391034","commentId":3391034,"userName":"Rouxxor","timestamp":1530437393,"content":"I keep all my deck and scenario ready to play. Many hours of preparation but absolutely no time when I want to play :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391065","commentId":3391065,"userName":"player1683311","timestamp":1530445798,"content":"I use the dividers by ryno on bgg for encounter cards, and I like to keep 4 or 5 decks built at a time.\n\nThe biggest challenge i find is keeping decks built that use a lot of similar cards, often I use copies of brok iron fist and the like and just sharpie elven light or daerons runes on them.\n\n  If you make the decks in spare time that isn't near your cards, as long as they are organized by sphere it's pretty easy to pull the cards for multiple decks at a time. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391066","commentId":3391066,"userName":"player1683311","timestamp":1530445938,"content":"Binders for me take too much time to put them away or swap out.\n\n \n\nI like playing with physical cards, i dpnt really like OCTGN although I can obviously see the convenience and speed of it "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391241","commentId":3391241,"userName":"tripecac","timestamp":1530475352,"content":"It was an experiment, really...\n\nI had half an hour, and wanted to see if I could use that time to beat the easiest (and therefore fastest quest): Passage Through Mirkwood.  To keep game play as fast as possible, I decided to play solo one-handed.\n\nSo I opened up my LotR LCG box for the first time since I'd tried it with my kids a few weeks ago.  Inside I found the decks we had played with: 3 single-sphere decks, one for each of us: Leadership, Tactics, Spirit... about 30 cards each.\n\nBut I didn't want to play with an invalid, single-sphere deck: I wanted a normal deck.  So I tried to quickly slap together a spirit/leadership deck to play against Passage Through Mirkwood. \n\nNow, in theory, it should only take about 5 minutes to extract 50 decent cards, 25 each from Leadership and Spirit.  Easy-peasy, right?  At least, that's how it is in OCGTN.\n\nWell...\n\nNo. \n\nBecause I couldn't just pick out the 50 cards I wanted to play with.  I also had to put back all the other cards in their proper slots within my binders. \n\nAnd it's that sorting and stowing of all those other cards which consumed about 24 of those 29 minutes.\n\nYou see, I just couldn't leave the cards in chaos and expect to enjoy playing.  I couldn't.  Chaos bothers me.  Work first, play later.\n\nSo the work came first.  The sorting.  29 minutes.  Gone.  No time left to play.\n\n\"Well, at least I'm ready to play next time.\"\n\nWhenever that will be.  Months from now, perhaps?\n\nAnd what happens if between now and then I decide to try Spirit + Tactics instead?  Will I feel compelled to put all the Leadership cards away in their proper slots?  And how much time will that take?\n\nTo me, it's this card sorting/stowing aspect which consumes SO MUCH TIME that I find it hard to excited about playing with the real cards.  Because I'm hardly every playing... It seems like I spent 90% of the time sorting.\n\nImagine a video game where 90% of the time is spent fiddling with inventory management.  Not fun!\n\nSo that is how I often feel when I think of playing with the physical cards.  There's not much actual \"playing\".  Just lots of inventory management.  Overhead.\n\nDoes anyone else feel this way?\n\nIs that what drives many of us away from the cards and back to OCGTN, Lackey, etc.?\n\nAnd, for those of us who are *trying* to get back into the cards, perhaps in order to play with other people (e.g., our kids), what are some ways to reduce the overhead?\n\nCertainly having \"long term\" player decks would help.  The more quests we can tackle with a single deck, the less overhead we have to deal with...\n\nSo, the idea of using a single deck (or pair of decks) all the way through a cycle is VERY appealing to me.  (Hence, the \"Canonical Decks\" topic).\n\nWhat other things can be done to reduce the amount of time spent sorting and stowing cards?  What can make it less \"painful\" to try out a deck which is radically different from the one we're playing with right now?\n\nBinders definitely help keep the cards organised and browsable, but there is still the physical overhead of sorting cards and then putting unused ones back in their correct slots.\n\nSo.... what if we maintain two decks: one complete \"display\" set in our binders (for seeing what cards we have and deciding which ones to use) and then all the duplicates in a big \"sloppy\" pile, from which we dig out the cards we want to use?   That way, we don't need to spend any time putting cards away when we're done with them.  We just leave them in the sloppy pile.  Then, maybe once every cycle or so, we can \"tidy up\" our \"sloppy\" pile if we want, but ideally there would be no sense of obligation.... it should be able to stay \"sloppy\", as long as our \"display\" set is kept 100% perfectly organised. \n\nHas anyone tried this?  Does it work?  Or does a \"sloppy deck\" make it too slow to locate cards (especially as the number of packs we open increases)?  Or does the very existence of a sloppy deck grate against OCD instincts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391247","commentId":3391247,"userName":"Kjeld","timestamp":1530476433,"content":"> 17 minutes ago, tripecac said:\n> \n> So the work came first.  The sorting.  29 minutes.  Gone.  No time left to play.\n\nOut of curiosity, how long did it take you to write this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391248","commentId":3391248,"userName":"GrandSpleen","timestamp":1530476466,"content":"Mine are sorted in 550 count card boxes, one box for each sphere, and sorted by type within there.  But no further sorting.  It's pretty fast to find what I need, binders strike me as slow because of the physical aspect of slotting them in and out.  And they take up a lot of space themselves.  \n\nI definitely keep a successful deck together for a while, and when I was newer to the game it definitely took me longer to put decks together and play.  Still though, I spend more time thinking about decks and putting them together on Ringsdb than I do actually playing.  That's kind of the nature of the game, and I've heard that sentiment echoed a bunch of times from other community members on podcasts and the like.\n\nAre you aware that there is a digital version on the horizon?  It's not the same as the physical game, more like 'inspired by' the physical game.  But it might be more up your alley.  If spending 29 minutes organizing the physical cards bothers you, but spending a similar amount of time writing a forum post about organizing cards, doesn't bother you, perhaps you just have more time that can be easily devoted to digital tasks, or it suits you better, or something.  No offense meant by that at all , you've just have several long forum posts recently, and the overriding theme seems to be that you don't have enough time to do the menial task of designing a deck, so it's a little on the ironic side. Maybe stick with digital?\n\nEdited July 1, 2018 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391264","commentId":3391264,"userName":"tripecac","timestamp":1530479000,"content":"> Quote\n> \n> Out of curiosity, how long did it take you to write this?\n\nWell, computer time is much \"cheaper\" than living room table time, since I'm not cluttering up that room... but yeah, I know I could have sorted quite a few cards in that time! \n\nHowever, I am really thinking of the future and am trying to establish \"good habits\" early on (although the car is still in park so to speak)...  \n\nI was listening to a podcast the other day and the host said he had played more than 200 games of LotR LCG!  So I was thinking: how in the world does he find time for that, if each game requires 30 minutes of card-related overhead (sorting/selecting/stowing)...  Do I really need to spend 100 hours sorting cards???\n\n> Quote\n> \n> Are you aware that there is a digital version on the horizon?\n\nYeah, a computer version has been my hope for a long time, and it was my first guess when I heard about the \"big news\" back in December:\n\nSince then I've been following (at a distance) the news about the digital version.  I'm not very impressed with the cartoony look of it, or the fact that the developers couldn't find a way to stay faithful to the card game, but I still want to support FFG's LotR forays so that they don't lose the license like ICE did...   I therefore preordered that collector edition set.  I don't have high hopes for the digital version, since it's not the same game.  But it will be fund to try out nonetheless.  To be honest, I'm more excited that OCTGN finally put in a save feature!  I've been begging for that for years!\n\nBut anyway the digital versions are neat, but they don't let me play the game in the living room with my kids; I need to use the real cards for that.  And it's the card management that I'm struggling with at the moment.\n\nWhat surprises me is that I saw a survey a while ago that showed that many more people play the physical version more than OCTGN!  To me, that seems backwards.  Or maybe some of the OCTGN players didn't buy the cards, so felt guilty about entering a survey?  I don't know.  Maybe not everyone is as OCD as me: buying the cards (to fulfill the collector's impulse and support the company) but playing OCTGN (to avoid having to obsessively sort the cards each time).\n\nI see what you're saying about binders, though... they do slow down the storage a bit.  But they look great!\n\n \n\n \n\np.s. How do we prevent our URLs from being turned into boxes like that?  I just wanted to post the URL!\n\nEdited July 1, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391287","commentId":3391287,"userName":"CaffeineAddict","timestamp":1530480969,"content":"Honestly this seems an odd perspective to me. I don't play on OCTGN and i won't be playing the digital version - I enjoy the game because it *isn't* a computer-based game, but a physical one. Building the decks and handling the cards is a big part of the experience. It seems strange that you would expect people who play a card game to prefer playing a digital version of that card game.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391306","commentId":3391306,"userName":"Wandalf the Gizzard","timestamp":1530482763,"content":"> 2 hours ago, tripecac said:\n> \n> Imagine a video game where 90% of the time is spent fiddling with inventory management.\n\nI've played that game before . . .\n\n> 1 hour ago, GrandSpleen said:\n> \n> Mine are sorted in 550 count card boxes, one box for each sphere, and sorted by type within there.  But no further sorting.  It's pretty fast to find what I need, binders strike me as slow because of the physical aspect of slotting them in and out.  And they take up a lot of space themselves.  \n\nI had my cards sorted like this too, but switched because it felt too cluttered flipping through big stacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391313","commentId":3391313,"userName":"Bullroarer Took","timestamp":1530483238,"content":"Can’t agree with tripecac.  Love playing with the real thing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391314","commentId":3391314,"userName":"tripecac","timestamp":1530483320,"content":"> Quote\n> \n> I enjoy the game because it *isn't* a computer-based game, but a physical one.\n\nWell, originally I got into LotR LCG because of the tangible, non-computer aspect.  That, and the fact that I've been semi-compulsively collecting Middle Earth games since the '80s (my dad's office was right next to ICE so I used to snag MERP stuff out of their dumpster!)\n\nI played the first couple of LotR LCG scenarios with real cards, but then Dol Guldur kicked my butt... so I started watching tutorials on how to play LotR LCG, and in those tutorials I saw OCTGN, and realised how much easier it would be to shuffle and sort cards virtually... so I tried LackeyCCG and OCTGN, and stuck with the latter because it was easier to learn.  My only gripe with OCTGN was the lack of a save feature, which they have now! \n\nSo for me, OCTGN is the most user-friendly way to play LotR LCG.\n\nBut it's not the most family-friendly, since it requires me to be glued to my computer for the Nth hour in a row.\n\nThat's why I'm trying to find a way to improve the convenience of playing with real cards.  I'd love to play LotR LCG out in the living room, with the kids (or at least with them nearby)... \n\nBut painstakingly sorting and selecting cards isn't what I call \"playing\"... it's more like work.  And the girls see that and think \"how boring\"!  It's not the best way to get them enthused about LotR gaming!\n\nEdited July 1, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391327","commentId":3391327,"userName":"GrandSpleen","timestamp":1530484247,"content":"I definitely prefer physical cards, but with a toddler in the house I am just not very able to break them out often. Definitely doing OCTGN more than anything else, but mostly I want to play new content, which is not on OCTGN. As a result, I am just not playing very much."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391344","commentId":3391344,"userName":"mewmartigan","timestamp":1530486005,"content":"> 1 hour ago, CaffeineAddict said:\n> \n> Honestly this seems an odd perspective to me. I don't play on OCTGN and i won't be playing the digital version - I enjoy the game because it *isn't* a computer-based game, but a physical one. Building the decks and handling the cards is a big part of the experience. It seems strange that you would expect people who play a card game to prefer playing a digital version of that card game.\n> \n>  \n\nThis is how I feel. Haven't played OCTGN and won't play the digital version. I like the card game, I like the cards and art and I really like having a fun game that is NOT in front of a computer or TV screen.\n\nHaving said that, I do agree that sometimes rifling through the cards to build the decks can take a while even though I have them all boxed and separated out with dividers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391369","commentId":3391369,"userName":"Onidsen","timestamp":1530488480,"content":"Have you considered doing your deckbuilding on something like ringsdb and then just using your limited playtime to pull the exact cards you want out and make the deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391386","commentId":3391386,"userName":"dalestephenson","timestamp":1530489839,"content":"I build my decks on ringsdb, and then assemble them from binders while at my computer.  At any given time I usually have two decks constructed, so teardown and setup happen at the same time; I never tear down my old decks until I want to build new ones."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391410","commentId":3391410,"userName":"mewmartigan","timestamp":1530491992,"content":"> 56 minutes ago, Onidsen said:\n> \n> Have you considered doing your deckbuilding on something like ringsdb and then just using your limited playtime to pull the exact cards you want out and make the deck?\n\nMaybe I worded it wrong. I actually don't do deck building....I don't really have a lot of time to play and don't know all the cards well enough. I pull decklists from RingsDB all the time and then build them. It can just take time with such a large collection of cards (and I am still missing a bunch) to return the cards from the previous deck and pull the cards for the new one. This is also why I try to take a single deck through a whole cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391574","commentId":3391574,"userName":"tripecac","timestamp":1530515886,"content":"> It can just take time with such a large collection of cards (and I am still missing a bunch) to return the cards from the previous deck and pull the cards for the new one. This is also why I try to take a single deck through a whole cycle.\n\n\n\nYeah, I feel the same way about that.  If only the card returning/pulling could be automated somehow!\n\nOCTGN was, for me, a necessity.  Most of the games of LotR LCG I've played have been when traveling; when I'm home most of my \"geek time\" is spent playing Steam games... but when I travel I just have my laptop, and it can't handle modern games, so I played slower games instead... like LotR LCG via OCTGN.  When I am home it is very, very rare than I play LotR LCG.\n\nHowever, tonight, I followed up what I said and actually played a game of LotR LCG with REAL CARDS!\n\nPassage Through Mirkwood.\n\nLost the first game (pretty horribly), but won the second (thanks, Sneaky Gandalf!)\n\nSo yeah.  Losing to Passage Through Mirkwood...  That shows about how much experience I have with the game after all these years, and all those hundreds of dollars!!!\n\nNow the next step is fixing my deck so that I have a chance with Anduin.  But I think of all those cards I have to sort and I just mentally cringe at the amount of work ahead of me.\n\nI think mewmartigan said it perfectly:\n\n\n\n> I don't really have a lot of time to play and don't know all the cards well enough.\n\n\n\nWhen we don't have (or make) a lot of time to play LotR LCG, we tend to feel like we don't know \"enough\" to be able to efficiently build decks.  Sure, we can semi-randomly through some ideas together, but we're aware that we'd probably lose, and would have rebuild, which means doing another bunch of card sorting...  And because we're daunted by the card overhead, we shy away from playing very frequently...\n\n...until when we finally DO try to play after a long break, we end up getting our butts kicked by Passage Through Mirkwood.\n\nOkay... well, maybe by \"we\" I must mean me.  I don't think anyone else is eager to join me in the \"Struggling Through Mirkwood\" club!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391594","commentId":3391594,"userName":"Crusaderlord","timestamp":1530520051,"content":"I do sort mostly ryno style by sphere and then ally / encounter / event - all are in my original core box. I have another core box which holds my encounter cards, tokens etc\n\nBut then i started to extract theme sets - so whilst the above exists i do have all the dwarf , hobbit and silvan/noldor elf cards (mixed up spheres) in their own blocks. I tend to produce decks by theme so it works better for me. This kind of leaves Gondor, Dunedain, Eagles and Rohan mixed in with all the more generic ones. \n\nI am not sure if what i do is better but it makes it easier to think, ah i want a dwarf deck and i can look through all the dwarf specific inter-rated cards. A decent head knowledge of cards really helps, and even then you forget many of them exist. Using ringsdb is very useful to get you started with a deck.\n\nNothing beats using physical cards though for me, that is why i play the game. Up to my early 40's I used to play computer games all the time and now in my early 50's i never do, i prefer board or card games and the interaction i have with components. \n\nEdited July 2, 2018 by Crusaderlord\nadded content"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391600","commentId":3391600,"userName":"banania","timestamp":1530521120,"content":"The best way to enjoy this game is to play it.\n\nI think a lot of us spend more time thinking and writing about the game than actually playing it, and are ok with that.\n\nI think the main issue you may have is that you want a card game but want to play it as a computer game.\n\nYes, taking a deck out of your binder takes 24minutes, and 2.4 seconds on octgn. So you’ll find yourself playing the same deck quite a number of times with the physical cards, tweaking it, adapting it to tour play experience and many expected defeat. That is supposed to be thr game experience delivered by this game. And once your deck is built, taking it out of the deckbox is 2.4 seconds, setting up the quest a few minutes at most then go and play.\n\nYou just have to accept you won’t be changing your deck every time you play.\n\nAlso, you can prepare your deckbuilding on ringsdb and once you have your list, the extraction of cards is certainly not 24minutes.\n\nSlow down and enjoy the sleeving/desleeving, it soothes the mind! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 2, 2018 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391621","commentId":3391621,"userName":"Crusaderlord","timestamp":1530523612,"content":"> 43 minutes ago, banania said:\n> \n> Slow down and enjoy the sleeving/desleeving, it soothes the mind! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nCrazily i sleeve everything, which worked fine when the old cycle boxes perfectly fitted in the sleeved encounter cards set once you took out the player cards. Now the new plastic ones do not fit them in and i put them all in a spare core box, but i feel slightly let down by this if i am honest. Really i should not bother putting sleeves on every pack given you only play one encounter at a time - i know its a waste but i cant help myself at the moment. I can however get a sleeved deluxe box to work by snipping off a bit of the cardboard insert to lower the height a little. \n\nI need to have a stern talk with myself and only sleeve the encounter deck currently in use. I think i will always sleeve all the player cards though.\n\nEdited July 2, 2018 by Crusaderlord\ncorrection"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391624","commentId":3391624,"userName":"banania","timestamp":1530524214,"content":"I do the exact opposite. All my encounter cards are sleeved but I only sleeve the player cards of my current decks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391710","commentId":3391710,"userName":"Crusaderlord","timestamp":1530537383,"content":"This is one game where sleeved cards i feel is quite important. The amount of shuffling and restarting i do, even some of the older and more used sleeves show some wear and occasional scratch marks. I would hate to play this without them and risk heavy wear to the more useful cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391800","commentId":3391800,"userName":"tripecac","timestamp":1530543609,"content":"I had all my cards sleeved at some point.... and then removed all the sleeves after trying to play with my girls - the cards felt like they were sliding all over the place.\n\nI did notice yesterday a little of that \"wear\" Crusaderlord mentioned (on the edges).  So now I'm contemplating sleeving them again. \n\nDo you keep them sleeved, or only sleeve the cards you are actively playing with?\n\n(By the way, my family was happy to have me playing with the cards in the living room yesterday, but I think they wanted to play a game *with* me...  That's something else to think about now that my girls are old enough to play interesting games!)\n\nTime, time, time..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3391981","commentId":3391981,"userName":"TheGuardian118","timestamp":1530553203,"content":"Personally I want to sleeve everything. Limitations on the stock of the Ring sleeves has caused me to not be able to sleeve all player cards at all times, but I do sleeve all encounter cards cause the Eye sleeves are still in stock. Eventually I'll sleeve everything though. (I don't have the largest collection myself)\n\n \n\nNot sure how old your daughters are, but other card games might be a good gateway to this one. Maybe try Pokémon or something with a little more cartoony art. Learning how to organize/deckbuild with something like that could be more fun for them, then eventually do the same with this one. (I still play Pokémon as my competitive TCG)\n\n \n\nDepending on your collection, if you're looking to play something together that just works, the Dwarf archtype is an easy one to put 3 decks that synergize together, probably four if you needed. You just need the last part of the Mirkwood Cycle, Khazad-Dum, then the Hobbit sagas and/or the out of print Dwarrowdelf cycle. (Hopefully it comes in print soon!!!) You probably already knew that, but I thought it worth mentioning for others.\n\n \n\nGet a couple of the $2-3 deck boxes to store the ready-to-go decks.  I have four of the cheap Ultrapro deckboxes that I use for this. Two keep my two decks that I'm playing with, one keeps the encounter I'm playing, and the last is either a second encounter, sideboard options, or third deck depending what I need at the time. I always play one handed for now, but like having at least 2 decks ready to go. (Currently Tactics/Spirit and Leadership/Lore) By having an extra deck box for the sideboard, it can really cut down on setup time. When you are taking that 30-60 minutes to pull the collection out/build deck/put it away, at the same time you can pull out an extra 10-15 cards per deck to swap in when the encounter changes and you need to adapt your deck. Lots of treacheries that discard attachments? Swap out a few attachments for some cancellation. few treacheries but lots of enemies? Maybe drop the cancellation for more allies or healing. I find this is the easiest way for me to cut down on the \"Administrative\" time needed with the game, as well as keep things always ready if my wife or a friend wants to join a game. (Doesn't happen often, but when it does I need to jump on that opportunity!)\n\nThese are what I use: https://www.amazon.com/Ultra-Pro-Orange-Purple-Yellow/dp/B00EABSFRA/ref=sr_1_1?ie=UTF8&qid=1530553031&sr=8-1&keywords=ultrapro+deck+boxes [https://www.amazon.com/Ultra-Pro-Orange-Purple-Yellow/dp/B00EABSFRA/ref=sr_1_1?ie=UTF8&qid=1530553031&sr=8-1&keywords=ultrapro+deck+boxes] This is a set of 6 for $10 through Amazon, assuming USA. (I bought mine from my local card store; I forget exactly how much they were there.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3392293","commentId":3392293,"userName":"Wandalf the Gizzard","timestamp":1530568086,"content":"I wish I could sleeve mine cards. I used to, but I realized I'd rather always buy more cards, than bother sleeving. I probably should though, my cards are not in the safest of places what with little hands (and paws) around the house."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3424835","commentId":3424835,"userName":"Wandalf the Gizzard","timestamp":1533222777,"content":"@tripecac [https://community.fantasyflightgames.com/profile/177282-tripecac/] FFG's new unique deck card game, \"Keyforge,\" sounds like it might be fir you. It's basically a CCG, but instead of random cards in a booster, you get one complete, viable deck different from every single other booster deck. There is no deckbuilding/sorting involved.\n\nEdited August 2, 2018 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278590-tried-to-play-with-real-cards/?do=findComment&comment=3432032","commentId":3432032,"userName":"Valdemart","timestamp":1533639879,"content":"Just to chime in - I have sorted my player cards in 17 plastic bags, roughly 30% larger than the cards:\n\n * Four for the Heroes of each sphere\n * Three per sphere, separating the Allies, Events and Attachments&Side Quests into different bags. Additionally all the cards in each bag are arranged by cost (which is extremely important when pulling a deck together)\n * One for all of the Neutral cards, arranged like this - Gandalf (of course), Allies, Events, Attachments, Side Quests, also by cost.\n\nI started my collection on a later stage of the game, so Progressive style is not my thing and these 17 bags work wonders. Without the sleeves a deck done in RingsDB is compiled in less than 5 minutes.\n\nSeparating the heroes has also helped me when deciding what new Fellowship to make when playing with my wife."}]}