{"url":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/","title":"Hummerhorns vs Sneak attack and Son of Arnor","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3394424","commentId":3394424,"userName":"Nerd_Dad88","timestamp":1530725525,"content":"New player here and just played my first game with the Leadership starter deck vs Mirkwood. How does Son of Arnor's effect work? Does he do damage in the staging area or does it just count as declaring a defender like normal? I'm having trouble understanding how you resolve the effect of this card. \n\nEdited July 4, 2018 by Nerd_Dad88\nTypo and grammatical reasons"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3395216","commentId":3395216,"userName":"dalestephenson","timestamp":1530798821,"content":"Son of Arnor allows you to engage an enemy when he comes into play, but that response is totally optional.  You don't have to do it, and if Hummerhorns are in the staging area, you absolutely do *not* want to do it.  Leave them there!\n\nWhere Son of Arnor's response might be useful is for a card like Goblin Sniper you'll meet in the second quest.  It can't be optionally engaged if there are any other enemies in staging, and with a 48 engagement threat he's not going to engage automatically.  So he'll sit in the staging enemy and damage you every turn.  Son of Arnor can bring him to you.\n\nAnother case might be if during the planning phase there's an enemy in staging you know you will engage this turn.  If you play Son of Arnor you can engage him before the questing phase, so his threat won't count against you.\n\nOther than his response, Son of Arnor is just an ally like any other.  Since he has no willpower and no defense you'll probably just use him as an attacker, exhausting him during the combat phase to add 2 to your combined attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3395323","commentId":3395323,"userName":"Nerd_Dad88","timestamp":1530804362,"content":"Awesome, thank you for clearing this up. I couldn't find a clear answer for what I was looking for and this is perfect!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3395378","commentId":3395378,"userName":"Rouxxor","timestamp":1530807066,"content":"Another tricky way to use it is to put it in play when it is players turn to attack (using sneak attack for example), so, for this turn, the chosen enemy will not attack but can be killed.\n\nEdited July 5, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3395590","commentId":3395590,"userName":"GrandSpleen","timestamp":1530817283,"content":"Rouxxor is just talking about useful ways to use Son of Arnor against any enemy.  To avoid any confusion, I wanted to reply to confirm that Hummerhorns will deal its damage  regardless of when you engage it (Rouxxor is not suggesting a way to avoid Hummerhorn's damage)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278762-hummerhorns-vs-sneak-attack-and-son-of-arnor/?do=findComment&comment=3397938","commentId":3397938,"userName":"Wandalf the Gizzard","timestamp":1531003543,"content":"> On 7/4/2018 at 1:32 PM, Nerd_Dad88 said:\n> \n> How does Son of Arnor's effect work? Does he do damage in the staging area or does it just count as declaring a defender like normal?\n\nSon of Arnor does not deal damage to enemies in the staging area. It simply engages one (synonymous with it engaging you). That means it is moved from the staging area to in front of your play area. It will attack you and you can attack it during the combat phase.\n\nHummerhorns will still deal the five damage to hero if you engage it with Son of Arnor."}]}