{"url":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/","title":"State and Future of the Game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3398845","commentId":3398845,"userName":"BigKahuna","timestamp":1531124346,"content":"So after playing Lord of the Rings now for a couple of years, my collection constantly growing and my appreciation for the game still at its height I have noticed that in the last 4-5 months its become increasingly hard to find the sets still missing from my collection.  I supposed its natural for the game to slow down but I would have thought that with the new Deluxe Expansion and the announcement of the upcoming digital re-imagining of the game that the support for the existing LCG was secure for the foreseeable future.  There are appear to still be some re-prints on the agenda in the future as well.  \n\nI'm thinking maybe I need to seek out alternative sources, I'm curious for the guys in Europe like me, where you shop to purchase expansions/cycles etc..  Right now I have quite a few gaps and while I gave up a long time ago of trying to collect in release order (pretty much just buying what is available), I still find it difficult to get a hold of certain expansions.  Are there any robust (stocked) online sources in Europe for Lord of the Rings?\n\nAlso I'm curious if there is any news or information about the future support for Lord of the Rings?  There have been a couple of LCG's that have reached end of life and it sort of felt like it happened without much warning.  Has there been any official news or information regarding the future plans for Lord of the Rings LCG, how long it will remain an active game, whether or not we can expect reprints of all sets in the future and stuff like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3398993","commentId":3398993,"userName":"Wandalf the Gizzard","timestamp":1531142158,"content":"Not another one . . .\n\nHow many times must it be said?\n\nTHE GAME IS NOT DYING.\n\nAnd yes, the older sets will eventually be reprinted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3399012","commentId":3399012,"userName":"JonG","timestamp":1531143819,"content":"Hi BK.\n\nI'm a Brit and currently stocks for everything look pretty good. Supplies for about 3 - 4 cycles reached the UK a couple of weeks ago.\n\nI purchase stuff from Gameslore, and looking at them the only exceptions are Khazad Dum/Dwarrowdelf (which I think was reprinted last year and promptly sold out), the standalones, and a couple of the sagas. Looking at the Upcoming pages of FFG they have put this stuff back into the print queue so it will come. \n\nOne can never tell of course, but generally speaking the future of the game looks healthy. They did a state of LCGs a couple of weeks back, and Caleb was discussing developing cycles where you have character progression. As well as the starter box and the Ered Mithrin cycle, we're also getting two new standalones this year. \n\nHope that helps. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3399149","commentId":3399149,"userName":"dalestephenson","timestamp":1531151067,"content":"At the moment the only *known* new content in the future is the current cycle and the two new quests in the \"Limited Edition Starter\".  However, if the game were to be end-of-lifed after the current cycle, I question the business decision of creating a Limited Edition *starter*.  Pre-built decks that complement the core set I think would have the most utility in getting someone into the game, and I would not be surprised if the Limited Edition Starter were to become a non-limited product (with regular art) in the future as an alternate, cheaper entry point into the game than the core.  I don't think we're near being done, assuming sales remain respectable and the license is in hand, and that all the out-of-print cycles will eventually be reprinted as they always have before. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3399155","commentId":3399155,"userName":"Bullroarer Took","timestamp":1531151295,"content":"A couple years ago we had both Matt & Caleb working on content and they were putting out a deluxe, a cycle and a saga every year.  Matt is now the principal designer for Arkham and Caleb has been contributing to the digital game.  So yes, things have slowed down.  But there is no indication they are stopping or that the \"game is dying\".  From my perspective the game is better than ever.  So many play styles are now viable and people are finding new ways for things to work.  It's like we went from limited (the core set) to standard (the first few cycles) to modern (our entire card pool).  I'm loving it.  Do I wish for more content?  Sure!  But we have been told there is a lot in the pipe and Caleb is trying to branch the game out even more.  It's a great time to be a fan.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3399201","commentId":3399201,"userName":"JonG","timestamp":1531152814,"content":"> 26 minutes ago, dalestephenson said:\n> \n> At the moment the only *known* new content in the future is the current cycle and the two new quests in the \"Limited Edition Starter\".  However, if the game were to be end-of-lifed after the current cycle, I question the business decision of creating a Limited Edition *starter*.  Pre-built decks that complement the core set I think would have the most utility in getting someone into the game, and I would not be surprised if the Limited Edition Starter were to become a non-limited product (with regular art) in the future as an alternate, cheaper entry point into the game than the core.  I don't think we're near being done, assuming sales remain respectable and the license is in hand, and that all the out-of-print cycles will eventually be reprinted as they always have before. \n\nDale, 2 new standalones have also been confirmed for Gencon and Fellowship this year.  You may recall that they have a competitive element. \n\nIn the state of the LCG document, Caleb commented that he was aware of the difficulty in providing enough new stuff to meet fan demand. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3400045","commentId":3400045,"userName":"BigKahuna","timestamp":1531213305,"content":"Well this certainly wasn't intended as a post to start controversy, I was really more curious about the sources people use to purchase sets as I'm finding mine have dried up considerably.\n\nOne thing I think does give me a good feeling is that they are re-releasing the core set with this new starter set thing, I can't imagine them doing that and then suddenly canceling the game.  So that is great news."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3400598","commentId":3400598,"userName":"banania","timestamp":1531248794,"content":"If you can’t wait for some player cards I have player cards for a dozen adventure packs (not the quests). Let me know if you’re interested. I’m in France so hopefully we can work out acceptable shipping."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3400673","commentId":3400673,"userName":"icabod","timestamp":1531251852,"content":"Certainly in the case of Netrunner, production is stopping due to the license expiring - I think if they had the choice they would continue, but they don't own the copyright.  Nate posted an article about the State of the LCG [https://www.fantasyflightgames.com/en/news/2018/6/8/state-of-the-lcg/], and it all looks pretty good for the upcoming year at least.\n\nRegarding where to buy - I'm in the UK and have had good experience buying from Book Depository.  I only have the first cycle (Shadows of Mirkwood), but 5 of the packs came from there, and I was notified when stock came in.  Decent prices too (average of £11 per pack, free postage), assuming you can find the correct search term to find what you want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3413414","commentId":3413414,"userName":"LochNess2112","timestamp":1532377770,"content":"Curious if the new Amazon series will provide a source for or inspire new content."},{"commentUrl":"https://community.fantasyflightgames.com/topic/278968-state-and-future-of-the-game/?do=findComment&comment=3413422","commentId":3413422,"userName":"Rouxxor","timestamp":1532378241,"content":"The game take very few inspiration from movies so I imagine it will take some distance from the series as well"}]}