{"url":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/","title":"Next Expansion and Cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/?do=findComment&comment=3406160","commentId":3406160,"userName":"Magmaman","timestamp":1531751232,"content":"I'm a fairly new player, I have two core sets, some Shadows of Mirkwood, and some of the saga editions.  Most of the other sets are sold out and possibly in reprint (like the Dwarrowdelf Cycle)\n\nI notice I can get either most/all of the Against the Shadow Cycle (Heirs of Numenor and expansions), or the Dream Chaser Cycle (Grey Havens and expansions).  I'm not super concerned about buying in order, but I'm curious which cycle I should focus on next of the two of those?\n\n \n\nThanks!\n\nEdited July 16, 2018 by Magmaman"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/?do=findComment&comment=3406286","commentId":3406286,"userName":"Will Anderson","timestamp":1531757503,"content":"I'd go for the Dream Chaser Cycle, as its quests tend to be more forgiving than Against the Shadow (with a small card pool there are some very tough challenges in there), but of course it depends on your priorities. I was certainly frustrated by the difficulty of the first couple quests in Heirs of Numenor when it came out, but then I'm also not very interested in playing power decks. Dream Chaser has some fun new mechanics that I really enjoyed but the whole sailing thing wasn't to everyone's taste. It's not as 'on theme' as Against the Shadow, so if you're more interested in exploring Gondor and fighting traditional Tolkien enemies that might be a factor for you. A couple of Dream Chaser quests do get a bit Pirates-of-the-Caribbean for my taste, but I think the cycle overall has stronger, tighter, more intriguing quests (even the designers admit Against the Shadow was done in a bit of a rush)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/?do=findComment&comment=3406290","commentId":3406290,"userName":"Magmaman","timestamp":1531757658,"content":"Thanks for the feedback, that's super helpful.  I'm going Dream Chaser for now, and might circle back to Against the Shadow in the future."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/?do=findComment&comment=3406314","commentId":3406314,"userName":"Rouxxor","timestamp":1531759483,"content":"Dream chaser is nice and quite easy, cycle 5 (take place in Angmar realm) is really great too and a little bit harder."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279315-next-expansion-and-cycle/?do=findComment&comment=3406479","commentId":3406479,"userName":"GrandSpleen","timestamp":1531766472,"content":"I concur on Dream-chaser cycle.  There was a recent poll for favorite cycle (on BGG maybe?) and I think that cycle was in the lead, or maybe 2nd behind Dwarrowdelf.\n\nEdited July 16, 2018 by GrandSpleen"}]}