{"url":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/","title":"A few questions:","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3409513","commentId":3409513,"userName":"jc1138","timestamp":1532012572,"content":"I've played this off and on since '12, and am just starting to make some headway into all the new stuff.  Last time I played was at the end of Against the Shadow so it's been awhile.  Sadly, I was current with all product (and 3 cores) but they were all trashed by a \"helpful\" relative when I was out of town two years back.  So I'm in the process of building back up from scratch.\n\nI'm wondering when can we reasonably expect the Dwarrowdelf cycle to be back in print?  I know it's on the Upcoming page, but that for FFG doesn't really mean a whole lot in terms of specificity.  Will it be a month or two, or will I still be waiting in 6 months?  I would like to know because that is where many of my old go-to cards from when I used to play come from (Elrond's Counsel, Warden of Healing, Elrond, Ally Arwen, Glorfindel, etc.).\n\nAlso, on a different track, when building decks I often have a hard time wanting to put a bunch of cards in but sticking to the 50 card limit (I always keep my decks at 50).  I will usually only include a single copy of a card like Steward of Gondor and just put it in my starting hand and draw the remaining cards, saying to myself \"I would just keep on starting the quest over/taking a mulligan until I got it.\"  Is this a common practice, or is it considered by many to be fudging the deck/game?  I'm a solo (and two handed solo) player exclusively.\n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3409542","commentId":3409542,"userName":"JonG","timestamp":1532013984,"content":"1) It's a real shame, but Khazad Dum/Dwarrowdelf is currently the only cycle which you can't find. It was brought out last year (I think) and went almost instantly. You're not the only player who has enquired about it, and although I may be wrong, I would suspect that you're looking at closer to 6 months unfortunately. \n\n2) What you're doing is not in the rules but I won't tell if you won't! Having said that I often play \"sleazy\" - start by giving each adventurer 2 resources rather than one. I also sometimes play \"basic\" where I don't bother with shadow cards.\n\nAs a general point, you've got some really good stuff to look forward to. Particularly check out the Dreamchaser cycle. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3409663","commentId":3409663,"userName":"Willange","timestamp":1532019494,"content":"Just play the way you enjoy the game.  I think it's fine to do whatever \"sleazy\" or \"lazy\" start you want (I've done this myself on certain quests) if what you're in the mood for is a more relaxed and narrative adventure. \n\nSometimes though, I want to play something a bit more intense.  In those times, I want it to be hard.  I crave the feeling of knowing I did something difficult and overcame a difficult challenge.  I remember when I first beat \"Into Inthilien\" (the one with the blocking wargs and the mumak) without any crutches or help, it was a huge rush!  I had to attempt probably 20 times or so and tried many tweaks to my deck, looked up strategies online, I did all kinds of things.  \n\nWhat I mean is, I think that depending on your mood there's a place for fudging things a bit with the rules and a place for disciplining yourself to overcome the challenge.  Just do what you're in the mood for.  That said, I think that you'll find the craving to overcome to be fairly irresistible after a while."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3409719","commentId":3409719,"userName":"Wandalf the Gizzard","timestamp":1532023214,"content":"> 2 hours ago, jc1138 said:\n> \n> I'm wondering when can we reasonably expect the Dwarrowdelf cycle to be back in print?  I know it's on the Upcoming page, but that for FFG doesn't really mean a whole lot in terms of specificity.  Will it be a month or two, or will I still be waiting in 6 months?  I would like to know because that is where many of my old go-to cards from when I used to play come from (Elrond's Counsel, Warden of Healing, Elrond, Ally Arwen, Glorfindel, etc.).\n\nI'm waiting for this to restock as well, it's been a long time. I have no idea when it will be available, but I hope its soon.\n\n> 2 hours ago, jc1138 said:\n> \n> I will usually only include a single copy of a card like Steward of Gondor and just put it in my starting hand and draw the remaining cards, saying to myself \"I would just keep on starting the quest over/taking a mulligan until I got it.\"  Is this a common practice, or is it considered by many to be fudging the deck/game?\n\nI don't ever do this myself and don't agree with it, but hey, its a solo/co-op game, so do whatever! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3409967","commentId":3409967,"userName":"GrandSpleen","timestamp":1532033539,"content":"> 2 hours ago, Wandalf the Gizzard said:\n> \n> I'm waiting for this to restock as well, it's been a long time. I have no idea when it will be available, but I hope its soon.\n> \n> I don't ever do this myself and don't agree with it, but hey, its a solo/co-op game, so do whatever! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nAgreed that it’s a coop game, so nobody is going to judge you for doing that. If you’re soliciting community opinions though, you’ll probably get lots of “no I wouldn’t do that.”\n\nThere is one hero whose main appeal is allowing you to do this legally, with a specific type of card (side quests. The hero is Thurindir). So, the game expects you NOT to be doing this, to such a firm extent that the designers have given us a card allowing you to do it in a very limited fashion. My 2 cents."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410539","commentId":3410539,"userName":"jc1138","timestamp":1532065054,"content":"Thanks for the replies.\n\nAm hoping for sooner rather than later with the reprints.  Picked up the Khazad-dum box at a local store about a week back--is it just the adventure packs that they wait to reprint?  Are the expansion/saga boxes kept in continual supply?\n\nOf course, playing is always going to be whatever floats your boat.  I'm a fan of house ruling games, as long as you know the impact it will have on the gaming experience.  Such as, \"is starting with X card in hand going to give me a huge leg up on the quest?\"  I would rather not do something to really warp the game, and starting with a chosen card in hand feels to me like less of a help or crutch than starting two resources on each hero or playing easy mode or something, but my knowledge of the intricacies of the game and how it is balanced is still far from deep.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410657","commentId":3410657,"userName":"dalestephenson","timestamp":1532076874,"content":"The only issue I see with choosing a 1x from your deck and assuming mulligan/scoops for all the times you didn't get it, is that even after you won the quest you wouldn't know how many times you lost.  If this doesn't bother you and you're playing solo, that's fine -- just don't post your deck and say \"I beat quest <x> with this deck three times in a row!\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410666","commentId":3410666,"userName":"Rouxxor","timestamp":1532077754,"content":"Dale is right: as usual with home rule the main issue is that it make harder to discuss the game with other people. But don't let that disturb your pleasure if you want to play this way ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410704","commentId":3410704,"userName":"player1683311","timestamp":1532081321,"content":"I would agree on the play however you want it's your game and it's coop.\n\nStuff like that I don't do however because like others I feel a nagging feeling like I  didn't actually beat it. And stuff like that I feel like is a slippery slope to other stuff. But that's my personal preference, do whatever makes you happy "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410798","commentId":3410798,"userName":"TheGuardian118","timestamp":1532090052,"content":"I've been waiting two years for the reprints; I missed out last time they came out as they sold out so quickly. All I was able to get was the Watcher in the Water and the Long Dark.\n\nThat said, just skip cycle 2 for now. My original plan was to go in order, but by waiting too long I lost interest in the game for a time. In the last 6 months I decided I didn't want to wait anymore and just started back in with cycle 5  (Angmar Awakend), and then whatever comes out so I have The Wilds of Rhovanion and will continue to get the current stuff as it comes out.  I'm just about done with cycle 5, not sure if I'll go back to 4, or just go on to 6. When 2 is reprinted I'll probably restart going in order, but if you wait like I did you might be waiting for a long time.\n\n \n\n(I count Mirkwood as Cycle 1 and Dwarrowdelf as Cycle 2 and so on; not sure if that's standard or not)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410815","commentId":3410815,"userName":"Rouxxor","timestamp":1532091768,"content":"That is standard. The narrative of the cycle 4 is my favorite and I like it complexity. On the other hand the cycle 6 is the most immersive one, and is not too hard. Depend on what you like the most ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279453-a-few-questions/?do=findComment&comment=3410820","commentId":3410820,"userName":"TheGuardian118","timestamp":1532092410,"content":"Yeah, it'll be a hard decision between 4 or 6. I've heard good things about both. I just randomly picked cycle 5 as the point as that one was fully in stock around me when I was ready to get going again."}]}