{"url":"https://community.fantasyflightgames.com/topic/279420-playing-lost-in-mirkwood-any-misplays-you-can-spot-here/","title":"Playing Lost in Mirkwood. Any misplays you can spot here?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/279420-playing-lost-in-mirkwood-any-misplays-you-can-spot-here/?do=findComment&comment=3408646","commentId":3408646,"userName":"NPAW","timestamp":1531941437,"content":"Staging area had Twilight Hall (no resources) 2 threat. Active location is a gentle Old Forest Road.\n\nQuesting for about 16 to look for a way out of here.\n\nThe way is clear for a cheeky Necklace of Girion to be played.\n\nThen all **** breaks loose.\n\nRevealed Abandoned Village (Objective Location), goes to staging area. Correct?\n\nThen draw Twilight Hall to guard the necklace.\n\nReveal Overgrown Path (Objective Location) to guard Abondoned Village, goes to staging area.\n\nReveal Forest Gate to guard Abondoned Village.\n\nReveal Bare Hilltop (Objective Location) to guard the Overgrown Path, goes to staging area.\n\nReveal Dark Black Woods to guard the Overgrown Path.\n\nReveal Mirkwood Patrol to guard the Bare Hilltop.\n\n \n\n2 threat in staging area, play Necklace of Girion. 13 threat in staging area when finished. Have I messed up and should I carry on?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279420-playing-lost-in-mirkwood-any-misplays-you-can-spot-here/?do=findComment&comment=3408730","commentId":3408730,"userName":"GrandSpleen","timestamp":1531944785,"content":"So.. I think when you play a Guarded card, you discard cards until you find one that can attach to your guarded card.\n\nYou discarded an objective location.  It can't be attached to the necklace.  Didn't we have a ruling that stated objective-locations can't be attached as guards? -- also, Searching for a Way Out renders it immune to player card effects, so it can't be attached to a player card).\n\nBecause it can't be attached, you discard past it. It doesn't go to the staging area.\n\nNext, you would have discarded Twilight Hall, which guards your necklace.  Now you're done.\n\nNote that Guarded (X) works different from the Guarded keyword in the core set.  In the core set, you reveal the next card.  With Guarded (X), you discard until you find a matching card type, then attach."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279420-playing-lost-in-mirkwood-any-misplays-you-can-spot-here/?do=findComment&comment=3408864","commentId":3408864,"userName":"sappidus","timestamp":1531951100,"content":"@GrandSpleen [https://community.fantasyflightgames.com/profile/177891-grandspleen/] is correct…\n\n "}]}