{"url":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/","title":"Limited Collector&#039;s Edition??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3416760","commentId":3416760,"userName":"urloony","timestamp":1532676142,"content":"Is this just another money grab or just a bad omen?\n\nI know concerns about the digital prospects of this game have been expressed in the past, but now it is upon us and I can't help but think this is FFG's way of phasing out the physical card game.  I know that the digital version is a different game, and we now have the release of a new expansion, but I'm wondering if we are experiencing the twilight of our beloved card game.  FFG's digital release of the companion app for Imperial Assault is fantastic and greatly enhances the game.  The physical game however, is still mandatory for the app to function.  This is obviously not the case with the digital release of LOTR:LCG.  One last minor quibble, as a veteran player and collector, it would have been nice to see some new alt art cards in the \"limited collectors edition\" rather than just reprints of the same old stuff in a gold box, a playmat that was released at last year's fellowship event, and some posters for $100.  Is there anyone that doesn't already have the one ring?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3416798","commentId":3416798,"userName":"player1683311","timestamp":1532682346,"content":"To me it makes perfect sense to try and cross promote to the 2 audiences who will play these games to hopefully get each into the other. If they sold them separately it would defeat the purpose of this products creation. That's my interpretation of course.\n\n \n\nI find it hard to believe they won't release those quests separately . If they came out and said they would release them eventually it would result in less sales in the collectors edition. At the end of the day they are a business. And this product is not a necessity to live. As long as they remain honest in what they do say I suppose I'll live with it. \n\nI should also mention that I have been agonizing over this since the day the news was announced.  I don't play this game on the computer and have less interest to start a new version on the computer.  Any way I try to justify the purchase I can't get around the fact that I'm spending $50+ on something I don't need or want. \n\n \n\nUnfortunately I'm not the target audience for the product.   This really reminds me of how AEG came out with a boxed expansion for 3 different games. \n\n \n\nI'm not a fan but it's a great buy for people who are interested in both games. \n\n \n\nAnd I guess that's a long answer to your question. The point of this is cross promotion. That is meaningless if you plan on ending one of the items. At least that's how I look at it. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3416873","commentId":3416873,"userName":"Wandalf the Gizzard","timestamp":1532694849,"content":"*checks calendar, nope not April first*\n\nTHE GAME IS NOT DYING!\n\nYou have no idea how many of these threads have surfaced concerning the end of the game. None of them came to fruition. If FFG were ending one of their most popular games, they’d tell us.\n\nBut to answer you’re question properly, neither. It’s an advertisement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3416878","commentId":3416878,"userName":"dalestephenson","timestamp":1532695032,"content":"I think producing a \"Starter Pack\" for the card game would be an odd way of phasing the card game out.  Since the starter pack also complements the core set AFAICT, I think the bundle is intended not only to get card game players to take a flyer on the digital game, but also get prospective digital players to take a flyer on the card game.\n\nWill the new quests be available as print on demand?  I think that depends on the starter pack's future.  If the starter pack will end up as a separate retail product, as I suspect it will, I would think it probably would not, and the starter pack would represent an alternate entry point into the game.  It comes with prebuilt decks presumably much better than the core set, and following the starter pack with a single core would both give deck building options and fill out some cards in the starter to 3x.\n\nIf FFG had wanted to tempt existing hardcore player into trying the digital game, I can't think of a worse decision than to tempt them with heroes they will get in the current cycle, pre-made decks they won't want to play, player cards they already have, and calling it a starter product."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418043","commentId":3418043,"userName":"Authraw","timestamp":1532741362,"content":"It's a pretty frustrating product from my perspective. Whenever companies start using cross-promotion (aka bundling content I don't want with exclusive content that I do, especially in a time-limited way) the hobby starts to become more expensive than it's worth and I make a hard exit.\n\nI'm pretty bought in to LotR LCG at this point, so it'll probably take a lot to shake me as a customer. But this is exactly the reason I stopped collecting the Arkham LCG.\n\nBut I don't think it's FFG's intent to \"sunset\" the physical card game with a new \"Starter Set\". It seems more like they're trying to hook people into both games simultaneously."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418150","commentId":3418150,"userName":"urloony","timestamp":1532751806,"content":"> 15 hours ago, dalestephenson said:\n> \n> I think producing a \"Starter Pack\" for the card game would be an odd way of phasing the card game out. \n\nI agree, but it's equally as odd to include a starter pack and calling it a \"collector's edition,\" with nothing unique for collectors.  Serious collectors have already purchased 3 starters to have the single cards in triplicate.  \n\n> 2 hours ago, Authraw said:\n> \n> It's a pretty frustrating product from my perspective. Whenever companies start using cross-promotion (aka bundling content I don't want with exclusive content that I do, especially in a time-limited way) the hobby starts to become more expensive than it's worth and I make a hard exit.\n\nI suppose there will be new players that just buy into the digital edition, but FFG is likely banking on established players being their prime buyers, hence the collector's edition.  On the flip side, I'm glad that they are releasing LOTR:LCG 2.0 as digital only and, for now at least, continuing the physical card game going.  Instead of going the Game of Thrones 2.0 route, and now the X-Wing 2.0 route.  Otherwise they are going to have a lot of players making hard exits.  \n\n \n\nEdited July 28, 2018 by urloony"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418206","commentId":3418206,"userName":"player1683311","timestamp":1532761457,"content":"> 5 hours ago, Authraw said:\n> \n> It's a pretty frustrating product from my perspective. Whenever companies start using cross-promotion (aka bundling content I don't want with exclusive content that I do, especially in a time-limited way) the hobby starts to become more expensive than it's worth and I make a hard exit.\n> \n> I'm pretty bought in to LotR LCG at this point, so it'll probably take a lot to shake me as a customer. But this is exactly the reason I stopped collecting the Arkham LCG.\n> \n> But I don't think it's FFG's intent to \"sunset\" the physical card game with a new \"Starter Set\". It seems more like they're trying to hook people into both games simultaneously.\n\nHow is the Arkham LCG doing this ? That's a legitimate actual question not a snarky comment. I have what I thought was everything for that game too but now I'm curious, although they did put novels out but the heroes in those are available at some point correct? Or were you referring to something else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418331","commentId":3418331,"userName":"Network57","timestamp":1532781327,"content":"> 5 hours ago, player1683311 said:\n> \n> How is the Arkham LCG doing this ? That's a legitimate actual question not a snarky comment. I have what I thought was everything for that game too but now I'm curious, although they did put novels out but the heroes in those are available at some point correct? Or were you referring to something else?\n\nI think the only \"chase\" cards are from the novels currently. They are Investigators (Heroes) that will be released later, but the novella versions come with unique signature cards (basically Boon/Burden-esque cards that are mandatory includes in an Investigator's deck) that won't be released elsewhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418342","commentId":3418342,"userName":"dalestephenson","timestamp":1532782473,"content":"> 8 hours ago, urloony said:\n> \n> I agree, but it's equally as odd to include a starter pack and calling it a \"collector's edition,\" with nothing unique for collectors.  Serious collectors have already purchased 3 starters to have the single cards in triplicate.  \n\nYes, the idea of having a \"collector's edition\" of a starter pack is very odd, which is why I suspect the starter pack is not going to be confined to this particular edition.  However, the alternate graphics used for player cards is *only* of interest to collectors, though it'd be more interesting if they had alternate art (like the otherwise useless heroes that are promos for the events).  I don't think it's collectors that purchase 3 starters to get triplicate, it's power gamers that want 3 Unexpected Courages in their deck.  Collectors are busying buying alternate art versions of heroes they already have.  (The two groups may have substantial overlap, of course.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3418833","commentId":3418833,"userName":"Authraw","timestamp":1532824730,"content":"> 17 hours ago, player1683311 said:\n> \n> How is the Arkham LCG doing this ? That's a legitimate actual question not a snarky comment. I have what I thought was everything for that game too but now I'm curious, although they did put novels out but the heroes in those are available at some point correct? Or were you referring to something else?\n\nYeah, I was referring to the novels. The signature cards for those versions of the investigators are different from the standard ones, meaning that you do need to buy the novels if you want to have the full card pool available while deckbuilding.\n\nPre-available content doesn't bother me too much, and neither does alternate art. (Okay, those do bother me a little, but I get over it). But when I end up spending $20 for a card or two because it will make my deck work better (or $100 because I don't want to miss out on 2 quests) I start getting bad feels. I did that for years with other games and it started to feel like a bad relationship, so now I'm extra wary. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3419133","commentId":3419133,"userName":"Wandalf the Gizzard","timestamp":1532866798,"content":"Yeah, the good thing (if you look at it that way) is that the LotR alt art heroes (from Gen Con and Fellowship events) are so hot, you'll never see them online to have to consider shelling out $200 for them. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3419488","commentId":3419488,"userName":"alexbobspoons","timestamp":1532896206,"content":"> 19 hours ago, Authraw said:\n> \n> Yeah, I was referring to the novels. The signature cards for those versions of the investigators are different from the standard ones, meaning that you do need to buy the novels if you want to have the full card pool available while deckbuilding.\n> \n> Pre-available content doesn't bother me too much, and neither does alternate art. (Okay, those do bother me a little, but I get over it). But when I end up spending $20 for a card or two because it will make my deck work better (or $100 because I don't want to miss out on 2 quests) I start getting bad feels. I did that for years with other games and it started to feel like a bad relationship, so now I'm extra wary. \n\nAbsolutely this!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279814-limited-collectors-edition/?do=findComment&comment=3426771","commentId":3426771,"userName":"BigKahuna","timestamp":1533296123,"content":"It has probably already been said, but releasing a collectors edition of the core set as a method to promote the digital card game is a brilliant idea but if there intention was to then turn around and cancel the physical game, that would be an act so outrageous and disgraceful that it would severely compromise their digital card game hopes.  I don't think they would want to attract negative attention at critical \"adoption\" point of the digital card game.  They are certain to at some point phase out the physical card game, it's inevitable, but right now I would say we are at least safe until the end of 2018 at the absolute minimum."}]}