{"url":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/","title":"Attacking and being attacked","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3416864","commentId":3416864,"userName":"mrblue74","timestamp":1532694271,"content":"What I understand from the rules is only differences between combats when  attacking and being attacked are;\n\n1. Your only defense skills come into play when being attacked. Your attacking skills are ignored.\n\n2. Your only attacking skills come into play when attacking. Your defensive skills are ignored.\n\n3. We deal one shadow card to each enemy when we are being attacked in combat phase. But no shadow card when we attack enemy. And shadow cards are discarded before the step we attack enemies, so no shadow card in play when we attack in combat phase.\n\n4. We can defend with one character only but can attack with more than one character.\n\nAm I understanding correctly?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3416868","commentId":3416868,"userName":"Wandalf the Gizzard","timestamp":1532694539,"content":"1. Correct\n\n2. Correct\n\n3. You only discard shadow cards at the end of the combat phase, not when you begin to declare your own attacks. Everything else you got right.\n\n4. Correct."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3416960","commentId":3416960,"userName":"mrblue74","timestamp":1532701071,"content":"3. So shadow card’s effects will be still applied when I attack to enemy?\n\nnew question:\n\n5. When an enemy attacks me, we ignore any shadow instructions, right? In another word, shadow instructions/ effects are resolved only when they are printed on the card dealt as a Shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3416980","commentId":3416980,"userName":"Ywingscum","timestamp":1532702168,"content":"5. Correct.  Only use shadow effect on the shadow card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3416983","commentId":3416983,"userName":"GrandSpleen","timestamp":1532702461,"content":"After you reveal the shadow card, you apply its effect.  Sometimes it will state how long the effect lasts (like \"until the end of the round\" or \"for this attack\").  \n\nSometimes that shadow effect will boost the enemy's attack power.  This means it will not be important later, when you're attacking the enemy yourself.  Sometimes the effect might boost an enemy's defense value, which will be important when you're attacking the enemy.\n\nSo, the length of the shadow effect varies, and is often stated in the effect itself.  If no length of time is stated, I would assume it lasts until the end of the combat phase, when the shadow card itself is discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3417208","commentId":3417208,"userName":"mrblue74","timestamp":1532707904,"content":"Perfect answer. I didn't think in that way (like attacking effects wouldn't matter when I attack the enemy later on etc).\n\nI guess my last question about this point would be; being Destroyed.\n\nWhen one of your allies or heroes is destroyed as a result of enemy attacks during combat phase, does it get destroyed and removed from the play immediately or at the end of the combat phase, meaning the character will have a chance to make an attack before s/he gets removed from the play? And same question when an enemy is destroyed. Is it removed immediately or after all other player attacks in combat phase so might still 'respond' or affect the game in some ways?\n\nMy understanding is the character/enemy gets destroyed immediately but in the games like Axis & Allies Miniatures, a character is considered still alive -even if it is destroyed as a result of attack- until the end of the round to represent all attacks are happening more or less at the same time and to avoid causing a huge disadvantage to the second player who will attack back to the first player after the first player's turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3417350","commentId":3417350,"userName":"NathanH","timestamp":1532711391,"content":"As soon as a card (player or encounter) has damage equal to its hit points, it is destroyed. Similarly, as soon as a location has progress equal to its quest value, it is explored."},{"commentUrl":"https://community.fantasyflightgames.com/topic/279821-attacking-and-being-attacked/?do=findComment&comment=3417560","commentId":3417560,"userName":"Wandalf the Gizzard","timestamp":1532717837,"content":"They're discarded as soon as they have enough damage."}]}