{"url":"https://community.fantasyflightgames.com/topic/280166-lotr-lcg-w-octgn-bugs/","title":"LotR LCG w/ OCTGN - Bugs","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/280166-lotr-lcg-w-octgn-bugs/?do=findComment&comment=3424060","commentId":3424060,"userName":"tripecac","timestamp":1533196742,"content":"I've been playing LotR LCG in OCTGN almost daily for the last couple weeks.  During that time I've encountered the following bugs (which are erratic rather than 100% reproducible):\n\n1) Scripting errors when playing Hunt for Gollum - These appeared in red in the chat/log (on the left) and referred to actions.py.\n\n2) Ctrl-N no longer adds resources or cards - instead, it only refreshes characters and increased threat.  I think this started happening after the scripting errors mentioned earlier.  To fix it, I have to manually add resources and draw cards. \n\n3) Player 2's cards are drawn by player 1.  For instance, if player 1 is leadership/lore and player 2 is tactics/spirit, sometimes a spirit or tactics card is drawn into player 1's hand.\n\n4) I can no longer add resources.  This was after many of the above errors occurred.  I could not find a workaround, so had to restart OCGTN.\n\n5) The first player token doesn't move back and forth.  Should it?\n\n \n\nPerhaps I am using Ctrl-N wrong?  I usually just hit CTRL-N and the following happens:\n\n- threat increases\n- characters refresh\n- each hero gets 1 resource\n- each player draws 1 card\n\nI then have to manually move the first player token to the other player.\n\nI don't use CtrL-R or any other turn management functionality.  Should I be doing something differently?\n\n \n\nAlso, should I be posting these bugs here, or is there a better place to post them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280166-lotr-lcg-w-octgn-bugs/?do=findComment&comment=3424358","commentId":3424358,"userName":"Wandalf the Gizzard","timestamp":1533212078,"content":"1- no idea\n\n2- Sometimes this just bugs out on OCTGN, it should be back to working after a game or two.\n\n3- Hmm, I’ve never had that happen to me, maybe it has something to do with how you took control of you 2.0’s deck.\n\n4- no idea\n\n5- yeah, you have to do it manually when playing two-handed since you are the “only” player. It works by itself in multiplayer.\n\nNope, you’re using Ctrl-N correctly. There’s a bug submission form on OCTGN’s website. You could also post questions in the CotR discord channel or on BGG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280166-lotr-lcg-w-octgn-bugs/?do=findComment&comment=3425136","commentId":3425136,"userName":"icabod","timestamp":1533228458,"content":"According to the LOTR LCG OCTGN page, you should add bug reports and feature requests on the OCTGN page [http://octgngames.com/lotrlcg/feedback/]."}]}