{"url":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/","title":"Opinion: We are not idle vs Traffic from Dale","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431584","commentId":3431584,"userName":"Yepesnopes","timestamp":1533598790,"content":"Hi,\n\nI wanted to read your opinions about the subject. I was very disappointed when We are not idle [http://hallofbeorn.com/LotR/Details/We-Are-Not-Idle-SaF] was errated in the last update. I never felt the card needed any errata. Although, I still play it in its original form with my dwarf deck-fellowship, an official errata always \"feels\" bad.\n\nThe new arrival of Traffic from Dale [http://hallofbeorn.com/LotR/Details/Traffic-from-Dale-TWoR] left me wondering even more if an errata for We are not idle was needed at all, of if the errata they have done has been the most adequate. In any case, with the appearance of Traffic from Dale, I now think that the nerf of We are not idle was too much.\n\nWhat are your thoughts on this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431596","commentId":3431596,"userName":"Bullroarer Took","timestamp":1533599413,"content":"in a dwarf swarm deck, WANI could easily exhaust 10 dwarves gaining 10 resources, then you could play Lure of Moria to ready them all and net 7 resources.  The errata was the right thing to do imo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431613","commentId":3431613,"userName":"Yepesnopes","timestamp":1533600498,"content":"> 11 minutes ago, Bullroarer Took said:\n> \n> in a dwarf swarm deck, WANI could easily exhaust 10 dwarves gaining 10 resources, then you could play Lure of Moria to ready them all and net 7 resources.  The errata was the right thing to do imo.\n\nFair enough. Just to mention that this is a two-card combo opposed by the \"one-card combo\" Traffic from Dale. It would be fairer to compare such a combo with a two-card combo using Traffic from Dale,  for example, Traffic from Dale + Tome of Atanatar for a extra resources in two consecutive rounds? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431802","commentId":3431802,"userName":"PocketWraith","timestamp":1533612670,"content":"Traffic from Dale doesn't work by itself as you're implying though. Compare a Dwarf deck and a Dale deck each with 5 allies in play. The Dwarf deck just needs to draw WANI and Lure of Moria to generate 5 net resources (and draw a card). The Dale deck needs to draw and pay for 6 attachments and Traffic from Dale to do the same. The draw and resources the Dale deck goes through to get that set up the Dwarf deck will use to play more Dwarves so they still stay ahead in the resource generating stakes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431817","commentId":3431817,"userName":"Yepesnopes","timestamp":1533614704,"content":"> 40 minutes ago, PocketWraith said:\n> \n> The Dale deck needs to draw and pay for 6 attachments and Traffic from Dale to do the same. \n\nWell, the dwarf deck also has to draw and pay for 5 allies right? Traffic from Dale needs attachments not allies. To make a good comparison, you can run a Dale deck heavy on heroes and attachments instead of a swarm deck, right?\n\nEdited August 7, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431826","commentId":3431826,"userName":"GrandSpleen","timestamp":1533615237,"content":"Traffic from Dale doesn't give one resource per attachment, it gives one resource per character which has an attachment.  So if you're doing a hero voltron deck and no allies, the max you're looking at from Traffic from Dale is 3 resources.  The card itself costs 1, so that's 2 resources, and other cards already exist that can give you 2 resources for less setup (Gaining Strength for example).\n\nFor Traffic from Dale to match what WANI was previously capable of, you'd allies which also have attachments on them, so it requires twice the draw compared to the Dwarf swarm.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431828","commentId":3431828,"userName":"Yepesnopes","timestamp":1533615472,"content":"Good points!\n\nI am nearly convinced guys :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431833","commentId":3431833,"userName":"GrandSpleen","timestamp":1533615888,"content":"In my opinion, the WANI errata would have been better with a limit of 5 or so, rather than limiting it to heroes only."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3431853","commentId":3431853,"userName":"player1683311","timestamp":1533617718,"content":"> 26 minutes ago, GrandSpleen said:\n> \n> In my opinion, the WANI errata would have been better with a limit of 5 or so, rather than limiting it to heroes only.\n\nI agree with this.  Also you don't want to exhaust Dain so you are going for 2 resources which makes it kind of useless?\n\n \n\nAlso, early game with traffic you spend one and maybe have 3 or 4 gained which is helpful. Or you have too few attached characters so you end up waiting because spending one gives too little gain and it just takes the place of a useful card. Late game you can gain 10 or 12 but with that many allies with attachments on the board and it becomes sort of a win more situation. So that is my way of saying it feels strong but balanced. It's amazing what a cost of one versus zero means in gameplay. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432027","commentId":3432027,"userName":"PocketWraith","timestamp":1533639128,"content":"> 5 hours ago, player1683311 said:\n> \n> I agree with this.  Also you don't want to exhaust Dain so you are going for 2 resources which makes it kind of useless?\n\nThe fact it draws a card for free ensures that it will never be useless. Also, it's a generic action, so you don't have to play it early in the round, you can wait until you don't need Dain any more if you want more resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432036","commentId":3432036,"userName":"dalestephenson","timestamp":1533640476,"content":"It's not a question of it being useless, it's a question of it being much less useful than designed when used for its intended purpose.  Yes, if you have ten dwarves in the field you can set up an infinite loop with Lure of Moria if you can draw your whole deck and recur your events -- but if you meet those preconditions it's not likely you need the help of the WANI/Lure combo to win.  If you've got lots of dwarves in the field with Dain Ironfoot, you're already in excellent shape and WANI/Lure is just \"win more\".  I loved WANI in the early game  to squeeze out an extra resource or two by exhausting *allies* and get to five dwarves ASAP.\n\nMy preferred fix to WANI would be my preferred fix to *any* event that has the potential to set up infinite loops if recurred -- remove it from the game when used.  Alternately, you could add a once per round limitation.  The idea that WANI, as commonly used, was more powerful than it was intended to be is absurd, given its age and the timing of its release.  The common case suffered to clamp down on the edge case, a terrible thing to do to a popular and widely used card.\n\nTraffic From Dale can generate *absurd* amount of resources in a Dale deck, and requires no hero exhaustion or any other kind of exhaustion.  Yes, you need a lot of card draw to set it up, but luckily the act of playing an attachment on an attachment-free Dale generates card draw, and between King of Dale, the low price of Dale attachments, and Dale discounting, it doesn't require a ton of resources to set up either.  OTOH, it is again win more -- if you have lots of Dale allies with attachments so that you can generate 10 resources from the event, you likely don't need the resources.  (OK, unless you're running Blood/Fire on a Dale hero.)\n\nAt some point someone will figure out an infinite combo involving recurring Traffic From Dale and they will errata it into relative uselessness."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432086","commentId":3432086,"userName":"Wandalf the Gizzard","timestamp":1533644197,"content":"I think WANI was errat'd more for the infinite combo with Second Breeakfast, Lure of Moria, and Tome of Atanatar (it still works with Sword-thain, though, so that defeats the purpose) than its overall power."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432167","commentId":3432167,"userName":"Seastan","timestamp":1533649071,"content":"> 2 hours ago, dalestephenson said:\n> \n> At some point someone will figure out an infinite combo involving recurring Traffic From Dale and they will errata it into relative uselessness.\n\nThe restriction \"You can only play 1 copy of Traffic from Dale each round\" makes an infinite loop impossible. This restriction could've been added to WANI to shut down the loop with Lure. As it is, the errata to WANI limiting its use to heroes hasn't stopped its use in generating infinite resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432194","commentId":3432194,"userName":"dalestephenson","timestamp":1533650219,"content":"The same \"You can only play 1 copy of We Are Not Idle each round\" would have been a fine errata for WANI.  Restrict the edge case, leave the common case alone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432316","commentId":3432316,"userName":"Wandalf the Gizzard","timestamp":1533654556,"content":"> 1 hour ago, Seastan said:\n> \n> The restriction \"You can only play 1 copy of Traffic from Dale each round\" makes an infinite loop impossible. This restriction could've been added to WANI to shut down the loop with Lure. As it is, the errata to WANI limiting its use to heroes hasn't stopped its use in generating infinite resources.\n\nYeah, this is a problem. I like Dalestephenson's suggestion. I often ignore the specifics of a particular errata in and treat the card as if it was errata'd in a way that prevents the combo only, and doesn't change the card otherwise. I hope the infinite loop with WANI is addressed for good."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280525-opinion-we-are-not-idle-vs-traffic-from-dale/?do=findComment&comment=3432777","commentId":3432777,"userName":"Yepesnopes","timestamp":1533673773,"content":"It is hilarious. So the errata screwed the card but did not prevent the problem? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\njust when I was about to be convinced...\n\nI will keep it playing it in its original version.\n\nThanks guys for the discussion and insights"}]}