{"url":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/","title":"Storage suggestions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434316","commentId":3434316,"userName":"Wandalf the Gizzard","timestamp":1533766426,"content":"The game is fast approaching three-hundred encounter sets. How do you all store you encounter and quest cards? It would take quite a few artist cases from Broken Token, and those aren't inexpensive.\n\nFor those of you who store player cards in binders, what kind of and how many do you use?\n\nI was hoping to keep my player cards in binders and my encounter cards in a case/deckbox, but is that possible with today's cardpool? How do you cope with a growing cardpool when you outgrow your storage solution?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434474","commentId":3434474,"userName":"stimpaksam","timestamp":1533774855,"content":"I currently own everything released except for the nightmares and PODs. I'm also missing The Mountain of Fire because it's out of stock everywhere. I have everything sleeved in penny sleeves and all my player cards fit in one core box, divided into three rows. I have the encounter cards split amongst six 800 count BCW boxes; two cycles to a box. I have a smaller 400 count BCW box that I keep my current player and encounter decks in along with the trackers and tokens. That makes for fast setup and play.\n\nI personally never saw the appeal of using binders. I've always thought those are more for games like MTG and collecting sports cards. I like to hold the cards in my hands when I'm building decks. Turning pages in a binder feels less like I'm playing the game and more like I'm collecting the game, if that makes sense...idk. To each their own. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nEdited August 12, 2018 by stimpaksam\nadd pic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434544","commentId":3434544,"userName":"dalestephenson","timestamp":1533779174,"content":"I have plastibands around quests (and also the deluxe encounter quests), and then have them piled next to each other in a game table drawer.  It makes the drawer really heavy, and I intend to move them all to card boxes at some point.\n\nI have my player cards in binders -- I build my decks on ringsdb, so my binders are for storage and ease of access.  Currently I have them all in two binders, if I outgrow them I'll probably move to five binders, one for each sphere.  (Right now my smaller binder is leadership/lore and larger binder is spirit/tactics/neutral).  I don't sleeve, so have no issues with fitting all the matching cards in a single pocket.  One exception to my binder storage is the heroes, I keep them all together contained by yet another plastiband.  At any given time I also have plastibands around my current deck(s) and quest as well.  I keep tokens in five small square dishes from ikea (three for the cardboard tokens that come with the core sets, two for flat fishtank stones from the dollar store that I use to indicate ready (transparent green stones) and committed to the quest (transparent white stones) -- I find adding/removing stones more convenient (and less space requiring) than physically rotating cards.\n\nWhile there's a ton of stuff, getting the stuff I need for a particular session is much easier than the other games I have that are outgrowing their storage (Legendary, Dominion, Dice Masters).  I generally use the same deck(s) against multiple quests, preferably a full cycle, and I replay quests when I lose, so that's a lot less work than finding all the kingdom cards for a Dominion game or getting all the random components out for Legendary.  And ringsdb makes it so easy to deckbuild that I have far more decks to try than I have time to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434545","commentId":3434545,"userName":"CDavis7M","timestamp":1533779227,"content":"This was recently discussed over at BGG. Be sure to check it out.  As for me, I have my player cards in these 4-pocket colored binders. 3 unsleeved cards per pocket. There is also a black binder for heroes. I like these binders because they're small and easy to flip through. Though, the pockets in these binders may be completely full after this upcoming cycle. When deck building, i usualy grab all of the cards that seem to fit my idea, and then organize and reduce from there. So the binder aspect doesn't bother me. I prefer being able to easily see the cards.\n\nI also made a few exact-sized tuckboxes for some of the encounter sets. This box in the pic contains the Khazad Dum quests and is about 1.5\" thick. The Core+Mirkwood cycle is in a sideways tuckbox and is about 3.5\" thick. Tuck boxes are nice because they're portable and don't take up much space when I leave them out. But I'm considering just storing each deluxe+cycle in the deluxe box.\n\npic4199982.jpg [//content.invisioncic.com/Mfantflight/monthly_2018_08/pic4199982.jpg.2eeb5c4612e495d6ade35f43bb55604c.jpg] [//content.invisioncic.com/Mfantflight/monthly_2018_08/pic4199982.jpg.2eeb5c4612e495d6ade35f43bb55604c.jpg]\n\nDSC_1614.JPG [//content.invisioncic.com/Mfantflight/monthly_2018_08/DSC_1614.thumb.JPG.87e0f4e25c51a7db947ee1d76b3d308d.JPG] [//content.invisioncic.com/Mfantflight/monthly_2018_08/DSC_1614.JPG.54d137726e2b1ae8a92a3fbccd17ea6a.JPG]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434617","commentId":3434617,"userName":"Orcstalker","timestamp":1533785269,"content":"I use a BCW \"hotel\". This holds a dozen of the 800-count cardboard storage boxes, and each complete cycle fits very nicely in a single box with some space left over for nightmare decks.\n\nhotelpicno802.jpg.251f200b8cbc626700b34ac8e60c17c0.jpg [//content.invisioncic.com/Mfantflight/monthly_2018_08/hotelpicno802.jpg.251f200b8cbc626700b34ac8e60c17c0.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3434739","commentId":3434739,"userName":"player1683311","timestamp":1533798420,"content":"How are you putting these pics up every pic seems to exceed the allowance......"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435108","commentId":3435108,"userName":"Trialus","timestamp":1533825660,"content":"I've also gone color coded binders for player cards.  Binders are then organized by card type (Hero, Ally, Attachment, Event) and then alphabetically.  Encounter cards are stored in a Hobby Lobby case with the BT insert (vertical).  I have each deluxe + cycle stored in a section (rather than a division for each encounter set), but am still out of room now (with the Sagas and most of the PODs in the case).\n\nI am pretty happy with the binders for player cards and the binders are big enough to keep accommodating cards for a fair while yet.  I'll need a new solution for encounter cards soon though....I kinda like the idea that Orcstalker showed above with each cycle in a box...could decorate the ends nicely...hmmm."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435134","commentId":3435134,"userName":"Wandalf the Gizzard","timestamp":1533826642,"content":"> 13 hours ago, CDavis7M said:\n> \n> But I'm considering just storing each deluxe+cycle in the deluxe box.\n\nI was really hoping to do this, but ran into space problems. How would you fit them in?\n\n> 16 minutes ago, Trialus said:\n> \n> Encounter cards are stored in a Hobby Lobby case with the BT insert (vertical).\n\nWhat exactly is this case called? I can't find it on Hobbly Lobby's webstore.\n\nWhat do you guys think about keeping player cards in Ultra Pro nine-pocket binders, one card to a pocket, one binder for each sphere. Would that fit?\n\nAlso, what do you think about FFG's clear sleeves versus Ultra Pro premiums, or should I just go with their LotR art sleeves?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435385","commentId":3435385,"userName":"Wandalf the Gizzard","timestamp":1533836133,"content":"> 16 hours ago, stimpaksam said:\n> \n> I personally never saw the appeal of using binders. I've always thought those are more for games like MTG and collecting sports cards. I like to hold the cards in my hands when I'm building decks. Turning pages in a binder feels less like I'm playing the game and more like I'm collecting the game, if that makes sense...idk. To each their own.﻿\n\nI just love looking through and seeing all that glorious art. Plus, it feels clunky flipping through stacked cards in a case. It also makes it easier to find any particular card. Those are the main reasons I prefer them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435631","commentId":3435631,"userName":"Magmaman","timestamp":1533845397,"content":"Buy these two things and never look back.\n\n \n\nhttps://www.hobbylobby.com/Art-Supplies/Storage-Organization/Storage/All-Media-Artists-Supply-Sketch-Box/p/5227 [https://www.hobbylobby.com/Art-Supplies/Storage-Organization/Storage/All-Media-Artists-Supply-Sketch-Box/p/5227]\n\nhttps://www.thebrokentoken.com/standard-sized-card-organizer-for-wooden-artist-case/ [https://www.thebrokentoken.com/standard-sized-card-organizer-for-wooden-artist-case/]\n\n \n\nEdited August 9, 2018 by Magmaman\nMissed the part about binders only, sorry!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435831","commentId":3435831,"userName":"Aeaea","timestamp":1533853143,"content":"I use BCW Side Loading 18-Pocket Pages (9 pockets on each side) for the player cards. Pages can be purchased in different colors too for fun. All my player cards are in clear FFG sleeves. I don't sleeve encounter cards. Building decks from RingsDB is nice and binders make the cards very easy to locate -- plus as you said, nice to look through and ponder new strategies/combos.\n\nYou can fit  3 sleeved cards snugly in each pocket -- but I put two on each side of the page (front and back) to make them a little easier to remove. I put them in 5 colored binders alphabetized by card type - like others describe above. All announced player cards should (just barely now) fit on 20 pages per color and 10 pages of generics.\n\nBCW Gaming Card Sleeves [https://www.bcwsupplies.com/card-game-supply/game-page]\n\nNote: Make sure you use side loader page pockets. Top loaders will spill cards out of your binder if you're not careful.\n\nI still haven't found a good way to store the encounter decks but working on some solutions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435886","commentId":3435886,"userName":"Orcstalker","timestamp":1533855812,"content":"Guess I should have said that I use the BCW \"hotels\" for the encounter sets only as all nine quests and the encounter decks for each cycle fit nicely in one 800-count box. Player cards are kept by their traits in UltraPro premium binders in various colors. Works out great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3435987","commentId":3435987,"userName":"Wandalf the Gizzard","timestamp":1533862031,"content":"> 2 hours ago, Aeaea said:\n> \n> I use BCW Side Loading 18-Pocket Pages (9 pockets on each side) for the player cards.\n\nDoes BCW provide binders, or just sleeve pages?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3436071","commentId":3436071,"userName":"Trialus","timestamp":1533868360,"content":"> 6 hours ago, Magmaman said:\n> \n> Buy these two things and never look back.\n> \n>  \n> \n> https://www.hobbylobby.com/Art-Supplies/Storage-Organization/Storage/All-Media-Artists-Supply-Sketch-Box/p/5227 [https://www.hobbylobby.com/Art-Supplies/Storage-Organization/Storage/All-Media-Artists-Supply-Sketch-Box/p/5227]\n> \n> https://www.thebrokentoken.com/standard-sized-card-organizer-for-wooden-artist-case/ [https://www.thebrokentoken.com/standard-sized-card-organizer-for-wooden-artist-case/]\n> \n>  \n\nThanks for posting the links!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280659-storage-suggestions/?do=findComment&comment=3436152","commentId":3436152,"userName":"Aeaea","timestamp":1533874032,"content":"@Wandalf - yes, BCW sells lots of gaming stuff (though you can probably buy packs of colored binders on Amazon for a lot less). I used 1 inch binders and they seem about  the right size for now."}]}