{"url":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/","title":"Question about the collector&#039;s Edition","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3438903","commentId":3438903,"userName":"Badkiller101","timestamp":1534117329,"content":"Hi I am brand new. I didn't know about this game till I saw the digital game online. I don't own any of the games physical or digital. I was wondering as someone who is new to this would this limited edition be a good choice. I have watched videos on the game and it seems like a lot of fun both physical and digital. One of the things I didn't know about was the limited edition says two player I know the core set can be played 2 player but 1 player is better for me since my friends just are not really in to card or board games. Does this limited edition work with just one person. Sorry if this is a really obvious question. Thank you for the time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439390","commentId":3439390,"userName":"banania","timestamp":1534172962,"content":"First: the card game is amazing. If the digital appeals to you, then why not also try the card game.\n\nIn that case the Starter Set is obviously a good starting point.\n\nThe card game is playable solo.\n\nYou can also play the game « two handed » meaning you pkay the two decks against Sauron. Lots of players actually favor two handed play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439445","commentId":3439445,"userName":"Badkiller101","timestamp":1534175463,"content":"Awesome! Thanks for the reply. I'm excited to get to play and that is a cool idea with two handed. Thanks again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439572","commentId":3439572,"userName":"Wandalf the Gizzard","timestamp":1534180235,"content":"I hope you enjoy the game! Make sure to ask here if you end up having any questions, and check out the plethora of fantastic blogs, podcasts, and resources made by the community."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439692","commentId":3439692,"userName":"player1683311","timestamp":1534186664,"content":"Yeah the collectors set is made specifically for people interested in both, and for new players. So it should be perfect for you haha.  Many people are bummed because they aren't interested in both products. It is a great value. For a person wanting both. Both core and collectors box support 2 players. You need multiples to have 4 players regardless "},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439733","commentId":3439733,"userName":"Wandalf the Gizzard","timestamp":1534189067,"content":"Hmm, has FFI mentioned over two players for the digital version?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3439952","commentId":3439952,"userName":"player1683311","timestamp":1534202161,"content":"I was referring to the physical game, thanks for the clarification!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3440663","commentId":3440663,"userName":"CDavis7M","timestamp":1534267774,"content":"Question - Would the $100 limited edition starter be good for someone who has no experience in the physical or digital game?\n\nNo.  Just simply based on the cost alone.  Though, if you had played this game and already knew that you liked it and were set on buying it - then I would say yes,  the Collectors edition would be a good idea.\n\nJust looking at the cost, maybe consider waiting for the free-to-play digital game to come out (in a couple weeks) and see if you even like the game.  Or, order a Core Set of the physical game and see if you like that. You can also wait weeks or months to see if the Starter will be released separately.\n\nI just think, compared to other games out there that you could buy instead, $100 is a lot to spend on a collector's edition of something you haven't played before."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280906-question-about-the-collectors-edition/?do=findComment&comment=3440667","commentId":3440667,"userName":"Wandalf the Gizzard","timestamp":1534267902,"content":". . . Unless you've watched videos either/both of them and know you will like it/both."}]}