{"url":"https://community.fantasyflightgames.com/topic/280964-when-do-songs-activate/","title":"When do songs activate?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/280964-when-do-songs-activate/?do=findComment&comment=3439833","commentId":3439833,"userName":"icabod","timestamp":1534193763,"content":"I have a question that a very quick search didn't answer (perhaps it's obvious?).\n\nIf I have a Song in my hand that gives the attached hero another sphere, is it activated immediately? So that hero could be used to buy the other spheres cards in the same planning phase?\n\nFor example, I have Song of Wisdom (attached hero gains Lore), play it in the planning phase and attach it to a Tactics hero (Legolas). Can I then use a Legolas resource to pay for a Lore card in that same phase?\n\nI'm playing now, so will play it as a \"Yes\", but thought I'd check.\n\nIncidentally, I am playing with Tactics Legolas, Lore Bilbo and Lore Glorfindel... and my first draw of 6 cards (+2 in the first resource phase due to Bilbo's ability) includes 2x Song of Battle, and 1x Song of Wisdom - so no resource limitations. How handy is that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/280964-when-do-songs-activate/?do=findComment&comment=3439895","commentId":3439895,"userName":"Halberto","timestamp":1534197778,"content":"Yes, attachment works ad Sion ad the enter play (or when giù exaust the of required to trigger their text ability). Song's grant immiditely the new spare to the heroin the moment the are attached to him/her\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/280964-when-do-songs-activate/?do=findComment&comment=3439908","commentId":3439908,"userName":"Wandalf the Gizzard","timestamp":1534199077,"content":"Yes, the songs grant immediate access to the given sphere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/280964-when-do-songs-activate/?do=findComment&comment=3440244","commentId":3440244,"userName":"icabod","timestamp":1534238726,"content":"Thanks. I assumed that was the case, but I know that with this game if you ever have a doubt it's usually the option that's worst for the player ?\n\nThankfully not in this case."}]}