{"url":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/","title":"Packrat mentality - makes it hard to leave cards out!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3447638","commentId":3447638,"userName":"tripecac","timestamp":1534873547,"content":"As I play through Mirkwood progression-style and try out new player cards, I am finding it increasingly hard to stick to 50 cards.  This is because there seem to be so many useful staples that I hate to omit them from my decks.\n\nGandalf.  Sneak Attack.  Eowyn.  Stewart of Gondor.  Northern Tracker.  A Test of Will.  Hasty Stroke. \n\nI always include 3x of those (depending on the sphere).\n\nThe there's Celebrian Stone, Snowborne Scout, Citadel Plate, Horn of Gondor, the Songs, Unexpected Courage, and so on...  \n\nThe list of cool cards just keeps going and growing, and soon there is no space to try out new cards without letting old ones go, and i find that sort of ruthless editing very difficult!\n\nSo, how do those of you with a similar packrat (never throw potentially good things away) mentality find ways to make the editing less unpleasant?  Or do you end up playing with enormous decks?\n\nEdited August 21, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3447659","commentId":3447659,"userName":"Wandalf the Gizzard","timestamp":1534874478,"content":"I often end up playing decks with over fifty cards, but always smaller than fifty-five (not counting thinner cards like Daeron's Runes, We are not Idle, and Unlikely Friendship).\n\nThat said, it shouldn't be too hard to keep to a reasonable size. Start with what you are trying to do with the deck and add all the cards that really help with that particular role. For me, this includes sub-standard cards but are fair in the given archetype, just so I have a chance to use them. Then, put in some must-include staples from the spheres you are using. Keep in mind that this might not always apply to certain cards. Northern Tracker in a solo game of the Seventh Level wouldn't be optimal, nor would Hasty Stroke in the Dead Marshes. Fill in the deck with things that all good decks need to run (Some form of resource generation, card draw, threat reduction, combat, and questing. Healing and cancellation are also nice). If you still have room, round it out with something to strengthen the deck's weakness.\n\nThat's what I do to build a good deck. If you need to cut something, look for cards that do something you already have a lot of, or cards that are unnecessary. Don't be afraid to cut really good cards if they don't fit perfectly in your particular deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3447760","commentId":3447760,"userName":"player1683311","timestamp":1534879261,"content":"Yeah with a growing card pool it gets harder and harder to build. I have the perfect dale deck built and now I have the new pack which includes 2 dale allies that I have no room for Haha, what to do?!  \n\n \n\nI always include daerons runes, and like wandalf always squeeze an extra 3 cards in which I know is a no no Haha "},{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3447887","commentId":3447887,"userName":"dalestephenson","timestamp":1534886086,"content":"When playing progression style with my Beorn's Path decks past the first cycle, I'd just add interesting cards and let it bloat, then thin it down to 50 when I lost a quest.  Playing with the new cards was a good way to see what cards I used, and which cards I really wished I had drawn something else.\n\nWhen we're talking about decks closer to 50 (like 51-55 cards), the difference is really quite minimal -- you might see a 3x card you mulligan for once for every 9 or 10 attempts at a quest, if I remember the math correct.  The dramatic difference in particular cards showing up as you move from 3x to 2x to 1x.  So don't cut copies of a card you think you *really* want to see just to get down to 50."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3448093","commentId":3448093,"userName":"tripecac","timestamp":1534902050,"content":"Thanks!\n\nTo me, the first several quests seem to have a large number of quests designed to \"teach\" us how to use different types of cards, and/or \"punish\" us for using the same cards over and over.  For example, Carrock teaches threat management, Rhosgobel teaches healing, Emyn Muil teaches location control and punishes you for having an army of low-HP questers boosted by Faramir. \n\nCould the \"teaching\" natural of these quests be contributing to a feeling that our decks are being yanked back and forth between different priorities, and not allowed to \"stabilize\"?\n\nDo later cycles settle down, allowing you to develop a favorite deck (or pair of decks, for 2 handed play) and then use that, with minor tweaks, for the rest of the cycle?  Or does each cycle veer back and forth between enemy threat, damage, and location control, causing you to constantly shift between different deck types?\n\nYou see, I'm trying to decide how to best organise/name my OCTGN player decks going forwards.  I've been doing it chronologically so far, with each new deck being based on the previous one, plus any new player cards for that adventure pack.  However, the shifting quest priorities have been causing a lot of heavy editing of my deck, so I'm starting to think it would be less \"traumatic\" to maintain a set of different deck types (healing, location control, combat, etc.) for each sphere combo, so that I don't have to do as much editing for each new quest (once I find out what type of deck it \"wants\"), and don't feel like I am leaving any cards behind.\n\nDoes that make sense? \n\nIs multi-deck management the overall \"meta-lesson\" of the Shadow of Mirkwood cycle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281374-packrat-mentality-makes-it-hard-to-leave-cards-out/?do=findComment&comment=3448461","commentId":3448461,"userName":"Wandalf the Gizzard","timestamp":1534945179,"content":"> 11 hours ago, tripecac said:\n> \n> Do later cycles settle down, allowing you to develop a favorite deck (or pair of decks, for 2 handed play) and then use that, with minor tweaks, for the rest of the cycle?\n\nYes, except for Ringmaker.\n\nI organize my octgn decks with subfolders. Some folders have the dekcs I built to play progression style, by cycle. The other decks are organized by archetype/roles\n\n> 11 hours ago, tripecac said:\n> \n> Is multi-deck management the overall \"meta-lesson\" of the Shadow of Mirkwood cycle?\n\nSure?"}]}