{"url":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/","title":"Questions about the steam game","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3453849","commentId":3453849,"userName":"gmcc","timestamp":1535487517,"content":"So i read the new ffg post about this game but i have some doubts that would appreciate if answered.\n\n- what will it contain? It says it has a lot of content and expansions but wich? Core + 2 or 3?\n\n- will it let us play co op with someone online or as a search game system?\n\n- will it have dlc or payed things? Talking about future or current expansions that arent in it ( dont know wich)\n\n- how does it work? Does it have the scenarios from core and expansions and We choose them or they are made differently or what?\n\n- does it have rulebook or tutorial or premade decks?\n\n- is it new player friendly?\n\n \n\nSorry for most of the questions but it can help me decide between digital and physical version to buy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3453941","commentId":3453941,"userName":"dalestephenson","timestamp":1535491799,"content":"It's a different game with some common artwork and card names.  I don't think either game will scratch the same itch as the other does."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3453982","commentId":3453982,"userName":"Willange","timestamp":1535494049,"content":"I played it a bit this morning, so I'll try to answer these in order:\n\n *  It's not totally clear to me how the distribution will be long term, but for now, you get a pretty small card pool after doing the tutorial.  You can earn \"Valor Points\" by playing and beating quests (each quest gives less rewards if you do it more than once a day though) and even more points for beating quests with different heroes.  It looks like you'll  unlock cards and packs relatively quickly.  That said, the card packs and the cards themselves are totally different in this game as the game itself is quite different.  Lemblas bread still heals things, but it's different because the game mechanics are a bit different.\n * The online co-op is not enabled at this phase of early access so I don't know the answer to this.\n * The packs available right now are purchasable for about (as far as I can tell so far and number could change by release for all I know) 3-4 quests worth of Valor Points or $2.  These card packs (so far) consist of 1 hero and then 1x of 4 different cards themed around that hero.  It's definitely worth noting that the decks in this game are 30-card decks, not 50, and the maximum number of copies of a card you can have in a deck is 2, not 3.  That said, you can't buy more than 1 of each card pack.  So, how do you go about getting the 2nd copy of cards in the card packs?  Well, you can craft them for Valor Points (how many depends on the rarity of the card) or you can get them randomly from a \"palantir\".  Palantirs are awarded for beating a quest as a new hero for the first time on at least normal difficulty.  So you if you had decks with 9 different heroes, and beat a given quest on normal difficulty with a minimum score with each of those decks, then you would get 9 palantirs.  Each palantir gives you a random card that you don't already own (haven't really tested this thoroughly yet, but it seems to be true) plus some other reward like bonus valor or an avatar or card back or something like that.  That's where card rarity comes in, I think.  So it seems like the wisest course is to buy all the common/uncommon cards with valor points and use palantirs to get the rares/legendaries.  That is, if they don't change the system and I'm not misunderstanding anything. So far, I haven't found a way to buy palantirs with actual money, but I could be missing something.  Sorry for the wall of text, but it's totally different system than the physical game.\n * The scenarios (and general flow of the game) are totally different.  You can buy or unlock new scenarios with money or Valor Points for prices similar to the card packs it would seem.  Scenarios have a Sauron deck, but sauron has resources and a hand that you can influence (like steal his resources) and he plays encounter cards from those.  Some of those are secret cards that you can't see till they trigger, some are your more traditional monsters (though combat is much changed) and locations are called \"objectives\", but you still place progress on them with willpower-characters though that's more like an attack so you hit them with 4 willpower and they lose \"4 hp\" sorta.  Quest steps are now called locations so travelling takes you from one quest step to the next.  This aspect of the game is actually kinda cool because you can try to rush past monsters without fighting them, but then some will follow you from location to location but most won't.  Stealth play is actually pretty cool here.  This is just a basic crappy summary, but I hope it helps answer your question.\n * It has a starter deck. There is an in-game glossary which acts as a sort of rule's reference.  There is also a good tutorial.\n * Very new player friendly.  Cardpool is still fairly limited and since the game is so different, even veterans of the physical game will have to re-learn how to play this digital game.  Everyone's a new player :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  Even if you buy everything in this game with real money, it'll be pennies compared to buying all the physical stuff.  That said, they're different experiences and games entirely.  The digital definitely reminds me of the physical game, but they're both fun in their own way, and I'll certainly be playing both."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454044","commentId":3454044,"userName":"gmcc","timestamp":1535497064,"content":"Hum so its more a TCG than a LCG and its different game.. I thought it was a port but i guess i was wrong"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454078","commentId":3454078,"userName":"Calvadur","timestamp":1535498796,"content":"Well, afaik you can't trade your cards...\n\nThe atmosphere the game creates is really great, too. The music, narration and graphics do an awesome job. In fact it did surprise me how good it works as it never had the feeling during the streams/videos for me. So in a way this version is much more alive :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454161","commentId":3454161,"userName":"Wandalf the Gizzard","timestamp":1535503329,"content":"Well, the only random purchase is through the \"Palantir\" lootbox. Everything else is set.\n\nAnd if you want to know what is in the collector's edition two-player starter, FFG has a breakdown article on their site."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454284","commentId":3454284,"userName":"DMG","timestamp":1535519081,"content":"The microtransactions mean I won't be purchasing this game.  I hate being nagged to buy stuff in games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454343","commentId":3454343,"userName":"Yepesnopes","timestamp":1535527097,"content":"> 6 hours ago, Wandalf the Gizzard said:\n> \n> Well, the only random purchase is through the \"Palantir\" lootbox. Everything else is set.\n> \n> And if you want to know what is in the collector's edition two-player starter, FFG has a breakdown article on their site.\n\nDoes the collector’s edition allow for two players to play the digital game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454400","commentId":3454400,"userName":"Calvadur","timestamp":1535535083,"content":"> 4 hours ago, DMG said:\n> \n> The microtransactions mean I won't be purchasing this game.  I hate being nagged to buy stuff in games.\n\nNot sure if irony or not. What else then microtransactions is this game build around? Every few weeks (now month :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]) FFG releases a new AP and a huge amount of people get it. They really didn't do anything than porting this system into the digital world. \nOf course physical and digital cards are different, but that doesn't really change the monetarisation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454486","commentId":3454486,"userName":"DMG","timestamp":1535545742,"content":"> 2 hours ago, Calvadur said:\n> \n> Not sure if irony or not. What else then microtransactions is this game build around? Every few weeks (now month :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]) FFG releases a new AP and a huge amount of people get it. They really didn't do anything than porting this system into the digital world. \n> Of course physical and digital cards are different, but that doesn't really change the monetarisation.\n\nAt least an LCG is something tangible.  I can sell it down the track if I want to.  It also doesn't pop up ads or harass me during a game to buy more.  I also know what I'm getting when I buy it.  It's not gambling for virtual cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454507","commentId":3454507,"userName":"gmcc","timestamp":1535548068,"content":"tbh this is like Hearthstone based on LOTR by FFG.. dont know if it will make them rich like hearthstone or not but i thought it would be like the lcg"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454510","commentId":3454510,"userName":"Wandalf the Gizzard","timestamp":1535548291,"content":"> 8 hours ago, DMG said:\n> \n> The microtransactions mean I won't be purchasing this game.  I hate being nagged to buy stuff in games.\n\nYou can ignore these and unlock everything for free with valor points\n\n> 5 hours ago, Yepesnopes said:\n> \n> Does the collector’s edition allow for two players to play the digital game?\n\nNo, multiplayer will be released later down the track. FFI posted a roadmap on their steam page.\n\n> 1 minute ago, gmcc said:\n> \n> tbh this is like Hearthstone based on LOTR by FFG.. dont know if it will make them rich like hearthstone or not but i thought it would be like the lcg\n\nAgreed. Thankfully, it's different enough and I love the theme enough to save the game for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454538","commentId":3454538,"userName":"Calvadur","timestamp":1535550559,"content":"> 1 hour ago, DMG said:\n> \n> At least an LCG is something tangible.  I can sell it down the track if I want to.  It also doesn't pop up ads or harass me during a game to buy more.  I also know what I'm getting when I buy it.  It's not gambling for virtual cards.\n\nThe resellablility is a fair point, even though I probably won't sell my cards ever^^\n\nAfter playing some hours I didn't see any aggressive advertisment. Sure if you hit the shop button they show you some \"new\" deals and products, but you clicked the shop button for a reason ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nYou also know what you get when you buy something. The content of a hero pack is always visible. The Planantir views are \"random\" as it looks (but won't give you stuff you already own e.g. cards you have 2 copies of), but there is no way of directly buying them at the moment (or at least I didn't find one) and they are rewards for \"great deeds\" or included in hero packs. Anyway the amount is limited. I didn't play enough to say how limited (looks like you can unlock one for EVERY different hero; at the moment 4 starters and 4 from packs; for EVERY quest, 5 at the moment, so it looks like you can get 40 from finishing every quest with every hero nearly perfectly), but as I said there is no repeatable way to sink money into them.\n\nI get if you don't like how the game turned out, I just don't want to leave your comment unanswered, as I found it a little missleading :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454659","commentId":3454659,"userName":"dawest1","timestamp":1535557061,"content":"It feels like the physical game, in the sense that you're doing very similar things. But the actual rules of the game are pretty significantly different in a number of ways. I bounced off of LOTR despite liking the concept, finding it a bit too complex and difficult, and ultimately wound up enjoying the Arkham Horror LCG as a more manageable spin on the same general idea (and yes, they are very different in how they play, but they are both narrative-focused co-op/solo games). The Steam version of LOTR cuts down on a lot of the rules. Hero choice determines what you can include in your deck, but you only have a single resource pool, for instance, and Sauron operates as more of a \"player\" than a deck-based \"AI.\" But they've also added some things, like what I would call a \"super bar\" that lets you divert Will points towards unlocking scenario-specific bonuses that can swing the game your way; I could see decks that are built around exploiting that feature.\n\nThe Steam version feels a bit microtransaction-heavy right now, but it's still a fraction of the cost of the physical edition. While they are two different games, it doesn't feel, at the moment, like they are wildly different in terms of substance. Which is to say, whether you pay for real money or grind it out, you're still getting a similar amount of content in terms of scenarios and replay value at a significantly lower cost. Getting the full first campaign of the physical edition--one core set and the six Mirkwood Cycle packs--costs about $130, versus the $20 of getting everything available right now on Steam. My thinking is that if I'm willing to pay so much for a physical game--the game, not the game's components, if you understand me--then I'm fine paying way less for basically the same thing. Not everyone else will agree. The key questions, to me, are: will the Steam game have the longevity of the card game, and will the Steam game--and whatever money you spend on it--vanish into the ether if it doesn't perform to Fantasy Flight's expectations? I don't have an answer for those."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281721-questions-about-the-steam-game/?do=findComment&comment=3454724","commentId":3454724,"userName":"Willange","timestamp":1535559892,"content":"> 3 hours ago, gmcc said:\n> \n> tbh this is like Hearthstone based on LOTR by FFG.. dont know if it will make them rich like hearthstone or not but i thought it would be like the lcg\n\nI will add this to my above post to address the Hearthstone comparison. As someone who occasionally plays Hearthstone, this feels significantly different... so far.  It seems perfectly reasonable in this game to get everything using the valor points without spending real money which is less the case in Hearthstone. That could change in the future (with early access it's always hard to know), so it might be wise to \"wait and see\", but for now it's not too bad. \n\nIf money is the concern, this is a bit cheaper per content unit.  I'll elaborate that here.  In the physical game, you get 1 quest plus around 9 or 10 player cards (3x of each) for about $15.  In this digital game, you get a quest for $2.  You can also buy card packs of 1x each of 4 non-random cards, plus a hero for $2.  So let's say you buy 2 card packs, plus a quest.  That's 2 heroes, a quest and 8 different player cards all for $6.  Now sure, you're getting 1x of those player cards instead of 3x, but it's important to remember that the digital game has smaller deck sizes and you can only include 2x of cards in a deck so you need less cards.  You unlock the 2nd copy of each card by playing (I don't think there's a way to buy valor points with $$$ yet, but even if there were, you get valor points quickly by just playing).  You win quests with heroes to earn more valor points and palantirs, so each quest you earn is actually going to give you even more cards once you play it through with multiple decks.  You don't even have to pay the $6 if you play often enough though.  There are no money-only purchases in the game so far.\n\nIn other words, if you actually play the digital game at a rate similar to that which a lot of people play the physical game, then you will end up with a fully playable (2x) set of those 8 player cards, plus the quest, plus the 2 heroes all for $6 as opposed to $15.  This micro-transaction model is quite generous compared to both the physical game and especially when compared to other F2P games like Hearthstone.   If you don't want to have to play to unlock stuff though, then I can't say with confidence that you would enjoy the model.   Then again, if  you don't plan to actually play, then maybe don't buy the game at all.\n\nEdited August 29, 2018 by Willange"}]}