{"url":"https://community.fantasyflightgames.com/topic/281706-ipadios-release-for-lotr-lcg/","title":"iPad/IOS Release for LotR LCG?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281706-ipadios-release-for-lotr-lcg/?do=findComment&comment=3453599","commentId":3453599,"userName":"GalaxyUC","timestamp":1535472292,"content":"I haven't been following the Beta stuff too well, and I noticed in the articles that it has not come up. But...has anyone heard if this will come out for iPad? It's kind of my preferred system. I'm not too familiar with Steam, other than I have problems getting to work on my Mac Book, and it is not available as an option on Ipad.\n\n \n\nWould be great to be able to carry this around instead of sitting at a computer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281706-ipadios-release-for-lotr-lcg/?do=findComment&comment=3453746","commentId":3453746,"userName":"RegisF","timestamp":1535480741,"content":"I suggest you to take some times before any purchase of the digital version. The first review of the games on Steam are pretty much awful ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281706-ipadios-release-for-lotr-lcg/?do=findComment&comment=3453842","commentId":3453842,"userName":"Wandalf the Gizzard","timestamp":1535487345,"content":"All of those reviews are uninformed. The main con they mention are the IAPs, but you can unlock everything without spending a penny through valor. They also say that it’s not a one to one translation of the LCG, which they should know and is not a big deal. The game is great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281706-ipadios-release-for-lotr-lcg/?do=findComment&comment=3454071","commentId":3454071,"userName":"Calvadur","timestamp":1535498528,"content":"I certainly had fun playing the tutorial (it has a nice amount of story) and the first quest with the starter deck. Going to dive into some deck building tomorrow.\n\nI don't know an offical answer, but I'd say the game would work great on mobile devices, just like Hearthstone does. But this surely won't happen until after early access."}]}