{"url":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/","title":"Embarrassing defeats","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3455469","commentId":3455469,"userName":"icabod","timestamp":1535635634,"content":"Following the recent thread on whether people study the encounter deck or play blind, I thought I’d share an embarrassing defeat I experienced when playing Journey Along The Anduin blind for the first time.\n\nTL;DR – I didn’t reach the end of Round 2.  Wife found it amusing that I spent more time setting up the game (clearing the table, shuffling the decks, allowing the accompanying wine (a fine shiraz) to breath) than I did playing.\n\n \n\nMy deck had Tactics Legolas, Lore Glorfindel, and Lore Bilbo as heroes, giving me a starting threat of 30.\n\nIn setup I revealed Driven by Shadow, which gained Surge due to there being no locations.  I revealed drew Dol Goldur Orcs.\n\nMy first 6 cards drawn were Citadel Plate, Song of Wisdom, Blade Mastery, Radagasts Cunning, Gondorian Spearman, and Minor of the Iron Hills.  Because of the Song, I kept the hand.\n\nThen I continued with setup, and a Hill Troll was added to the staging area.  It has an engagement value of 30.  This doesn’t look good.\n\nRound 1.1, I draw Lore of Imaldris and Forest Snare.  This is good – seeing that Hill Troll, I’ll need some healing.  And the Forest Snare will help to stop him attacking.\n\nRound 1.2, Nothing much I can play, so I save my resources.\n\nRound 1.3, Bilbo quests for 1.  I reveal Misty Mountain Goblins, so my threat goes to 34.\n\nRound 1.5, All 3 enemies engage!\n\nRound 1.6\n\n-    I play Blade Mastery on Glorfindel, who defends against the Hill Troll (with no shadow effect, luckily), and receives 4 damage.\n\n-    Dol Goldur Orcs, with no shadow effect, attacks undefended.  Legolas receives 2 damage.\n\n-    Misty Mountain Goblins, defended by Legolas, gets Wolf Rider shadow… which gets played as its own enemy with its own shadow card…\n\n-    Wolf Rider gets Wargs shadow card, and I have no-one to defend, so Wolf Rider is now attacking for 5… which goes to Bilbo, who due to his years doesn't survive the attack.  And Wolf Rider goes back to the top of the encounter deck.\n\n-    Misty Mountain Goblins now completes their attack on Legolas, who gets 1 more damage.\n\nRound 1.7, my threat is raised to 35, and I’m one hero down… and it's only the end of the first round!\n\n \n\nRound 2.1, I draw Striders Path.\n\nRound 2.2, I’ve lost one of my Lore resources, so I can’t afford to buy Forest Snare!  Instead I use Lore of Imaldris to heal Glorfindel, and buy Song of Wisdom for Legolas.  I’m already thinking the game is probably over.\n\nRound 2.3 - no-one quests.  I draw Wolf Rider (surprise!), which has Surge.  I draw Evil Storm.  Both my heroes get +1 damage - Legolas becomes uncharacteristically dead.\n\nRound 2.5, Wolf Rider engages.  Oh joy.\n\nRound 2.6, What can I do?  Glorfindel is killed one way or another.  I decide he can be squashed by the Hill Troll.  It’s an honourable way to die.\n\n \n\nSo… now that I know about the 30-threat engagement threshold for Hill Troll, I need to swap out a hero to have lower threat.  But is there anything else I could have done with the card-draw I got?  Or was I doomed from the start?\n\nMy deck, for what it’s worth: http://ringsdb.com/decklist/view/9737/death-along-the-anduin [http://ringsdb.com/decklist/view/9737/death-along-the-anduin]\n\nCheers, 'bod"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3455484","commentId":3455484,"userName":"Ywingscum","timestamp":1535636642,"content":"Playing blind, provides good memories:).   Threat 30 is an important threshold "},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3455579","commentId":3455579,"userName":"Wandalf the Gizzard","timestamp":1535642116,"content":"I think most decks that start above the Hill Troll's engagement cost are doomed. It's possible though, with Beorn, Treebeard, T Eowyn, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3455600","commentId":3455600,"userName":"Network57","timestamp":1535643324,"content":"I had an embarrassing play-through last night against Foundations of Stone. Arwen/Galadriel/Cirdan. My opening hand, after a mulligan, was 3x Light of Valinor, 2x Glorfindel, and Narya. First resource phase, I draw Galadhrim's Greeting and Elven Light. Discard Elven Light. Play Elven Light for 1, draw Tale of Tinuviel (the other deck had Tactagorn). Discard Elven Light for a resource back on Arwen, decide to play nothing. Quest with Arwen and Cirdan. Reveal Goblin Follower, engages me. Travel to the Lightless Passage (in staging area from set-up), exhaust the Cave Torch, and reveal another Goblin Follower. With no Sentinel on the board, I take to attacks, and just pray. Both get a +2 attack shadow effect, for two undefended 5-attacks. Lose 2 heroes in the first combat phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3455757","commentId":3455757,"userName":"Onidsen","timestamp":1535650775,"content":"> 2 hours ago, Wandalf the Gizzard said:\n> \n> I think most decks that start above the Hill Troll's engagement cost are doomed. It's possible though, with Beorn, Treebeard, T Eowyn, etc.\n\nIf you can guarantee a kill or render harmless turn 1, all you need is a deck with attack cancellation.\n\nFailing that, a Beregond deck with a gondorian shield in the opening hand is also sufficient tech.\n\nThere are plenty of options, but it certainly does cut down the number of viable decks.\n\nEdited August 30, 2018 by Onidsen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3456498","commentId":3456498,"userName":"Rouxxor","timestamp":1535711784,"content":"> 20 hours ago, icabod said:\n> \n> Round 1.6 ﻿\n> \n> -    I play Blade Mastery on Glorfindel, who defends against the Hill Troll (with no shadow effect, luckily), and receives 4 damage. ﻿\n\nYou have to play your equipment on planning phase (like allies), you can't play them on the middle of the turn. But I don't see the point to put an attacking item on a character who will block for sure. Save your ressource, may be you will have something more interesting to play, or may be you want to play it on another character (Legolas?). It even better since a lot more effects try to discard you from your equipment on the table but few attack the hand.\n\nAnd in fact that's what happens on turn two: you cannot play the forest trap because of this 1 resource short concern. It doesn't mean you will have won after that, playing with only 2 heroes is really hard. And since you already have other enemies in front of you you probably will have loose.\n\nAbout what you can have done there is some general change in the decklist that would have make your deck better (but I read that you prefer to deckbuild alone), I don't think that having a song mean you should keep your hand since song are pretty lame cards to me...\n\nBut are you doomed anyway? Yes you have be. Because of some choice already made before the start of the game (starting at 30 threat is possible but more difficult in this scenario) but also because of an awful setting of the encounter deck. Some game goes bad, really bad. And sometime you can't do anything about it. I remember to have lost turn one on solo because I reveal consecutively four treachery \"1 damage to all questing character\" with surge that ripe all my board before I even finish to reveal encounter card ^^."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3456565","commentId":3456565,"userName":"icabod","timestamp":1535719625,"content":"> 2 hours ago, Rouxxor said:\n> \n> You have﻿﻿﻿﻿ to play your equipment on planning phase (like allies), you can't play them on the middle of the ﻿turn. But﻿ I don't see the point to put an attacking item on ﻿a﻿ character who will block for sur﻿e﻿﻿﻿﻿﻿﻿﻿﻿\n\nBlade Mastery is an action that lasts until the end of the phase, and importantly gives +1 to attack and defence. Without it, Glorfindel (1 defence, 5hp) would have lost all 5 hp, as Hill Troll attacks for 6.\n\nWith the card draw I had, this was the only way I could see to soak up the damage. Bilbo dying and losing that important additional resource is what lost me the game, I think.\n\nAs for deck building, I'm trying to teach myself, but it's a slow process :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]I like songs at the moment as with my card pool it makes multi-sphere easier. No doubt as I get more experience I'll move away from them.\n\nBut yeah, I can sympathise with losing on turn one. Ouch!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3456573","commentId":3456573,"userName":"Wandalf the Gizzard","timestamp":1535720584,"content":"> 2 hours ago, Rouxxor said:\n> \n> You have to play your equipment on planning phase (like allies), you can't play them on the middle of the turn.\n\nBlade Mastery is a defense and attack boosting event."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3457407","commentId":3457407,"userName":"TheSpitfired","timestamp":1535784075,"content":"The quest: Flight from Moria. Turn 1 loss. You know how it happened. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI figure when you get the chance to escape you have to take it no matter how early or how late it comes.\n\nFor those that don’t and want to know, SPOILER WARNING for this quest: The flight from Moria has a shuffled objective deck. Only one stage has the condition on it to win the game. When it comes up, you have the option to move it to the bottom of the objective deck or discard a card per player from the encounter deck. First player first. If you discard a treachery card, you are eliminated from the game. I quested through my first objective turn 1and the escape one was the next one drawn. I went for it. Two treachery cards. It was so funny I wasn’t even mad.\n\nEDIT: I’m being told there’s a second way to win that I didn’t see. Disregard my statement that there is only one way to win the quest. Doh!\n\nSide note - I will look at the objectives but I play the encounter deck blind in as much as possible.\n\nEdited September 1, 2018 by TheSpitfired"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3457607","commentId":3457607,"userName":"Network57","timestamp":1535813466,"content":"> 8 hours ago, TheSpitfired said:\n> \n> The quest: Flight from Moria. Turn 1 loss. You know how it happened. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n> \n> I figure when you get the chance to escape you have to take it no matter how early or how late it comes.\n> \n> For those that don’t and want to know, SPOILER WARNING for this quest: The flight from Moria has a shuffled objective deck. Only one stage has the condition on it to win the game. When it comes up, you have the option to move it to the bottom of the objective deck or discard a card per player from the encounter deck. First player first. If you discard a treachery card, you are eliminated from the game. I quested through my first objective turn 1and the escape one was the next one drawn. I went for it. Two treachery cards. It was so funny I wasn’t even mad.\n> \n> Side note - I will look at the objectives but I play the encounter deck blind in as much as possible.\n\nThere are 2 quest cards with victory conditions. You tried the gambling one. There's a second quest that allows you guaranteed victory if you can locate a story asset and survive 4 turns. No random luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3457635","commentId":3457635,"userName":"TheSpitfired","timestamp":1535816121,"content":"Thanks for the correction. I’d say I don’t know how I missed that other victory condition, but this is a thread about embarrassing defeats lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281800-embarrassing-defeats/?do=findComment&comment=3457668","commentId":3457668,"userName":"Rouxxor","timestamp":1535822100,"content":"> On 8/31/2018 at 2:47 PM, icabod said:\n> \n> Blade Mastery is an action that lasts until the end of the phase, and importantly gives +1 to attack and defence. Without it, Glorfindel (1 defence, 5hp) would have lost all 5 hp, as Hill Troll attacks for 6.\n> \n> With the card draw I had, this was the only way I could see to soak up the damage. Bilbo dying and losing that important additional resource is what lost me the game, I think.\n> \n> As for deck building, I'm trying to teach myself, but it's a slow process :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]I like songs at the moment as with my card pool it makes multi-sphere easier. No doubt as I get more experience I'll move away from them.\n> \n> But yeah, I can sympathise with losing on turn one. Ouch!\n\nOops. Thanks for pointing that! I know better the french names for card I see not that much on decklist on the web.\n\nI already put many good stories in such thread, or the opposite one (encounter effects that help you, like the shadow who bring back gandalf ally in hand instead of discarding it at the end of the turn ^^)."}]}