{"url":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/","title":"September Solo League -- Mirkwood Cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457217","commentId":3457217,"userName":"dalestephenson","timestamp":1535757876,"content":"Welcome to the LOTR Solo League.  This month we'll be playing three quests from the core and Mirkwood cycle.  The quests are:\n\n1) Journey Down the Anduin\n2) Conflict at the Carrock\n3) Return to Mirkwood\n\nYes, the final quest isn't particularly well suited to single decks, but with the help of the Valar we can prevail.  Here are the rules:\n\n1) Each player will construct a 50-card deck, then use that exact deck against all three quests.\n\n2) At least one of the heroes must be from a box with those quests -- this means you must have one of the Core set heroes, or Frodo Baggins(Conflict at the Carrock) or Dain Ironfoot (Return to Mirkwood)\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan.  It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource.  This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want -- if it's going to take 16 tokens for your deck to beat Return to Mirkwood, I don't want to make you play it 17 times!  The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Return to Mirkwood and defeat it, I can play it again with 0-5 tokens.  If I then try with three tokens and lose, I can play it again with 4 or 5 tokens.  If I try with four and lose, I can play it again with 5 tokens.  If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6.  (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests.  When playing Conflict at the Carrock it does not matter how many tokens I needed to defeat Journey Down the Anduin.\n\n4) You are not required to publish your deck, but you are required to reveal which Heroes you used, and how many cards in your deck came from outside Mirkwood and a single core.  When breaking ties, the first tiebreaker is number of outside cards used (less is better), the second tiebreaker is number of heroes outside the cycle (less is better), third tiebreaker is number of heroes outside the boxes with the three quest (less is better).\n\n5) 1st place gets to choose the cycle for November's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle.  For October we will be using the Grey Havens/Dreamchaser cycle.\n\n6) Weekly deadlines will be on Monday at 11pm Eastern, but only the final deadline really matters for scoring -- the first two deadlines are only to be included in standings.\n\nJourney Down the Anduin: September 10th\nConflict at the Carrock: September 17th\nReturn to Mirkwood: September 24th\n\n7) I've created a google spreadsheet for results here:\n \nhttps://docs.google.com/spreadsheets/d/1FPWmDDTcY-3ZmJeOiIOgZzS2OS5pXEXtc1bqH8rANYA/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1FPWmDDTcY-3ZmJeOiIOgZzS2OS5pXEXtc1bqH8rANYA/edit?usp=sharing]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457530","commentId":3457530,"userName":"Zura","timestamp":1535803819,"content":"I just submitted my results, however i think the scoring system is bad and should be changed for next league. My thoughts:\n\nBecause this format doesn't take regular FFG scoring system into consideration, it has the same flaws as original scoring system - it encourages \"grinding the scenario out\", not taking any risk to try to speed up the pace. What only matters is a win. Because most really good decks will be able to score the win the 1st time they beat the scenario without any of the valar points, this will mean the player who used the deck that meets more conditions decided here, like using cards from cycle, using heroes from packs etc will win over the player that had 2x better score and played the scenario better. This is pretty crazy if you ask me. FFG scoring system will allow to compare regular 1st time wins instead of making the winner the player who used more reccomended cards.\n\nAlso favor of the valor system is actually... incredibly punishing rather than helpful for any \"competitive\" setting. It means that if you lose, you have to get those valor points which basically means you lost the competition and due to random nature of LOTR lcg sometimes, imo one lose should not be as punishing. This is how i would make it work:\n\nYou have 3 tries for each scenario. You write down each of your wins/loses and your scores for win. You submit:\n\n1) Win ratio (3/3, 2/3, 1/3), 0/3 means you are not taken into account for ranking this week\n\n2) Best Score\n\n3) If there was more than one win, other scores\n\nThis way the tiebreakers become: \n\n1) Best Score\n\n2) Win ratio\n\n3) Other Scores\n\n4) And finally, the deckbuilding restrictions at the very end\n\nImo this would make for more fun and fair competition which isn't all about not failing a scenario once but encourages keeping your win ratio high. If you want to impose restrictions harder, it should not be for addictional points, but it should be mandatory - like 50% cards in your deck have to be from the cycle.\n\nI'm hoping the league goes well and there will be further interest in the project. Please don't take anything here to yourself because i think league is a great idea and i just don't like the scoring system.\n\n \n\nEdited September 1, 2018 by Zura"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457565","commentId":3457565,"userName":"Wandalf the Gizzard","timestamp":1535808091,"content":"Thanks for running this. I can't wait to get started!\n\nWhat do you mean by \"weekly deadlines\" versus \"final deadline?\" That we can play each quest each week?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457566","commentId":3457566,"userName":"dalestephenson","timestamp":1535808328,"content":"Hello Zura, Thanks for playing!  I'm impressed with your score.\n\nI'm open to revising the scoring method at the end of the season, after we've had a chance to play with this and see how it all stacks out.  In the \"Any interest in a solo league\" thread I gave my rationale for my proposed rules, but the rules are less important than what the players want to get out of the league.  Here's what I personally wanted:\n\n1) An excuse to play and compare results against some quests\n\n2) A required workload that can be easily managed over the course of a month\n\n3) Requirements that give our decks at least something in common, but...\n\n4) Flexibility in our constructed decks and some of our heroes\n\n5) Some sort of advantage for players who use a limited card pool, whether by choice or necessity\n\n6) Have players experience something besides soul-crushing losses.\n\nAside from glory and fame forever, the rewards are pretty minimal, non-existent outside the top three, so my hope was that winning the league would take a back seat to playing the league -- but it's a pretty forlorn hope, because winning leagues, like winning games, is sufficient reward in itself.\n\nGiven those goals, what sort of ad hoc scoring system works best is unknown to me.  The appeal of using Valar Tokens as a scoring mechanism to me is that it produces a number that can be compared, but it also helps prevent #6.  Someone who piles up a lot of Valar tokens may not win the league, but they'll at least win the quests, and so (I hope) will at least go out on a high note.  Maybe I'm wrong and most players would prefer to just take their loss (or losses) and move on, rather than resort to what can become easy mode on steroids to overpower the quest.  The Valar Tokens aren't intended to feel like punishment, they're intended to feel like help.\n\nYes, I ignored the official scoring system -- I actively dislike the official scoring system for two main reasons:\n\n1) It's largely driven by style of play\n\n2) It requires you to track something you don't normally track (number of turns)\n\nThe scoring system believes that your win is \"better\" if you did it more quickly, or that all else being equal a win with an undamaged TaGimli is better than a nearly-dead TaGimli.  I believe neither -- I believe that a deck that grinds out a quest and wins 100% of the time is superior to an Aggro deck that wins much quicker but only wins 95% of the time.  I would be opposed to *any* scoring system that is driven by style of play -- this also means I would oppose just going by VP cards from the encounter deck, since the slow deck would naturally see more of those cards.\n\nBut we need *some* sort of differentiator in a league, and just W-L (or Valar tokens) won't do it.  That's why my tiebreakers go back to card pool -- same result, but done with more in-cycle cards.  You can choose to make your deck weaker by constricting your card pool, at the risk of the weaker deck acquiring more tokens.  That simultaneously (I hope) discourages just bringing a power deck to the league and also gives players with a limited card pool a shot.  (Though I'll be surprised if Mirkwood-only players manage as well as you did.)\n\nAnyway, we'll certainly want to revisit the rules/scoring before the October league, after everyone's had a chance to experience the current ruleset.  It's quite possible no single league can be all things to all players who'd like to do a monthly league.  In Legendary I've played in as many as four different leagues at the same time -- one that uses only the core set (and sometimes Dark City), a \"Starter League\" that uses Core + one expansion, the full league that uses all the sets up to a certain point, and even a Semi-Co-Op league where all the players use the exact same heroes and the collective W-L of all players is what matters most.\n\nEdited September 1, 2018 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457567","commentId":3457567,"userName":"dalestephenson","timestamp":1535808507,"content":"> 4 minutes ago, Wandalf the Gizzard said:\n> \n> Thanks for running this. I can't wait to get started!\n> \n> What do you mean by \"weekly deadlines\" versus \"final deadline?\" That we can play each quest each week?\n\nNo, those are just milestones where I'll post the intermediate standings.  Specifically:\n\n1) After September 10th I'll post standings *through the first quest*\n\n2) After September 17th I'll post standings *through the second quest*\n\nBut September 24th is the one that matters.  If you want to wait until the last week to play any of the quests that's totally legal; it just means you won't be in the intermediate standings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457574","commentId":3457574,"userName":"Rouxxor","timestamp":1535809315,"content":"Put my name on the spreadsheet. Probably will do a first run with one of my actual solo Dwarf deck.\n\nEdited September 1, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457627","commentId":3457627,"userName":"Network57","timestamp":1535815319,"content":"I can see the flaws in the scoring system but it's a massive improvement over FFG's. But for something like this, who cares if it's not perfect? The prize for winning is just bragging rights and getting to play your favorite quests next time around. But since we all probably love this game enough to be in a league, I don't think any of us will complain about any cycle being chosen. I, for one, just want to play and having a competition gives me incentive to do so. I fully expect to be at the bottom of the standings. I'm not a very good deckbuilder!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457687","commentId":3457687,"userName":"Wandalf the Gizzard","timestamp":1535824185,"content":"Yeah, I'd rather not use FFG's system. ten points per round is too harsh, especially with quests like CatC.\n\nAnyway, here are my results from the first two quests for anyone interested.\n\nMy early loss on JdtA came from a one turn loss when Pursued by Shadow cam up as the setup card. The Hill Toll engaged first round and with no allies in play, a Wolf Rider shadow card told me it was time to scoop. The second game was going much better until midway through stage two, Goblin Sniper, Evil Storm, and Necromancer's Reach nearly cleared my board. I managed to come back and win it, though.\n\nMy single game of CatC kicked off horrendously, but the deck I was using had a lot staying power and somehow, with two Sacked, six progress on stage one, and my threat steadily climbing, I brought the game back down under control and finished off the Trolls like it had been that easy the whole game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3457963","commentId":3457963,"userName":"Authraw","timestamp":1535852395,"content":"Got some free time today, so I used this challenge as an excuse to go back and revisited a deck I built for my blog a while ago that I've been meaning to try against other quests. It worked way better than I had expected!\n\nMy first game was the only one that I lost. I revealed Pursued by Shadow during Setup, which I had no way to counter, so I had to raise my threat by 3. That put me within Hill Troll range immediately, which had me on the back foot for most of the game. I was able to dispatch the Hill Troll eventually (although it took like four or five rounds) but I had to trigger Aragorn's reset ability earlier than usual in order to stay alive.\n\nMy deck served me cards in the wrong order, so it took me a long time to get to the end of the quest. I ended up threatting out on the last Stage while trying to kill the last copy of  \"Wargs\" that kept returning to the Staging Area, preventing me from actually winning. I was so close! Lots of things conspired against me that game.\n\nMy other games went pretty well, though. Conflict at the Carrock was pretty easy to dispatch thanks to Aragorn's threat reset allowing me to take my sweet time. I did end Return to Mirkwood at 49 threat, but part of that was because I decided to take the direct damage from Hummerhorns as threat through Frodo's ability, even though I could have instead chosen to lose a Hero instead (and things would have also turned out fine).\n\nThis was fun! I'm looking forward to seeing if anyone can get a perfect score! ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458180","commentId":3458180,"userName":"Wandalf the Gizzard","timestamp":1535892277,"content":"Played Return to Mirkwood last night. Turn one Attercop! I pulled off a win on the second try. Looks like you have me beat, Authraw!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458187","commentId":3458187,"userName":"Rouxxor","timestamp":1535893546,"content":"First game with my solo dwarf deck against Journey down the Anduin:\n\nI have a starting threat of 30, pretty bad in this scenario. I reveal a 10 threat location (nightmare of course) before the troll. What a first turn it is! I don't have draw in my beginning hand (I'm especially looking for legacy of durin) but I have many allies and steward of Gondor. I play Erebor Record Keeper and dwarven sellsword, a cram on Dain an send everyone but Dain in quest (hope for nothing bad occur, have to get a bit lucky with such a setup). I get a bunch of nightmare treachery  who don't meet their requirement and so get surge, a surge bird and a treachery who give me as much threat as I have character who don't quest... so only 1 :D. I travel on the location and engage the two enemies. I block the troll with Dain, he get a +1 attack shadow and let Dain at 1 HP. I let the bug undefended and deal 2 damage on Thorin. I ready Dain with cram to kill the bird.\n\nTurn two I send almost no one to the quest. I reveal a 48 threat goblin that I let in the staging area, trash block the troll with my miner of the iron hills, block the new nightmare impossible to kill rat, then send everyone (except Dain) to attack in order to kill the troll. Next turn I reveal a treachery that put back the troll in the staging area (really?) but I can do the same things with the help of lure of moria. Then I reveal another 48 threat goblin (so no one can be engaged at this moment) and a location. During this time I draw little things (like a gimli, but nothing that allow me to explode like a Gandalf with my 2 sneack attack). I'm at 42 threat so I decide to go anyway in stage 2. I want to go to stage 3 before being too high in threat. I just draw a Gandalf the turn after so I'm able to quest well and kill all the enemies at this moment.\n\nA difficult win but a win in first try :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458206","commentId":3458206,"userName":"Rouxxor","timestamp":1535896884,"content":"Then againt conflict at the carrock:\n\nI know how to proceed to win this one quite easily: stall the game on step 1, try no to quest too hard but not to take too many threat (henamarth is really good for that, but I don't play it) then reduce the threat under 34 before go to quest 2. Take the troll one by one and kill them. The nightmare version offer some difference: 1/ it put a progress counter on the quest if no one have been put this turn. So the troll will come on the 7th turn or before. 2/ We have to defeat a fifth troll after the 4. 3/ The troll are a little bit different. 4/ There is more troll on the encounter deck\n\nI open a 6 hand with 1 legacy of numenor (not really a good card in this 3 scenario), 2 steward of of gondor... and only one ally (and no legacy of durin). This is not good to me. I mulligan and open a hand with many allies. Then on turn 2 I was able to play steward of gondor, a very good tale that discard a legacy of durin, hammersmith that bring back the legacy. I'm started. 2 or 3 turns later I got my deck empty, with almost of my dwarf in play and the rest of my deck in hand. Among them some gandalf have been discarded in the course of the game but they are now back in my hand thank to Ered Nimrais Prospector.\n\nDuring this time my threat was at 37 because I rather take some threat than overquesting on the few first turns. I get back at 32 with gandalf and quest with all my dwarf and ready them with lure of moria. Take a tiny troll with 3 attack, block with Dain, block a smaller enemy and kill them. Then each turn I play a gandalf to reduce my threat and block with him and kill the troll. So 4 turns later (4 trolls, 3 gandalf, 1 sneack attack) the game is over.\n\nThe next one will be the harder, but if I get a nice start like in this one I may get to win it. I hope I will."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458267","commentId":3458267,"userName":"Rouxxor","timestamp":1535904180,"content":"And the last one.\n\nI mulligan again for a starting hand with legacy of durin (or at least king under the mountain). I succeed at finding all three before the end of the turn one (but sadly not on the right order). I get 8 threat because of a treachery. So I'm at 48 threat at the beginning of turn 5. I have to play a Gandalf each turn and to be lucky on the treachery / shadow cards. I don't have difficulties to quest enough or beat ennemies since the turn three but I fail on the last combat phase because of a shadow who deal 4 threat to me. I'm still able to kill the enemies but not to put the 2 last progress counter on the stage 4. I wouldn't have this shadow without the nightmare effect that force me to look for an attercop when I get on stage 4.\n\nSo I will retry with a valar point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458336","commentId":3458336,"userName":"Rouxxor","timestamp":1535912481,"content":"Another try\n\nI get an even better beginning hand, with the three good equipment in turn one (after some draw/cantrip event). I don't play any ally because I just want to get as many threat reduction as fast as possible. I get a treachery that make me deal 4 to a hero. Take it Thorin (who survive with his 5 HP). I put many allies on the following turn, but Thorin die in a shadow that deal 1 damage on each character (so do die an ally). I get milled of 10 cards (2 gandalf) so I rely on sneak attack for now. I do it two time to vary between 35 and 40 threat. I have a enemy who deal 5 damage on a hero when it engage me. I manage to get on stage 4 where I can put a Gandalf to kill it before loosing a hero. But a treachery destroy all my attachement so I accept to let Bifur die and I use gandalf to kill the two enemies and reduce my threat. I win the turn after that, after killing another enemy. What a game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458346","commentId":3458346,"userName":"CaffeineAddict","timestamp":1535913952,"content":"Submitted my results - \n\nJourney Down the Anduin - Won on first attempt\n\nConflict at the Carrock - lost first attempt due to location that gets+1 threat for each troll in play causing my threat to raise high enough that I had to engage all the trolls at once rather than selectively picking them off.\n\nSecond attempt with 1 Grace of the Valar token (used to add a resource to Eowyn for early Galadhrim's greeting) was successful, keeping threat low and building up during stage 1, then selectively engaging, forest-trapping and defeating the trolls. managed two sneak attacks  Gandalf and Beorn in one combat phase, followed by Grim resolve to get a second use from each, finishing two trolls. Discarded Beorn to Eowyn and used stand and fight the next round to bring him back to finish the final Troll (A hill troll came out on the last round, so i needed to kill him off as well).\n\nReturn to Mirkwood - Won on first attempt. Got lucky with the draws, so never encountered Attacop, and got the discard 10 from your deck during setup. 48 threat on the final round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458366","commentId":3458366,"userName":"dalestephenson","timestamp":1535916476,"content":"One Valar token with *no* cards outside single core + Mirkwood?  That's going to be tough to beat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458453","commentId":3458453,"userName":"Authraw","timestamp":1535925849,"content":"> 2 hours ago, dalestephenson said:\n> \n> One Valar token with *no* cards outside single core + Mirkwood?  That's going to be tough to beat.\n\nWow! Yeah, that's pretty impressive. Seems like now it's down to whether or not someone can get a perfect score!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458467","commentId":3458467,"userName":"Rouxxor","timestamp":1535927363,"content":"I just realize that I forget to use my valor point :x. Corbetta is only one game away to a perfect run. Good luck!\n\nI may want to retry this league, with other decks (another dwarf, a secrecy with Frodo both in nightmare, a deck with only card of those set and standard mode on OCTGN). It is okay to add those results to the spreadsheet?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458522","commentId":3458522,"userName":"Network57","timestamp":1535930946,"content":"Feels like everybody's getting to this quickly! I probably won't have my results until closer to the 10th =/ sorry guys! But I promise I'm in!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458532","commentId":3458532,"userName":"Wandalf the Gizzard","timestamp":1535931912,"content":"Argh! I'm out of the running. Well done and congrats, Rouxxor and CaffeineAddict!\n\nEdited September 2, 2018 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458652","commentId":3458652,"userName":"dalestephenson","timestamp":1535944946,"content":"It's OK to make runs with other decks if you just want to try them, and add them to the spreadsheet, but only your first entry will be considered the \"official\" entry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3458929","commentId":3458929,"userName":"Yepesnopes","timestamp":1535987803,"content":"Hi Dales!\n\nVery nice initiative!\n\nI went nightmare mode to have an excuse to dust off my Elrond - Gandalf deck [http://www.ringsdb.com/deck/view/119344].\n\nThanks mate!\n\nEdited September 4, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3459079","commentId":3459079,"userName":"PigsAreOurEquals","timestamp":1536004190,"content":"I like the idea but only own the first quest. I ll try to submit my result on that one as a sign of support."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460286","commentId":3460286,"userName":"theagesthrough56","timestamp":1536097260,"content":"(Cross-posting from BGG)\n\nI just finished my run. Managed a clean sheet, but I’m afraid I can’t win because I don’t have the tiebreaker. I used http://ringsdb.com/decklist/view/9735/the-picky-peoples-1.0 [http://ringsdb.com/decklist/view/9735/the-picky-peoples-1.0]. Congrats to YepesNopes for his Nightmare run. Would love to hear about his win against Return to Mirkwood with a starting threat of at least 35, that must have been epic. EDIT: also congrats to Rouxxor, of course. His run certainly deserves to be ranked higher than mine. The session report is impressive.\n\nJourney Down the Anduin : I defeated this quest right on the heels of defeating Journey Up the Anduin from The Wilds of Rhovanion (which is trickier and harder IMO). I didn’t need to discard Folco. The matchup is in favor of this deck because of the very low threat and the encounter deck manipulations. In the final stage, the only dangerous enemy that had a lower engagement cost than my threat was the Warg, and I removed it after its attack by paying O Elbereth Gilthoniel full cost (it thought it could escape to the staging area -- no thank you). Other enemies with lower engagement cost were caught on Ranger Spikes. So I just picked them off one at a time. The main threats were the setup and direct damage from Necromancer’s Reach and Dol Guldur Orcs. I drew Necromancer’s Pass for the setup, which makes you discard 2 cards at random when you travel to it. Luckily, I had the only copy of Thror’s Map in my opening hand, and later I drew into the only copy of Warden of Healing.\n\nConflict at the Carrock : a clinic in turtling. The scrying allows you to quest just enough to stay ahead of the encounter deck, without putting too much progress tokens. I stayed 10+ turns in quest stage 1, going almost through my entire deck looking for Treebeard.\n\nReturn to Mirkwood : I was apprehensive before this one. I had never beat this quest before. I had lost to it badly, and then I snubbed it because of how poorly I thought it played solo. This time, Denethor and Risk Some Light did the work. Together, they moved to the bottom of the encounter deck 2 Mirkwood Bats, 1 Wolf Rider, 1 Marsh Adder, and 1 Hummerhorns. As a result, I only met harmless locations and 2 treacheries (one was Gollum’s Anguish, which increases threat by 8, and it got Test-of-Will’ed). My plan was to have the Denethor-Firyal combo ready for stage 3, where you can’t play cards at all. They were my insurance against a game-ending Gollum’s Anguish or enemies that would have protracted stage 4 and led to defeat by threat. Sure enough, Firyal discarded a Warg which could have easily won the game for Sauron. Instead, I got a nice Woodman’s Glade location and sailed to victory. The only threat reduction all game was from discarding Folco. I would have lost without his ability, as I failed to draw Gandalf (the only other source of threat reduction) and finished at exactly 43 threat. His sacrifice made it possible to stay in secrecy for 2 turns despite Gollum’s threat increase, and allowed me to play Risk Some Light twice for free.\n\nEdited September 5, 2018 by theagesthrough56"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460454","commentId":3460454,"userName":"Wandalf the Gizzard","timestamp":1536111660,"content":"> 3 hours ago, theagesthrough56 said:\n> \n> I had never beat this quest before.\n\nYou should have asked here for tips! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] We would have you loaded up with strategy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460613","commentId":3460613,"userName":"theagesthrough56","timestamp":1536129791,"content":" \n\n> 5 hours ago, Wandalf the Gizzard said:\n> \n> You should have asked here for tips! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] We would have you loaded up with strategy.\n\nI’ll remember that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Thanks man."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460674","commentId":3460674,"userName":"Yepesnopes","timestamp":1536137853,"content":"> 11 hours ago, theagesthrough56 said:\n> \n> Congrats to YepesNopes for his Nightmare run (would love to hear about his win against Return to Mirkwood with a starting threat of at least 35, that must have been epic).\n\nWell, I modified my deck to face these three particular quests. The deck has the capacity to lower its threat by 54 during the course of a game! (3 The Galadhrim's Greeting, 3 Elrond's Counsel and 1 Will of the West) and I put 1 O Elbereth! Gilthoniel! as an extra meaning to deal with the Troll or a bad timed Attercop Attercop spider.\n\nActually, I sort of cheated in Journey down the Anduin. Of course, with a starting threat of 35 I was forced to engage the troll on turn 1. The first attack was soaked by Frodo bringing my threat up to 39 on turn 1! On the second round I could play O Elbereth! Gilthoniel! [http://hallofbeorn.com/LotR/Details/A-Elbereth-Gilthoniel-SaF] from the top of my deck thanks to the wizard pipe, relegating the poor hill troll to the bottom of the encounter deck. I beated the adventure without fighting a hill troll once...\n\nConflict at the CarrocK is very easy for this deck, so not a big deal here.\n\nBut Return to Mirkwood felt epic, or at least for poor old Frodo, who I nominated MVP! (with Firyal's consent) In turn 2 he got caught in a web [http://hallofbeorn.com/LotR/Details/Caught-in-a-Web-Core], just to get killed in turn 3 by the hummerhorns [http://hallofbeorn.com/LotR/Details/Hummerhorns-Core] that I was forced to engage due to my high threat. Luckily, Landroval [http://hallofbeorn.com/LotR/Details/Landroval-AJtR] swooped last moment to bring him back (sort of a drastic way to remove a condition from a hero, but effective). After this, Frodo stayed exhausted the whole adventure to prevent the discard pile Tantrum effect. Yet another epic sacrifice from this hobbit!\n\n \n\nEDIT: In my opinion Firyal has changed forever the solo playing mode of this game, she trivialises it a lot.\n\nEdited September 5, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460767","commentId":3460767,"userName":"theagesthrough56","timestamp":1536148524,"content":"> 2 hours ago, Yepesnopes said:\n> \n> Well, I modified my deck to face these three particular quests. The deck has the capacity to lower its threat by 54 during the course of a game! (3 The Galadhrim's Greeting, 3 Elrond's Counsel and 1 Will of the West) and I put 1 O Elbereth! Gilthoniel! as an extra meaning to deal with the Troll or a bad timed Attercop Attercop spider.\n> \n> Actually, I sort of cheated in Journey down the Anduin. Of course, with a starting threat of 35 I was forced to engage the troll on turn 1. The first attack was soaked by Frodo bringing my threat up to 39 on turn 1! On the second round I could play O Elbereth! Gilthoniel! [http://hallofbeorn.com/LotR/Details/A-Elbereth-Gilthoniel-SaF] from the top of my deck thanks to the wizard pipe, relegating the poor hill troll to the bottom of the encounter deck. I beated the adventure without fighting a hill troll once...\n> \n> Conflict at the CarrocK is very easy for this deck, so not a big deal here.\n> \n> But Return to Mirkwood felt epic, or at least for poor old Frodo, who I nominated MVP! (with Firyal's consent) In turn 2 he got caught in a web [http://hallofbeorn.com/LotR/Details/Caught-in-a-Web-Core], just to get killed in turn 3 by the hummerhorns [http://hallofbeorn.com/LotR/Details/Hummerhorns-Core] that I was forced to engage due to my high threat. Luckily, Landroval [http://hallofbeorn.com/LotR/Details/Landroval-AJtR] swooped last moment to bring him back (sort of a drastic way to remove a condition from a hero, but effective). After this, Frodo stayed exhausted the whole adventure to prevent the discard pile Tantrum effect. Yet another epic sacrifice from this hobbit!\n> \n>  \n> \n> EDIT: In my opinion Firyal has changed forever the solo playing mode of this game, she trivialises it a lot.\n\nI wouldn't have thought of playing O Elbereth Gilthoniel in a non-secrecy deck, but actually, in a high-threat Vilya deck, it makes sense. Genius move, man.\n\nEdited September 5, 2018 by theagesthrough56"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3460959","commentId":3460959,"userName":"Yepesnopes","timestamp":1536161607,"content":"I don’t think you can play O Elbereth Gilthoniel (response) with Vilya (action).\n\nWhen I need to play it, I do it from the top of the deck, to be able to use Gandalf’s resources as well.\n\nEdited September 5, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461105","commentId":3461105,"userName":"Stevew980","timestamp":1536170940,"content":"Question about the valor rules for the mode: \n\nI read the first post as you/I start with 6 cards in hand and your mulligan, correct?\n\nDo you receive resources as normal on your hero’s at start and each turn or do you only get them by spending a token?\n\nSame question regarding card draw at the top of each turn.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461120","commentId":3461120,"userName":"dalestephenson","timestamp":1536171818,"content":"Yes, you receive the card and resources on the start of each turn as normal.  The tokens just give you some extra help in between your  starting hand and the scenario setup.\n\nSo to take an example, suppose I have two valar tokens from losing Journey Down the Anduin already, and I am playing the SpEowyn/TaGimli/Thalin deck.  My opening hand (after mulligan) is 2x Northern Tracker, 2x Winged Guardian, Unexpected Courage, and Gandalf.  I use the first Valar token to draw a card, which turns out to be Galadhrim's Greeting.  I decide to use the second token to place a resource on Eowyn, so she will be able to put Unexpected Courage on Gimli first turn.  I then reveal a card for scenario setup -- lucky break, it's a Hill Troll.  Now I move to the first turn and each hero gets a resource, and I draw a new card (Quick Strike).   The game proceeds normally as there.\n\nIf you have three tokens and use them to place a resource on each hero, it plays exactly as semi-easy or \"sleazy\" mode would; giving you extra resources like easy mode but not altering the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461132","commentId":3461132,"userName":"dalestephenson","timestamp":1536172457,"content":"> On 9/3/2018 at 3:49 PM, PigsAreOurEquals said:\n> \n> I like the idea but only own the first quest. I ll try to submit my result on that one as a sign of support.\n\nNext month will be drawn from the Dreamchaser cycle, which I believe is widely available, so unlike Mirkwood you would be able to purchase them if you would like (you might not want to, of course.) Randomly selected quests will be:\n\nVoyage Across Belegaer (from Grey Havens Deluxe) [heroes are Cirdan and Galdor]\n\nFlight of the Stormcaller (1st AP in cycle) [hero is Leadership Denethor]\n\nTemple of the Decieved (3rd AP in cycle) [hero is Elfhelm]\n\nThe top three of this league will help determine what November's quests will be, I wanted substantial warning so that potential players can acquire the quests if they want (and they can find them)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461160","commentId":3461160,"userName":"Stevew980","timestamp":1536174130,"content":"Good to know. I think I’ll hop on, if only to screw around. I don’t actually plan to “win” but it’s a good excuse to play and revisit old quests.  I’ll use the following deck:\n\nhttp://ringsdb.com/decklist/view/9802/mono-spirit-secrecy-ohuh-gandalf-1.0 [http://ringsdb.com/decklist/view/9802/mono-spirit-secrecy-ohuh-gandalf-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461162","commentId":3461162,"userName":"CaffeineAddict","timestamp":1536174198,"content":"> 28 minutes ago, dalestephenson said:\n> \n> Next month will be drawn from the Dreamchaser cycle, which I believe is widely available, so unlike Mirkwood you would be able to purchase them if you would like (you might not want to, of course.) Randomly selected quests will be:\n> \n> Voyage Across Belegaer (from Grey Havens Deluxe) [heroes are Cirdan and Galdor]\n> \n> Flight of the Stormcaller (1st AP in cycle) [hero is Leadership Denethor]\n> \n> Temple of the Decieved (3rd AP in cycle) [hero is Elfhelm]\n> \n> The top three of this league will help determine what November's quests will be, I wanted substantial warning so that potential players can acquire the quests if they want (and they can find them).\n\nWill the deck construction tiebreaker still include a single core, or just those packs?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461166","commentId":3461166,"userName":"dalestephenson","timestamp":1536174361,"content":"Deck construction tiebreaker will include a single core + Grey Havens + Dreamchaser cycle.  I figure a single core should always be fair game, since everyone will have one.  (Well, unless they started with the Limited Edition Starter...)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461529","commentId":3461529,"userName":"Stevew980","timestamp":1536198607,"content":"When I got home and started actually constructing my deck I realized I’d made a bad decision in including Elven Light with no discard mechanism.  So I made a couple changes. Technically that probably disqualifies me but that’s ok.\n\nhttp://ringsdb.com/decklist/view/9806/mono-spirit-secrecy-ohuh-gandalf-2.0 [http://ringsdb.com/decklist/view/9806/mono-spirit-secrecy-ohuh-gandalf-2.0]\n\nI beat Journey on the first attempt with no tokens used despite never seeing Light of Valinor, Rescourceful, not seeing Gandalf until the last turn, starting with a Goblin sniper on the board and drawing the 2nd Troll on turn 3. Having Treebeard, Arwen, Hama and Sam in my starting hand saved me.\n\nEdited September 6, 2018 by Stevew980"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3461588","commentId":3461588,"userName":"Stevew980","timestamp":1536207078,"content":"Conflict defeated first attempt, no tokens used.  Again ended up with both Hill Trolls and a Goblin Sniper out before I completed stage 1. But Pelargir Shipwrights are great for soaking damage and the trio of Gandalf, Treebeard, and Spirit Glorfindel are good at taking down trolls. I had the questing strength to power through the Carrock, even with 12 threat in the staging area and once I had Jubayr defending at strength 4 (with Arwen help) it was just a matter of time.\n\n \n\nReturn to Mirkwood has not gone as well.  Two attempts, two failures.  The first time I hit both treachery’s raising my threat by 8. I threat out needing just one more turn to power-quest through. Attempt #2 had an Attercop drop on me turn 3 when I wasn’t prepared for it. Combined with being on stage 3 and not being able to play cards, and everything went downhill. I’ll try again later this week.\n\nEdited September 6, 2018 by Stevew980"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3463127","commentId":3463127,"userName":"Stevew980","timestamp":1536333651,"content":"I successfully Returned to Mirkwood on the third attempt, no tokens used.\n\nI was a little luckier with my draws, avoiding the worst enemies and treachery’s. An Attercop still found me, but I was ready for it, using Treebeard, Gandalf and Glorfindel to do the final damage, though it took 2 rounds to kill and cost me allies Hama and Sam.\n\nAfter the three games I made a couple more adjustments to the deck, swapping one Celduin traveller, Bilbo, and one Hobbit Pipe for two copies of Gamling and one Will of the West."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3463231","commentId":3463231,"userName":"CaffeineAddict","timestamp":1536338553,"content":"> 1 hour ago, Stevew980 said:\n> \n> I successfully Returned to Mirkwood on the third attempt, no tokens used.\n> \n> I was a little luckier with my draws, avoiding the worst enemies and treachery’s. An Attercop still found me, but I was ready for it, using Treebeard, Gandalf and Glorfindel to do the final damage, though it took 2 rounds to kill and cost me allies Hama and Sam.\n> \n> After the three games I made a couple more adjustments to the deck, swapping one Celduin traveller, Bilbo, and one Hobbit Pipe for two copies of Gamling and one Will of the West.\n\nI thought we couldn't do multiple attempts with 0 tokens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3463335","commentId":3463335,"userName":"Stevew980","timestamp":1536342987,"content":"As I said- I wasn’t too worried about the rules and more concerned with just playing. I can be counted as having used whatever the minimum number of valar tokens was, even though I didn’t need them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3463386","commentId":3463386,"userName":"dalestephenson","timestamp":1536346222,"content":"Your score is the number of tokens earned.  If you find it more enjoyable not to use them that's fine, but they count against you for scoring all the same.  Since you won on the third try, your score would be 2 for that quest.\n\nStevew980, I didn't see you on the spreadsheet so I added your results there.  If I'm counting correctly, you used 43 cards from outside Mirkwood + single core."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3464005","commentId":3464005,"userName":"dalestephenson","timestamp":1536421839,"content":"Took a break from chores to run through Journey Down the Anduin with my Fastred/Dunhere/Bard.  I was a little worried when I didn't see any weapons or armor in my opening hand, even after the mulligan, but it was smooth sailing -- the encounter deck gave me some weak enemies to bounce back to staging until the attachments showed up, so I was able to keep decreasing my threat and clean up with Dunhere.  Once he got a couple weapons the Troll was dispatched without ever attacking, and in the end I only popped above 30 threat when Pursued by Shadow popped up at the end.\n\nIt's only the 8th and most players have finished the league already.  Would a parallel two-handed solo league be a good idea?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3464132","commentId":3464132,"userName":"Orcstalker","timestamp":1536433802,"content":"Not sure that I totally got the scoring system, but hope that this is correct.... played JdtA three times and added a token each time after taking none for the first attempt, got CatC on the second play using a single token, and beat RtM on the first play, so I posted 2/1/0 for Valar tokens. In each case, the wealthy dwarf, who had become wealthy by stewarding Gondor, bailed out the team by either sneaking or buying an Istari wizard at just the right moment. Praise Eru for a \"Stand and Fight\" to finally beat JdtA as threat was running dangerously high , and the Istari just happened to already be in the discard pile. The first quest was miserable, as I pulled the second Hill Troll on the first encounter draw the first time around, just no way to beat that starting with 29 threat. A great choice by the moderator, as all three quests were fun to go back and revisit with some of the later cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3464186","commentId":3464186,"userName":"dalestephenson","timestamp":1536438684,"content":"2/1/0 is correct.  The quests were randomly selected, so they could have just as easily been Passage through Mirkwood, Escape from Dol Goldur, and Hills of Emyn Muil -- I was actually not very pleased to see Return to Mirkwood be selected by the randomizer, because the threat increases are so much worse for a single-deck player.\n\nI hate to tell you this, but Stand and Fight can't get Gandalf out of the discard pile, since it was ruled that his lack of a sphere disqualified him.  I don't think much of that particular ruling, so if you want to pretend you didn't see this message I'll understand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3464707","commentId":3464707,"userName":"Orcstalker","timestamp":1536517434,"content":"> 21 hours ago, dalestephenson said:\n> \n> I hate to tell you this, but Stand and Fight can't get Gandalf out of the discard pile, since it was ruled that his lack of a sphere disqualified him.  I don't think much of that particular ruling, so if you want to pretend you didn't see this message I'll understand. ﻿\n\nActually, thanks for letting me know that, as this is a lot like golf; you just have to play it straight. I replayed the quest and made it with one Valar point this time as the encounter deck was a smidge kinder, so I appreciate the tip."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3465572","commentId":3465572,"userName":"Vase","timestamp":1536610699,"content":"Hello,\n\nMaybe I missed it, but where I can find a full explanation of the Grace of the Valar variant invented by Seastan?\n\nThanks :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3465636","commentId":3465636,"userName":"dalestephenson","timestamp":1536615566,"content":"https://community.fantasyflightgames.com/topic/271926-easy-mode-variant-cycle-campaign-variant/ [https://community.fantasyflightgames.com/topic/271926-easy-mode-variant-cycle-campaign-variant/]\n\nNote that there are a few changes between his variant and what is used in the league.  Specifically:\n\n1) There is no \"fallen hero\" concept or permanent threat issues.\n\n2) You don't need to count the number of rounds -- you may voluntarily choose to take more than one valar token in the case of a loss, but are not required to do so -- and if you do take multiple tokens at once and win, you can backtrack to use less tokens (as long as you are using more tokens than all your losses against the quest).\n\n3) Instead of summing your tokens used across an entire nine-quest cycle, it's just for the three quests in the league.\n\nHowever, mechanically the tokens work just as described -- after the mulligan step, for each token you have earned, you choose to draw a card or place a resource on one of your heroes.  The \"group\" in the case of this league is the single deck you are using."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3466076","commentId":3466076,"userName":"dalestephenson","timestamp":1536667627,"content":"Standings after Week One (cards out of single core + Mirkwood in Parens\n\n0 CaffieneAddict (0)\n\n0 Corbetta (0)\n\n0 Yepesnopes (29) [nighmare]\n\n0 Zura (33)\n\n0 dalestephenson (37)\n\n0 Rouxorr (41) [nightmare]\n\n0 throughtheages56 (41)\n\n0 Stevew980 (43)\n\n0 dtwiley (???)\n\n1 Wandalf the Gizzard (9)\n\n1 Orcstalker (28)\n\n1 Authraw (35)\n\n1 Rahlan (39)\n\n3 Velensk (9)\n\n3 Lithicbee (39)\n\nWith a maximum of three tokens taken, I think everybody did better than a win in easy mode.  CaffieneMode and Corbetta tied for the top spot against this quest, needing no tokens while taking all their cards (and heroes) from core+Mirkwood.\n\nFor those who haven't made a deck and played yet, it's not too late.  The only deadline that really matters is the 24th."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3466247","commentId":3466247,"userName":"Yepesnopes","timestamp":1536679843,"content":"Kudos to Caffeineaddict and corbetta for this 0 cards! Awesome!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3471651","commentId":3471651,"userName":"icabod","timestamp":1537045930,"content":"Well, I'm a little bit behind, but I'm away for work for a few days this coming week, so I've been building a deck to take with me.  Probably a terrible one, but at least it has a low starting threat after my mistake last time I played Journey Along The Anduin.\n\nNot sure I'll get all the quests played, as I'd like to see some of the outside world, and I've not actually played through the other quests in the Mirkwood cycle - ideally I'd like to play them all in order... but who knows.  I'm sure I can fit a few extra quests into my bag at the expense of... clean socks?\n\nOne question - you mention a 50-card deck. Is that the lower limit? I'm currently trying to whittle down my deck from about 108 ?\n\nKidding - it's at about 56, and I aim to reduce it more, but getting to 50 will be a struggle with my \"madskillz\".\n\nEdited September 15, 2018 by icabod\nAdded a question about deck size."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3471852","commentId":3471852,"userName":"dalestephenson","timestamp":1537070444,"content":"If you can't get down to 50 cards that's fine.  50 cards should have been described as the minimum."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3472355","commentId":3472355,"userName":"Rouxxor","timestamp":1537133445,"content":"Another run with another deck, based on Dunehere, the worst of my solo deck: http://ringsdb.com/decklist/view/6030 [http://ringsdb.com/decklist/view/6030]\n\nFirs try I loose on a 10 threat location revelead when they was already a active location. I was unable to get enough willpower to equal the staging area, so I can't travel to it, so I can't have enough willpower so I can't travel... I loose on a very few turns ^^\n\nSecond try I was able to get more willpower, and to block many times with a powerful Fastred (captain of gondor, Golden Shield, arwen boost) to manage my threat and I attack many time with a not that strong Dunhere since I only found one weapon during the first 10 turns. I use carefully my test of will and hasty stroke on very destructive effects and manage to stand even some bad turns where multiple enemies with small threat come out. I do not kill the troll until I get enough willpower to get the stage 2 on one turn. I know there is still 2 necromancer's treachery thad deal one damage to every exhaust character on among 30 cards and if any came when I'm staging out I'm probably unable to recover the lost of those 7 allies. No one is revealed but I fail to do so for one point (I reveal 8 threat :x). I clean again the staging area and have to do it again. I take +6 threat but nothing else horrible. I still have to deal with 6 enemies, and 3 engage me even with my galadhrim greetings. I manage to keep everyone alive and kill two of them. Then I have to block less, don't reveal anything and kill on a few turns the enemies that stay on the staging area.\n\nSo I get already one valor point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3472426","commentId":3472426,"userName":"Rouxxor","timestamp":1537138768,"content":"And then Conflict at Carrock\n\nI experience 4 time a very similar game: I achieve to delay the arrival of the troll until the turn 5 or 6 (the maximum is 7 in the nightmare) with a decent threat (like 26). After that the threat of the staging area explode and I'm unable to egal it with my willpower so I go under 34 in a few turns. I sometime can kill 2 troll in the staging area before that happens but then I have the subsequent problem:\n- I have hard time to defend against 5/6 or even 7 attack. Especially when this happen twice per turn;\n- It is really long to kill 5 defense enemies with Dunhere even if he is perfectly build up.\n\nWith many tries (and many valor point) I would be able to pass it,  I got a little bit unlucky on location. But then I would have to face return to mirkwood who is even harder. I don't want to struggle that hard and I prefer to retry with another deck, and let that poor Dunhere deck on his box. It is not strong enough to face nightmare (in normal mode it would have been way more easier for many reasons)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3473452","commentId":3473452,"userName":"PigsAreOurEquals","timestamp":1537205815,"content":"> On 9/5/2018 at 8:34 PM, dalestephenson said:\n> \n> Next month will be drawn from the Dreamchas﻿er cycle, which I believe is widely available, so unlike﻿ Mirk﻿wood yo﻿u would be able to purchase﻿ them if you wo﻿uld like (you might not want to, of course.) Randomly selected quests will be:\n> \n> Voyage Across Belegaer (from Grey Havens Deluxe) [heroes are Cirdan and Galdor]\n> \n> Flight of the Stormcaller (1st AP in cycle) [hero is Leadership Denethor]\n> \n> Temple of the Decieved (3rd AP in cycle) [hero is Elfhelm]\n> \n> The top three of this league will help determine what November's quests will be, I wanted substantial warning so that potential players can acquire the quests if they want (and they can find them).\n\nCool, I'm lucky enough to have these already. Some months I don't manage to play 3 quests so I think I will start early..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3474733","commentId":3474733,"userName":"dalestephenson","timestamp":1537276914,"content":"Here's how we did against Conflict at the Carrock (cards out of single core + Mirkwood in Parens)\n\n0 Wandalf the Gizzard (9)\n0 Velensk (9)\n0 yepesnopes [nightmare] (28)\n0 Eyeballertbb (30)\n0 Zura (33)\n0 Authraw (35)\n0 dalestephenson (37)\n0 Rahlan (39)\n0 Rouxorr [nightmare] (41)\n0 throughtheages56 (41)\n0 stevew980 (43)\n1 CaffieneAddict (0)\n1 Orcstalker (28)\n3 Lithicbee (39)\n8 Corbetta (0)\n\nFor the most part the trolls went down easily, but both of our minimum purchase contestants failed to make it through.\n\nStandings after Week Two (cards out of single core + Mirkwood in Parens)\n\n0 Velensk (9)\n0 yepesnopes [nightmare] (28)\n0 Eyeballertbb (30)\n0 Zura (33)\n0 dalestephenson (37)\n0 Rouxorr [nightmare] (41)\n0 throughtheages56 (41)\n0 stevew980 (43)\n1 CaffieneAddict (0)\n1 Wandalf the Gizzard (9)\n1 Authraw (35)\n1 Rahlan (39)\n2 Orcstalker (28)\n6 Lithicbee (39)\n8 Corbetta (0)\n\nThe final quest is due Sep 26th at 11pm EDT, which means it's not too late to join up and add your results."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3474800","commentId":3474800,"userName":"Rouxxor","timestamp":1537280058,"content":"> The final quest is due Sep 26th at 11pm EDT, which means it's not too late to join up and add your results.\n\n\n\nIt is a little bit weird, since the results only influence who choose scenario for November why do you have an empty space between the end of Septembre league and the beginning of October league? Of course we can begin october league whenever we want, so does @PigsAreOurEquals [https://community.fantasyflightgames.com/profile/261563-pigsareourequals/] but if we don't this let 26 days instead of a month and I don't see what is the gain.\n\nStill a lot of powerful heroes in this October league. I will again probably play it with several decks ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3474892","commentId":3474892,"userName":"dalestephenson","timestamp":1537286035,"content":"It's mostly for my convenience, so that I'm not trying to close one league and open the next at the same time.  I also wanted to have a fixed time-of-week for reporting results.  With that said, there's really no structural limitation to prevent anyone from playing the quests anytime after September 26th if they want -- or starting the next month's quests early.\n\nI'm trying to decide whether to go with a Noldor deck next month or something with LeDenethor (monosphere Gondor?)   I may flip a coin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3475121","commentId":3475121,"userName":"Rouxxor","timestamp":1537295971,"content":"Ok. Now I understand your choice :). You can do both, I play LeDenethor in my Noldor deck ^^"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3475368","commentId":3475368,"userName":"Rouxxor","timestamp":1537307545,"content":"I give another try with my mono spirit secrecy deck. I like a lot this deck and I hope to make great results with. But I begin with 3 insane game with the 10 threat location and combo with it in the first 3 turns (with a location that I'm forced to travel to, with another of those location). I write down the 3 valor point but I never use it since I want try to win without.\n\nFinally I have a more classic game, with only this location on turn two, but with the ability to travel to it ^^. I etablish a plan that I repeat also for conflict at carrock: stall the game and draw almost my entire deck. and choose precisely who I want to engage. It was two easy win, except the moment where I think I will loose a hero because of the snake, but I don't since I was able to prevent the damage with Frodo ^^.\n\nThen Return to mirkwood. As usually I need to be able to draw many cards to get many threat reduction cards. But it does not happen that good. I get my pipe very late in the game, and they get wiped quite immediately by treachery. So I just play an Elfhelm and finish quite fast the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3475392","commentId":3475392,"userName":"Rouxxor","timestamp":1537308781,"content":"> On 9/3/2018 at 5:22 AM, dalestephenson said:\n> \n> It's OK to make runs with other decks if you just want to try them, and add them to the spreadsheet, but only your first entry will be considered the \"official\" entry.\n\nIf I know that I would have immediately make my \"official\" run instead of having fun with nightmare with a deck that can win the contest anyway since it have too many cards outside the cycle. Next time I will be more prepared ^^.\n\nBecause I just do a perfect: no loose with a deck with only cards (heroes include) from the packs.\n\nIn each game I mulligan because I don't have steward of gondor in hand. And each time I was able to find it within the two first turns, two times thanks to Beravor. I put steward to Eowyn, and I use Theodred ability on himself or Eowyn depending on my need. Beravor have 2 purpose and need his unexpected courage to make both:\n- Defend with fancy equipment (burning brand, defense signal);\n- Draw 2 cards\n\nI usually use henamarth at the end of combat phase, I don't like have it exhausted during the turn (for the necromancer treachery that may kill it, but also because I may miss his 1 attack). When I already have Grimbeorn in play, Bee Pastures in staging area and no enemy I use henamarth ability before the travel phase to choose if I want to shuffle the encounter or not.\n\nI never use Son of Arnor ability, it could have been combo with forest snare but I usually was able to kill the enemies on the turn I engage them so they never stay in staging area. The only enemies who get trapped in a snare where an early Attercop and a hill troll... during conflict at carrock.\n\nI always as plenty of chumpblocker: Snowbourn Scout who can get back for really cheap with Stand and Fight. I only sacrifice one of them but I was happy to have them in case something goes bad.\n\nI'm quite impressed by the efficiency of this 50 cards deck with almost only core set cards. Way more powerful that deck I use to build back on this time ^^. I get many resources, draw many cards and make a total control over the encounter deck quite quickly and them I'm able to low my threat to 0. If I have to do this challenge another try I think I will play only one will of the west and probably play a second Gleowine.\n\nI hope Angmar (5th cycle) will be selected by the winner :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3482587","commentId":3482587,"userName":"dalestephenson","timestamp":1537847865,"content":"I thought Return to Mirkwood would be the bane of every solo deck, between the unfair threat rises, Attercop, and Gollum's Bite.  But I got lucky and others demonstrated their skill.  Here's how we did against the third quest  (cards out of single core + Mirkwood in parense)\n\n0 CaffieneAddict (0)\n0 Orcstalker (28)\n0 Yepesnopes [nightmare] (28)\n0 eyeballertbb (30)\n0 Authraw (35)\n0 dalestephenson (37)\n0 throughtheages56 (41)\n1 GIBraag (0)\n1 Wandalf the Gizzard (9)\n1 Velensk (9)\n1 Rouxxor [nightmare] (41)\n2 stevew980 (43)\n3 Zura (33)\n4 Corbetta (0)\n4 Naverag (14)\n12 Lithicbee (39)\n\nAnd now for the final standings of our first ever solo league:\n\n0 Yepesnopes [nightmare] (28)\n0 eyeballertbb (30)\n0 dalestephenson (37)\n0 throughtheages56 (41)\n1 CaffieneAddict (0)\n1 GIBraag (0)\n1 Authraw (35)\n1 Rouxxor [nightmare] (41)\n2 Wandalf the Gizzard (9)\n2 Orcstalker (28)\n2 stevew980 (43)\n3 Zura (33)\n4 Velensk (9)\n7 Naverag (14)\n12 Corbetta (0)\n18 Lithicbee (39)\n\nFour players managed to complete all three quests without taking tokens.  First place was Yepesnopes, despite being one of two nightmare players.  Yepesnopes gets to choose the cycle for November's league, and his/her deck is here:\n\nhttp://www.ringsdb.com/deck/view/119344 [http://www.ringsdb.com/deck/view/119344]\n\nSecond place was eyeballertbb, who gets to choose a quest to include once the cycle is chosen.  His/her deck is here:\n\nhttp://ringsdb.com/decklist/view/9880/september-solo-league-mirkwood-cycle-1.0 [http://ringsdb.com/decklist/view/9880/september-solo-league-mirkwood-cycle-1.0]\n\nI took third and get to choose a quest to exclude once the first two have spoken.  My deck is here:\n\nhttp://ringsdb.com/decklist/view/9880/september-solo-league-mirkwood-cycle-1.0 [http://ringsdb.com/decklist/view/9880/september-solo-league-mirkwood-cycle-1.0]\n\nYepesnopes used an Elrond/Gandalf/Frodo Vilya deck to cruise to victory, eyeballertb used Leadership Gimli with Eowyn/Theodred from the core, and I used Dunhere with Fastred and Spirit Bard.  Fourth place throughtheages56 used LoDenethor with SpMerry and Folco.\n\nYou're welcome to continue to add additional entries to the spreadsheet if you wish.  Rouxxor has added several runs with different decks, and even ran a core/mirkwood deck (0 outside) against the regular quests for zero tokens.  For my part I'm trying to test how many Valar tokens you need for a wholly unsuitable deck -- using my stereotypical Eagles deck (mono-tactics Thalin/Gimli/Legolas drawn through Khazad-Dum) I took 21 tokens to beat Journey down the Anduin and 20 tokens to defeat Conflict at the Carrock -- I haven't done Return to Mirkwood yet but I suspect it will be higher.\n\nThanks for playing, and I'm looking forward to next month's league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3482763","commentId":3482763,"userName":"CaffeineAddict","timestamp":1537867211,"content":"Annoyed with Carrock for that 1 Valar token....\n\nThat was good fun. Need to find some time to do next month's challenge, as almost all of my weekends are booked up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483365","commentId":3483365,"userName":"dalestephenson","timestamp":1537900752,"content":"Now is the time to discuss any suggestions for altering the league mechanics/scoring/tiebreakers.  There's already been some discussion in the parallel BGG thread:\n\nhttps://www.boardgamegeek.com/thread/2052446/september-solo-league-mirkwood-cycle [https://www.boardgamegeek.com/thread/2052446/september-solo-league-mirkwood-cycle]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483426","commentId":3483426,"userName":"CaffeineAddict","timestamp":1537902793,"content":"Personally, I'd like to see using the cards from the cycle/deluxe/core count more towards the score, rather than just a tiebreak, as that makes deck building a more important aspect than just using a normal power deck against the quests.\n\nEdited September 25, 2018 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483442","commentId":3483442,"userName":"Rouxxor","timestamp":1537903264,"content":"> 5 minutes ago, CaffeineAddict said:\n> \n> Personally, I'd like to see using the cards from the cycle/deluxe/core count more towards the score, rather than just a tiebreak, as that makes deck building a more important aspect than just using a normal power deck against the quests.\n\nSince there is multiple 0 score you can't make a score that matter (that get you a spot in the top3) even with a power deck.\n\nHere is what I post on BGG:\n\n> Quote\n> \n> Congratulations! This first league was pretty, with a decent number of participant. Great job!\n> \n> I agree with you about the \"fun\" aspect of the league required. Don't put heavy restriction (like winning 3 times the same quest) or very few peoples will participate.\n> \n> It is even more important since, right now, the point system is not good enough. We don't really care since it is for fun. But it will be really complicated to make a competitive league out of it anyway.\n> \n> Actually the only way to win the contest is to:\n> - Make a score of 0 (if you don't there is no point to even finish your run);\n> - Register a deck with few (should be none if at least 5 people are looking for the win) cards oustide the cycle and the pack.\n> \n> And the optimal strategy is, in fact, to wait until the end of the contest to make your run, and to perform it with a deck slightly better (for tiebreaker matter) that the previous 0 points champion. If everybody was doing so it would be very problematic. Hopefully players don't do this league for the win ;).\n> \n> If we must discuss about a more fair system I advice you to allow multiple registration. Sure player can use time to get better results. I don't see that problematic. I see the pros: player will be even more involved in the contest, trying to beat each other. A nice competition.\n> \n> If you want to force people to accept a defeat instead of retry over and over until they got a perfect score you can add a rule \"only one try per deck (can't play the same hero twice, can't have the same number of cards oustide of the packs for example).\n> \n> But this is not that important. We want to play the october league as soon as possible :p.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483445","commentId":3483445,"userName":"dalestephenson","timestamp":1537903396,"content":"My fear is that making card/hero restrictions part of the score instead of a tiebreaker will drive it to be a minimum purchase league instead of a play-what-you-want league.  That's not *necessarily* a bad thing, but it's a different thing.  After a few days of comments, I'll put up polls here and at BGG to see what players want to see in the league, so don't give up hope.\n\nRouxxor beat all three quests without tokens (non-nightmare) with a true minimum purchase deck -- only single core + CatC + RtM.  That's impressive, but I don't want to force players to construct such decks in order to have a chance at winning the league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483551","commentId":3483551,"userName":"Rouxxor","timestamp":1537909452,"content":"> 1 hour ago, dalestephenson said:\n> \n> Rouxxor beat all three quests without tokens (non-nightmare) with a true minimum purchase deck -- only single core + CatC + RtM.  That's impressive, but I don't want to force players to construct such decks in order to have a chance at winning the league.\n\nRegarding to the 0 valor points score of many players on this league I think that playing with few cards (possibly minimal purchase) will be required to win the league anyway. But I agree that letting it on a tiebreaker allow players to make a low score, and to consider it at an achievement. And it is great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3483858","commentId":3483858,"userName":"Authraw","timestamp":1537934759,"content":"Here's a thought to facilitate interesting deckbuilding:\n\nRather than making the \"non-penalized pool\" of cards Core + Current Cycle, make it come from Current Cycle + any 12 cards. (The exact number is flexible, of course). In other words, you could still get a perfect score if you use up to 12 cards from outside the cycle, and the deckbuilding intrigue comes from the question \"What 12 cards should I use?\"\n\nThis system would also prevent people from bringing minor variations on the same Core Set decks each time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484024","commentId":3484024,"userName":"Rouxxor","timestamp":1537950926,"content":"I haven't think about it before but actually I'm not sure the core set will be included in the card allowed each time. The core set was, this time, part of the cards of the cycle since journey though Anduin was selected. Next time it is suppose to be only grey have + 2 packs.\nWithout the core set it will be almost impossible to make a deck with only the card selected. No need to add 12 cards rules. This is just about getting the closet possible to 0, while 0 is probably impossible to reach (but may be it is, I haven't started to look after the pool).\n\nBut if going for minimum purchase (so, allowing the core set) the september deck I use (the well famous TED) could be played with minor variation and work as well. Almost every month. It is less interesting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484121","commentId":3484121,"userName":"dalestephenson","timestamp":1537963346,"content":"I'm inclined to include core as not counting against but I'll put up a vote for that too.  I can see that you could play the same deck with minor variations each month to get a 0 \"outside\" count -- you could take Xanalor's famous \"Back to Basics\" deck, swap out one hero (probably Theodred for LeDenethor) and fill it out to 50 with the best cards from the current cycle.  It'd work fine.\n\nHowever, I don't see a *fairness* issue with someone doing that.  It's solid, but it's not overpowering, and I question whether it would be more likely to finish with 0 tokens than a Cirdan/Galdor/LeDenethor Noldor deck that supplements Noldor cards with core staples -- and it'd lose the hero tiebreak to the Noldor deck (core heroes do *not* count for tiebreak outside Mirkwood).  So it's not the optimal deck, and not overpowered.\n\nIt would also be less interesting to me, and most players, I think.  Even if I *could* run the same style of deck each month, why would I?  I think a lot of the fun is trying out different decks, and I've got a ton of decks I haven't played with and a ton of different ideas I haven't built.  Even if I'm going for a 0 outside build there's multiple different viable decks I could try, and since I just finished third with 37 outside cards I don't think I will go for a 0 outside build.  So even if I could, I wouldn't.  If there's some player who *enjoys* repeatedly playing the same tried and true deck against all quests with minor variations, let him have his fun -- it won't ruin mine.  I just want to make sure that he doesn't have an insurmountable *competitive* advantage from playing that way.\n\nIf we take for granted that multiple players will construct 0-outside-card decks for competitive reasons, counting core cards will *allow* the same decks month to month, but excluding core cards will *force* the same kind of decks to be used within a month.  Without supplementing with core cards, I don't think you could really do anything except Noldor with GH/Dreamchaser alone.  (Now watch someone prove me wrong....)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484413","commentId":3484413,"userName":"Rouxxor","timestamp":1537977444,"content":"I think that the rules should pushed toward a fun challenge. If your rules push the same deck to be able to win each time let face it: I will play it every time, and then play another decks. If the challenge wasn't something I look for I wouldn't participate to the league at all ;).\n\nYou speak about two decks, focusing about heroes. But I don't think Eowyn/Theodred/Beravor or Cirdan/Galdor/Denethor will be that different. The same three spheres, the same cards will be probably played (with minor exception like narya). As I want to get the perfect tiebreaker I will probably go with the second line-up and do approximately the same things.\n\nBuilding without the core set, on another hand, is pretty harsh. I don't think I could manage to build a 0 cards oustide the packs anymore. Here is an example of what it could drive to http://ringsdb.com/deck/view/122576). [http://ringsdb.com/deck/view/122576]\n\nSo it will create more choice about getting on with this kind of decklist or include some cards (steward, test of will and elven-light, lord of the eldar are the one who come first in my mind) to give a good boost to the decks. Or you can just restrict to the card of the cycle so you have less choice but win by the first tiebreaker. It it more interesting this way I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484489","commentId":3484489,"userName":"CaffeineAddict","timestamp":1537980558,"content":"What about something like (just picking numbers as an example):\n\nYour score is Valar tokens plus...\n\n0..20 cards outside cycle+deluxe: 0\n20..40 cards outside cycle+deluxe: 1\n40+ cards outside cycle+deluxe: 2\n\nAnd then exact numbers of heroes/cards outside cycle+deluxe as tiebreakers?\n\nEdited September 26, 2018 by CaffeineAddict"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484575","commentId":3484575,"userName":"dalestephenson","timestamp":1537984041,"content":"That deck is pretty grim Rouxxor, it's sad to see Rod of the Steward without Steward of Gondor.  However, I notice that's it a minimum purchase (minus core) deck.  Cards from other Dreamchaser APs don't count against you (with the possible exception of heroes in the third tiebreaker).  If you throw in the other four APs, can you make a solid deck?\n\nOne of the polls will be whether we should count core cards as \"outside\" or not.  One reason I'm inclined to count core as inside is that I think it helps the players who just don't have a full card pool.  If a limited player has to resort to Daughter of Nimrodel for their healing needs because they don't have Warden of Healing, it seems unfair to count them the same -- though since this cycle has Ioreth in it, maybe that's a moot point.  Maybe count core cards as half an outside?\n\nI don't like elevating outside cards into the token count.  If the winner is a zero token player (true this month, and IMO likely true next month) that means that a player using significant numbers of outside cards would be eliminated before they played, and I don't like that.  I suspect the tiebreaker by itself is sufficient to incent driving the outside count down, at least for players who are focused on winning the league so they can make us play Angmar!\n\nAn idea I brought up on BGG for reward the best \"extra\" runs is to give the top finishers there the ability to blacklist out-of-cycle cards for the upcoming -- three for first place, two for second, three for third -- and this *can* include core cards for non-Mirkwood.  So if applied to September's league and Ringmaker was chosen, Rouxxor could chose to blacklist Vilya, Beravor, and Brok Ironfist.  I think this could alter the deckbuilding sufficiently to be interesting without being so restrictive that it would force the same decks to be run."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484582","commentId":3484582,"userName":"CaffeineAddict","timestamp":1537984336,"content":"> 2 minutes ago, dalestephenson said:\n> \n> I don't like elevating outside cards into the token count.  If the winner is a zero token player (true this month, and IMO likely true next month) that means that a player using significant numbers of outside cards would be eliminated before they played, and I don't like that. \n\nConsidering that a deck using cycle cards only is likely to require more valar tokens to win than one using a larger card pool, then doing something like that would be more like levelling different approaches to an even chance of winning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484642","commentId":3484642,"userName":"dalestephenson","timestamp":1537986063,"content":"Yes, that's certainly the tradeoff -- the outside cards increase the chance of a clean run, but work against you if others had a clean run.  In this month's league, there were three players (Rouxxor, yourself, and GilBragg) who used the Theodred/Beravor/SpEowyn lineup with 0 outside cards, and the token count was 0, 1, and 1 -- if Rouxxor had used his minimum purchase first instead of chivalrously taking down nightmare quests, he would've won the league.  Meanwhile the Dunhere decks had 0, 4, 18, and surrender [nightmare].  I'm not convinced the outside cards are enough of an advantage to justify a full token, though there's not enough data to reach firm conclusions yet.\n\nLooking at only the official runs, here were the token counts grouped by number used (asterisk indicates nightmare run):\n\n0: 1, 1, 12\n\n1-10: 2, 4\n\n11-20: 7\n\n21-30: 0*, 0, 2\n\n31-40: 0, 1, 3, 18\n\n41+:  0, 1*, 2\n\nMy first impression is that it is more scatter plot than trend.  I also note that a clear majority of players preferred to play 21+ in this league, though I think next league there may be more in the lower counts -- the league was won on tiebreak, after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3484703","commentId":3484703,"userName":"Rouxxor","timestamp":1537988782,"content":"Many smart things get my attention:\n- Card contained in one core set only are counted as half for the tiebreaker;\n- Having a success for banning (I prefer to say they count for 10 for the tiebreaker matter, so it only ban them from the competitive play ^^)\n- OMG I was allowed to play any cards inside the mirkwood cycle? I only use cards from core set and the 2 adventure packs :p. Elven-light is on the cycle :D. I'm still hesitating at playing 0 cards outside the cycle or just playing 2 steward of gondor..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3485065","commentId":3485065,"userName":"dalestephenson","timestamp":1538003449,"content":"Yepesnopes has decided to choose Heirs of Numenor/Against the Shadow for the November league.  Now Eyeballertbb gets to choose a quest from that cycle to include."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3485100","commentId":3485100,"userName":"Rouxxor","timestamp":1538005339,"content":"Anyway cycle 5 will eventually come ^^. And I hope this will be before cycle 2, and before doing twice the same cycle (we can play until 3 times a cycle with alway new scenario each time ^^)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3486245","commentId":3486245,"userName":"dalestephenson","timestamp":1538085840,"content":"I know I promised to put the poll in both forums, but it took long enough to make that I'd rather everyone just pop over to BGG and vote.  It's OK to vote if you didn't play in the league, as long as you think you may be interested in future leagues.\n\nhttps://www.boardgamegeek.com/article/30100599#30100599 [https://www.boardgamegeek.com/article/30100599#30100599]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3493511","commentId":3493511,"userName":"dalestephenson","timestamp":1538742935,"content":"Second place winner eyeballertb narrowed the choice of quests for November to Into Ithilien and The Druadan Forest.  I randomly selected between those two to make Into Ithilien the chosen quest.  I then excluded Morgul Vale (I hate that) for my pick.  Randomly selecting the other two quests gave The Steward's Fear and The Druadan Forest.  So the quests for November are:\n\nInto Ithilien (Heirs of Numenor Deluxe)\n\nThe Steward's Fear (AP 1)\n\nThe Druadan's Forest (AP2)\n\nDecks must have at least one of the following heroes:  TaBeregond, LeBoromir, Hirluin the Fair, and Mirlonde."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3494251","commentId":3494251,"userName":"Network57","timestamp":1538795464,"content":"> 14 hours ago, dalestephenson said:\n> \n> Second place winner eyeballertb narrowed the choice of quests for November to Into Ithilien and The Druadan Forest.  I randomly selected between those two to make Into Ithilien the chosen quest.  I then excluded Morgul Vale (I hate that) for my pick.  Randomly selecting the other two quests gave The Steward's Fear and The Druadan Forest.  So the quests for November are:\n> \n> Into Ithilien (Heirs of Numenor Deluxe)\n> \n> The Steward's Fear (AP 1)\n> \n> The Druadan's Forest (AP2)\n> \n> Decks must have at least one of the following heroes:  TaBeregond, LeBoromir, Hirluin the Fair, and Mirlonde.\n\nI'm currently running a Grace of the Valar through this entire cycle with a LeBoromir deck. Can I just use those results for the league?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281893-september-solo-league-mirkwood-cycle/?do=findComment&comment=3494362","commentId":3494362,"userName":"dalestephenson","timestamp":1538814289,"content":"I think you should wait for November and do a fresh run.  But the experience should help you play well."}]}