{"url":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/","title":"What card game would help get kids ready to learn LotR LCG?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3458538","commentId":3458538,"userName":"tripecac","timestamp":1535932483,"content":"LotR LCG is probably the hardest game I have, in terms of being able to win without making rule mistakes.  It's also by far the most time-consuming in terms of reading rules, FAQs, errata, forums, deck building, etc.\n\nI tried to play it with my kids (7 and 9) once but that was a dud; they got tired of listening to the rules, so I ended up making all the decisions, and they ended up getting bored.  Since then, neither of them has expressed any interest in playing it again.  My bad. \n\nFortunately, they still have lots of interest in other board games, some of which have cards (7 Wonders, Sushi Go, Stuffed Fables).  But no real \"card-games\".\n\nSo, I am wondering: what would be a good card game which helps prepare kids to learn LotR LCG? \n\nIdeally, it would be a low-weight, cooperative deck builder without much emphasis on collection. \n\nDoes anything like that exist?\n\n \n\nOr would a better approach be to wait until the digital version of LotR LCG goes free-to-play and see if that \"clicks\" with them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3458579","commentId":3458579,"userName":"Onidsen","timestamp":1535935867,"content":"Star Realms might be simple enough - it's not cooperative, but it's got a lot of the same type of interacting card effects but without the complexity"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3459102","commentId":3459102,"userName":"Hannibal_pjv","timestamp":1536005725,"content":"Dominion?\n\nany easy coop or card game is good. So a card game where cards have powers!\n\nmaybe try first Lord of the Rings love letters. It is easy and it is fast. But it still have card powers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3459148","commentId":3459148,"userName":"tripecac","timestamp":1536009864,"content":"Is Dominion significantly easier than LotR LCG?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3459460","commentId":3459460,"userName":"Flrbb","timestamp":1536050491,"content":"Honestly, I think 7 is way to young to be capable/having fun with such a complex game. Probably 9, too.\n\nAnyhow.\n\nThis game has two major aspects. Deck building and the game itself. Any collectable card game, which aims for kids, like Pokémon, would teach that aspect. (e.g. having more than a minimum of required cards reduces the probability of getting that card into hands and so on) But I think the other aspect is more of importance. Personally, I do not know any similar game which could teach LotR LCG. Maybe you could write down the round sequence for them, in front of their eyes and simplified, of course. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Build them mono sphere and easy decks (e.g. no Noldor or Gandalf). That could help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3459609","commentId":3459609,"userName":"Wandalf the Gizzard","timestamp":1536065778,"content":"I had success teaching LotR to a twelve-year-old. After about our fifth game, it clicked for him. He can make sound strategical decisions in-game, but still needs a little help deck-building. If you found a small card game to whet her appetite first, I think there's a chance your nine year old could catch on after a few months. Try Pandemic (it's really a board game, but card-driven)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3459724","commentId":3459724,"userName":"Zura","timestamp":1536071003,"content":"I second pokemon, should be more enjoyable for kids. Wait 2-3 years to come back for lotr."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460177","commentId":3460177,"userName":"ColinEdwards","timestamp":1536091991,"content":"I play LotR with my son, started at his 7th birthday. I think it works fine.\n\nSome advice:\n\n- play the missions solo first, so you know what to expect\n- start with story telling: what is happening, who the heroes are\n- make the decks and don't be afraid to stack the deck - journey down the anduin: just start with a forest snare and feint in their hand; hummerhorns? start them with Gimli and Citadel plate\n- start with an idea of how they are going to be the hero: set them up with extra resources, extra items, reduced threat ... whatever it takes.\n- a bad draw?  just shuffle, reset and go again. So Smaug attacked six times and killed all your heroes in a single round: \"now let's see what -really- happened\"\n- change the annoying rules: doing riddles too annoying... how about \"guess the flavor of the jelly bean\" riddles?\n\n \n\nSome other good (co-operative) games we enjoy:\n- Forbidden Island / Desert\n- Guardians of the Multiverse\n- Aeon's End\n- Pathfinder Adventure Card Game\n\n(Arkham Horror LCG is NOT a good choice! It's a great game, but for older children.)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460205","commentId":3460205,"userName":"Flrbb","timestamp":1536093415,"content":"Why not Arkham LCg? I thought about it, because the storytelling is a bit better and with the locations also more \"visible\", this easier to get. Is it too frightening for that age?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460240","commentId":3460240,"userName":"ColinEdwards","timestamp":1536095114,"content":"I think it is too random, more focus on surviving than total success. I think the golden rule of games with (younger) kids is that while you want to make it a challenge, you also want to structure it that if you play OK, don't make any major misplays, you are going to win.. and more than that - you are going to win by doing something cool, and be the hero. They pass the level, get a couple new cards, move on to the next challenge. \n\nI really enjoy Arkham too, but I think it's at it's best when it's ratcheting the tension up.... someone's about to go insane, someone's desperately evading a monster and you are trying to balance going for 2 more exp or resigning, and you have to reach into the token bag and think: if's it's a tentacles, we are all dead. not good for introducing kids to games: they need a progression of 'wins' first."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460448","commentId":3460448,"userName":"tripecac","timestamp":1536110856,"content":"They both know Forbidden Island/Desert, and can play those pretty well. Pandemic is a bit too hard for them, though.  Of course, for a long time it was too hard for me too, but then I got the Android app and played the heck out of it until I'd learned enough to be able to win more than half the time.  (Still playing the easy mode for that, though).\n\nWe also tried Stuffed Fables, but we didn't do well, mostly because we didn't figure out how to optimise our use of the dice, or how to best use each character.  I probably should have played through a scenario or two of that by myself first, so that I could teach them some core \"best practices\" instead of trying to learn at the same time as them.\n\nI know LotR LCG better than any of those other coop games, but that's not saying much...  I can win the Mirkwood quests more than half the time, but my victories usually seem very close. \n\nTo be honest, I find LotR LCG a bit stressful to play (does anyone else have that feeling?).  Of course, it feels very rewarding when I win, but I'm worried that by playing with 2 young newbies, our chances of winning will be VERY LOW, so we will end up feeling the stress without the reward.\n\nIt's that stressful feeling that I'm trying to avoid.  (Escape the Curse of the Temple stressed them out so much that they refuse to play it).\n\nSo, I'm hoping to teach them to think strategically in games similar to LotR LCG so that the learning curve (and stress-to-reward ratio) isn't quite so massive!\n\nNerfing via house rules is an interesting idea, but house ruling just doesn't click with my personality type.  I feel most comfortable when following \"official\" rules and guidelines.  Easy Mode is okay, but it doesn't really make the game THAT easy. \n\nOf course, if FFG created a \"My Little LotR LCG\" (similar to My Little Scythe), I'd buy that in an instant, since it would be an official \"kid's mode\" or \"lite\" version of LotR LCG, but until that happens, I think I'm going to look at other games as stepping stones...\n\nArkham Horror LCG sounds cool, but since it's an ongoing campaign, I'm guessing there is a feeling of things being \"at stake\", which means stress.\n\nMagic the Gathering is easy[ish] to teach but I got tired of it.  And it's expensive to collect.  And I've got that collector impulse.  So... no.\n\nPokemon...  I took a look at the cards and they look very childish, in a not-so-cool way.  I don't think I could stomach playing with the girls.\n\nDominion looks like a good game, but I'm concerned that it's almost as hard at LotR LCG.\n\nSentinels of the Multiverse looks better than Pokemon.  And I have the Steam app (which I have not tried yet), so maybe that's a good game for me to learn first, and then teach them.\n\n \n\nAnd then of course there is the digital version of LotR LCG.  I've only been able to play that a few times, but I enjoyed it.  It's not at stressful as the tabletop version, for some reason.  I wish I could figure out why!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460457","commentId":3460457,"userName":"Wandalf the Gizzard","timestamp":1536111793,"content":"> 5 hours ago, Flrbb said:\n> \n> Why not Arkham LCg? I thought about it, because the storytelling is a bit better and with the locations also more \"visible\", this easier to get. Is it too frightening for that age?\n\nUmm . . . some of that stuff is firmly in the R category. Not just for the graphics, even the concept of going insane like that from Great Old Ones. Not stuff to be playing around with with your seven year old."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460625","commentId":3460625,"userName":"ColinEdwards","timestamp":1536131665,"content":"There are a lot of ways to tweak the difficulty without impacting play much: start with extra resources, reduce starting threat, etc. Some things we often do:\n\n1 - I like to add in objective-allies, for example playing the 3 starter missions with 'Brok', and have him be the one captured in EfDG. (Radagast features heavily in our games too.)\n\n2 - Allow multiple active locations. If you travel to the same location you can treat it as if everyone had ranged/sentinel, if you are apart, all cards are peril. (I like Hills of EM, with some nightmare worms added this way... )\n\n3 - Introduce some 'side-quests' or a quest stage 0. For example, do the first round at 'Radagast's House', which gives you a chance to explain the quest (in character) and \"explain' some bonuses: what boon would you like: extra resource, draw a card, or reduce threat by 3?\n\nI know there are people that are going to say: starting Hills of EM at Radagast's House, adding in an objective ally Radagast, throwing in the nightmare cards, house ruling the travel rules: are you even playing the same game? It's a chance to sit down and tell a story to the kids, and the real test of success is if they want to play the same scenario again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460656","commentId":3460656,"userName":"ColinEdwards","timestamp":1536135125,"content":"What we did (my son was playing combat and eagles were not that well developed, so I made some changes.):\n\nI made some extra cards up:\n\nRadagast staff: exhaust the staff and discard a card to bring an eagle from your discard pile to your hand;\n\nRadagast's ring: when an eagle ally leaves play, exhaust add a resource to Radagast. Combat action: exhaust the ring to play an eagle from your hand. Only resources on Rad can pay.) \n\n'Exhaust Radagast to shuffle a set-aside athelas into the deck' ( attachment, guarded / location only, discard to heal 3 damage and remove a condition.)\n\nLure of Nature: set aside Radagast's attachments and shuffle him onto the encounter deck. Give him back his stuff when he comes back.\n\nI am not saying those cards are perfect, but it did provide some continuity... The big bad guy drops some loot that you carry forward, and more importantly having a 'narrator' makes it more structured RP-lite, than high stress, which I find engages kids a lot more.\n\nEdited September 5, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460683","commentId":3460683,"userName":"Hannibal_pjv","timestamp":1536139413,"content":"The biggest problem is what card do and how They interact... \n\nand that requires a very Little text when playing with younger audience. And Many Lotr cards Are complicated and timing when use what card is also.\n\nso a game with very limited card pool and very Little amounth of text is good place to start."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3460901","commentId":3460901,"userName":"Zura","timestamp":1536158062,"content":"If pokemon is not your thing (which is a shame, the game ise x c e l l e n t  for younger players, easy, fun, rewarding, cheap, there is digital version with ai helping you out), maybe try munchkin. They won't understand the humour but the game is easy and has cooperative elements, you can play the whole game not intererrupting each other's turns and just helping each other out"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3464753","commentId":3464753,"userName":"icabod","timestamp":1536523167,"content":"I've considered buying \"Teen Titans Go! Deck-Building Game\" to try and get my kids interested in playing things like this.  My Son (9 yrs old) likes Pokemon, but more for collecting cards than playing.  He likes TTG (cartoon and comics), and the game looks to have the same sense of humour.\n\nIt's not cooperative, but it's something they may enjoy.  And if you can \"accidentally\" lose once in a while they'll enjoy it even more.\n\nAnd I agree that Arkham probably isn't a good one to start your kids on.  I don't have it, but have looked into it - I have Mansions of Madness, and some of the imagery that the text conjures up... not great for my kids.  Of course, it all depends on what the child is used to.  My kids?  Not big fans of losing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3464776","commentId":3464776,"userName":"tripecac","timestamp":1536525672,"content":"I researched Pokemon some more since my past post.  So many cards, so many iterations.  It's all a bit overwhelming.  And plus, it uses that whole CCG rarity-gambling model I don't really like, and don't feel like supporting.  (This is one of the reasons I stopped collecting Middle Earth CCG).  So, I think we'll avoid Pokemon for now.\n\nI used to hear a lot about Munchkin a couple years ago, but then... silence.  It doesn't seem to be very well respected among \"serious\" board gamers and that's where most of my input seems to be these days.  I'd only be playing with the kids, so the over-the-head jokes would probably diminish the overall enjoyment.\n\nTTG - I don't know anything about that franchise.  Maybe my kids do?  I will talk to them.\n\nWe restarted Stuffed Fables last night.  It went pretty well.  I think part of the problem was not knowing what we were doing the first time.  Now, we have one of the kids' characters set up as a \"tank\" with the rest of us supporting it while attacking the enemies from a distance.  Seems to work pretty well, so far.  I think this at least helps getting the girls (well, mostly me) thinking tactically.  And there are cards there, but it's not really a deck building game.  More like a light RPG.  Still, I think if we can play more of these sort of tactical fighting games, that might help inch them closer to being able to handle LotR LCG.  Hopefully!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3466365","commentId":3466365,"userName":"Hannibal_pjv","timestamp":1536686185,"content":"One more option. Blood bowl team manager card game... very few cards and quite easy if one player knows rules.\n\nEdited September 16, 2018 by Hannibal_pjv"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3466374","commentId":3466374,"userName":"sappidus","timestamp":1536687120,"content":"I intro'ed my nephew to these sorts of card games through the defunct CCG Kaijudo, which is plenty simple in its basic form. And it had the quiet advantage of not encouraging him to chase the CCG rush because hey, dead game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3466434","commentId":3466434,"userName":"icabod","timestamp":1536691032,"content":"One game had just occurred to me that may work - Harry Potter: Hogwarts Battle. Co-operative deck-building, and I've just listened to a \"review\" on Boards Alive podcast that suggests it's not a difficult game to beat (at the start). Comes across as deck-building-lite. And it's a theme that many kids may enjoy.\n\nBoardGameGeek community suggests an 8+ age range."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3466527","commentId":3466527,"userName":"tripecac","timestamp":1536696497,"content":"Harry Potter Hogwarts Battle - What a perfect suggestion... thanks!!! \n\nThe girls are currently reading that series (one is on book 5 and the other on book 2), and they love it.  The card game's difficulty seems a lot less than LotR LCG, and I love the fact that there is only one expansion, so the cost to collect is very small (compared to Lotr LCG).  And it's co-op, which means we don't need to worry (too much) about imbalance. \n\nYay! \n\nI ordered it (and the expansion).  :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]:) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 11, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3510513","commentId":3510513,"userName":"icabod","timestamp":1540159367,"content":"> On 9/11/2018 at 9:08 PM, tripecac said:\n> \n> Harry Potter Hogwarts Battle - What a perfect suggestion\n\nSo, it's been a little while - can I ask how Harry Potter went?  I've looked at it a few times as a way into more complex games for my kids, just wondering how your family got on with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3511139","commentId":3511139,"userName":"tripecac","timestamp":1540224228,"content":"We played the first Harry Potter scenario.  The girls really enjoyed it.  Since it's been a while since we've played, we'll probably replay the first scenario before continuing to the second.\n\nI thought it was okay.  It was hard to get into it, story-wise, because I was teaching, playing, and acting as the \"bank\".  Hopefully our  second session will result in more immersion!\n\nEdited October 22, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3521066","commentId":3521066,"userName":"BigKahuna","timestamp":1541078638,"content":"7 and 9 is kind of a tender age, I think it's best to go for getting them excited about games in general and I would suggest games without a big reading requirement and one they can play on their own between the two of them and of course in a group as a family.\n\nI'm not sure how these would lead into Lord of the Rings LCG, it's a fairly complex game as you said so I think you just have to let them grow up a bit before you try again, though I think getting them familiar with the Books and Movies is one way to get them interested in the game (after all, why play Lord of the Rings LCG, if you don't recognize any of the heroes).\n\nFor my daughter who was about 7 when I started with her, she got into the swing of things quick, she really loved gaming right out of the gate and her collection is a match for mine.  With her I went with the following.\n\nFor Sales - Very simple card game, fast, easy to understand rules and plays just fine with 2, 3, 4 or even 5 players.\n\nKingdomes - This is a tile laying game, I picked it because it requires some math and quite a bit of strategy but it has a very constructed, basic rules that you can explain quickly and its very short.\n\nCamelUp - This I went for because I wanted to teach her that even in games of luck, you can win a lot if you apply strategy.  It took her a very long time to beat me and that turned out to be a good thing because she really tried hard to figure it out.\n\n7 Wonder Duel - This was the first of the more complex games I introduced to her.  By the time I did she was basically a gamer already but this game had a lot of depth, strategy and required a lot of logic.  Still no reading but we were getting closer.\n\nStone Age & Ticket to Ride - This was just an ongoing effort to include more complex games.\n\nCoupe & Albion: The Resistance : By the time we got to these two she was buying and learning games on her own.  She had turned ten and these two have turned out to be her to favorites.\n\nWe also play Lost Cities, Patchwork, King of Tokyo, Sheriff of Notingham.  The list is growing.  I'm now trying to get her interested in Lord of the Rings books and movies.  My hope is that once she becomes familiar with the story, I will be able to introduce Lord of the Rings to her.  Its my hope that by the time she is 12, we'll be rocking!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3521310","commentId":3521310,"userName":"tripecac","timestamp":1541090942,"content":"Hi, thanks for the recommendation!\n\nWe've got For Sale - my daughter (8) played it with the neighbour girl yesterday and they seemed to enjoy it.  Not such how much the neighbour girl understood it, though!\n\nTicket to Ride is my 8yo's favourite game!  In the Ticket to Ride boxes I kept seeing fliers for Memoir '44 (also published by Days of Wonder), and eventually I researched that and ended up getting it!  So now Memoir '44 is a frequent game to play with the kids.  They're not too much into the WW2 theme, though... I think I need to show them more WW2 movies!  (So far they've only seen Saving Private Ryan).\n\nKingDominoes - We got this too.  It was really easy to learn, and we've progressed to the Giants expansion.  Is that the one you're talking about?\n\n7 Wonders Duel - We bought this, but haven't tried it.  7 Wonders is one of the few games the whole family likes to play, so we haven't yet felt the need for a 2 player version.\n\nKing of Tokyo - Bought but not tried.  I also got the Power Up expansion.  Some day we'll get around to trying them out!\n\n \n\nAs for LotR LCG, I've sort of given up playing it with the kids, at least for the next few years.  It's just too hard for them.  Too much reading and learning.  I think they like games where they don't have to read.  And, to be honest, so do I.  There's something really primally satisfying about moving plastic soldiers around on a hex board!\n\nThat said, I've been enjoying the digital version of Lotr LCG.  I've only finished the first couple missions, though.  But I like the music, voice overs, and the fact that the computer remembers most of the rules for me.  Too bad it's no longer going to be Free to Play, because I was looking forward to getting the girls into it.  Still, it's fun for me... although it's now competing in time with the new Witcher/Gwent game (Thronebreaker).\n\nSo many games, so little time!!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281968-what-card-game-would-help-get-kids-ready-to-learn-lotr-lcg/?do=findComment&comment=3521464","commentId":3521464,"userName":"HirumaShigure","timestamp":1541098416,"content":"My boys (7 & 9) love the D&D adventure board games. We've played the Legend of Drizzt all the way through. They love it cause there's figures, dice rolling, cards, and map tiles that you use to build the map. It's cooperative so we don't have to worry about \"sore losers\". Pretty fast, simplistic, and still of the fantasy genre. The encounter cards can be a little viscous, but sometimes I'll fudge those if they prove too fatal. I'm holding off on getting them into LOTR LCG, but I'm sure they'll be able to hang someday."}]}