{"url":"https://community.fantasyflightgames.com/topic/281916-battle-of-lake-town-and-card-pool/","title":"Battle of Lake-town and card pool","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/281916-battle-of-lake-town-and-card-pool/?do=findComment&comment=3457618","commentId":3457618,"userName":"Thaeggan","timestamp":1535814562,"content":"My 4 person group is having some problems trying to beat Battle of Lake-town and we got into a debate as to when to play the scenario, how the card pool is to increase, and whether our decks suck. I hope I can describe how we have been progressing, our current card pool, and how I was planning on increasing it.\n\nI started my group with the Hobbit and planned on playing the game chronologically through the main story, including the Hunt for Gollum with a detour for Dwarrowdelf when we get to Moria where Gandalf reads the book about the history of retaking Moria before fighting the Balrog. I also planned on \"unlocking\" cards when moving to each scenario. So, if we got to Khazadum, the cards coming out of the deluxe box would immediately be available, but the cards from the cycle would only be unlocked when getting to each scenario.\n\nNow, we have struggled with the Battle of Lake-town because our single color decks don't have much to write home about or basically countered by the encounter deck. In example, the Dunadain being unable to put progress on location cards in a location heavy encounter deck because of Esgaroth Warf [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-battle-of-lake-town/esgaroth-wharf-tbolt] or using Thror's key [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/the-hobbit/on-the-doorstep/thrors-key-otd] and Strength of Will [http://www.cardgamedb.com/index.php/lotr/lord-of-the-rings-card-spoiler/_/core/strength-of-will-core] because there are freak'n 4 of those locations! Our last game we got very close, but because Smaug kept killing our allies we ultimately could not keep up against the Burn and kill him as it seemed like a single or two turn window for our Red Deck player who can almost 2 turn kill Smaug.\n\nThe 4 of us are running single color decks initially to learn the game, but now it seems to be hindering yet we do not have much of a pool to really build from. Granted we haven't put too much thought of breaking all of our current decks down to strategize 4 mixed decks concurrently just yet.\n\n \n\nSo, here are the questions.\n\n1. Do we need to play the Lotr LCG in released chronological order to be more successful? We were wondering if the Battle of Lake-town was made with prior expansion card pools in mind.\n\n2. Is 4 players making it harder to beat the Battle of Lake-town?\n\n3. Should we consider mixing our 4 decks or stick with the strength running a single color deck?\n\n4. Am I crazy to want to unlock cards in how I described above or is it highly recommended all the cards from a cycle be available when opening a deluxe box?\n\nEdited September 1, 2018 by Thaeggan\ngrammar"},{"commentUrl":"https://community.fantasyflightgames.com/topic/281916-battle-of-lake-town-and-card-pool/?do=findComment&comment=3457689","commentId":3457689,"userName":"Wandalf the Gizzard","timestamp":1535824294,"content":"> 2 hours ago, Thaeggan said:\n> \n> 1. Do we need to play the Lotr LCG in released chronological order to be more successful? We were wondering if the Battle of Lake-town was made with prior expansion card pools in mind.\n\n No, I think you can win with what you have. Exactly which sets does your group have?\n\n> 2 hours ago, Thaeggan said:\n> \n> 2. Is 4 players making it harder to beat the Battle of Lake-town?\n\nThere shouldn't be too much of a difference, but I've never played the quest.\n\n> 2 hours ago, Thaeggan said:\n> \n> 3. Should we consider mixing our 4 decks or stick with the strength running a single color deck?\n\nDefinitely mix things up, mono-sphere doesn't become truly viable until much later in the game.\n\n> 2 hours ago, Thaeggan said:\n> \n> 4. Am I crazy to want to unlock cards in how I described above or is it highly recommended all the cards from a cycle be available when opening a deluxe box?\n\nNo, not at all. That's how I'm doing it and many other's have done so as well. We like to call it Progression Style.\n\nGenerally, for this quest, you need one Super Defender to tank Smaug each turn, some way of killing him, and the means of staying alive until both become a reality (cancellation and location control are big ones)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/281916-battle-of-lake-town-and-card-pool/?do=findComment&comment=3457751","commentId":3457751,"userName":"Authraw","timestamp":1535831466,"content":"I think the quest should be winnable with your proposed card pool. In general, it doesn't take too long to build up a card pool capable of taking on just about any quest.\n\nThat being said, Battle for Lake-Town is one of the harder quests in the game, so I would expect it to take several tries.\n\nI think your biggest issue is going to be building up enough defense to consistently defend Smaug. I'd have the party pick a character to be a super-defender (Gimli, Aragorn, or Denethor stand out to me) and focus on building that character up as quickly as possible. The only defense-booster you have is Protector of Lorien, so you're instead going to need to rely on HP boosts (Citadel Plate) and consistent healing (Self Preservation, Daughter of Nimrodel). Beravor can help with card draw to ensure you get all the pieces quickly.\n\nMono-sphere doesn't work as well at low player counts, but at 4 players it usually works just fine, so long as everyone is ready to play Attachments across the table rather than only on their own characters.\n\nGood luck!"}]}