{"url":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/","title":"That 2 quests from Limited Edition","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3459463","commentId":3459463,"userName":"Flrbb","timestamp":1536050824,"content":"Everyone is talking about the player decks in the limited edition (and the digital version), but almost no-one mentions the 2 (printed) quests from that bundle.\n\nAll I know is that they are both (at least solo) easy to win. No spoilers so far for quest cards or the deck itself?! Not even the titles of these missions.\n\nDid I miss something? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited September 4, 2018 by Flrbb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3459601","commentId":3459601,"userName":"Wandalf the Gizzard","timestamp":1536065368,"content":"Are you asking what the quests are like? Or just wondering why they're not on Hall of Beorn, CGDB, etc.?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3459693","commentId":3459693,"userName":"PsychoRocka","timestamp":1536069657,"content":"First one is The Oath and the second is Caves of Nibum-Dum or something like that. First one is super easy and similar to Passage through Mirkwood. Second one is similar to the Khazad-Dum quests and Cave Torch makes a cool return! You have to attack a location (Cracked Pillar) in order to knock it over and pass a chasm and pursue a band of Goblins. Second quest is a bit tougher and can pose somewhat of a challenge. Most of the encounter cards contained within both quests (they each have their own encounter set and share a third) are cards that we already actually have in the game but they come from all different quests mainly the first two cycles but with some weird other additions, (I believe one card is actually from Nightmare Battle of Five Armies!!) and then there are a handful of original encounter cards (mainly those that are key to beating the quest such as specific locations or boss enemies). The full art on the encounter cards is really nice especially the locations and I sort of wish that all encounter cards were like this, the quests themselves aren't that special although the second is certainly pretty neat.\nCan certainly see myself revisiting the second quest but would only play the first again in order to teach someone the game, similar to Passage through Mirkwood and Journey Along the Anduin from the Core Set really."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3459880","commentId":3459880,"userName":"Wandalf the Gizzard","timestamp":1536077528,"content":"For me, The Oath has taken the role from Passage through Mirkwood as my new player quest. I would rate its difficulty at two of ten. The second one is great fun, I would rate it a five."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3459988","commentId":3459988,"userName":"Emilius","timestamp":1536082488,"content":"Where can we found a cards spoiler of these two quests? Is it somewhere? ?\n\nEdited September 4, 2018 by Emilius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3460019","commentId":3460019,"userName":"Flrbb","timestamp":1536083766,"content":"> 5 hours ago, Wandalf the Gizzard said:\n> \n> Are you asking what the quests are like? Or just wondering why they're not on Hall of Beorn, CGDB, etc.?\n\nActually, both. But more the latter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3460039","commentId":3460039,"userName":"Wandalf the Gizzard","timestamp":1536084870,"content":"> 38 minutes ago, Emilius said:\n> \n> Where can we found a cards spoiler of these two quests? Is it somewhere? ?\n\nTry CGDB. Thanks, Flrbb."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3464833","commentId":3464833,"userName":"CJMatos","timestamp":1536532063,"content":"> On 9/4/2018 at 7:14 PM, Wandalf the Gizzard said:\n> \n> Try CGDB﻿. Thanks, Flrbb.\n\n \n\nDon't see those cards in CGDB...\n\n \n\nCan someone point me to them?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3473239","commentId":3473239,"userName":"GILLIES291","timestamp":1537199945,"content":"> On 9/9/2018 at 4:27 PM, CJMatos said:\n> \n>  \n> \n> Don't see those cards in CGDB...\n> \n>  \n> \n> Can someone point me to them?\n\nSame question, and are the enemies the same? As in could a player with the old core play these new quests?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3473284","commentId":3473284,"userName":"Wandalf the Gizzard","timestamp":1537201548,"content":"> 25 minutes ago, GILLIES291 said:\n> \n> Same question, and are the enemies the same? As in could a player with the old core play these new quests?\n\nNo, most of the encounter cards are strewn throughout other expansions. There are a few new ones, too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3473303","commentId":3473303,"userName":"GILLIES291","timestamp":1537202009,"content":"> 6 minutes ago, Wandalf the Gizzard said:\n> \n> No, most of the encounter cards are strewn throughout other expansions. There are a few new ones, too.\n\nWell shoot still on the fence about needing to pick up this set or not then. How do the quests rank for enjoyment, challenge and theme?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3473537","commentId":3473537,"userName":"Wandalf the Gizzard","timestamp":1537208020,"content":"On a scale of one to ten, I'd give quest one (the Oath) a three for enjoyment, a one for difficulty, and six for theme (technically ten, but every quest in this game is thematic). The only time I'd ever play this is as an introductory quest for new players. This pretty much means I'll never play Passage through Mirkwood.\n\nQuest two (Caves of Nibin-Dum) nets an eight for enjoyment, a five for difficulty (the popular opinion is that it's harder), and an eight for theme."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3473653","commentId":3473653,"userName":"Willange","timestamp":1537211672,"content":"I would also add that both quests are perfectly doable with the 2 pre-built decks that come with the set.  It made for a fun departure from the decks I've been using!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3474882","commentId":3474882,"userName":"Authraw","timestamp":1537285484,"content":"I have been working on other projects lately, but I plan to compile a list of the cards in these quests and what packs they originally came in. You would only need to proxy a few cards if you already have an otherwise complete collection."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3476808","commentId":3476808,"userName":"CJMatos","timestamp":1537399782,"content":"> On 9/9/2018 at 11:27 PM, CJMatos said:\n> \n>  \n> \n> Don't see those cards in CGDB...\n> \n>  \n> \n> Can someone point me to them?\n\nWell found the player card's in Hall of Beorn [http://hallofbeorn.com/LotR?CardSet=Two-Player%20Limited%20Edition%20Starter]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3689859","commentId":3689859,"userName":"wernerkellens","timestamp":1556308258,"content":"I’m struggling with the scenario The caves of nibin-dûm. I’ve done almost ten attempts without any success (solo play). Any advice? Thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3689905","commentId":3689905,"userName":"Wandalf the Gizzard","timestamp":1556310291,"content":"Are you using the two decks included in the Limited Edition Starter?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3689913","commentId":3689913,"userName":"wernerkellens","timestamp":1556310692,"content":"Yes I did and make another from these sets to try something else "},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3690012","commentId":3690012,"userName":"Wandalf the Gizzard","timestamp":1556318901,"content":"That may explain some of it. The decks that come pre-built in there really aren't the strongest.\n\nWell, for starters, I'd probably actually just use the Leadership/Spirit pre-built deck. Without any other expansions, they're probably the best you'll get. There are a couple tweaks I'd make with neutral cards, though. I'd add a third Gandalf and both Envoys from the other deck, while taking out Light of Valinor, Grim Resolve, and a Silverlode Archer.\n\nFor starting locations, I'd probably pick Collapsed Mine or Branching Paths. For the first few turns, the most important thing is to be able to play as many allies and attachments as possible. That means low-cost allies, and especially Steward of Gondor; which I would mulligan for. Which hero should you put it on? It depends on what cards are in your hand. Aragorn is nice, since he can use his ability easier that way. Between Gildor, Nori, and Aragorn's ability; willpower should be covered. I'd focus on getting out some allies to help with combat, and quickly!\n\nBefore you advance to stage two, build up your strength until you feel comfortable dealing with all the enemies there. You want to be able to blow through stage two and three quickly, and then stage four hits you hard, so make sure you're absolutely ready before you head to stage two. The enemy I'd pick for the Forced effect is Goblin Runners. That way they won't surge. If you can make it to stage four alive, it should only be a matter of time before you take down the Chieftain and win the game. Here are a few tips:\n\nDon't feel too bad about failing the quest early in the game (as long as you don't get location locked) if it might help you get a more stable position in combat for the next round.\n\nDon't be afraid to use the Cave Torch often. I'd rarely use it on the Warg, though.\n\nSave your Test of Will for Watchful Eyes.\n\nAvoid the Great Cave Troll at all costs!\n\nI hope some of that helps you. I'll try to play Caves of Nibin-Dum at some point as well, and let you know how it went."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3690051","commentId":3690051,"userName":"Wandalf the Gizzard","timestamp":1556322762,"content":"Oh! I forgot Light of Valinor could also go on Gildor. I would put that card back in and take out a second Silverlode Archer.\n\nAnyway, I played a quick game of Caves of Nibin-Dum with the deck I described above. I won pretty easily, but nearly everything went my way. My starting hand wasn't great, but I could play Dwarven Sellsword and I had both Test of Will and Hasty Stroke, so I decided to keep it. I used Cave Torch to explore the Branching Paths in the staging area before the quest phase. The card I revealed was Goblin Scavengers, which I killed pretty easily. After the end of the first round there were no encounter cards in play and there wasn't anything Sauron could do to catch up.\n\nGaladriel found me Steward of Gondor, which I put on Aragorn along with Celebrian's Stone. Now I could play tons of cards, with Gildor's ability refilling my hand. Eventually Aragorn got Unexpected Courage and Arwen was out boosting his defense, which meant I could deal with the Chieftain. I moved on to stage two (I chose Goblin Runners), which I completed in one round. I also completed stage three in one round. By the time I got to stage four I had lots of allies, and made eight progress easily. Watchful Eyes almost wrecked me, but thankfully I had Test of Will. Aragorn took some damage but I eventually mustered enough attack to finally destroy the Chieftain without too much trouble."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3690149","commentId":3690149,"userName":"wernerkellens","timestamp":1556340535,"content":"Thank you very very very much. I’ll give it a try the next time!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3696015","commentId":3696015,"userName":"wernerkellens","timestamp":1556984191,"content":"I went much better, I had just the bad luck that I got all the heavy monsters during the last quest. But it was a big improvement. Thanks for you advice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282035-that-2-quests-from-limited-edition/?do=findComment&comment=3704455","commentId":3704455,"userName":"wernerkellens","timestamp":1558207250,"content":"And this evening I nailed it! Thanks for you aid!"}]}