{"url":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/","title":"Fresh start on old expansions?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3461980","commentId":3461980,"userName":"Thozam","timestamp":1536249306,"content":"I got the Limited Edition Starter as I was interested in both the table top game and the digital game.\n\nI think the tabletop game is fantastic and I would like to continue playing and build up my collection of various expansions.\n\nSome expansions seem to be out of print though. I understand that as this is an old game.\n\nNow to my question: with this Limited Edition Starter I assume FFG want to attract new players to the game. Does this also mean that they are planning to reprint expansions? If not, why call it a Starter?\n\nRegardless, I'm happy with my purchase as it has been great fun to play it so far!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3462067","commentId":3462067,"userName":"dalestephenson","timestamp":1536253849,"content":"FFG has regularly reprinted expansions -- and the reprinted expansions have regularly been sold out again.  It's safe to say that anything that is currently out of stock will eventually be reprinted, it's not safe to say that anything currently in stock will remain in stock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3462084","commentId":3462084,"userName":"anfallon","timestamp":1536254470,"content":"Speaking of fresh start to old expansions...why not a similar approach as Arkham LCG  around the \"Return to...\" boxes? With as many cards that are avilable, it's really new quests and objectives within old expansions that would add huge value to collections. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3462171","commentId":3462171,"userName":"Thozam","timestamp":1536259315,"content":"Thanks for swift reply, dalestephenson. But no official commitment to this from FFG I assume? \n\nGreat idea anfallon. I already have those for Arkham LCG. Regarding LotR LCG I'm a noob so it doesn't help much at the moment. ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3462189","commentId":3462189,"userName":"dalestephenson","timestamp":1536260220,"content":"FFG has never promised to reprint their old stuff AFAIK, but they have a history of reprinting old stuff that goes out of stock.  Since the reprints sell out quickly, I don't see why they would stop doing that, at least while the game is under active development.  If they ever cease development or lose the license, I would expect them to change.\n\nFFG's (not always up-to-date) Upcoming status lists reprints of both Khazad-Dum and Flame of the West as \"At the printer\" (as of 6/4/2018), and a whole lot of stuff \"Awaiting Reprint\" that was added between Shadow and Flame (10/9/2017) and Trouble at Tharbad (8/30/2018).  The Limited Collector's Edition that just got released is listed as \"In development\" (6/22/2018), to give you an idea about how frequently individual entries get updated."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282161-fresh-start-on-old-expansions/?do=findComment&comment=3462228","commentId":3462228,"userName":"Wandalf the Gizzard","timestamp":1536262398,"content":"I would be very surprised if FFG didn't reprint the old expansions in the near future. They have no reason to stop after doing it (and making profit) for seven/eight years.\n\nWait a minute, we're fast approaching LotR LCG's tenth anniversary! What do you think about that?"}]}