{"url":"https://community.fantasyflightgames.com/topic/282438-playing-quests-in-order/","title":"Playing quests in order","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/282438-playing-quests-in-order/?do=findComment&comment=3467525","commentId":3467525,"userName":"alcuin18","timestamp":1536773615,"content":"I have a question for the community. I'm missing a couple of adventure packs here and there in the different cycles because of money and/or reprint status. Does it matter greatly story wise if you miss a pack in a cycle to the overall story? Also, is there a place where you can read what happened in a missed pack to catch up on the story for the pack you do have? Thanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/282438-playing-quests-in-order/?do=findComment&comment=3467609","commentId":3467609,"userName":"Kjeld","timestamp":1536778615,"content":"If you truly care about the story, then within cycle it helps a lot if you progress in order. That said, if you go to the LotR products page and scroll down to the Support area, you'll see that you can download pdfs of the rules for most scenarios:\n\nhttps://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/ [https://www.fantasyflightgames.com/en/products/the-lord-of-the-rings-the-card-game/]\n\nThey provide some of the intro story for each quest, though it looks like FF has redacted the post-quest story-line for some reason (I guess so you have to buy the pack to know the full story?). So I suppose you could fill in some of the story gaps that way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/282438-playing-quests-in-order/?do=findComment&comment=3467782","commentId":3467782,"userName":"Wandalf the Gizzard","timestamp":1536786537,"content":"I think that just covers the spoilery stuff with story twists.\n\nI doesn’t matter too much for the earlier cycles, but once you get to Heirs of Númenor and Against the Shadow; the story gets a lot stronger, so you might want to wait if you’re that far along.\n\nBe sure to check the Geek-market on BGG for the packs you’re missing."}]}