{"url":"https://community.fantasyflightgames.com/topic/283231-not-fair/","title":"Not Fair","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479763","commentId":3479763,"userName":"tripecac","timestamp":1537604797,"content":"I am slooooowwwwly making my way through the quests, in release order.\n\nToday I played Return to Mirkwood (2 handed), and lost badly.  First there was a treachery that did 4 damage to a hero of the player controlling Gollum.  None of that player's characters had more than 4 health left, so one hero had to die.  A couple turns later, I got the same treachery, and lost another hero from the same player.  I still soldiered on, because my other player was doing awesome.  However, location lock ended up killing me in the second quest phase.  I tried to keep pushing through, and even got 2 sneaky Gandalfs, but made no headway against those locations... or the hill troll that popped up...  and despite my careful tactical play, it all came crumbling down.\n\nSounds like a semi-common scenario, doesn't it?\n\nWe go into a scenario blind, bringing decks that have performed well in the past.  But then the scenario starts, and no matter how carefully or cleverly we play, the quest keeps popping up cards for which we have no counter, and it keeps pummeling us with those cards, and we die.  We have no defense, and two words start to form in our heads: \"Not Fair\".\n\nI think it's this feeling of unfairness that turns off a lot of player.  I myself feel very frustrated by it.  It's the same feeling I used to get whenever I encountered insta-death in a roguelike.  I'd be doing great, playing conservatively with a cool character, and then I'd encounter something I'd never seen before (shopkeeper, cockatrice, medusa), and before I know it, my character is dead.  So I have to start all over again, and try to... remember... sheesh. \n\nAnd at that point the fun is just gone.  Because I know there's no real reward for NOT attacking the shopkeeper, or RUNNING AWAY from the cockatrice and medusa... Just like I know there is no real reward for logging into ringdb.com and building (or finding ) a deck that has high-health heroes, threat reduction, and treachery cancellation. \n\nTo me, the process of deckbuilding does not feel creative.  It feels reactive.  It feels like running away from an insta-kill monster in a roguelike.  It feels lame.  Cheaty.  Cheap.  It feels the opposite of heroic or clever or careful or creative. \n\nI feel the same way when I am forced to solve a riddle or puzzle in computer game which is supposed to be about fighting and exploration.  It's like those stupid vaults in Assassin's Creed games.  God, I hated those.  But I loved the rest of those games, the history, the detail, the sense of \"being there\". \n\nAnd I feel like that with the Lotr LCG.  I love the theme, the art, the moments where there's a sense of steady, well-earned progress.\n\nBut I HATE the insta-death.  And the need to go build or pick a deck which is specifically design to beat this quest.\n\nScissor.  Paper.  Rock.\n\nI am not amused.\n\nWhy can't we just play the darn game?!?!?  Why do we have to pause for this stupid commercial break???\n\nArghhhh!!!\n\nSo yeah, deck building is killing my enthusiasm for this game.  I just don't find it fun.\n\nAnd this, I think , is why LotR is steadily falling in the rankings.  New people try it out.  They get their butts kicks.  But then they keep playing until they [think they] \"get it\".  And they manage to go through a few scenarios feeling like things are moving along nicely.  And then BAM!!! a quest kicks them in the groin.  \"Not fair!!!\" they yell.  And at that point, many of them quit player, and sell the game in disgust.  \"Not for me\" they say.\n\nI guess each of us has a different point at which we yell \"Not fair\".  For some, it was Escape from Dol Guldur.  For others, it was probably this missing (Return to Mirkwood).  And apparently for a lot of people it was the third Deluxe pack that made them want to chuck the game into the fireplace... or at least list it on eBay.\n\nI haven't reached that point yet.  But I've been playing so many other board games recently that when I return to this one, and encounter that \"icky\" insta-kill feeling, I have less tolerance for it.\n\n \n\nSo what's the solution? \n\nEasy mode?  Canonical decks?  \"Growing a pair?\"  Arkham LCG?  Pokemon?  Checkers? \n\nOr is it just a matter of forcing ourselves to persevere?  To keep obediently trudging up that jagged learning curve until we finally reach the \"real\" summit, the point at which we really and truly have \"gotten\" LotR LCG, and can no longer be phased by the occasional insta-kill?\n\nHow do we get high enough to see the big picture?\n\nAnd is there really one?\n\nOr are we just on a jagged treadmill?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479782","commentId":3479782,"userName":"theagesthrough56","timestamp":1537606655,"content":"How about deckbuilding with the whole cycle in mind ? It’s a nice middle ground between building specifically for a quest and building in a vacuum. \n\nI should add that building quest-specific decks might not be as cheaty as you are inclined to think, in the sense that the task might not be as trivial as you think. For example, even if you add high hit-point heroes, such heroes usually come with a high threat cost. Are you sure you can handle the quest’s brutal threat increases?\n\nInstadeath is not the worst IMO. It adds a sense of danger to the following games, and adds to the triumph when you finally get over the hump. What’s the worst, IMO, is winning against the absence of opposition.\n\nEdited September 22, 2018 by theagesthrough56"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479787","commentId":3479787,"userName":"NathanH","timestamp":1537607941,"content":"With a small card pool, I would recommend reading all the encounter cards before playing the quest. A small card pool can't respond to every demand, and the quests (particularly the early ones) like to test one or more aspects significantly more than others."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479875","commentId":3479875,"userName":"dalestephenson","timestamp":1537620892,"content":"> 4 hours ago, tripecac said:\n> \n> We go into a scenario blind, bringing decks that have performed well in the past.  But then the scenario starts, and no matter how carefully or cleverly we play, the quest keeps popping up cards for which we have no counter, and it keeps pummeling us with those cards, and we die.  We have no defense, and two words start to form in our heads: \"Not Fair\".\n\nIf you don't enjoy the experience of getting crushed by a scenario when playing blind -- don't play blind!  The entire *point* of playing blind is to react to things you've not seen before.  Of course it's unfair -- that's the \"fun\" of it!  For my own part, I'd rather skip the blind loss and go directly to planning (plus I'm impatient and can't leave those encounter cards unspoiled...).\n\nDoes this mean that I radically change the decks that have performed well in the past?  Not at all.  It's very rare that I'll completely rebuild my deck or decks for a particular quest.  What I *do* have is a number of sideboard cards prepared to add to my deck to handle things that I think my deck may be weak on, or to address something not present in every quest (e.g. condition removal).  I look through the encounter cards and if I think something needs my sideboard I throw in the appropriate cards.  (For maximum efficiency I would also swap cards *out* to be replaced by the sideboard cards, but I'm usually too lazy to do that and just throw them in.) In the case of Return to Mirkwood I add extra threat reduction, though if my heroes couldn't take Gollum's Bite I would add Close Call and/or Dori depending on which spheres I have.  If I were playing progression style, I'd hope to have A Test of Will in hand or just to get lucky -- there's only two copies of Gollum's Bite in the entire encounter deck, so you *were* quite unlucky.  The last time I played Return to Mirkwood (one-handed) I had no heroes who could survive Gollum's Bite, but it never came up. Which is good, because A Test of Will also failed to come up.\n\nAnd yes, don't be afraid to try easy mode; that reduces the copies to one.  There's no shame in playing on easy mode.\n\nFinally, it's perfectly OK to hate insta-death cards.  I loathe Sleeping Sentry.  But while there's a lot of cards that have great potential to kill a hero, there's not that many cards like this one that specifically kill heroes. Since you are playing blind I won't list them all for you, but *most* cards that damage/discard heroes have some way to mitigate -- for example, Hummerhorns (core set) will probably kill a hero if you engage them, but with 40 engagement cost you can avoid that by keeping your threat lower than that or using direct damage to kill it in the staging area.  The cards I consider most obnoxious insta-lose are concentrated early in the game -- later cycles kill your heroes by making everything coming out of the encounter deck dangerous, not generally by a few obnoxious treacheries."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479883","commentId":3479883,"userName":"Wandalf the Gizzard","timestamp":1537621533,"content":"I think you either need to accept the general difficulty of the game or just embrace deck-building for specific quests. It's really not cheating, and half the fun for most of us. Cycles past that notorious third have much less insta-kill cards and are less susceptible to horrible luck ruining a good run. If a more balanced or predictable experience is important to you, maybe skip to Ringmaker (of course, you'd still be at a disadvantage by having much less fewer player cards). Or just do this:\n\n> 4 hours ago, tripecac said:\n> \n> Or is it just a matter of forcing ourselves to persevere?  To keep obediently trudging up that jagged learning curve until we finally reach the \"real\" summit, the point at which we really and truly have \"gotten\" LotR LCG, and can no longer be phased by the occasional insta-kill? ﻿\n\nBut seriously, if you don't like deckbuilding, then maybe just try a different game (or netdeck). It makes sense that if you don't enjoy deck-building you wouldn't enjoy a game that is centered on it.\n\n> 4 hours ago, tripecac said:\n> \n> And this, I think , is why LotR is steadily falling in the rankings.﻿  New people try it out.  They get their butts kicks.  But then they keep playing until they [think they] \"get it\".  And they manage to go through a few scenarios feeling like things are moving along nicely.  And then BAM!!! a quest kicks them in the groin.  \"Not fair!!!\" they yell.  And at that point, many of them quit player, and sell the game in disgust.  \"Not for me\" they say.\n\nIt's rated sixth for solo games, and just outside of the top one hundred on BGG. FFG continues to make content, so it must be making money for them.\n\n> 7 minutes ago, dalestephenson said:\n> \n> There's no shame in playing on easy mode.\n\nMaybe a little . . . :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479896","commentId":3479896,"userName":"dalestephenson","timestamp":1537622803,"content":"Games steadily falling in the BGG rankings is *normal*.  As games age, their ratings slowly decline -- and new games are published, some of which are highly rated.   Puerto Rico was the #1 ranked game for a llooooonnnggg time, now it's #15.  It displaced Tigris and Euphrates as #1 -- T&E is now #70.  \n\nI don't have historical ratings for LOTR so I can't really comment whether it's decline has been unusually steep.  It's currently ranked 7th among games published in 2011, but I'm not at all sure how that compares to previous years."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479903","commentId":3479903,"userName":"PocketWraith","timestamp":1537623491,"content":"I would say that as you continue through the quests in release order you should find the number of instant death cards decreases, though it takes a while.\n\nWhen I was newer to the game, I just built a Dwarf deck because I'd heard they were super powerful and I wanted to see for myself, and I just ran that deck through every quest. For a while it was a consistent practice - whenever a new quest was released I'd run the Dwarves at it blind, thus getting a feel for the demands of the quest which I could take into account when playing it with other decks (custom built for it or just chosen for being well suited). It's possible something like that might work for you - just get yourself a powerful deck or two that can manage some of the unfair cards and use them as your proverbial canaries to reveal what the harsh effects in each quest are.\n\nOr, as other people have said, you could just not play blind, look through the encounter decks in advance, ask people who have played the quest before what you need to be prepared for, or learn about the quests in advance by reading blogs, watching video playthroughs, etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3479979","commentId":3479979,"userName":"Bullroarer Took","timestamp":1537630871,"content":"I heard about this game before it was released and began following it on BGG back then.  After the core set was released I felt so disillusioned.  Eowyn and Spirit were SO powerful and the Three Hunters couldn't win a game.  I almost quit, but I decided to stick with it throughout the first cycle and decide then.  After the first cycle I almost quit again.  Laziness kept me from listing everything on eBay and then Khazad Dum was announced.  I decided I might as well keep my cards and see if things got better.\n\nOne of the best decisions I've made."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480034","commentId":3480034,"userName":"tripecac","timestamp":1537635368,"content":"Thanks for the constructive feedback, guys!  It's definitely given me a lot to think about.\n\nI think one of the reasons the quest got so frustrating is that both of the heroes I lost in stage 1 were with Eowyn, who had +2 willpower and was my main quester.  Since the tactics/spirit player had now lost 2/3 of its resource generation, it couldn't possibly crank out a bunch of questing allies like I'd hoped, and all those red cards were basically trash.  So I focused on the leadership/lore player, who did awesomely (thanks mostly to stewart of gondor and Bilbo), cranking out lots of allies, healing damage, card draw...\n\nBut then the 2nd quest phase happened, and I had to stick Gollum with someone, and that was Eowyn, since even with her questing bonuses she couldn't generate as much willpower per turn as the other player.  So now Eowyn couldn't quest, so her 6-8 willpower was unavailable, and the other player just couldn't keep up with the locations, let alone that Hill Troll that popped out.  No tactics left, remember?\n\nMy only hope was that this was a short, 2 quest phases scenario.   If only I could push on through this one quest phase...   I had 2 sneak attacks and a gandalf, so I did lowered my threat, quested like crazy... but still couldn't make progress.\n\nAnd when the sneak attacks were done, and I was forced to play Gandalf for real, and we *still* couldn't finish that quest phase, I realized that I was doomed.  Gandalf went away, and our only hope was to throw everyone at questing.  Still no luck.  And now that Hill Troll had pushed our threat into the high 40s...    Dead dead dead.\n\nI honestly think it was \"over\" the minute I lost both of my tactics heroes.  That one treachery card (drawn twice) killed any chance I had at getting through quest phase 2.\n\nFor my next attempt, I need to make sure that Eowyn is escorted by heroes who can survive that treachery card.  So either 2 heroes with 5 health, or one of those plus Frodo.  I think I prefer the latter idea, since the starting threat will be lower and I can increase the density of cancellation and G's Greeting.\n\nSo now at least I'm thinking ahead, and that's a good sign, right?\n\nDo you ever have a period, after having lost a quest, that you feel angry at the game.... but then after a while you start to think about what YOU could have done better... and that gets you thinking about \"next time\" and by then you are feeling less angry, more determined?\n\nAre the designers banking on the idea that players have a relatively short window of frustration?  Do you think they played it \"safer\" with Arkham LCG by decreasing the chance of players perceiving the game as \"unfair\"?  And is that the main reason why Arkham LCG is doing so well, despite its less-popular theme?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480048","commentId":3480048,"userName":"PocketWraith","timestamp":1537636374,"content":"> 14 minutes ago, tripecac said:\n> \n> Do you ever have a period, after having lost a quest, that you feel angry at the game.... but then after a while you start to think about what YOU could have done better... and that gets you thinking about \"next time\" and by then you are feeling less angry, more determined?\n\nPersonally I don't, either I skip straight to the determined stage or I'm just not in the mood (which generally means I wasn't really in the mood when I started playing) and take a break instead. I know there are plenty of people who do react as you describe though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480106","commentId":3480106,"userName":"Wandalf the Gizzard","timestamp":1537639990,"content":"> 4 hours ago, dalestephenson said:\n> \n> I don't ha﻿ve historical ratings for LOTR so I can't really comment whether it's decline has been unusually steep﻿.﻿﻿\n\nWhat!? But you have statistics for everything! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nIt's fallen slower than most games, like the two stars you mentioned. It used to be in the top one-hundred and know it's what, nine spots from that?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480494","commentId":3480494,"userName":"tripecac","timestamp":1537674099,"content":"In the shower today I had a brainstorm: instead of using Frodo, I'd use Eleanor.  That way, she could cancel not only the 4 damage treachery, but also any others which raise threat.  SO my spirit/tactics heroes would be Eowyn, Eleanor, and Thalin.  Nice low starting threat.\n\nSo after my shower, I rebuilt my spirit + tactics deck, taking out all the eagles, putting in lots of questers and other spirit cards. etc.  I called this new deck \"Return to Yo Mama\" since it was all about beating Return to Mirkwood.  I didn't touch the leadership/lore deck since it did so well last game.\n\nAnd then I played.  And this time I did *much* better.  We breezed through the first 3 quest phases.  Leadership/lore again had tons of allies again, and Eleanor canceled the nasty treacheries, so I didn't lose any heroes...\n\n... until quest phase 4, when suddenly all the enemies attacked the player who had Gollum, which happened to be spirit/tactics.  Unfortunately, I had 2 Attercop, Attercop cards pop out back to back.  I managed to kill the first, but then the second one killed Eleanor (so much for her being the MVP).  Still, that left Eowyn and Thalin, and a Northern Tracker.  At the end of that turn, I moved Gollum over to leadership/lore.\n\nThe next turn was the hail mary.  Spirit/Tactics brought out 2 Escorts from Edoras, and quested with both (plus Eowyn, Thalin, and the Northern Tracker).  Leadership/Lore didn't quest at all, but instead brought out Gandalf 4 more allies (I had tons of resources built up by that point).   The encounter cards were a couple of locations.  Eowyn's team's questing was enough to satisfy the quest's location points.  All that remained was to kill the 3 bad guys who were now attacking leadership/lore.  With Gandalf, Mirkwood Runner, and a bunch of other allies, we managed to do it.  Chop, chop, chop all enemies.  Quest done!\n\n------\n\nSo, I know, it often gets boring reading other people's AARs.  And I don't expect you to have read all that!  I just posted it here as a way to express the positive side of this game.\n\nAnd I have a conclusion for you:\n\nWhen it works, when we go into a quest with an appropriate deck, then the challenges we encounter along the way seem \"fair\", and thus surmountable.  If we lose a close match, we do not get frustrated or angry; we simply become instantly determined to try again.  And when we win a close match (which I just did), we get that thrilling feeling of a well-earned victory.\n\nIt's only the \"unfair\" matches that really bother us.  Or at least me.  And they are only \"unfair\" if the scenario presents \"fatal twists\" that our decks are not prepared to counter. \n\nI suppose that's the risk of playing blind.  Not just losing, but losing in such a way that it feels unfair, and you get angry with the game.\n\nOne solution would be to not play blind, as others suggested.\n\nAnother would be to play blind, but with decks which have somehow been \"approved\" for that scenario.  I'm not sure how that'd work.\n\nAnd finally, we could play blind, with our own decks, but find a way to reduce the \"pain\" of insta-kill losses.  Maybe there's a way to reduce the overhead of deckbuilding?  Or automate the \"tweaking\" of the deck?\n\nThere's also the idea of using fixed deck archetypes (dwarves, eagles, etc.) and run then against quests, EXPECTING them to lose due to scissor-paper-rock mismatches.  If the Dwarves fail to return Gollum to Thranduil, then send in the Hobbits...  That, I think, would be a thematic solution to the \"unfairness\".  It would also reduce the deckbuilding (since the archetypical decks would be fixed).\n\nSo this gets to a question I've long wondered:\n\nAt what point can we start building up really strong thematic decks?  How far along in the progression series do we have to get before those are viable?  I'd love to get to that point, so that I'm not thinking about which individual cards to use, but rather which teams to send on the quest.  That high-level decision making appeals to me!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480523","commentId":3480523,"userName":"dalestephenson","timestamp":1537676999,"content":"Just looking at the tribal decks, this is the point where I think the decks become \"good\" for a solo (one-deck) player:\n\nDwarrowdelf (+ Hobbit) -- Dwarves\n\nAgainst the Shadow -- Outlands and Gondor\n\nBlack Riders -- Hobbit secrecy\n\nRingmaker -- Silvan\n\nTreason of Saruman -- Rohan\n\nAngmar Awakens -- Dunedain and Ents\n\nGrey Havens -- Noldor\n\nHaradrim -- Harad\n\nFlame of the West -- Eagles (Hirgon/TaEowyn/Mablung)\n\nWilds of Rhovanion -- Dale\n\nMountain of Fire gave us Tom Cotton, but I'm not sure there's enough Hobbits to make a hobbit-ally tribal decks yet.  And it looks like Ered Mithrin will give us a woodman deck, though we'll have to see how viable it ends up being.  Note that you don't need strict progression for all these -- Outlands really only needs one pack, Harad only uses three packs, Silvans are solid with Ringmaker cycle alone.\n\nThis is just for tribes, there are plenty of other archtypes out there.\n\nEdited September 23, 2018 by dalestephenson\nTraps aren't a tribe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480569","commentId":3480569,"userName":"tripecac","timestamp":1537685601,"content":"I like the tribe idea, since it's easy to visualise them.\n\nI do have a question: what about non-tribal cards like Sneak Attack, Gandalf, etc.?  How do you decide which decks get them and which don't?\n\nAlso, do tribes tend to favor specific spheres, or are they spread evenly through the spheres?  (It's hard for me to imagine Hobbit Secrecy using much tactics, but you never know!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480707","commentId":3480707,"userName":"Eryx_UK","timestamp":1537707623,"content":"This may not be a popular suggestion but... don't use shadow effects. It did not take me long after the game first came out to realise that shadow effects just drive the frustration of the game to silly heights. Stopped using them (as per a suggestion in the main rules) and I have far better experiences with the game. Doesn't mean you walk the quest but it becomes a lot less frustrating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3480717","commentId":3480717,"userName":"dalestephenson","timestamp":1537708629,"content":"Cards like Sneak Attack and Gandalf are staples, you'll find them in a wide variety of decks.  I personally like to put Sneak Attack and Gandalf in every leadership deck I build, but I can say from deck analysis that this is common but not universal.  Some people build decks without any \"staples\".\n\nThese are the cards I would consider staples even with the full card set:\n\nLeadership: Sneak Attack, Steward of Gondor\n\nLore: Daeron's Runes, Warden of Healing\n\nSpirit: Unexpected Courage, A Test of Will\n\nTactics: Feint\n\nNeutral: core Gandalf\n\nAll those have *wide* usage.  However, they aren't in every deck, and it certainly doesn't represent the complete list of cards that are \"worth including\" in a generic deck.  Here's some cards that I personally like to fit in decks if I can:\n\nLore: Hennamarth Riversong (for single decks, not multiplayer), Gleowine, Quickbeam\n\nSpirit: Arwen Undomiel\n\nTactics: Honour Guard\n\nNeutral: Treebeard\n\nDepending on the number of heroes in a sphere other things might be auto-include for me -- but that's just a preference on my part.  While any one-deck player would benefit from having Hennamarth Riversong in their deck (if they have lore access), this is a solo/cooperative game and there is absolutely no need to maximize the power of your deck.  It's perfectly OK to build and play suboptimal decks, if you want to for either thematic or challenge reasons.\n\nSo what are the spheres for tribal decks?  Taking in order\n\nDwarves -- Leadership and Lore are the prime territory for dwarves.  There are some good spirit/tactics heroes, and if you do a dwarven mining deck you need spirit, but the strongest heroes, the best cards, and the most allies are in leadership and lore.\n\nOutlands -- Hirluin is a must and he's leadership.  The two approaches with Outlands are either mono-leadership to take advantage of Lord of Morthond, or to couple with heroes who can help pay for Ethir Swordsman, the most expensive non-leadership Outlands.  Those can be spirit, Elrond, Gandalf, or Grima.\n\nGondor -- another stronghold of mono-leadership decks, though there's also some good tactics allies.\n\nHobbit secrecy -- most of these are either Sam/LoPippin/TaMerry (Black Rider deck) or Sam/LoPippin/SpMerry.  The latter is better if you want to play secrecy cards, the former is better if you want to kill things with TaMerry.\n\nSilvan -- Leadership is a must because of Celeborn, but there's good Silvan allies/events in every sphere.  But the most common lineup is Celeborn/lore/Galadriel.\n\nRohan -- most allies in spirit, with more in tactics than leadership.  Spirit/Spirit/Tactics is most common.  Spirit Theoden is the classic enabler.\n\nDunedain -- leadership and tactics are the most common, though there's also some good allies in lore.  Not many Dunedain decks use spirit.\n\nEnts -- all the Ents are Lore and Tactics, though leadership Faramir finds his way into a lot of Ent decks.\n\nNoldor -- Spirit and Lore are the key spheres here.  Noldor thrives on card draw and it's enabling discounter is in spirit.\n\nHarad -- requires Kahliel, who is leadership.  Has expensive out-of-sphere cards, so you either go Mono Leadership and try to get Steward on Kahliel (and use Lord of Morthond), use Elrond or Grima, or just select heroes to help pay for the most important of their allies (Firyal or Jubyar).\n\nEagles -- all Eagles are tactics, which is why you need questing tactics heroes like TaEowyn to make this solo-viable.\n\nDale -- Leadership Brand and Spirit Bard are requirements and the enabling King of Dale is spirit.  Dale is in all four spheres, so the third hero can be practically anyone.\n\nIf you look in the strategy forum for LOTR on BGG you can find analysis I've done on most of these tribes for what cards and heroes are most commonly used.  If you search for \"Stereotypical\" at ringsdb you can also see some stereotypical tribal lineups I've published based on the most commonly used cards.  However, if you're looking for the *optimal* tribal deck, I think you want to look at Rouxxor's decks, he has a wide variety of powerful tribal (and other archtypes) decks for both solo and multi-player use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3481049","commentId":3481049,"userName":"Rouxxor","timestamp":1537735578,"content":"Hi,\n\nGlad you find a way to enjoy yourself with this scenario after all. What can be especially hard in this game is that you have to find your own challenges, your own way to play it. There is many way to adjust difficulties. It have to be this way because it have to adjust to the decks, and not everyone want to play the same kind of decks. Feel free to play the game the like you want. I do countless time reshuffling back a card I'm annoyed to reveal, and just have another cards. Or reroll in the first turns. Or being beaten after many turns where the situation only get worse each time and I know I wouldn't survive. Or winning after 64 turns, 5 hours and even if I never thought I will win. The only things in common between those cases: I do what make me enjoy the game the most at this moment.\n\n> 7 hours ago, dalestephenson said:\n> \n>  ﻿If you look in the strategy forum for LOTR on BGG you can find analysis I've done on most of these tribes for what cards and heroes are most commonly used.  If you search for \"Stereotypical\" at ringsdb you can also see some stereotypical tribal lineups I've published based on the most commonly used cards.  However, if you're looking for the *optimal* tribal deck, I think you want to look at Rouxxor's decks, he has a wide variety of powerful tribal (and other archtypes) decks for both solo and multi-player use.\n\nSuch an honor. Thanks ^^. To be more specific I have:\n\n- Solo optimized decks (most recent version here: http://sdajce.forumactif.org/t6782-mes-decks-apercu-de-la-diversite-des-listes-efficaces-en-solo [http://sdajce.forumactif.org/t6782-mes-decks-apercu-de-la-diversite-des-listes-efficaces-en-solo] in french with ringsdb links, a more older one on the strategy forum);\n- Multiplayer optimized decks (especially the first decks in the same condition here: http://sdajce.forumactif.org/t6033-des-decks-de-multi-adaptables [http://sdajce.forumactif.org/t6033-des-decks-de-multi-adaptables]);\n- Multiplayer thematic tribals here: https://lureofmiddleearth.com/forum/viewtopic.php?f=6&amp;t=9&amp;sid=5835396fa75a191b05e88cbb2028b641 [https://lureofmiddleearth.com/forum/viewtopic.php?f=6&t=9&sid=5835396fa75a191b05e88cbb2028b641]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3481103","commentId":3481103,"userName":"Wandalf the Gizzard","timestamp":1537739917,"content":"Don't worry, I for one don't think reading hard-earned success stories is boring. Congrats on getting past RtM! I think the best thing you personally can do is mitigate the \"unfair\" moments. Try the \"tribal\" idea you suggested Maybe ask here for a general idea of what to slot into your decks for each quest! We could give you some pointers without spoiling the experience. To completely avoid such insta-losses, you might just need to not play blind. ?\n\nAs for trait based (\"tribal\") decks becoming truly viable, it depends on the archetype. Dwarves were pretty much fleshed out before the Against the Shadow cycle, but Hobbits are still chugging along in the second tier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283231-not-fair/?do=findComment&comment=3481587","commentId":3481587,"userName":"Finch204","timestamp":1537796742,"content":"I played Return to Mirkwood blind. Blind in the sense that I didn't look at the quest cards to know how the stages played out. I won on my first try, in normal mode, though I did lose Aragorn to Gollum Bites, one turn before I managed to beat the quest. I had enough cards in play and on hand to win. It was a very close finish and I had to activate Aragorn's threat reset ability a few turns before he died. I have no doubt, that if I played the quest again, with the same deck, the possibility of me losing was still very real. I think that is what makes it exciting for me. Beating the quest when you know the possibility of losing is/was high.\n\nI do not play progression style because for my skill level, I think it is too hard and it stops me from creating thematic decks, which I really like. I played Return to Mirkwood with a Lore - Spirit deck, featuring Lore Aragorn, Bilbo and Spirit Glorfindel. Bilbo was my defender and had A Burning Brand on him at all times to try to keep him alive with his 2 hitpoints. Aragorn was my attacker. Glorfindel was my quester and would later help with attacks when he gets Light of Valinor on him. I used this deck to go through the Shadow of Mirkwood quests that I had (I am missing a few APs in between). I am now going through the Khazad-dum quests and am using a thematic Dwarf deck because it just fits the quests.\n\nEarlier I said I played the quest blind, though I guess you can say semi blind. I do not look at the quest cards, but I do go through the encounter cards when building the encounter deck. I look at what kind of enemies and treacheries the encounter deck would have. I don't try to memorize all the enemies and treacheries, but I try to have an idea what I will be up against. This might make the game a little easier, but I don't see it as cheating. This is akin to scouting before going on a combat mission. You scout the combat environment and possible enemies you will encounter. Same thing here. You know you are going to Mirkwood forest. It pays to know what you could possibly encounter out there. And if you know you are going to be facing spiders, don't you think the heroes will gear up depending on what they expect they will encounter out in the forest? This is my analogy for making adjustments to a deck based on the quest I am on. I don't exactly build a deck for each specific quest, like I said I used the same deck to go through the Shadows of Mirkwood quests, but I make adjustments along the way if needed.\n\nAlso I play one handed solo. I think this makes the game a little easier as well. Not just from the deck/hand management perspective, but from the fact that you will only reveal 1 encounter card per quest phase. This means at most, you will only run into 1 nasty enemy or treachery card per quest phase. Playing 2 handed means you could draw Gollum Bites and Necromancer's Reach in the same quest phase and it is game over. Or you could get Hummerhorns and Caught in a Web in the same quest phase. Anyway, my point is, 1 encounter card per quest phase is much easier to deal with in my opinion.\n\nLastly, Lotr LCG is really a deck construction game. I don't think you can get away and win without constructing a good enough deck. It doesn't matter if you got your deck online or you built it yourself. It is very a much a part of the game. On that note, for a one handed solo deck, I am finding that a Lore - Spirit deck is the easiest to play. Both spheres provide just enough cards to allow you to control/counter the encounter deck. And if some nasty encounter cards get through, you still have healing and threat reduction to allow your heroes to fight off the enemy.\n\nEdited September 24, 2018 by Finch204"}]}