{"url":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/","title":"Progression Style - by Cycle vs by Pack","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3481315","commentId":3481315,"userName":"tripecac","timestamp":1537762703,"content":"I just finished the Mirkwood Cycle, and am getting ready to start Khazad Dum.  I'd like to create my first thematic/tribal deck (Dwarf of course), but am wondering whether I should limit it initially to the cards in the deluxe box (and then earn new player cards as I progress through Dwarrowdelf), or \"splurge\" and allow myself to use any cards in the entire Dwarrowdelf cycle.\n\nIn other words, should I treat progression style as \"strict\" (pack by pack) or \"lenient\" (cycle by cycle).\n\nThe \"lenient\" approach means a larger card pool, so early quests will be easier, and there will be less need for deck-building (which in my mind is a good thing).  On the other hand, there will be less \"reward\" for beating a quest, since no new player cards will become available. \n\nSo, I am wondering what you do:\n\nDo you (a) \"open\" one pack at a time, or (b) \"open\" an entire cycle at once?\n\nWhere do you find the sweet spot to be between convenience and reward?\n\nAlso, do certain cycles seem designed to trickle out cards in a deliberate order, so that getting later cards \"too early\" is a sort of \"spoiler\"?  Or do cards seem to be distributed somewhat arbitrarily throughout each cycle?\n\n \n\nEdited September 24, 2018 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3481331","commentId":3481331,"userName":"Authraw","timestamp":1537765343,"content":"We did it cycle by cycle until we caught up. The cycle is designed all at once and then divided into packs, so I don't think there's much reason to do it pack by pack unless you feel you need the extra incentive of \"earning\" new cards for each successive win. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3481355","commentId":3481355,"userName":"NathanH","timestamp":1537768450,"content":"We did it cycle by cycle. This meant that we could immediately build coherent decks based on the current cycle's themes, instead of the first half of the cycle being \"last cycle's themes plus random bits and bobs\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3481565","commentId":3481565,"userName":"Wandalf the Gizzard","timestamp":1537795922,"content":"I personally have done pack by pack thus far, but there are many reasons to open up an entire cycle. It might be better for you, especially, because it would eliminate a lot of the deck-building and tweaking.\n\n> 7 hours ago, NathanH said:\n> \n> We did it cycle by cycle. This meant that we could immediately build coherent decks based on the current cycle's themes, instead of the first half of the cycle being \"last cycle's themes plus random bits and bobs\".\n\nThis!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3481735","commentId":3481735,"userName":"PocketWraith","timestamp":1537803799,"content":"I would agree with the above reasons for going by cycle. The main reasons for going by pack instead to my mind would be the more continuous feeling of reward for unlocking cards as you progress, possibly unlocking cards slower might lead to some more creative deckbuilding experimentation if that's something you enjoy, and the big one, experiencing something like what it was like for players at the time of release who would play the new quests immediately rather than wait for the whole cycle before beginning.\n\nUltimately you weigh up which of those aspects matter to you more and decide on that basis."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3486565","commentId":3486565,"userName":"beba89","timestamp":1538127875,"content":"Our house rules (2-3 player group):\n\nWe never check the encounter cards before doing a quest. Even if we did manage to beat it one time, we still only use the informations we can remember for future playthroughs.\n\nReward after beating the quest = get the next chunk of player cards from the following adventurepack. \n\n \n\nWe played pack by pack so far.  We love the feeling of being \"rewarded\" by finishing the quest and \"unlocking\" new cards. We thought it's only possible to play this real progression style only one single time, so we wanted to use that chance.  We played through the Mirkwood cycle, The Dark Rider Saga Expansions and through a good chunk of the Khazadum Cycle, facing the \"Foundations of Stone\" at the moment. I understand the argument for cycle by cycle though as it might feel more complete during the deckbuilding.\n\nEdited September 28, 2018 by beba89"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3487044","commentId":3487044,"userName":"tripecac","timestamp":1538160477,"content":"I like the idea of reducing the difficulty level without missing out on any content.  So, I'll continue to avoid Easy Mode (which omits cards), and will continue to use Shadow Cards, but will instead switch from pack-to-pack to cycle-by-cycle.\n\nIt's not the tactical difficulty I'd like to reduce.  It's the deck building.  Even though I play digitally (via OCTGN), the overhead of deck editing (login to ringsdb, find load a deck, clone it, add/remove cards, save it, download it, load it into OCTGN) is a HUGE pain.  If there were a true digital version of LotR LCG, with a really good build-in deck editor, then the deck building wouldn't be such a turn-off.  But right now OCTGN's deck builder is a pain, ringsdb has a lot of overhead, and playing with the physical cards has even worse overhead.\n\nAt least, that's how I feel now.  Perhaps once I get multiple thematic decks in my ringsdb library I'll be more enthusiastic about editing them.  Right now my decks are all hodge podges of staples and whatever cards seemed to counter the previous quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3487118","commentId":3487118,"userName":"Finch204","timestamp":1538163926,"content":"You can enter what expansions/packs you have in RingsDB and it will automatically filter out the cards when you're building a deck. I build decks on RingsDB whenever I have some free time. Building decks during my lunch breaks is becoming a new hobby. I used to build decks at home at night by looking at the physical cards I have. That was a chore, was time consuming and by the time I finish a deck, it would be time to sleep. RingsDB has been a great help since all I really need to do now is to check the deck list and build my deck with the real cards, then I'm off playing. The last few days have been fun as I have been trying to build mono sphere decks in my free time. I'm currently using a Dwarf deck go through the Khazad-dum quests, but I have already have decks lined up on RingsDB for future quests and replaying old quests.\n\nEdited September 28, 2018 by Finch204"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3487841","commentId":3487841,"userName":"HootsFromErebor","timestamp":1538256408,"content":"Personally I prefer to unlock one pack at a time but that can be really frustrating when you know the one card to really make your deck hum is stuck in the last pack of the cycle! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3490500","commentId":3490500,"userName":"fbnaulin","timestamp":1538513809,"content":"I did cycle by cycle. For the same reasons given here, I think it's not as tiring as going pack by pack, and gives you a better perspective on cycles as a whole and deck-building."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3748176","commentId":3748176,"userName":"tripecac","timestamp":1564165314,"content":"Using the entire Khazad Dum/Dwarrowdelf card pool at once definitely helped when going through the quests.  I loved the fact that I could go through multiple quests without having to deck build! \n\nSo, for me, Progression by Cycle has been more fun, due to the increased chance of success and decreased frequency of deck building.\n\nI'm just about to start the Hobbit saga.  There are 2 packs: (1) Over Hill and Under Hill and (2) On the Doorstep.  The rules indicate that saga player cards seem a little different from normal cards in that some of them are exclusive to the saga.  Also, there are campaign elements to consider.\n\nSo, for the sagas, is it better to:\n\na) open each part of the saga separately (requiring a deck build after each part)\n\nor\n\nb) open all parts, allowing access to all player cards from the start  (like some of us do for cycles)\n\nThanks!\n\nEdited July 26, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283351-progression-style-by-cycle-vs-by-pack/?do=findComment&comment=3748259","commentId":3748259,"userName":"rees263","timestamp":1564173095,"content":"> 2 hours ago, tripecac said:\n> \n> I'm just about to start the Hobbit saga.  There are 2 packs: (1) Over Hill and Under Hill and (2) On the Doorstep.  The rules indicate that saga player cards seem a little different from normal cards in that some of them are exclusive to the saga.  Also, there are campaign elements to consider.\n\nThere are different types of player cards in the saga boxes. Some are saga specific (e.g. Baggins Sphere cards and Treasure cards), all others should be treated as normal player cards.\n\nFor the Hobbit I would recommend opening both boxes. The rules for treasures state that you can only use them if you have already earned them with the same group of heroes. For this reason it makes sense to use the same heroes in each of the six hobbit quests.\n\nThe campaign rules are different for the other sagas and I think they would work quite well opening one box at a time."}]}