{"url":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/","title":"Low availability of LotR cards??","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481412","commentId":3481412,"userName":"Gandalf_","timestamp":1537782615,"content":"Hello all, \n\nI am trying to get back into the game but I can hardly find any stock in Europe in English (in particular saga boxes). I checked the shops in the US as well, but it appears they too have little stock (at least at the online shops). Will FFG reprint the cards, or will it abandon the older ones? Has this happened before in this game? \n\nCheers! \n\nEdited September 24, 2018 by Gandalf_"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481479","commentId":3481479,"userName":"dalestephenson","timestamp":1537790149,"content":"This has certainly happened before.  FFG regularly reprints expansions, but with so many expansions there's a substantial wait between any given pack going OOS and a reprint going available.  But there's absolutely no sign that any old expansions are to be abandoned.\n\nAccording to FFG's upcoming status, as of 9-6-18 reprints of the Khazad Dum Deluxe and Flame of the West saga expansions were \"on the boat\".  The expansions in the \"awaiting reprint\" that have been in the queue longest are Dwarrowdelf APs and saga expansions, so I'd expect those to be reprinted next."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481529","commentId":3481529,"userName":"Gandalf_","timestamp":1537794095,"content":"Thanks for the confirmation. Sounds good!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481597","commentId":3481597,"userName":"Finch204","timestamp":1537797472,"content":"I have been looking to buy The Black Riders saga expansion for months now. I haven't seen it in stock at my local game store for months. So I just take to buying what is available at the time I am there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481712","commentId":3481712,"userName":"GILLIES291","timestamp":1537803047,"content":"Been looking for the Dwarrodelf cycle and it seems they are sold out across the western world haha. I did luck out with a black riders though so there's something."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481729","commentId":3481729,"userName":"Finch204","timestamp":1537803528,"content":"> 5 minutes ago, GILLIES291 said:\n> \n> Been looking for the Dwarrodelf cycle and it seems they are sold out across the western world haha. I did luck out with a black riders though so there's something.\n\nLucky you! Aside from The Black Riders, I am also looking for the early Dwarrowdelf APs so I can get Elrond's twin sons. No luck so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481733","commentId":3481733,"userName":"GILLIES291","timestamp":1537803736,"content":"Thanks it was in a small shop that doesn't sell online and had a nice coat of dust on it, so I guess it helps to do the old fashioned way and call around/go to stores when the usual online staples fail."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3481965","commentId":3481965,"userName":"Wandalf the Gizzard","timestamp":1537811604,"content":"You can usually find good prices for out of print packs on BGG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3482423","commentId":3482423,"userName":"Gandalf_","timestamp":1537831431,"content":"> 9 hours ago, Finch204 said:\n> \n> I have been looking to buy The Black Riders saga expansion for months now. I haven't seen it in stock at my local game store for months. So I just take to buying what is available at the time I am there.\n\nBlack Riders is nowhere to be found. I am trying to collect all the saga expansions and this one is the rarest to find so far. \n\nEdited September 24, 2018 by Gandalf_"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3483083","commentId":3483083,"userName":"Crusaderlord","timestamp":1537889420,"content":"From my UK experience, once they do a cycle reprint and ship it over, you cant wait too long before buying it.\n\nI think the long gaps between availability means people are queued up to buy and so stock quickly goes - i myself have bought a few various packs over the last couple of months, and resisted getting Flight of the Stormcaller at the time as there seemed to be a lot around, then went to look this week and its out everywhere. So i would just buy as much as you can afford once a reprint is done as it may be a while before you get the chance again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3483156","commentId":3483156,"userName":"JonG","timestamp":1537892943,"content":"> 55 minutes ago, Crusaderlord said:\n> \n> From my UK experience, once they do a cycle reprint and ship it over, you cant wait too long before buying it.\n> \n> I think the long gaps between availability means people are queued up to buy and so stock quickly goes - i myself have bought a few various packs over the last couple of months, and resisted getting Flight of the Stormcaller at the time as there seemed to be a lot around, then went to look this week and its out everywhere. So i would just buy as much as you can afford once a reprint is done as it may be a while before you get the chance again.\n\nTotally agree. A lot of stuff was reprinted earlier this year, and I see big chunks of it have now gone. Having said that though, Games Lore has loads of LoTR LCG stuff so you can always find something. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3484016","commentId":3484016,"userName":"Crusaderlord","timestamp":1537950514,"content":"Yes there is always something you can get - the problem is when you want specific cycle packs. The good news is that the very fact it keeps selling out suggests the game is still doing really well and hopefully will mean reprints and content keeps coming.\n\nThe day FFG says that is it now will spark a massive need to buy up anything you are missing - as you may never get the chance again. I have made this mistake with Battlelore 2nd edition and probably will never get some of those expansions now. I am so deep into LOTR LCG now that i probably will have to get everything in the end (i can probably resist all the nightmare packs though). However at the moment i am still selectively buying from cycles where i like the look of a quest.\n\nMy Lord of the Rings Webpage [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3484524","commentId":3484524,"userName":"Wandalf the Gizzard","timestamp":1537981834,"content":"> 8 hours ago, Crusaderlord said:\n> \n> I have made this mistake with Battlelore 2nd edition and probably will never get some of those expansions now.\n\nThey really just flatlined that game for Runewars, didn't they."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3484843","commentId":3484843,"userName":"JonG","timestamp":1537993530,"content":"> 11 hours ago, Crusaderlord said:\n> \n> However at the moment i am still selectively buying from cycles where i like the look of a quest.\n> \n> My Lord of the Rings Webpage [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/] \n\nI've just had a read of your webpage. Here's my 0.2p:\n\n1 - I can't argue with Khazad Dum being number 1. My memory of successfully completing that cycle is still one of my all time highlights of the game.\n\n2 - I haven't yet played Rhovanion so can't comment on that one.\n\n3 - I think that the core sets which you've put in at number 3 will slip - Conflict at the Carrock is a fun classic but the others were designed early in the games' history and you can tell. \n\n4 - Can't disagree with number 4. Not easy, but an involving and fun story. \n\n5 - I've played the haradrim deluxe and definitely enjoyed them. Not sure I'd put this at number 5 as it was in many ways a return to a simpler format.\n\n6 - Not yet tried - I'm saving it for this winter when I aim to play the whole saga\n\n7 - C'mon really? Dreamchaser at no. 7? This has to be one of the most inventive and immersive cycles out there. Super story and super quests. The ship APs are a tad fiddly but not excessively so. Try it again!\n\n8 - Not yet tried\n\n9 - Not easy but I've just gone through this cycle again and it's really super. Great story which links in well with the books' appendices. It dips slightly in the middle but the early and final APs are great. The Stewards Fear in particular is a classic which must must MUST be purchased!\n\n10 - Maybe slightly harsh. I don't remember finding this cycle over fiddly. The story probably isn't as strong as some of the others. \n\n11 - Totally agree about the Hobbits. I abandoned the first box out of frustration and haven't gone back to it. \n\nMy response would probably be:\n\n1. Dwarrowdelf\n\n2. Dreamchaser\n\n3. Angmar Awakened\n\n4. Heirs of Numenor\n\n5. Ringmaker\n\n6. Haradrim\n\n7. Shadows of Mirkwood\n\n8. Hobbits\n\nRest - not yet played. By the way if you're interested in the standalones, here's my mini review on each:\n\n- Fog on the Barrow Downs - good but fiddly to set up and play\n- Murder in the Prancing Pony - crime story that is very different from any others. As a result it's a bit marmite I think. Good to get because it's like nothing else.\n- Battle of Lake Town. Seriously difficult - rated a 9 for difficulty I believe. Boost your tactics cards to beat this one.\n- Massing at Osgiliath. Difficult scenario with some brutal encounter cards. Still worth buying though.\n- The Old Forest. Straightforward to play and not too difficult. I enjoyed it. Worth getting.\n- Ruins of Belegost. Old fashioned Dungeon crawl with treasure. Can be swingy and slightly luck dependent as its easier if you get the right treasure at the right time. You'll need good decks for this one.\n- Stone of Erech. In many people's top ten best AP's. Very thematic, not too challenging or fiddly to play. Buy.\n- Siege of Annuminas. Another difficult but fun scenario. You'll need lots of progress tokens if playing solo.\n- Attack on Dol Guldur. Not yet played.\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3484892","commentId":3484892,"userName":"Wandalf the Gizzard","timestamp":1537995230,"content":"I think Shadows of Mirkwood has some fun, underplayed quests. Nightmare mode fixes the ones that become too easy. However, the nature of most of those quests require a small degree of tech, so I couldn’t just pull one out for a pick-up game. I still break them out for a spin or two everynow and then."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3485391","commentId":3485391,"userName":"Crusaderlord","timestamp":1538038415,"content":"Thanks JonG i enjoyed reading your post. I agree with your assessments as well, my order is very fluid and i change it often when i re-try scenarios, my blog is just some helpful pointers really. Just to elaborate my thoughts a little... i was inspired to re-write the blog page a little too .\n\nMirkwood - is higher from me than expected i think because i really love Mirkwood and spiders as a theme and also i really like Journey along the Anduin - these two quests lift the cycle when included in the assessment and i agree the cycle itself is not the greatest but then i do actually really like playing Rhosgobel, Emyn Muir and Return to Mirkwood. It also gains extra marks as a game newcomer probably needs to go here early on to get cards for future cycles.\n\nDreamchaser - this is my marmite set  as i am not particularly interested in the sailing theme, it does not really 'float my boat' hence i have not really bought many of the cycle packs yet. That said i did quite enjoy Voyage of Belegaer as a different experience, and I want to get Flight of the Stormcaller but cannot find it at a reasonable price. Then we have the island explorations which are some of my most favourite quests in the game. This set could easily jump up given time as i have not really explored the sailing ones properly, and on reflection may move above Haradrim in the long run.\n\nHeirs of Numenor - is not really ranked yet as i am just about to start playing it - Stewards Fear is on my list but is not in stock in most places.\n\nVoice of Isengard - i still do not really take to the deluxe box itself, the quests just lack interest to me although Fords of Isen is ok. I just do not like the time mechanic much, i suppose i do not like being penalised for taking time to build my board. The cycle is better though with Tharbad, Three Trials and Nin-In-Eilph all good ones.\n\n I have Belegost which is soooo hard to solo but after i tweaked the rules its one of my favourites. I have just bought Massing at Osgiliath when i finally found one at a reasonable price and will likely play this weekend so we will see. The others, i want Stone of Erech, Fog on Barrow Downs and Old Forest but at minimum £25+ for each pack in the UK it is hard to get them at the moment. I keep looking though for a bargain, and the rest of the stand alone's i may never get and i do not feel overly excited by them - we will have to see.\n\nWhat i do find is that i can go back to some quests and find i like them much more than i thought so nothing is definitive. I do not know if you saw my other individual quest list blog page which has many more thoughts about the quests i like to solo play ...\n\nMy Favourite LOTR Individual Quests [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/]\n\nEdited September 27, 2018 by Crusaderlord\nspelling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3485771","commentId":3485771,"userName":"JonG","timestamp":1538063881,"content":"> 6 hours ago, Crusaderlord said:\n> \n> Thanks JonG i enjoyed reading your post. I agree with your assessments as well, my order is very fluid and i change it often when i re-try scenarios, my blog is just some helpful pointers really. Just to elaborate my thoughts a little... i was inspired to re-write the blog page a little too .\n> \n> Mirkwood - is higher from me than expected i think because i really love Mirkwood and spiders as a theme and also i really like Journey along the Anduin - these two quests lift the cycle when included in the assessment and i agree the cycle itself is not the greatest but then i do actually really like playing Rhosgobel, Emyn Muir and Return to Mirkwood. It also gains extra marks as a game newcomer probably needs to go here early on to get cards for future cycles.\n> \n> Dreamchaser - this is my marmite set  as i am not particularly interested in the sailing theme, it does not really 'float my boat' hence i have not really bought many of the cycle packs yet. That said i did quite enjoy Voyage of Belegaer as a different experience, and I want to get Flight of the Stormcaller but cannot find it at a reasonable price. Then we have the island explorations which are some of my most favourite quests in the game. This set could easily jump up given time as i have not really explored the sailing ones properly, and on reflection may move above Haradrim in the long run.\n> \n> Heirs of Numenor - is not really ranked yet as i am just about to start playing it - Stewards Fear is on my list but is not in stock in most places.\n> \n> Voice of Isengard - i still do not really take to the deluxe box itself, the quests just lack interest to me although Fords of Isen is ok. I just do not like the time mechanic much, i suppose i do not like being penalised for taking time to build my board. The cycle is better though with Tharbad, Three Trials and Nin-In-Eilph all good ones.\n> \n>  I have Belegost which is soooo hard to solo but after i tweaked the rules its one of my favourites. I have just bought Massing at Osgiliath when i finally found one at a reasonable price and will likely play this weekend so we will see. The others, i want Stone of Erech, Fog on Barrow Downs and Old Forest but at minimum £25+ for each pack in the UK it is hard to get them at the moment. I keep looking though for a bargain, and the rest of the stand alone's i may never get and i do not feel overly excited by them - we will have to see.\n> \n> What i do find is that i can go back to some quests and find i like them much more than i thought so nothing is definitive. I do not know if you saw my other individual quest list blog page which has many more thoughts about the quests i like to solo play ...\n> \n> My Favourite LOTR Individual Quests [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/]\n\nJourney Down the Anduin is indeed a classic which I've played more than 50 times! I keep a nightmare version of it permanently set up.\n\nHeirs of Numenor is good, but really tough (bring your A-game and I always think that you need a second core by that one). Assault on Osgiliath has one or two hand killing cards which some player find frustrating but most of the other scenarios are pretty good. \n\nLooking at your scenarios page; here are mine:\n\nDwarrowdelf - Shadow and Flame was tough and took quite a few tries to beat, but it was great when I finally did so - IMO its probably still the best climax end scenario. I also have fond memories of the Long Dark and Foundations of Stone\n\nDreamchaser - yup totally agree with you regarding Temple of the Deceived and Drowned Ruins. I enjoyed them all though, and City of Corsairs is a fine climax scenario. \n\nAngmar Awakened - I really enjoyed the Dread Realm final scenario. I also enjoyed across the Ettenmoors. Carn Dum was tough!\n\nHeirs of Numenor - Stewards Fear is brilliant and is a must-buy. Blood of Gondor and Morgul Vale were fab as well. I found Druadan Forest and Amon Din a little slow actually, but you could argue that's needed as its a tough set overall. \n\nRingmaker - Thematically this cycle is weaker than some of the others so I see what you mean. However I did enjoy the Dunland Trap, Trouble in Tharbad, and Celebrimbor's Secret. I didn't mind the time mechanic as I try to create decks that have a fast impact. \n\nShadows of Mirkwood - Journey Down the Anduin and Conflict at the Carrock were my two memorable scenarios here. Try playing Return to Mirkwood with Lore Aragorn and a threat reduction deck. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3485870","commentId":3485870,"userName":"Thaeggan","timestamp":1538068451,"content":"> On 9/24/2018 at 2:50 AM, Gandalf_ said:\n> \n> Will FFG reprint the cards, or will it abandon the older ones?\n\nFFG does reprint for the LoTR: LCG, but as far as I can tell, they are terrible at supplying the demand. Long periods between reprints only to go out of stock. I've even seen the Core Set go out of stock which is very strange imo.\n\nI've been waiting for Dwarrowdelf reprints for a year coming up next month. Wooooo.... I check every day out of habit, a habit I would like to break because I can't crawl into bed without checking first.\n\nEdited September 27, 2018 by Thaeggan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3488661","commentId":3488661,"userName":"Crusaderlord","timestamp":1538382457,"content":"Managed to play a lot of Heirs of Numenor box this weekend and came away a little disappointed initially.\n\nIt seemed to me at least that these quests solo are for more specific player deck designs rather than something you can play around with. Peril in Pelargir i never even got through stage 1 once, let alone complete the quest - this has the most annoying shadow effects ever and was frankly an unenjoyable quest, everything i do not like about a quest design to be honest - it feels like it is just there to frustrate you at every turn.\n\nThankfully into Ithilien was better and i liked the rangers support idea. I did not win this either until a day or two later, but tweaking my deck and getting some ranger help was successful eventually and the theme makes me want to play it. Reading forums suggest tactics decks are the way to go. I am still not a fan where you have to go to very specific decks to be able to survive.\n\nHopefully the cycle will eventually improve my thoughts of this series, but the deluxe box itself is only ranking just above the hobbits at the moment. It may just be my current mindset and hopefully it will grow on me a bit more over time.\n\nLord of the Rings Webpage [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/] \n\nEdited October 1, 2018 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3490928","commentId":3490928,"userName":"Crusaderlord","timestamp":1538568030,"content":"Back on topic - i went looking for a couple of packs this week and was soundly surprised by how low the UK stock actually is - i could not find Steward's Fear, Thing in the Depths or Dread Realm anywhere unless i forked out over twice the price and Flight of the Stormcaller was also hard to find, and all my missing saga boxes not available either.\n\nIt has to be said that with the launch of the digital version i would have expected a print run and stock to be high to pick up the demand from those who try the game and then wanting the physical experience.\n\nFFG miss a trick in my book by stocking up so slowly. Not much is even in their latest printing runs either - very sad, and a long wait ahead for me i feel, i made a big mistake holding off buying all in one bulk order two or three months ago !\n\nEdited October 3, 2018 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283362-low-availability-of-lotr-cards/?do=findComment&comment=3491029","commentId":3491029,"userName":"Ywingscum","timestamp":1538574842,"content":"My store has NEVER received a copy of Mountain of Fire. Just an example of low stock"}]}