{"url":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/","title":"Game Difficulty Level or Mistakes?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491842","commentId":3491842,"userName":"Seawhale","timestamp":1538604830,"content":"\n\nSo, I partly bought this game because the difficulty level was apparently quite high. After 3 games, with homemade decks, I'm left wondering if the difficulty level is much lower than people seem to claim.\n\nWe've played the mirkwood scenario (Core set) twice to get the hang of the game. Then we played the Anduin scenario. These 3 games were with the premade decks (Leadership and Spirit).\n\nAfter that, my wife made a deck (Legolas, Eowyn and Dunhere) and I made a deck (Gloin, Theodred and Beravor).\n\nWe played Aunduin 2 times and the last scenario of the core set once. While the game were hard, we definitely haven't been crushed yet. I have quite a bit of deck-building experience and I helped my wife with her deck. However, I've read that the Anduin scenario is apparently super hard, didn't seem too hard to me.\n\nSo, are we likely playing something wrong (We did play with decks of 35 cards since we only have 1 core and it seems boring to make a deck where you have to include almost all available cards...), or do others with extensive deck-building experience also find the game relatively easy (It's still difficult, but no where near the crushing difficulty I expected from reading other people's posts)?\n\nI'm also a little bit worried that more cards will make the scenarios extremely easy. If we don't struggle much with 1 core set, what will it be with 3 full expansion sets?\n\nThoughts?\n\nEdited October 3, 2018 by Seawhale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491863","commentId":3491863,"userName":"icabod","timestamp":1538606026,"content":"I'm not qualified to talk about future quests as I only have the Core set and the Mirkwood cycle (the first 6 Adventure Packs), and certainly they are tricky when played Solo (which is how I play).  It took me a few goes to just beat the first quest in solo on easy mode.\n\nCo-operative play is I understand easier in the early quests, although I believe some later quests punish group-play - just having to draw more encounter cards can be a killer.\n\nIt's true that luck-of-the-draw can greatly affect a game like this, and a well-built deck is a game-changer.  However, if you think it seems too easy, I would suggest checking the rules - I'm not suggesting you're playing it wrong, but it can be a complex game, and it's easy for a new player to miss a simple step - which can make a big difference.  When I started playing on \"normal\" mode, I kept forgetting to deal shadow cards, for example.  I've also forgotten about threat increases in a few rounds (*cough*).\n\nSome possible areas you could be getting wrong (purely hypothesising, but it's the sort of thing that can easily be missed)...\n\n * Make sure you're dealing one encounter card per player per round (so two cards).\n * Are you sure you're paying for cards only with resources from your own hero of the same sphere? One of your decks has heroes from 3 different spheres, meaning that on the first round you can only buy 1-cost cards.\n\nYes, more player cards will make the early scenarios easier, and some of the early cards are considered over-powered, but later quests will challenge you in different ways, so getting additional packs would be worthwhile.\n\n \n\nNot sure that really helps much.  I'm not a great player myself :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited October 3, 2018 by icabod\nAdded some possible common errors when playing"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491895","commentId":3491895,"userName":"dalestephenson","timestamp":1538608293,"content":"Journey Down the Anduin tends to be super hard for new players, but it's not *objectively* super hard.  The user rating for it at the LOTR is 5.3, putting it in the lower half of quests for difficulty.  Escape from Dol Goldur *is* rated harder, but still has 14 quests (some print-on-demand) ahead of it.\n\nMore to the point, *both* quests are easier two-handed than single handed, Escape from Dol Goldur in particular being *much* easier.  So it's not impossible that you have no rules errors and are still doing well.\n\nAs you get more cards, you'll also be making 50 card decks.  While the core has duds, it also has a lot of very strong cards, and at just 35 cards per deck the small size of the deck helps your efficiency.  Getting more expansions but filling out to 50 cards won't *necessarily* make your decks stronger at all, but it will give you a much wider variety of decks to build.\n\nIt's also worth noting that especially in the first cycle the encounter cards are very uneven, so the difficulty can vary *wildly* depending on what comes out of the deck and what gets discarded as shadow cards.  With just two games against Journey Down the Anduin and one against Escape From Dol Goldur, it's also quite possible that the encounter deck happened to be kind to you.\n\nIf you're worried about a rule mistake, try to write up a run and give details.  We should be able to pick up on any inadvertant rule errors.\n\nAnd finally, if you're just a natural and regular quests are too easy for you, the publishers publish \"Nightmare\" versions of their quests.  Pick one of those up for a core quest and give it a whirl, it may satisfy your desire for difficulty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491901","commentId":3491901,"userName":"Seawhale","timestamp":1538608526,"content":"Well, that was awful, ended up double or triple posting and canceling all of them.\n\nIcabod: it's super helpful, the \"common play\" mistake a lot! Fortunately I haven't been doing any of those things!\n \n\n> Quote\n> \n> It's also worth noting that especially in the first cycle the encounter cards are very uneven, so the difficulty can vary *wildly* depending on what comes out of the deck and what gets discarded as shadow cards.  With just two games against Journey Down the Anduin and one against Escape From Dol Goldur, it's also quite possible that the encounter deck happened to be kind to you.﻿﻿\n\nDefinitely noticed that! Some of the cards are pretty brutal and I always feel good when they are discarded for no effect as shadow cards. The deck size also helps, but isn't much of a difference from a 50 cards deck with 3 cores.\n\nI'll put a question here, because I'm not to sure:\nAre \"reveal effects\" still triggered if the card was handed as a shadow card? I definitely wasn't playing like that!\n\nThanks for the replies, and sorry for the multiple posts.\n\nEdited October 3, 2018 by Seawhale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491902","commentId":3491902,"userName":"Seawhale","timestamp":1538608527,"content":"Arg... Double post\n\n \n\nEdited October 3, 2018 by Seawhale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491910","commentId":3491910,"userName":"dalestephenson","timestamp":1538609398,"content":"Reveal effects aren't triggered if the card isn't revealed, either because it was a shadow or because it was added to the staging area (some encounter cards/quest cards direct you to do this)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3491983","commentId":3491983,"userName":"GrandSpleen","timestamp":1538614579,"content":"Most people who come to the game find it to be fairly challenging, but there have been notable members of the community who repeatedly describe the game as \"too easy.\" As dale mentioned, we do have Nightmare packs to solve that problem now, although that means a much heftier investment $$ if you plan to get those for every expansion that you buy.\n\nPeople with a competitive card game background will find the game to be much easier than do people who do not have that background.  Many, many players start the game and expect not to need to deckbuild very often.  Frustration results.  Since you are comfortable deckbuilding, you are participating in the \"meta game\" already, while it takes other players a good amount of game exposure before they really start participating in that aspect of the game, I think.  For many long-term players, waaaay more of the game is spent in designing/thinking about decks than is actually spent playing the game on the table."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492105","commentId":3492105,"userName":"player1683311","timestamp":1538629131,"content":"Often in the community people find after playing an exceedingly tough scenario (by reputation) that they found easy, often it is the case they are making a mistake in the rules.\n\nThere is a lot to remember in the game and it can be easy to miss rules that make the game much easier. Of course it is possible you got all the rules correct. \n\nCouple easy things to forget\n\n-If you do not send anyone to the quest, that phase still happens and you just take a big threat hit. \n\n-undefended attacks must be taken by heroes\n\n-if your blocking ally is discarded or takes damage due to a shadow the attack is now undefended and no new blocker can be declared \n\n-there is no action window in staging so you can't untap someone with unexpected courage to avoid necromancers reach.  \n\n-The location that says you must discard a card to travel there cannot be traveled to if your hand is empty, this philosophy extends to many quests and cards\n\nSometimes taking 10 minutes and watching a run through of journey down the andiun on YouTube can clear up a lot of questions or confirm you are playing correctly\n\n \n\nWelcome to the game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492107","commentId":3492107,"userName":"player1683311","timestamp":1538629286,"content":"How did you block the hill troll out of curiosity?  And how did you kill him?  That is the part that makes that quest memorable to players, because having to face him first or second round was tough depending on what heroes and starting threat you have"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492109","commentId":3492109,"userName":"player1683311","timestamp":1538629331,"content":"Passage through Kirkwood is really easy in my opinion"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492136","commentId":3492136,"userName":"Seawhale","timestamp":1538632810,"content":"> Quote\n> \n> People with a competitive card game background will find the game to be much easier than do people who do not have that background. \n\nI've played a lot of competitive card games (LCGs and CCGs), I play a lot of L5R lately, and never ranked below top 4 (Tournaments are pretty small with roughly 12 players though). So if the average player of LOTR LCG is not an avid competitive card game player, that could explain the discrepancy.  I started LOTR LCG because it's impossible to get the wife to play games with \"meta-games\", I've thought that building the decks together might make her enjoy the process more. I have so much experience at card games in generals that she struggles if it's competitive. She's been liking the nature of this one, especially making decks together that work well together. Our current deck see her avoiding engaging enemies as much as possible. She use Dunhere to kill them in the staging area, or Legolas to clear my engaged enemies.\n\n \n\n> Quote\n> \n> -If you do not send anyone to the quest, that phase still happens and you just take a big threat hit. \n> \n> -undefended attacks must be taken by heroes\n> \n> -if your blocking ally is discarded or takes damage due to a shadow the a﻿ttack is now undefended and no new blocker can be declared \n> \n> -there is no action window in staging so you can't untap someone ﻿wit﻿h unexpe﻿cted courage to avoid necromancers reach.  \n> \n> -The location that says you must discard a card to travel there cannot be traveled to if yo﻿ur hand is empty, this philosophy ex﻿tends to many quests and cards\n\n\nOne mistake I made on there, so thank you. Didn't know that if you don't block an attack the damage goes on a hero. I defend the vast majority of my attacks, but it might still make a small difference.\n \n\n> Quote\n> \n> How did you block the hill troll out of curiosity?  And how did you kill him?\n\n\nThe obvious solution to beat the hill troll to me was low threat, to buy some turns (To make sure I get the cards I need), a \"Feint\" and a \"Forest Snare\" later he was not much of an issue anymore (apart from keeping us from travelling to the next quest, but I've found that it helps to build a strong board before you move on to the second step of the quest, so I don't really care about the delay). Once I have a good board, it's just a matter of a \"For Gondor\", \"Gandalf\", or something else to finish him off.\n\nMy Deck is Gloin, Theodred and Belavor: Lots of resource acceleration, healing for Gloin and Belavor so we don't run out of cards.\nMy Wife plays Eowyn, Legolas and Dunhere: Lots of reactive events and obviously max Lorien Scout and Northern Rangers.\n \n\nEdited October 4, 2018 by Seawhale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492174","commentId":3492174,"userName":"Gandalf_","timestamp":1538638691,"content":"> 2 hours ago, player1683311 said:\n> \n> How did you block the hill troll out of curiosity?  And how did you kill him?  That is the part that makes that quest memorable to players, because having to face him first or second round was tough depending on what heroes and starting threat you have\n\nAlso the enemy that deals damage to you from the staging area but you cannot engage him unless there are no enemies in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492217","commentId":3492217,"userName":"Rouxxor","timestamp":1538644641,"content":"> 3 hours ago, Seawhale said:\n> \n> The obvious solution to beat the hill troll to me was low threat, to buy some turns (To make sure I get the cards I need), a \"Feint\" and a \"Forest Snare\" later he was not much of an issue anymore (apart from keeping us from travelling to the next quest, but I've found that it helps to build a strong board before you move on to the second step of the quest, so I don't really care about the delay). Once I have a good board, it's just a matter of a \"For Gondor\", \"Gandalf\", or something else to finish him off.﻿\n> \n> \n> My Deck is Gloin, Theodred and Belavor: Lots of resource acceleration, healing for Gloin and Belavor so we don't run out of cards.\n> My Wife plays Eowyn, Legolas and Dunhere: Lots of reactive events and obviously max Lorien Scout and Northern Rangers.\n\nSo you handled it like a professional LOTR player ;). The first scenario of the game is only supposed to be an initiation. It is potentially the easiest scenario of the whole game. Journey from Anduin have an easy path to victory that you perfectly follow: being able to stay under the view of the troll long enough to develop yourself.\n\nIf you try the third scenario (escape from Dul Guldur) you will face a very hard scenario. Huge restriction (one ally per turn for the group, one hero is captive). It will probably require from you several try to bypass it ;).\n\nAs a competitive player (MTG) myself I get to the LOTR with some facility also myself. It become harder on the moment:\n- I try some solo, who is most difficult than 2 player on 90% of the scenario, sometime in a very brutal way;\n- When I arrive on the cycle 3, the first two cycle don't offer that much challenge, except may be for return to mirkwood and shadow and flame;\n- When I start to play nightmare. It remove the easiest enounter cards to replace them with really hard encounter cards. It can totally change a scenario.\n\nIt is also a game where you decide by yourself how to manage your challenge. For example I don't build my deck against a specific scenario. I try to have decks supposed to be played against any scenario without the single change. It is on the same time faster to begin a game and make the game more difficult. And recreate on me the same feeling as competitive game where you don't know by advance what your opponent play, but when the game begin you know really fast any card he must be playing be knowing well enough the metagame.\n\nIf you combine some of those it bring to very funny things: it make me 2 years to beat nightmare Escape from Dol Guldur and I'm still unable to find anyone with a deck that win more than 10 of the time on this scenario ^^.\n\nIf you are afraid that the game is to easy and may be not for you take it cool: you still have room to challenge yourself. May be it is better to not follow the common buy order and go to specific quest though. I haven't doing so because I'm playing since the beginning of the game and buying all the product the day it come out. But you can give it a try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492220","commentId":3492220,"userName":"monkeyrama","timestamp":1538644745,"content":"> 11 hours ago, Seawhale said:\n> \n> So, are we likely playing something wrong (We did play with decks of 35 cards since we only have 1 core and it seems boring to make a deck where you have to include almost all available cards...), or do others with extensive deck-building experience also find the game relatively easy (It's still difficult, but no where near the crushing difficulty I expected from reading other people's posts)?\n>  \n\nPrior experience with deck-building and competitive games makes a huge difference with LOTR, and the core is tricky, but manageable or even easy if you know the tricks to the quests, but the 35 card decks are going to be a huge help right now because they are so much more consistent than 50 card decks. Added to that, the core has some of the best cards in the game, and I recall the early decks I built could be really quite punchy because of this. Going up to 50 cards makes it harder to get the key combos out, although this can be mitigated. What Rouxxor says is true also: the game is challenging depending on how you choose to play it. Escape from Dol Guldur solo with core set only is *hard*. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492246","commentId":3492246,"userName":"Rouxxor","timestamp":1538649294,"content":"I agree with Seawhale about this: a 35-card deck with only one core set is an approximate level of a 50-card deck with three core set. I will even probably choose the 50-deck since the probability of drawing a good card with 3/50 is higher than with 2/35 and a 3/50 is so better than 1/35. No key card is already in 3x in the core set anyway.\n\nEdited October 4, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492368","commentId":3492368,"userName":"Wandalf the Gizzard","timestamp":1538660951,"content":"The game is much easier for me, and most diehard fans of the game, than what you would hear from the casual gamer dipping their toes in the water. That said, most players have struggles with their first several games, especially against that second quest, before \"getting it.\" As for Anduin's reputation of super hard comes mostly from new players who aren't prepared for the basic strategy necessary for the game, and that scenario. Of course, you said you have experience with games like this.\n\nI don't think the thirty-five card decks make much of a difference. The quests, more or less, get progressively harder, so don't worry about power creep with new player cards. Now, I'd say the best players of this game have a win percentage between sixty or seventy ( @Rouxxor [https://community.fantasyflightgames.com/profile/308704-rouxxor/] , @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/] feel free to weigh in). If you continue to breeze through quests, it's likely you may be missing something important. I'd recommend checking out a gameplay video to see if you are playing correctly.\n\nShort answer:\n\n> 15 hours ago, Seawhale said:\n> \n> So, are we likely playing something wrong (We did play with decks of 35 cards since we only have 1 core and it seems boring to make a deck where you have to include almost all available cards...), or do others with extensive deck-building experience also find the game relatively easy (It's still difficult, but no where near the crushing difficulty I expected from reading other people's posts)?﻿\n\nThe first is quite possible and the second is true."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492377","commentId":3492377,"userName":"Wandalf the Gizzard","timestamp":1538661310,"content":"> 7 hours ago, Seawhale said:\n> \n> The obvious solution to beat the hill troll to me was low threat, to buy some turns (To make sure I get the cards I need), a \"Feint\" and a \"Forest Snare\" later he was not much of an issue anymore (apart from keeping us from travelling to the next quest, but I've found that it helps to build a strong board before you move on to the second step of the quest, so I don't really care about the delay). Once I have a good board, it's just a matter of a \"For Gondor\", \"Gandalf\", or something else to finish him off.\n\nAhhhh . . . the force is strong with this one. You have learned well. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] Honestly it feels satisfying to see the game click for someone this early."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492396","commentId":3492396,"userName":"Stewart777","timestamp":1538662557,"content":"Isn't it part of the rules that you have to have a 50 card deck?\n\nI mean if you want to play a casual game with how ever many cards you want, that is fine. But to say that you actually won a game, surely you have to follow the rules? Not trying to be Mr Nit-pick or anything, just wondering out loud :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I ask because I haven't read through the rules yet as my LGS is still getting back to me on when I can order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492402","commentId":3492402,"userName":"Seawhale","timestamp":1538662859,"content":"> Quote\n> \n> I mean if you want to play a casual game with how ever many cards you want, that is fine. But to say that you actually won a game, surely you have to follow the rules? Not trying to be Mr Nit-pick or anything, just wondering out loud  I ask because I haven't read through the rules yet as ﻿my LGS is still getting﻿ back to me on when I can﻿ order.\n\nMy thought here was exactly the same as Rouxxor and I think any competitive player would see that a 50 cards deck with 3 of, is more consistent than a 35 card deck with 1 of the power cards...\n\nI only have 1 Unexpected Courage. I only have 2 Steward of Gondor, 2 sneak attack etc. With 35 cards I still have a lower odd of drawing the best cards compared to 3 core sets and 50 cards. Sure, I'll move to 50 cards at some point, but I'm not sure I want 3 cores. I'll have too see the power level of the non-core cards to see if I want multiples of the cores or not.\n\nFinally, I am a deck builder. I love deckbuilding, but let's be frank, deckbuilding sound really boring if your only choice is which 10 cards out of 60 not to include in your deck. The core, unfortunately does not have enough card for a 50 card deck.\n\n \n\n> Quote\n> \n> Also the enemy that deals damage to you from the staging area but you cannot engage him unless there are no enemies in the staging area.\n\nDunhere can kill that Goblin Sniper really easily. (Unless we played that wrong?)\n\nEdited October 4, 2018 by Seawhale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492421","commentId":3492421,"userName":"monkeyrama","timestamp":1538664361,"content":"> 4 hours ago, Rouxxor said:\n> \n> I agree with Seawhale about this: a 35-card deck with only one core set is an approximate level of a 50-card deck with three core set. I will even probably choose the 50-deck since the probability of drawing a good card with 3/50 is higher than with 2/35 and a 3/50 is so better than 1/35. No key card is already in 3x in the core set anyway.\n\nAh, forgot that some cards are really quite limited in the core. Post-errata some of the really silly core cards are also much less potent, so I can see the point here. Fair enough.\n\nI do remember, way back in the mists of time, beating all the quests in the core with the pre-made, monosphere decks. Although Escape was hard, especially solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492441","commentId":3492441,"userName":"Wandalf the Gizzard","timestamp":1538665760,"content":"> 50 minutes ago, Stewart777 said:\n> \n> Isn't it part of the rules that you have to have a 50 card deck?\n> \n> I mean if you want to play a casual game with how ever many cards you want, that is fine. But to say that you actually won a game, surely you have to follow the rules? Not trying to be Mr Nit-pick or anything, just wondering out loud :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] I ask because I haven't read through the rules yet as my LGS is still getting back to me on when I can order.\n\nFifty cards is the minimum for Tournament legal decks. Of course, this game has none, so the rule only applies to Gen Con and Fellowship Events. Outside of that, most player still usually use fifty cards in their decks, but it's completely normal to run thirty with just a core set and a couple of expansions.\n\n> 47 minutes ago, Seawhale said:\n> \n> Dunhere can kill that Goblin Sniper really easily. (Unless we played that wrong?)﻿\n\nYou played it right. Dunhere is good tech for this quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492716","commentId":3492716,"userName":"dalestephenson","timestamp":1538677682,"content":"I agree that an optimal 35-card deck from a single core is comparable to an optimal 50-card deck from three cores.  It's true that for 1x cards that the 50-card deck would have a higher proportion in their deck, but with the exception of Unexpected Courage I'm not sure I'd use three copies of any of the 1x cards anyways.  Most core staples are 2x cards, and 2/35 and 3/50 are essentially identical.\n\nOn the other hand, if you're finding the core set too easy with a 35-card deck, increasing the deck size is an obvious way to increase the difficulty level."},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3492939","commentId":3492939,"userName":"spoonman2084","timestamp":1538688232,"content":"You did make the core easier for yourself by playing 35 card decks for sure. Probability on single cards is one thing but including suboptimal 15 additional cards will start to cause you game loses for sure but that was obvious to you it seems. \n\nPlaying with these suboptimal cards will give you an appreciation for their use in the future though.\n\ni used to play mtg a bunch too and in booster drafts you often are stuck with suboptimal cards and you just deal with it to get a legal deck.\n\nSometimes those suboptimal cards allow for amazing synergy with others and combos are born.  Getting experience with the whole card pool is fun...but so is winning. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/283936-game-difficulty-level-or-mistakes/?do=findComment&comment=3493558","commentId":3493558,"userName":"Finch204","timestamp":1538746018,"content":"My fondest memory of Journey through the Anduin was having two Goblin Snipers in the staging area just before I managed to dispatch the hill troll. My deck had no way of dealing with them and I lost that one. There was also this one time when I was already engaged with a Hill Troll, then the encounter deck revealed a card with Surge and revealed another Hill Troll. That was fun LOL.\n\nThe game was hard for me when I was a new player because I kept making mistakes when playing. In my opinion, this game has too many phases/rules and it can be confusing for a newbie. For awhile I was making the mistake of counting the threat of enemies already engaged, instead of just those in the staging area. I remember thinking then, what the ****, this game is impossible to beat haha."}]}