{"url":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/","title":"Miruvor discard and top of Owner&#039;s/Controller&#039;s Deck, possible (unintentional?) change through (new?) Rules Reference?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/?do=findComment&comment=3494709","commentId":3494709,"userName":"DrPeterEnis","timestamp":1538864978,"content":" \n\nHello, a quick (or now that i look at it probably not that quick...) question that came up, in one of my last games...\n\nWhen Miruvor is attached to another than it's Owner's Heros, and it's Controller decides to return it to the top of the deck, which deck does it go to?\n\nI searched for a thread here and found a pretty old answer (citing an ancient official ruling):\n\n> Quote\n> \n> When resolving Miruvor's ability, the Golden Rule will supersede the Ownership rule. For example, if Player A attaches Miruvor to Player B's hero and Player B chooses the option \"put Miruvor on the top of your deck\" then Player B player will put Miruvor on top of his deck.\n> Regards,\n> Caleb\n\nHowever (as was pointed out to me by the other player), the Rules Reference (which I am pretty sure is newer than Caleb's ruling, at least the wording of the rules quoted in the thread are quite different) reads:\n\n> Quote\n> \n> If a card that has changed control leaves play, after\n> the resolution of the game occurrence that drives\n> it from play, the card is physically placed in its\n> owner’s equivalent out of play area (hand, deck, or\n> discard pile). Other card abilities cannot interact\n> with this secondary physical placement.\n\nIf i read this correctly, this would mean that Miruvor is placed in \"it's owner's equivalent out of play area\" (deck in this case). Since other card abilities cannot interact with this, Miruvor's text is ignored/altered. \n\nWhile the Rules Reference reads\n\n> Quote\n> \n> The Golden Rules:\n> \n> ...\n> \n> \"If the ability text of a card directly contradicts the text\n> of either the Rules Reference Guide or the Learn to\n> Play book, the text of the card takes precedence.\"\n\nThe paragraph\n\n> Quote\n> \n> \"Other card abilities cannot interact\n> with this secondary physical placement\"\n\n \n\nobviously (imo) has to supercede \"The Golden Rules\" because otherwise: \n\n \n\na) That paragraph would be nonsensical  (other card abilities cannot influence  but any and all card abilites would effectively be overwriting it)\n\nand\n\nb) That paragraph would never be relevant and might as well not exist (as standard procedure without card effects already is cards going back to it's owner.)\n\n \n\nDo you agree with me? Is this an (unintended?) Change of the (new?) Rules Reference? Am i missing something? Does Miruvor go the the top of the owner's deck or is it shuffled in?\n\n \n\nYour thoughts?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/?do=findComment&comment=3495665","commentId":3495665,"userName":"Wandalf the Gizzard","timestamp":1539007289,"content":"> On 10/6/2018 at 6:29 PM, DrPeterEnis said:\n> \n> Is this an (unintended?) Change of the (new?) Rules Reference? Am i missing something? Does Miruvor go the the top of the owner's deck or is it shuffled in?\n\nIs your question where Miruvor would go or what the proper reading of the rules is? Yes the Golden Rules is in contradiction to this:\n\n> On 10/6/2018 at 6:29 PM, DrPeterEnis said:\n> \n> \"Other card abilities cannot interact\n> with this secondary physical placement\"\n\nIt makes sense to me is that Miruvor would go back to the owner's deck, not the new controller."},{"commentUrl":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/?do=findComment&comment=3495813","commentId":3495813,"userName":"Rouxxor","timestamp":1539013852,"content":"I agree with you: Miruvor goes in top of it owner's deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/?do=findComment&comment=3495859","commentId":3495859,"userName":"DrPeterEnis","timestamp":1539015979,"content":"> 2 hours ago, Wandalf the Gizzard said:\n> \n> Is your question where Miruvor would go or what the proper reading of the rules is? Yes the Golden Rules is in contradiction to this:﻿\n\nBoth actually ^^. As mentioned in the first post, there is an official (though not in the FAQ) ruling from Caleb Grace, that Golden Rule(s) apply here and Miruvor is put on the top of the Controllers (whoever that might be) deck.\n\nHowever it quotes the Control and Ownership paragraph of the \"old\" Rulebook which reads:\n\n> Quote\n> \n> ...\n> \n> Any time a card leaves play, it reverts to it's owner's hand, deck, or discard pile (as directed by the effect forcing the card out of play).\n\n \n\nThe current, new(er) Rules Reference Document reads:\n\n> Quote\n> \n> If a card that has changed control leaves play, after\n> the resolution of the game occurrence that drives\n> it from play, the card is physically placed in its\n> owner’s equivalent out of play area (hand, deck, or\n> discard pile). Other card abilities cannot interact\n> with this secondary physical placement.﻿\n\n \n\nIn my interpretation of these rules, the Rules Reference Document changed (probably unintentionally) how this specific interaction works (as mentioned before i find ruling that if the Golden Rule  would overwrite this paragraph it would be made absurd) . I just wanted to ask if other people also think that way (and it's not just me interpreting the rules that way because that is how i want to read them ^^).\n\nAs a sidenote, i found/find the (old) ruling pretty questionable even with the old rules text. \n\n \n\nThank you for your input!\n\nEdited October 8, 2018 by DrPeterEnis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284088-miruvor-discard-and-top-of-ownerscontrollers-deck-possible-unintentional-change-through-new-rules-reference/?do=findComment&comment=3495900","commentId":3495900,"userName":"Wandalf the Gizzard","timestamp":1539018038,"content":"I would always go with the up-to-date ruling, FAQ, and Rules Reference + Learn to Play (which replaces the old single rulebook) over a previous ruling."}]}