{"url":"https://community.fantasyflightgames.com/topic/284193-saga-quests-and-playing-of-mono-sphere-cards/","title":"Saga Quests and playing of Mono-Sphere Cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/284193-saga-quests-and-playing-of-mono-sphere-cards/?do=findComment&comment=3496356","commentId":3496356,"userName":"DrPeterEnis","timestamp":1539042214,"content":" Some cards (Strenght of Arms in this example) have as restriction:\n\n> Quote\n> \n> Play only if each hero you control has a printed <Sphere> resource icon.\n\nDoes this mean that i cannot play this card in Saga-Quests while i'm currently controlling a hero of the Baggins/Fellowship Sphere? This seems rather odd, especially since \"Sphere affecting\" (for a lack of better word) cards like Navi's Belt etc. can not interact with the Saga only Spheres. \n\nHowever the text seems clear and i couldn't find any special allowances for the Saga Spheres.\n\nDid i miss it or are you indeed not allowed use Mono-Sphere cards in the Saga Quests (or at least not while you control a Saga Hero)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284193-saga-quests-and-playing-of-mono-sphere-cards/?do=findComment&comment=3496400","commentId":3496400,"userName":"Wandalf the Gizzard","timestamp":1539046561,"content":"Indeed you cannot play such cards in saga quests. However, I think almost everyone takes this by the spirit, not the letter of the law. Feel completely free to use them even with fellowship/baggins heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/284193-saga-quests-and-playing-of-mono-sphere-cards/?do=findComment&comment=3500880","commentId":3500880,"userName":"DrPeterEnis","timestamp":1539341851,"content":"Thanks for the answer, that's what i thought/feared...\n\n \n\nNot too sure i actually want to go with the \"spirit\" of the rules, as i also have no qualms exploiting encounter cards if the rules permit..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/284193-saga-quests-and-playing-of-mono-sphere-cards/?do=findComment&comment=3500986","commentId":3500986,"userName":"dalestephenson","timestamp":1539350319,"content":"Fortunately there aren't a lot of cards affected by this restriction:  Strength of Arms, Advance Warning, Trained for War, Against the Shadow, Lord of Morthond (technically playable, but not useful), and Knight of Minas Tirith's response.  Of the four events, Strength of Arms is the only one I've ever bothered with in an actual monosphere deck.  Thicket of Spheres, Reinforcements, and Shadows Give Way aren't affected by having a baggins/fellowship hero."}]}