{"url":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/","title":"Just...just (sigh) REPRINT!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3500202","commentId":3500202,"userName":"Tyrion Gru","timestamp":1539288624,"content":"I want to voice what I believe is a common idea among many players of this fantastic game:\n\nPlease re-print the products that have been unavailable for so darn long!\n\nI understand the arguments, and they are all valid. However, there is a large and dedicated community that is anxious to GIVE YOU MONEY for product you have already developed and produced. I see many post on this forum telling stories of frustration over the lack of earlier Sagas, APs, etc. and hints that they may quit the game because of the slow release of older product.  I hear on various podcasts the veteran voices lamenting the newer player's frustration to get cards that are vital to decks they wish to build. I find myself annoyed that cards to \"perfect\" my deck simply are not available.\n\nOf course, the panacea that \"hey, they eventually reprint everything\" is valid, but some of this stuff has been OOP for quite some many months. For a sure-fire seller, that is just bad business.\n\nThere are many out there that feel the same, I'm sure. Perhaps the powers that be need to hear our frustration. Perhaps these powers would like to respond directly. But from a single dedicated, loyal player, I just want to ask:\n\nPlease, just reprint some of these things. I have money waiting to throw at you.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3500311","commentId":3500311,"userName":"Gandalf_","timestamp":1539293079,"content":"Agreed. The only way you can get some saga expansions right now, like the Black Riders, is by spending 100+ dollars on ebay. And that's a used copy even... \n\nOn that note, I have the feeling that the next reprint run will come in the new flimsy boxes though like every other new LCG right now. \n\nEdited October 11, 2018 by Gandalf_"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3500396","commentId":3500396,"userName":"bdavis96","timestamp":1539295822,"content":"I am there with ya.  I have all the Saga Expansions because my initial idea was to just collect and play those.  As I figured out how good the card pool was, now I want to fill in with everything else.  I really want to see the Dwarrowdelf and Ring-maker cycle reprinted because those sets seem to be hard to come by unless you are willing to shell out $40+. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3500770","commentId":3500770,"userName":"Stewart777","timestamp":1539325754,"content":"For those who don't know and don't have it, Kazad-dum is available again on FFG site for order!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3500838","commentId":3500838,"userName":"Crusaderlord","timestamp":1539335839,"content":"i would be pretty upset if they change the deluxe boxes to a new style - i am a bit OCD about having a matching set of boxes on my shelf. Thankfully i do have all the cycle deluxe boxes released so far as i managed to fill some gaps this year. I do not imagine the plastic packaged ones will change but the saga ones would be a concern.\n\nI do think FFG should be more open about their release schedules - this is a collectable game and we should be advised if re-prints are / are not happening or if boxes are changing - it is an integral part of planning what to buy and when.\n\nEdited October 12, 2018 by Crusaderlord"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3501043","commentId":3501043,"userName":"Gandalf_","timestamp":1539353108,"content":"It would also hit my OCD right in the middle, if I had to add a flimsy carton box between the rest of deluxe and saga expansions. Go find some Arkham Horror LCG unboxings on youtube. L5R and GoT have the same boxes. They look like they will fall apart during shipping alone. \n\nEdited October 12, 2018 by Gandalf_"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3501051","commentId":3501051,"userName":"TheGuardian118","timestamp":1539353442,"content":"> 16 hours ago, Gandalf_ said:\n> \n> Agreed. The only way you can get some saga expansions right now, like the Black Riders, is by spending 100+ dollars on ebay. And that's a used copy even... \n\nNot entirely true, one of my local stores had a few copies of Black Riders last time I was in there. One doesn't though so it's definitely limited."},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3501105","commentId":3501105,"userName":"stimpaksam","timestamp":1539354806,"content":"> 8 hours ago, Stewart777 said:\n> \n> For those who don't know and don't have it, Kazad-dum is available again on FFG site for order!\n\nWhat's weird is this is like the 2nd or 3rd time Khazad-dum has been reprinted in the last year while the Dwarrowdelf cycle has remained out of stock. Did they lose the original prints to those cards or something?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3501331","commentId":3501331,"userName":"Wandalf the Gizzard","timestamp":1539362150,"content":"> 2 hours ago, stimpaksam said:\n> \n> What's weird is this is like the 2nd or 3rd time Khazad-dum has been reprinted in the last year while the Dwarrowdelf cycle has remained out of stock. Did they lose the original prints to those cards or something?\n\nShoutout to Hall of Beorn! FFG owes you. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/284376-justjust-sigh-reprint/?do=findComment&comment=3501707","commentId":3501707,"userName":"Seawhale","timestamp":1539373664,"content":"I can confirm that this has kept me away from a lot of FFG games in the past. I bit the bullet and bought into this one anyways, but it is has a serious impact on my willingness to get involved in any FFG product.\n\nBefore getting into any of FFG's games, I look at the availability on the website. Faced with the possibility of playing with a half complete experience, I prefer to avoid getting into a game.\n\nThis is the only FFG game I got into after release. Any other game, I just avoid like the pest if some expansions are out of stock.\n\n "}]}