{"url":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/","title":"[Many storyline spoilers] What happens with the Roam Across Rhovanion story?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3513247","commentId":3513247,"userName":"Rouxxor","timestamp":1540388600,"content":"I always find that LoTR developer have made a great deal of producing an interesting story, depicting many situations, environment and making us think about the geopolitical and sociological situations in the middle earth. The top have been achieve, to me, with the cycle 4 where we were destabilize a region just because we think we have an important thing to do. And even that important thing was a fake since we serve Saruman goal all along. We ended serving in a war willingly and we weren't good anymore, even if no one say it since we were in the winner side.\n\nBut let's go closer to our timeline. We just meet back to back two humans place allies to Mordor (Umbar and Harad) and see how Sauron and his allies enforce people to join his rank. How he manipulate them and make them believe we use brutal methods. It is not anymore because they are evil, but part because of territorial issues and because of misunderstanding, lies and hatred. We still get to gain allies among them. Interesting and less black and white than most LoTR stories I have read.\n\nAnd then arrive the cycle 8. The main thing is a dragon story. Okay. But at the end of the first AP a goblin come to see us. He may have been trapped inside the cave we were in, but since he was undetected he could have wait and escape later easily. So he definitively come in peace to speak. There is a discussion between them and the goblin offer to help them. The heroes react saying no hurt will be doing to the goblin. A small term alliance between humans and goblin seem an interesting thing to read. I'm totally in!\n\nAnd then: First thing we do in the next AP: we tie it. Remember the \"no hurt\" part? Totally gone. They (we, the supposed heroes) are threatening him to kill it. The goblin swear to give us a key. The the quest arrive. Depending of the encounter cards you face Urdug may try to escape or not. But he deliver us the key. Then he try to leave with his friend. Seem logical since he is among violent people that have no consideration toward him. The story explain us Urdug betray the heroes, who kill the innocent troll and tie the goblin and continue to hurt and threatening him.\n\nWhat happens?!?! We were a bunch of people open minded who try to help the people. We turn into sanguinary sociopath who broke their words. And even worst: the narrator agree with the heroes by taking their languages: the traitor is the goblin, they are smart to anticipate the escape. We can clearly say that the writer see no problem on the situation. And that is the major difference with the previous dark situations.\n\nWhat happens? It will be hard to make me believe the same person write these two things. The part where there is no violence, and the heroes have doubts but still ensure they will no hurt the goblin is not the same kind of story that the brutal, disgusting scene we got. And there is no use of a story if you can't write it properly. Because it is not only the concern that it does not please me: it is also not coherent from one AP to another. I want you, FFG, to warn you that we notice that concern instantly. We (a french group that originally discuss it on our forum) all be very disappointed by this story! Be what is necessary to get to a decent story."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3513418","commentId":3513418,"userName":"Authraw","timestamp":1540395287,"content":"Yeah, my partner and I noticed this too. It was kinda heartbreaking reading how Urdug reacted to the heroes killing Tiny. I wish we had had the option to keep him alive somehow.\n\nThis particular narrative did feel like it would have fit better in one of the Shadow of Mordor games; the heroes were kinda brutal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3513643","commentId":3513643,"userName":"Wandalf the Gizzard","timestamp":1540406539,"content":"I do not have this pack so I cannot comment specifically. I will say that Middle Earth is not like our real, gray world. In middle earth, all orcs/trolls/goblins are written as evil by Tolkien. This is in contrast to life, where many things are not black and white. The heroes arguably were defending themselves and trying to fulfill their oath to the people of vanquishing the dragon.\n\nThat is not of course to say this makes inhumanity of this sort okay, or good wrighting; so I partly agree."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3513742","commentId":3513742,"userName":"dalestephenson","timestamp":1540410972,"content":"I agree with both sides -- the story insert has the heroes needlessly and unreasonably harsh, in contrast to the previous packs and cycles (though to be fair, it appears to be one hero in particular that is threatening the Goblin's life).\n\nAt the same time, Goblins and Trolls are irredeemably evil in Tolkien's mythos, so I would be unhappy if this cycle had somehow produced \"Good Goblins\" (which cannot exist in Tolkien's world) to go with the Good Haradrim and the singular good Corsair from the previous two cycles.  Since Goblins are sufficiently self-interested to work against other evil creatures, I don't think it breaks canon to cooperate with a goblin in accomplishing something of mutual interest, but a treacherous weapon is ever a danger to the hand and it is only *rational* for the heroes, if taking a Goblin with them, to want him secured against possible attack.  He endangers them when in their company -- and he endangers them if he's free.  Not just them -- an orc and troll released into the wild *will* kill or enslave any man, dwarf, or elf they feel able to.  If it had been a spawn of Ungoliant instead of a troll, would the heroes be justified in allowing it to escape if the alternative was slaying it?  I think we feel a sympathy towards irredeemable humanoids that we don't towards irredeemable non-humanoids.  If mere intelligence grants humanity, then the Spiders of Mirkwood are as entitled to it as the Goblins of Gundabad.\n\nWhat if Urdag had been human?  A lot depends on whether Urdag would be considered a fellow-traveller (in which case the heroes are behaving criminally) or an enemy combatant who has been captured (in which case binding is to be *expected* and isn't remotely harming, and violence to prevent escape is perfectly allowable).  I need to re-read the flavor text in both packs before making a judgement.\n\nIt also may depend somewhat on which heroes.  This storyline traces all the way back to Dreamchaser, where the heroes impress Na'asiyah with their mercy.  On the other hand, Na'asiyah is still with them, and I think she'd be *totally* on board with threatening prisoners with throat slitting, at least if it's effective.  She's got decades of \"bad cop\" experience.  Of course they may have swapped out heroes along the way.  We know from canon that Beorn had a harsh attitude towards orc/warg prisoners who gave him valuable information, his descendant Grimbeorn (the hero from the previous pack) may well have similar views.  I wouldn't expect Elladan or Elrohir to threaten orcish prisoners -- there would be no prisoners."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3513871","commentId":3513871,"userName":"Bullroarer Took","timestamp":1540415195,"content":"As long as we’re griping about Roam, I really don’t like that they haven’t posted an official word about which encounter sets to use.  The card set on the insert is different from the card set on the quest cards.  Reportedly Caleb told players at the Con of the Rings that the insert was right and the quest cards wrong, but if I weren’t so closely plugged in to the community I wouldn’t know this.  The announcement article was posted after Con of the Rings so ANA had every opportunity to clarify the error, but instead they chose to make another."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3514212","commentId":3514212,"userName":"player1683311","timestamp":1540447049,"content":"Huh, I hadn't even looked at the insert for set up. I always use the quest cards for that, since there were no special rules I didn't scrutinize it. \n\nBasically I would not have gotten swarmed with trolls, but now it would be even more brutal for threating out. \n\n \n\nI played almost 20 games of it, good luck changing my perception of the quest haha!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3514378","commentId":3514378,"userName":"Wandalf the Gizzard","timestamp":1540472106,"content":"Good points, @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/].\n\n> 16 hours ago, dalestephenson said:\n> \n> to go with the Good Haradrim and the singular good Corsair from the previous two cycles.\n\nThese are completely in the realm of possibility, though; and I'm glad FFG went with this route."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285075-many-storyline-spoilers-what-happens-with-the-roam-across-rhovanion-story/?do=findComment&comment=3514498","commentId":3514498,"userName":"Bullroarer Took","timestamp":1540478682,"content":"I’ve now played the quest and agree with those who say that is the biggest enemy.  I beat it pretty handily finishing at about 40 threat, but I was playing Noldor mill and was Councilled by Elrond at least eight times!  So I think this one asks for a specific build from the player(s) and isn’t too bad if you do that.  If you don’t..."}]}