{"url":"https://community.fantasyflightgames.com/topic/285195-craft-remedy-blanking-text-box/","title":"Craft Remedy - blanking text box","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285195-craft-remedy-blanking-text-box/?do=findComment&comment=3516160","commentId":3516160,"userName":"Boromore","timestamp":1540595800,"content":"Hi. Playing Crossing of Poros, at one stage I drew the encounter side quest \"Craft Remedy\" (SH53) - \"Treat the printed box of each damaged character as if it were blank...\". At first, I planned to bypass it, as I had a Gandalf ally (actually the UHOH 10 version) in play, with one wound, so could keep him on the board without the threat raise (albeit reduced to one action a round). But Craft Remedy plays havoc with self-harming Ents like Quickbeam or Derndingle Warrior. \n\nSo, how should I resolve a self-harming action like Quickbeam's? (\"Response: After QB enters play, deal 1 damage to him to ready him\"). Does the passive effect from Craft Remedy cut in half-way through the response, and nullify it? If I then heal Quickbeam, can I then complete the response? Similarly with Derndingle Warrior."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285195-craft-remedy-blanking-text-box/?do=findComment&comment=3516319","commentId":3516319,"userName":"GrandSpleen","timestamp":1540620329,"content":"You can still resolve the effect.  Quickbeam enters play, you trigger his response, and at that point, consider the entire effect to be queued up or in process or whatever -- it has left the confines of \"text box\" and it is now an effect being resolved.  Quickbeam's text box will indeed be blanked out \"halfway through\" resolution of the effect, but you can continue to resolve it (same for Derndingle Warrior).  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285195-craft-remedy-blanking-text-box/?do=findComment&comment=3516480","commentId":3516480,"userName":"PocketWraith","timestamp":1540650273,"content":"But obviously in the case of the Derndingle Warrior this means you can only use the ability once."}]}