{"url":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/","title":"Solo League 3 -- Against the Shadow cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3521673","commentId":3521673,"userName":"dalestephenson","timestamp":1541107968,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Heirs of Numenor and the Against the Shadow cycle. The quests are:\n\n1) Into Ithilien (Deluxe)\n2) The Steward's Fear (AP1)\n3) The Druadan Forest (AP2)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests -- this means you must have one of Tactics Beregond, Leadership Boromir, Hirluin the Fair, and Mirlonde.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Into Ithilien and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing The Steward's Fear it does not matter how many tokens I needed to defeat Into Ithilien.\n\n4) You are not required to publish your deck, but you are required to reveal which Heroes you used, and how many cards in your deck came from outside Heirs/AtS cycle and a single core. When breaking ties, the first tiebreaker is number of outside cards used (less is better), the second tiebreaker is number of heroes outside the cycle (less is better), third tiebreaker is number of heroes outside the boxes with the three quests (less is better). Fourth tiebreaker is how well the player performed in the previous month's league, if not in the previous month's league treated as a median performance.\n\n5) 1st place gets to choose the cycle for January's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. Last place gets to choose a single player card outside that cycle (may be a hero) that will be counted as an honorary cycle member and may be used without counting for the tiebreaker. December's cycle has not yet been chosen by Rouxxor.\n\n6) Weekly deadlines will be on Monday at 11pm Eastern, but only the final deadline really matters for scoring -- the first two deadlines are only to be included in standings.\nInto Ithilien: November 12th\nThe Steward's Fear: November 19th\nThe Druadan Forest: November 26th\n\n7) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/11X4Wf9eUBjNtPGkwzXLw6skA-F4Vy8-4B4a8AjKW0uk/edit?usp=sharing [https://docs.google.com/spreadsheets/d/11X4Wf9eUBjNtPGkwzXLw6skA-F4Vy8-4B4a8AjKW0uk/edit?usp=sharing]\n\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. You may give a link to your deck, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself.\n\nEdited November 1, 2018 by dalestephenson\nfix link"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522074","commentId":3522074,"userName":"Rouxxor","timestamp":1541152624,"content":"Only you can write on your google doc so we can't add our names ;). That let me a little time to think about what I want to play...\n\nEdited November 2, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522098","commentId":3522098,"userName":"dalestephenson","timestamp":1541157310,"content":"Should be fixed now, sorry about that.  Did you decide what cycle to choose for December?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522125","commentId":3522125,"userName":"Rouxxor","timestamp":1541160877,"content":"Yes. Like I said previous month I choose ANgmar Awakned. It is even more true since it only challenger could have been Against the shadow, the actual cycle ^^.\n\nDruadan forest in solo is one of the easiest quest of the game. Into ithlien and steward fear are way more challenging though, I will have to think about what can I achieve :).\n\nI understand that changing rules every time is annoying but does recent results make you reconsider the deckbuilding rules? I know it wasn't your only decision, it was a poll, but we have so many people who defeat it with 0 valor and 0 tiebreakers, and I personally beat it 3 times in a row without any loss. So with those new datas may be the polls would have been different. So imagine we have this kind of situation again do you want to make another poll session?\n\nI also find that having 2 scenario choose at random is not satisfying. Why make someone choose a scenario that will not be played? It could be better to make everyone  (2nd, 3rd and last) choose for a scenario to be played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522126","commentId":3522126,"userName":"Yepesnopes","timestamp":1541160961,"content":"Thanks Dale for putting this up!\n\n \n\nI am going to try a first run with my You shall not pass! [https://www.ringsdb.com/deck/view/56185] solo deck and see if I can go nightmare against these three quests. It has 41 cards outside the cycle... ?\n\nI may give it a second run with an Outlands deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522127","commentId":3522127,"userName":"Miceldars","timestamp":1541161180,"content":"I want to try, but I only played each scenario 1 time in 2 player game, and in easy mode. It won't be easy for me"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522140","commentId":3522140,"userName":"dalestephenson","timestamp":1541162475,"content":"With enough help from the Valar, anyone can beat a quest!  In the first cycle, I did a run with a mono-tactics Eagle decks against the three willpower-loving quests, and managed to defeat all three with a cumulative token count of 74.  I'm not *recommending* bringing a bad deck to the league, but with enough help you *will* beat these quests.\n\nThis month I'm using my previously published Stereotypical Outlands Deck:\n\nhttps://ringsdb.com/decklist/view/9192/a-stereotypical-outlands-deck-1.0 [https://ringsdb.com/decklist/view/9192/a-stereotypical-outlands-deck-1.0]\n\nI don't imagine it'll get zero tokens, but I don't think it will need *too* much help from the Valar to succeed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522160","commentId":3522160,"userName":"Miceldars","timestamp":1541163604,"content":"Challenge accepted ! I'll try to defeat these quests with less than 74 tokens !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522177","commentId":3522177,"userName":"dalestephenson","timestamp":1541164988,"content":"> 47 minutes ago, Rouxxor said:\n> \n> I understand that changing rules every time is annoying but does recent results make you reconsider the deckbuilding rules? I know it wasn't your only decision, it was a poll, but we have so many people who defeat it with 0 valor and 0 tiebreakers, and I personally beat it 3 times in a row without any loss. So with those new datas may be the polls would have been different. So imagine we have this kind of situation again do you want to make another poll session?\n> \n> I also find that having 2 scenario choose at random is not satisfying. Why make someone choose a scenario that will not be played? It could be better to make everyone  (2nd, 3rd and last) choose for a scenario to be played.\n\nI'd like to see how November/December leagues turn out before having another rules discussion thread -- I doubt they'll both have the top three with zero tokens, so we should have some better information.  Of course, I didn't think the September league would make it through with zero tokens, even with outside cards, so I could be wrong again.\n\nThe October league did make me wonder about the tiebreaker, not just because the top three were all perfect on tiebreakers, but because the early finish by perfect decks left no hope of anyone possibly doing better, and that might have discouraged some from either trying the league or finishing once they earned a token.  But honestly I'd rather have perfect scores broken randomly than treat the official scoring system as if it were a good thing.\n\nThe rewards were modeled on the Legendary league, but I like differentiating rewards at each level.  Of course, whether it's better to pick a quest or to avoid a quest depends on your point of view.  For a given cycle, do you feel more strongly about the quest you like the most, or the quest you hate the most?  Frankly, for September's league I'm glad I finished third instead of second, just to make sure I didn't have to play Morgul Vale again. But randomly varying the quests gives a chance for each quest to actually be played, and every hero a chance to be on the short mandatory hero list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522178","commentId":3522178,"userName":"PigsAreOurEquals","timestamp":1541165048,"content":"I will stick on the deckbuilding challenge of no outside of cycle+core cards. In practice this will mean outlands as well for me.\n\nI already pass for Druadan forest since I don't have that pack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522187","commentId":3522187,"userName":"Rouxxor","timestamp":1541165698,"content":"@dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] Ok. Let's go with this rules and see on December if we want to adjust some things for january. About the tiebreaker you can make another one tiebreaker for playing the most cards inside the current cycles, it would be half the way between what I ask before and what is actually done. This will probably broke the ties, so for once it earn his name :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\n@PigsAreOurEquals [https://community.fantasyflightgames.com/profile/261563-pigsareourequals/] To me if you win the other two with no tokens you will win the challenge as well, since Druadan forest is 10 times more easy ^^.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522188","commentId":3522188,"userName":"dalestephenson","timestamp":1541165727,"content":"> 1 hour ago, Yepesnopes said:\n> \n> Thanks Dale for putting this up!\n> \n>  \n> \n> I am going to try a first run with my You shall not pass! [https://www.ringsdb.com/deck/view/56185] solo deck and see if I can go nightmare against these three quests. It has 41 cards outside the cycle... ?\n> \n> I may give it a second run with an Outlands deck\n\nI've got to say I like the idea of playing with Thurindir, though.  Side quests can rock in Into Ithilien and Steward's Fear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522190","commentId":3522190,"userName":"dalestephenson","timestamp":1541165886,"content":"> 1 minute ago, Rouxxor said:\n> \n> @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] Ok. Let's go with this rules and see on December if we want to adjust some things for january. About the tiebreaker you can make another one tiebreaker for playing the most cards inside the current cycles, it would be half the way between what I ask before and what is actually done. This will probably broke the ties, so for once it earn his name :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png].\n\nRouxxor, I kind of like the idea of having in-cycle cards as the fourth tiebreaker and in-box cards (from selected quests) as the fifth tiebreaker.  But I doubt it will be necessary the next two months."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522352","commentId":3522352,"userName":"Miceldars","timestamp":1541174277,"content":"Question : in Into Ithillien, can we heal Celador (as he is in the staging area) ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522392","commentId":3522392,"userName":"Yepesnopes","timestamp":1541176143,"content":"> 30 minutes ago, Miceldars said:\n> \n> Question : in Into Ithillien, can we heal Celador (as he is in the staging area) ?\n\nIt depends on wich card you want to use; Warden of Healing, for example, can heal him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522426","commentId":3522426,"userName":"Wandalf the Gizzard","timestamp":1541177864,"content":"> 59 minutes ago, Miceldars said:\n> \n> Question : in Into Ithillien, can we heal Celador (as he is in the staging area) ?\n\nYes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522463","commentId":3522463,"userName":"Miceldars","timestamp":1541179318,"content":"Into Ithillien is very hard... I tried at least 10 times, losing a hero on turn 1, 2 or 3... The last time I lost on the very last turn before victory because I reach 50 threat because of a treachery with doomed 3... It was with 3 token, I will play with 4 next time (but another day)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522524","commentId":3522524,"userName":"Dralnu","timestamp":1541181865,"content":"> 37 minutes ago, Miceldars said:\n> \n> Into Ithillien is very hard... I tried at least 10 times, losing a hero on turn 1, 2 or 3... The last time I lost on the very last turn before victory because I reach 50 threat because of a treachery with doomed 3... It was with 3 token, I will play with 4 next time (but another day)\n\nI'm still testing what I'm going to play, I haven't decided if I'll play some gondor-eagles deck, outlands deck or even something else.\n\nI agree with you that is really hard, i had to try 4 times before winning. On my first attemp I drew the mumakil on turn 2 and another harad band on turn 3...  Then I went into the Steward's fear and I got crushed with high threat locations. It's going to be really hard to build a deck this month."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522546","commentId":3522546,"userName":"dalestephenson","timestamp":1541183108,"content":"> 1 hour ago, Miceldars said:\n> \n> Into Ithillien is very hard... I tried at least 10 times, losing a hero on turn 1, 2 or 3... The last time I lost on the very last turn before victory because I reach 50 threat because of a treachery with doomed 3... It was with 3 token, I will play with 4 next time (but another day)\n\nI'm sure you realize this, but as a reminder, when you do your official run you *must* take at least one token every time you lose.  But if you're just practicing before your official run, use as many tokens as you like (or none at all)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3522547","commentId":3522547,"userName":"Miceldars","timestamp":1541183222,"content":"Yes I remember. I begin to count after 5-6 try, and add a token each time I lost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523085","commentId":3523085,"userName":"Zura","timestamp":1541241415,"content":"So i've already done into ithilien. I must admit that those valar tokens can make any quest a walk in the park. During my initial run i lost in second turn due to some wargs blocking the way with some Mumak sneaking right behind them but the second time with two valar tokens i had a start so explosive nothing could have stopped me. I'm pretty proud of the deck i've built for this cycle, it seems it can handle both battle-questing and willpower-questing pretty well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523366","commentId":3523366,"userName":"Authraw","timestamp":1541275684,"content":"Quick clarification: Core Set heroes do not count against you for the first tiebreaker, but they do count against you for the second one, correct? That is, Core heroes are considered to be outside the cycle, yes?\n\nBut heroes from the deluxe do count as being part of the cycle, right? So Beregond wouldn't count against me for the second tiebreaker, for instance.\n\nTrying to make sure I fully understand the tiebreakers. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited November 3, 2018 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523449","commentId":3523449,"userName":"dalestephenson","timestamp":1541285067,"content":"You have the tiebreakers correct.  For the first tiebreaker, core cards, cards from Heirs of Numenor, and cards from Against the Shadow do not count against you.  For the second tiebreaker, only heroes from Heirs of Numenor and Against the Shadow don't count against you -- core heroes do count against you.  For the third tiebreaker, any heroes except LeBoromir, TaBeregond, Hirluin, and Mirlonde count against you.  And at least one of those four heroes *must* be used.\n\nFor all regular \"cycles\", I consider the cycle to consist of the Deluxe plus all its APs.  I also consider the Hobbit Saga (two expansions and six quests) to be a separate cycle, and LOTR saga (six expansion, 18 quests) to be a separate cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523485","commentId":3523485,"userName":"Authraw","timestamp":1541290824,"content":"Got a nice free day so I decided to just knock out the solo league in one sitting. Deckbuilding for this one was much harder because I was trying to get a perfect score for the first two tiebreakers too, but I couldn't get the deck consistent enough without bringing in some more card draw.\n\nHere's a link to the deck:\n\nhttps://ringsdb.com/decklist/view/10272/november-solo-league-1.0 [https://ringsdb.com/decklist/view/10272/november-solo-league-1.0]\n\nIt's your standard Outlands fare, supported by Beravor [https://ringsdb.com/card/01012] so I have the card draw I need. Boromir [https://ringsdb.com/card/05002] is super useful during Battle questing, making all of those little Gondor Allies much more effective during the questing phase.\n\nI managed a perfect score this month, first try victory on all three quests!\n\nInto Ithilien\n\nI was actually aiming to keep Celador alive, but a few early game Spiders of Mordor forced me to chump block a few times, meaning I had to do the Siege questing instead. It turned out okay, though; after all, once it gets going, Outlands can handle any type of questing without trouble!\n\nI only saw one Blocking Wargs (on the second turn). If I had seen more, I might have had a tougher time of things.\n\nThe Steward's Fear\n\nThis one gave me the most trouble. At first, I couldn't get any Locations to show up, so I was just building up my Outlands army in relative peace. Both Beravor and Boromir ended up in Local Trouble, but that was okay--I didn't really need to use them any more.\n\nAt some point, however, I realized that I had made a critical error in playing down a few Knights of the Swan [https://ringsdb.com/card/06004] when I started to reveal copy after copy of A Knife in the Back and my beefy Outlands Allies started turning against me.\n\nAs soon as I went into Stage 2, I ended up with a huge surge train (there's those Locations I needed!) and the plot that reveals extra cards each round. I was able to stay ahead of the curve, but just barely. My Outlands army was looking worse for wear due to a few Zealous Traitors but my bigger concern was that I shuffled those Knife in the Back cards back into the encounter deck.\n\nIn the end, both Boromir and Beravor fell to A Knife in the Back, but the rest of the Outlands army was able to take down the Villain and bring the quest home.\n\nThe Drúadan Forest\n\nCompared to the first two, this one was really easy. I had a couple of Treacheries whiff early on, and on turn 2 I got down Henamarth Riversong [https://ringsdb.com/card/01060], which meant that I could easily prepare for whatever came off the encounter deck. At that point the game was pretty much over.\n\nThis was a fun challenge! Looking forward to seeing how others take it on.\n\nEdited November 5, 2018 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523649","commentId":3523649,"userName":"Rouxxor","timestamp":1541332450,"content":"Congratulations! Going first is the hardest part, since from now we can be inspired by your decklist and trying to improve it. I will playtest for a perfect three tiebreaker since it is the only achievement left.\n\nSteward Fear is really not a rush scenario. My advice would be to play only an ally if you know it will be useful. And do not reveal the plot unless you are sure you can win quite fast. The best case possible is already have the clue in play when you do so so you can finish the game in 2/3 turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523697","commentId":3523697,"userName":"Yepesnopes","timestamp":1541339889,"content":"I finished Into Ithilien nightmare with zero tokens. I have to say that I had the impression it was easier than in non nightmare mode. Are there more locations than in non-nightmare?.\n\nWith a Resourceful and Firyal in my opening hand, I could play her on the second round, which was crucial, as she avoided a Mumak to show off in round 2!! Thanks to Thurindir, in my first and second rounds, I quested against Gathering Information. I used Gathering Information to fetch Scout Ahead and bought myself a few more rounds. Thanks to Firyal, I kept discarding those enemies that I did not feel like facing. Glorfindel ended up riding Asfaloth, so those locations with big amount of quest poins were not an issue anymore.\n\nSeeing that the friends of Celador were not showing up (one showed up as a shadow card :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] ) and that my threat was rising (27), I decided to stop turtleing and run for the win. After stage 1 was cleared, I took control of Celador and with a board full of  ents, it took me one round to clear stage 3 and another round to clear stage 4, sneaking pass the big Mumakil Elite with the help of a few counsels from Elrond.\n\nI will now tackle The Stewards Fear. I don't think that one will be that easy. In any case, I know I won't be able to do a perfect run with this deck, as Steward of Gondor is totally a must for The Druadan Forest nightmare. I am curious to see how many Valar tokens do I need to pass that quest with my deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523768","commentId":3523768,"userName":"Miceldars","timestamp":1541351198,"content":"Finally, I won against Into Ithillien with... 10 tokens. The last 5-6 games, I was very unlucky on my starting hands (almost the same cards each time, and not the good one...)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523867","commentId":3523867,"userName":"Dralnu","timestamp":1541361834,"content":"> 19 hours ago, Authraw said:\n> \n> Got a nice free day...\n\nCongratulations! This month is much harder than october's.\n\nI am still testing decks with 0 cards from outside the cycle and I had a similar idea of putting in Beravor for the needed card draw, but instead of going with Hirluin and outlands, i was trying with Beregond and gondor allies. I can handle into ithilien pretty well, but is almost impossible to put enough willpower in the Steward's Fear. \nAs Rouxxor said, now I will keep playtesting trying to improve your deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3523951","commentId":3523951,"userName":"Kjeld","timestamp":1541369160,"content":"I completely forgot how brutal Into Ithilien can be. On my second turn, a Watcher in the Wood (threat up by 5) surged into a Blocking Wargs (bye-bye Envoy of Pelargir) surged into a Forest Bat. All of a sudden my willpower dropped from 13 to 8, I had 2 damage on Celedor, 3 on Boromir, and 2 on Hirluin (who'd taken an archery damage the first turn). I now had to engage Southron Company and the Bat. Southron Company gets an Overgrown Trail, so bye bye to the 5 progress I'd managed to accrue on the quest. Then Forest Bat gets a Haradrim Elite shadow, so attacks again getting a second Watcher in the Wood as shadow, so threat up by another 2. So, at the end of the second turn, I've got a combined total of 6 health left on my heroes and allies (just Celedor), I'm engaged with 2 nasty enemies, my threat has ballooned to 37 (soon to be 38), and I have zero progress on the quest. Cool.\n\nEDIT: Just in case it wasn't clear, I lost.\n\nEdited November 4, 2018 by Kjeld"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3525705","commentId":3525705,"userName":"Yepesnopes","timestamp":1541507422,"content":"I finished The Stewards Fear nightmare with zero tokens.\n\nNevertheless, this one was tougher. I needed three runs to get that score. On  my first run, I had a glorious starting hand were I played Resourceful on Mirlonde and Quickbeam. I quested with everything. The encounter deck had a nasty surprise... I revealed a Sewers which added and extra card from the underworld deck to the Fourth Star. I cleaned the location and under it, two Murderous Turncoats [http://hallofbeorn.com/LotR/Details/Murderous-Turncoat-TSFN] were waiting for me. With two immediate attacks of 5 from the staging area, two of my heroes were dead. That was the end of the first run.\n\nI did a second run with 1 Valar token (to start with 1 extra lore resource) which I won without sweating too much. With Two Resourceful, Gleowine and Asfaloth in my starting hand, and cleaning Gathering Information on the second round to summon Firyal, I had pretty much control all over the game. The Plot card I draw was Up in Flames [http://hallofbeorn.com/LotR/Details/Up-in-Flames-TSF], which I could counter act thanks to my Will of the West, which I had to fetch from the discard pile with a Dwarven tomb. On stage 3 I discovered the Hand of Castamir [http://hallofbeorn.com/LotR/Details/The-Hand-of-Castamir-TSF] who got boosted with one The cabal's champion [http://hallofbeorn.com/LotR/Details/The-Cabal%27s-Champion-TSFN]. Yet, he was not match for the ents and Glorfindel. After defeating the Hand, I quested hard with all my troop and beated the adventure. Full of confidence, I decided to try again with zero Valar tokens.\n\nThe third run was weird. My starting hand was plain bad. No Light of Valinor, no Resourceful and no Firyal. At least I had Quickbeam and Asfaloth, but that forced me to look for Light of Valinor upon completing Gathering Information. Without Firyal in play I felt \"naked\". Luckily, the encounter deck insisted on throwing only treacheries at me, which I kept cancelling relentlessly with an endless battery of A Test of Will and Halfling Bounders. I reached stage 2 and neither Firyal nor Treebeard have showed up yet, but I had 3 Wellinghall preservers in play! This time the plot I revealed was Assassination [http://hallofbeorn.com/LotR/Details/Assassination-TSFN], which is by far the easiest to deal with for my deck. Brave Mirlonde turned to be the target of the assassins. Finally, by the end of Stage 2, Firyal and Treebeard decided to appear! When I revealed stage 3, Telemnar's Bane [http://hallofbeorn.com/LotR/Details/Telemnar%27s-Bane-TSF] appeared. Without any boost, his attack was defended by a dutiful Galadhrim Minstrel to immediately by trampled  by the throng of ents.\n\n \n\nNow I have to face The Druadan Forest nightmare. Without Steward of Gondor i my deck, I wonder how many Valar tokens I will need to defeat the quest... my bet is 5 ?\n\n \n\nEdited November 6, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3525811","commentId":3525811,"userName":"dalestephenson","timestamp":1541516310,"content":"Yepesnopes, it looks to me like your score for that quest should be 2 tokens.  From the rules:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSince you lost the first time with 0 tokens, you can't play with 0 again.  Since you lost the second time with 1 token, you can't play with 1 token again.  So for your third run, you could not choose less than 2 tokens.  There's no requirement that you use the tokens, so you don't need to replay the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3525929","commentId":3525929,"userName":"Yepesnopes","timestamp":1541523460,"content":"> 2 hours ago, dalestephenson said:\n> \n> Yepesnopes, it looks to me like your score for that quest should be 2 tokens.  From the rules:\n> \n> Rule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\n> Rule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n> \n> Since you lost the first time with 0 tokens, you can't play with 0 again.  Since you lost the second time with 1 token, you can't play with 1 token again.  So for your third run, you could not choose less than 2 tokens.  There's no requirement that you use the tokens, so you don't need to replay the quest.\n\nI've lost the first time with zero tokes. Then I have beaten the quest with 1 token. Then I have replayed the quest with zero tokens and win.\n\nThat is zero tokens right? (I edited my post to clarify it)\n\nEdited November 6, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3525944","commentId":3525944,"userName":"dalestephenson","timestamp":1541524400,"content":"Sorry, I missed that you won with one token.  So your score is one token -- since you had already lost with zero tokens, you could not try that count again for the league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3526600","commentId":3526600,"userName":"Yepesnopes","timestamp":1541584172,"content":"> 16 hours ago, dalestephenson said:\n> \n> Sorry, I missed that you won with one token.  So your score is one token -- since you had already lost with zero tokens, you could not try that count again for the league.\n\nI corrected the spreadsheet. Thanks"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3526880","commentId":3526880,"userName":"Authraw","timestamp":1541609958,"content":"For what it's worth, I found those rules a little confusing when I first read them, too. I don't think part 2 is strictly necessary, is it? Is there anything wrong with playing again with more tokens than a previous win (other than it not improving your score)? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3526987","commentId":3526987,"userName":"dalestephenson","timestamp":1541615856,"content":"There's a possible interaction with Rule 1 without Rule 2, although it's unlikely to come up in practice.  Consider this sequence with only Rule 1.\n\n1) I play with 4 tokens, and lose.  I am now forbidden from replaying with 0-4 tokens.\n\n2) I play with 8 tokens, and win.\n\n3) Just for the heck of it, I play again with 12 tokens, and lose.  I am now forbidden from replaying with 0-12 tokens, so my score can never be lower than 8 even through I never tried with 5-7 tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3528745","commentId":3528745,"userName":"Yepesnopes","timestamp":1541760628,"content":"I finished The Druadan Forest nightmare. I bet (with myself ? ) that I would need 5 Valar tokens to pass the quest, but I only needed 2 :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nNo secret, just a lucky starting hand. On my third run I got a very lucky starting hand with Treebeard and Firyal.\n\nIn my first round I played those cards plus Gathering Information, which I was able to complete on my first round thanks to Elrond's Counsel. Resolving its effect I fetched Light of Valinor.\n\nAdditionally, on turn 3 I draw Scout Ahead, which after solving it, it gave me 5 turn of total control over the encounter deck. During those rounds I draw important cards such as Gleowine, Asfaloth, a Warden of Healing and a Wellinghall Preserver. That is all I needed to set my board and beat the adventure [https://postimg.cc/ftk4D3PP].\n\nLooking forward to play the next month challenge!\n\nEdited November 9, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3529588","commentId":3529588,"userName":"PigsAreOurEquals","timestamp":1541797654,"content":"I did the Into Ithilien today, first game went down hill quickly after failing to clear Ithilien Road. Second time I got a good opening hand and pushed through.\n\nEdited November 11, 2018 by PigsAreOurEquals\nCorrected typo's"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3532714","commentId":3532714,"userName":"Miceldars","timestamp":1542045434,"content":"I won the Druadan forest on my first try with 0 token \\o/. I'm a bit surprised, because when we had some trouble with my girlfriend when we did it the first times.\n\nSo I end my first solo league with 18 token"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3533702","commentId":3533702,"userName":"Rouxxor","timestamp":1542099277,"content":"> 14 hours ago, Miceldars said:\n> \n> I won the Druadan forest on my first try with 0 token \\o/. I'm a bit surprised, because when we had some trouble with my girlfriend when we did it the first times.\n> \n> So I end my first solo league with 18 token\n\nThe less player there is the easier is the forest Druadan\n- Master Yoda"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3533703","commentId":3533703,"userName":"Miceldars","timestamp":1542099527,"content":"Maybe. There is some scenario that don't scale well with the number of players. I don't remember what were the difficulties when we played it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3533794","commentId":3533794,"userName":"Rouxxor","timestamp":1542110736,"content":"To me it is one of the easiest scenario in solo and one of the hardiest at 4 players. You get spoiled of all resources and then get many surge, you can't play test of will (since you don't have any resources) and have to face archery 18. It is the example I give about scenario who change a lot depending on the number of players (especially since most of scenario scale in the other way: the more player the easier)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3534084","commentId":3534084,"userName":"dalestephenson","timestamp":1542127770,"content":"Standings through the first quest (outside cards in parens):\n\n0 Authraw (0)\n0 Velensk (18)\n0 Yepesnopes [nightmare] (41)\n1 PigsAreOurEquals (0)\n2 Zura (23)\n10 Miceldars (27)\n\nFor those who (like myself) didn't post a score in time, don't worry -- only the final deadline counts, and in the US there's a Thanksgiving holiday between then and now.  Of course, if you're traveling for Thanksgiving you may want to hurry it up a bit.\n\nOnly half the players managed to make it through Into Ithilien without tokens, this is a tougher quest than any of the ones we faced last month in Dreamchaser."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3535912","commentId":3535912,"userName":"PigsAreOurEquals","timestamp":1542231832,"content":"I took out some time to complete Steward's Fear this evening. A great quest but not nearly as punishing as Into Ithilien, but I also had a great opening hand with Steward and Henamarth Riversong.\n\nEdited November 15, 2018 by PigsAreOurEquals\nAdded some details"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3541687","commentId":3541687,"userName":"dalestephenson","timestamp":1542721806,"content":"Steward's Fear can always be tough, as a Knife in the Dark can ruin your whole day if it picks the wrong ally. Here's how we did against that quest (outside cards in parens):\n\n0 Authraw (0)\n0 PigsAreOurEquals (0)\n0 dalestephenson (5)\n1 yepesnopes [nightmare] (41)\n2 Velensk (18)\n8 Miceldars (27)\n\nSo here are the standings after the first two quests:\n\n0 Authraw (0)\n0 dalestephenson (5)\n1 PigsAreOurEquals (0)\n1 yepesnopes [nightmare] (41)\n2 Velensk (18)\n18 Miceldars (27)\n\nI got lucky; Knife in the back took out an errand rider instead of one of my Outlands army. Well, semi-lucky. Someone allowed our dog into my game room, she decided my outlands deck would make a great chew toy, and so my cards are severely battered. I'm afraid I will need to repurchase both Heirs of Numenor and The Steward's Fear.\n\nThere's still a week (and a Thanksgiving holiday before the final deadline, so it's not too late to catch up if you've signed up, or to sign up and beat all three quests if you haven't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3542079","commentId":3542079,"userName":"Rouxxor","timestamp":1542739204,"content":"I'm having trouble to get myself into playing this league. I can't find any appealing list with 3 heroes within the cycle, and I'm not really enthousiast about playing almost exactly the same deck with Beravor and trying to be first (thanks to the 4th tiebreaker). I will try to make a decision and play until the deadline though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3542095","commentId":3542095,"userName":"dalestephenson","timestamp":1542739887,"content":"Hang the tiebreakers and build a deck you want to play!  If you are focused on building a perfect-tiebreaker deck you'll be severely constrained on the deck you can build, so unless you think winning is more fun than playing, that may not be the best way to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3542292","commentId":3542292,"userName":"Rouxxor","timestamp":1542749424,"content":"I do play what I want, and it is never subject to the scenario choice made in the solo league. The whole point of the league is to constrained the deckbuild to find way that I don't play in other case. I want to constrained myself in such a manner that reward me if/when I win. In this case it is about winning the challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3542397","commentId":3542397,"userName":"dalestephenson","timestamp":1542755086,"content":"The whole point of the league is to have fun, which may take different forms for different people.  If someone wants to play variants on the killer deck each league and enjoys that, good for them -- if someone else wants to construct 0-outside-cards with all in-cycle heroes, that's great too.  If someone wants to handicap themselves by playing nightmare instead of regular, nothing wrong with that.\n\nThe past two leagues I've used the (eligible) stereotypical decks that use the least outside cards; I never played with my stereotypical decks before, so it was a good chance to see how they perform, and honestly they've done a lot better than I thought.  I was going to do it for the next league too, except that one of the quests is from the box with Hero Dori, and I'm a big Dori fan.  For some reason, none of the stereotypical decks use Dori....  Now I'm trying to decide whether to play TaEowyn/TaTheoden/Dori or LeAragorn/Arwen/Dori in next month's league.  Maybe I'll flip a coin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3546607","commentId":3546607,"userName":"Rouxxor","timestamp":1543172577,"content":"So I finally make a try. I just try to make a decent deck with only hero of the cycle and still wasn't satisfying so I get to the easy way: just play the Authraw deck. I found it balanced for what those quests ask.\n\nThen I want to play each quest one time for testing, and only if I win it play it for real right after (with all important details still in my mind). I start with Into Ithilien. I have to send no one o the quest so I can try to kill the enemy on turn one and have a clear place for the next turns. In the first game this do work, but then I got one Harad every turn and I wasn't able either to perform the quest or the fight correctly. I loose my second hero on the same time I go at 49 threat...\n\nI retry it and get two enemies who attack respectively at 5 and 8 on turn one. I could have won with a perfect hand. But I haven't anything like that.\n\nAt this moment I see no point at playing many games. I do know Into ithilien by hearth, especially the nightmare version, so I can do the real run, and start to get valor point since i have very few hope to win it straight.\nAnd I play. On turn one I reveal a location, get 5 threat but kill the enemy. Then some outlands join the board each turn, and I sucess at dealing with the enemies on the turn they arrive, or at least the following turns, usually by scarifying a small non outland ally for each block. I finally got to the end of my deck and got those many outlands hidden there. I was engaged with a Mumak and I just decide to rush to the win (not that I can't last a few turn more, but it was cheaper than dealing with the annoying enemies I can get. I take all the steps on one turn, no matter if they where battle or siege.\n\nThen steward fear. I just slowplay a LOT. Like exploring the active location only on turn 10 with a big boad already there. I loose many allies on treachery and enemies that deal 1 damage on each ally but succeed at protecting most of my outlands. I follow the advice found here and don't play my third knight of the swan because at this point I have enough attack, and it could only damage more my hero if I reveal the nasty treachery (that I already seen twice, but there wast still some in the encounter deck). I go to the stage 2 with the 2 clue already here. I have to reveal an additional card each turn because of the machination. I pass the stage 2 the following turn and kill the vilain on the same turn. And defeat the stage 3 two turns later, because of the treachery who end the questing phase.\n\nLike I planned Druadan Forest was the easier. None of my choice was really relevant in this one. Weak enemies, weak treachery.\n\nSo I got good hands and don't face anything brutal from the encounter deck. It could have been quickly done with a steward of gondor in the first half of my deck in at least one of my game but I manage to win anyway ^^.\n\nI let authraw, that does the most part of the job, my choice for the January league :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3549232","commentId":3549232,"userName":"theagesthrough56","timestamp":1543336948,"content":"I'll have to pass this time. I couldn't find the time to make an appealing deck with one of the required heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3549345","commentId":3549345,"userName":"dalestephenson","timestamp":1543340880,"content":"Druadan Forest was kind to all the Outlands players, but hard on Mirlonde.  Here's how we did (outside cards in parens)\n\n0 Authraw (0)\n0 Rouxxor (0)\n0 dalestephenson (5)\n0 Miceldars (27)\n1 Velensk (18)\n2 Yepesnopes (41) [nightmare]\n\nAnd here's the totals for those who completed all three quests this month:\n\n0 Authraw (0)\n0 Rouxxor (0)\n0 dalestephenson (5)\n3 Velensk (18)\n3 Yepesnopes (41) [nightmare]\n18 Miceldars (27)\n\nRouxxor couldn't find an improvement on Authraw's deck, so chose to use it.  However, the final tiebreaker is standing in last month's league, and as Rouxxor won last month Authraw takes the prize this month.  Authraw will get to choose a cycle for January's league, Rouxxor will get to pick a quest to be played, and I will get to pick a quest to be excluded.  Miceldars will get to choose a card outside the cycle to not count against tiebreakers.\n\nNext month: Lost Realm/Angmar Awakens.  One of the heroes used must be Tactics Aragorn, Halbarad, Dori or Arwen.  Tactics Eowyn will not count against any tiebreakers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3549812","commentId":3549812,"userName":"Rouxxor","timestamp":1543359476,"content":"The way the rules are writed it appear pretty much clearly that I should win this league. I even say before that I may take the same deck that Authraw since it will make me finish first. But that is not a big deal anyway.\n\nI'm not sure I will be playing the league next month (or any other month). Just playing with the same core set cards each time is a very bad deckbuilding experience. I'm not forced to follow this and I can play whatever I want. But since quest are selected randomly there is always some boring to play. So, at the end I choose this month to play with my deck on the scenario I like over playing the league each time I get the opportunity to play until the last day.\n\nHave fun!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3549994","commentId":3549994,"userName":"dalestephenson","timestamp":1543373516,"content":"Yes, I worded the tiebreakers badly so you are correct.  I wrote this:\n\nFourth tiebreaker is how well the player performed in the previous month's league, if not in the previous month's league treated as a median performance.\n\nBut I meant to write this:\n\nFourth tiebreaker is how well the player performed in the previous month's league (worse is better), if not in the previous month's league treated as a median performance.\n\nIt was never my intention to give a competitive advantage to the previous month's winner.  However, the way the tiebreaker was actually worded that would be the logical interpretation.  You can consider yourself the winner by rule and next month's seventh tiebreaker will be better worded.  But you've already deferred the cycle pick to Authraw, so the rewards are unchanged.\n\nI would be sorry to lose you as a player in the league, but if you can't find a way to enjoy playing then there's no point in playing.  If you were playing nightmare instead of regular quests, would the quests be more enjoyable for you?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550129","commentId":3550129,"userName":"Yepesnopes","timestamp":1543390772,"content":"> 8 hours ago, Rouxxor said:\n> \n> The way the rules are writed it appear pretty much clearly that I should win this league. I even say before that I may take the same deck that Authraw since it will make me finish first. But that is not a big deal anyway.\n\nI think it is a very childish coment to make taking into account you copied the exact same deck of Authraw, knowing that he scored a perfect run with his deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550136","commentId":3550136,"userName":"Authraw","timestamp":1543391731,"content":"Nah, I think Rouxxor's just pointing out the rules-as-written; that's how I understood them to work, too (although I'm glad to hear that that wasn't the original intention). We're all gamers here, and gamers love obsessing over rules. It's hard to leave an incorrectly played rule hanging in the air without at least pointing it out, even if you don't actually care about the outcome.\n\nI choose the Sands of Harad / Haradrim cycle for January. The player cards for that cycle are a little weird in a Core-only environment, so I'm interested to see which ones bubble to the top.\n\nI'm sympathetic to Rouxxor's point about most of the decks coming out the same, though. I think by always allowing the Core cards we're sort of doomed to see the same deck or two swirling around month after month with minor variations each time. (This month was a bit of an outlier, of course, partially due to Outlands being so strong out-of-the-box and partially due to the Battle / Siege keywords)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550143","commentId":3550143,"userName":"PigsAreOurEquals","timestamp":1543392407,"content":"I like the restriction of using in-cycle cards but it does have the side effect that all of the decks are vey similar in November (some version of outlands) and October (variations on Noldor). \nI'm predict a lot of people (including me) will line up erestor and Arwen for Agnmar Awakened.\n\nThe in-cycle cards as tiebraker makes that often there is one obvious archetype that will perform well and score 0 on the tiebraker.\n\nThat being said I don't have any better ideas on an improved tiebreaker and I continue to appluad @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] for this nice initiave.\nPerhaps we can do a winner sof the most loved quest competition (Durin's father recently launched a challonge for this). This way we will be garantueed to play great quests. \nAlthough I don't know how to organize the tiebreaker there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550159","commentId":3550159,"userName":"Miceldars","timestamp":1543394340,"content":"Why not select a second cycle to allow its cards for the tiebreaker ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550321","commentId":3550321,"userName":"dalestephenson","timestamp":1543416733,"content":"Part of the reason for the in-cycle emphasis has been to level the playing field somewhat for players with an incomplete card pool.  A player with just the cycle and a single core could compete with a deck drawn from the entire card pool.  My naive thought would be that the likelihood of loss from a minimum purchase deck would be high enough that there would be a balance between powering up the deck and trying to be perfect on the tiebreakers.  In one sense that's true -- no one actually risked playing a perfect tiebreaker deck, even though LeBoromir/Hirluin outlands deck with Mirlonde or TaBoromir was capable of getting lucky against the quests.  (As I've proven so far, getting lucky is totally a viable strategy...) But the top finishers were once again the strongest archtype from the cycle.  I think Yepesnopes had the most interesting deck.\n\nMiceldars' idea about selecting a second cycle has merit, I think.  By allowing heroes and cards from a second cycle there's more alternatives and the decks could be less uniform.  It does reward a larger card pool, but as the last-place pick would at least help a player who could use the help.\n\nOne thing I've suggested in the Legendary Leagues is incorporating hero frequency into the scoring, to reward players for picking less popular heroes and punish them for choosing Black Widow Every Single League (she's a monster in the solo leagues).  At least within a cycle it's easily to evaluate popularity of particular heroes compared to other heroes (or for that matter, allies, attachments, and events).  But it would complicate things and if overbearing enough would force deck construction in a similar direction again, only with heroes who are considered less fun to play....\n\nSands of Harad has support for a lot of different kind of decks, but the only archtype that's self-contained in it is Haradrim.  Though a Thurindir deck would be mighty tempting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550323","commentId":3550323,"userName":"dalestephenson","timestamp":1543416832,"content":"Maybe selecting one of the quests via poll would be a good idea."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550346","commentId":3550346,"userName":"Rouxxor","timestamp":1543417912,"content":"> 7 hours ago, Yepesnopes said:\n> \n> I think it is a very childish coment to make taking into account you copied the exact same deck of Authraw, knowing that he scored a perfect run with his deck.\n\nThe whole point is to challenge myself with a set of rules. I try to win over a challenge, and succeed at doing so every month until now. But the first month I haven't understand that only one run is allowed so it doesn't count. I say it so to avoid further confusion. This time I just exploit a failure (since at my understanding of the rules as first players of the previous league I win every time the last tiebreaker). I just mention it again. What is childish about it? I didn't complain, I even not claim to a change. I even say that it is not a big deal. I was mostly challenging myself anyway (but using a common set of rules could be more exciting).\n\n\n\n> I would be sorry to lose you as a player in the league, but if you can't find a way to enjoy playing then there's no point in playing.  If you were playing nightmare instead of regular quests, would the quests be more enjoyable for you?\n\n\nThat is why I'm considering stopping. I prefer to let you know why, since it could help you to figure what is the problem (in case my problem was the same for other people). I'm quite regular to make challenge with deckbuilding issue. I take great fun and learn a lot from first two league, who made me build a core-set only solo deck that I will use to test new scenario, and to compare with full pool solo deck :). But I can clearly see that I will using a pre-made mechanic, or using the powerful pool of the core set, and both of them are things I already did.\n\nI keep thinking about it this morning. We can, at least, use Deluxe Edition OR core set, it open the challenge to even more small card pool users."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3550372","commentId":3550372,"userName":"PigsAreOurEquals","timestamp":1543419139,"content":"There is a possible tiebreaker system that encourages using less played heroes. I'll describe it here to consider.\n\nThe in-cyle heroes each are assigned 100 points (to be in-line with the in-cycle tie breaker).\nAt the end of the league those points are divided requally between every person who used that hero. The person who has the most points (by using non-popular heroes) wins the tiebreaker.\n\nAn example losely based on this month's league:\nTactics Beregond, Leadership Boromir, Hirluin the Fair, and Mirlonde are the incycel heroes: 100 points\n\n3 players use Hirluin, Le Boromir + Beravor\n1Player uses  T Beregond, L Boromir Mirlonde.\n\nThat means each hero gives you the following numbe rof points:  Hirluin 33 points (100/3), Le Boromir  25 (100/4), T Bergond 100 (100/1) and Mirlonde 100 (100/1).\n\nThe 3 players with the same hero line-up each get 33+25+0= 58.\n\nThe player who used less obvious heroes would get 100+25+100=225.\nAnd thereby win the tiebreaker.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551262","commentId":3551262,"userName":"Miceldars","timestamp":1543474721,"content":"The problem I see is if you want to win this tiebreaker, you will be tempted to wait until some players indicates which heroes they use to see who you will pick. And if everyone do this, nobody play :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551281","commentId":3551281,"userName":"Authraw","timestamp":1543476980,"content":"Many thanks are indeed due to Dale for running this league! I'm having a great time with it, whenever I can find the time to participate.\n\nAnd, like the engineer that I am, I tend to want to analyze and suggest improvements to the things I enjoy. So, in that spirit:\n\nThe problem, as I see it, is that deckbuilding can get a little stale. This can manifest in two ways:\n\nProblem 1: The highest-scoring decks each month look pretty similar to one another\n\nProblem 2: Many decks end up being tweaked versions of the same \"Core Set goodstuff\" deck\n\nThis happens because of the way the tiebreakers are set up, encouraging competitive folks to narrow their focus on building \"a perfect deck\", something which is usually doable, but which narrows the set of competitive decks down to a few variations on a similar theme.\n\nIf we're interested in having a greater diversity of decks in the competition, I can see two low-hanging-fruit solutions:\n\nOption 1: Reduce the \"tiebreaker privileged\" card pool to the point that it is no longer practical to build a perfect deck. (Example: Core Set is no longer included in the \"privileged\" cards, just the cycle + deluxe, or even just the 3 packs the quests come from).\n\n * Pro: Once you have to start pulling from outside the privileged card pool to build viable decks, you'll probably see people pulling their decks in different directions (not just filling in the gaps with Core cards). Deckbuilding becomes an interesting puzzle to solve.\n * Con: Folks with bigger card pools may gain an advantage, having more options to draw from.\n\nOption 2: Increase the \"tiebreaker privileged\" card pool so that there is more than one way to build a perfect deck. (Example: Each player can choose 10 cards to add to their own personal \"privileged\" list. Other options might include allowing a Collector's Edition instead of a Core, or adding another cycle's cards to the pool).\n\n * Pro: With more options, you may see a greater diversity of decks become competitive. It doesn't disadvantage smaller card pools too much.\n * Con: You'll probably see more perfect scores, kinda defeating the point of a tiebreaker in the first place.\n\nPersonally, I'm partial to Option 1, because it sounds like it would make each month its own unique deckbuilding challenge, and it would be dramatic to see just how crazy people's decks get as they try to crank their tiebreaker numbers down. But I'm also someone with a full card pool who enjoys sorta intense deckbuilding challenges, so I don't know if it would have a net positive or net negative effect on the experience for other folks.\n\nAnyway, those are my thoughts, for what it's worth. Thanks again for running this league, Dale, and I look forward to playing more going forward no matter how you decide (or decide not) to tweak the rules.\n\nEdited November 29, 2018 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551287","commentId":3551287,"userName":"Miceldars","timestamp":1543477919,"content":"The option 1 could be great if you don't have 1 type of deck with many of his staples contained in the few privileged cards. For example, in this cycle, you have all the basics for outlands in Steward's fear, and if you reduce the privileged cards to only the 3 quests, it is difficult to play a non-outland deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551294","commentId":3551294,"userName":"Authraw","timestamp":1543479067,"content":"> 6 minutes ago, Miceldars said:\n> \n> The option 1 could be great if you don't have 1 type of deck with many of his staples contained in the few privileged cards. For example, in this cycle, you have all the basics for outlands in Steward's fear, and if you reduce the privileged cards to only the 3 quests, it is difficult to play a non-outland deck. ﻿﻿\n\nThat's a fair point! After all, you can build a weapons-grade Dale deck with just The Wilds of Rhovanion and The Withered Heath, no Core Set required.\n\nEven so, I think you'd have seen at least a couple of slightly different variations on the Outlands deck this time if we didn't have the Core Set cards to back us up. At the very least, you might have seen Heroes other than Beravor swapped in as the third Hero choice. De-privileging Core would make Cirdan, Erestor, and Bilbo all equally viable options to experiment with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551356","commentId":3551356,"userName":"dalestephenson","timestamp":1543492380,"content":"As a clarification, while core cards don't count against the deck tiebreaker, core heroes *do* count against the hero tiebreaker.  So Beravor gave no tiebreaking advantage over Cirdan, Erestor, or Bilbo, and would lose a tiebreaker to any heroes from Against the Shadow cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551641","commentId":3551641,"userName":"Authraw","timestamp":1543512139,"content":"> 5 hours ago, dalestephenson said:\n> \n> As a clarification, while core cards don't count against the deck tiebreaker, core heroes *do* count﻿ against the hero tiebreaker.  So Beravor gave no tiebreaking advantage over Cirdan, Erestor, or Bilbo, and would lose a tiebreaker to any heroes from Against the Shadow cycle.\n\nI must be missing something. Including a non-Core Hero would have brought the out-of-cycle card count to 1, which brings it down a peg for the first tiebreaker; at that point there would be no need to evaluate the second tiebreaker, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551653","commentId":3551653,"userName":"dalestephenson","timestamp":1543512436,"content":"The first tiebreaker only counts outside cards in your deck -- heroes aren't in your deck, so don't affect that tiebreaker.\n\nThe second tiebreaker only looks at your heroes -- core set heroes count against you here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551765","commentId":3551765,"userName":"Authraw","timestamp":1543515972,"content":"Oh, wow, I did not realize that was how it was counted! I may have been unintentionally handicapping myself. Good to know. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3551773","commentId":3551773,"userName":"dalestephenson","timestamp":1543516094,"content":"Man, I really stink at writing clear tiebreakers!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3554643","commentId":3554643,"userName":"Miceldars","timestamp":1543739019,"content":"The card I can choose for january, can it be a hero ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3554712","commentId":3554712,"userName":"dalestephenson","timestamp":1543754526,"content":"Yes, it can be a hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3555406","commentId":3555406,"userName":"Miceldars","timestamp":1543819740,"content":"I don't have Harad cycle (and so won't participate in January), I don't know which card would be great/interesting for this cycle, so let's say a card I like : Gandalf hero.\n\nEdited December 3, 2018 by Miceldars"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285492-solo-league-3-against-the-shadow-cycle/?do=findComment&comment=3556211","commentId":3556211,"userName":"dalestephenson","timestamp":1543868532,"content":"Rouxxor has chosen Race Across Harad as one of the quests.  I've decided to exclude Mumakil to avoid Khaliel being one of the mandatory heroes, with everyone building a Harad deck.  (You can still build a Harad deck if you like, Khaliel just won't satisfy the mandatory requirement.)  The randomly selected quests are the first two from the Deluxe expansion, so:\n\n1) Escape from Umbar (Sands of Harad Deluxe)\n\n2) Desert Crossing (Sands of Harad Deluxe)\n\n3) Race Across Harad (Haradrim AP 2)\n\nYou must choose at least one of Leadership Gimli, Spirit Legolas, and Thurindir as one of your heroes in January. "}]}