{"url":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/","title":"A fun reading of the new Digital App article","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3522766","commentId":3522766,"userName":"Gandalf_","timestamp":1541197752,"content":"I was reading this attempt of PR and interpreted it as follows: \n\n> Quote\n> \n> How big is the Fantasy Flight Interactive team? What kind of staff does it take to make a game like this?\n> \n> Fantasy Flight Interactive is a very small team that works with partner studios. Rather than establishing a huge studio presence, we have a small team that oversees the design, production, art, sound, and testing of the games we bring to life. We work with partner developers who write the game code, as well as both creating new assets and implementing game assets we provide. \n> \n> This way, we can stay lean as a studio, but leverage larger teams to create the games we work on. It also allows us to be more agile since, now that we’re established, we can create more than one game at once in the future by working with more than one team at a time around the world. \n> \n> Our internal staff includes testers, producers, designers, and art and programming direction staff. Overall head count is still less than a dozen people internally, but with a reach that extends far beyond that. \n> \n> In addition, we work with the creative design and art staff at Fantasy Flight Games in Roseville, Minnesota as well as our publisher, Asmodee Digital out of Paris. In this way, we can have 24 hour development as our development partners around the world work together.\n\nWe are not really a video game studio. We outsource small tasks like coding and asset development in order to have more time for outsourcing more stuff. This way we can create more hits that follow the steps of the Lord of the Rings: the Living Card Game. We are about 12 people in here. Our designers dismantle the tabletop version and our artists organize the assets FFG gave us in folders so we can email them to the outside crew. We also throw the word Paris in here, because it's cool. Bonjour! \n\n \n\n> Quote\n> \n> What is the relationship between Fantasy Flight Interactive and Fantasy Flight Games?\n> \n> Fantasy Flight Games is both our partner and inspiration. They are the authors and creators of the games we develop into digital titles. They are also our partners, as they are involved in the design and art direction decisions that we make. We work with the original development teams and the digital team at FFG as much as we can—they are instrumental in our development process, providing support in art direction, design direction, and game scripting.\n> \n> We also work with Asmodee North America, who support us with marketing, promotion, and licensing support. Working with each of these sister teams means that even though our own staff is small, we still have global reach and resources.\n\nSince we are not a serious video game developer we are relying mostly on FFG and Asmodee. We are constantly calling Caleb for some help but he doesn't pick up for some reason. \n\n> Quote\n> \n> How would you summarize the studio’s approach to game design?\n> \n> We have a really indie house design approach. Because we’re so small, we’re fairly experimental. Our studio was formed to explore the digital design space—not just crank out ports from tabletop to digital. We want to create new and unique games based on the tabletop properties, and that means taking risks and trying new things.\n\nThis is a student project for college credits. We want to stress this because our game is basically HeartStone's UI with 3/10 of LotR LCG. We consider this a new and unique game that 30-40 (24 hour peak) players want to play. Making a faithful port, i.e. adopting the tabletop 1:1 would probably be way better, but it wouldn't justify us taking unnecessary risks which will look way cooler when they will make our biopic. In addition, as you can tell from our recent change in monetary policy, taking risks means not really thinking ahead or reading the market. \n\n> Quote\n> \n> Why did FFI decide to release The Lord of the Rings: Living Card Game in Early Access? What does Early Access mean?\n> \n> Early Access is part of the experimental philosophy. Specifically, Early Access is a program on Steam where games that aren’t considered complete can be released to the public for input into development. A major pillar of our philosophy is to be open and communicative with our audience, and Early Access lets us interact with our fanbase in a way that traditional releases just don’t. We support this approach with constant refreshes on our Steam Community pages [https://steamcommunity.com/app/509580] and twice-weekly Twitch video streams [https://www.twitch.tv/ffigames].\n> \n> On one hand, this means that users have to deal with the issues you might see in a beta release, such as occasional missing features or incomplete content, but on the other hand, players get to be part of our community and directly influence the direction the game is going into the future. We feel that what we gain in adaptability and real-world player feedback more than makes up for any instability or incomplete polish!\n\nFirst of all, by occasional we mean often. Since we have zero faith in our product we treat whatever players come our way as test subjects in order to understand what we want to make. This might make the final game 10% more appealing to any potential gamers that still care after all this. As mentioned above, we don't really have a plan. We feel that what we gain in adaptability and real-world player feedback more than makes up for any instability or incomplete polish, the latter two being completely irrelevant when it comes to a good first impression. We also stream the same quests over and over again and press refresh on Chrome once in a while to see if there are any new posts on the steam forums. We make sure to address only the hyper positive ones and not the ones with criticism since this is Early Access. \n\n> Quote\n> \n> What’s next for The Lord of the Rings: Living Card Game? What can players expect during Early Access?\n> \n> Already we’ve released free new cards to players, and have upcoming free adventures we call Encounters, which are singular quests that are either more challenging or test out new features. All players in Early Access get this content completely free. Coming up we’ll have Cooperative play going live online, as we want to have the chance to test this and adjust based on player feedback before we go live.\n> \n> We also have our first Expansion Pack, The Shadow’s Fall, coming up before we exit Early Access. This package will include four new heroes, sixteen new player cards and seventeen new cards in our Valor Vault that players can earn through play, as well as new avatars, an all-new card back, and a new player nametag frame.\n> \n> Looking even beyond that, we have all-new campaigns, heroes, and play modes in the works. We have ambitions of introducing a survival mode, draft play, competitive play, and even a Saga mode, where players can play through the entirety of The Lord of the Rings books as well as The Hobbit. That’s all for the future, however, as we focus on polishing the game during Early Access.\n\nOur dream is to make the money that FFG makes selling from Adventure Packs and box expansions without printing cards. We don't make a 1:1 adaptation of the tabletop but would really like a 1:1 adaptation of the money it makes. \n\n> Quote\n> \n> What’s the future look like for FFI? Any hints about upcoming titles?\n> \n> We have an embarrassment of riches from Fantasy Flight Games to choose from. With so many great games and limited time and resources, the biggest challenge has been picking which games to pursue next. We have two games planned for release in the next eighteen months, in addition to The Lord of the Rings: Living Card Game, but you’ll just have to stay tuned to see what they are.\n\nAfter the big success of the Lord of the Rings: the Living Card Game, we are carefully thinking which game to simplify next and offer low effort DLCs for. Stay tuned to see which two favorite franchises we have chosen. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3522831","commentId":3522831,"userName":"TwiceBorn","timestamp":1541201659,"content":"Ouch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3522941","commentId":3522941,"userName":"HirumaShigure","timestamp":1541214506,"content":"I read the article as well and noticed that they never named an actual person that was being interviewed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3522980","commentId":3522980,"userName":"Gizlivadi","timestamp":1541219197,"content":"I just wish FFG to focus again on the actual Living Card Game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3523045","commentId":3523045,"userName":"Zura","timestamp":1541231686,"content":"Digital is garbage and they're trying very hard to make it look ok. And this is super sad because you would think with license for one of boggest franchises of all time you could make a digital card game that could be extremely polished, fun and popular, maybe not hs level but **** close to it. Sadly it seems they took some 12 people to design this hearthstone coop crap and made other studio program it so they can't even influence the project as much as they would want to. Christ this failure of a game annoys me so much, they could have ported the original game, add some fancy animations and make AI take care of the triggers and i would be 100% satisfied. Now it's taking away attention from actually good game, Lotr LCG. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3523097","commentId":3523097,"userName":"Gandalf_","timestamp":1541242106,"content":"> 2 hours ago, Zura said:\n> \n> Now it's taking away attention from actually good game, Lotr LCG. \n\nThat's what worries me too. More people seem to dislike the game than like it. And this might discourage some from trying out the tabletop. This FFI project looks so poorly put together, it's embarassing. I am surprised they revealed that they outsource development. Such a bad image for an \"indie\" studio..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3523098","commentId":3523098,"userName":"John Constantine","timestamp":1541242209,"content":"They went a little too safe with it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3523396","commentId":3523396,"userName":"soullos","timestamp":1541278505,"content":"Studios outsource all the time in the game industry, from small indie devs all the way up to the AAA studios like Ubisoft and Rockstar, so I don't see why that's a mark against this. It's common practice."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3524342","commentId":3524342,"userName":"BigKahuna","timestamp":1541412732,"content":"I folded and tried the game, it was \"ok\", not good enough to invest in.\n\nAll I can say is, it's too bad.  A missed opportunity to do something great, bring a beloved game online.  Instead we got \"Lord of the Rings LCG Light\", which I would describe as very unsatisfying.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3524363","commentId":3524363,"userName":"ColinEdwards","timestamp":1541415926,"content":"I think the reaction from the 'card game' community is quite negatively biased because it feels like resources have been shifted away from the 'card game' and to the 'online game'. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3524382","commentId":3524382,"userName":"Yepesnopes","timestamp":1541419101,"content":"> 51 minutes ago, ColinEdwards said:\n> \n> I think the reaction from the 'card game' community is quite negatively biased because it feels like resources have been shifted away from the 'card game' and to the 'online game'. ﻿﻿\n> \n>  \n> \n>  \n\nand because those resources shifted away have been used to create a mediocre game. Don't forget that :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3525348","commentId":3525348,"userName":"BigKahuna","timestamp":1541463683,"content":"> 13 hours ago, ColinEdwards said:\n> \n> I think the reaction from the 'card game' community is quite negatively biased because it feels like resources have been shifted away from the 'card game' and to the 'online game'. \n> \n>  \n> \n>  \n\nI would say the word \"biased\" is not the right term for how I think the community is responding, at least from what I have read.  I think disappointed in the result would be more accurate.  No one in this community said one negative word when the announcement came, I was here for that most people were excited for an online version of their favorite game, it's just not what we got.  What we got is a game that looks the part because the same art was used, but it's not the game we know and love... and frankly it's not what anyone asked or hoped for.  This community wanted and still wants a digital version of Lord of the Rings, its just that we don't want a \"reimagining\" of the game, but just plainly THE game as it is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3525384","commentId":3525384,"userName":"Gandalf_","timestamp":1541465940,"content":"> 36 minutes ago, BigKahuna said:\n> \n> This community wanted and still wants a digital version of Lord of the Rings, its just that we don't want a \"reimagining\" of the game, but just plainly THE game as it is.\n\nI asked their PR person on one of the twitch streams whether that is an option and he basically said there is no chance. They will focus on that version. I don't get it though. They have this community, a very well built game and the possibility to make the fanbase double dip on a digital 1:1 adaptation while bringing in new players. FFI seems to be constantly in damage control mode with this game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3525590","commentId":3525590,"userName":"BigKahuna","timestamp":1541489566,"content":"I usually give companies the benefit of the doubt because they work with information that I don't have, market research etc.  Perhaps there is a market outside of this community that the digital LotR's is trying to capture that is larger and more attractive then their existing community.  On Steam for example the game has been largely positively received, so I assume they know what they are doing.  Only time will tell."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527032","commentId":3527032,"userName":"Seastan","timestamp":1541617982,"content":"> On 11/5/2018 at 4:21 PM, BigKahuna said:\n> \n> This community wanted and still wants a digital version of Lord of the Rings, its just that we don't want a \"reimagining\" of the game, but just plainly THE game as it is.\n\nI'm a member of this community, and I don't want a 1:1 copy of the tabletop for a few reasons:\n\n1. I don't want to buy my cards all over again. Forget about them offering players of the tabletop game free digital copies of everything they own, because that would never happen. They aren't going to invest all that money and then give away their product for free to their primary customer base. Not to mention the logistics of actually proving you purchased each item if you've thrown out your boxes/receipts, which I have.\n\n2. The tabletop game has grown and improved a lot over the years, to the point where I actually dislike most of the early quests now. A digital remake of any of those quests would be a waste of time and money in my eyes, because I have no desire to play them anymore.\n\n3. OCTGN/Lackey/Tabletop Simulator already exist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527177","commentId":3527177,"userName":"John Constantine","timestamp":1541625277,"content":"1:1 port would be silly. The game, especially in it's early stages, had a lot of flaws. Porting the core gameplay and improving the outdated flawed stuff - now that would be a real treat. As of \"repurchasing entire game\" - digital is much less pricier since it takes no effort and resources to \"produce\" after the content is done, there is no shipping involved, etc. Plus, the art already exists, so that's a large chunk of investment they've already skipping.\n\nEdited November 8, 2018 by John Constantine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527350","commentId":3527350,"userName":"NathanH","timestamp":1541632110,"content":"The card game is rather complicated, so either they would have to spend a lot of time up front making sure a digital version could handle all the future complications, or make something that might not actually be able to do all the things it needs to do later. That alone makes it a dangerous idea to pursue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527514","commentId":3527514,"userName":"Wandalf the Gizzard","timestamp":1541643904,"content":"> 7 hours ago, Seastan said:\n> \n> 3. OCTGN/Lackey/Tabletop Simulator already exist.\n\nThis especially kills the one to one for me. I think some people want an automated game with graphics and effects, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527720","commentId":3527720,"userName":"Gandalf_","timestamp":1541671028,"content":"> 10 hours ago, NathanH said:\n> \n> The card game is rather complicated, so either they would have to spend a lot of time up front making sure a digital version could handle all the future complications, or make something that might not actually be able to do all the things it needs to do later. That alone makes it a dangerous idea to pursue.\n\nSo basically an adaptation would require a talented developer and not a cash grab outsourced studio. It can't be impossible to do this. \n\nEdited November 8, 2018 by Gandalf_"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527734","commentId":3527734,"userName":"dalestephenson","timestamp":1541673283,"content":"> 35 minutes ago, Gandalf_ said:\n> \n> So basically an adaptation would require a talented developer and not a cash grab outsourced studio. It can't be impossible to do this. \n\nIt very well could be impossible for FFG to make a profit doing this.  I'd love a faithful, high-quality adaptation of the game on my iPad, but I doubt the market would justify such a game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527837","commentId":3527837,"userName":"Distractionbeast","timestamp":1541687329,"content":"> On 11/3/2018 at 3:54 AM, Zura said:\n> \n> Digital is garbage and they're trying very hard to make it look ok. And this is super sad because you would think with license for one of boggest franchises of all time you could make a digital card game that could be extremely polished, fun and popular, maybe not hs level but **** close to it. Sadly it seems they took some 12 people to design this hearthstone coop crap and made other studio program it so they can't even influence the project as much as they would want to. Christ this failure of a game annoys me so much, they could have ported the original game, add some fancy animations and make AI take care of the triggers and i would be 100% satisfied. Now it's taking away attention from actually good game, Lotr LCG. \n\nThe digital game is certainly not at the level of the tabletop version.  But recreating the card game exactly - with rules and timing would be practically impossible.  I work in game development and it is no simple or easy task to do what you describe. I think what they put together is a good start on a re-imagining, but it needs a couple more layers of depth and a much better UI.  Perhaps they can add enough to bring it up to that level in DLC.  We'll see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527849","commentId":3527849,"userName":"John Constantine","timestamp":1541688074,"content":"> 10 minutes ago, Distractionbeast said:\n> \n> The digital game is certainly not at the level of the tabletop version.  But recreating the card game exactly - with rules and timing would be practically impossible.  I work in game development and it is no simple or easy task to do what you describe. I think what they put together is a good start on a re-imagining, but it needs a couple more layers of depth and a much better UI.  Perhaps they can add enough to bring it up to that level in DLC.  We'll see.\n\nIt would be practically possible, but tideous. There are plenty of steps to reduce tideousness tho."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285555-a-fun-reading-of-the-new-digital-app-article/?do=findComment&comment=3527869","commentId":3527869,"userName":"Distractionbeast","timestamp":1541689343,"content":"> 21 minutes ago, John Constantine said:\n> \n> It would be practically possible, but tideous. There are plenty of steps to reduce tideousness tho.\n\nPossible, yes.  Judging from the team size, I don't think it fits the scope of their approved budget.  I use the term \"practically\" because it doesn't seem like it would be \"practical\" to do it. \n\nTiming issues alone have proved problematic for live humans to work out during game situations.  Building a simulation with all the necessary signs and feedback, warnings, and information surrounding these tricky cases would be a monumental iterative design task.  Unless, they simplified the card effects and rules for this version (I believe MtG does this).  Anyway, I was responding specifically to the idea of recreating the card game and all its mechanics.\n\nEdited November 8, 2018 by Distractionbeast\nclarification"}]}