{"url":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/","title":"Expert Treasure-hunter","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/?do=findComment&comment=3522245","commentId":3522245,"userName":"Miceldars","timestamp":1541169093,"content":"Let's say we play hero Gandalf and we have two Expert Treasure hunter in play. When they both trigger at the same time, how does it work ?\n\n1)I name a card type, discard the first card (or draw it should I say, as we know what card it is thanks to Gandalf), see the next card on the deck, name a card type and discard/draw it\n\n2)Name card type 1, name card type 2, and then discard the two cards on top of my deck (and I can see only the first one)\n\n3)Name and discard only one card because both effects are not cumulative\n\nI think the good answer is the n°1, but I want to be sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/?do=findComment&comment=3522251","commentId":3522251,"userName":"GrandSpleen","timestamp":1541169323,"content":"I'm reasonably sure it's #1 as well.\n\nBe sure that your Expert Treasure Hunters are on different characters, by the way -- this card received errata, so it's limit 1 per character."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/?do=findComment&comment=3522264","commentId":3522264,"userName":"Rouxxor","timestamp":1541169803,"content":"I agree about #1, each effect resolve separately and any continuous effect (like Gandalf) take place at all time, so it reveal the card between each ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/?do=findComment&comment=3522265","commentId":3522265,"userName":"Miceldars","timestamp":1541169875,"content":"Ok, thank you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285525-expert-treasure-hunter/?do=findComment&comment=3523066","commentId":3523066,"userName":"NathanH","timestamp":1541235999,"content":"When there are multiple Responses with the same trigger, you choose which response to activate first. You then fully carry out the effect, before moving on to the next Response. So in this case, #1 is the right answer.\n\nNote that if the first Response causes a cascade of other triggers, you resolve all of them in full before moving back to the original trigger. For example, if you have two cards that say \"Response: After you quest successfully, draw a card\", and there is an enemy that says \"Forced: After you draw a card, xxx makes an immediate attack against you\", the order goes like this:\n\n * You quest successfully\n * You choose to activate one of the Responses. You draw a card\n * The enemy makes an immediate attack, which you resolve in full (possibly triggering even more things)\n * Once the attack is over, you return to the \"When you quest successfully\" trigger, and may choose to draw another card."}]}