{"url":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/","title":"Errata: How do you deal with them?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3525785","commentId":3525785,"userName":"Stewart777","timestamp":1541514454,"content":"Do you try and remember them all? Do you write the corrections on the actual card?\n\nJust curious how people handle this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3525807","commentId":3525807,"userName":"Miceldars","timestamp":1541516190,"content":"I think I will put a small sticker on the sleeves of these cards, just to remember me they got an errata. And if I don't remember what it is, I'll check the FAQ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3525825","commentId":3525825,"userName":"dalestephenson","timestamp":1541517224,"content":"I will just try to remember them.  Since most errata are to address a corner case that I would never do in the first place, if I forgot the errata it's no big deal and the cards work as designed.\n\nOccasionally I'll pretend to forget them.  For example, when playing a Caldara or Hama deck that I constructed before the errata."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3525844","commentId":3525844,"userName":"Stewart777","timestamp":1541518077,"content":"> 10 minutes ago, dalestephenson said:\n> \n> I will just try to remember them.  Since most errata are to address a corner case that I would never do in the first place, if I forgot the errata it's no big deal and the cards work as designed.\n> \n> Occasionally I'll pretend to forget them.  For example, when playing a Caldara or Hama deck that I constructed before the errata.\n\nAh yes, for those occasions when I little absent mindedness comes in handy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThe sticker thing sounds better than writing on the actual cards. And yeah I suppose just remembering all the errata would be the best way to go. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3525911","commentId":3525911,"userName":"Wandalf the Gizzard","timestamp":1541522369,"content":"> 2 hours ago, Stewart777 said:\n> \n> Do you try and remember them all? Do you write the corrections on the actual card?\n> \n> Just curious how people handle this.\n\nSome errata is just minor changes to prevent broken loops. These usually disable the combo without changing what the card really does. If you ignore the combo, you can play the card as written and be on your merry way without having to worry about it.\n\nThen there is errata that actually changes what the card does. You can:\n\nA. Buy the next printing of each pack with a card that received errata. (joke)\n\nB. Remember. (good idea)\n\nC. House-rule. Play the card with your own personal errata that effectually serves the same purpose the official errata did but in a way that affects the function of the card less. Like what I said above: \"If you ignore the combo, you can play the card as written and be on your merry way without having to worry about it.\"\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3526073","commentId":3526073,"userName":"mewmartigan","timestamp":1541531604,"content":"I just do what is written on the card. I am behind in purchasing though so most of my stuff may have the corrections except for the Mirkwood cycle and maybe some Dwarrowdelf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3526080","commentId":3526080,"userName":"Rouxxor","timestamp":1541531898,"content":"I try to remember all the errata. I also got some card with alternate illustration and updated text."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3526221","commentId":3526221,"userName":"icabod","timestamp":1541539199,"content":"I sleeve my cards and can cope without the (sometimes lovely) artwork, so I just write out the errata on a slip of paper and insert it into the sleeve.  Usually it's just stuff like a note saying \"once per round\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3526302","commentId":3526302,"userName":"Amicus Draconis","timestamp":1541542629,"content":"Some of my old cards have translation errors, for instance Dreadful Gap in German reads \"X is the number of players.\", Goblin Follower reads \"When Revealed: Goblin Follower attacks the last player.\", A Presence in the Dark only has one victory point, Gathering Ground has total rubbish printed on it, Ithilien Road sets the attack of enemies to zero, Legacy of Númenor is only doomed 3, Sacks only refer to characters, North Pier is missing quest points and so on. These errors sometimes alter games drastically, so at one point I will have to correct them and while I am at it, I can just as well include all errata.\n\nI guess I will use Strange Eons to deal with those cards and just print their text boxes so I can slip them into the sleeves with the original card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3527200","commentId":3527200,"userName":"player3351457","timestamp":1541626604,"content":"Golden rule. If it's not printed on the card, it doesn't exist. Encourages reprinting ?\n\nBut seriously. I happened to get a couple of the updated versions where the errata is addressed, such as Erebor battle master. I'm not trying to bend the rules, but unless there is some serious game breaking dynamic, it obviously worked once upon a time, might as well work now. With the serious power creep that has occured with these cycles, I think I'm afforded a little leniency. Again, not trying to break the game I love, but I'm also not becoming a scholar and checking every little aspect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3527358","commentId":3527358,"userName":"NathanH","timestamp":1541632447,"content":"I'm typically happy if my team want to ignore errata, but it sometimes has odd effects. A good example is Horn of Gondor with red Imrahil; I wouldn't exactly call it OP but it does make Imrahil really easy to use. Probably too easy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285748-errata-how-do-you-deal-with-them/?do=findComment&comment=3528252","commentId":3528252,"userName":"Boromore","timestamp":1541712497,"content":"Like ichabod, I sleeve my cards, so if it is something I may forget, I add in a text slip. But I've only done that for one or two cards.\n\nOn where you draw the line, I was using Boromir as a hero when I went through the Rings saga - and finished just after the FAQ v1.9 came out, with the Boromir errata. I actually did the last quests after the FAQ was published, but before I'd read it - so was in genuine ignorance! It seemed fair to use his ability unlimited to the end of the campaign, but I haven't done so on any quests since. So a technical infringement only!"}]}