{"url":"https://community.fantasyflightgames.com/topic/285741-the-only-good-nameless/","title":"The only good Nameless...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/285741-the-only-good-nameless/?do=findComment&comment=3525719","commentId":3525719,"userName":"Boromore","timestamp":1541509019,"content":"This one is a bit tongue-in-cheek. I was battling solo through DW5 - Foundations of Stone (in Nightmare), and encountered a Nameless Thing (\"Forced: After Nameless Thing engages a player, attach the top 2 cards of that player's deck to it...\")\n\nI was a bit slow on the uptake, so was about to defend its attack when I realised I had attached two 0-cost cards to it, so it had 0 hit points.\n\nHowever, there was a Nest of Horrors staged, which had gained \"Forced: When one or more cards are attached to a Nameless enemy from the top of a player's deck, attach an additional card...\". I duly added a third card, which as luck would have it, was also 0-cost.\n\nBut thinking about it afterwards, did I actually need to observe the Nest's Forced effect, or would NT be dead before the effect kicked in?\n\nAnd to really push my luck - would it be dead after the first card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/285741-the-only-good-nameless/?do=findComment&comment=3525758","commentId":3525758,"userName":"Wandalf the Gizzard","timestamp":1541512910,"content":"Since Nest of Horrors uses \"when,\" the three cards are attached as one effect, not separately as two, then another. The question is whether the three cards are attached simultaneously or one by one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285741-the-only-good-nameless/?do=findComment&comment=3526157","commentId":3526157,"userName":"Rouxxor","timestamp":1541535850,"content":"The effect seems to tell you to increase by one the number of cards you attach. So you need to attach it 3 cards. If they all cost 0 the enemy is discarded since it have 0 hit point.\n\nBut it always feel strange with a forced, because forced need something happen to trigger, and before we add a card nothing happens. The trigger could have been \"when an effect tell you to attach\" and it would be clearer. But based on many others effects in the game it seem to work this way for this kind of wording."},{"commentUrl":"https://community.fantasyflightgames.com/topic/285741-the-only-good-nameless/?do=findComment&comment=3528245","commentId":3528245,"userName":"Boromore","timestamp":1541711945,"content":"I suppose I also had in mind my recent assault on the Redhorn Gate, where stage 3B states \"Characters are discarded from play if their <Will> is ever 0\" - so I had to keep Dain ready, even though I could ready him when he exhausted, or lose most of my dwarven tribe. It's that idea of passing through 0, albeit only between actions or responses.\n\nBut I agree, it does seem the most honest approach to add all the cards to Nameless Thing, then do the calculation. \n\nThanks for the thoughts!\n\nEdited November 8, 2018 by Boromore"}]}