{"url":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/","title":"Thorin Stonehelm hero","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3531797","commentId":3531797,"userName":"GrandSpleen","timestamp":1541981811,"content":"Seastan posted a dwarf mining deck here: https://ringsdb.com/decklist/view/10311/everything-costs-1-ft-thorin-stonehelm-1.0 [https://ringsdb.com/decklist/view/10311/everything-costs-1-ft-thorin-stonehelm-1.0]\n\nHe built it up around the new Thorin Stonehelm hero (in the 2-player starter/collector's edition box), and gives him very high praise.  Thorin does direct damage, 1 point of direct damage to be specific, after being declared as an attacker and discarding the top card of your deck.  He swings for three, so with his ability he swings for an effective 4.  With low-cost attachment, you can bring that to an effective 6 (Dwarrowdelf Axe).  Seastan described him as 'there's no other hero like that' (meaning, swinging for such a high value with so little setup).\n\nI have a different assessment, but rather than derail the comments section of his deck on ringsdb, I thought I'd post it here.\n\nThorin is a strong hero, but I would argue that his strongest asset is probably his low starting threat (9) and not his 'effective 4' attack and easy setup to reach an 'effective 6.'  There are other options which can reach 4 to 6 attack as easily or more easily than Thorin, but their threat cost or ability cost might be a bit higher.  Examples:\n\n-Hero Beorn with Tactics Aragorn on your team.  No card draw necessary; you're swinging for an effective 6 right out of the gate, with no cost associated with activating an ability.  Or you're swinging for 9 if you combine the two of them.  Beorn also has the added bonus of giving you an early-game solution for defense.  The main'cost' of this setup is that it's a 2-hero combo, so that plans out a good deal of what else is going into your deck.\n\n-Grimbeorn.  With his ability, he's swinging for an effective 5 against most enemies from turn 1.  Add a weapon (Dagger of Westernesse) and that's an effective 6 or 7 depending on the enemy's engagement cost.  Main drawback is the resource cost to activate his ability (Thorin's 'discard from your deck' is much easier to pay), and his higher threat (11).  Added bonus is that Grimbeorn can do his thing for any player on the table, since it activates through defense and he has Sentinel.\n\n-Treebeard hero, with no setup.  Obviously you need to include healing, but if we are looking for heroes who can reach a high attack value right from the start of the game, or with little setup, there you go.  Very high threat though.\n\nAnyway, that's all... I do like Thorin very much, but he's not unique in terms of raw power."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3531883","commentId":3531883,"userName":"Seastan","timestamp":1541990077,"content":"> 1 hour ago, GrandSpleen said:\n> \n> -Hero Beorn with Tactics Aragorn on your team.  No card draw necessary; you're swinging for an effective 6 right out of the gate, with no cost associated with activating an ability.  Or you're swinging for 9 if you combine the two of them.  Beorn also has the added bonus of giving you an early-game solution for defense.  The main'cost' of this setup is that it's a 2-hero combo, so that plans out a good deal of what else is going into your deck.\n\nI don't really count tactics Aragorn because I could also pair him with Thorin and I could adjust my statement for 6 attack to 7. Also, additional heroes don't require setup, but my statement was more geared to setting up a single attacking hero (I mostly play solo and it's often hard to make room for more than that).\n\n> Quote\n> \n> -Grimbeorn.  With his ability, he's swinging for an effective 5 against most enemies from turn 1.  Add a weapon (Dagger of Westernesse) and that's an effective 6 or 7 depending on the enemy's engagement cost.  Main drawback is the resource cost to activate his ability (Thorin's 'discard from your deck' is much easier to pay), and his higher threat (11).  Added bonus is that Grimbeorn can do his thing for any player on the table, since it activates through defense and he has Sentinel.\n\nGrimbeorn is a far better hero than Thorin. He's probably the best combat hero in the game. But Thorin is still easier and cheaper to get to 6 attack. They both need a weapon to hit that number, but Grimbeorn has an additional requirement of continuing resources and certain conditions (the enemy having 2 defense and/or having high engagement cost).\n\n> Quote\n> \n> -Treebeard hero, with no setup.  Obviously you need to include healing, but if we are looking for heroes who can reach a high attack value right from the start of the game, or with little setup, there you go.  Very high threat though.\n\nBut Treebeard's regular attack is only 6 if you can heal off 3 per round, which requires way more setup than a Dwarrowdelf axe. I get that there are easier/cheaper ways to get a big burst of attack (Tactics Eowyn, Unseen Strike, any ranged hero with Black Arrow, etc.) but my comment was directed toward the ease of setting up a hero who can repeatedly swing for 6. In that sense, I'm still of the opinion that Thorin Stonehelm is unmatched."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3531942","commentId":3531942,"userName":"GrandSpleen","timestamp":1541996355,"content":"Since you're specifying 'repeatedly,' I might add Gimli to the mix, who can get to 6  or close to 6 on turn 1 at some risk, if you take an attack undefended, and who wouldn't be hampered by immunity, 'cannot take non-combat damage,' or Toughness.  No specific setup required. And tac-Aragorn himself, who starts at an effective 4 same as Thorin, and with 1 weapon will get to 5 or 6 depending on your threat (assuming he has Dagger as his weapon), and no cost to activate.  Bard the Bowman assuming you're using him it the intended context (multiplayer ranger), which I guess you would not be if you're mostly doing solo.  It just seems pretty common to be able to get to the 'magic number' 6 attack with only 1 attachment.\n\nedit: comparing to his spirit counterpart in Spirit Dain, that guy really has no equal.  No other hero can do what he does (6 def from round 1 without any draw requirement), although the cost for that is steeper.\n\nEdited November 12, 2018 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3531964","commentId":3531964,"userName":"sappidus","timestamp":1541998453,"content":"> 34 minutes ago, GrandSpleen said:\n> \n> comparing to his spirit counterpart in Spirit Dain, that guy really has no equal.  No other hero can do what he does (6 def from round 1 without any﻿ draw requirement), although the cost for that is steeper.﻿\n\nWell, a Beregond + Dori gets to 6 defense without a draw requirement… ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png] "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532077","commentId":3532077,"userName":"Halberto","timestamp":1542014268,"content":"Hot used new thorin hero yet. \n\nLegolas with a weapon will likely swing for an equivalent 5 and I think he is still one of the best combat option in the game considering his trait, keyword and their support.\n\nBut I see the point on Thorin. If you don't want or can't dedicate d3xk space to pump you heroes and are playing in single player he is a serious candidate for an attacking option.\n\nOn my side I have personal difficulties to wallow the deck discard mechanic.\n\nI love noldor where I choose what to discard but blind discard is difficult for me. Dwarf mining is behind me for thw moment. This is why even if I consider a very good tale one of the top power card in the game often I don't play it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532080","commentId":3532080,"userName":"ColinEdwards","timestamp":1542014428,"content":"I feel like Stonehelm is a really strong character and at a threat point that can fit in practically any deck and supported by the powerful 'dwarf' trait. (The 2nd best tactics dwarf hero after him is a spirit card!) What's there not to like? \n\nHopefully, he gets released more widely. \n\nEdited November 12, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532087","commentId":3532087,"userName":"Halberto","timestamp":1542015320,"content":"By the way, I think we will see quite soon the release of new  cards which benefits of being discarded Hidden cache is good where Ered Luiz miner is just ok (but it's free). Both are quite bad if drwan. The other dwarf allies with discarding mechanic are fine but alone seem not enough to push this kind of deck at the level of many others. 1 or 2 great discarding cards are needed and probably arriving along with Thorin/Dain hero "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532099","commentId":3532099,"userName":"player1683311","timestamp":1542017020,"content":"Yeah I agree, I expect more cards for the mining support, and I cant wait I love that archetype, but it absolutely needs one or two more solid cards to bring it home I think...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532415","commentId":3532415,"userName":"Seastan","timestamp":1542039743,"content":"> 11 hours ago, GrandSpleen said:\n> \n> Since you're specifying 'repeatedly,' I might add Gimli to the mix, who can get to 6  or close to 6 on turn 1 at some risk, if you take an attack undefended, and who wouldn't be hampered by immunity, 'cannot take non-combat damage,' or Toughness.  No specific setup required. And tac-Aragorn himself, who starts at an effective 4 same as Thorin, and with 1 weapon will get to 5 or 6 depending on your threat (assuming he has Dagger as his weapon), and no cost to activate.  Bard the Bowman assuming you're using him it the intended context (multiplayer ranger), which I guess you would not be if you're mostly doing solo.  It just seems pretty common to be able to get to the 'magic number' 6 attack with only 1 attachment.\n> \n> edit: comparing to his spirit counterpart in Spirit Dain, that guy really has no equal.  No other hero can do what he does (6 def from round 1 without any draw requirement), although the cost for that is steeper.\n\nGimli:\n\nWhat are the odds you're going to be able to pull out a enemy that attacks for 4 on turn 1, then want to risk taking that attack undefended? This is a much less likely than finding a single Dwarrowdelf Axe, and much more dangerous.\n\nTactics Aragorn:\n\nYes, he gets to 6 with a Dagger of Westernesse if your threat is below the enemy's engagement cost. But keeping your threat down is not a trivial thing, and requires additional setup, whether it be threat reduction cards or other low threat heroes. So while both Thorin and Aragorn can get to 6 with a 1-cost, non-restricted attachment, Thorin makes no additional demands (apart from the rare \"can't take non-combat damage\").\n\nBard:\n\nAs you mentioned, I was focusing on solo with my statement. I'd consider Bard to be Thorin's multiplayer counterpart, being the easiest hero in the game to set up to start 1-shotting enemies engaged with other players.\n\nAs a side note, I don't consider Thorin's discard as a cost. Your deck is randomized, so discarding a card off the top should be no different than discarding one off the bottom. Unless of course you've been setting up your deck with something like Stargazer, but in that case you can actually arrange your deck so Thorin's discard is actually a benefit.\n\nI still think Thorin demands the least conditions/setup out of any hero in the game to be able to swing for an effective 6 against an enemy engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532610","commentId":3532610,"userName":"Kjeld","timestamp":1542043769,"content":"> 1 hour ago, Seastan said:\n> \n> I still think Thorin demands the least conditions/setup out of any hero in the game to be able to swing for an effective 6 against an enemy engaged with you.\n\nBoth Cirdan and Sp-Glorfindel can swing for 6 first round with Fair and Perilous and no other cards. But that's only a one-time effect. It is kind of nuts that Thorin can get to 6, permanently, for just one card and one resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532781","commentId":3532781,"userName":"dalestephenson","timestamp":1542046860,"content":"> 1 hour ago, Seastan said:\n> \n> Gimli:\n> \n> What are the odds you're going to be able to pull out a enemy that attacks for 4 on turn 1, then want to risk taking that attack undefended? This is a much less likely than finding a single Dwarrowdelf Axe, and much more dangerous.\n\nI don't think it should be Gimli vs Thorin + Dwarrowdelf, just Gimli vs Thorin.  I always packed the Axe for Gimli, it's just as good on him as it is on Thorin IMO.  So the question then becomes how easy/practical/dangerous it is for Gimli to match or exceed Thorin's effective four.\n\nThe easy is undoubted, since in order for either to attack you need an engaged enemy, and the first engaged enemy in most quests I play (non-nightmare) is *very* likely to have 2-4 attack; meaning Gimli can take it undefended and counter-attack for *at least* four, shadows permitting.  As a bonus, I don't have to scrape up a defender while Thorin's deck does.\n\nThe downside is that a shadow that converts the original attack to 5+ can kill Gimli dead if you lack any sort of protection.  I did that frequently anyway with my TaGimli decks because if I'm going to go down in flames, I'd rather do it early so I can quickly reset.  How much of a risk it is depends on the shadows for that particular quest, in most cases you're probably going to be OK (non-nightmare) even with a 4-strength attacker.  I can see preferring Thorin as an attacker due to lower threat and less risk, but I give TaGimli the edge for unassisted attack power."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532944","commentId":3532944,"userName":"Seastan","timestamp":1542050937,"content":"> 59 minutes ago, dalestephenson said:\n> \n> I don't think it should be Gimli vs Thorin + Dwarrowdelf, just Gimli vs Thorin.  I always packed the Axe for Gimli, it's just as good on him as it is on Thorin IMO.\n\nRegardless of how easy it is to get 2 damage on Gimli, playing the axe and taking 2 damage is always going to be harder than just playing the axe."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532990","commentId":3532990,"userName":"Halberto","timestamp":1542052879,"content":"> 3 hours ago, Seastan said:\n> \n> As a side note, I don't consider Thorin's discard as a cost. Your deck is randomized, so discarding a card off the top should be no different than discarding one off the bottom.\n\nI understand the point.\n\nIt's a sort of repetable deron ruins effect with a +1 attack effect in exchange of 1 net card drawn. Both make your deck smaller.  \n\nHowever it's difficult for me to pass over the card lost especially if I put 1x or 2x of many cards - which I often do.\n\n I woluld be less reluctant if the cards discarded was at the bottom of the deck since I most likely would never see it anyway. That's why the dwarf pipe without a way to reshuffle my deck (very good tale, master of the forge, etc...) does not solve my problem.The thought of discarding  one of my key or  power card to trigger a one time action makes me lose my sleep. But let's call  it with his name: mental block.\n\n \n\n \n\n \n\nEdited November 12, 2018 by Halberto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3532997","commentId":3532997,"userName":"ColinEdwards","timestamp":1542053117,"content":"Gimli seems like he was upstaged by Beorn, and then by Grimbeorn. In the first expansion, taking an undefended attack wasn't that scary, but it would worry me now!\n\nI don't think Thorin is out of line with other recent heroes, but getting a top-tier tactics dwarf is awesome. Feel a bit bad about him being in the collector's edition though "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533002","commentId":3533002,"userName":"Seastan","timestamp":1542053225,"content":"> 2 minutes ago, Halberto said:\n> \n>  I woluld be less reluctant if the cards discarded was at the bottom of the deck since I most likely would never see it anyway.\n\nBut that 1x card is just as likely to have been near the bottom of your deck, and you never would've seen it anyway. In fact, the number of times that Thorin accidentally discards your 1x card will be exactly cancelled out by the number of times he helps you find your 1x card by making your deck smaller."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533018","commentId":3533018,"userName":"Halberto","timestamp":1542053899,"content":"> 11 minutes ago, Seastan said:\n> \n> But that 1x card is just as likely to have been near the bottom of your deck, and you never would've seen it anyway. In fact, the number of times that Thorin accidentally discards your 1x card will be exactly cancelled out by the number of times he helps you find your 1x card by making your deck smaller.\n\nTotally true.\n\nStill seeing it discarded will crush my heart...\n\nIn principle I should be glad of the knowledge it's gone making my guess of what to expect from my deck more accurate but ignorance for optimisic people like me is often a gift.\n\nSeriously, I'm just not a fan of the mechanic for personal playstile. Nothing to say against it working and being fun and effective!\n\nDo you think we will get repeatable way to shuffle your deck in spirit/tactic to maximize dwarf pipe ability within the mining archetype?  And do you think it is needed?\n\nEdited November 12, 2018 by Halberto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533025","commentId":3533025,"userName":"dalestephenson","timestamp":1542054156,"content":"> 39 minutes ago, Seastan said:\n> \n> Regardless of how easy it is to get 2 damage on Gimli, playing the axe and taking 2 damage is always going to be harder than just playing the axe.\n\nNot always -- Archery 2, for example, would make it exactly as easy.  But if you're simply gauging likelihood to get to effective six attack, you have to combine the likelihood of Gimli + axe + 2 damage *and* likelihood Gimli (without Axe) + 4 damage -- the latter case may not come up, but Thorin doesn't have a non-Axe path at all.  And I think Gimli should be given credit in the comparison for possibly *exceeding* effective six attack.  (Thorin should be given credit in the comparison for not possibly dying, which is no small thing....)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533046","commentId":3533046,"userName":"Halberto","timestamp":1542054870,"content":"Now that I think we indeed already have ally Bofur in tactic who will shuffle your deck. \n\nI should give mining archetype a try as soon as we get thorin released in a standard expansion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533063","commentId":3533063,"userName":"Seastan","timestamp":1542055285,"content":"> 2 minutes ago, dalestephenson said:\n> \n> Not always -- Archery 2, for example, would make it exactly as easy.\n\nI don't understand your point here. The presence of an Archery 2 enemy in play is the very thing I'm talking about when I say Axe+something else is harder to set up than Axe alone.\n\nAnd yes, this conversation is just me defending my statement about ease of setting up a permanent 6-strength attacker. There's a lot more to care about in an attacking hero, like ability, threat, trait, other stats, etc. I'm not saying that Thorin is the best attacking hero in the game just because he's the easiest to get to 6.\n\nI do think it's worth revisiting Gimli now that we have Open the Armory though. He could very well have gotten a lot better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533165","commentId":3533165,"userName":"GrandSpleen","timestamp":1542058174,"content":"I’ll include Thorin in a deck because he’s a great attacker with threat on the lower side, or because he’s a dwarf, or because he allows you to discard from your deck (for decks which desire such a thing. Although even if you do want this, it’s still a cost both mechanically and practically, because there is risk involved).  I would not look at a deck and think, “I need someone with easy setup” and immediately select Thorin as the best possible option. He would be a candidate but not a clear victor. \n\nAs for Aragorn, since you cited “keeping your threat down” as untrivial, you are now talking about sustaining the 6 attack across multiple rounds, instead of just ease of reaching 6 attack early in the game.\n\nIn that case, it’s a totally different discussion. Multiple rounds provide any hero with more time to set up. So if we are including “threat maintenance over time” as a variable to consider, the question becomes not “who can reach 6 attack early with least setup” but “whose ability gives more value over time.”\n\nAs a total off topic point, Thorin also has the ability to whiff in the late game if you have milled your entire deck and have no recycling. Probably not a big deal at that point.\n\nIf he’s included with leadership Dain on the table, he gets a nice boost (but so would Gimli)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533185","commentId":3533185,"userName":"Seastan","timestamp":1542058695,"content":"The threat management point was an aside. It wasn't needed to make my point, which is that Aragorn needs a 1-cost weapon + lower threat than engagement cost, whereas Thorin just needs a 1-cost weapon.\n\nI'm certainly talking about a sustained 6 attack. As pointed out before, there are plenty of ways to get 6 or above on a temporary basis for less setup."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533262","commentId":3533262,"userName":"Wandalf the Gizzard","timestamp":1542061233,"content":"> 2 hours ago, Seastan said:\n> \n> But that 1x card is just as likely to have been near the bottom of your deck, and you never would've seen it anyway. In fact, the number of times that Thorin accidentally discards your 1x card will be exactly cancelled out by the number of times he helps you find your 1x card by making your deck smaller.\n\nI wish more gamers understood this. Not just in LotR, but with most card games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533324","commentId":3533324,"userName":"dalestephenson","timestamp":1542064063,"content":"> 1 hour ago, Seastan said:\n> \n> I don't understand your point here. The presence of an Archery 2 enemy in play is the very thing I'm talking about when I say Axe+something else is harder to set up than Axe alone.\n> \n> And yes, this conversation is just me defending my statement about ease of setting up a permanent 6-strength attacker. There's a lot more to care about in an attacking hero, like ability, threat, trait, other stats, etc. I'm not saying that Thorin is the best attacking hero in the game just because he's the easiest to get to 6.\n> \n> I do think it's worth revisiting Gimli now that we have Open the Armory though. He could very well have gotten a lot better.\n\nExcept in rare cases, the presence of enemies or effects that give you 2+ archery isn't something you set up at all, it's just something that happens in that particular quest.  And *in that particular situation* the \"set up\" is exactly the same for both -- find the Axe.  However, if you're not evaluating \"how hard was it in this particular run-through to get to six\" and instead evaluating \"how likely was it in theory that this quest would generate extra damage to get Gimli to six\", I can see adding that to the evaluation.\n\nBut if you're interested in just the likelihood of getting to six, it's not just a matter of noting that it's easier for Thorin to get to six with an axe, it also matters that Gimli can get to six *without* an axe.  With 3x Dwarrowdelf Axe and 3x Open the Armory an axe is likely, especially if you mulligan for it (would you?), but that's true for Gimli as well -- and damaging Gimli is *easy* if you have an engaged enemy.  If you don't have an engaged enemy, it hardly matters whether they can attack for effective six or not.  (OK, there's battle questing, but there Thorin only starts with a +1 advantage on undamaged Gimli).\n\nI've played TaGimli/Thalin/SpEowyn against a majority of the released quests in the game, but haven't tried him with Open the Armoury.  Between taking an initial undefended and archery damage I had little trouble getting him to six attack whether one of my axes showed up or not (I didn't mulligan for it, I valued Honour Guard and A Test of Will rather higher).  But I did kill him a few times along the way.  I also put the Skilled Healer boon on Gimli for the saga, which helps."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533364","commentId":3533364,"userName":"Seastan","timestamp":1542065864,"content":"> Quote\n> \n> With 3x Dwarrowdelf Axe and 3x Open the Armory an axe is likely, especially if you mulligan for it (would you?), but that's true for Gimli as well -- and damaging Gimli is *easy* if you have an engaged enemy. \n\nI grant that getting damage on Gimli is easy. But even the easiest task is harder than doing nothing.\n\nTaking an undefended attack for 4 is certainly worth considering if you are desperate for 6 attack, but I think many people would consider it too risky and end up exhausting and defending with Gimli or someone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533681","commentId":3533681,"userName":"Alonewolf87","timestamp":1542096229,"content":"> 15 hours ago, Seastan said:\n> \n> So while both Thorin and Aragorn can get to 6 with a 1-cost, non-restricted attachment, Thorin makes no additional demands (apart from the rare \"can't take non-combat damage﻿\").\n\nThis is a question just so I can better understand the finer points of the rules. Wouldn't also a \"immune to player cards effects\" enemy be immune to the damage inflicted by Thorin's ability?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3533902","commentId":3533902,"userName":"Wandalf the Gizzard","timestamp":1542120125,"content":"> 6 hours ago, Alonewolf87 said:\n> \n> This is a question just so I can better understand the finer points of the rules. Wouldn't also a \"immune to player cards effects\" enemy be immune to the damage inflicted by Thorin's ability?\n\nYes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534051","commentId":3534051,"userName":"Alonewolf87","timestamp":1542126226,"content":"> 1 hour ago, Wandalf the Gizzard said:\n> \n> Yes.\n\nThought so, thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534072","commentId":3534072,"userName":"dalestephenson","timestamp":1542127210,"content":"> 16 hours ago, Seastan said:\n> \n> I grant that getting damage on Gimli is easy. But even the easiest task is harder than doing nothing.\n> \n> Taking an undefended attack for 4 is certainly worth considering if you are desperate for 6 attack, but I think many people would consider it too risky and end up exhausting and defending with Gimli or someone else.\n\nI'll grant that getting to six if you have an Axe in hand is easier with Thorin, since even with an enemy engaged it may be too weak or too strong to give Gimli the damage he needs.  I'm just not convinced that getting to six is easier overall with Thorin, since he needs the axe to get there.  It's possible,  with 3x Open the Armoury, especially if you mulligan for Axe/Open, but it may be quest dependent.\n\nMany people may consider it too risky to take a 4-strength attack early -- but I generally didn't with my deck, though in the cases where I had Hasty Stroke or Close Call in hand I wasn't risking death.  Of course, since it was a SpEowyn/Thalin/Gimli deck, the first undefended attack doesn't *have* to kill Gimli if shadow enhanced -- Thalin is more expendable.  Thalin also made it so that getting to max damage *immediately* isn't critical -- no matter who the first enemy to engage was, taking a 1-4 attack undefended would almost always give me enough damage to one-shot it.  (In the case where a 5-6 attack enemy is first to engage, I would defend with Gimli, of course -- and if Hill Troll takes out Gimli on turn 2 due to an unfortunate shadow in Journey Down the Anduin, I'd scoop.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534124","commentId":3534124,"userName":"Wandalf the Gizzard","timestamp":1542128991,"content":"I want a six attack hero on turn one. If I had the choice between Gimli and Thorin; I'm taking Thorin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534142","commentId":3534142,"userName":"Halberto","timestamp":1542129643,"content":"Or beorn with a 1 attack 1 cost ally..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534851","commentId":3534851,"userName":"Seastan","timestamp":1542154686,"content":"> 16 hours ago, Alonewolf87 said:\n> \n> This is a question just so I can better understand the finer points of the rules. Wouldn't also a \"immune﻿ to player cards effects\" enemy be immune to the damage inflicted by Thorin's ability?\n\nYes. They'd also be immune to Aragorn's passive defense reduction.\n\n \n\n> 7 hours ago, dalestephenson said:\n> \n> Many people may consider it too risky to take a 4-strength attack early -- but I generally didn't with my deck, though in the cases where I had Hasty Stroke or Close Call in hand I wasn't risking death.  Of course, since it was a SpEowyn/Thalin/Gimli deck, the first undefended attack doesn't *have* to kill Gimli if shadow enhanced -- Thalin is more expendable.  Thalin also made it so that getting to max damage *immediately* isn't critical -- no matter who the first enemy to engage was, taking a 1-4 attack undefended would almost always give me enough damage to one-shot it.  (In the case where a 5-6 attack enemy is first to engage, I would defend with Gimli, of course -- and if Hill Troll takes out Gimli on turn 2 due to an unfortunate shadow in Journey Down the Anduin, I'd scoop.)\n\nI think Gimli can be really great if you build around him. Hasty Stroke/Close Call are good examples of how you can safely take that early hit. But that's more setup. Without those, I don't think I'd take that undefended attack if I were playing a serious game (say, I was playing head-to-head Woodland Realm, or some multiplayer game where I'd drag everyone down if I lost a hero). In a quick solo game where I can scoop or alternate-universe things, sure. But I think ease of resetting the game is out of the scope of the hero comparisons I'm trying to make. The assumption should be that you are always trying to make the best move."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3534957","commentId":3534957,"userName":"Wandalf the Gizzard","timestamp":1542163584,"content":"> 2 hours ago, Seastan said:\n> \n> But I think ease of resetting the game is out of the scope of the hero comparisons I'm trying to make. The assumption should be that you are always trying to make the best move.\n\nThis sentence holds more weight than people realize when making many hypothetical conjectures."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535129","commentId":3535129,"userName":"Stewart777","timestamp":1542192651,"content":"> 20 hours ago, Wandalf the Gizzard said:\n> \n> Yes.\n\nSo would that mean that an enemy that is \"immune to player cards effects\" would say ignore Rivendell Blade [http://hallofbeorn.com/LotR/Details/Rivendell-Blade-RtR]'s effect, which is\n\n> Quote\n> \n> When attached character attacks an enemy, that enemy gets -2 defense-small.png [http://hallofbeorn.com/Images/defense-small.png] until the end of the phase.\n\nSo an enemy with the immune text would only be affected by a character's base attack and defence?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535133","commentId":3535133,"userName":"Miceldars","timestamp":1542192948,"content":"\"Immune to player cards effects\" means immune to all effect that targets the enemy himself. So yes, he would be immune to Rivendell blade.\n\nHowever, you can still boost your character's attack and defense, because those effects targets the attacking character, and not the enemy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535139","commentId":3535139,"userName":"Stewart777","timestamp":1542194516,"content":"> 25 minutes ago, Miceldars said:\n> \n> \"Immune to player cards effects\" means immune to all effect that targets the enemy himself. So yes, he would be immune to Rivendell blade.\n> \n> However, you can still boost your character's attack and defense, because those effects targets the attacking character, and not the enemy.\n\nAh great, thanks for the clarification."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535235","commentId":3535235,"userName":"dalestephenson","timestamp":1542205332,"content":"> 13 hours ago, Seastan said:\n> \n> I think Gimli can be really great if you build around him. Hasty Stroke/Close Call are good examples of how you can safely take that early hit. But that's more setup. Without those, I don't think I'd take that undefended attack if I were playing a serious game (say, I was playing head-to-head Woodland Realm, or some multiplayer game where I'd drag everyone down if I lost a hero). In a quick solo game where I can scoop or alternate-universe things, sure. But I think ease of resetting the game is out of the scope of the hero comparisons I'm trying to make. The assumption should be that you are always trying to make the best move.\n\n\"Best\" really depends on what you're looking for.  I'll agree that if you're trying to get Thorin and Gimli *safely* to effective six, Thorin's definitely going to be easier.  But if you're aggressive with Gimli -- and I am, in solo play -- I think Gimli's easier.  Whether that aggression is wise or not is a separate issue, and is likely quest-dependent.\n\nI mentioned Hasty Stroke/Close Call not because I make sure they are in hand before taking a potentially Gimli-killing hit, but because they *may* be in my hand for a potentially Gimli-killing hit, and that alters the generic odds of the early 4-strength undefended attack.  So if I have a 25% chance of an attack-boosting shadow, but have about a 44% chance of either Hasty Stroke or Close Call being in my hand (published version of deck, using no sideboard cards), my chance of losing Gimli to a first-turn undefended 4-strength attack in this quest is just 14% overall -- and if I survive, I can kill the enemy if def + hp don't exceed seven (thanks to Thalin).\n\nBut suppose I *don't* take a 4-strength attack undefended without shadow protection in hand.  Then in the same situation, 44% of the time I take undefended and get to six, and 56% I defend (if not questing) with Gimli and end up with 2-4 damage, meaning that I might be at six with the right shadow even safely -- and in no case will I lack the damage to match or exceed Thorin's attack at the point we are given an Axe.\n\nReally the only case where Thorin has an advantage on getting to six before Gimli with an axe, even when being cautious with Gimli is when the first chance to attack involves an enemy with only 1 attack, or a very strong enemy that Gimli can't risk defending -- the first kind of enemy isn't likely to need six attack, and the second kind of enemy is likely to be too tough for six.  Thorin's big advantage is that if Gimli is defending he won't be available to attack, and that makes Thorin better -- not first to get to six, but still the first to *use* it.\n\nIn multiplayer risking the loss of Gimli wouldn't affect just myself, but powering up Gimli would be in the interest of the group, and now somebody else might have some shadow protection as well.  But with more reveals there's also more chance of non-combat damage (or a less dangerous enemy) to power up Gimli more safely.  I've played my Gimli deck two-handed with the LeAragorn/Theodred/LoDenethor deck but never with another live player, so I've never felt the need to be less aggressive there.\n\nBut what about Woodland Realm?  Suppose a Wild Bear comes out of the deck turn 1, would I be reckless in engaging him and taking him undefended?  Unless my opponent has foreknowledge of my deck and playstyle, I think that gamble would pay off--it's a race, and getting Gimli in enemy killing form ASAP is in my best interest; going to 6 attack on turn one goes a long way towards winning.  Excluding the Wild Bear that came out of the deck, there are 69 other possible cards.  Of those, only 13 force me to add attack.  Even without shadow protection in hand, there's a little less than 19% chance that I lose a hero (likely costing me the game), and a little over 81% chance that I've got Gimli at max base attack and a 1-point enemy out of staging and into the discard pile (giving me a big edge over my rival, IMO).  I like those odds."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535272","commentId":3535272,"userName":"sappidus","timestamp":1542207431,"content":"> 34 minutes ago, dalestephenson said:\n> \n> I like﻿﻿﻿﻿﻿ those odds.\n\nMainly this discussion is making me want to run a deck that has both Thorin and Gimli, ha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535340","commentId":3535340,"userName":"Yepesnopes","timestamp":1542211607,"content":"In multiplayer Bard the Bowman is “the man” you are looking for."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535391","commentId":3535391,"userName":"ColinEdwards","timestamp":1542214666,"content":"> 2 hours ago, dalestephenson said:\n> \n> I﻿﻿ like those odds.﻿\n\nI just don't see it; you are still taking 2 threat, giving up some flexibility about putting damage on a second enemy (through armour), and need to take an undefended attack or something. \n\n(I totally get the point that Gimli can be more effective if you build around him, but it's a lot of setup.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3535419","commentId":3535419,"userName":"dalestephenson","timestamp":1542216124,"content":"> 2 minutes ago, ColinEdwards said:\n> \n> I just don't see it; you are still taking 2 threat, giving up some flexibility about putting damage on a second enemy (through armour), and need to take an undefended attack or something. \n> \n> (I totally get the point that Gimli can be more effective if you build around him, but it's a lot of setup.)\n\nWhen I said \"I like the odds\" I was referring to taking a 4-strength undefended attack from a Wild Bear for my SpEowyn/Thalin/TaGimli deck, despite having no shadow protection, against an unknown Woodland Realm encounter deck.  I wasn't trying to claim that TaGimli was a better hero in general for Woodland Realming, or that my 53-card SpEowyn/Thalin/TaGimli deck is better than Seastan's 50-card Arwen/SpBeregond/Stonehelm -- I doubt Gimli is better than Stonehelm, and I'd lay serious money on Seastan having the better deck.  Neither is relevant to the issue of whether TaGimli *should* take the bear undefended in that hypothetical.  I think he should.\n\nIt doesn't take \"a lot of setup\" to get TaGimli's effective attack past Stonehelm's.  All it takes is damage, and getting damage is easy.  What's harder is taking damage without *risk* while not exhausting to defend, and that's what makes Stonehelm a more practical attacker for a cheaper cost.  You can, of course, boost Gimli's attack way past Stonehelm by adding HP and stacking on more damage, but there's also a principle of diminishing returns; for every quest there's a magic number that will kill *most* foes, and boosting one hero's attack past that doesn't accomplish much (unless you're using Firefoot or you're mostly concerned about a boss fight)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536043","commentId":3536043,"userName":"Seastan","timestamp":1542237846,"content":"> 8 hours ago, dalestephenson said:\n> \n> I mentioned Hasty Stroke/Close Call not because I make sure they are in hand before taking a potentially Gimli-killing hit, but because they *may* be in my hand for a potentially Gimli-killing hit, and that alters the generic odds of the early 4-strength undefended attack.  So if I have a 25% chance of an attack-boosting shadow, but have about a 44% chance of either Hasty Stroke or Close Call being in my hand (published version of deck, using no sideboard cards), my chance of losing Gimli to a first-turn undefended 4-strength attack in this quest is just 14% overall -- and if I survive, I can kill the enemy if def + hp don't exceed seven (thanks to Thalin).\n\nThe fact that Hasty Stroke/Close Call *may* be in your hand is still setup, because those are cards in your deck that Thorin doesn't need. Instead of those cads, the Thorin deck could run Dwarven Axe or some extra search cards to make finding the Dwarrowdelf Axe easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536100","commentId":3536100,"userName":"GrandSpleen","timestamp":1542241583,"content":"Gimli doesn't need them either, it's just an option.  Can't really give a Thorin a point in this column for this reason; Gimli has native ability capable of achieving a 6 attack if the encounter deck delivers unto you a scenario which requires a 6-attack reprisal.\n\nIf you can't swing back for 6, it's because you didn't draw an enemy which requires you to swing back for 6... so it wasn't needed!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536122","commentId":3536122,"userName":"dalestephenson","timestamp":1542243281,"content":"> 1 hour ago, Seastan said:\n> \n> The fact that Hasty Stroke/Close Call *may* be in your hand is still setup, because those are cards in your deck that Thorin doesn't need. Instead of those cads, the Thorin deck could run Dwarven Axe or some extra search cards to make finding the Dwarrowdelf Axe easier.\n\nSure, but your Thorin deck *does* have Hasty Stroke (two copies, same as mine), and *doesn't* have Dwarven Axe.  (I do have a lone copy of Dwarven Axe -- I prefer the cheaper Dwarrowdelf, but +2 attack is better than +1 plus direct on immune enemies or in conjunction with Heavy Stroke -- with double tactics the extra cost isn't a big deal.)  I don't pack Hasty Stroke specifically for Gimli's initial undefended, which is often the only attack he takes all quest -- I pack it for all those other defenses that happen during the game.  Close Call is especially suited to the initial undefended, but I don't mulligan for it, and I've used it to handle bad treacheries or a strategic undefended later in the quest.  The other card that helps with the initial undefended is Honour Guard, but I pack three of those in every double tactics deck; I love that card.  The cards in my deck specifically for Gimli are Dwarrowdelf Axe, Dwarven Axe, Citadel Plate, Quick Strike, plus Heavy Stroke in the sideboard -- Citadel Plate is the only one of those cards that wouldn't benefit Stonehelm just as much as TaGimli."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536349","commentId":3536349,"userName":"Yepesnopes","timestamp":1542268080,"content":"Two pages discussion... I can’t count how many solo decks are out there that can reach 6 axes, or deal with 6 def + wounds enemies consistenly from turn one.\n\nThe only thing I can say is that Seastan has earned such respect and reputation in this community (very well deserved) that his Thoron deck can pull a two pages discussion.\n\nCudos mate! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536361","commentId":3536361,"userName":"Network57","timestamp":1542270390,"content":"> 38 minutes ago, Yepesnopes said:\n> \n> The only thing I can say is that Seastan has earned such respect and reputation in this community (very well deserved) that his Thoron deck can pull a two pages discussion.\n\nfor when you absolutely need a deck to prove radioactive decay!\n\nEdited November 15, 2018 by Network57\nNinja typo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536378","commentId":3536378,"userName":"Halberto","timestamp":1542273661,"content":"I was not thrilled by Thorin Hero when I saw him spoiled where Gildor seemed clearly the best of the duo.\n\nNow I realized he is better than i thought at first glance. Look forward  to get him by regular AP and try him in practice.\n\nEdited November 15, 2018 by Halberto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536398","commentId":3536398,"userName":"ColinEdwards","timestamp":1542278771,"content":"I think the threat difference between 11 and 9 is more significant than it might appear too. Dwarf decks often benefit from an extra turn or two to get set up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536408","commentId":3536408,"userName":"Halberto","timestamp":1542280227,"content":"> 7 minutes ago, ColinEdwards said:\n> \n> I think the threat difference between 11 and 9 is more significant than it might appear too. Dwarf decks often benefit from an extra turn or two to get set up.\n\nTrue but I think that the main point here is that both heroes and their ability  are not strictly linked to dwarves decks and synergies which mostly are linked directly or indirectly  to the number of dwaves on the table (Gimly in particular.  Thorin seems at home in dwarf mining although not fully dependent from it). \n\nNew Dain would combo well with Thorin in a mining deck. Old Dain combos well with both for attack boost but neither I probably the best choice in combination with Dain ( in multiplayer this don't matter as dain boost cover all the table. Still crazy after what? 7 years?).\n\nProbably ally Gimli fits better than both his hero versions in a typical dwarf swarm deck and there are better option than Thorin for a such kind of deck either (although not so many in tactic).\n\nLE Thorin oakshield with LeDain swing for 4 in turn 1 and for an equivalent of 6 with a 1 cost are attachment you can pay with Thorin additional resource  since with the in sphere narvi belt you don't need a tactic hero to pay for off sphere cards. However you often don't need attachment attack boost in dwarves swarm decks \n\nRequire set up and not feasible in turn 1 of course, so no competition with TaThorin/Gimli in that regard."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3536698","commentId":3536698,"userName":"Seastan","timestamp":1542299552,"content":"> 15 hours ago, dalestephenson said:\n> \n> Sure, but your Thorin deck *does* have Hasty Stroke (two copies, same as mine), and *doesn't* have Dwarven Axe.  (I do have a lone copy of Dwarven Axe -- I prefer the cheaper Dwarrowdelf, but +2 attack is better than +1 plus direct on immune enemies or in conjunction with Heavy Stroke -- with double tactics the extra cost isn't a big deal.)  I don't pack Hasty Stroke specifically for Gimli's initial undefended, which is often the only attack he takes all quest -- I pack it for all those other defenses that happen during the game.  Close Call is especially suited to the initial undefended, but I don't mulligan for it, and I've used it to handle bad treacheries or a strategic undefended later in the quest.  The other card that helps with the initial undefended is Honour Guard, but I pack three of those in every double tactics deck; I love that card.  The cards in my deck specifically for Gimli are Dwarrowdelf Axe, Dwarven Axe, Citadel Plate, Quick Strike, plus Heavy Stroke in the sideboard -- Citadel Plate is the only one of those cards that wouldn't benefit Stonehelm just as much as TaGimli.\n\nI'm not comparing specific decklists here. Just which hero (Gimli or Thorin) will be able to consistently attack for 6 with the least amount of setup. Getting into decklists makes this discussion impossible. For example, I mulligan for my Axe, but you might not. That's a huge factor in terms of consistency. Your decklist has several cards that seem to help you take a potential 4-attack undefended on Gimli. In that case, maybe Gimli is easier to set up in the cases where those cards happen to be in your hand. But for a fair comparison in terms of setup cost, the Thorin deck should be granted just as many extra cards to help boost Thorin to 6.\n\n \n\n> 16 hours ago, GrandSpleen said:\n> \n> Gimli doesn't need them either, it's just an option.  Can't really give a Thorin a point in this column for this reason; Gimli has native ability capable of achieving a 6 attack if the encounter deck delivers unto you a scenario which requires a 6-attack reprisal.\n> \n> If you can't swing back for 6, it's because you didn't draw an enemy which requires you to swing back for 6... so it wasn't needed!\n\nBut the fact that it's an option doesn't help of you're never going to take it. Which is why we are now discussing the legitimacy of taking a undefended 4-attack early in the game. If it were a serious game and I didn't have a cancellation card in hand, I probably wouldn't."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3537155","commentId":3537155,"userName":"dalestephenson","timestamp":1542323130,"content":"> 5 hours ago, Seastan said:\n> \n> I'm not comparing specific decklists here. Just which hero (Gimli or Thorin) will be able to consistently attack for 6 with the least amount of setup. Getting into decklists makes this discussion impossible. For example, I mulligan for my Axe, but you might not. That's a huge factor in terms of consistency. Your decklist has several cards that seem to help you take a potential 4-attack undefended on Gimli. In that case, maybe Gimli is easier to set up in the cases where those cards happen to be in your hand. But for a fair comparison in terms of setup cost, the Thorin deck should be granted just as many extra cards to help boost Thorin to 6.\n\nSo let's give Thorin six more card slot so that he can include 3x of Bow of Yew and 3x of Dagger of Westernessee, which as far as I can see is the only other way to add two effective attack for one tactics resource, and his percentages go up slightly.  If you specify a second tactics hero you can include 3x Dwarven Axe, and a leadership hero would bring in Dunedain Mark as an option.  But not all setup is created equally.  Putting twelve weapons in the deck that all go on Stonehelm is a lot dead space.  Having Hasty Stroke, a core set staple, in your deck might have an impact on Gimli's ability to get to six -- but it's not likely to be *used* in getting Gimli to six and it isn't remotely a dead card when Gimli is at full attack mode.  (Close Call is a much more narrowly useful card, and unlike Hasty Stroke can be included without having a different-sphere hero, I think it's fair to label it a Gimli setup card.)\n\nEven without a decklist, other factors beside deck space are massive influencers, as you note.  Doing a mulligan for Axe/Armory absence is *huge* in terms of the impact of getting six, without regard to Gimli vs Thorin.  Yet I wouldn't mulligan for Gimli in practice even with 3x Axe/Armory in deck (not a bad plan, I think I should work it in, especially since the Citadel Plate could be grabbed by it), because *even if* I don't get the Axe, whichever enemy I engage first is likely to provide enough damage for me to one-shot that enemy.  That's not true of Thorin, he's not impacted by the strength of the engaged enemy.  Having Close Call in hand would make a *huge* difference to your willingness to take an undefended attack with Gimli -- but for me it only affects the likelihood of Gimli *surviving* the undefended attack.\n\nIt's indisputably true that Thorin Stonehelm can get to six quickly with Armory/Dwarrowdelf and Gimli can't without cooperation from the encounter deck.  It's also indisputably true that Gimli can get to six without attachments, with cooperation from the encounter deck, and Thorin can't.  But quantifying \"cooperation from the encounter deck\" for TaGimli's is quest dependent and play-style dependent.  It also matters if you're comparing time-to-get-to-six or likelihood-of-being-at-six-at-your-first-chance-to-attack -- since Gimli's primary damage mechanism is likely to be enemies, if you have no enemies he's not likely to get to six at all, while Thorin can get to six easily with nothing but locations popping out of the deck.  It doesn't do any good, but he'll have it.\n\nOf course, the concept of six as a magic number is also quest dependent.  For some quests it's lower, for others it's higher.  Here's the distribution in Woodland Realm:\n\n11 -- Ungoliant's Spawn (unique, cost 3)\n\n9 -- Chieftain Ufthak (unique, cost 3), Beast of Taur-Nu-Fuin (cost 2)\n\n8 -- Mirkwood Spider (cost 1), Pack of Wargs (cost 1), Mirkwood Patrol (cost 1)\n\n6+stage -- Wild Bear (cost 1)\n\n7 -- Giant Spider (cost 1)\n\n6 -- Wicked Spider (cost 1)\n\n5 -- Ambushing Orcs (cost 1)\n\n4 -- Black Forest Bats (cost 0), Wolf Rider (cost 0), Wild Wargs (cost 1)\n\n3 -- Spiders of Mirkwood (cost 0), Mirkwood Flock (cost 1)\n\nGoing from 4 to 6 only lets Thorin one-shot two more enemies, but 6 to 8 will get him five more one-shot targets."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3537164","commentId":3537164,"userName":"dalestephenson","timestamp":1542324062,"content":"> 6 hours ago, Seastan said:\n> \n> But the fact that it's an option doesn't help of you're never going to take it. Which is why we are now discussing the legitimacy of taking a undefended 4-attack early in the game. If it were a serious game and I didn't have a cancellation card in hand, I probably wouldn't.\n\nJust to cross-check my crazy against a better player, I went back to Beorn's Path and read the playthrough of the original SpEowyn/TaGimli/Thalin deck in Beorn's Path.  Turn 1, with no Hasty stroke in hand and a Citadel Plate *in hand* that could be played on turn two, Beorn optionally engaged the Jailor and took it undefended -- that's not a four strength attack, but Gimli already had one damage and all the damage-shadows in that quest send undefended damage to hero killing levels (where it'd kill poor Thalin I think, since Gimli was more important.) In a later turn once Citadel Plate was attached Gimli took *two* undefended attacks, and a damage-shadow on either one of which would have resulted in a hero death (again, likely Thalin).  Again no Hasty Stroke in hand.  I was introduced to the game with Beorn's Path, so it's probably where I got the idea that taking risks with Gimli early was an entirely rational thing to do in a \"serious game\".\n\nYour point that an early hero death via risk-taking would be unfair in a multi-player game is well taken, though in multi-player neither Stonehelm nor Gimli can touch Bard for effective six quickly.  Any +1 will do.\n\nMy early point on the desirability of taking a four strength bear attack undefended in Woodland Realm (stage one) relied on Thalin to get the seventh damage point.  The 6-and-under crowd all give enough damage for Gimli to one-shot, but he needs more than his native HP to knock off any of the others.  Without Thalin or other help do I take the Bear undefended if he comes out round one?  I don't think so -- I'm not going to optionally engage anything I can't kill."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3537916","commentId":3537916,"userName":"Seastan","timestamp":1542389584,"content":"> 17 hours ago, dalestephenson said:\n> \n> I was introduced to the game with Beorn's Path, so it's probably where I got the idea that taking risks with Gimli early was an entirely rational thing to do in a \"serious game\".\n> \n> Your point that an early hero death via risk-taking would be unfair in a multi-player game is well taken, though in multi-player neither Stonehelm nor Gimli can touch Bard for effective six quickly.  Any +1 will do.\n\nWe're getting into really subjective territory here, but let me define what I mean by \"serious game\": a game where your win/loss outcome matters to anyone other than yourself. So while a multiplayer game certainly qualifies, it's not the only situation that does. Woodland Realm isn't the only solo situation either. If I'm participating in some sort of competition, like your solo league, where I care about my win/loss ratio, I'd consider that serious. Likewise if I'm going to be posting my win/loss percentage alongside my deck to give people an impression of how powerful it is.\n\nThat said, regarding Beorn's path - a loss from an undefended attack of round 1 is not a big deal. Simply shuffle and start again. I don't think Beorn had committed to doing a in-depth writeup on every loss for the Path, so I don't see what makes this a big deal. Regarding the undefended attacks taken later in the game, well Gimli had 9 hit points and 3 damage, so taking two attacks of strength 2 undefended was not risking Gimli's life. After assigning the first 2 damage to Gimli, a hero-killing shadow on the second attack (about 10% chance) could have gone to killing Thalin anyway. Or, if Beorn was waiting for the quest to be finished before starting the in-depth writeup, he again could have just scooped and restarted."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538058","commentId":3538058,"userName":"dalestephenson","timestamp":1542395042,"content":"From the comments, the writeup was actually the third shot at the quest, the first two being losses.  The more likely you are to lose, the more justified you are in taking risks, I think.  In the solo league a master like Rouxxor or yourself may well look askance at taking a 15% chance of hero death round one, since you're confident that you can win without it.  For someone like myself, I might think that my only chance at winning with zero tokens is to get lucky, so why not be aggressive and take risks?  Optionally engaging an enemy, taking it undefended, then (if you survive) killing the enemy improves my board state dramatically if it works, and it will work most of the time.  If I lose a hero playing aggressively, I'm not at all confident I would have gotten ahead of the quest playing conservatively.  So I think player skill and deck strength factor (plus quest difficulty and damage-increasing shadow frequency) are no small factors in evaluating whether to risk an undefended or not.\n\nOn the later undefended attacks in Beorn's Path, with 9 hp and 3 damage, taking two 2-strength undefended risks *a* hero's life (likely Thalin) if the damaging shadows come out.  Gimli can absorb a maximum of 5 damage, the attacks combined account for 4 damage.  Hummerhorn's shadow does 2 damage to each defending player character if undefended, it would kill Eowyn outright and result in the death of either Thalin or Gimli from the attacks.  Dol Goldur Orcs would add 3 to the attack for an undefended attack; if it came first Gimli could absorb five and then defend against the second attack, though that'd leave two engaged enemies.  If it came on the second attack, hero death.  Driven by Shadow and Cavern Guaradian on either attack would cause Gimli's Citadel Plate to go away, which would be deadly on the second attack but survivable on the first by defending the second.  To that point in the quest, two of those had come out (one copy Cavern Guardian and Dol Goldur Orcs), leaving five cards in the remaining encounter deck to give grief, out of 27 remaining if I'm counting correctly.  So 19% of things going badly wrong -- well worth the risk, given that taking at least one undefended was unavoidable in any case (Gimli was only ready character) and not killing an enemy means at least two attacks the following round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538346","commentId":3538346,"userName":"Seastan","timestamp":1542411739,"content":"> 4 hours ago, dalestephenson said:\n> \n> So I think player skill and deck strength factor (plus quest difficulty and damage-increasing shadow frequency) are no small factors in evaluating whether to risk an undefended or not.\n\nYou're right. This is what makes picking apart decisions made during a particular playthrough so difficult. I actually think the risk Beorn took by taking those two attacks undefended was far less than 19% and was closer to 5%, which is a fine play by me.\n\n \n\nBringing it back to Thorin vs Gimli:\n\nEnemy with 0 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs 2 axes)\n\nEnemy with 1 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and a couple rounds of undefended attacks)\n\nEnemy with 2 attack appears: Thorin is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and needs to survive an undefended attack for 2)\n\nEnemy with 3 attack appears: Thorin is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and needs to survive an undefended attack for 3)\n\nEnemy with 4 attack appears: Gimli is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs to survive an undefended attack for 4)\n\nEnemy with 5 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs 2 axes)\n\n \n\nUltimately, I'm still of the opinion that Thorin requires the least conditions/setup to be able to consistently attack for 6 against an enemy engaged with you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538428","commentId":3538428,"userName":"GrandSpleen","timestamp":1542419495,"content":"discussion got seriously focused on Gimli, but there were other heroes in the running here. I think we agreed right on the first page of this thread, for example, that Grimbeorn can get the magic effective 6 as quickly/with as little setup as Thorin, but at greater cost. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538439","commentId":3538439,"userName":"Seastan","timestamp":1542420761,"content":"> 19 minutes ago, GrandSpleen said:\n> \n> discussion got seriously focused on Gimli, but there were other heroes in the running here. I think we agreed right on the first page of this thread, for example, that Grimbeorn can get the magic effective 6 as quickly/with as little setup as Thorin, but at greater cost. \n\nGreater cost is greater setup though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538551","commentId":3538551,"userName":"Yepesnopes","timestamp":1542441546,"content":"A LeAragorn, LeGimli, SpLegolas deck can quest for 6 Wp and attack for 7 Att on the first round with no need of any card set up for example.\n\nEdited November 17, 2018 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538562","commentId":3538562,"userName":"GrandSpleen","timestamp":1542443048,"content":"To summarize,  any single hero native ability (pay a resource) counts as setup, except discarding from the top of your deck which doesn’t count as a cost,  and that such setup constitutes greater setup than 3x dwarrowdelf axe.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538567","commentId":3538567,"userName":"ColinEdwards","timestamp":1542444267,"content":"> 15 minutes ago, GrandSpleen said:\n> \n>  except discarding from the top of your deck which doesn’t count as a cost\n\nI'd go a bit further: not only is discarding -not- much of a cost, there are many things that can actively benefit from it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538585","commentId":3538585,"userName":"Halberto","timestamp":1542451272,"content":"> 1 hour ago, ColinEdwards said:\n> \n> I'd go a bit further: not only is discarding -not- much of a cost, there are many things that can actively benefit from it.\n\nNot yet so many but clearly some and likely few others (probably powerful) to come in future packs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538608","commentId":3538608,"userName":"ColinEdwards","timestamp":1542455507,"content":"> 6 hours ago, Halberto said:\n> \n> Not yet so many but clearly some and likely few others (probably powerful) to come in future packs.\n\nEven right now I think there are a lot better options for fishing stuff out of your discard pile than your deck. Unless you are actually running out of cards, stuff is probably more valuable discarded.\n\nYou don't need to be running a full-on mining deck to take advantage of Orophin, a Hammersmith etc.\n\nEdited November 17, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538645","commentId":3538645,"userName":"dalestephenson","timestamp":1542461703,"content":"> 13 hours ago, Seastan said:\n> \n> You're right. This is what makes picking apart decisions made during a particular playthrough so difficult. I actually think the risk Beorn took by taking those two attacks undefended was far less than 19% and was closer to 5%, which is a fine play by me.\n\nHow are you figuring 5% -- are you including the negative impact of *not* taking the attacks undefended?  In that case it might be below 5%, because I don't see how he'll pull that quest off without eliminating an enemy.  But in terms of immediate hero death, it's definitely not 5%.  At the time of the second atttack, there were 26 unrevealed cards and 5 shadows left that would kill a hero if they came out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538792","commentId":3538792,"userName":"Seastan","timestamp":1542476785,"content":"> 7 hours ago, GrandSpleen said:\n> \n> To summarize,  any single hero native ability (pay a resource) counts as setup, except discarding from the top of your deck which doesn’t count as a cost,  and that such setup constitutes greater setup than 3x dwarrowdelf axe.  \n\nI don't think any native hero ability counts as setup. I grant Tactics Aragorn as having a no-setup way to attack for 4, for example. But let me break down Grimbeorn a bit:\n\n1. To attack for 6 on turn 1, both Thorin and Grimbeorn need a 1-cost attachment. In addition, Grimbeorn needs to have 1 resource, while Thorin needs to have 1 card in your deck.\n\n2. Then to continually attack for 6 for the rest of the game, Grimbeorn needs to spend resource per attack, while Thorin needs to discard one card from your deck per attack.\n\nSo the question is, is spending 1 resource harder than discarding 1 card from your deck? I argue that it is. For example, if you are using Dagger of Westernesse to boost Grimbeorn's attack, the only way you can achieve the turn-1 attack for 6 is if you have another tactics hero to pay for the Dagger (or some other trickery like A Good Harvest). Thorin does not require such a condition.\n\nThorin does require discarding a card from your deck. But in most decks, even non-mining ones that Thorin is splashed into, this is not even a cost - it's a benefit. You are (probably) not going to draw through your whole deck anyway. So in a deck that is not using search effects like Heed the Dream, discarding your top card is no different than discarding your bottom card that you were never going to draw anyway. I consider this a slight benefit because you actually gain a bit more knowledge of the cards you are likely to draw into and can plan accordingly.\n\nImagine that you never draw more than 40 cards in a game, and you don't have any full-deck or repeatable search cards in your deck (Heed the Dream, Master of the Forge, etc.). At the beginning of the game, after shuffling your deck and drawing your hand, you are given the option to discard 10 random cards from your deck (doesn't matter from where, could be top, middle, bottom - you just shuffled). Would you do it? I think it is a benefit to do so, because for no cost, you now have more precise information about what is in your deck and can now base your strategy around knowing that you are never going to draw into certain cards.\n\nTo take it to the extreme: Imagine after shuffling that all your copies of Steward of Gondor are on the bottom of your deck, and you will have no way of getting to them the whole game. Is it more beneficial to have this information or not?\n\n> 2 hours ago, dalestephenson said:\n> \n> How are you figuring 5% -- are you including the negative impact of *not* taking the attacks undefended?  In that case it might be below 5%, because I don't see how he'll pull that quest off without eliminating an enemy.  But in terms of immediate hero death, it's definitely not 5%.  At the time of the second atttack, there were 26 unrevealed cards and 5 shadows left that would kill a hero if they came out.\n\nI was considering the risk of taking both attacks of strength 2 undefended vs. defending one of them with Gimli. Since Thalin had 3 hit points remaining, one of the undefended attacks could have gone to him.  I realize Beorn didn't actually do this, which significantly bumps up his risk of losing a hero, but that's where I'm getting my 5% figure from.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3538961","commentId":3538961,"userName":"GrandSpleen","timestamp":1542497982,"content":"If discarding from the top of your deck is not a problem, it would be a good decision to use Zigil Miner blindly before you draw into an Imladris Stargazer (assuming you're using both cards), as long as you're drawing 2 cards per round ( to equal the number of cards that you are discarding).  He's thinning out your deck and getting you closer to the Stargazer. \n\nIn your own 'every costs 2' deck, you built it to basically work no matter what gets discarded (with the exception of Will of the West), which is a deckbuilding choice you can only make if discarding from the top of your deck is perceived as potentially having undesirable consequences.  But that aside, many (most?) decks are looking to draw a few key cards, so discarding blindly with Ziggy is not good strategy.  Thorin's in the same boat, unless you build your deck for mining, yes you should consider the discard a cost with associated risk.\n\nEvery card in your deck is equally likely to be a card that you don't want to discard, but whether or not this matters depends on the human being looking at the numbers, not on the numbers themselves. Top card of your deck has a low % chance of being the card you want to draw (therefore it's OK to discard it and it helps you get closer to the card you want), but also the 2nd 4th 15th and 31st card in your deck have exactly that same percentage (therefore it's a bad idea to discard it because every card position in your deck has an equal % chance of being an undesirable discard, including the top card).  On the other hand, the bottom 39 cards of your deck have a really high chance of being the card you want to draw, so yes go ahead and discard that top card.  If there are 25 cards left in your deck,  and you still haven't seen what you're trying to draw, the bottom 24 have a much higher chance of being the one that you want than the top card of your deck, so statistically the correct decision is still to discard the top card.  And sure, even if you discard the card you're trying to get, you get information about what's left in your deck, so that's a benefit.  But you just discarded the card you were trying to get.  The information is less important than the error you've just made.  Yes, that was a cost.\n\nThe statistics here are able to provide justification for the opinion/perspective you already have, regardless of which opinion/perspective that is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539157","commentId":3539157,"userName":"Amicus Draconis","timestamp":1542533131,"content":"I guess, it comes down to the mindset of the player. If I had the choice between killing an enemy and risking to discard a valuable card, I would probably discard. Otherwise I would need two additional actions in the next round to deal with the enemy. And that means I have to deckbuild appropriately which is a cost for every deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539162","commentId":3539162,"userName":"ColinEdwards","timestamp":1542533883,"content":"> 9 hours ago, GrandSpleen said:\n> \n>  The information is less important than the error you'﻿ve﻿ just made.  Yes, that was a cost.﻿﻿﻿\n\nI don't follow you here; drawing a card isn't \"a cost\" (even if it wasn't the card you really wanted!)\n\nYour chance of getting the card you want into your hand is unchanged; the tradeoff is between having your 'undrawn' cards stay at the bottom of your deck or going to the discard pile.\n\n The real trade-off question is 'is it easier to retrieve specific cards from my discard pile or from deep in my deck?'\n\n(Knowing more about what is left in the deck is helpful too, so I'd give the edge to 'discard pile' if you were indifferent.)\n\nEdited November 18, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539177","commentId":3539177,"userName":"ColinEdwards","timestamp":1542536665,"content":"Somewhat related: Dwarven Pipe is a terrible card - even in a milling/mining deck. \n\nThe bottom of your deck is a really hard place to get stuff from; you really need a shuffle effect to get the value. You draw the pipe instead of something else, you pay a resource for it, the impact is to move a card to a worse place AND if you are using Will of the West, you just undid whatever value it had.\n\nDiscuss?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539181","commentId":3539181,"userName":"Amicus Draconis","timestamp":1542537539,"content":"Without shuffling the bottom of the deck is a bad place for a valuable card. But the pipe recycles cards back into your deck, so you can benefit longer from discarding before playing Will of the West or running out. I like to see my undrawn cards as an additional resource to play with in a mining deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539193","commentId":3539193,"userName":"Halberto","timestamp":1542540480,"content":"> 48 minutes ago, Amicus Draconis said:\n> \n> Without shuffling the bottom of the deck is a bad place for a valuable card. But the pipe recycles cards back into your deck, so you can benefit longer from discarding before playing Will of the West or running out. I like to see my undrawn cards as an additional resource to play with in a mining deck.\n\nWe will likely get a card to reshuffle our deck soon. Already TaBofur ally exist and he will probably be used frequently in the 'new\" dwarf discard archetype (meaning featuring new Thorin and/Or Dain heros) even if 3 tactic resources are quite a cost. I expect an attachemt/ally ability allowing reshuffling soon. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539199","commentId":3539199,"userName":"Halberto","timestamp":1542542898,"content":"One off topic question. \n\nThorin and Gildor heroes came out on the new starter pack but will be released afterward in regular packs (deluxe/AP). Because of this from when do you believe that using them is considered as play in progression mode?  From the new starter pack release or from the future release as regular products?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539214","commentId":3539214,"userName":"dalestephenson","timestamp":1542546131,"content":"Dwarven Pipe is at least good insurance against discarding your will of the west.  Aside from that, it's narrowly useful for quests that win by running out your deck (Angmar cycle) and quests that care about the bottom card of your deck (Dreamchaser cycle).  Tactics Imrahil is also a hero that can often make you shuffle your deck.  Two attachments (Mirror of Galadriel and Kahliel's Headdress) can cause you to shuffle your deck, with Mirror you can force a shuffle every turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539224","commentId":3539224,"userName":"dalestephenson","timestamp":1542547048,"content":"> 19 hours ago, Seastan said:\n> \n> II was considering the risk of taking both attacks of strength 2 undefended vs. defending one of them with Gimli. Since Thalin had 3 hit points remaining, one of the undefended attacks could have gone to him.  I realize Beorn didn't actually do this, which significantly bumps up his risk of losing a hero, but that's where I'm getting my 5% figure from.\n\nIf Beorn had placed the first undefended attack on Thalin, and chose to defend the second attack with Gimli, then there would only be one shadow in the remaining 26 cards that would kill a hero (Hummerhorns), and that's below 5%.  But that'd make zero strategic sense, since the most common outcome would be adding no damage to Gimli while exhausting him, the worst of possible outcomes -- and it's also not relevant to the question of the risk of taking *both* attacks undefended, which is what I was estimating."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539228","commentId":3539228,"userName":"Amicus Draconis","timestamp":1542547643,"content":"> 1 hour ago, Halberto said:\n> \n> We will likely get a card to reshuffle our deck soon. Already TaBofur ally exist and he will probably be used frequently in the 'new\" dwarf discard archetype (meaning featuring new Thorin and/Or Dain heros) even if 3 tactic resources are quite a cost. I expect an attachemt/ally ability allowing reshuffling soon. \n\n \n\n> 24 minutes ago, dalestephenson said:\n> \n> Dwarven Pipe is at least good insurance against discarding your will of the west.  Aside from that, it's narrowly useful for quests that win by running out your deck (Angmar cycle) and quests that care about the bottom card of your deck (Dreamchaser cycle).  Tactics Imrahil is also a hero that can often make you shuffle your deck.  Two attachments (Mirror of Galadriel and Kahliel's Headdress) can cause you to shuffle your deck, with Mirror you can force a shuffle every turn.\n\nMaster of the Forge can do this as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539234","commentId":3539234,"userName":"dalestephenson","timestamp":1542550637,"content":"> On 11/16/2018 at 6:42 PM, Seastan said:\n> \n> You're right. This is what makes picking apart decisions made during a particular playthrough so difficult. I actually think the risk Beorn took by taking those two attacks undefended was far less than 19% and was closer to 5%, which is a fine play by me.\n> \n>  \n> \n> Bringing it back to Thorin vs Gimli:\n> \n> Enemy with 0 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs 2 axes)\n> \n> Enemy with 1 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and a couple rounds of undefended attacks)\n> \n> Enemy with 2 attack appears: Thorin is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and needs to survive an undefended attack for 2)\n> \n> Enemy with 3 attack appears: Thorin is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs axe and needs to survive an undefended attack for 3)\n> \n> Enemy with 4 attack appears: Gimli is slightly easier to set up with 6 attack (Thorin needs axe, Gimli needs to survive an undefended attack for 4)\n> \n> Enemy with 5 attack appears: Thorin is easier to set up with 6 attack (Thorin needs axe, Gimli needs 2 axes)\n> \n>  \n> \n> Ultimately, I'm still of the opinion that Thorin requires the least conditions/setup to be able to consistently attack for 6 against an enemy engaged with you.\n\nYou're ignoring the possibility of damage from shadows, archery, or other encounter effects in this analysis.  It really goes like this:\n\nEnemy with 0 attack engaged -- Thorin needs axe, Gimli needs two axes, or an axe and two points of other damage, or four points of other damage.  Thorin is very likely easier, but it may be quest dependent.\n\nEnemy with 1 attack engaged -- Thorin needs axe, Gimli needs two axes, or an axe and one point of other damage (plus surviving undefended), or three points of other damage (plus surviving undefended).  Thorin may be easier, but it is quest dependent\n\nEnemy with 2 attack engaged -- Thorin needs axe, Gimli needs two axes, or an axe and surviving an undefended attack, or two points of other damage and surviving an undefended attack.  Gimli is likely easier, but it is quest dependent.\n\nEnemy with 3 attack engaged -- Thorin needs axe, Gimli needs two axes, or one axe and one point of other damage, or axe and surviving undefended attack, or axe and three points other damage and surviving defended attack (which leaves him exhausted), or surviving undefended attack plus one point of other damage.  Gimli is likely easier, but it is quest dependent, and the defending option leaves Gimli exhausted.\n\nEnemy with 4 attack engaged -- Thorin needs axe, Gimli needs two axes, or an axe and surviving defended attack (which would leave him exhausted), or axe and surviving undefended attack, or surviving defended attack plus two points other damage (which would leave him exhausted) or surviving undefended attack.  Gimli is likely easier, but it is quest dependent, and the defending option leaves Gimli exhausted.\n\nEnemy with 5 attack engaged -- Thorin needs axe, Gimli needs two axes, or an axe and surviving defended attack (which would leave him exhausted), or one point of other damage and surviving defended attack, or have axe with two points of other damage, or have four points of other damage.  Gimli is likely easier to get to six, but is likely to be exhausted.\n\nEnemy with 6 attack engaged -- Thorin needs axe, Gimli needs to survive defended attack, or have axe with two points of other damage, or have four points of other damage, or have two axes.  Gimli is likely easier to get to six, but is likely to be exhausted.\n\nEnemy with 7+ attack engaged.  Thorin needs axe, Gimli needs two axes, or an axe plus two points of other damage, or four points of other damage.  Thorin is very likely easier to get to six, but it may be quest dependent.\n\nThorin's biggest advantages over Gimli are at the attack counts that are least likely to be engaged first.  Thorin obviously has some huge advantages over Gimli -- some of the paths have Gimli defending, which leaves him unable to attack without readying, and some attacks (especially undefended) would risk hero death.  Damage from shadows, archery, and other encounter card effects is heavily quest-dependent and usually uncontrollable by the player.  I'm not arguing that Gimli is a *better* choice than Thorin for a dedicated attacker; Thorin's lower threat, ramps up more safely, and has a higher effective attack at start of game, and his ability can be used on a different enemy than he's attacking.  For Gimli to be a \"better\" option, the magic-effective-attack-threshold needs to be higher than six (also something that is quest dependent).  I'm simply exploring who can get to six *quickest*, and you can't ignore the possibility of other damage when making that evaluation."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539235","commentId":3539235,"userName":"ColinEdwards","timestamp":1542550761,"content":"> 57 minutes ago, dalestephenson said:\n> \n> Dwarven﻿ ﻿Pipe is at least good insurance against discarding your will of the west﻿.  ﻿\n\nWill of the West is already insurance around drawing through your deck (doesn't help you win games.)\n\nDwarven Tomb (which directly brings it to your hand) or even another copy Will of the West seem like better choices for more insurance. By the time you have 2-3 copies of each, you might not actually need anything more. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539242","commentId":3539242,"userName":"dalestephenson","timestamp":1542551686,"content":"A one-core play has two copies of Will of the West and one copy of Dwarven Tomb (which is obviously useful for fetching things besides Will of the West), so if the player cares about their deck running out there are only three cards to protect it -- and if they come out early, they aren't that useful.  A Dwarven Pipe not only would protect your Will of the West from being discarded, but also puts the Will of the West where it would be *most useful*, at the bottom of your deck.\n\nRunning out of deck won't automatically lose your game outside a few quests.  But if you churn deck quickly and run out of deck, and aren't running a Noldor play-Lords-of-Eldar every turn, your deck will cease to help you.  Most of the time, even a 50-card mining deck should be set up to win before they run out of deck, I think.  But there's no question Dwarven Pipe can dramatically extend the number of rounds before you run out of deck (plus give you more cracks at those lovely Hidden Caches).  In effect both Dwarven Pipe and Will of the West both delay the time until you run out of deck, and do it for the same cost.  Will of the West is used in some decks, why not Dwarven Pipe?\n\nDwarven Pipe isn't as useful as Dunedain Pipe and I think it would still be a little-used card at cost 0.   But in a mining deck, why not?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539277","commentId":3539277,"userName":"GrandSpleen","timestamp":1542556590,"content":"> 6 hours ago, ColinEdwards said:\n> \n> I don't follow you here; drawing a card isn't \"a cost\" (even if it wasn't the card you really wanted!)\n> \n> Your chance of getting the card you want into your hand is unchanged; the tradeoff is between having your 'undrawn' cards stay at the bottom of your deck or going to the discard pile.\n> \n>  \n\nThere's an inherent risk in discarding something you don't want to discard, every time to discard from the top of your deck. So yes, anytime you take a calculated risk, you are paying a cost.\n\nI think everyone here understands that, but you have to do some mental gymnastics to argue it doesn't matter if you discard the Dwarowdelf Axe, or Steward of Gondor, because statistically \"you're closer to the next one\" and \"it won't happen every often,\" and that when it does happen, you haven't harmed your chances of drawing one, but rather improved them.  Statistics have a neat application of allowing you to ignore the reality of a situation by instead looking at all other possible realities, if it's convenient for you to do that, for argument's sake.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539289","commentId":3539289,"userName":"Seastan","timestamp":1542558164,"content":"> 3 hours ago, dalestephenson said:\n> \n> If Beorn had placed the first undefended attack on Thalin, and chose to defend the second attack with Gimli, then there would only be one shadow in the remaining 26 cards that would kill a hero (Hummerhorns), and that's below 5%.  But that'd make zero strategic sense, since the most common outcome would be adding no damage to Gimli while exhausting him, the worst of possible outcomes -- and it's also not relevant to the question of the risk of taking *both* attacks undefended, which is what I was estimating.\n\nNo, I meant if you take both attacks undefended, either attack that doesn't get a \"bad\" shadow can be assigned to Thalin. This makes the added risk of taking both attacks undefended to be less than 5%."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539295","commentId":3539295,"userName":"Seastan","timestamp":1542558622,"content":"> 16 hours ago, GrandSpleen said:\n> \n> If discarding from the top of your deck is not a problem, it would be a good decision to use Zigil Miner blindly before you draw into an Imladris Stargazer (assuming you're using both cards), as long as you're drawing 2 cards per round ( to equal the number of cards that you are discarding).  He's thinning out your deck and getting you closer to the Stargazer. \n> \n> In your own 'every costs 2' deck, you built it to basically work no matter what gets discarded (with the exception of Will of the West), which is a deckbuilding choice you can only make if discarding from the top of your deck is perceived as potentially having undesirable consequences.  But that aside, many (most?) decks are looking to draw a few key cards, so discarding blindly with Ziggy is not good strategy.  Thorin's in the same boat, unless you build your deck for mining, yes you should consider the discard a cost with associated risk.\n> \n> Every card in your deck is equally likely to be a card that you don't want to discard, but whether or not this matters depends on the human being looking at the numbers, not on the numbers themselves. Top card of your deck has a low % chance of being the card you want to draw (therefore it's OK to discard it and it helps you get closer to the card you want), but also the 2nd 4th 15th and 31st card in your deck have exactly that same percentage (therefore it's a bad idea to discard it because every card position in your deck has an equal % chance of being an undesirable discard, including the top card).  On the other hand, the bottom 39 cards of your deck have a really high chance of being the card you want to draw, so yes go ahead and discard that top card.  If there are 25 cards left in your deck,  and you still haven't seen what you're trying to draw, the bottom 24 have a much higher chance of being the one that you want than the top card of your deck, so statistically the correct decision is still to discard the top card.  And sure, even if you discard the card you're trying to get, you get information about what's left in your deck, so that's a benefit.  But you just discarded the card you were trying to get.  The information is less important than the error you've just made.  Yes, that was a cost.\n> \n> The statistics here are able to provide justification for the opinion/perspective you already have, regardless of which opinion/perspective that is.\n\nI have to disagree with most of this, but I'm not sure how to explain my view of the statistics any better. Maybe try this thought experiment:\n\nLet's say Thalin discarded the bottom card of your deck. You are playing a deck with no way to shuffle/search or draw more than 30 cards in a game.\n\n1. Would you consider triggering Thalin to be a cost in this case?\n\n2. Would you consider it a benefit to learn what cards were on the bottom of your deck?\n\nEdited November 18, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539459","commentId":3539459,"userName":"ColinEdwards","timestamp":1542572978,"content":"> 3 hours ago, Seastan said:\n> \n> I have to disagree with most of this, but I'm not sure how to explain my view of the statistics any better. Maybe try this thought experiment:\n\nNot sure it's helpful, but I think of it like this:\n\n- We have 3 cards left: something that is a game winner and two things that aren't\n-The deck has three possible states:  \"X--\", \"-X-\" and \"--X\"\n- We have two draws left\n\nSo outcomes:\n\n1. We draw twice:\nIn 2 our of three cases: we draw the card need: \"X--\" and \"-X-\": Win 2/3 of the times\nIn 1 of our cases, we left the card we needed in the deck undrawn\n\n2. We draw, discard, draw\nWe win with \"X--\" and \"X-X\": Win 2/3 of the times\nIn one case, we discarded the card we needed\n\n(The same result will hold regardless of whether of not we have 40 cards left in the deck after the 3 we are examining.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539475","commentId":3539475,"userName":"GrandSpleen","timestamp":1542574113,"content":"I understand the points you're making, I just disagree with them. You're saying discarding from the bottom of your deck is the same as discarding from the top of your deck, because it is random. \n\nIn your scenario, the time that you discard a desired card from the top of your deck \"doesn't count.\"  It should not enter into our discussion here, apparently. There is no possible negative associated with that result, because the 'over time' statistics support your tactical choice.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539482","commentId":3539482,"userName":"GrandSpleen","timestamp":1542574577,"content":"If you'd like me to directly respond to your questions, however,\n\n1- discarding from the bottom of your deck is a cost.  In a vacuum you'll never draw it.  In a real game, you have plenty of ways to shuffle your deck, and for lots of games it's a very normal occurrence to shuffle your deck several times within the course of a game.  A really simplified reading of the probabilities involved with the game should not inform my tactical decisions.\n\n2- gaining knowledge about what's left in your deck is a benefit. Your argument is hinging upon the presence of a benefit = the absence of a cost.  There is risk involved in getting this information, that's all I'm saying.  It's a cost.  Mechanically it's a cost as defined by the game, and in practice it's a cost because there is risk involved, however small."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539497","commentId":3539497,"userName":"ColinEdwards","timestamp":1542575648,"content":"> 26 minutes ago, GrandSpleen said:\n> \n> In your scenario, the time that you discard a desired card from the top of your deck \"doesn't count.\"﻿﻿﻿﻿﻿﻿\n\nSure, it counts. Just like the time when that we didn't discard meant we didn't get the card we needed. If you aren't discarding, you are still paying the same 'cost'\n\n(The other question is whether it's easier to get the card you need from your discard pile or from your deck.  I sort of lean towards \"rather have it in my discard pile\".)\n\nEdited November 18, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539507","commentId":3539507,"userName":"GrandSpleen","timestamp":1542576438,"content":"If you're building a mining deck, include as much recursion as you want, rather than draw cards (or in addition to).  It's a smart play.\n\nIf you're not building a mining deck, or a 'discard from hand' deck etc., you probably have less, or no, recursion. Recursion options are much more limited in the card pool anyway, so you sort of get hemmed and have your deckbuilding options decided for you, if you choose to go heavy recursion.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539584","commentId":3539584,"userName":"Seastan","timestamp":1542580813,"content":"> 1 hour ago, GrandSpleen said:\n> \n> If you'd like me to directly respond to your questions, however,\n> \n> 1- discarding from the bottom of your deck is a cost.  In a vacuum you'll never draw it.  In a real game...\n\nYou're right that in a real game there are some other variables to consider. But before we consider them I wanted to see if we agree on this \"vacuum\" thought experiment, because if we don't, there's not much point on going into more complicated matters. We seem to have a more fundamental disagreement with math and statistics in general that I think is being clouded by the details of the game. So, assuming that you really will never shuffle your deck, is discarding your bottom card a cost?\n\n> 1 hour ago, GrandSpleen said:\n> \n> In your scenario, the time that you discard a desired card from the top of your deck \"doesn't count.\"  It should not enter into our discussion here, apparently. There is no possible negative associated with that result, because the 'over time' statistics support your tactical choice.\n\nIt certainly does count. There's definitely a negative possibility to discarding your top card: you may discard the card you want. But there's a second possibility: that by not discarding your top card, you prevent yourself from getting to the card you want. This has nothing to do with the \"long run\" of many games. In a single individual game, you're not sure which situation you're in, so it doesn't matter.\n\nLet's play a mini game of LotR. My deck has 4 cards in it, and one of them is Steward of Gondor (SoG). The game only lasts 2 rounds (meaning I only draw twice), but if I draw SoG I win. Here are the possible orderings of my deck at the start:\n\nA. SoG,X,X,X\n\nB. X,SoG,X,X\n\nC. X,X,SOG,X\n\nD. X,X,X,SOG\n\nLet's say I play without triggering Thorin. I will win the game if my deck looks like A or B, but I will lose the game if my deck looks like C or D.\n\nNow let's say I trigger Thorin each turn, after drawing. So I will draw the first card, discard the second, draw the third, and discard the fourth. I will win the game if my deck looks like A or C, but will lose if my deck looks like B or D. In the case of B, using Thorin directly caused my loss. But in the case of C, not using Thorin caused my loss.\n\nTherefore, given that I don't know which state (A,B,C,D) I'm playing, there's no reason for me to not use Thorin.\n\n----\n\nNow I'll throw shuffling into the mix. Each turn after drawing, I'll shuffle my deck.\n\nOn the first turn, if my deck looks like A, I win right away, and whether I planned to use Thorin or not doesn't matter.\n\nIf my deck looks like B,C, or D, I draw a non-SoG card then shuffle my deck. Now the possible orderings of my deck are:\n\nE. SoG,X,X\n\nF. X,SoG,X\n\nG. X,X,SoG\n\nNow, to Thorin or not to Thorin?\n\nIf I don't use Thorin, then on turn 2 (the final turn and chance to draw) I will win if my deck looks like E, but will lose if my deck looks like F or G.\n\nIf I do use Thorin, then on turn 2 I will win if my deck looks like F, but will lose if my deck looks like E or G.\n\nIn the case of E, using Thorin directly caused my loss. But in the case of F, not using Thorin caused my loss.\n\nTherefore, given that I don't know which state (E,F,G) my deck is in after shuffling, there's no reason for me to not use Thorin.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539656","commentId":3539656,"userName":"Rouxxor","timestamp":1542585305,"content":"I agree with Seastan for the majority of his speech (majority because I may have read too fast to ensure everything ^^).\n\nMany players I encounter are afraid to discard the card they need from the top of the deck. It could be a real issue if you have planned to draw all your deck and don't play recursion. But in most case your get:\n- Far from drawing your all deck (especially drawing it and still have your victory depending on finding one card);\n- Some side bonuses of having some cards in your discard (like stand and fight, anborn, erebor hammersmith, elven light, knowledge of what you can draw)\n- No essential card in x1, so discarding one still can get you draw more of them.\n\nThere is still cases where it is something that I won't recommend. For examples I probably will never play a card who discard from the top in a outlands deck, since my plan is to get all my allies in play, and playing recursion to get them since longer than the other build option I have."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539665","commentId":3539665,"userName":"ColinEdwards","timestamp":1542585741,"content":"> 2 hours ago, GrandSpleen said:\n> \n> If you're building a mining deck, include as much recursion as you want, rather than draw cards (or in addition to).  It's a smart play.\n> \n> If you're not building a mining deck, or a 'discard from hand' deck etc., you probably have less, or no, recursion. Recursion options are much more limited in the card pool anyway, so you sort of get hemmed and have your deckbuilding options decided for you, if you choose to go heavy recursion. ﻿\n\nI don't think it's really a trade-off between drawing cards and recursion: card draw is always better. The trade-off would be discarding a card from a deck that you weren't going to draw all the way through anyway.\n\nIf you have some way of fishing it out of your deck (Galadriel's mirror or something), then it's probably better to leave it in the deck. If you are have stuff that recurses stuff ( Dwarven Hammersmith, Orophin, Stand and Fight, whatever) or uses stuff from the discard pile, then your discard pile looks more attractive. (I think most people would have a slight preference towards having something discarded than undrawn.) \n\nThe main point through: discarding something typically isn't any worse than never drawing it to begin with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539668","commentId":3539668,"userName":"ColinEdwards","timestamp":1542585957,"content":"> 7 minutes ago, Rouxxor said:\n> \n> There is still cases where it is something that I won't recommend. For examples I probably will never play a card who discard from the top in a outlands deck, since my plan is to get all my allies in play, and playing recursion to get them since longer than the other build option I have.\n\nMilling your deck and then bringing them all back with that Leadership event is a really good way to fill your hand with outlands allies!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539670","commentId":3539670,"userName":"GrandSpleen","timestamp":1542586182,"content":"I like the shuffle example, it re-randomizes the deck, which is a nice complication.  But if your deck is going to function well, you probably have added some card draw to it.  You have Elven-light and Open the Armoury in your Everything Costs 1 deck.  Let's use that  repeatable card draw effect, and suddenly the thought experiment is biased toward \"don't use Thorin.\"  So let's imagine:  Thorin will discard after you draw 2 cards (for example: in your 'everything costs 1' deck, this will be your Elven-light +Arwen combo being played each round before using Thorin).\n\nScenario A (SoG on top of deck), Draw SoG and win.  Thorin: not a factor (result is the same whether or not you use him).\n\nScenario B (SoG 2nd card in deck), Draw X, draw SoG and win.  Thorin or non-use of Thorin is not a factor in scenarios A and B.  Thorin: not a factor.\n\nScenario C (SoG 3rd card in deck), Draw X, draw X, discard SoG and lose because you used Thorin.  Thorin: caused a loss.\n\nScenario D (SoG is 4th card in deck), Draw X, Draw X, discard X, then on turn 2 draw SoG and win.  But: if you don't use Thorin, turn 1 is Draw X, Draw X, and turn 2 is draw X, draw SoG. In scenario D, you win regardless of whether or not you use Thorin.  Thorin: not a factor.\n\nScenario E (SoG is 5th card in deck), Draw X, Draw X, discard X on turn 1.  Turn 2: draw X, draw X, discard SoG due to Thorin  But without using Thorin, you were going to lose anyway (Game ends on turn 2, you were not going to draw SoG).  Thorin: not a factor.\n\nSo with that addition, Thorin directly causes a loss in scenario C.  For all the other scenarios, your win or loss is regardless of whether or not you use Thorin.\n\nI made a scenario which suggests using Thorin carries more risk than reward, if we're staking a win-or-loss condition on drawing the desired card. \n\nYou made a scenario which suggests there is no difference between using or not using Thorin, and therefore you should just use him (and get +1 attack) as the win-or-loss is beyond your control (equal chance of either regardless of your actions).\n\nIf we add more complications, which way is this going to be biased? Would we see more and more scenarios in which using Thorin is equal to not using Thorin?  Would we see more and more scenarios in which Thorin causes the loss?  Would we ever see a set of scenarios in which Thorin directly causes more wins than losses?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539676","commentId":3539676,"userName":"Rouxxor","timestamp":1542586524,"content":"Your example is even more biased, since you make a deck where everything can be drawn from. But of course there is also a set of scenarios in with Thorin causes more wins than losses. Put more cards in your deck and replace some X by some elven light and you have your set-up here Thorin causes more win than losses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539703","commentId":3539703,"userName":"GrandSpleen","timestamp":1542588167,"content":"Right, the deck is more realistic, because it includes a card draw effect.  I think realism is always going to bias this experiment toward \"Thorin's cost is undesirable.\"\n\nSo OK, let's do this: add Spirit Dain and discard 1 additional card per turn (actually you can do up to 3, but now it's getting too complicated to process the possibilties).  I won't add any card draw.\n\nScenario A (SoG is first card in deck),  you win immediately.  Discard from deck: not a factor.\n\nScenario B (SoG is 2nd card), turn 1 is draw X, discard SoG. Discard : caused a loss.  If you don't use discard, you win on turn 2.\n\nScenario C (SoG is 3rd card): turn 1 is draw X, discard X, discard SoG.  Discard:  caused a loss.  But, if you don't discard, you lose anyway.  Discard from deck: not a factor.\n\nScenario D (SoG is 4th card): turn 1 is draw X, discard X, discard X.  Turn 2: draw SoG and win.  If you don't discard, you lose.  Discard from deck: caused a win.\n\nScenario E (SoG is 5th card): turn 1 is draw X, discard X, discard X.  Turn 2: draw X, discard SoG and lose.  If you don't discard from deck, you also lose.  Discard from deck: not a factor.\n\nScenario F (SoG is 6th card): turn 1 is draw X, discard X, discard X.  Turn 2: draw X, discard X, discard SoG and lose.  But you were going to lose anyway.  Discard from deck: not a factor.\n\n \n\nResult: neutral (equal # of wins and losses regardless of whether or not you use the discard)\n\nAdding 1 card draw effect to that, I guess, will return us to \"using discard from deck carries greater risk.\"\n\n \n\nSo far, we've done 3 scenarios.  Scenario 1: use 1 discard effect.  Scenario 2: use 1 draw effect and 1 discard effect.  Scenario 3: use 2 discard effects only.  \"Discard from deck's\" best result is \"no negative result\" but in 1 scenario it is \"carries greater risk than not using discard from deck.\"\n\nNow, put aside the thought experiment and come back to reality.  How many decks are you going to build which include no card draw effects?\n\nI can't think of any other effects which are going to result in more \"neutral\" results than \"negative\" results.  You can run a dedicated mining deck (deck which benefits by discarding Ered Luin Miner or Hidden Cache), but in terms of \"getting the card you want into your hand,\" the mining aspect of that deck still results in a \"negative\" result. That's the fun part of that playstyle: risk-reward plays (mining is not a purely \"safe\" archetype).\n\nEdited November 19, 2018 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539723","commentId":3539723,"userName":"dalestephenson","timestamp":1542589006,"content":"> 8 hours ago, Seastan said:\n> \n> No, I meant if you take both attacks undefended, either attack that doesn't get a \"bad\" shadow can be assigned to Thalin. This makes the added risk of taking both attacks undefended to be less than 5%.\n\nYou can't take them both simultaneously and then decide which order to apply; they're done sequentially.  So you don't know if the second attack will have a \"bad\" shadow until *after* you've taken the first attack undefended -- and the first attack will go on Gimli, not Thalin, if it does not have a bad shadow.  So here's how it works:\n\nFirst attack taken undefended:\n\nNo damage shadow (22 cards) -- 2 damage placed on Gimli, 4 hp remaining\n\n+3 damage shadow (2 cards) -- can place on Gimli leaving with 1 hp remaining, 4/26 chance second undefended will kill Thalin.\n\n2 damage to all (1 card) -- Eowyn killed, neither Gimli nor Thalin has hp left to absorb second undefended.\n\nCitadel Plate discarded (2 cards) -- Thalin can take the 2 damage, none of the heroes have hp left to absorb second undefended.\n\nTaking the first is unavoidable since you only have one defender.  1 card kills a hero outright, 2 cards force a defense to avoid a hero death (which leaves you in a terrible position -- it might be better to let Thalin die and kill an enemy), 2 force Thalin to take the second undefended, and 22 leave Gimli hp to take a second undefended attack.\n\nLet's assume that the first undefended didn't have a damaging shadow, and you chose to put the damage on Gimli (smart), and that you chose to take the second attack undefended (also smart).  Now the odds work out like this:\n\nNo damage shadow (21 cards) -- 2 more damage placed on Gimli, 2 hp remaining\n\n+3 damage shadow (2 cards) -- kill Thalin.\n\n2 damage to all (1 card) -- Eowyn killed outright and whoever takes the undefended attack is also killed\n\nCitadel Plate discarded (2 cards) -- Gimli killed outright, but Thalin can take the undefended attack safely.\n\nNote that if you decided to put the first undefended on Thalin, but still take the second attack undefended, there are *still* three cards that result in hero death -- with the Plate gone, neither Gimli nor Thalin has room for 2 points of damage in that case.  So if you decide to take both attacks undefended, the chance of hero death is higher than 5%."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539734","commentId":3539734,"userName":"Rouxxor","timestamp":1542589531,"content":"> Quote\n> \n> Many players I encounter are afraid to discard the card they need from the top of the deck. It could be a real issue if you have planned to draw all your deck and don't play recursion. But in most case your get:\n> - Far from drawing your all deck (especially drawing it and still have your victory depending on finding one card);\n> - Some side bonuses of having some cards in your discard (like stand and fight, anborn, erebor hammersmith, elven light, knowledge of what you can draw)\n> - No essential card in x1, so discarding one still can get you draw more of them.\n\nAnd you take a specific example of the very specific case I name and then take a conclusion for all the situation. It is quite ridiculous. It is really close to a 2 deck cards within 2 turns, you will obviously prove that Thorin should not be used...\n\nLet run a real complicated deck:\n\nWe play Arwen hero, Thorin, a 4 card deck containing a desired card names SoG, an elven light and 2 cards useless named X. You need to get the card on the turn.\n\n12 disposition of the deck possible:\n\n1/ SoG, elven light, X, X\n\n2/ SoG, X, elven light, X\n\n3/ SoG, X, X, elven light\n\n4/ X, SoG, X, elven light\n\n5/ X, SoG, elven light, X\n\n6/ elven light, SoG, X, X\n\n7/ elven light, X, SoG, X\n\n8/ X, elven light, SoG, X\n\n9/ X, X, SoG, elven light\n\n10/ X, X, elven light, SoG\n\n11/ X, elven light, X, SoG\n\n12/ elven light, X, X, SoG\n\nI will considerate we will draw as soon we can.\n\nIn the 3 first situation we win anyway. Cool!\n\nIn the following 2 we loose if activating Thorin, but loose anyway if we don't\n\nIn the 6th we can win anyway by discarding and drawing instantly with Arwen.\n\nIn the 7th case we use the same Arwen tech but draw a useless card and loose anyway.\n\nIn the 8th case we draw a useless card, discard elven light only if we use Thorin, and so can draw a useful cards. We win only with Thorin\n\nIn the 9th case, we loose anyway.\n\nIn the 10 case we loose anyway.\n\nIn the 11 case we discard elven light with Thorin, and then we are able to discard an draw again with Arwen so we draw the 4th card and win\n\nIn case 12 we loose anyway.\n\nResult: Only 4 wins without Thorin (1, 2, 3, 6) and we win 2 additional with Thorin (8, 11).\n\nWe can do more simulation with many different cards but that will never be a prove, only some examples of what can happens. My opinion is the following: there is a wide range of benefits of discarding a few number of cards from the top and very few backdraws of doing so. Of course there is also mechanic that work well for taking advantage from discarding a lot from the top but there is also many cards in many thematic that have a use from the decks, and few to none who have an use if they are still in the deck at the end of the game.\n\nEdited November 19, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539784","commentId":3539784,"userName":"GrandSpleen","timestamp":1542592001,"content":"> 32 minutes ago, Rouxxor said:\n> \n> And you take a specific example of the very specific case I name and then take a conclusion for all the situation. It is quite ridiculous.\n\nI haven't responded to you at all Roxxour, my response was not written with your example in mind.  So let's keep it polite.  I've only added a third scenario using Seastan's rules.\n\n> 34 minutes ago, Rouxxor said:\n> \n> It is really close to a 2 deck cards within 2 turns, you will obviously prove that Thorin should not be used...\n\nSeastan designed the scenario as evidence that discard from deck is 'not a cost.' It has not been engineered to show that Thorin should not be used.\n\n> 37 minutes ago, Rouxxor said:\n> \n> My opinion is the following: there is a wide range of benefits of discarding a few number of cards from the top and very few backdraws of doing so. \n\nThen, you agree with me 100%.\n\nDiscarding from deck is a cost. It carries a risk/benefit calculation in real play, outside of a vacuum.  This whole business with the Steward of Gondor 4-card deck is just intended as evidence that discarding from deck has NO negative possibility, statistically speaking.  I simply disagree, since any addition attempt to bring us to a 'realistic' scenario biases the result toward \"carries greater risk than not using discard from deck.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539792","commentId":3539792,"userName":"GrandSpleen","timestamp":1542593010,"content":"To summarize for the readers at home, and hopefully prevent any confusion, the two positions here are as follows:\n\nSeastan: Discarding from deck should not be considered a cost, but a benefit. This is because, across all possible situations, discarding from your deck is either 1) is equally as harmful as not discarding from your deck, or 2) beneficial.   (At least, this is how I understand his position, sorry if I am mis-stating the nuance)\n\nMe: Discarding from your deck should be considered a cost.  This because, across all possible situations, discarding from your deck is either 1) equally as harmful as not discarding from your deck, 2) beneficial, or 3) more harmful than not discarding from your deck.\n\n(that's the main point we disagree on, that 3rd possible scenario has not been acknowledged, which I guess is why you wouldn't consider this a 'cost').\n\nWe are not debating whether or not Thorin is a good hero (we all agree that he is), and we are not debating whether 'discard from your deck' should never be used (we all agree that it can benefit you some of the time)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539911","commentId":3539911,"userName":"GrandSpleen","timestamp":1542601758,"content":"Oh and duh! Silly me. The situations where discarding from deck ceases to have any negative potential are 1) when you know what's going to be discarded [Imladris Stargazer, hero Gandalf] and 2) when there is no possible detrimental discard [you've built your deck to accommodate mining]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539920","commentId":3539920,"userName":"JusticeLizard","timestamp":1542602588,"content":"I don't claim to be an expert at statistics, or this game, but I will tell you my experiences.  When I have played the starter deck with Thorin in it, I only hesitate to use his power if it has no effect whatsoever meaning I already am killing the enemy.  With no expectation of drawing my whole deck, I consider the loss of one unknown card to be negligible.  If it is a key power card, I will be bothered slightly but not much more than if I just never saw it.  Undefended attacks on the other hand are something I avoid at almost all cost.  Too many times I have gotten a shadow card with enough damage to ruin my day.  (In fact it happened today, once to me and once to my wife)  I guess in the end I would prefer the psychological cost of a lost card over a dead hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539956","commentId":3539956,"userName":"Seastan","timestamp":1542608542,"content":"> 5 hours ago, dalestephenson said:\n> \n> You can't take them both simultaneously and then decide which order to apply; they're done sequentially.  So you don't know if the second attack will have a \"bad\" shadow until *after* you've taken the first attack undefended -- and the first attack will go on Gimli, not Thalin, if it does not have a bad shadow.  So here's how it works:\n\nYou don't need to decide where to place undefended damage until after revealing the shadow card. So that's not how it works."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539969","commentId":3539969,"userName":"Seastan","timestamp":1542609598,"content":"> 6 hours ago, GrandSpleen said:\n> \n> So let's imagine:  Thorin will discard after you draw 2 cards (for example: in your 'everything costs 1' deck, this will be your Elven-light +Arwen combo being played each round before using Thorin).\n> \n>  \n\nThe flaw here is that your crafted scenario allows you the ability to draw through every card in your deck. I've admitted from the get-go that if you've got enough draw power to draw your whole deck, then Thorin is a cost, so we don't need to debate that.\n\nIt wasn't card draw that tipped the scales against Thorin. It was the ability to draw your whole deck. This is evidenced by your second example where you retained the card draw but added more cards to the deck, and the result was once again neutral. Then you said:\n\n> Quote\n> \n> Adding 1 card draw effect to that, I guess, will return us to \"using discard from deck carries greater risk\". \n\nAnd I agree, but only because it would enable you to draw the whole deck in your example.\n\nThis is all consistent with what I've been saying.\n\nBut most decks (nearly all?) do not get anywhere close to drawing themselves in a game. Therefore I maintain that in those decks Thorin is not a cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3539989","commentId":3539989,"userName":"Halberto","timestamp":1542610768,"content":"> 17 hours ago, Amicus Draconis said:\n> \n>  \n> \n> Master of the Forge can do this as well.\n\nSure he can but he is of sphere considering that deck discard mechanic is mainly built in spirit and tactic.  If you can build you deck including lore or have a different way to put him on the table (stand and fight) then yes, no problem.  Still  an alternative in sphere will be welcome I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540022","commentId":3540022,"userName":"ColinEdwards","timestamp":1542613044,"content":"> 5 hours ago, GrandSpleen said:\n> \n> Oh and duh! Silly me. The situations where discarding from deck ceases to have any negative potential are 1) when you know what's going to be discarded [Imladris Stargazer, hero Gandalf] and 2) when there is no possible detrimental discard [you've built your deck to accommodate mining]\n\nYou're missing a key point: unless you know what you are discarding and revealing, you face the exact same 'negative potential' by not discarding too. \n\nWhen you do know, you are clearly better off discarding by being able to clear out the rubbish cards.\n\nWhen you don't know - you are getting no worse outcomes by discarding. You might get better outcomes if you have cards than benefit from stuff in your discard pile, and better decisions from knowing more about what is left in your deck.\n\nImagine you discarded the top 5 cards from your deck at the start of each game (prior to the Mulligan decision): are you any worse off? \n\n(I think you'd actually be better off, despite a chance of discarding every copy of some key card!)\n\nEdited November 19, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540041","commentId":3540041,"userName":"Seastan","timestamp":1542615842,"content":"Ok, I've gone and written an actual computer program that plays the game 10,000 times under different scenarios and records the win percentage.\n\nEach game starts with a 44 card deck with 3 SoG in it (we assume that the opening hand did not contain SoG). We make each game last 7 rounds. We call a game a \"win\" if we draw into SoG at any point in those 7 rounds. We also keep track of what turn the game was won.\n\n1a) With no Thorin, just drawing 1 card per turn\n\n\nWin percentage: 41.4\nAverage round won: 3.8\n\n1b) Drawing 1 card per turn, with Thorin each round\n\n\nWin percentage: 41.5\nAverage round won: 3.8\n\n2a) Extra card each round, with no Thorin\n\n\nWin percentage: 69.5\nAverage round won: 3.5\n\n2b) Extra card each round, with Thorin each round\n\n\nWin percentage: 69.7\nAverage round won: 3.6\n\n3a) Master of the Forge each round, with no Thorin\n\n\nWin percentage: 95.8\nAverage round won: 2.7\n\n3b) Master of the Forge each round, with Thorin each round\n\n\nWin percentage: 95.4\nAverage round won: 2.7\n\n---\n\nThe small differences between Thorin/non-Thorin are statistical only. If I run the program again the results will be slightly different but will stay well within a percent of each other.\n\nSo there you have it. Even in the case of a deck running Master of the Forge, using Thorin every round did not impact the win percentage.\n\nSo Thorin is not a cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540047","commentId":3540047,"userName":"Seastan","timestamp":1542616911,"content":"As an addendum:\n\nLet's switch our key card to be 1x and make ourselves draw 7 cards per round over 7 rounds: \n\n4a) 7 cards per round, looking for a 1x card, with no Thorin:\n\n\nWin percentage: 100.0\nAverage round won: 3.6\n\n4b) 7 cards per round, looking for a 1x card, with Thorin each round:\n\n\nWin percentage: 88.4\nAverage round won: 3.3\n\nSo as I stated from the start, if you can draw your whole deck, then yes of course Thorin can have a downside. But this is not realistic for most decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540088","commentId":3540088,"userName":"ColinEdwards","timestamp":1542620437,"content":"> 59 minutes ago, Seastan said:\n> \n>  as I stated from the start, if you can draw your whole deck, then yes of course Thorin can have a downside. But this is not realistic for most decks.\n\nI think you are being too kind - not only (1) do you need to draw through your deck, but (2) you have to lose after having drawn through your deck, (3) lose when you otherwise would have won, (4) not recognize that you are getting into danger in time to moderate your behaviour.\n\nYou might as well just say 'Mining is something you need to consider before doing in \"Deadman's Dike\"\n\nEdited November 19, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540315","commentId":3540315,"userName":"Network57","timestamp":1542640004,"content":"> 6 hours ago, Seastan said:\n> \n> Ok, I've gone and written an actual computer program that plays the game 10,000 times under different scenarios and records the win percentage.\n> \n> Each game starts with a 44 card deck with 3 SoG in it (we assume that the opening hand did not contain SoG). We make each game last 7 rounds. We call a game a \"win\" if we draw into SoG at any point in those 7 rounds. We also keep track of what turn the game was won.\n> \n> 1a) With no Thorin, just drawing 1 card per turn\n> \n> \n> \n> Win percentage: 41.4\n> Average round won: 3.8\n> \n> 1b) Drawing 1 card per turn, with Thorin each round\n> \n> \n> \n> Win percentage: 41.5\n> Average round won: 3.8\n> \n> 2a) Extra card each round, with no Thorin\n> \n> \n> \n> Win percentage: 69.5\n> Average round won: 3.5\n> \n> 2b) Extra card each round, with Thorin each round\n> \n> \n> \n> Win percentage: 69.7\n> Average round won: 3.6\n> \n> 3a) Master of the Forge each round, with no Thorin\n> \n> \n> \n> Win percentage: 95.8\n> Average round won: 2.7\n> \n> 3b) Master of the Forge each round, with Thorin each round\n> \n> \n> \n> Win percentage: 95.4\n> Average round won: 2.7\n> \n> ---\n> \n> The small differences between Thorin/non-Thorin are statistical only. If I run the program again the results will be slightly different but will stay well within a percent of each other.\n> \n> So there you have it. Even in the case of a deck running Master of the Forge, using Thorin every round did not impact the win percentage.\n> \n> So Thorin is not a cost.\n\nI suppose the ridiculous boost from Master of the Forge only applied because we're looking for an attachment. I don't think these results are the same if we're looking for, say, a particular ally, or a powerful event, which is our must-win card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540363","commentId":3540363,"userName":"GrandSpleen","timestamp":1542641889,"content":"Dang, I admire your dedication.  Well it seems you are right, statistically speaking Thorin is not a cost! \nStill I have a hard time seeing a card that I was desperate to draw go into the discard pile and thinking I have lost nothing.  The next time this happens, I shall say to myself \"this was not a cost, for the GrandSpleen in an equal number of alternate universes did not discard this.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540402","commentId":3540402,"userName":"Halberto","timestamp":1542642902,"content":"> 7 hours ago, Seastan said:\n> \n> As an addendum:\n> \n> Let's switch our key card to be 1x and make ourselves draw 7 cards per round over 7 rounds: \n> \n> 4a) 7 cards per round, looking for a 1x card, with no Thorin:\n> \n> \n> \n> Win percentage: 100.0\n> Average round won: 3.6\n> \n> 4b) 7 cards per round, looking for a 1x card, with Thorin each round:\n> \n> \n> \n> Win percentage: 88.4\n> Average round won: 3.3\n> \n> So as I stated from the start, if you can draw your whole deck, then yes of course Thorin can have a downside. But this is not realistic for most decks.\n\nOk Thorin is a cost if played in a noldor deck along Erestor and Galdor heroes full of additional card draw effect. I deem dwarves and elves are not a likely friendship but in few case...\n\nMake me wonder how many cards can you actually draw without game breaking shenanigans (like invite loop or event recursion abuse)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540440","commentId":3540440,"userName":"Amicus Draconis","timestamp":1542644586,"content":" \n\n> 15 hours ago, GrandSpleen said:\n> \n> I like the shuffle example, it re-randomizes the deck, which is a nice complication.  But if your deck is going to function well, you probably have added some card draw to it.  You have Elven-light and Open the Armoury in your Everything Costs 1 deck.  Let's use that  repeatable card draw effect, and suddenly the thought experiment is biased toward \"don't use Thorin.\"  So let's imagine:  Thorin will discard after you draw 2 cards (for example: in your 'everything costs 1' deck, this will be your Elven-light +Arwen combo being played each round before using Thorin).\n> \n> Scenario A (SoG on top of deck), Draw SoG and win.  Thorin: not a factor (result is the same whether or not you use him).\n> \n> Scenario B (SoG 2nd card in deck), Draw X, draw SoG and win.  Thorin or non-use of Thorin is not a factor in scenarios A and B.  Thorin: not a factor.\n> \n> Scenario C (SoG 3rd card in deck), Draw X, draw X, discard SoG and lose because you used Thorin.  Thorin: caused a loss.\n> \n> Scenario D (SoG is 4th card in deck), Draw X, Draw X, discard X, then on turn 2 draw SoG and win.  But: if you don't use Thorin, turn 1 is Draw X, Draw X, and turn 2 is draw X, draw SoG. In scenario D, you win regardless of whether or not you use Thorin.  Thorin: not a factor.\n> \n> Scenario E (SoG is 5th card in deck), Draw X, Draw X, discard X on turn 1.  Turn 2: draw X, draw X, discard SoG due to Thorin  But without using Thorin, you were going to lose anyway (Game ends on turn 2, you were not going to draw SoG).  Thorin: not a factor.\n> \n> So with that addition, Thorin directly causes a loss in scenario C.  For all the other scenarios, your win or loss is regardless of whether or not you use Thorin.\n> \n> I made a scenario which suggests using Thorin carries more risk than reward, if we're staking a win-or-loss condition on drawing the desired card. \n> \n> You made a scenario which suggests there is no difference between using or not using Thorin, and therefore you should just use him (and get +1 attack) as the win-or-loss is beyond your control (equal chance of either regardless of your actions).\n> \n> If we add more complications, which way is this going to be biased? Would we see more and more scenarios in which using Thorin is equal to not using Thorin?  Would we see more and more scenarios in which Thorin causes the loss?  Would we ever see a set of scenarios in which Thorin directly causes more wins than losses?\n> \n>  \n\nYour Scenario E is wrong, it should be:\n\nScenario E (SoG is 5th card in deck), Draw X, Draw X, discard X on turn 1.  Turn 2: draw X, draw SoG and win because you used Thorin, otherwise you would only have drawn the first four cards. Thorin: caused a win.\n\nScenario F would essentially be, what you describe in Scenario E.\n\nScenario F (SoG is 5th card in deck), Draw X, Draw X, discard X on turn 1.  Turn 2: draw X, draw X, discard SoG due to Thorin  But without using Thorin, you were going to lose anyway (Game ends on turn 2, you were not going to draw SoG).  Thorin: not a factor.\n\nSo with that addition, Thorin directly causes a loss in scenario C and a win in Scenario E.  For all the other scenarios, your win or loss is regardless of whether or not you use Thorin.\n\nTo conclude: Thorin changes the outcome of some games but in the end, he makes you win or lose with the same number of games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540452","commentId":3540452,"userName":"sappidus","timestamp":1542644955,"content":"[deleted for dumbness]\n\nEdited November 19, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540470","commentId":3540470,"userName":"Amicus Draconis","timestamp":1542645697,"content":"> 2 minutes ago, sappidus said:\n> \n> This is an interesting claim. I am not sure if it's true. I will do some combinatorial calculations when I have time and report back.\n> \n> (N.B.: this is different from what I think about Thorin or deck-discard effects in general. I generally agree with @Seastan [https://community.fantasyflightgames.com/profile/240509-seastan/] et al. that there is essentially no functional \"cost\" for regular decks.)\n\nThis is in response to the example Grandspleen posted. For Rouxxor's example it does not work because of the fact that you can play Elven Light from your discard pile only. So if you get a desireable card there, Thorin can actually help. The only way to lose Rouxxor's example due to Thorin would be to discard SoG from the deck, before drawing it with Elven Light, which was against his rules. But then it does not matter what you discard, if you have no means afterwards to draw again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540472","commentId":3540472,"userName":"sappidus","timestamp":1542645853,"content":"Haha, my post was up for like a minute before I deleted it. You're too fast. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540521","commentId":3540521,"userName":"Seastan","timestamp":1542647608,"content":"> 1 hour ago, GrandSpleen said:\n> \n> Dang, I admire your dedication.  Well it seems you are right, statistically speaking Thorin is not a cost! \n> Still I have a hard time seeing a card that I was desperate to draw go into the discard pile and thinking I have lost nothing.  The next time this happens, I shall say to myself \"this was not a cost, for the GrandSpleen in an equal number of alternate universes did not discard this.\"\n\nI appreciate the concession. As for the psychological cost of using Thorin, I make no similar guarantee 😁."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3540628","commentId":3540628,"userName":"Amicus Draconis","timestamp":1542650559,"content":"> 1 hour ago, sappidus said:\n> \n> Haha, my post was up for like a minute before I deleted it. You're too fast. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nI see, you are not one of my workmates, they would never say that :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541698","commentId":3541698,"userName":"dalestephenson","timestamp":1542722813,"content":"> On 11/19/2018 at 1:22 AM, Seastan said:\n> \n> You don't need to decide where to place undefended damage until after revealing the shadow card. So that's not how it works.\n\nThat doesn't contradict my statement or scenario.  You decide to take the first attack undefended.  You reveal *its* shadow card.  You have to place the damage from the *first* undefended attack before you know what the shadow from the *second* undefended attack is.  So if the second attack has Dol Goldur Orcs as a shadow, you won't know it until *after* you assign damage from the first undefended attack -- and since the whole point of taking two attacks undefended was to boost up Gimli, the damage from the first attack will be put on Gimli, not Thalin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541713","commentId":3541713,"userName":"dalestephenson","timestamp":1542723693,"content":"> On 11/19/2018 at 2:37 AM, ColinEdwards said:\n> \n> When you don't know - you are getting no worse outcomes by discarding. You might get better outcomes if you have cards than benefit from stuff in your discard pile, and better decisions from knowing more about what is left in your deck.\n> \n> Imagine you discarded the top 5 cards from your deck at the start of each game (prior to the Mulligan decision): are you any worse off? \n> \n> (I think you'd actually be better off, despite a chance of discarding every copy of some key card!)\n\nClarification -- would those five cards go back in your deck if you decided to Mulligan?  If not, and you have a bad hand, the five you discarded are from a deck of greater average quality than your hand, so you are reducing the average quality of the deck by keeping your current hand but losing five cards from the (better) deck.  If you mulligan because you are lacking a particular 3x card, and you just discarded two of them, you've just made your life *much* more difficult just for the informational advantage that mulliganing your current bad hand is not likely to get the key card you need.\n\nIf you rely on search effects to find key cards, discarding search cards will make your remaining deck less consistent.  Worst case would be where you always use Thurindir with Gather Information to find a single copy of your key card -- and this initial discard tossed it.  If you rely on search cards to find things that are *in* the deck, then discarding from the deck by any method can make those cards unavailable for search and represent a real cost."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541718","commentId":3541718,"userName":"dalestephenson","timestamp":1542724058,"content":"> On 11/19/2018 at 4:40 AM, ColinEdwards said:\n> \n> I think you are being too kind - not only (1) do you need to draw through your deck, but (2) you have to lose after having drawn through your deck, (3) lose when you otherwise would have won, (4) not recognize that you are getting into danger in time to moderate your behaviour.\n> \n> You might as well just say 'Mining is something you need to consider before doing in \"Deadman's Dike\"\n\nI think you are being too harsh -- something can absolutely be a \"cost\" even if you end up winning anyways.  Absent cards that care whether a particular card is in your deck or your discard, discarding a card from a randomized deck is not a cost if you never end up drawing your entire deck -- but if you do end up drawing your whole deck, it costs you future draws, and that's just as much a cost as exhausting a hero or paying resources or taking damage.\n\nIf you \"recognize that you are getting into danger in time to moderate your behavior\", then obviously the discard is a cost because you're changing your behavior *because* of the cost.  If you stop using Stonehelm's ability because you're worried about running out of deck, than *its cost* is stopping you from using it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541888","commentId":3541888,"userName":"ColinEdwards","timestamp":1542731074,"content":"> 1 hour ago, dalestephenson said:\n> \n> If﻿ you stop using Stonehelm's ability because you're worried about running out of deck, than *its cost* is stopping you from using it.\n\nYeah, in the exact same way as Daeron's Runes or Cirdan has a 'cost' as you get close to running your deck down. (Unless you are playing a mission that plays off your discard pile or penalises you for running out of cards, it's a fairly theoretical one.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541960","commentId":3541960,"userName":"sappidus","timestamp":1542734471,"content":"> On 11/19/2018 at 1:39 AM, Seastan said:\n> \n> But﻿ most decks (nea﻿rly all?) do not get anywhere close to drawing themselves in a game. Therefore I﻿ maintain that in those decks Thorin is not a cost.\n\nJust curious: do you trigger Thorin on essentially every single opportunity, even when his extra damage is not \"needed\", as long as you don't think you're going to reach that deep into your deck?\n\nEdited November 20, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541994","commentId":3541994,"userName":"Seastan","timestamp":1542735473,"content":"> 3 hours ago, dalestephenson said:\n> \n> and since the whole point of taking two attacks undefended was to boost up Gimli, the damage from the first attack will be put on Gimli, not Thalin.\n\nI disagree that that was the point (my reason for doing it would be so that Gimli could be used to kill an enemy), but it doesn't matter. All I'm saying is the added risk of losing a hero by taking both those attacks undefended was around 5%, full stop. Certain decisions can be made to increase that risk, but I based my statement on the decisions I would make. Other decisions lead to different risks, of course, as someone who decides to put the damage on Eowyn is going to face 100% chance of losing a hero.\n\nAfter placing the initial 2 undefended damage on Gimli, the risk of losing a hero by taking the second attack undefended was high. Higher than I'd be comfortable with personally as a conservative player. This is why I would've placed the first 2 damage differently."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3541998","commentId":3541998,"userName":"dalestephenson","timestamp":1542735610,"content":"> 53 minutes ago, ColinEdwards said:\n> \n> Yeah, in the exact same way as Daeron's Runes or Cirdan has a 'cost' as you get close to running your deck down. (Unless you are playing a mission that plays off your discard pile or penalises you for running out of cards, it's a fairly theoretical one.)\n\nIt's hardly the exact same way.  Cirdan's cost isn't optional -- if you draw, you discard, and the discard certainly is a cost.  Discarding is a cost of playing Daeron's Runes, and unless you want to discard a card currently in your hand, it's a dead card with an empty deck.\n\nIf you stop using Stonehelm's ability because you're worried about the deck, his cost isn't theoretical, it's *real*.  You're forgoing a point of direct damage because of the cost.\n\nOutside quests that penalize you for running out of cards or penalize you for cards in your discard, the game itself penalizes you for having an empty deck -- you don't get to draw a new card.  If it's impossible for you run out your deck without winning or losing, then discarding cards from your deck does not affect the likelihood of this game-induced penalty coming into play.  If it's possible, then discarding from your deck is an actual cost; and the likelier it is to run out of deck the higher the cost becomes (assuming you're not running a Noldor deck that wants to recur Lords of the Eldar every turn).\n\nThere are 34 pages of decks that include Will of the West, and they aren't *all* wasting their card slots on a useless card.  Will of the West is included in close to a third of the mining (Zigil Miner) decks, so clearly the possibility of mining through a deck prematurely is sufficiently compelling to justify deck space for a strong minority of those decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542000","commentId":3542000,"userName":"Seastan","timestamp":1542735654,"content":"> 21 minutes ago, sappidus said:\n> \n> Just curious: do you trigger Thorin on essentially every single opportunity, even when his extra damage is not \"needed\", as long as you don't think you're going to reach that deep into your deck?\n\nSince I play him in a mining deck, yeah absolutely. I've yet to experiment with him outside of one, but given the math, I don't see why not. At worst its a neutral effect and at best he gives you increased information about what you're going to draw.\n\nEdited November 20, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542011","commentId":3542011,"userName":"Amicus Draconis","timestamp":1542736031,"content":"> On 11/19/2018 at 9:24 AM, Seastan said:\n> \n> Ok, I've gone and written an actual computer program that plays the game 10,000 times under different scenarios and records the win percentage.\n> \n> Each game starts with a 44 card deck with 3 SoG in it (we assume that the opening hand did not contain SoG). We make each game last 7 rounds. We call a game a \"win\" if we draw into SoG at any point in those 7 rounds. We also keep track of what turn the game was won.\n> \n> 1a) With no Thorin, just drawing 1 card per turn\n> \n> \n> \n> Win percentage: 41.4\n> Average round won: 3.8\n> \n> 1b) Drawing 1 card per turn, with Thorin each round\n> \n> \n> \n> Win percentage: 41.5\n> Average round won: 3.8\n> \n> 2a) Extra card each round, with no Thorin\n> \n> \n> \n> Win percentage: 69.5\n> Average round won: 3.5\n> \n> 2b) Extra card each round, with Thorin each round\n> \n> \n> \n> Win percentage: 69.7\n> Average round won: 3.6\n> \n> 3a) Master of the Forge each round, with no Thorin\n> \n> \n> \n> Win percentage: 95.8\n> Average round won: 2.7\n> \n> 3b) Master of the Forge each round, with Thorin each round\n> \n> \n> \n> Win percentage: 95.4\n> Average round won: 2.7\n> \n> ---\n> \n> The small differences between Thorin/non-Thorin are statistical only. If I run the program again the results will be slightly different but will stay well within a percent of each other.\n> \n> So there you have it. Even in the case of a deck running Master of the Forge, using Thorin every round did not impact the win percentage.\n> \n> So Thorin is not a cost.\n\nI figured out, this should also be calculable, so I gave it a try.\n\n1a) With no Thorin, just drawing 1 card per turn\n\nI will lose when there is no copy of Steward in the first seven cards. The number of combinations for 7 cards out of 44 is C(44, 7) = 44! / 7! / (44-7)! = 38 320 568.\n\nOf course C(n, k) = n! / k! / (n - k)! applies here.\n\nIn order to get the number of combinations for not having Steward in the first 7 cards means I have to multiply the number of combinations for 0 cards out of 3 (for Steward) and the number of combinations for 7 cards out of 41 (everything save Steward): C(3, 0) * C(41, 7) = 3! / 0! / (3-0)! * 41! / 7! / (41 - 7)! = 22 481 940.\n\nDividing the second result (2)  by the first (1) gives us the probality to lose the game:\n\n22 481 940 / 38 320 568 = 58.7%\n\nThus the win percentage is the difference to 100% which is close enough to Seastan's result: 1 - 22 481 940 / 38 320 568 = 41.3%. As he already said\n\n> Quote\n> \n> the results will be slightly different but will stay well within a percent of each other.\n\nTo get the average round, in which the game was won, we have some additional work: We need to figure out, how often will we win in the first round, the second round and so on until the seventh round. This means, we have to calculate the probability of the first Steward being the first, second, ... , seventh card in the deck.\n\nThe first card is easy, as 3 cards out of the deck with 44 cards will let us win, thus the probability is p1 = 3 / 44 = 6.8%.\n\nFor the second card we take the percentage of the first one being no Steward (1 - p1 = 41 / 44) und multiply it with the second card being Steward (3 / 43): p2 = 41 / 44 * 3 / 43 = 6.5%\n\nFor the third card we take the percentage of the first two being no Steward (1 - p1 - p2) and multiply it with the third card being Steward (3 / 42): p3 = (1 - p1 - p2) * 3 / 42 = 6.2%\n\nThis goes analogously for the next four cards:\n\np4 = (1 - p1 - p2 - p3) * 3 / 41 = 5.9%\n\np5 = (1 - p1 - p2 - p3 - p4) * 3 / 40 = 5.6%\n\np6 = (1 - p1 - p2 - p3 - p4 - p5) * 3 / 39 = 5.3%\n\np7 = (1 - p1 - p2 - p3 - p4 - p5 - p6) * 3 / 38 = 5.0%\n\nOf course these 7 percentages sum up to 41.3% again.\n\nIn order to calculate the expected value we need to multiply every percentage with its corresponding card's position in the deck and add everything up. But as our total win percentage is only 41.3%, we also need to divide the result by this value, otherwise we would regard losses as wins in round 0.\n\n(6.8% * 1 + 6.5% * 2 + 6.2% * 3 + 5.9% * 4 + 5.6% * 5 + 5.3% * 6 + 5.0% * 7) / 41.3% = 3.8\n\nThis time the result is the same as from Seastan's simulation, which proves that at least the first part of it is correct.\n\nNow there are only 5 cases left, which need the same treatment, just this time they will be way more complicated, due to extra cards being drawn, cards being discarded and decks being shuffled. This post alone took me about 3 hours to compute and write down, so I will be done for today. And of course at least some of you need to understand my calculations, otherwise there would be no point in posting them here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542014","commentId":3542014,"userName":"sappidus","timestamp":1542736229,"content":"> 4 minutes ago, Amicus Draconis said:\n> \n> Now﻿ there﻿﻿ are only 5 cases left, which need the same treatment, just this time they will be way more complicated, due to extra cards being drawn, cards being discarded and decks being shuffled. This post alone took me about 3 hours to compute and write down, so I will be done for today. And of course at least some of you need to understand my calculations, otherwise there would be no point in posting them here.﻿\n\nI suspect analysis of the remaining cases would be best done using Markov chains, the mere appearance of which would probably narrow the interested public to statistically 0%, heh.\n\nEdited November 20, 2018 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542031","commentId":3542031,"userName":"Authraw","timestamp":1542736796,"content":"> 9 minutes ago, sappidus said:\n> \n> I suspect analysis of the remaining cases would be best done using Markov chains, the mere appearance of which would probably narrow the interested public to statistically 0%, heh.\n\nGiven this crowd? I'm not sure I would take that bet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542032","commentId":3542032,"userName":"dalestephenson","timestamp":1542736834,"content":"> 5 minutes ago, Seastan said:\n> \n> I disagree that that was the point (my reason for doing it would be so that Gimli could be used to kill an enemy), but it doesn't matter. All I'm saying is the added risk of losing a hero by taking both those attacks undefended was around 5%, full stop. Certain decisions can be made to increase that risk, but I based my statement on the decisions I would make. Other decisions lead to different risks, of course, as someone who decides to put the damage on Eowyn is going to face 100% chance of losing a hero.\n> \n> After placing the initial 2 undefended damage on Gimli, the risk of losing a hero by taking the second attack undefended was high. Higher than I'd be comfortable with personally as a conservative player. This is why I would've placed the first 2 damage differently.\n\nIf you place the first 2 damage on Thalin, you reduce the number of hero killing shadows from an undefended attack to 3 instead of 5.  It's still higher than 5% (3/26 rounds to 12%).  In order to get below 5% you need to place the first 2 damage on Thalin and *defend* with Gimli, which reduces the number of killing Shadows to 1 (1/26).  But in that case, Gimli increases his effective attack *at all* only if one of the two Dol Goldur Orcs shadows come out, and is not available to kill an enemy.  Clearly not practical at all under the circumstances.\n\nHowever, you make a good point that in this particular playthrough, it was not necessary to place the first undefended attack's damage on Gimli.  While Gimli wants the damage eventually for the Nazgul, he doesn't need the extra two points of damage *this* turn, and since he will still have a 2-strength attack enemy engaged after the combat phase he could easily take that damage *next* turn instead with another undefended attack (in fact, in Beorn's playthrough Gimli did exactly this, after being healed by Daughter of Nimrodel).  The only practical downside to putting the first undefended on Thalin is that it put him in range of Necromancer's Reach killing him during the next questing phase -- but since it would also kill Theodred and Eowyn, that would hardly matter."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542039","commentId":3542039,"userName":"Seastan","timestamp":1542737270,"content":"> 18 minutes ago, dalestephenson said:\n> \n> If you place the first 2 damage on Thalin, you reduce the number of hero killing shadows from an undefended attack to 3 instead of 5.  It's still higher than 5% (3/26 rounds to 12%).  In order to get below 5% you need to place the first 2 damage on Thalin and *defend* with Gimli, which reduces the number of killing Shadows to 1 (1/26). \n\nNo, the point is that you can put either undefended attack on Thalin if there isn't a bad shadow. It doesn't have to be the first. You need both shadows to be \"bad\" (or one to be Hummerhorns) to lose a hero with my strategy. This makes the risk less than 5% when you consider the fact that in half the cases where one of the shadows is Hummerhorns, you would have defended the wrong attack with Gimli anyway. So a first-order calculation of the risk is around:\n\n%hummerhorns/2 + %bad*%bad = 1/27/2 + 4/27 * 4/27 = 4%\n\nEdit: actually since there are two shadows the chance of seeing Hummerhorns is 2/27, not 1/27, so the risk is closer to 5.9%.\n\nEdit 2: But when you include the consideration that there are combinations that are loses no matter what you do, like Hummerhorns/Orcs and Orcs/Orcs, this drops even further.\n\nEdited November 20, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542086","commentId":3542086,"userName":"dalestephenson","timestamp":1542739551,"content":"Seastan, what you seem to be missing is that without Citadel Plate, Gimli has only 2 hp remaining -- he *cannot* take an undefended attack without the Plate.  If you take the first undefended attack and it discards the plate, you *have* to put it on Thalin to avoid hero death, and then have a second attack to take that will kill a hero if you take it undefended.  So it goes like this:\n\n1st attack (taken undefended)\n\n1/27 -- Eowyn dies instantly (Hummerhorns)\n\n2/27 -- Gimli takes 5 damage (Dol Goldur Orcs)\n\n2/27 -- Gimli loses plate, Thalin takes 2 damage\n\n22/27 -- no damage shadow [put on Thalin for highest survivability]\n\n2nd attack after no damage shadow (taken undefended)\n\n1/26 -- Eowyn and Thalin die instantly (Hummerhorns)\n\n2/26 -- Gimli takes 5 damage (Dol Goldur Orcs)\n\n2/26 -- Gimli loses plate, choose a hero to take undefended and die\n\n21/26 -- Gimli takes two damage.\n\n2nd attack after Dol Goldur shadow (taken undefended)\n\n1/26 -- Eowyn and Gimli die instantly (Hummerhorns)\n\n1/26 -- 5 damage attack, choose a hero to die (Dol Goldur Orcs)\n\n2/26 -- Gimli loses plate and dies, Thalin can take damage\n\n22/26 -- Thalin takes two damage\n\n2nd attack after Plate losing shadow (taken undefended)\n\nChoose a hero to die, all die with Hummerhorns\n\n2nd attack after Plate losing shadow (Gimli defends)\n\n1/26 -- all three heroes die (Hummerhorns)\n\n2/26 -- Gimli dies (Dol Goldur Orcs)\n\n23/36 -- No hero dies, but Gimli can't counterattack and you still have two engaged enemies\n\nSo if you think that the second attack *must* be taken undefended, since removing an enemy is essential even if it costs Thalin's life, the odds off hero death work out to be:\n\n1/27 [hummerhorns] + 2/27 [DGO] * 4/26 + 2/27 [lost plate] + 22/27 * 3/26 == 21.65%\n\nHowever, if you want to defend with Gimli after losing the plate during the first attack, you can reduce the odds to this:\n\n1/27 [hummerhorns] + 2/27 [DGO] * 4/26 + 2/27[lost plate] * 3/26 + 22/27 * 3/26 = 15.1%\n\nI think it makes more sense to sacrifice Thalin, but even if you don't you're still at 15.1% overall.  If you have no bad shadow on the first undefended attack, place the damage on Thalin, and elect to take the second attack undefended the odds of hero death from *that* attack are 11.5%, and that's after something *didn't* go wrong on the first attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542182","commentId":3542182,"userName":"Seastan","timestamp":1542743721,"content":"I grant that I wasn't considering the loss of the plate, and was treating the non-Hummerhorns shadows as equally bad, when they're not.\n\nBut you're still missing a major factor in this discussion. The relevant question is not \"What are the odds of a hero dying if I take these two attacks undefended\", but \"What are increased odds of a hero dying if I take these two attacks undefended\". For that we need to know the probability that you'd lose a hero even if Gimli had defended.\n\nLet's say the first attack is undefended, and Gimli defends the second attack.\n\n1st attack (taken undefended)\n\n1/27 -- Eowyn dies instantly (Hummerhorns)\n\n2/27 -- Gimli takes 5 damage (Dol Goldur Orcs)\n\n1/27 -- Gimli loses plate, Thalin takes 2 damage (Cavern)\n\n1/27 -- Gimli loses plate, Thalin takes 2 damage (Driven)\n\n22/27 -- no damage shadow [put on Thalin for highest survivability]\n\n2nd attack after no damage shadow (Gimli defends)\n\n1/26 -- 1 damage each, Thalin dies (Hummerhorns)\n\n2/26 -- Gimli takes 1 damage (Dol Goldur Orcs)\n\n1/26 -- Gimli loses plate\n\n1/26 -- Eowyn loses key\n\n21/26 -- no damage shadow\n\n2nd attack after Dol Goldur shadow (Gimli defends)\n\n1/26 -- 1 damage each, Thalin dies (Hummerhorns)\n\n1/26 -- +1 attack, Gimli dies (Dol Goldur Orcs)\n\n1/26 -- Gimli loses plate, dies\n\n1/26 -- Eowyn loses key\n\n22/26 -- no damage shadow\n\n2nd attack after Cavern (Gimli defends)\n\n1/26 -- 1 damage each, kills Thalin (Hummerhorns)\n\n2/26 -- +1 attack (Dol Goldur Orcs)\n\n1/26 -- Gimli loses plate\n\n22/26 -- no damage shadow\n\n2nd attack after Driven (Gimli defends)\n\n1/26 -- 1 damage each, kills Thalin (Hummerhorns)\n\n2/26 -- +1 attack (Dol Goldur Orcs)\n\n23/26 -- no damage shadow\n\n----\n\nTotal probability of hero death: 1/27 [Hum] + (22/27 [no damage] * 1/26 [Hum]) + (2/27 [DGO] * 3/26) + (1/27 [Cavern] * 1/26 [Hum]) + (1/27 [Driven] * 1/26 [Hum]) = 8.0%\n\nSo there was a 8.0% chance you were going to die no matter what, and that certainly matters in assessing the risk of a certain strategy.\n\nIf you are really committed to taking both undefended, no matter what the first shadow effect is, then the increased risk of losing a hero by doing so would be 21.65% (from your calculation)-8.0% = 13.65%\n\nOn the other hand, you point out that if the first shadow removes Gimli's plate, taking the second undefended is a guaranteed hero loss, so I'd probably defend. In this case the increased risk of the strategy is 15.1% (from your calculation)-8.0% = 7.1%, not far off my original 5% estimate.\n\nEdit: missed a condition\n\nEdited November 20, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542317","commentId":3542317,"userName":"Amicus Draconis","timestamp":1542750882,"content":"> 4 hours ago, sappidus said:\n> \n> I suspect analysis of the remaining cases would be best done using Markov chains, the mere appearance of which would probably narrow the interested public to statistically 0%, heh.\n\nHa, first I need to figure out, what a Markov chain is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542377","commentId":3542377,"userName":"Halberto","timestamp":1542753967,"content":"> 47 minutes ago, Amicus Draconis said:\n> \n> Ha, first I need to figure out, what a Markov chain is.\n\nI looked at Wikipedia,  felt dumb, closed it and put 3 copies of hasty stroke in my deck. Just in case..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542386","commentId":3542386,"userName":"dalestephenson","timestamp":1542754533,"content":"> 2 hours ago, Seastan said:\n> \n> So there was a 8.0% chance you were going to die no matter what, and that certainly matters in assessing the risk of a certain strategy.\n> \n> If you are really committed to taking both undefended, no matter what the first shadow effect is, then the increased risk of losing a hero by doing so would be 21.65% (from your calculation)-8.0% = 13.65%\n> \n> On the other hand, you point out that if the first shadow removes Gimli's plate, taking the second undefended is a guaranteed hero loss, so I'd probably defend. In this case the increased risk of the strategy is 15.1% (from your calculation)-8.0% = 7.1%, not far off my original 5% estimate.\n\nWith decreased risk comes decreased results -- if you defend with Gimli, you end the turn with two engaged enemies.  However, more to the point is that if you defend with Gimli when you remove plate, you *aren't* actually taking a second undefended attack at all, and the question was specifically about the risk from taking two undefended attacks.\n\nStill that's a bit afar afield from the original discussion about TaGimli, given that no one would *ever* take an undefended attack for the purpose of powering up Gimli if it were guaranteed to kill a hero!  The reasoning behind killing Thalin would be to let an already-powered-up-Gimli one-shot an enemy, which is an entirely different strategic decision.  The true decision point is after the shadow on the first undefended was revealed as harmless (OK, other than massively raising their threat).  Then the possibilities are:\n\n1) Put the two damage on Gimli (+2 attack), and defending with Gimli -- 3/26 chance of hero death, 2/26 chance of Gimli adding +3 attack.\n\n2) Put the two damage on Thalin and defending with Gimli -- 1/26 chance of hero death, 2/26 chance of Gimli adding +1 attack.\n\n3) Put the two damage on Thalin and taking the attack undefended -- 3/26 chance of hero death, 2/26 chance of Gimli +5 attack, 21/26 chance of Gimli +2 attack, and Gimli ready to kill one of the enemies.\n\n4) Put the two damage on Gimli (+2 attack) and taking the attack undefended -- 5/26 chance of hero death.\n\nBeorn's actual decision was 15% worse than the safest option, but it's far better than the safest option because the safest option doesn't kill an enemy and  doesn't ramp up Gimli's damage.  It's not better than #3 strategically just because the extra damage Beorn got from putting everything on Gimli *wasn't needed* to eliminate an enemy this turn.\n\nSuppose the shadow situation was the same, and the attackers were attacking for 4 and 2.  If you take the 2 undefended first, that effectively eliminates #1 and #4 as options.  It raises the death rate to 3/26 defending and 5/26 undefended -- the same relative margin, but gives a benefit the current #2 does not have -- it is guaranteed to increase Gimli's attack by at least two.  But it has the same problem -- Gimli can't strike back and eliminate an enemy.  In this case *despite* the additional risk, it is sensible to take an undefended 4-strength attack.  (You could take them in the opposite order and take the 4 undefended first, but it's the same situation -- any bad shadow on the 4-strength kills, and if you defend the 2-strength you can't kill an enemy).  That's purely a theoretical consideration, though.  The only 4-attack enemy is the Nazgul, and his magic one-shot number is 12, which even Gimli needs a lot of help to get to.  (He did get to 8 by the end of the round, the minimum necessary to one shot the already-engaged Dungeon Jailor and the minimum to two-shot the Nazgul.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542414","commentId":3542414,"userName":"Seastan","timestamp":1542756174,"content":"> 22 minutes ago, dalestephenson said:\n> \n> It's not better than #3 strategically just because the extra damage Beorn got from putting everything on Gimli *wasn't needed* to eliminate an enemy this turn.\n\nI agree. But tying to figure out the effect on the game win percentage is way too had, which is why I was careful to limit my statement to increased risk of hero loss, not game loss.\n\nI think it's safe to say that we are far enough away from the topic of Thorin here that we should move further discussion of Gimli (unless it pertains to Thorin) to a new topic."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542446","commentId":3542446,"userName":"Seastan","timestamp":1542760278,"content":"> 6 hours ago, Amicus Draconis said:\n> \n> This post alone took me about 3 hours to compute and write down\n\nHence why I went for the simulation route 😁"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542607","commentId":3542607,"userName":"Amicus Draconis","timestamp":1542775432,"content":"> 5 hours ago, Halberto said:\n> \n> I looked at Wikipedia,  felt dumb, closed it and put 3 copies of hasty stroke in my deck. Just in case...\n\nAbout the same for me. Need to look at it, when I am really awake this afternoon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542656","commentId":3542656,"userName":"ColinEdwards","timestamp":1542785487,"content":"> 2 hours ago, Amicus Draconis said:\n> \n> About the same for me. Need to look at it, when I am really awake this afternoon.\n\nMarkov chains are a way of simplifying problems by ignoring history and psychology; they are a favoured technique of mathematicians and engineers."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542891","commentId":3542891,"userName":"Amicus Draconis","timestamp":1542814424,"content":"> 14 hours ago, Seastan said:\n> \n> Hence why I went for the simulation route 😁\n\nAs I have not programmed for years, that would probably take even longer for me. But I needed most of the three hours to remember how combinations work, double check for mistakes and then write it down in a hopefully readable manner. I guess for some of the other cases I will not need as much time. By the way, what sequence did you use with Thorin? Discarding first and then drawing / using Master of the Forge or the other way round? I would assume it makes no difference, but I better ask anyway.\n\n> 7 hours ago, ColinEdwards said:\n> \n> Markov chains are a way of simplifying problems by ignoring history and psychology; they are a favoured technique of mathematicians and engineers.\n\nI hope they will simplify this problem for me as well :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542900","commentId":3542900,"userName":"Seastan","timestamp":1542814782,"content":"> 4 minutes ago, Amicus Draconis said:\n> \n> As I have not programmed for years, that would probably take even longer for me. But I needed most of the three hours to remember how combinations work, double check for mistakes and then write it down in a hopefully readable manner. I guess for some of the other cases I will not need as much time. By the way, what sequence did you use with Thorin? Discarding first and then drawing / using Master of the Forge or the other way round? I would assume it makes no difference, but I better ask anyway.\n> \n> I hope they will simplify this problem for me as well :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png].\n\nI always programmed Thorin last, as he'd probably be discarding in the combat phase after drawing or using Master of the Forge. Not that it makes any difference to the result."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542929","commentId":3542929,"userName":"Amicus Draconis","timestamp":1542816227,"content":"> 24 minutes ago, Seastan said:\n> \n> I always programmed Thorin last, as he'd probably be discarding in the combat phase after drawing or using Master of the Forge. Not that it makes any difference to the result.\n\nAnother question: Are there any other attachments in your deck, which the Master of the Forge can draw out? I assume not.\n\nEdit: Or at least you do not have to draw any besides Steward.\n\nEdited November 21, 2018 by Amicus Draconis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3542987","commentId":3542987,"userName":"Seastan","timestamp":1542818645,"content":"> 40 minutes ago, Amicus Draconis said:\n> \n> Another question: Are there any other attachments in your deck, which the Master of the Forge can draw out? I assume not.\n> \n> Edit: Or at least you do not have to draw any besides Steward.\n\nActually I assumed if you're running Master of the Forge you have more attachments than just Steward. So I was generous and assumed that Master of the Forge always found some attachment.\n\nEdited November 21, 2018 by Seastan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3543156","commentId":3543156,"userName":"Amicus Draconis","timestamp":1542825171,"content":"Thanks, that should help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3545968","commentId":3545968,"userName":"Amicus Draconis","timestamp":1543100631,"content":"My first results were:\n\n> On 11/20/2018 at 6:47 PM, Amicus Draconis said:\n> \n> p1 = 3 / 44 = 6.8%.\n> \n> p2 = 41 / 44 * 3 / 43 = 6.5%\n> \n> p3 = (1 - p1 - p2) * 3 / 42 = 6.2%\n> \n> p4 = (1 - p1 - p2 - p3) * 3 / 41 = 5.9%\n> \n> p5 = (1 - p1 - p2 - p3 - p4) * 3 / 40 = 5.6%\n> \n> p6 = (1 - p1 - p2 - p3 - p4 - p5) * 3 / 39 = 5.3%\n> \n> p7 = (1 - p1 - p2 - p3 - p4 - p5 - p6) * 3 / 38 = 5.0%\n> \n> E = (6.8% * 1 + 6.5% * 2 + 6.2% * 3 + 5.9% * 4 + 5.6% * 5 + 5.3% * 6 + 5.0% * 7) / 41.3% = 3.8\n\nThis time, I will have a look two other cases:\n\n2a) Extra card each round, with no Thorin\n\nThis now means, over the course of 7 rounds, a total of 14 cards will be drawn. As one can see, the individual probabilities form a mathematical sequence, which allows to compute the next seven steps. I could write the sequence down, but this forum is not suited to do so and thus it looks terrible:\n\npn = (1 - sum (pm, 1..n..m-1) * 3 / (45 - n)\n\np8 = 4.8%\n\np9 = 4.5%\n\np10 = 4.2%\n\np11 = 4.0%\n\np12 = 3.7%\n\np13 = 3.5%\n\np14 = 3.3%\n\nThe sum of all 14 probabilities yields 69.3% which is also the result of 1 - C(3, 0) *C(41, 14) / C(44, 14) and slightly lower than Seastan's result of 69.5%.\n\nThe expected value this time looks as follows, slightly higher than Seastan's result of 3.5:\n\nE = ((6.8% + 6.5%) * 1 + (6.2% + 5.9%) * 2 + (5.6% + 5.3%) * 3 + (5.0% +4.8%) * 4 + (4.5% + 4.2%) * 5 + (4.0% + 3.7%) * 6 + (3.5% + 3.3%) * 7) / 69.3% =  3.6\n\nSeastan's simulation was a little bit more generous with drawing Steward, but as mentioned before, there always is a small variance in such simulations. Off to the next case:\n\n1b) Drawing 1 card per turn, with Thorin each round\n\nLet's define a function p(n, m) = n / m which gives the probability of Steward being the top card of a deck containing m cards, when n Stewards are left in the deck. Every even card will be drawn and every odd one will be discarded by Thorin.\n\nThe probability for having Steward on top of the 44 card deck with 3 Stewards in it and thus drawing it in the first round is the same as p1: p(3, 44) = 3 / 44 = 6.8%. Of course there is a 1 - p(3, 44) = 93.2% chance, this will not be the case. Hereafter we will only look at cases, that have not yet been won, as there is no need to draw or discard any more cards, when the first Steward is already in hand.\n\nIn the first round Thorin will discard a Steward with the probability of p(3, 43) = 3 / 43 = 7.0% which will only happen in (1 - p(3, 44)) * p(3, 43) = 6.5% of all games. Again this is the same probability as p2, after all the first Steward is the second card of the deck in this case. But now it becomes more interesting, as discarding Stewards from the deck not only makes the deck smaller, it also reduces the chance for another Steward. Not discarding a Steward at this point will happen with a (1 - p(3, 44)) * (1 - p(3, 43)) = 86.7% chance in all games.\n\nThe draw in the second round depends on whether one of our Stewards has already been discarded or not. If not, then there is a p(3, 42) = 7.1% chance of a Steward on top of the deck. Multiplying both relevant probabilities yields (1 - p(3, 44)) * (1 - p(3, 43)) * p(3, 42) = 6.2%, which equals p3. But we are only in the second round and we have yet to calculate, how often we will draw a Steward in the second round, when one copy has been discarded in the first.\n\nIf a Steward has already been discarded, the chance of another one on top of the deck at this point is p(2, 42) = 4.8%. This will only happen in (1 - p(3, 44)) * p(3, 43) * p(2, 42) = 0.3% of all games. Adding both probabilities of drawing a Steward in the second round yields 6.2% + 0.3% = 6.5% which equals p2. So no matter what card has been discarded in the first round, the probability to draw a Steward in the second round is the same, as when not discarding a card at all.\n\nThis nice exercise can now be repeated for all 7 rounds (I will not do it here, as it would be far too long for this post), and the end result will show, that discarding will not affect your chances of seeing a copy of Steward (as long as you do not run out of your deck). If anyone is interested in my OpenOffice spreadsheet, feel free to ask.\n\nAnd as the probabilities are the same as in case 1a), the expected value will also be the same."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3603845","commentId":3603845,"userName":"urloony","timestamp":1548514123,"content":"Thorin Stonehelm does not say (once per round) so  what is preventing a player from just discarding multiple cards to get multiple bonuses? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286008-thorin-stonehelm-hero/?do=findComment&comment=3603853","commentId":3603853,"userName":"GrandSpleen","timestamp":1548515430,"content":"You can only use a Response once per qualifying trigger, so you can only use Thorin's response once per attack. You can use it again for another attack in the same round if you ready Thorin and attack a different enemy.\n\nIf you could use a Response as many times as you want for a single trigger, you could, for example, trigger Horn of Gondor infinitely and get infinite resources any time 1 ally is destroyed."}]}