{"url":"https://community.fantasyflightgames.com/topic/286198-effect-of-a-card-after-being-discarded/","title":"Effect of a card after being discarded","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/286198-effect-of-a-card-after-being-discarded/?do=findComment&comment=3536319","commentId":3536319,"userName":"Miceldars","timestamp":1542264811,"content":"If I use the action of ally Faramir to give +1 willpower for my characters committed in quest, and then Faramir is discarded (or killed) during the quest phase by some encounter card effect, does the +1 willpower remains until the end of the phase, or disappear with Faramir ?\n\nThe same question applies for ally Arwen and other cards like that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286198-effect-of-a-card-after-being-discarded/?do=findComment&comment=3536336","commentId":3536336,"userName":"GrandSpleen","timestamp":1542265705,"content":"In this case, you would keep the bonus (Faramir or Arwen).  They create a 'lasting effect,' which persists even if the card which created it leaves play / gets its text box blanked.  From the rules reference:\n\nLasting Effects\nSome card abilities create effects or conditions that\naffect the game state for a specified duration (such as\n“until the end of the phase” or “until the end of this\nattack”). Such effects are known as lasting effects.\n◊ A lasting effect persists beyond the resolution of the\nability that created it, for a duration specified by the\neffect. The effect continues to affect the game state\nfor the specified duration whether or not the card\nthat created the lasting effect is or remains in play.\n◊ If a lasting effect generated by a player card affects\nin-play cards (or a specified set of cards), it is only\napplied to cards that are in play (or that meet the\nspecifications of the set) at the time the lasting\neffect is established. Cards that enter play (or\nchange status to meet the criteria of the specified\nset) after a lasting effect’s establishment are not\nsubsequently affected by that lasting effect.\n11\n◊ If a lasting effect generated by an encounter card\nor quest card affects in-play cards (or a specified\nset of cards), it is applied to all cards that meet its\ncriteria regardless of their play-state at the time\nthe lasting effect is established. Cards that enter\nplay (or change status to meet the criteria of the\nspecified set) after a lasting effect’s establishment\nare subsequently affected by that lasting effect\nthe same as cards that are in-play at the time of\nits establishment. This aids the encounter deck’s\nability to create effective card combinations.\n◊ A lasting effect expires as soon as the timing point\nspecified by its duration is reached. This means\nthat an “until the end of the round” lasting effect\nexpires just before an “at the end of the round”\nability or delayed effect may initiate.\n◊ A lasting effect that expires at the end of a\nspecified time period can only be initiated during\nthat time period."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286198-effect-of-a-card-after-being-discarded/?do=findComment&comment=3536338","commentId":3536338,"userName":"Miceldars","timestamp":1542266330,"content":"That is what I thought. Thank you"}]}