{"url":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/","title":"Sentinel and Ranged (the meaning of)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545088","commentId":3545088,"userName":"GrandSpleen","timestamp":1543005090,"content":"Would you accept a 'ranged' ally which did not have a projectile weapon?\n\nRanged's defensive correlate is 'sentinel,' which is an inherently more abstract concept.  Is the sentinel physically moving between different areas to protect the various characters in play?  What does 'sentinel' mean?\n \n\nRanged seems to be handled much more literally in the game.  Nearly all of the ranged characters in play have a ranged weapon, or can fly (eagles, or Lanwyn's falcon).  So the implication there is that yes, some physical distance is being covered by the 'ranged' attack.  \n\nIs 'ranged' was handle the same way conceptually as 'sentinel,' we would see melee attackers engaging in 'ranged' attacks, meaning they could traverse some physical distance to attack an enemy somewhere else, but still at melee range.  We do have this in game, with Vassal of the Windlord and Lanwyn.\n\nWould you accept an ally that grants 'ranged' much in the same way that Arwen grants 'sentinel?'  (cost should be higher, Arwen is recognized as one of the best allies in the game. You just get more than you pay for. She could cost 4 and still see some play, although she would be less ubiquitous than she is now)\n\nThanks for your thoughts!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545129","commentId":3545129,"userName":"Halberto","timestamp":1543007878,"content":"Arwen ally has seen less play since her hero version release. Cost 2 is discounted compared to her value but she is unique and an iconic character so I think it's coherent with what they wanted her to be.\n\nA questing ally granting +1 attack and ranged to another character  when exhausting would be very powerful but less then arwen. Defence is (was) tipiccaly more difficult to boost and far less easy to come by than attack. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545166","commentId":3545166,"userName":"GrandSpleen","timestamp":1543010701,"content":"Yes, the fact that attack can be combined across characters, while defense cannot be (except through card effect), makes defensive boosts more valuable. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545286","commentId":3545286,"userName":"JusticeLizard","timestamp":1543018660,"content":"Shadowfax also supports this idea of ranged."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545616","commentId":3545616,"userName":"Halberto","timestamp":1543064063,"content":"> 14 hours ago, GrandSpleen said:\n> \n> Yes, the fact that attack can be combined across characters, while defense cannot be (except through card effect), makes defensive boosts more valuable. \n\nWhich make me think of willpower boost being difficult to rate. From one side we have powerful or even op global options like faramir, sword that was broken, visionary leadership,  hard and Dale boost. \n\nOn the other hand \"individulal\" boost is hard to get,  expensive, limited to conditional situtation and generally not ally friend in terms of attachment. \n\nAfter 7 years the main source of willpower is still the same of core set and first cycles time: strong questing heroes and cheap 2 cost 2 wp questing allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3545748","commentId":3545748,"userName":"Rouxxor","timestamp":1543077756,"content":"Quite an interesting point of view ^^.\n\nTo me Sentinel refer to something common in RPG/MOBA... : someone who can force opponent to attack him instead of his friend. Someone who take the aggro. It could be physical (stand between the two), magical (not really fit to LoTR so) or psychological, since it threatening enemies that do not face it. You get the same risk to be killed by the magician who is doing magic stuff in the back than the warrior who get an axe. But you are more afraid of the immediate threat than you can see. So everyone face the warrior, decreasing their chance to win so as their chance to live in the end ^^.\n\nRanged is about attacking enemies in a long distance. So moving fast, sending things. It is really more physical stuff.\n\nAnd, the second debate that I love even more is about the most valuable stat between Attack, Defense and Willpower. I will add the Hit Point to compare them all. To me:\n- Willpower is the best stat by far. You need it every turn, in high quantity. All of the 2 willpower for 2 allies are played, only the choice of who is played depend of the theme. You sometime are really happy to go to 20, 30, 40, 50 or even 60 of willpower (even outside the dark gate open ^^). When you lack willpower to pass the quest you don't get to clear the location, so you can't travel and it can quickly be worse and worse since the staging are become more and more filled with encounter cards.\n- After that I consider that attack is the second best things to have. You can't kill enemies without it, and if you don't kill enemies they keep to attack you and froze a good character or even worse kill a character each turn, with a shadow cards to make things even worse. Having a lot of attack is needed to beat many enemies on the same time, or a big boss. When you lack a little attack it could snowball to your death.\n- Then I consider defense and Hit Point to be close, but for very different reason. Defense is almost useless in a small quantity (like 1) since you are more likely to let the attack undefended to enjoy other stats. But even with the right number of defense stats it is really something difficult to get the right division: you sometime need many character with few of it (like 4 blockers with 2 defense), and sometime with 1 blocker at 8 defense. Unlike the other stats you can't combine it so you need the right character at the right time. Hopefully you always get many others options: let it undefended (especially if it is the first case: small attack(s)), or block with a small allies (trash-block). And even if you get the right things shadow cards come in so you always need to be really cautious. In addition we all know that we need very few blockers that attackers or quest people. At least 2 times less. So if you have many defense character in your deck you can have too many of them. That make defending character really weak compare to attacking of questing one's. Of course the best still earn a place in our decks, but we really need to be more selective with them. Since you need to defend all the attacks we still invest what it needed to do so, so we put many attachement on a character only for defending (and be sure that no shadow is used) because we don't want to sacrifice an ally per turn, but it is sometime barely better than just playing more allies and accept to loose one every time a big enemy show up.\nHit Point is not used as another stats. It is a resistance to treachery, undefended attack or for defender some one time only additional defense (until you heal it). In everything go perfectly you never have any use of it. But having a little of them is a real gain. Having 4 or 5 Hit point on each hero is just some threat you spend on few gain, so as 1 or 2 defense on a character that will do anything else (and sometime it is also true for willpower of attack though, but almost never in a character who have at least 2 of them).\n\nIn a solo lineup the most common thing to see is 3 questing heroes, or 2 questing heroes 1 attacker (or anything like with character who can one or another) and heroes than are mainly made for blocking are almost non existent. Beregond is really more a multiplayer card. And that illustrate well my point.\n\nBut, to goes back to the original point, that does not mean that Arwen would be that much better if she give 1 attack or 1 willpower. I never really thought about it though. But putting 1 defense on any character you want solve pretty well on of the issue I said before: in some case you need a BIG defender and in other one many average ones. Arwen allow that, and even allow us to choose every turn. Defense is really more valuable this way, even if we are forced to do the choice before revealing the enemies. As strong as an Arwen that give +1 attack (and ranged if you want) I think. I still think that with 3 willpower (2 that give 1, who is even better in some case) for 2 resource Arwen will be even stronger though. Probably the best ally ever. For a 3 cost ally it is strong but more reasonable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3547029","commentId":3547029,"userName":"dalestephenson","timestamp":1543202093,"content":"I think the value of Arwen's ability is less about the flexibility of which defender to enhance when she exhausts (since she has to make this decision before you know how many attacks you will need to defend, and more about the marginal value of defense.\n\nIt's true that defense is more likely to be a wasted stat than willpower or attack.  Willpower scales in a linear fashion, with 2 willpower nearly always being exactly twice as good as one.  Extra willpower doesn't become wasted until you've gone past the amount needed to counter the threat in staging, clear the active location, and clear the current stage.  Attack almost scales in a linear fashion, but may not be needed every turn, it's not wasted until you have enough attack to eliminate all your engaged enemies already -- however, unlike willpower it's possible to have low enough collective attack that there is *no* benefit for having attack available (since it can't punch through the defense) -- but even in that case, you add more attack, and your wimpy attacker can contribute mightily to the cause.\n\nDefense isn't like that.  A 2-0-0-1 questing ally is valuable.  A 0-2-0-1 attacker is valuable.  A 0-0-2-1 defender is a chump blocker.  OTOH, a 4-0-0-1 quester just as good as two 2-0-0-1 (ignoring cards like Faramir, etc).  A 0-4-0-1 attacker is just as good as two 4-0-0-1.  But two 0-0-2-1 defenders will typically give you exactly two defenses, while a single 0-0-4-1 defender (Defender of Rammas) can defend *repeatedly* in many quests.  Defending is dangerous work, and while survivability for a single attack is based on defense + hp, for repeated use defense is far more important, and the value of an extra point of defense is non-linear.  That's why Arwen is so valuable, she can significantly increase defense survivability, where an extra point of willpower or attack is typically just another extra point.  That's why despite attacking heroes being more common (and more commonly used) than defending heroes, Dunedain Warning is in 39 pages of decks and Dunedain Mark is in 27 pages.  Low defense is worthless.  High defense is invaluable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3547165","commentId":3547165,"userName":"GrandSpleen","timestamp":1543218365,"content":"Ok, so... Blood or Fire, which attachment is the more valuable?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3547243","commentId":3547243,"userName":"Halberto","timestamp":1543226996,"content":"> 2 hours ago, GrandSpleen said:\n> \n> Ok, so... Blood or Fire, which attachment is the more valuable?\n\nGood question and probably lateral to the discussion. Those attachemnets are very specific and are crazy when buffed with resources acceleration. I think fire is more used because it allow to build killing machine heroes or solve the puzzle of very specific scenarios. \n\nIn general I rate defence more valuable because it's less easy to build and change the way you face the quest. 3 def can be fine in one quest and trash in another. \n\nBut when I use blood or fire, which  I tried to avoid, then I use more frequently fire. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3547410","commentId":3547410,"userName":"dalestephenson","timestamp":1543243379,"content":"Blood is in fourteen pages of decks, fire is in thirteen pages of decks --- seven pages have both, so blood is only slightly more popular than fire.\n\nHowever, Gondorian Fire is available in a sphere with many strong attackers, and Blood of Numenor is in a sphere with few strong defenders.\n\nGondorian Fire can give you one-shot attacking power.  However, when blood triggers it saves heroes; and it can be triggered after the shadow is revealed.  I value Blood more, but I trigger Fire more (because with a hero defender I provide more defensive help than just Blood)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3548873","commentId":3548873,"userName":"ColinEdwards","timestamp":1543314168,"content":"> On 11/26/2018 at 7:46 AM, GrandSpleen said:\n> \n> Ok, so... Blood ﻿or Fire, which attachment is the more valuable?\n\n \n\nGetting off topic but ... anyone else think Blood of Gondor would be a LOT more useful if it was a Leadership card? It's always felt like the wrong sphere to me.\n\n \n\n> Quote\n> \n> Would you accept a 'ranged' ally which did not have a projectile weapon?\n\nTotally. I think it's a very reasonable thing to expect of cavalry or eagles.\n(In fact, it feels 'wrong' to me that more 'cavalry' don't have 'ranged', not to imply that they are all horse archers, just that horses have a greater range than footmen; archers should have had 'first strike' instead.)\n\nEdited November 27, 2018 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549553","commentId":3549553,"userName":"Seastan","timestamp":1543349505,"content":"> On 11/26/2018 at 6:42 AM, dalestephenson said:\n> \n> I value Blood more, but I trigger Fire more (because with a hero defender I provide more defensive help than just Blood).\n\nThis has also been my experience.\n\n> 9 hours ago, ColinEdwards said:\n> \n> Getting off topic but ... anyone else think Blood of Gondor would be a LOT more useful if it was a Leadership card? It's always felt like the wrong sphere to me.\n\nI don't think Blood of Gondor needs to be more useful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549561","commentId":3549561,"userName":"Seastan","timestamp":1543349811,"content":"> On 11/24/2018 at 8:42 AM, Rouxxor said:\n> \n> - After that I consider that attack is the second best things to have. You can't kill enemies without it, and if you don't kill enemies they keep to attack you and froze a good character or even worse kill a character each turn, with a shadow cards to make things even worse. Having a lot of attack is needed to beat many enemies on the same time, or a big boss. When you lack a little attack it could snowball to your death.\n\nI'd rank the stats as willpower > defense > attack > hit points. Attack gets you nowhere if you can't defend."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549638","commentId":3549638,"userName":"Amicus Draconis","timestamp":1543353636,"content":"I'm more with Rouxxor's opinion. As Defensive options besides defense you still have chumps, undefended, healing, damage prevention/redirection, events like Feint and attachments like Forest Snare or Entangling Nets. Without killing your enemies you will get swarmed and then chumping will get expensive, you run out of hitpoints for taking attacks undefended and so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549679","commentId":3549679,"userName":"Halberto","timestamp":1543354638,"content":"> 7 minutes ago, Amicus Draconis said:\n> \n> I'm more with Rouxxor's opinion. As Defensive options besides defense you still have chumps, undefended, healing, damage prevention/redirection, events like Feint and attachments like Forest Snare or Entangling Nets. Without killing your enemies you will get swarmed and then chumping will get expensive, you run out of hitpoints for taking attacks undefended and so on.\n\nReverting the view: Chump bloking cost lots of resources in the long run; feint and traps too. With those money you can pay for its of attacking ally. I found that I rarely fail quest because I lack attack to deal with standard enemies while I often get in trouble if I miss valid repeteable defence options or willpower. It's true that in low player count defence is probably less pivotal since you will see lower enemies count and probably can deal with them with alrernative means. \n\nPersonally I agree on the hierarchy of stats willpower >durability (defense+hitpoints on same charachter if healing is around)>attack.\n\nDefence remain the most difficult stat to build/buff and multiple character stats  cannot stack unless you play events or Dori hero....\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549802","commentId":3549802,"userName":"Amicus Draconis","timestamp":1543358928,"content":"> 50 minutes ago, Halberto said:\n> \n> Reverting the view: Chump bloking cost lots of resources in the long run; feint and traps too. With those money you can pay for its of attacking ally. I found that I rarely fail quest because I lack attack to deal with standard enemies while I often get in trouble if I miss valid repeteable defence options or willpower. It's true that in low player count defence is probably less pivotal since you will see lower enemies count and probably can deal with them with alrernative means. \n> \n> Personally I agree on the hierarchy of stats willpower >durability (defense+hitpoints on same charachter if healing is around)>attack.\n> \n> Defence remain the most difficult stat to build/buff and multiple character stats  cannot stack unless you play events or Dori hero....\n\nChumping is not so expensive when you find your Horn of Gondor. But maybe my mindest comes from other games, where the best defense is a strong offense. I prefer a berserker over a guardian, mostly because gameplay is more risky and fun for me.\n\nMost of my losses come from not being able to kill my engaged enemies. I'd rather throw a chump under a troll and kill it in one round, than tanking it round after round without getting rid of it, because the other enemies will come eventually and then I will need a defensive option for them, but my tank is occupied with the troll.\n\nBut that is just my experience, yours might deviate and that is fine for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549823","commentId":3549823,"userName":"Rouxxor","timestamp":1543359933,"content":"> 2 hours ago, Seastan said:\n> \n> I'd rank the stats as willpower > defense > attack > hit points. Attack gets you nowhere if you can't defend.\n\nDefense if you can't kill is not very much more useful...\n\nIf you take a random hero in the game and choose to add him one stat more. What do you likely give it? If we average this for all the heroes of the game this will probably be first Willpower, Attack, Defense then Hit points. But the character that get one defense will probably gain more value that character that gain 1 attack.\n\nIn the end I couldn't really evaluate what is the most useful. There is few good defender, and many good attacking character since you need more of them. But, again, it doesn't mean that one is better than the other. Only Hit Points had few utilities (but it had some nonetheless)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3549953","commentId":3549953,"userName":"Wandalf the Gizzard","timestamp":1543368778,"content":"The argument for defense being more valuable is that with only unlimited attack, you will eventually succumb to undefended attacks and other various means of damage. With only infinite defense, you are untouchable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550001","commentId":3550001,"userName":"dalestephenson","timestamp":1543374341,"content":"I've played a ton of Dori fellowships so I'm biased towards hero defense.  With Dori any 2+ def hero can become a Beregond.  Because it's two-handed, finding adequate attack to kill enemies has rarely been a problem; the one exception was the Dori/Rossiel fellowship, which just didn't have the raw attack needed to take down the balrog in Shadow and Flame, and couldn't handle two attacks per turn from the balrog -- but most of the other fellowships wouldn't have had that issue; that particular one was unusually light on attack due to all the deck space devoted to encounter deck manipulation cards.\n\nMy most often played one-deck lineups are Beorn's Path LeAragorn/Theodred/LoDenethor and SpEowyn/Thalin/TaGimli.  The first builds up LoDenethor as a hero defender and relies on Aragorn + allies for attack; the later relies on tactics defenders and TaGimli for attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550050","commentId":3550050,"userName":"Amicus Draconis","timestamp":1543380856,"content":"> 3 hours ago, Wandalf the Gizzard said:\n> \n> The argument for defense being more valuable is that with only unlimited attack, you will eventually succumb to undefended attacks and other various means of damage. With only infinite defense, you are untouchable.\n\nAnd then you will die to direct damage as well, or stick on the first stage of Journey along the Anduin until you threat out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550116","commentId":3550116,"userName":"Miceldars","timestamp":1543388626,"content":"I don't like to not have a good defender in my hero lineup, generally with shadow cancellation (Erkenbrand or lore hero), even in solo play. I rarely relies on my allies to defend, because most of them have 1 or 2 points of defense when enemies often hit for 4-5."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550179","commentId":3550179,"userName":"ColinEdwards","timestamp":1543397559,"content":"I think this thread has gone weird!\n\nThe think the question is more about 'what is more useful to stack on someone' rather than the relative merits of offense or defense.\n\nIn most cases, stacking defense is more useful than stacking attack OR willpower. You defend with one person at a time, but can have multiple attackers and questors.\n\nI think stacking attack is second, because you can potentially attack more than once.\n\nIn general, willpower doesn't make much difference stacked; having two people and a potential chump blocker seems more flexible.\n\n(Gondorian Fire was, in part, so powerful because it existed in same sphere as the once undisputed King of Multiple Actions, Boromir... Merry is in sphere as well.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550192","commentId":3550192,"userName":"Rouxxor","timestamp":1543401117,"content":"We are many to agree that having 1 defense with Arwen is superior to having 1 attack. But I'm still convinced (and the Seastan post seem to indicate that he shares my point) that with willpower it will be even better. A 2-cost character with 3 willpower is really great. Just because willpower is so much important. And there will be cool combo (with Rosie, with Eomer, with golden shield, with herugrim...) that doesn't really exist with defense (edit: oh well, just ready to block multiple times is in fact as strong probably).\n\n> Quote\n> \n> The argument for defense being more valuable is that with only unlimited attack, you will eventually succumb to undefended attacks and other various means of damage. With only infinite defense, you are untouchable.\n\nYou can chump and then kill the enemies, with only defender you suffer all the shadow effects every turn, all the passive effects of the enemies and in a real case where you have just \"a little bit more than needed\" attack or defense you will eventually get even more enemies and this became out of hand very quickly. And the situation can reverse since you can't kill many enemies out of nowhere, but you can just draw/install a defender to face the next enemies and you will only have lost a small ally.\n\nEdited November 28, 2018 by Rouxxor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3550339","commentId":3550339,"userName":"dalestephenson","timestamp":1543417765,"content":"Arwen would be terrific value at 3 wp (effective) for 2 cost.  But I'd be much less excited to have her in my deck.  1 extra willpower makes little marginal difference.  1 extra defense (plus sentinel) can make a significant marginal contribution.\n\nIt's notable that several of the cool combos (Rosie, Golden Shield, Herugrim) of a hypothetical extra willpower handed out for Arwen are cool precisely *because* they convert willpower into attack or defense.  Rosie Cotton is Arwen on steroids in a Hobbit deck because she can give you whatever you need -- willpower, defense, attack.  Used in a solo deck most of the time she's going to be just tacking it on to a questing hobbit, because her attack/defense boost isn't needed that turn.  In combat, she'll be used more often in attack, since killing things can be an issue for non-TaMerry hobbit decks.  But when she's used for defense, it will save hobbit hero lives.  The most common usage isn't the most valuable usage, IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3551091","commentId":3551091,"userName":"Seastan","timestamp":1543456199,"content":"> On 11/27/2018 at 3:05 PM, Rouxxor said:\n> \n> Defense if you can't kill is not very much more useful...\n\nI think it is. There are many viable solo decks that get by on the ability to defend well with very little attacking capability. Dunedain decks are the most obvious example, where some games you never need to attack at all. The are relatively fewer viable solo decks where the reverse is true."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3552057","commentId":3552057,"userName":"Finch204","timestamp":1543525049,"content":"Defense wins championships! Wait... wrong forum LOL.\n\nAnyway, I value defense more than attack, because you can't kill anything when your characters are dead. While if you have a good enough defense, oftentimes in my experience, you will last long enough to draw the card you need to push through and win the game, in my case this is usually Gandalf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3552471","commentId":3552471,"userName":"Wandalf the Gizzard","timestamp":1543546978,"content":"> 6 hours ago, Finch204 said:\n> \n> Defense win﻿s championships! Wait... wrong forum LOL﻿.\n\nYESSSS! Spurs for life! I'm glad there's more than one gamer nba fan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/286674-sentinel-and-ranged-the-meaning-of/?do=findComment&comment=3552700","commentId":3552700,"userName":"Halberto","timestamp":1543564420,"content":"> 4 hours ago, Wandalf the Gizzard said:\n> \n> YESSSS! Spurs for life! I'm glad there's more than one gamer nba fan.\n\nLet me sign in for this. "}]}