{"url":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/","title":"Solo League 4 -- Angmar Awakens cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554032","commentId":3554032,"userName":"dalestephenson","timestamp":1543676887,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Lost Realm and the Angmar Awakens cycle. The quests are:\n\n1) Intruders in Chetwood (Deluxe)\n2) Across the Ettenmoors (AP3)\n3) The Dread Realm (AP6)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests -- this means you must have at least one of Tactics Aragorn, Halbarad, Dori, or Arwen.  [Tactics Eowyn doesn't count against tiebreakers for this league, but does not fulfill a mandatory hero requirement.]\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against The Dread Realm and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Across the Ettenmoors it does not matter how many tokens I needed to defeat Intruders in Chetwood.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker.  You are required to reveal which Heroes you used, and how many cards in your deck came from outside LR/AA cycle and a single core.  Do not include outside heroes in this count, only cards in the deck itself.\n\n5) We've found that we need lots of tiebreakers since so far the winner has always earned zero tokens, and since Carn Dum isn't one of the three quests it might stay that way.  Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from LR/AA or a single core) used in the deck.  Do not count outside heroes in this count, only cards in the deck.  Less cards is better.\n\n2nd) The number of heroes specifically from Lost Realm and Angmar Awakens, plus Tactics Eowyn.  More is better.\n\n3rd) The number of heroes used from this list: Tactics Aragorn, Halbarad, Dori, Arwen, Tactics Eowyn.  More is better.\n\n4th) The number of cards in the deck outside Lost Realm and Angmar Awakens.  Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Lost Realm, Across the Ettenmoors, and Dread Realm.  Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in November's Solo League (if you didn't play or finish November's League, a median performance will be assumed).  Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for February's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in February's league. January's league will be set in the Haradrim cycle.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern, except skipping the one that falls on Christmas Eve.  Only the final deadline (New Year's Eve) really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nIntruders in Chetwood: December 10th\nAcross the Ettenmoors: December 17th\nThe Dread Realm: December 31st\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1QwUVFNyglFzJv9mVQ051pTc_hE3KscWeHRqzPpC9pEY/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1QwUVFNyglFzJv9mVQ051pTc_hE3KscWeHRqzPpC9pEY/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself.\n\nEdited December 2, 2018 by dalestephenson\nFix name of third quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554034","commentId":3554034,"userName":"Miceldars","timestamp":1543677427,"content":"I think I will participate, but maybe late. I will have the angmar cycle in few days for my birthday, and I want to play it first with my girlfriend"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554035","commentId":3554035,"userName":"dalestephenson","timestamp":1543677551,"content":"Have fun, and don't let Carn Dum get you down."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554047","commentId":3554047,"userName":"Authraw","timestamp":1543678995,"content":"This is going to be really interesting! I'm already trying to figure out just how optimized I can get... "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554083","commentId":3554083,"userName":"dalestephenson","timestamp":1543682805,"content":"My deck is far from a 0-card deck, but should be interesting to play -- I ended up going with TaEowyn/Dori/Grimbeorn for mono-tactics goodness.  Dori + Grimbeorn means defending for five and counterattacking for five."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554140","commentId":3554140,"userName":"Authraw","timestamp":1543687676,"content":"Oh wow, yeah, I never thought about it before but Dori + Grimbeorn is a pretty good combo. I bet that'll be a fun one!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3554434","commentId":3554434,"userName":"Wandalf the Gizzard","timestamp":1543712117,"content":"* Dread Realm"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3556764","commentId":3556764,"userName":"PigsAreOurEquals","timestamp":1543909868,"content":"I will again restrict to core+cycle cards. This time there was a dilemma because there are 2 natural deck choices in the Angmar Awakend cycle: Dunedain or Noldor. But Erestor decks are one of my favourites and easier to solo than dundeain, so I picked Erestor.\n\nEdited December 4, 2018 by PigsAreOurEquals"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3565566","commentId":3565566,"userName":"dalestephenson","timestamp":1544670507,"content":"Here's the standings after the first quest (outside cards in parens):\n\nIntruders in Chetwood:\n\n0 PigsAreOurEquals (0)\n1 dalestephenson (26)\n\nI noticed I had a serious flaw in my deck -- I left weapons out, so Grimbeorn is attacking for five in a quest where you need six.  Anyone playing my deck off ringsdb should swap in 3x Raiment of War.  However, what did me in during the first run was the side-quest that gave you three turns to get Iarion back -- I ended up one progress short on the final turn.  The second time through the lone token allowed me to play Treebeard on turn one, and I managed to kill off two Orc War Parties (the starting one with TaEowyn's power) enroute to getting enough 2-wp allies to quest to victory.  My zero token streak in official runs has come to an end.\n\nI hope we will see more players take a crack at these quests, it'd be kind of embarrassing to finish both second and last.  The deadline for the final quest is January 31st, so if you don't have time to play until the holidays it won't be too late.\n\nOn to Across the Ettenmoors..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3565669","commentId":3565669,"userName":"Miceldars","timestamp":1544684367,"content":"31st december, you mean ?\n\nI don't have begun yet, we just did The treachery of Rhudaur with my girlfriend. I'm in holiday next week, I think I will try at that moment. So don't worry, you won't be last !"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3565735","commentId":3565735,"userName":"Authraw","timestamp":1544691623,"content":"Work is riding me really hard right now so I don't have much time for... Well, anything, really. But hopefully I'll get a chance to give this a try over the couple of days I get off for the holiday."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3565787","commentId":3565787,"userName":"dalestephenson","timestamp":1544698669,"content":"Yes, I meant 31 December for the final deadline.  Thanks for the correction."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3568976","commentId":3568976,"userName":"Miceldars","timestamp":1545057839,"content":"Played Intruders in chetwood only once in 2 players and easy mode. No training, succeed with only 2 tokens. I'm quite happy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3569865","commentId":3569865,"userName":"Miceldars","timestamp":1545140794,"content":"I just win the two last quest on the first try, with 0 tokens \\o/. I went totally blind on The dread realm, I have never played it before. I was totally all in on the last turn, with no card left in my deck and a certain loss if I don't have enough willpower (the \"1 damage on all character\" would have killed almost all my allies)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570116","commentId":3570116,"userName":"Miceldars","timestamp":1545155653,"content":"Hum, wait... I just saw Arwen's ability targets NOLDOR heroes, and not Noble... I used it sometimes to give a resource to Denethor, so my victories are not valids. I don't know if I will try again v_v"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570121","commentId":3570121,"userName":"dalestephenson","timestamp":1545156105,"content":"Ouch.  Did you design your deck based on being able to get lore resources from Arwen as needed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570159","commentId":3570159,"userName":"Miceldars","timestamp":1545159148,"content":"Yes v_v"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570261","commentId":3570261,"userName":"dalestephenson","timestamp":1545163767,"content":"There are a few Noldor lore heroes, but LoDenethor has a nice combination of reasonably low threat, respectable defense and scrying.  I don't suppose throwing in 3 copies of Elf-friend would fix your deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570329","commentId":3570329,"userName":"Miceldars","timestamp":1545166883,"content":"Yes, maybe. I took Denethor to have a good defender. I'll think to that tomorrow or thursday.\n\n \n\nSince all my victories are not valid, can I change my whole deck (including heroes ?) and start again ?\n\nEdited December 18, 2018 by Miceldars"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570402","commentId":3570402,"userName":"dalestephenson","timestamp":1545172326,"content":"You can change your whole deck and hero lineup if you want, since the rules misplay was relevant to the deck construction and choice of heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570756","commentId":3570756,"userName":"Miceldars","timestamp":1545220910,"content":"Thanks, I'll think to a new deck.\n\nQuestion : if you cancel the point of damage from Erkenbrand's ability (with honour guard, for example), does it still cancel the shadow effect ? Or is it like Treebeard, you can't benefit from the ability if the heroe isn't wounded ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3570766","commentId":3570766,"userName":"Calvadur","timestamp":1545222133,"content":"It is like treebeard: To cancel the shadow effect, Erkenbrand must take the damage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3571142","commentId":3571142,"userName":"Miceldars","timestamp":1545240598,"content":"Thanks.\n\nI changed my deck. Intruders in chetwood done with 1 token, but it was 2 with my other deck, so what is my score ? 1 or 2 ?\n\nEdited December 19, 2018 by Miceldars"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3571238","commentId":3571238,"userName":"dalestephenson","timestamp":1545244679,"content":"Your score is 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3572052","commentId":3572052,"userName":"Miceldars","timestamp":1545310872,"content":"Edit : added my deck list, but I can't see it when I open it in a private tab. Is there something I missed ?\n\nEdited December 20, 2018 by Miceldars"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3572118","commentId":3572118,"userName":"dalestephenson","timestamp":1545318156,"content":"I can see it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3572127","commentId":3572127,"userName":"dalestephenson","timestamp":1545318662,"content":"I ended up taking a token against Across the Ettenmoors -- I scooped the first time when (in the second turn) I failed to place progress on the starting Lie Low side-quest and engaged the two nasty giants in staging to go with the Trollspawn I'd already engaged.  The second time I managed to make it through, despite Eowyn getting nerfed by No Rest. I managed to keep my questing allies healthy with the help of Honour Guard.\n\nSo here's how we did against Across the Ettenmoors (outside cards in parens)\n\n0 PigsAreOurEquals (0)\n0 Velensk (26)\n0 Miceldars (26)\n1 dalestephenson (26)\n\nAnd the overall standings:\n\n0 PigsAreOurEquals (0)\n1 Miceldars (26)\n2 dalestephenson (26)\n3 Velensk (26)\n\nNo one has posted their Dread Realm score yet.  The final deadline is Dec 31st, so plenty of time to build a deck and join the league.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3572147","commentId":3572147,"userName":"dalestephenson","timestamp":1545319590,"content":"Since three of us have the same number of outside cards (26), I was curious how the tiebreakers would go if we ended with the same number of tokens.\n\n2nd tiebreaker -- number of heroes from LR/AA + TaEowyn.  Two for each of us.\n\n3rd tiebreaker -- number of heroes from list Halbarad, TaAragorn, Dori, Arwen, TaEowyn.  Two for each of us (I used Dori, they used TaAragorn, we all used TaEowyn).\n\n4th tiebreaker -- number of cards in deck outside LR/AA -- that's 31 for me, 37 for Velensk and 41 for Miceldars.  I only used five cards from the core set -- 2 feints and 3 Gandalfs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3573069","commentId":3573069,"userName":"Miceldars","timestamp":1545402888,"content":"Very bad luck this time on dread realm, 6 tokens and I still lose. I manage to go in phase 2 only once v_v"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3574084","commentId":3574084,"userName":"dalestephenson","timestamp":1545520050,"content":"I ended up taking 8 tokens.  I actually made it to stage three with one token, but too many locations were out and the damage killed my questing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3574263","commentId":3574263,"userName":"Miceldars","timestamp":1545553682,"content":"I find the dread realm very hard : it focus heavily on combat, espacially with this cursed dead who can come with his 4 cursed friends and just kill you in solo (it happend one time, Daechanar + 1 reanimated + 5 cursed dead v_v), but you need a high amount of willpower on the final turn (or many hit points on your characters) . In stage 3, all my heroes had 1 hit point, but there was only 1 location in staging, so with sword that was broken + faramir I had enough willpower."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3576798","commentId":3576798,"userName":"Authraw","timestamp":1545956983,"content":"I gave a couple of decks a go for this, but the only one I had any success with was pretty similar to the one built by @PigsAreOurEquals [https://community.fantasyflightgames.com/profile/261563-pigsareourequals/], so I think I'm going to pass on actually recording results for the December league.\n\nI had fun trying out different deckbuilds for this one, though. The fact that Amarthiul is ineligible cuts the number of ideal Leadership heroes down to just Halbarad, and I couldn't quite pull off a consistent Dunedain deck without turn 1 access to Heirs and Steward. I wish a few more of the Ents had been in this cycle, we're partway to a pretty good Ent deck here, but a few key pieces are missing (especially Treebeard).\n\nInteresting challenge! I look forward to seeing how next month goes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3576974","commentId":3576974,"userName":"PigsAreOurEquals","timestamp":1545991072,"content":"Last night I finally completed the Dread Realm. I completed it on the fourth attempt. For me this was the best challenge so far mainly due to the difficulty of The Dread Realm.\n\n@Authraw: Can you explain why Amarthuil is not allowed? I thought he was.\n\nThe two ents (Wellinghall preserver and Derndingle Warrior) proved a very solid defense in this challenge, but for an ent deck the crucial pieces like Entmoot are not in cycle.\n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3576998","commentId":3576998,"userName":"Miceldars","timestamp":1545997533,"content":"You have Amarthiul as an ally in Accros the Ettenmoor, so you can't use it for this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3577248","commentId":3577248,"userName":"Network57","timestamp":1546023778,"content":"> 7 hours ago, Miceldars said:\n> \n> You have Amarthiul as an ally in Accros the Ettenmoor, so you can't use it for this scenario.\n\nI think you mean the Objective Ally is Bamarthiul?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3577274","commentId":3577274,"userName":"PigsAreOurEquals","timestamp":1546026359,"content":"> 7 hours ago, Miceldars said:\n> \n> You have Amarthiul as an ally in Accros the Ettenmoor, so you can't use it for this scenario.\n\nAh I see, I thought I had overlooked a rule of the solo-league.  I admit that I always \"house-rule\" away any conflict between objective allies and player cards.\nSo count me as one of the Bamarthiul players.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3577674","commentId":3577674,"userName":"Miceldars","timestamp":1546075390,"content":"> 14 hours ago, Network57 said:\n> \n> I think you mean the Objective Ally is Bamarthiul?\n\n?\n\nSorry, I don't understand what you mean."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3577678","commentId":3577678,"userName":"PigsAreOurEquals","timestamp":1546075730,"content":"@Miceldars [https://community.fantasyflightgames.com/profile/318488-miceldars/] : It's a running joke that uniqueness conflicts can be avoided by drawing an extra B to change the name.\nLike Arwen and \"Barwen\" (some Dwarrowdelf quests have an objective Arwen ally), in this case Amerthiul and \"Bamarthiul\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3577679","commentId":3577679,"userName":"Miceldars","timestamp":1546076084,"content":"Ok, I see.\n\nI admit I usually don't take care about objective ally, I play arwen (or amarthiul) even in scenario where they are as an objective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3579462","commentId":3579462,"userName":"dalestephenson","timestamp":1546356124,"content":"Only four of us posted our results against the final quest, and it didn't go well for any of us (outside cards in parens)\n\n3 PigsAreOurEquals (0)\n3 Velensk (26)\n8 dalestephenson (26)\n8 Miceldars (26)\n\nAuthraw choose not to post his results, though they were undoubtedly better than mine.  Here's the final standings:\n\n3 PigsAreOurEquals (0)\n6 Velensk (26)\n9 Miceldars (26)\n10 dalestephenson (26)\n\nAfter taking no tokens in the first three leagues, Dori helped me to last place.  While Dori is better suited for multiple decks, I think I had a good hero lineup, but my deck was not well constructed for these quests, and I got far less of the luck that helped me through the first three leagues.\n\nPigsAreOurEquals gets to choose a cycle for February's league, Velensk gets to choose a quest to play from that cycle, and Miceldars gets to choose a quest not to play from that cycle.  I get to choose an additional cycle to count for player cards, in an effort to increase the possible diversity of decks.\n\nThank you for playing, and I hope to see more players in January."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3579869","commentId":3579869,"userName":"PigsAreOurEquals","timestamp":1546414866,"content":"I will pick the RingMaker cycle. I picked it up as a Christmass gift to myself and now I'm eager to play it. \n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3579894","commentId":3579894,"userName":"Miceldars","timestamp":1546420276,"content":"I realize we never beat The dunland trap with my girlfriend, because of the phase 2 where we lose all allies and attachments. I think I would exclude this one, but The three trials seams hard in solo play, with the three guardians... What do you suggest ? You probably know the quest better than me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3579990","commentId":3579990,"userName":"PigsAreOurEquals","timestamp":1546433452,"content":"For me one of the conclusions from the past league is that it is good to have 1 hard quest in the league which can act as tiebreaker. This is better than deciding the winner based on in-cycle cards and heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3579994","commentId":3579994,"userName":"Miceldars","timestamp":1546434530,"content":"I decided to exclude The three trials, because I think it is a bit more random as you randomly choose a guardian for each trial, and there is probably some combination better than others, and that could make some difference on how many token will be needed for each player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3580047","commentId":3580047,"userName":"dalestephenson","timestamp":1546441140,"content":"If Velensk chooses the three trials you'll need to choose a different quest to exclude, as his pick has priority.  But he may choose a different quest.\n\nI'll pick Lost Realm/Angmar Awakened for a supplemental player card cyle.  Ringmaker itself only supports Silvan as a full-fledged archtype, but adding in LR/AA will allow plenty of Ents or a Dunedain deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287109-solo-league-4-angmar-awakens-cycle/?do=findComment&comment=3580366","commentId":3580366,"userName":"dalestephenson","timestamp":1546462019,"content":"PAOE chose Ringmaker, Velensk has chosen Trouble in Tharbad, and Miceldars excluded Three Trials.\n\nSelecting the other two quests randomly, we have:\n\nThe Fords of Isen (Deluxe)\nTrouble in Tharbad (AP3)\nAntlered Crown (AP6)\n\nAs Grima is an objective ally in Fords of Isen, the possible choices for mandatory hero are TaEomer (VoI), Haldir (Tharbad), and Erkenbrand (Antlered Crown).\n\nI choose LostRealm/Angmar as a supplemental cycle for player cards, so there should be alternatives to a Silvan deck with Haldir.\n "}]}