{"url":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/","title":"Fine line for Dwarves and mining","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3566827","commentId":3566827,"userName":"player1683311","timestamp":1544780847,"content":"I had previously used some mining in my dwarf swarm deck, ered luin miner, hidden cache, ered nimbus prospector , ect. \n\nNow I'm really excited to make a true mining deck. Been so for some time. Every time I start doing so however, I find myself sliding into a dwarf swarm deck since that synergy is so strong with that trait.  \n\nI wish Ered Nimbus prospector and soldier of erebor were in tactics or spirit, since the new dain and thorin and dwarf pipe are in those spheres( as well as erebor guard ect). \n\nI think the problem is at this point there are only 2 cards that really benefit from being discarded, and a host that discard.  \n\nSo if you stay away from noldor, there isn't any special added benefit to discarding. And by putting in dwarves you begin to want to use the benefits they get when massing. I understand that stonehelm and new dain are good to slot in non mining decks. \n\nAnyway, I'll keep trying because I love the idea!\n\n Btw the new thrors ring is it's own archetype in my opinion, although it can easily slot into a mining deck. However I was think you'd want a lot of attachments to fetch rather than mining.  \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3566892","commentId":3566892,"userName":"dalestephenson","timestamp":1544789714,"content":"It's true that having only two cards that benefit from being discarded from your deck takes some of the fun out of mining.  Though with Dwarven Pipe and some sort of shuffle forcer you can plausibly discard Hidden Cache a bunch.  Unless you use dwarf heroes that benefit from swarming (Spirit Dain helps by blocking Leadership Dain), a mining deck doesn't have to be a dwarven swarm; though if you want a *dwarven* mining deck I don't know how you're going to avoid running a lot of dwarven allies -- they aren't typically strong individually."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3567172","commentId":3567172,"userName":"Bullroarer Took","timestamp":1544807520,"content":"I agree that if there were another card or two that would reward you for being discarded it would improve mining, but having played around with mining I am worried that it could go too far too easily.  (The fine line you are talking about.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3567180","commentId":3567180,"userName":"GrandSpleen","timestamp":1544808015,"content":"Agreed with Bullroarer, the effects of future cards that benefit from being discarded would need to be less powerful since you can now mine out your entire deck really fast and consistently.  Something like: if discarded, add this card to your hand.  Or if discarded, deal 1 damage to 1 enemy in play.  We probably should not see more free allies or free resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3567197","commentId":3567197,"userName":"Gizlivadi","timestamp":1544808757,"content":"I agree that mining dwarves are still a few cards away from being complete. The big one for me though that will be essential to that deck is Thorin Stonehelm, so it'll be a few years before I make a mining deck. And considering the fact we may not even see him outside a limited and ridiculously expensive product, I don't know if it'll happen."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3567841","commentId":3567841,"userName":"banania","timestamp":1544867672,"content":"The Ered Nimbus Prospector helps you fetching a Nimbus 2000 out of your discard pile so you can catch the Golden Snitch."},{"commentUrl":"https://community.fantasyflightgames.com/topic/287809-fine-line-for-dwarves-and-mining/?do=findComment&comment=3567870","commentId":3567870,"userName":"Amicus Draconis","timestamp":1544872706,"content":"While swallowing it."}]}