{"url":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/","title":"Solo League 5 -- Haradrim cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3579469","commentId":3579469,"userName":"dalestephenson","timestamp":1546357019,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Sands of Harad and the Haradrim cycle. The quests are:\n\n1) Escape from Umbar (Deluxe)\n2) Desert Crossing (Deluxe)\n3) Race across Harad (AP2)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests -- this means you must have at least one of Leadership Gimli, Spirit Legolas, or Thurindir. [Hero Gandalf doesn't count against tiebreakers for this league, but does not fulfill a mandatory hero requirement.]\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Race Across Harad and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Desert Crossing it does not matter how many tokens I needed to defeat Escape From Umbar.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker. You are required to reveal which Heroes you used, and how many cards in your deck came from outside SH/Haradrim cycle and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) We didn't need any tiebreakers last month, but previous months were won with zero tokens and needed lots of tiebreakers. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from SH/Haradrim or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from Sands of Harad and Haradrim, plus hero Gandalf. More is better.\n\n3rd) The number of heroes used from this list: Leadership Gimli, Spirit Legolas, Thurindir, Gandalf. More is better.\n\n4th) The number of cards in the deck outside Sands of Harad and Haradrim. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Sands of Harad and Race Across Harad. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in December's Solo League (if you didn't play or finish December's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for March's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in March's league. February's league will be choosen by PigsAreOurEquals, winner of the December league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline (New Year's Eve) really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nEscape from Umbar: January 14th\nDesert Crossing: January 21st\nRace Across Harad: January 28th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1e7ax4xjPTc-kXys9BD5c83bWzvclCH0HwZoH5kjwYNI/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1e7ax4xjPTc-kXys9BD5c83bWzvclCH0HwZoH5kjwYNI/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself.\n\nEdited January 1, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3579476","commentId":3579476,"userName":"Miceldars","timestamp":1546358740,"content":"I don't have harad cycle yet, so see you next month :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3579671","commentId":3579671,"userName":"Authraw","timestamp":1546379816,"content":"Sounds like a good recipe for a janky combo deck! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3579701","commentId":3579701,"userName":"dalestephenson","timestamp":1546384374,"content":"I made a Thurindir/SpLegolas/LeGimli deck with side-quest-loving allies.  It may not be a good fit for the selected quests, but it could be fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3579886","commentId":3579886,"userName":"PigsAreOurEquals","timestamp":1546418694,"content":"I also don't own the Haradrim cycle so I will quitly hone my deck for the February league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3580230","commentId":3580230,"userName":"Onidsen","timestamp":1546452040,"content":"I think that I'll jump into the league this month - we'll see what the time commitments look like, and I could use the extra excuse to record videos without blog posts backing them up.  I'll have to look over the rules to make sure I understand them correctly, but count me in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3580723","commentId":3580723,"userName":"Onidsen","timestamp":1546503444,"content":"Is this league solo only, or am I allowed to play two-handed?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3580739","commentId":3580739,"userName":"Miceldars","timestamp":1546506642,"content":"Pure solo, only one deck"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3582073","commentId":3582073,"userName":"gearhead","timestamp":1546637634,"content":"1st Time in the league!\n\nhttps://ringsdb.com/deck/view/135799 [https://ringsdb.com/deck/view/135799]\n\n1st quest completed \n\nScore=30 (35 Threat+5 Damage-10 VPs)\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3582101","commentId":3582101,"userName":"dalestephenson","timestamp":1546639119,"content":"Congrats on escaping from Umbar.  I think you need to enable sharing of your private decks for the link to work, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3582176","commentId":3582176,"userName":"gearhead","timestamp":1546644158,"content":"Oops. I went to Rings DB and fixed it. Let me know if it works..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3582344","commentId":3582344,"userName":"dalestephenson","timestamp":1546663829,"content":"Yes, I can see your deck now.  Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3589019","commentId":3589019,"userName":"Authraw","timestamp":1547259406,"content":"My results are in! Total of 4 tokens, one from Desert Crossing and 3 from Race Across Harad.\n\nI put a few details in my deck's description here:\n\nhttps://ringsdb.com/decklist/view/10822/january-solo-league-1.0 [https://ringsdb.com/decklist/view/10822/january-solo-league-1.0]\n\nI kept forgetting to take advantage of my Grace of the Valar tokens until my last run at Race Across Harad. I'm kicking myself a bit; I wonder if I could have done better if I had remembered to use them? In any case, Race Across Harad is one tough quest, so I still feel pretty good with 3 tokens from it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3592368","commentId":3592368,"userName":"dalestephenson","timestamp":1547570120,"content":"Standings after the first quest (outside cards in parens):\n\n0 Authraw (0)\n0 dalestephenson (27)\n0 Dennis FitzPatrik (36)\n3 Velensk (27)\n\nVelensk had bad luck and I had good luck, but I don't think anyone is out of the running at this point -- Authraw finished his quests with 4 tokens, so none of us have been eliminated yet.\n\nAll four decks use SpLegolas/LeGimli, but each is paired with a different hero -- Authraw used Gandalf, Velensk used LeAragorn (three hunters), Dennis used LeDain, and I used Thurindir.\n\nThere's plenty of time left to sign up and play through the quests if you have Sands of Harad and Race Across Harad.  Sands of Harad just got reprinted and should be in stores very soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3592505","commentId":3592505,"userName":"Yepesnopes","timestamp":1547577765,"content":"I already missed last league and I am going to miss this one too. I am having a super busy period. I hope to be able to rejoin during the next league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3600280","commentId":3600280,"userName":"dalestephenson","timestamp":1548187041,"content":"Dennis FitzPatrick hasn't posted results for the second quest yet, so here's how we did (outside cards in parens):\n\n0 Velensk (27)\n1 Authraw (0)\n1 dalestephenson (17)\n\nThe first time two obnoxious side quests plus two Were-Worms did me in.  Second time went smoothly, except for being in the 50s in temperature at the end of the quest.\n\nStandings through two quests:\n\n1 Authraw (0)\n1 dalestephenson (17)\n3 Velensk (27)\n\nIt's not too late to create a deck and join the competition.  Any zero-token run will catapult you into first place."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3606925","commentId":3606925,"userName":"dalestephenson","timestamp":1548769680,"content":"It wasn't quite as brutal as Dread Realm last month, but no one made it through Race Across Harad unscatched (outside cards in parens):\n\n1 Velensk (27)\n1 Dennis FitzPatrick (36)\n3 Authraw (0)\n3 dalestephenson (17)\n\nThe first three tries all ended the same way for me -- shadow effect causing the chieftain to take out LeGimli. Guess my deck needed Hasty Stroke more than all those useless side quests.\n\nSince Rouxxor left the league, we haven't had a zero token winner. Perhaps not a coincidence.\n\nHere's the final standings:\n\n2 Dennis Fitzpatrick (36)\n4 Authraw (0)\n4 dalestephenson (17)\n4 Velensk (27)\n\nGearhead's choice to use the most out-of-cycle cards paid off, as he finished with less tokens. The rest of us just split on tiebreakers. Dennis gets to choose the cycle for March, after which Authraw can pick a quest to play, I can pick a quest not to play, and Velensk can pick a cycle to supplement the player cards.\n\nNext month is Ringmaker, using the deluxe box (for Fords of Isen), Trouble in Tharbad, and Antlered Crown. You must use at least one of the heroes TaEomer, Haldir, or Erkenbrand. Cards from Lost Realm/Angmar are considered the same as Ringmaker cards for tiebreak purposes. Now I need to decide what to play -- I could run my Stereotypical Silvan Deck (has Haldir) or more Stereotypical Rohan Deck (has Eomer). Or I could try to sub someone into one of my Ent decks, as they are concentrated in the two cycles. Or I could make a new deck -- I'm thinking a Haldir/Boffin/TaEowyn ent/strider deck could be fun, especially in Tharbad. Or a Erkenbrand/Haldir/TaEomer Silvan deck would actually be pretty strong, Elvenking/Galion could buff TaEomer every turn. Put Elf-friend on Erkenbrand and let the Silvan Tracker take care of him. Decisions, decisions....\n\nThanks for playing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614205","commentId":3614205,"userName":"dalestephenson","timestamp":1549390601,"content":"Dennis has decided to go back to Lost Realm and Angmar Awakens for March's cycle.  Over to Authraw to pick a quest from that cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614486","commentId":3614486,"userName":"Authraw","timestamp":1549400906,"content":"Has to be Escape from Mount Gram! That's sure to be a weird one when you can't custom-build for it, right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614505","commentId":3614505,"userName":"dalestephenson","timestamp":1549402150,"content":"It will certainly complicate things.  I'm tempted to exclude Carn Dum since it's so brutal, but I think I'll exclude one of the three Amarthiul quests to reduce the chances of a conflict.  I'll pick Across the Ettenmoors since that's the one we played last time (though Wastes of Eriador is the most annoying).  So random picks for the other two quests:\n\nThe Weather Hills (Deluxe)\n\nCarn Dum (of course...)\n\nDecks must include at least one of TaAragorn, Halbarad, Rossiel, and Amarthiul.\n\nVelensk gets to choose another cycle to pull from for player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614727","commentId":3614727,"userName":"Authraw","timestamp":1549414979,"content":"Hahaha Mount Gram *and* Carn Dum!? 🤣😂😭\n\nEdited February 6, 2019 by Authraw"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614867","commentId":3614867,"userName":"Miceldars","timestamp":1549435465,"content":"Since I never win against Carn Dum in easy mode, I don't know if I'll participate in march"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3614979","commentId":3614979,"userName":"dalestephenson","timestamp":1549452882,"content":"This is your chance to beat it -- with enough help from the Grace of the Valar tokens, you should be able to finally crush that miserable quest.\n\nI suggest not starting at 0 tokens and increasing by 1 token each time.  Start with 8 tokens and add another 8 tokens each time until you win, then you will be able to get to your final token count within three plays (-4, +/-2, +/-1)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3615126","commentId":3615126,"userName":"dalestephenson","timestamp":1549465169,"content":"Velensk has chosen to add the LOTR saga to the card pool for March's league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3616096","commentId":3616096,"userName":"Miceldars","timestamp":1549521973,"content":"The whole saga ? The 6 box ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/288564-solo-league-5-haradrim-cycle/?do=findComment&comment=3616202","commentId":3616202,"userName":"dalestephenson","timestamp":1549539703,"content":"All six boxes from the LOTR saga will count against tiebreakers as if they were Lost Realm/Angmar Awakens cards."}]}