{"url":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/","title":"An Open Letter to FFG About the LotR LCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588089","commentId":3588089,"userName":"kdlittle88","timestamp":1547177313,"content":"Hello FFG,\n\nI'd like to talk to you about the Lord of the Rings LCG.  There seems to be on many boards and groups a growing demand for this game, either to be reprinted or a new version.  As players of this excellent game, I believe there are many fans and collectors who have fistfuls of money just waiting to be thrown at you for the game, be it reprints or otherwise.  While I don't know actual sales numbers, I have had the chance to speak with a former FFG employee who have stated that this game does quite well financially for its age.  There is a reason the game always sells out when reprints are made!\n\nI'd like to petition that you would bring back this game to be reprinted so that we can purchase it.  For any players reading this and looking for content, let's get as many votes here as we can with the intention to show FFG that there still is a strong fan base willing to spend money on the LotR LCG.\n\nThanks and hopefully you read this well.\n\nKL\n\nEdited January 11, 2019 by kdlittle88\nTypo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588152","commentId":3588152,"userName":"Freeman","timestamp":1547187272,"content":"FFG has stated in numerous occasions that they do not read these boards, let alone monitor the number of votes a post receives. I applaud your idea, but the best way to reach to them with your request is via the official contact button on the page. Cheers! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588240","commentId":3588240,"userName":"lleimmoen","timestamp":1547201773,"content":"Just a little thing, it’s not “for it’s age” but “for its age.” You can see it everywhere around the net but it is wrong, so do not bother reaching for the apostrophe when you don’t need it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588243","commentId":3588243,"userName":"lleimmoen","timestamp":1547201897,"content":"To the point, I have had a long run with the game, and I would like to see more still, so I welcome any initiative like this. Well done!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588369","commentId":3588369,"userName":"icabod","timestamp":1547219185,"content":"> Quote\n> \n> I'd like to petition that you would bring back this game to be reprinted so that we can purchase it\n\nUhm... while it's true that when old expansions and adventure packs are reprinted they quickly go out of stock, the actual base game was reprinted fairly recently in two formats - the standard base game (in a new smaller box, which seems to be available in most places I look), and the \"Limited Collectors Edition\", which is still available on the FFG website, if you have the money.\n\nSo perhaps a nudge is needed for FFG to speed up the rotation of what gets reprinted, or when it does to perhaps print a few more than they currently do."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588374","commentId":3588374,"userName":"Gizlivadi","timestamp":1547219322,"content":"True and honest words sadly fallen on deaf ears."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588614","commentId":3588614,"userName":"alcuin18","timestamp":1547235500,"content":"Since they are reprinting the core set fairly regularly and have the collector's box and the saga expansions get reprinted on occasion I'm wondering if the Ered Mithrin cycle is kind of a mini-reboot of the game. We have new versions of heroes we can't get from older packs anymore like Bilbo and Dain and many things from the Hobbit like artifacts and characters. Plus, you have to use the core set encounter cards in some of the quests. Just a thought. I would like to have Elrond though from Shadow and Flame so I'm on board with reprints."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588917","commentId":3588917,"userName":"kdlittle88","timestamp":1547249046,"content":"> 17 hours ago, Freeman said:\n> \n>  \n\nYep I know the difference... muscle memory is all.  Typo.\n\n \n\nWrong post.\n\nEdited January 11, 2019 by kdlittle88"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3588921","commentId":3588921,"userName":"kdlittle88","timestamp":1547249107,"content":"> 13 hours ago, lleimmoen said:\n> \n> Just a little thing, it’s not “for it’s age” but “for its age.” You can see it everywhere around the net but it is wrong, so do not bother reaching for the apostrophe when you don’t need it.\n\nYep I know the difference... muscle memory is all.  Typo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3591808","commentId":3591808,"userName":"Vince79","timestamp":1547523393,"content":"I  just recently discovered this game last year and I absolutely love it.  Unfortunately, I'm afraid I got into it too late to ever be able to collect all the expansions.  I'm only missing The Lost Realm from the Deluxe Expansions, I'm missing half the Saga Expansions, and about half of all the adventure packs.\n\nI'm really hoping FFG will end up reprinting them all at some point, but I'm not sure if it's likely.  :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png]\n\nThey just reprinted Sands of Harad, but unfortunately I have that one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289004-an-open-letter-to-ffg-about-the-lotr-lcg/?do=findComment&comment=3592253","commentId":3592253,"userName":"TheGuardian118","timestamp":1547565025,"content":"Lost Realm is still available at retail, at least in the US. My local store had 3 copies this past weekend when I was there. Amazon might not have it stock, but if you call around to local stores they might have it. If you're not US then you might be out of luck.\n\n \n\n "}]}