{"url":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/","title":"Journeys in Middle Earth board game announced!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588531","commentId":3588531,"userName":"anfallon","timestamp":1547231123,"content":"https://www.fantasyflightgames.com/en/news/2019/1/11/the-lord-of-the-rings-journeys-in-middle-earth/ [https://www.fantasyflightgames.com/en/news/2019/1/11/the-lord-of-the-rings-journeys-in-middle-earth/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588555","commentId":3588555,"userName":"Wandalf the Gizzard","timestamp":1547232534,"content":"I'm bouncing off the walls in excitement for this game, but I hope this isn't going to affect the LCG for the worse.\n\nIt's a tad strange that they use art from the LCG in their game, but I'm a fan. I'll be a great feeling seeing your same old heroes on the table in a different game.\n\nThere seems to be a thematic disconnect what with the fact that the hero you use might not correspond with your role miniature. Hopefully they have minis for each role for each race."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588562","commentId":3588562,"userName":"lleimmoen","timestamp":1547233171,"content":"So what do you think the other four heroes are? Looks like two Dúnedain and two Elves... perhaps Aragorn, ffg, Legolas, ffg..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588591","commentId":3588591,"userName":"Amicus Draconis","timestamp":1547234483,"content":"Must be fake, all cards save for Bilbo have the wrong title 😂\n\nActually I find it interesting that I can name a card just by looking at the illustration. Hmm, I just have to remember, what the actual card text is."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588593","commentId":3588593,"userName":"Tyrion Gru","timestamp":1547234518,"content":"> 29 minutes ago, Wandalf the Gizzard said:\n> \n> I'm bouncing off the walls in excitement for this game, but I hope this isn't going to affect the LCG for the worse.\n\nOr perhaps vice-versa. As someone waiting patiently for more than a year for several Dwarrowdelf APs, I'm really cool on jumping in on another FFG LotR product. Let's see some action in supporting (re-printing) their other titles before blindly jumping in on another. Seems more like a money-grab to me.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588599","commentId":3588599,"userName":"Gizlivadi","timestamp":1547234704,"content":"Yeah, this actually looks like a way of avoiding the reprint problem by distracting the playerbase into another game. That way they don't have to reprint all those cycles because there will be less demand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588603","commentId":3588603,"userName":"Kakita Shiro","timestamp":1547234964,"content":"Isn't this wildly off-topic?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588625","commentId":3588625,"userName":"Gandalf_","timestamp":1547235880,"content":"The moment I saw the disgusting logo from the digital game I knew something is wrong. Then I saw that it works with a companion app. Solid no. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588633","commentId":3588633,"userName":"anfallon","timestamp":1547235978,"content":"I posted this here because it seems relevant to the reprinting delays as well as the direction and future of the game akin to the new digital product (which is struggling for traction). In both cases, assets are being re-used and clear parallels exist between the games. It also speaks to FFG's approach to managing product lines for IPs (similar to the direction of Star Wars). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588648","commentId":3588648,"userName":"fbnaulin","timestamp":1547236301,"content":"It looks attractive to me. I love boardgames with maps, exploration and narrative.\n\nBut I'll wait for more details about mechanics (and app) and honest reviews before jumping on it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588706","commentId":3588706,"userName":"Thaeggan","timestamp":1547238331,"content":"> 32 minutes ago, fbnaulin said:\n> \n> It looks attractive to me. I love boardgames with maps, exploration and narrative.\n> \n> But I'll wait for more details about mechanics (and app) and honest reviews before jumping on it.\n\nThe more detailed world map and the separated and very basic battle tiles makes me scratch my head.\n\n \n\nThe game looks like it wants to be Massive Darkness but tries really hard not to at the same time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588734","commentId":3588734,"userName":"dalestephenson","timestamp":1547239332,"content":"> 57 minutes ago, Gizlivadi said:\n> \n> Yeah, this actually looks like a way of avoiding the reprint problem by distracting the playerbase into another game. That way they don't have to reprint all those cycles because there will be less demand.\n\nI can picture two executives FFG speaking, Ted Sandyman Jr and Ted Sandyman Sr.\n\nTed Jr: We have a \"reprint problem\" with LOTR LCG.\n\nTed Sr: What's the problem?\n\nTed Jr: Practically everything for the game is unavailable.  New players can't buy stuff we published before.\n\nTed Sr: So we need to reprint expansions that are out of stock?\n\nTed Jr:  No good.  We've tried that, our customers snap it up in a few weeks, and then it's gone again.\n\nTed Sr: Hmm, that is a problem.  Last thing we want to do is print anything that will get bought up quickly.  What should we do?\n\nTed Jr: Obviously the best thing to do is reduce demand for our product.\n\nTed Sr: Good thinking.  But isn't having everything unavailable doing that by itself?\n\nTed Jr: It's just not fast enough.  Obviously the best thing to do is to produce a mechanically unrelated game on the same subject.  That'll distract them.  They'll be so in love with the new game that they'll forget they were begging to buy things we've already developed and require little or no change to reprint.\n\nTed Sr: That makes perfect sense.  I remember the big drop in demand for the LCG when we released the new digital LOTR game.\n\nTed Jr: Exactly.  And we'll make sure to print the game somewhere that dumps their raw waste in the river, because the only thing better than not selling people what they want is creating a toxic desert at the same time.\n\nTed Sr: I like the way you think!  While we're at it, be sure to neglect the \"Upcoming Status\" page so that when we do reprint something, no one hears about it until it's practically in stores.\n\nTed Jr: Already on it, Dad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588881","commentId":3588881,"userName":"Tyrion Gru","timestamp":1547246302,"content":"> 1 hour ago, dalestephenson said:\n> \n> I can picture two executives FFG speaking, Ted Sandyman Jr and Ted Sandyman Sr.\n> \n> Ted Jr: We have a \"reprint problem\" with LOTR LCG.\n> \n> Ted Sr: What's the problem?\n> \n> Ted Jr: Practically everything for the game is unavailable.  New players can't buy stuff we published before.\n> \n> Ted Sr: So we need to reprint expansions that are out of stock?\n> \n> Ted Jr:  No good.  We've tried that, our customers snap it up in a few weeks, and then it's gone again.\n> \n> Ted Sr: Hmm, that is a problem.  Last thing we want to do is print anything that will get bought up quickly.  What should we do?\n> \n> Ted Jr: Obviously the best thing to do is reduce demand for our product.\n> \n> Ted Sr: Good thinking.  But isn't having everything unavailable doing that by itself?\n> \n> Ted Jr: It's just not fast enough.  Obviously the best thing to do is to produce a mechanically unrelated game on the same subject.  That'll distract them.  They'll be so in love with the new game that they'll forget they were begging to buy things we've already developed and require little or no change to reprint.\n> \n> Ted Sr: That makes perfect sense.  I remember the big drop in demand for the LCG when we released the new digital LOTR game.\n> \n> Ted Jr: Exactly.  And we'll make sure to print the game somewhere that dumps their raw waste in the river, because the only thing better than not selling people what they want is creating a toxic desert at the same time.\n> \n> Ted Sr: I like the way you think!  While we're at it, be sure to neglect the \"Upcoming Status\" page so that when we do reprint something, no one hears about it until it's practically in stores.\n> \n> Ted Jr: Already on it, Dad.\n\nBrilliant, dalestephenson. Exactly hits the mark.\n\nI love your decks on RingsDB, by the way, and am curious if other heavyweights (Seastan, et. al.) would like to opine on this subject.\n\nClearly, there are numerous new and seasoned players of this game that are lusting for product that FFG seemingly refuses to reprint.  The desire of these players is real, and it's ridiculous that dedicated gamers/customers are left to wait in ignorant anticipation for updates on a horribly unreliable \"Update\" page. And to then to introduce challenging decks on this site consisting of cards that are unattainable just inflames the frustration.  To follow up with new product based on the original is simply unacceptable.\n\nI've been a Tolkien card gamer for many years  (own and play MECCG since 1995) and am in love with FFG's addition to the genre.  To have desirable product unavailable while seeing new, similar product introduced just chaffs my...\n\nI'd love to see an honest, frank response from this company on their future plans for this game, and whether or not they can/will satisfy their current loyal customers. Until that time, I cannot comfortably support a new product (which I would normally purchase instantly).\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3588886","commentId":3588886,"userName":"player1683311","timestamp":1547246711,"content":"Some thoughts. \n\nIn our tabletop hobby everything is about new games. We are in a culture of gaming where most buy a game and maybe play it once before moving on.  That more than anything will drive a new product over reprinting an old product. \n\nMany FFG games reuse art, like all the Arkham products. It makes sense.\n\nI have noticed other FFG lines have complaints of low stock although our game is definitely worse off than others. \n\nI for one am excited about the game, at least to check out the reviews when they roll in and hope they are positive! \n\nAlthough not in every game I do think the app is pretty cool very helpful for smoother gameplay and coop is good for solo play. \n\nI can totally understand why frustration over the reprint schedule could taint feelings about a new game with the same theme.\n\n \n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590392","commentId":3590392,"userName":"dizpatcher","timestamp":1547431604,"content":"> On 1/11/2019 at 12:42 PM, dalestephenson said:\n> \n> I can picture two executives FFG speaking, Ted Sandyman Jr and Ted Sandyman Sr.\n> \n> Ted Jr: We have a \"reprint problem\" with LOTR LCG.\n> \n> Ted Sr: What's the problem?\n> \n> Ted Jr: Practically everything for the game is unavailable.  New players can't buy stuff we published before.\n> \n> Ted Sr: So we need to reprint expansions that are out of stock?\n> \n> Ted Jr:  No good.  We've tried that, our customers snap it up in a few weeks, and then it's gone again.\n> \n> Ted Sr: Hmm, that is a problem.  Last thing we want to do is print anything that will get bought up quickly.  What should we do?\n> \n> Ted Jr: Obviously the best thing to do is reduce demand for our product.\n> \n> Ted Sr: Good thinking.  But isn't having everything unavailable doing that by itself?\n> \n> Ted Jr: It's just not fast enough.  Obviously the best thing to do is to produce a mechanically unrelated game on the same subject.  That'll distract them.  They'll be so in love with the new game that they'll forget they were begging to buy things we've already developed and require little or no change to reprint.\n> \n> Ted Sr: That makes perfect sense.  I remember the big drop in demand for the LCG when we released the new digital LOTR game.\n> \n> Ted Jr: Exactly.  And we'll make sure to print the game somewhere that dumps their raw waste in the river, because the only thing better than not selling people what they want is creating a toxic desert at the same time.\n> \n> Ted Sr: I like the way you think!  While we're at it, be sure to neglect the \"Upcoming Status\" page so that when we do reprint something, no one hears about it until it's practically in stores.\n> \n> Ted Jr: Already on it, Dad.\n\nI think this is pretty spot on .  And pretty darn funny too.  \n\nI'm not sold on the new game yet.  That $100.00 price tag had my wife wondering if I was choking on something.\n\nI have, except for some promotional stuff since I can't get to the \"Con's\", everything LotR LCG that has been released.  I worry this could be the beginning of the end for LotR LCG. (I don't need anyone going off on me for my thoughts so save any bashing you may want to do for someone more pessimistic).  I feel for all the folks that want to obtain the older products - but you do have to wonder when some items have been at the printer for like a year and a half. \n\nOn the flip side a huge number of items are now on the boat that were not last week.  A lot of stuff that was probably harder(?) to reprint than other items. Also,a lot of FFG's time has been spent on new product recently that perhaps slows down the reprint process  in some way I'm not able to fathom. Not sure about that but its a thought. Hopefully its catch-up time for all the LotR reprints.  I have my fingers crossed for all the people that wish to pick up the older material. (And for me to continue with the game). There is some great stuff in the older releases.   Regardless of how this reads I'm thinking positive thoughts for the reprint of the older material. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590605","commentId":3590605,"userName":"Hannibal_pjv","timestamp":1547472382,"content":"Lotr Lcg is just fine! There Are so Many areas that Are not cowered yet!\n\nthis may hit Mansion of madnes and descent more than Lcg..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590623","commentId":3590623,"userName":"dalestephenson","timestamp":1547474125,"content":"In all seriousness, my conversation was meant to be humorous.  It really would take Sandyman-level stupidity to intentionally lower demand for your own purpose, or stop reprinting things because they sell out quickly.  If anything, I think the executives would hope for *synergy* between the separate products, each stimulating demand for the other.  The re-use of artwork is most likely due to the fact that it has already been bought and paid for by FFG.\n\nI doubt there's any dark strategy behind the neglect of the upcoming status page, though it does hint at a lack of resources at Asmodee/FFG.  Sands of Harad isn't the only product to skip over \"At the Printer\" and show up as \"On the Boat\" for just a week, I think nearly all its boatmates had a similar path; if that were supposed to be a tell-tale of planned retirement, they're planning on retiring all their LCGs and a whole lot of other stuff.\n\nQuick sellouts of reprints also isn't necessarily a bad thing, from a company's point of view.  It's a much better outcome (for them) then printing so much that they have maintain the stock for many months.  Getting the quickest possible return for capital makes it better to guess low than high.  A culture of scarcity also impels customers to buy quickly when it come out, and having few expansions available that sell quickly makes carrying all available product more attractive to a retailer with limited shelf space than having all expansions available that sell slowly.  However, I think the scarcity, and more importantly the slow pace of release, is discouraging new customers.  If old content was trickling out every month, a new customer could be assured that it would be possible to fill the whole collection with time and patience -- without publicity or predictability, the evergreen \"Game is Dying\" meme gets legs.\n\nThe limited scale of reprints also presents two clear dangers to profitability.  Since it is small it doesn't have the same economies of scale as larger runs, so FFG could reasonably prioritize a guaranteed small profit behind a possible large profit from trying to print the New Hotness (e.g. KeyForge).  And since the profit is based on overseas manufacturer, it's liable to be undercut by increasing manufacturing costs, increased transportation costs, currency fluctuations, or even good old-fashioned trade wars.  An AP reprint could shift from profitable to unprofitable with no change in customer demand, due to forces beyond the control of FFG.\n\nStill, I'm optimistic about the future.  Until the designers run out of ideas or they lose the license, I see no particular reason for development to come to an end.  As a cooperative deckbuilder there is no meta to manage or critical mass of competitive players needed to maintain the game, individuals can discover and enjoy the game without needed *any* local scene at all.  I don't think it's the sort of game you can have the player base \"move on\" by replacing something newer and shinier, because unless the new thing is backwards compatible with existing content it can't possibly compete on merits with the existing base.  I'm looking forward to more cycles and more content; I am not sated yet, though the content already released is sufficient to keep me busy for the rest of my natural life.\n\nEdited January 14, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590735","commentId":3590735,"userName":"lleimmoen","timestamp":1547479479,"content":"Nice one, above."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590749","commentId":3590749,"userName":"lleimmoen","timestamp":1547479931,"content":"I really hope we get a few more cycles yet, would like to see more on Beornings, Eagles, even Rohan and Gondor, and of course everything. It is interesting to note how far apart in power some of the factions seem, at least in my experience, and even those that have been developing from the start. And then actually, Dale sprints ahead within a few releases, whilst I really cannot make a strong Rohan deck even though they have been getting cards since Mirkwood (and I have several decks that are super strong in comparison). I stop the rant now... I just want to see more though I agree with the above, we have got a lot already..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3590804","commentId":3590804,"userName":"Gizlivadi","timestamp":1547481130,"content":"Yeah, I immediately saw the irony in dalestephenson's post. No, I don't actually believe this is a master plan to distract people into other games, and I did write that post as a provocation more than anything else- which worked. I mean, I am way too far gone into this game and have followed FFG for years to really believe that. Now, this may be a bit off topic but I did ask Caleb about the reprint problem and in general about the state of the game. He replied the same day, and given the vagueness of the answer I assume he tried to write as subjective an answer as possible in order to be safe if I want to make it public. So, assuming Caleb assumed I would post this, here's his answer regarding the reprint problem (granted he's just the designer and not in charge of stock):\n\n\"Hi Esteban,\n\nThere are reprints in the release schedule for 2019. I don’t know when they will be available, but they are coming.\n\nThat is all I know.\n\nCheers,\n\nCaleb\"\n\nTake that for what it's worth."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3591313","commentId":3591313,"userName":"BillK62","timestamp":1547499954,"content":"> 4 hours ago, Gizlivadi said:\n> \n> \"There are reprints in the release schedule for 2019. I don’t know when they will be available, but they are coming.\n> \n> That is all I know.\n> \n> Cheers,\n> \n> Caleb\"\n\nThank you for posting that: I see it as excellence news regarding the LotR:tCG reprint issue!\n\nI wish FFG would simply issue a statement like this from time to time for product lines they are planning on reprinting. For players to invest in an LCG with lots of out-of-print titles, statements like this could give new players the confidence they need to try it out.\n\n(And as long as I'm offering free advice to FFG, I wish they would put a little more thought into their LotR game titles: we have \"Lord of the Rings: the Card Game\"  [which is also a \"Living Card Game\"] and before that there was the \"Lord of the Rings Trading Card Game\" [by Decipher] and now there's FFG's \"Lord of the Rings: Living Card Game\" [the on-line version]. Trying to search online with such similarly named products is maddening.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592228","commentId":3592228,"userName":"sappidus","timestamp":1547564001,"content":"> 17 hours ago, BillK62 said:\n> \n> (And as long as I'm offering free advice to FFG, I wish they would put a little more thought into their LotR game titles: we have \"Lord of the Rings: the Card Game\"  [which is also a \"Living Card Game\"] and before that there was the \"Lord of the Rings Trading Card Game\" [by Decipher] and now there's FFG's \"Lord of the Rings: Living Card Game\" [the on-line version]. Trying to search online with such similarly named products is maddening.)\n\nDon't worry: the next card game they make in Middle-earth will be called RingForge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592250","commentId":3592250,"userName":"Gordeaux789","timestamp":1547565003,"content":"good to hear there are reprints in the pipeline for this year. Was starting to worry I got into this thing too late. Maybe I did, but at least I'll be able to snap up some more cards for this great game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592774","commentId":3592774,"userName":"Seastan","timestamp":1547593434,"content":"> On 1/11/2019 at 2:38 PM, Tyrion Gru said:\n> \n> I love your decks on RingsDB, by the way, and am curious if other heavyweights (Seastan, et. al.) would like to opine on this subject.\n\nMy opinion is that they should just offer all their older products through their PoD store, with a markup that covers the increased cost of printing them in-house. This would give players an option to pay a premium to get out-of-stock products between reprints. FFG gets money, and players get their cards. It's a win-win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592775","commentId":3592775,"userName":"Seastan","timestamp":1547593504,"content":"As for Journeys in Middle-earth, I pre-ordered! I am beyond excited to play this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592801","commentId":3592801,"userName":"Kjeld","timestamp":1547595269,"content":"As much fun as this looks, I'm also intrigued by the 3'x3' game mat [https://www.fantasyflightgames.com/en/the-lord-of-the-rings-journeys-in-middle-earth/products/middle-earth-gamemat/] they're now selling with it. I would actually be happy to use this for the LCG, too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592836","commentId":3592836,"userName":"BillK62","timestamp":1547597792,"content":"> On ‎1‎/‎14‎/‎2019 at 10:52 AM, Gizlivadi said:\n> \n> \"Hi Esteban,\n> \n> There are reprints in the release schedule for 2019. I don’t know when they will be available, but they are coming.\n> \n> That is all I know.\n> \n> Cheers,\n> \n> Caleb\"\n\nAccording to a recent tweet by FFG (that I read about on BGG), some reprints should be available around Valentine's Day:\n\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592837","commentId":3592837,"userName":"player1683311","timestamp":1547597830,"content":"> 40 minutes ago, Kjeld said:\n> \n> As much fun as this looks, I'm also intrigued by the 3'x3' game mat [https://www.fantasyflightgames.com/en/the-lord-of-the-rings-journeys-in-middle-earth/products/middle-earth-gamemat/] they're now selling with it. I would actually be happy to use this for the LCG, too!\n\nThe only trouble with this, is that they made a similar style of the game mat as this, which I purchased. To me, as a personal preference, I found the cards Blended too much with the background. I prefer a more severe color contrast for ease of play"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3592916","commentId":3592916,"userName":"Wandalf the Gizzard","timestamp":1547601576,"content":"> 1 hour ago, BillK62 said:\n> \n> According to a recent tweet by FFG (that I read about on BGG), some reprints should be available around Valentine's Day:\n> \n> \n> \n>  \n\nLol! I hope no one gets fired! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598249","commentId":3598249,"userName":"Vince79","timestamp":1548021537,"content":"Anyone hear of a release date for Journeys in Middle Earth?\n\nAnd I second everyone who said they would rather have reprints of the LCG, I would really like to complete my collection.  It's like \"Take my money, please\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598550","commentId":3598550,"userName":"player1683311","timestamp":1548050162,"content":"I think it said Q2, so April, May, or June. FFG rarely gets more specific than that"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598554","commentId":3598554,"userName":"player1683311","timestamp":1548050705,"content":"It is the top game on the hotness on BGG, so I'm sure FFG will make some great sales and I'm sure it will make a lot of fans happy (including me hopefully!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598559","commentId":3598559,"userName":"Vince79","timestamp":1548051746,"content":"> On 1/15/2019 at 6:34 PM, Kjeld said:\n> \n> As much fun as this looks, I'm also intrigued by the 3'x3' game mat [https://www.fantasyflightgames.com/en/the-lord-of-the-rings-journeys-in-middle-earth/products/middle-earth-gamemat/] they're now selling with it. I would actually be happy to use this for the LCG, too!\n\nA 3'x 3' mat is pretty large.  That suggests you would need a pretty good sized table to play this game.  \n\nBut the bonus playmats they were giving away with the preorders (and they just sold out of those playmats I see) are only 13\" x 6\".  I wonder how much space you really need to play this?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598783","commentId":3598783,"userName":"Ywingscum","timestamp":1548082469,"content":"The bonus playmat is for your hero card and his deck.  The tiles make up the game board.  I’m guessing a minimum of 3’ by 3’ to play it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598851","commentId":3598851,"userName":"Edheliad","timestamp":1548087401,"content":"Why would anyone trust them to deliver given the state of their other LotR games?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3598996","commentId":3598996,"userName":"Hannibal_pjv","timestamp":1548096719,"content":"??? What do you mean?\n\nThe other LOTR games are doing just fine I suppose?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3599267","commentId":3599267,"userName":"Wandalf the Gizzard","timestamp":1548110164,"content":"> 3 hours ago, Hannibal_pjv said:\n> \n> ??? What do you mean?\n> \n> The other LOTR games are doing just fine I suppose?\n> \n>  \n\nI believe @Edheliad [https://community.fantasyflightgames.com/profile/265930-edheliad/] is referencing the abhorrent reprint rates for the LCG, along with Asmodee's apparent lack of care or interest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3599948","commentId":3599948,"userName":"Hannibal_pjv","timestamp":1548174894,"content":"Ou... has it been so bad? The list waiting for reprint seems to be quite good for Lotr Lcg by looking the uppcoming list. And there Are so much still in Lotr Lcg, that it is almost impossible to keep everything available all time. It would eat huge amounth of storage space...\n\ni am quite positive that Lotr Lcg will get new expansions even in future and reprints from time to time, but there will newer ever again be situation when everything is available at the same time. Two or three products/sycles at most."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3600147","commentId":3600147,"userName":"Gizlivadi","timestamp":1548182036,"content":"@Hannibal_pjv [https://community.fantasyflightgames.com/profile/170153-hannibal_pjv/] are you paid by FFG by any chance?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3600216","commentId":3600216,"userName":"Hannibal_pjv","timestamp":1548184440,"content":"Heh! I would hope that I would be 🤣\n\ni am just an optimistic Person I think. Most likely FFG personnel put their kids to good school by using the my money that I have thrown to them. 😂\n\ni have almost all Lotr Lcg products and there Are huge amounth on it. When I go to Local Gaming store and see how much space They have to all Lotr Lcg stuff, it is less than I personally have in my bookshelf to Lotr Lcg products, so the space/ varehouse /inventory problem is very real to old and popular game like Lotr Lcg. There is more stuff that can be put together (in economically sensible way). And I am very hopefull to see more Lotr stuff, just because it still is very popular and Also one of my personal favorite fransises! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639156","commentId":3639156,"userName":"stimpaksam","timestamp":1551715979,"content":"New preview article posted: https://www.fantasyflightgames.com/en/news/2019/3/4/explore-middle-earth/ [https://www.fantasyflightgames.com/en/news/2019/3/4/explore-middle-earth/]\n\nFirst thing I noticed was they gave Aragorn a beard..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639236","commentId":3639236,"userName":"Wandalf the Gizzard","timestamp":1551721153,"content":"It seems weird to me that the \"rally\" phase is at the end of the turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639498","commentId":3639498,"userName":"TheSpitfired","timestamp":1551738115,"content":"> On 1/22/2019 at 11:34 AM, Hannibal_pjv said:\n> \n> Ou... has it been so bad? \n\nLast week I finally got Celebrimbor’s Secret. I ordered it through my FLGS last April. I try to keep optimistic too but it has not been great. I do agree that I think they will keep reprinting, you would just think they would do more because of how popular this game constantly stays. It is that good after all!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639745","commentId":3639745,"userName":"Miceldars","timestamp":1551778376,"content":"If I understand well, to play this board game you need to install an app to help you to generate map and events, and which tells you if you succeed or not when you have to make a test ? You can't play without this app ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639772","commentId":3639772,"userName":"TheSpitfired","timestamp":1551781347,"content":"> 43 minutes ago, Miceldars said:\n> \n> If I understand well, to play this board game you need to install an app to help you to generate map and events, and which tells you if you succeed or not when you have to make a test ? You can't play without this app ?\n\nThey’ve done quite a few games that incorporate App-involved play. It is always available online or offline and even in a web browser if you don’t have a device that can use it. FWIW It works very well, X-Com in particular does a fantastic job with the app. It is not as bad as you are tempted to make it out to be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639784","commentId":3639784,"userName":"Miceldars","timestamp":1551783014,"content":"Maybe, but if you are constantly forced to refer to the app when you play, to me it is like a kind of video game with some \"real graphic\" stuff. When I read the description, it seems any action is done with the app, and the content of the box only help to visualize the map, the characters, etc..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3639928","commentId":3639928,"userName":"Wandalf the Gizzard","timestamp":1551797705,"content":"FFG's loves to talk about enhancing their games with balanced app-integration. Halfway between a needless gimmick and a video game with a physical aspect. Christian T. Petersen made this a prominent subject for the In-flight reports at Gen Con."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3640018","commentId":3640018,"userName":"Thaeggan","timestamp":1551802879,"content":"> 5 hours ago, Miceldars said:\n> \n> Maybe, but if you are constantly forced to refer to the app when you play, to me it is like a kind of video game with some \"real graphic\" stuff. When I read the description, it seems any action is done with the app, and the content of the box only help to visualize the map, the characters, etc...\n\nIf the game had a book with chapters and broken into parts of \"if successful see page 10 C or if failed refer to page X Y\" for each event would you think of it differently?\n\nEdited March 5, 2019 by Thaeggan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3640167","commentId":3640167,"userName":"Miceldars","timestamp":1551811790,"content":"I would think it is better to make it a video game instead of a half video and half board game 😛"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3640183","commentId":3640183,"userName":"Wandalf the Gizzard","timestamp":1551812591,"content":"My 100 dollars disagrees."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3640586","commentId":3640586,"userName":"Authraw","timestamp":1551846344,"content":"And my app!\n\nVideo games and board games have different strengths. I have long been excited about FFG's attempts to get the best of both worlds with this hybrid model! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289025-journeys-in-middle-earth-board-game-announced/?do=findComment&comment=3697240","commentId":3697240,"userName":"Kjeld","timestamp":1557250331,"content":"I finally got a chance to play Journeys in Middle Earth last night at my FLGS, and I have to say that I was very impressed. Setup was quite quick for how many pieces are involved, which meant we got into the action right away. And the action was very tense and fast-paced! Also, while I was skeptical of having to use the accompanying app, it really worked seamlessly and added more than I thought to the thematic mood of the game (it has music and sound effects if you want them on). The app also dramatically streamlines a lot of the tedious bookkeeping that can sometimes bog down the card game, which lets players focus on the game rather than keeping track of a million separate effects and statuses.\n\nDuring our game, it felt the whole time that we were racing against the clock to complete the mission objectives, and there was real and constant tension between eliminating the enemies on the board and making progress toward the objectives. It definitely felt like we constantly had to make tough choices and determine how best to use our very limited resources.\n\nThere were some epic moments of success -- like when Legolas one-shotted two ambushing Brigands who had Beravor pinned down, freeing her to secure the penultimate objective or when Bilbo slipped his dagger under an Orc Captain's armor for the kill to save Aragorn -- as well as failure, such as when Legolas finally succumbed to a pack of hungry Wargs just shy of reaching the final objective.\n\nI also really like the way that mission completion is handled. It's not a strict win/lose outcome, but rather there are gradations of success -- depending on how many objectives you complete -- that affect the next mission. Thus you don't generally waste an hour or two on a mission just to fail and have to run it over again before you can proceed to the next, AND choices you make in one mission have major effects on what happens in succeeding missions.\n\nSo, all in all, a very good experience and it seems like you get a really good value for the $100 price tag. I would definitely recommend!"}]}