{"url":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/","title":"Thoughts on a Shire cycle, hobbits in general","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597033","commentId":3597033,"userName":"player1683311","timestamp":1547870285,"content":"Dalestephenson had started a cool roster of characters (see his thread)  and that spun into a different discussion that I felt should move to a different heading. \n\nThe logic in a shire cycle being next is sound. When I considered the fact that the 2 heroes in a shire deluxe could be another Sam and another Frodo I started getting very excited. \n\nFrodo is an amazing hero but goes against the hobbit archetype so a new version would be awesome. \n\nSam is amazing, but there are so many auto include spirit and lore cards, that it becomes a fight between sam and tactics, where tactics always wins because I wanted to try Cotton or new Bilbo.  That brings up another point that tactics has the least auto include hobbit cards and 3 very excellent heroes. \n\nDale is so strong because you can put any attachment or ally you want in the deck for one, so any good dale ally or item attachment goes in, and because of bonkers card draw.\n\nHobbits really want access to lore and spirit, although a number of great cards exist in leadership. \n\nWouldn't it be interesting if there was another hobbit archetype developed? I doubt that would happen since each faction has their own synergies and not usually multiple, although Gondor can go the lore trap route or the leadership soldier route....\n\nAnd as mentioned in the other thread a thain of the shire card would be awesome\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597057","commentId":3597057,"userName":"Onidsen","timestamp":1547873260,"content":"I find it rather unlikely that hobbits would get another archetype - they already have 2. There's the Pippin/Sam/ insert 3rd hero here deck that relies on engaging enemies with a higher engagement cost than your threat, and then the spirit hobbits (Pippin, Frodo, fatty) which involve treating your threat as a resource which you can spend to do something with.\n\nNot to mention the still- new hobbit/  ranger/  side quest synergy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597064","commentId":3597064,"userName":"GrandSpleen","timestamp":1547873688,"content":"> 48 minutes ago, player1683311 said:\n> \n> Wouldn't it be interesting if there was another hobbit archetype developed?\n> \n>  \n\nYes. Or, a sub-type, like we see with mining dwarves. I want to see more Hobbit abilities which benefit from raising your threat.  We have several either directly Hobbit cards or Hobbit-themed cards which do this.  Frodo, Fatty, and Spirit Pippin all raise your threat to use their abilities (a third of all Hobbit heroes).  Sam ally benefits when you raise your threat.  There aren't other cards that have a benefit resulting from raising your threat (triggering off a threat raise, like Sam), although we do have the Free to Choose event which is Hobbit-themed and like a threat cancellation. There is at least one more Hobbit-themed card which raises your threat and therefore doesn't fit well into the existing Hobbit archetype: O Elbereth, Gilthonial (sic).  Are there others?\n\nAnyway, all that is to say that the underpinnings of a sub-type exists.  Treating threat like a currency, or using many effects which key off of raising your threat.  Would be great to see it developed.  A hero along those lines would be great, Sam would probably be the best choice since he could then be paired with Spirit Frodo in a way that makes sense (currently the hero pair do NOT work well together, which is SUCH a shame), but I wouldn't mind seeing a Leadership Frodo which has an ability like this, either.\n\nSeeing a Shire-theme deluxe and cycle would be very exciting."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597065","commentId":3597065,"userName":"GrandSpleen","timestamp":1547873827,"content":"> 9 minutes ago, Onidsen said:\n> \n> I find it rather unlikely that hobbits would get another archetype - they already have 2. . . . and then the spirit hobbits (Pippin, Frodo, fatty) which involve treating your threat as a resource which you can spend to do something with.\n\nI wouldn't at all call it an archetype, just the suggestion of one. It would need to be developed in order to have that distinction. Pippin and Fatty are widely panned as some of the worst cards in the game, partly because they clash so much with the existing Hobbit archetype.  They need their own deck (which really doesn't exist due to lack of cards supporting it).\n\nOur designers love to breathe life into old cards.  So I'd say it's a real possibility.\n\nEdited January 19, 2019 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597071","commentId":3597071,"userName":"GrandSpleen","timestamp":1547874752,"content":"I remembered making a custom card long ago for a contest which was right up this ally. Dug it up on the Tales from the Cards site, here it is:\n\nfrodo-baggins-front-face.jpg?w=375&h= [https://talesfromthecards.files.wordpress.com/2016/06/frodo-baggins-front-face.jpg?w=375&amp;h=]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597118","commentId":3597118,"userName":"player1683311","timestamp":1547883228,"content":"In the end of Lotr Frodo really steps back and really only speaks up to keep the hobbits from killing.  Mostly he follows Gandalf's instructions, the fellowship, Gollum, only at times speaking with major authority or making major decisions. \n\nI'm not saying he doesnt show great courage, and perseverance, he does, and that's why spirit is his best match I think.\n\nI can see an argument for it. But I feel Frodo is a bad match for leadership. Personal preference. The other 3 definitely I think could be leadership, mostly from their actions after the ring is destroyed. I feel the only other sphere he fits would be Lore. \n\nGrandspleen I think the secrecy part of your card is genius. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597227","commentId":3597227,"userName":"dalestephenson","timestamp":1547902896,"content":"I think Merry and Pippin deserves Leadership, Sam deserves Spirit, and Frodo deserves Lore.  However, I wouldn't argue with Frodo as leadership -- throughout the book, including in the Scouring of the Shire, the other three main hobbits looked to Frodo to leadership.  Frodo doesn't put himself forward and doesn't like to make decisions, but he leads all the same, and preventing the hobbits from killing ruffians or Saruman required leadership, because the hobbits were ready to kill -- and Frodo was obeyed.  Frodo was also appointed as Deputy Mayor during Wil Whitfoot's convalescence.\n\nThe low-threat Hobbit hero archtype is well-established, but save Rosie needs few Hobbit allies.  Tactics Bilbo may be overpriced, but works well with Spirit Pippin and may create a minor archtype that will never be powerful -- while the threat-raising hobbit heroes may be a theme, they don't really work together.\n\nWhat's lacking is quality grist for Tom Cotton's hobbit *ally* deck.  That's an archtype in progress, but like Beorning it still needs a lot of help.  Tom Cotton is a grand defender, especially with Rosie's help, and his attack boost is required with the low-attack allies, but he needs a steady stream of new hobbits to use his boost and the hobbits don't flit in and out of play like Silvans, with the  important exceptions of Wandering Took, Gaffer Gamgee, and to a lesser extent (bottom of deck instead of back to hand) Curious Brandybucks.  While a return-hobbit-to-hand event or attachment would be good for Tom, that's also just duplicating Silvans.  I like the idea of getting more hobbits with a cool return-to-hand ability, because that distinguishes the hobbits from the Silvans.  I also wouldn't mind another generic hobbit ally like the Curious Brandybucks that return to deck automatically but can be played for free.\n\nI'm not convinced that the Shire will be the next cycle -- the current cycle is leaving us in close proximity to Rhun, and we've seen little of the Easterlings yet.  Could a cycle there invent an Easterling deck?  They couldn't just replicate the story of Kahliel's village, we've seen that and it would only justify the sort of deck that Harad is with a few named allies.  I think what would make more sense is an invented beleagured realm in the East that is anti-Sauron and cut off from the West, but sustained by the efforts of the two blue Wizards that went East.  They could be the associated heroes of the type, have colors instead of being neutral, but share Gandalf's ability of having the top card of the deck be visible.  Then the Easterling allies could do something cool that works with the top of the deck.  Easterlings tend to be shorter axe-wielding men, mixing them with the dwarves for mining would produce some nice all-beard decks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597311","commentId":3597311,"userName":"GrandSpleen","timestamp":1547912533,"content":"Tom's Hobbit attack deck is definitely a thing already, at least powerful enough to be the only combat deck in 2-player Fire in the Night, Three Trials, Treachery of Rhudaur.  It's going to see some development with the upcoming Gaffer ally, and I agree that more allies like him would be a boon to that deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597323","commentId":3597323,"userName":"dalestephenson","timestamp":1547913624,"content":"I'm surprised, since the permanent attack for hobbit allies is all under 2, except for the unique Farmer Maggot.  But I've not tried to play it yet myself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597464","commentId":3597464,"userName":"GrandSpleen","timestamp":1547925951,"content":"Boost Merry's attack with daggers and Rosie. Merry synergizes well with Tom, he can ready the Hobbit who is getting +2 this round.  It's pretty 'bursty,' just like a Silvan deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289439-thoughts-on-a-shire-cycle-hobbits-in-general/?do=findComment&comment=3597711","commentId":3597711,"userName":"dalestephenson","timestamp":1547947325,"content":"That makes sense.  If you're running TaMerry in an all hobbit deck with daggers and Rosie, I wouldn't think you'd need Tom's boost very often.  He's one of the best attacking heroes as is."}]}