{"url":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/","title":"Best order of play?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597606","commentId":3597606,"userName":"Jeff1121","timestamp":1547939461,"content":"So hypothetically speaking, if the Fantasy Card Gods happened to drop the entire line of all Lord of the Ring LCG sets and expansions into the lap of a new player, what order would you recommend he play everything in?\n\nA - Order of release for all expansions/sets.\n\nB - All Deluxe sets and cycles first, then jump into the Saga stuff.\n\nC - Start with the Saga stuff, then jump into the Deluxe sets and cycles.\n\nD - Other (please elaborate).\n\nJust looking for the best way to tackle this game both thematically as well as ease of play.\n\n \n\nThoughts?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597609","commentId":3597609,"userName":"Bullroarer Took","timestamp":1547939732,"content":"Always A if possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597662","commentId":3597662,"userName":"player1683311","timestamp":1547943962,"content":"I agree with Bullroarer took, with one caveat.  \n\nB allows you to do your campaign last so you have the most cards to pick your prime deck from. Also, it can be fiddly remembering things so it is nice to go through in one push. \n\nEither way go in order, the older quests are fun, but once you play newer quests they dont stand up as well. So going through in order allows you to get the most from the game. \n\nThen if you are a hardcore fan you can go through everything again in nightmare mode\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597716","commentId":3597716,"userName":"dalestephenson","timestamp":1547948081,"content":"While lots of players have gone in progression style, Sagas complicate things -- it's nice to play saga quests in continuous chunks rather than just plop individual saga boxes in the middle of a cycle when they were historically dropped.  Why play the first Hobbit box after Dwarrowdelf, then play the Heirs of Numenor deluxe before popping back to finish it?  Why do Black Riders in the middle of the Against the Shadow cycle, then do Road Darkens in the middle of the Ringmaker cycle?  And so forth.  If I had the entire collection and was doing things from scratch, I'd go like this:\n\nMirkwood\n\nDwarrowdelf\n\nBoth Hobbit sagas\n\nHeirs/Against the Shadow\n\nBlack Rider & Road Darkens\n\nRingmaker\n\nAngmar Awakens\n\nTreason of Saruman & Land of Shadow\n\nDreamchaser\n\nHarad\n\nFlame of the West and Mountain of Fire\n\nEred Mithrin\n\nThis way you aren't interrupted cycles and do a book's worth of saga each time you drop in.\n\nHowever I can't emphasize this enough -- if you *don't* have the complete corpus, in no case would I put off playing the content I do have because you can't get some other content that was historically first.  While I agree that the designers have improved their craft over the years, I think it's both enjoyable and worthwhile to play with full card pool decks against even the earliest quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597717","commentId":3597717,"userName":"player3351457","timestamp":1547948191,"content":"Do we include the current cycle/expansion that comes periodically? Because I will say it's been exciting to break up our saga adventures with the \"scenario of the month\" (which then becomes scenario of the bi-month both because we can never one-shot it and FFG takes forever to release their packs). In that sense, I like the core cycle + one more (maybe khazad) and then going through saga. Interrmiten breaks should be encouraged though, just to break up the same deck usage. Encourage the deck building aspect of it.\n\n \n\nEdit:to be clear, I am referring to the Reed mithrin cycle.\n\nEdited January 20, 2019 by player3351457"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597734","commentId":3597734,"userName":"Wandalf the Gizzard","timestamp":1547951122,"content":"I would definitely buy expansions in the first manner you suggested.\n\n> 3 hours ago, Jeff1121 said:\n> \n> A - Order of release for all expansions/sets.\n\nHowever, this is not at all a good idea with the current release schedule, and you asked about the best order of play if you already have all the expansions.\n\nIn that case, I would wait to play the LotR sagas until you've played through the the Haradrim cycle (around the time when Mountain of Fire was released). This way you start the saga campaign with all the player cards that were available when the final saga expansion was released.\n\nI would still play the Hobbit sagas right after the Dwarrowdelf cycle, though.\n\n \n\nWhen you say \"Order of release for all expansions,\" do you intend to allow yourself the full card pool for each quest? Or would you play \"progression style:\" only using player cards that were released back when that quest was released, \"Unlocking\" cards for yourself chronologically. I would advise this second approach."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597749","commentId":3597749,"userName":"player1683311","timestamp":1547953024,"content":"Also important to note that the greater the card pool, and in some cases the newer the cards, the earlier quests become easier and easier.  It isn't a constant increase in difficulty, for instance the first 2 cycles I think are very very easy with a full card pool, then things get progressively more difficult.  That is over simplifying but you get the idea"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3597827","commentId":3597827,"userName":"Ywingscum","timestamp":1547966701,"content":"In the order you can obtain the cards in.  I have bounced from Mirkwood to Heirs I’d Numenor to Angmar awakenings to Harad with a little ered Mithrin mixed in now to ring maker"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3721202","commentId":3721202,"userName":"GILLIES291","timestamp":1560554897,"content":"We did mostly option C. We started by picking up and playing through Mirkwood, but then went and bought all of the Sagas and played through those before starting to get into the earlier cycles. Also we randomly played Angmar cycle next because it was the only one all available at the time. Next we are about to go into Dwarrowdelf cycle so looking forward to that. \n\nEdited June 14, 2019 by GILLIES291"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3721230","commentId":3721230,"userName":"alcuin18","timestamp":1560558161,"content":"I would recommend playing the cycles in order as well. My son, daughter and I are playing this way and it's interesting to see how much more difficult the cycles get as you go through. Heirs of Numenor seemed rough after Dwarrowdelf so hold on to your hat if your going into that one! Good luck and have fun!\n\nEdited June 15, 2019 by alcuin18"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3721299","commentId":3721299,"userName":"Vince79","timestamp":1560576973,"content":"> On 1/19/2019 at 7:26 PM, player1683311 said:\n> \n> B allows you to do your campaign last so you have the most cards to pick your prime deck from. Also, it can be fiddly remembering things so it is nice to go through in one push. \n\nI've always intended to do A, and have so far.  But I am liking the sound of B, for just this reason.\n\nOnly thing is, I'm moving through these expansions so slowly, it is likely to take years to get through them all (if ever).  I'm still working on organizing decks to use for the second cycle.  So maybe I'll keep going through the deluxes, until at some point I get bored, or the urge to do some Sagas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3722053","commentId":3722053,"userName":"mttrchrds","timestamp":1560723240,"content":"I've been playing progression. Started the game just over 6 months ago. What I've found really enjoyable is to listen to Cardboard of the Rings podcast as I go. They review the player and encounter cards for every deluxe and AP, discuss the quests etc. It's really fun. Highly recommended."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3887086","commentId":3887086,"userName":"Ceahorse","timestamp":1580907564,"content":"Its actually quite hard to get into this.. all the early releases are super overpriced in the 3rd party market.. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3887140","commentId":3887140,"userName":"Ywingscum","timestamp":1580912938,"content":"The juice is worth the squeeze.  It’s simply my favourite all time game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3887147","commentId":3887147,"userName":"Ceahorse","timestamp":1580913672,"content":"I have the Core, some of Mirkwood Cycle, KD but that's it.. I sometimes consider continuing but its pretty daunting. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3887218","commentId":3887218,"userName":"dalestephenson","timestamp":1580918808,"content":"I would definitely not pay inflated prices just to continue in the original publication order.  Look at expansions that are currently available at retail for your next step in the journey.  Dwarrowdelf can wait until it's reprinted again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3908792","commentId":3908792,"userName":"darthweasel2","timestamp":1583525434,"content":"is there a list somewhere of the order of releases?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289476-best-order-of-play/?do=findComment&comment=3908800","commentId":3908800,"userName":"stimpaksam","timestamp":1583526074,"content":"> 10 minutes ago, darthweasel2 said:\n> \n> is there a list somewhere of the order of releases?\n> \n>  \n\nhttps://boardgamegeek.com/wiki/page/LotR:LCG_Releases_by_Date [https://boardgamegeek.com/wiki/page/LotR:LCG_Releases_by_Date]"}]}