{"url":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/","title":"Power level on enemies in newer expansions to strong?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603738","commentId":3603738,"userName":"IamNotyourFather","timestamp":1548484972,"content":"Im new to the LOTR lcg and have really enjoyed playing the quests from the core set and a few of the older cycle packs i have found. Unfortunately like a lot of people i cant find many of the older expansions so i have been picking up newer expansions and cycles. As i play newer expansions, i like the quests but have noticed that the enemies are getting more powerful stats, in my opinion, maybe to powerful.\n\nA basic Goblin, Orc, etc used to have 2-3 attack, 1-2 defense and maybe 3 hit points, which was managable by a heroe or a couple allys which is thematic. In the newer expansions im seeing Dunland Warriors, Goblins, Orcs having Troll level stats, requiring multiple heroes along with allys to defeat them. Im sure a lot of it has to do with the attachments and events that are now available to the player.\n\nI hope LOTR lcg continues for many years to come but in future encounter decks it would be nice to have a board state with multiple weaker enemies (maybe a mechanic where some can combine attacks) as opposed to having overly powerful enemies. For me it would be more thematic.\n\nAnyone else seeing the same thing?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603762","commentId":3603762,"userName":"alcuin18","timestamp":1548492542,"content":"I'm sure they probably will. They may just be doing it this way for now just to throw something different at players for a surprise or to keep you on your toes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603823","commentId":3603823,"userName":"dalestephenson","timestamp":1548508487,"content":"I think the jump in average enemy power happened between Dwarrowdelf (2nd cycle) and Against the Shadow (3rd cycle), but hasn't seen any dramatic leaps since then.  But it varies by scenario -- the Cursed Dead of the Angmar Awakens cycle will overwhelm you with numbers.\n\nHere's how orc surgers have changed over the game:\n\n10/1/2/0/2 Wolf Rider (core)\n\n45/2/1/1/3 Orc Horn Blower (KD) -- When revealed: reveal a card from encounter deck and add it to staging area.  [Hate this guy]\n\n20/1/3/1/2 Goblin Runners (OHUH, later used in Limited Edition Starter)\n\n15/1/2/1/2 Orc Scramblers (HN) -- When revealed: deal 1 damage to each battleground location.\n\n33/1/3/1/3 Uruk-Hai Tracker (RD) -- Toughness 1, Archery 1, +2 attack against characters with 2 or less hp.  [Ludicrously powerful surger, turns Defender of Rammas into a chump blocker and takes 5 attack to kill.  Thalin hates Uruk-Hai.]\n\n8/1/2/1/3 Orc Grunts (Carn Dum) -- Doomed 1.  Any time progress is placed on the current quest, reduce by one.\n\n30/1/2/1/2 Mordor Orc (FOW) -- While Minas Tirith is in play, undefended damage must dealt to Minas Tirith\n\n28/1/3/1/3 Orc of Mordor (MOF) -- Forced: After Orc of Mordor engages you, exhaust a character you control.\n\n33/1/3/2/3 Little Snuffler (MOF) -- Peril.  When revealed: Raise threat by 1 for each ally or discard an ally you control.\n\n50/1/2/0/3 Stray Goblin (WOR) -- Cannot be optionally engaged.  While in staging gains \"Forced: after a player engages an enemy stray goblin engages that player\"\n\nI'm leaving out the nightmare surge orcs.  The worst of the lot is Uruk-Hai Tracker and Orc Horn Blower, IMO -- though there's only one horn blower and there's 3 of the Uruk-Hai.  The core set surger is clearly the easiest on merit, but possibly has the most obnoxious shadow form -- he attacks as himself and then goes on top of the deck to try and get revealed the following turn.\n\nDunlendings can be tough, but fall short of troll level stats except for Chieftains -- and since Dunlending scenarios don't have trolls in the mix, they need to *be* the troll-enemies in order to provide them.  What makes the Dunlendings nasty IMO isn't their base stats, it's all those card-related extra attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603883","commentId":3603883,"userName":"Authraw","timestamp":1548519114,"content":"I believe the player card power creep happened around Dwarrowdelf, and the enemies caught up with Heirs of Numenor. Since then the power curve has been flatter, although I have my suspicions that we may have seen another player card power creep with the latest cycle. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603945","commentId":3603945,"userName":"player1683311","timestamp":1548528839,"content":"I would agree, there was a jump in dwarrodelf. It makes the first 2 cycles way too easy now, also I'm general since then there is a more gentle upward curve in difficulty. It is one of the reasons why playing progression style is best (without considering the current reprint dilemma)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3603998","commentId":3603998,"userName":"dalestephenson","timestamp":1548536718,"content":"I don't agree that the first 2 cycles are \"way too easy\" now, but that's a matter of taste.  I also don't really see that there is a gentle upwards curve in difficulty, I think the cycle-to-cycle change in difficulty (up or down) is very dependent on what sort of deck you are running; different cycles attack different things.  With my decks Angmar was significantly more difficult than Dreamchaser.  More to the point, there's a dramatic difference in difficulty *within* every cycle.  Is Emyn Muil easy to beat now?  Sure!  But it was easy when I first played it too (solo), just tedious -- and I'm a *lot* more experienced now than I was then.  Experience matters -- new players using xanalor's Killer deck were complaining about going 0/5 (or worse) against Seventh Level with the deck, even though xanalor himself was 1/1.  I ran four runs through it, winning two.  Xanalor took down the entire angmar cycle with that same deck -- good luck to new players trying that!  I typically don't even *try* Escape from Dol Goldur with a single deck, even with the whole card pool to draw on.\n\nI think Heirs of Numenor stands out as a dramatic breakpoint for progression players because the quests in the Deluxe happen to be 3 of the 4 toughest quests in the cycle, and because the willpower-heavy decks that do best against the first two cycles are ill-suited for them.  If the difficulty level of the quests had been distributed differently within the cycle, I don't think it would have been nearly s bad a shock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604084","commentId":3604084,"userName":"Wandalf the Gizzard","timestamp":1548547550,"content":"Veterans may not realize that newer players won't have the same incredible success rate with the first two cycles, but they're still remarkably easy now. Even though most of those quests were still very easy at initial release (at least for me), I'll grant that they were possible to lose.  These days, EfDG and RtM are the only quests that pose a challenge from Shadows and Dwarrowdelf.\n\nAs for Heirs of Numenor, I have some . . . words on that expansion's public perception. But, I'll save that for another post, hopefully soon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604129","commentId":3604129,"userName":"dalestephenson","timestamp":1548553076,"content":"I've lost Hunt for Gollum with a powerful fellowship (Dori and the Rings) because Old Wives Tale came out in setup.  Not a hard quest in general, but a badly timed treachery can cost you dearly.\n\nJourney to Rhosgobel isn't a tough quest in general either, but if you attempt it without lore or Honour Guard it can be tough.\n\nRoad to Rivendell without shadow cancellation is Sleeping Sentry away from disaster.\n\nRedhorn Gate with heavy tactics or 0-wp heroes can be tricky.\n\nShadow and Flame still poses a challenge to me.  Using my Dori meets Rossiel fellowship I gave up on beating in normal and dropped to easy, just not enough attack strength.\n\nNow you may say that some of those problems were self-inflicted.  Running a hero-centered, high threat deck against Hunt for Gollum set up an unlucky insta loss.  Protecting against Sleeping Sentry is the whole point of playing Road to Rivendell.  Bringing a quest-heavy, attack-light victory display deck against Shadow and Flame was madness -- and you're not wrong.  But I like to run decks/fellowships against multiple quests, ideally an entire cycle, and not necessarily \"power decks\" that can be expected to curb-stomp any non-nightmare quests.  This means that some quests that wouldn't be challenging against other decks might still be challenging for the deck I happen to be running.\n\nEdited January 27, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604131","commentId":3604131,"userName":"Authraw","timestamp":1548553514,"content":"Agreed! Shadow and Flame can still be pretty rough if you don't cheese it. Foundations of Stone is no slouch either. And of course Road to Rivendell is much the same experience today as it was when it first came out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604257","commentId":3604257,"userName":"player1683311","timestamp":1548575196,"content":"Of course I only speak from personal experience, and I should have noted that I feel they are very easy with the entire card pool.  Progression is completely different than going through in other ways\n\nEveryone had different experiences though, that was just my 2 cents! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604302","commentId":3604302,"userName":"dalestephenson","timestamp":1548590231,"content":"With the early cycles especially, encounter card strength is so uneven that sheer luck of the draw can dramatically impact how tough a quest is.  Since I generally only play a deck against a quest until I beat it, a lucky draw can make me think a tough quest is easy, and an unlucky draw can make me think an easier quest is tough.  I participated in a duplicate quest at BGG where all participants played the same deck against the same quest, with all cards in the exact same order.  But depending on when you chose to engage enemies made a big difference -- affecting whether Cave Troll came out as an enemy or was harmlessly discarded as a shadow.  Radically different difficulty from a fixed deck, and the difference between victory and defeat (at least for me)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289812-power-level-on-enemies-in-newer-expansions-to-strong/?do=findComment&comment=3604307","commentId":3604307,"userName":"Amicus Draconis","timestamp":1548591749,"content":"> 19 minutes ago, dalestephenson said:\n> \n> With the early cycles especially, encounter card strength is so uneven that sheer luck of the draw can dramatically impact how tough a quest is.  Since I generally only play a deck against a quest until I beat it, a lucky draw can make me think a tough quest is easy, and an unlucky draw can make me think an easier quest is tough.  I participated in a duplicate quest at BGG where all participants played the same deck against the same quest, with all cards in the exact same order.  But depending on when you chose to engage enemies made a big difference -- affecting whether Cave Troll came out as an enemy or was harmlessly discarded as a shadow.  Radically different difficulty from a fixed deck, and the difference between victory and defeat (at least for me).\n\nMy first try against The Seventh Level had a Cave-troll in one of the first rounds. It added 4 Threat, I quested unsuccessful and had to raise my threat. Engaging it early would only wipe the board with excessive damage, not engaging it will raise threat, two round later it will engage and wreak havoc then. In the second try the Cave-troll appeared much later and I had no trouble beating it with an established board state."}]}