{"url":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/","title":"Heirs of Numenor: Dethroned","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604105","commentId":3604105,"userName":"Wandalf the Gizzard","timestamp":1548550839,"content":"Okay. I have some thoughts to share on Heirs of Numenor, that hopefully some of you will find helpful or at least entertaining if you get through my wall of text. (sorry in advance) :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nSince release, Heirs of Numenor (HoN for here on out) has been heralded as the standard for LotR LCG brutality. Players constantly talk about how difficult it was, new players were sometimes encouraged to skip it, and all three quests essentially never saw play due to how hard they were. When players had success against HoN's quests, it often came from specifically tailored, fine-tuned decks, and these made and piloted by experienced vets. When I recently opened my own copy of HoN, I was braced for the worst.\n\nAfter playing each quest multiple times, I was somewhat disappointed. I have a bold statement to make: HEIRS OF NUMENOR IS NOT THAT HARD! I concede that it's three quests are much harder than most others that I've played, but they are nowhere near as difficult as I gathered from the general consensus.  Let me break it down quest-by-quest\n\nPeril in Pelargir is the hardest of the bunch for me personally. Its encounter cards aren't as devastating as those from the other two quests, but the puzzle nature sets it apart from its rather straightforward siblings. I've yet to run away with a clear win against this one, always finishing with a high threat and damage all over the place. But all you need to win this one is a really strong early game from a heavy-duty combat squad. As long as you don't depend on allies too much (thanks to the Zealous Traitors), the only thing standing in your way is the ability to build up a board than can suddenly shift to willpower questing quickly; before the encounter deck outlasts you.\n\nNow, let me take a deep breath here, because this next sentence is close to blasphemy.       Okay.     Into Ithilien is not hard to win. I know, know, but I'm serious! I've played it six times now, with the only loss coming from a Mumakil and a Southron Company engaging me on the first round. I've beaten it multiple times each route (stage two and three). Yes, two wins were with a Dwarf deck that also took down Assault on Dol Guldur, but all you really need is a decent combat deck. On the first round, seek to blow out the Ithilien Road. Build up your board while you let Celador take hits until he's gone (trust me, it's for a good cause :ph34r: [//content.invisioncic.com/Mfantflight/emoticons/default_ph34r.png]). You should be able to defeat stage two and four with minimal resistance. Those Blocking Wargs can cause problems, but you should be fine as long as you don't threat out.\n\nAs for Siege of Cair Andros, I honestly don't know how anyone who knows what they're doing could possibly lose this one, barring some (reasonably possible, I grant you) bad luck. A deck that starts with two strong defenders and a strong attacker and stuffed with allies and tactics good stuff  consistently does the trick (Beregond/Legolas/Gimli and Beregond/Elladan/Elrohir are great hero lineups). Quest like a madman until you can clear the Banks, otherwise stage two will kill you. You should be able to take an undefended attack or two on the approach, but it's a high priority to explore that one too; removing stage three from the deck. Letting the Citadel fall to attacks is a crucial step to success though, as counter-intuitive as that may be. This will keep your Victory Point total low enough to keep stage five in siege mode, meaning you can siege-quest the entire game.\n\nAny thoughts? Do you agree? Is it just me? Or did I just mis-perceive how our fine community looks at this expansion? Whatever the case, I hope I don't sound like I'm just boasting. I recognize that's quite likely, but I assure you; that was not my intent. There are many members of this community that probably have much better records against these quests than I.\n\nAnyway, my main reason for this post is to just let my thoughts out in a way other than voicing my opinions to myself. To anyone that read any of this rambling, thank you. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604133","commentId":3604133,"userName":"player1683311","timestamp":1548553895,"content":"Are you playing progression Style?\n\nPlaying this quest with modern decks, they're like fine wine, they are just fun and can represent a challenge. Like wine, in the way they've aged\n\nIf you play these progression style, or when they came out, they are absolutely brutal. If you are playing progression style and it found them easy, then I commend you on your play! But for me, into ithilien and Siege of caire andros are two of the most difficult quests I've ever played. \n\nProgression Style, ruins of belegost, dunland trap, to catch an orc, Battle of carn Dum, raid on the gray Havens, and the druedain forest are the only other quests to give me so much trouble, after a quick look through\n\nIt is interesting to see, given the length and breadth of the game oh, what different people find difficult, with different people find not difficult, what people prefer, and what people don't like, in terms of quests. Everyone is unique in their tastes, and what they find challenging"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604135","commentId":3604135,"userName":"player1683311","timestamp":1548553963,"content":"I should also note I have not tried Siege or Attack, the last 2 gencon brutal quests"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604136","commentId":3604136,"userName":"dalestephenson","timestamp":1548554103,"content":"I started out following Beorn's Path through the first cycle, and continued through subsequent cycles with the same hero lineup, modifying the deck as new cards came online.  And honestly the hero lineup wasn't *that* bad for the cycle, only Morgul Vale was beyond terrible.  Still, I think the same thing happens to a lot of players -- they have a lineup and deck that work well, hit Heirs of Numenor, and the deck doesn't work *nearly* as well, because they just aren't set up for battle questing out of the gate.  In the first two cycles you can bring attack online slowly -- in Heirs you can't.\n\nSo consider Siege of Cair Andros.  If you run tactics heavy with strong attacking/defending heroes, yes it can be an easy quest to siege your way to victory.  But there aren't a lot of either of those in the first two cycle, and you're running your tried-and-true Theodred-Beravor-Eowyn deck, questing is going to *struggle* out of the gate.  Especially if an Orc Vanguard is in the staging area.  Or Master of Malice comes out and you can't cancel it.  Or the non-cancellable Power of Mordor comes out and sweeps those battleground locations away, forcing you to go through all the stages.  This is a *dang* tough quest if you haven't built your deck *and chosen your heroes* specifically for this quest.\n\nThat's actually my main beef with those encounter sets in Heirs/Shadow, really.  I don't like having the quest pick my heroes for me, if I want to have a respectable chance of winning.\n\nI think there's two different ways to look at quest difficulty -- what the winning percentage would be against a deck specifically optimized for that quest, and what the winning percentage would be against a set of unoptimized decks.  Someday I'd like to take my tribal Stereotypical decks through all the cycles and see how many tokens they require to win (using Grace of Valar variant for speed and a guaranteed win), I think that might give a more nuanced picture on how challenging certain quests are (though my skill in piloting each deck is unfortunately not a constant). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604278","commentId":3604278,"userName":"Halberto","timestamp":1548584125,"content":"I remember my experience with Hon...\n\nI play progression stile only when facing a quest the first time.\n\nPeril in pelagir was not difficult to beat. I found other earlier quest much more troublesome ( return mirkwood for example).\n\nInto Ithlien was Nightmarish.  Full stop. I never had the same wall with later quest. In part it may be due to me becoming better as a player.  Don't know. But it was brutal.\n\nCair Andros was difficult but not so much. Actually was the one I enjoyed the most playing at the time. It was a strong combat quest but \"fair\" in the way it hit at players. \n\nWith modern card pool Hon is not that hard. But in progression we have yet to see another deluxe box so challenging.\n\nEdited January 27, 2019 by Halberto"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604305","commentId":3604305,"userName":"Amicus Draconis","timestamp":1548591284,"content":"If we ever get another similar challenging deluxe box in progression, it will be equally hard for a modern card pool, as the modern pool is equal to a progression one. But I highly doubt, this will be the case, because it would only drive customers away. Brutal scenarios are more likely to be released as nightmare decks or PoD."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604500","commentId":3604500,"userName":"Wandalf the Gizzard","timestamp":1548617751,"content":"@player1683311 [https://community.fantasyflightgames.com/profile/189558-player1683311/] All of the wins and strategies I discussed actually came from progression style play. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\n> 17 hours ago, dalestephenson said:\n> \n> I think there's two different ways to look at quest difficulty -- what the winning percentage would be against a deck specifically optimized for that quest, and what the winning percentage would be against a set of unoptimized decks.\n\nThis is a very important point, so thank you for making it. I know many players don't have the time, incentive, or enjoyment for crafting decks for specific quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604687","commentId":3604687,"userName":"TwiceBorn","timestamp":1548642488,"content":"I'd also like to point out that when many of us first played HoN, it was before Blocking Wargs had been errataed. Blocking wargs with recurring surges in Into Ithilien were pretty brutal. And as I recall, there was another card in Peril in Pelargir that could generate chains of nasty and potentially game ending surge combo effects (I think it was a Treachery called \"Local Trouble\" or something like that, don't have time to look it up). \n\nI definitely remember enjoying Siege of Cair Andros more than Peril and Ithilien."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604746","commentId":3604746,"userName":"player1683311","timestamp":1548647681,"content":"> 1 hour ago, TwiceBorn said:\n> \n> I'd also like to point out that when many of us first played HoN, it was before Blocking Wargs had been errataed. Blocking wargs with recurring surges in Into Ithilien were pretty brutal. And as I recall, there was another card in Peril in Pelargir that could generate chains of nasty and potentially game ending surge combo effects (I think it was a Treachery called \"Local Trouble\" or something like that, don't have time to look it up). \n> \n> I definitely remember enjoying Siege of Cair Andros more than Peril and Ithilien.\n\nCollateral damage could known you out in one go. Local trouble is another treachery in there that raises your threat (condition attachment)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604857","commentId":3604857,"userName":"Halberto","timestamp":1548666088,"content":"> 6 hours ago, TwiceBorn said:\n> \n> I'd also like to point out that when many of us first played HoN, it was before Blocking Wargs had been errataed. Blocking wargs with recurring surges in Into Ithilien were pretty brutal. And as I recall, there was another card in Peril in Pelargir that could generate chains of nasty and potentially game ending surge combo effects (I think it was a Treachery called \"Local Trouble\" or something like that, don't have time to look it up). \n> \n> I definitely remember enjoying Siege of Cair Andros more than Peril and Ithilien.\n\nTrue. At the wrong time, non errata Bloking wargs  could crush even decks built with full card pool. It was so unfair and unmanageable that the designers felt the obligation to need it. Probably the first time they had to totally downgrade an encounter cards...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3604862","commentId":3604862,"userName":"TwiceBorn","timestamp":1548666299,"content":"> 5 hours ago, player1683311 said:\n> \n> Collateral damage could known you out in one go. Local trouble is another treachery in there that raises your threat (condition attachment)\n\nAh yes, Collateral Damage was the one I had in mind. \n\nEdited January 28, 2019 by TwiceBorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3605079","commentId":3605079,"userName":"Wandalf the Gizzard","timestamp":1548686844,"content":"I think the errata to Blocking Wargs was to prevent a broken situation (Blocking Wargs could continue looping if multiple copies of that card were the only ones left in the encounter deck), not to nerf its power."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3606797","commentId":3606797,"userName":"Crusaderlord","timestamp":1548758338,"content":"I play solo one deck, i do of course tweak my deck for a quest but i am not overly keen on having to specifically build a whole deck again to beat a scenario. Heirs of Numenor did not end up as one of my more favoured box sets overall, but it was better than i expected and i only bought it last year.\n\nPeril in Pelargir - well, i decided in the end that this is one of my least favourite quests of all time. I just got frustrated trying to win, and every time i felt like i was getting somewhere another nightmare card would undo me. Also the theme was a little boring to me. I can certainly see why this one is considered too hard.\n\nInto Ithilien - the easiest one in the box to me, tough yes but i was able to build a deck to cope ok and beat it from time to time. The rangers popping up is one of my favourite mechanics in the game. So an A+ from me as i like this quest a lot.\n\nSiege of Cair Andros - came across to me as a similar but harder Battle of Five Armies with Orcs instead of Goblins, which thematically makes sense for it to be harder. I enjoy it, but it is a quest i beat rarely.\n\nI generally do not mind losing multiple times if i genuinely feel i do have a chance for it all to come together soon in a great victory.  I never got that feeling from Peril but i did for the other two. In the end i judge less by difficulty and more by did i enjoy the story, theme and did i want to keep trying the same quest over again > My box set views [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607014","commentId":3607014,"userName":"Wandalf the Gizzard","timestamp":1548773510,"content":"I really enjoy Into Ithilien as well. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607161","commentId":3607161,"userName":"Halberto","timestamp":1548779069,"content":"> On 1/28/2019 at 3:47 PM, Wandalf the Gizzard said:\n> \n> I think the errata to Blocking Wargs was to prevent a broken situation (Blocking Wargs could continue looping if multiple copies of that card were the only ones left in the encounter deck), not to nerf its power.\n\nCorrect. Meaning it was actually \"nerfed\" in a way. Now the blocking wages chain is not possible anymore both in the form of infinite loop nor in the form of multiples hits in subsequent rounds.\n\nThe effect is still the same but the impact on the game is totally decreased vs original version. \n\nNot so different from the nerf we received on players cards such as poor master of lore or Ta-boromir where the effect of their ability is not changed but the impact on actual games did (Boromir is still very good obviously)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607205","commentId":3607205,"userName":"Wandalf the Gizzard","timestamp":1548780731,"content":"This sadly sometimes happens with erratas. One example is the errata to Master of Lore, which didn't solve the problem. Horn of Gondor ended up being errata'd as well, dismantling the combo with Erebor Hammersmith and Borne Aloft, but the damage was done."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607292","commentId":3607292,"userName":"Halberto","timestamp":1548785433,"content":"Poor master of lore. Being errataed because OF Borne Aloft..... mockery in addition to the damage...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607327","commentId":3607327,"userName":"Wandalf the Gizzard","timestamp":1548787651,"content":"Even a limit of once per round on the Horn would have fixed the combo, and the Horn would still work with Rohan allies without being OP. Oh, well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607332","commentId":3607332,"userName":"dalestephenson","timestamp":1548787808,"content":"Yes, exhausting Horn of Gondor was the best possible errata, and if it had been done first there would have been no need to nerf Master of Lore."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607514","commentId":3607514,"userName":"Halberto","timestamp":1548797542,"content":"Probably Horn was errataed because of Silvan synergy .\n\nIn combo with o Loren it would have created a loop too favourable to players.\n\nPay 1 for a Silvan ally, trigger it's entering ability, Quest, attack and trigger a return to hand event for benefiting of its effect AND get back the resources paid in the planning phase. Rinse and repeat. \n\nToo OP  to be let happen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607517","commentId":3607517,"userName":"Amicus Draconis","timestamp":1548797602,"content":"I am pretty fine with the errata on Master of Lore, I just wish, he would cost only two resources."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607560","commentId":3607560,"userName":"dalestephenson","timestamp":1548800101,"content":"I think it's likely that the infinite cards/resources combo fueled by Horn of Gondor was the reason it was errata-ed.  Are Silvans the reason why it was changed to unlimited when destroyed instead of exhausted leave from play?  It's possible, but I don't think there's anything OP about Horn of Gondor generating 1 resource per turn in a Silvan deck.  If you're running O Lorien in a Silvan deck you have access to Steward of Gondor, which gives you unconditional 2 resources per turn in any deck, without taking a restricted slot to use it.  Besides, they could've cut Silvans out of the loop by having it be \"when discarded or destroyed\" instead of leaves play, which would at least let Horn of Gondor serve its first-cycle purpose of supporting the earliest tribes of Rohan and Eagles.\n\nBut I've complained about the errata before, and I'll likely complain again the next time they do it.  Prior to the last round of errata, while some of the errata was badly done IMO (Master of Lore, Horn of Gondor), they at least addressed some sort of degenerate deck that could exploit an unlimited ability.  The only errata I think that was purely to prevent OP is limiting Beravor's card draw to once per round, which is a sensible limit.  But the last round nerfed Boromir, Caldara, and Hama out of pure OP concerns, and damaged a lot of published decks in the process.  I hope they aren't looking for other heroes to nerf."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607881","commentId":3607881,"userName":"Halberto","timestamp":1548833507,"content":"Dori. They should definitely need Dori..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3607946","commentId":3607946,"userName":"ColinEdwards","timestamp":1548846233,"content":"The only way to make Dori worse: \"Remove Dori from underneath your coffee cup and shuffle him into your deck\" "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608002","commentId":3608002,"userName":"Halberto","timestamp":1548853603,"content":"Dori is a missed opportunity.  With an Action ability instead of a response it would have made a solid multiplayer card. \n\nEven as a response it would still be good if targetting allies in addition to heroes.  \n\nAs he is, his ability is so limited to put him well below the avg bar for heroes. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608007","commentId":3608007,"userName":"Alonewolf87","timestamp":1548854030,"content":"> 8 minutes ago, Halberto said:\n> \n> With an Action ability instead of a response it would have made a solid multiplayer card. \n\nI don't understand why its ability being a Response would be worse than it being an Action, since it being a Response means you can use it also in those steps where you can't play Actions (like an immediate attack during the staging step of the quest phase).\n\nEdited January 30, 2019 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608013","commentId":3608013,"userName":"rees263","timestamp":1548855128,"content":"> 14 minutes ago, Alonewolf87 said:\n> \n> I don't understand why its ability being a Response would be worse than it being an Action, since it being a Response means you can use it also in those steps where you can't play Actions (like an immediate attack during the staging step of the quest phase).\n\nBecause as an action you could wait until after a shadow card has been flipped to decide whether you want to use the ability. As a response you are locked in beforehand. This action window exists regardless of when the attack occurs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608037","commentId":3608037,"userName":"dalestephenson","timestamp":1548857346,"content":"I really like Dori with Grimbeorn.  Actually, I think Dori already is a solid multiplayer card.  He can handle some early sentinel defense and after getting banged up can turn half the heroes in existence into solid defenders.  I've played a lot of Dori fellowships, and being able to provide Beregond-level defense without Beregond -- or provide 6 defense out of the gate with Beregond -- shouldn't be underrated.  If Beregond didn't exist, I think Dori would be a very popular multiplayer hero.\n\nNow since Beregond does exist (in two versions, yet) he might still be below average for all heroes, and I don't think he'd be overpowered if he lent his defense for the whole phase, and/or had an action instead of a response and/or was able to help out allies as well as heroes.  And using two heroes for defense hits hard in one-deck solo unless you pair him with Grimbeorn.\n\nI think he's more useful than the post-errata Hama."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608193","commentId":3608193,"userName":"Wandalf the Gizzard","timestamp":1548866693,"content":"This is my dream version of his ability.\n\nResponse: After a hero is declared as a defender, add Dori's defense to the chosen hero's for this attack. Any damage dealt by this attack is assigned to Dori. Limit once per round.\n\nI think allowing the boost to last all round or phase could be abused by stacking readying on your defender. I think the fact that Dori needn't exhaust justifies this. I also didn't want him to help with Battle questing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608228","commentId":3608228,"userName":"PocketWraith","timestamp":1548868183,"content":"> On 1/27/2019 at 1:00 AM, Wandalf the Gizzard said:\n> \n> After playing each quest multiple times, I was somewhat disappointed. I have a bold statement to make: HEIRS OF NUMENOR IS NOT THAT HARD! I concede that its three quests are much harder than most others that I've played,\n> \n> *snip*\n> \n> Or did I just mis-perceive how our fine community looks at this expansion?\n\nSo, you concede that the quests are much harder than most others you've played, but you don't think it's that hard?\n\nYes, I think you've mis-perceived how the community looks at the expansion. Ultimately, a lot of the perception of HoN has been passed on from people who got it when it was new. Viewed in the context of all the quests that exist now its difficulty level isn't so ridiculous, but compared to the two cycles which came before it it was a significant difficulty spike which came as quite a shock. And on top of the increase in difficulty it also turned traditional questing on its head with Battle and Siege, thus invalidating a lot of tried-and-true decks. Some people may have been so put off that they never went back to those quests, in which case the first impression becomes the only impression, while others even if they have revisited the quests may not have done so enough for greater experience to overcome their initial feelings based on that first impression. Hence a lot of the reputation. It doesn't help that the need to handle Battle and Siege questing restricts deck choices or pushes you to custom-building, which further discourages revisiting the quests.\nEven on more careful consideration the difficulty of the HoN quests is a bit out of whack - in the first two cycles there were some truly brutal cards but the encounter decks were so bloated that a lot of the time you wouldn't see them, or would see them once in a game, and it'd probably be OK. For HoN the designers had figured out it was better for the encounter decks to be tighter and more consistent, but some of those brutal card designs still remained as vestiges of the old ways (Collateral Damage, Watcher in the Wood, Orc Assault, etc) - only with the decks being more consistent now those brutal cards were much more of a constant problem (at least in multiplayer), which contributes to the feelings of unfairness.\nAnd all this is also precisely why new players are still warned against HoN. If, at the most extreme end, they're coming straight from the Core Set, then they'll have an even worse shock at the difficulty spike (EfDG notwithstanding), and without additional experience of the game they probably won't be able to easily figure out what to do. Also a limited card pool makes all problems in this game harder to solve. While the difficulty is manageable, the skill required to manage it (in both deckbuilding and playing the game) is usually only found in people with enough experience of the game not to be considered 'new' any more."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608421","commentId":3608421,"userName":"Wandalf the Gizzard","timestamp":1548877196,"content":"Your post got me thinking, @PocketWraith [https://community.fantasyflightgames.com/profile/238953-pocketwraith/]. I think maybe part of the reason I was surprised by the lack of difficulty is that I had braced myself for it. Unlike the community when HoN was released, I anticipated extra difficulty.\n\nI misspoke and exaggerated slightly when I said HoN's quests were \"much harder\" than the others I've played. My main point was that I understood that they are still difficult quests, even if they aren't nearly as anticipated/as hard for me.\n\nGreat point on the encounter decks' consistency and density of stronger cards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608649","commentId":3608649,"userName":"TwiceBorn","timestamp":1548889533,"content":"> 3 hours ago, Wandalf the Gizzard said:\n> \n> Your post got me thinking, @PocketWraith [https://community.fantasyflightgames.com/profile/238953-pocketwraith/]. I think maybe part of the reason I was surprised by the lack of difficulty is that I had braced myself for it. Unlike the community when HoN was released, I anticipated extra difficulty.\n> \n> I misspoke and exaggerated slightly when I said HoN's quests were \"much harder\" than the others I've played. My main point was that I understood that they are still difficult quests, even if they aren't nearly as anticipated/as hard for me.\n> \n> Great point on the encounter decks' consistency and density of stronger cards!\n\nJust for the fun of it, give Into Ithilien another try in progression mode with the pre-errata Blocking Wargs. It's definitely beatable, as many here have done it, but I'm just curious to see if your own personal experience would change significantly.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608715","commentId":3608715,"userName":"Halberto","timestamp":1548893472,"content":"> 9 hours ago, dalestephenson said:\n> \n> I really like Dori with Grimbeorn.  Actually, I think Dori already is a solid multiplayer card.  He can handle some early sentinel defense and after getting banged up can turn half the heroes in existence into solid defenders.  I've played a lot of Dori fellowships, and being able to provide Beregond-level defense without Beregond -- or provide 6 defense out of the gate with Beregond -- shouldn't be underrated.  If Beregond didn't exist, I think Dori would be a very popular multiplayer hero.\n> \n> Now since Beregond does exist (in two versions, yet) he might still be below average for all heroes, and I don't think he'd be overpowered if he lent his defense for the whole phase, and/or had an action instead of a response and/or was able to help out allies as well as heroes.  And using two heroes for defense hits hard in one-deck solo unless you pair him with Grimbeorn.\n> \n> I think he's more useful than the post-errata Hama.\n\nPost errata Hama is really downgraded. I don't see many reason to play him anymore outside thematic deckbuilding. His trait make him below the avg tactic attacker hero and the needed ability don't compensate it anymore. But that's life.\n\n \n\nI see your point on Dori maimly in 3/4 multiplayer game and especially with boss level enemy early on. But generally speaking there are better option for defence both in sphere and offsphere. Beregond leads the list obviously.\n\nHowever in specific quest where the \"lost\" action matters less than the stat boost I see his value. But in most case if you just want to replace him in a deck you can find superior alternatives. More so in solo or 2 players game. \n\nBut I agree that when you try him  you realize he is better of what he is generally credit of."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608734","commentId":3608734,"userName":"dalestephenson","timestamp":1548895500,"content":"Beregond is better, flat out.  By himself he provides rock solid defense and a single Gondorian Shield gets him to six.  He costs the same as Dori, but Dori needs another hero's help to provide Beregond-level potential.  It's no wonder Dori is unpopular.\n\nBehind Beregond is a host of 3 or 2 defense heroes that can provide Beregond-level defense with the right attachments -- or with Dori's help.  Unlike an attachment, you can guarantee 4-5 defense with dozens of heroes, when combined with Dori.  Some of these heroes want to defend, so having Dori around enables them to do that safely, even against big hitters, from turn one if necessary.\n\nDori's not really a defensive option per-se, although he has sentinel and can take some emergency defenses.  He's more of a living, transferrable, +2 defense exhausting attachment that doesn't take a restricted spot and is always in your starting hand (and can be readied).  With only three hero slots, that's a hard luxury to afford.  With six heroes, I think it opens up a *lot* of heroes as dedicated defenders.  With 3-4 players it's very likely he'll be useful.\n\nIn the role as living attachment, he has no hero peers [except Galadriel w. Nenya, though willpower is linear, unlike defense].  Other defensive options in Tactics aren't really competing with Dori, because they don't do they same thing -- and they can't compete with Beregond defensively either unless they have Dori's help.  Beregond aside, there's only three Tactics heroes who have abilities related to defense, Beorn, Grimbeorn, and Na'asiyah.  Beorn unfortunately can't use Dori, which is too bad because no hero needs him more.  Grimbeorn works beautifully with Dori, allowing him to defend for five and attack for effective five, for the cost of a resource.  Dori can pump up Na'asiyah to 4, saving her a resource.  (In addition, Theoden is sentinel, but with 2 def, 3 wp, and 3 attack is using his weakest stat to defend.  Dori makes him a 4/4 sentinel defender.)\n\nConsider this -- there's two allies that can boost your defense, Arwen (+1/sentinel) and Rosie (+2 defense without wp boost, restricted to Hobbit heroes).  Those are arguably the two best allies in the game.\n\nEdited January 31, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608745","commentId":3608745,"userName":"Wandalf the Gizzard","timestamp":1548896341,"content":"@TwiceBorn [https://community.fantasyflightgames.com/profile/191067-twiceborn/] Progression Style is actually the only way I've played Into Ithilien, but I'll certainly give it a go sometime with pre-errata Blocking Wargs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3608909","commentId":3608909,"userName":"Amicus Draconis","timestamp":1548910235,"content":"Dori's weakness is, that he only works for one attack unlike Arwen and Rosie, who buff for the whole round or phase. On the other hand though if his buff lasted for the whole round, it would be rather overpowered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609259","commentId":3609259,"userName":"ColinEdwards","timestamp":1548946103,"content":"Rosie and Arwen are powerful because they contribute to both questing and defence. (They would both be solid without boosting defence.) \n\nA 10 threat hero compares unfavorably to 2-cost ally, even a good 2-cost ally, is not exactly a strong recommendation. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609360","commentId":3609360,"userName":"dalestephenson","timestamp":1548950781,"content":"Rosie and Arwen are good value questing allies at 2 wp for 2 cost, but there's quite a few allies that can do that, especially in spirit (Arwen's sphere).  What makes Arwen so special is her defensive buff.  On Rosie's side, the ability to add her willpower *after* staging is what makes her special, much more than adding two marginal willpower, but that only has value because of her ability to buff combat instead.\n\nI'll admit that Rosie's ability compares favorably to Dori's *if* you have Hobbit heroes used in combat. But there's no shortage of 2-cost ally abilities that would be better than the abilities some heroes actually have, and no shortage of heroes that routinely quest or attack for 2 just like some 2-cost ally does.  If a treachery forces you to discard a character, you aren't going to toss Dori to keep Rosie or Arwen-ally around.  1/2/2/5 isn't my favorite stat distribution for a defender, but the fact that Dori *can* defend on his own and survive, unlike Rosie and Arwen, is certainly worth something.  So is the fact that Arwen's defensive boost can't be bumped at all, Rosie's is difficult to boost, and Dori's is easy to boost.\n\nI missed another ally buffer; Kahliel's tribesman exhausts to give another Harad character +1/+1/+1.\n\nI really wish Dori's ability could contribute the defense for the whole phase, rather than being tied to a specific attack.  I don't think he would be overpowered with that change.  But if you haven't tried him, he's easy to underrate."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609385","commentId":3609385,"userName":"ColinEdwards","timestamp":1548951641,"content":"> 13 minutes ago, dalestephenson said:\n> \n> If﻿ a treachery forces you to discard a character, you aren't going to toss Dori to keep Rosie or Arwen-ally around﻿. \n\nI think I would pitch Dori 100% of the time before I would pitch a sword-thain Rosie or Arwen..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609396","commentId":3609396,"userName":"ColinEdwards","timestamp":1548952097,"content":"> 19 minutes ago, dalestephenson said:\n> \n> I﻿ really﻿ wish Dori's ability could contribute the defense for the whole phase, rather than being tied to a specific﻿﻿ attac﻿k﻿﻿.\n\nI really hope Spirit Dori's ability will be \"exhaust Dori to cancel X damage, where X is equal to Dori's defence\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609425","commentId":3609425,"userName":"dalestephenson","timestamp":1548953020,"content":"A sword-thained Rosie or Arwen is now a hero, not an ally (and no longer just 2 resources in cost).  There's a lot of sword-thained allies that could potentially be more valuable than the heroes they came with.  However, I certainly wouldn't take either, when sword-thained, over Dori 100% of the time -- just sphere considerations alone could dictate a different choice.  Rosie's more likely to be picked over a starting hero, since the whole point of sword-thaining her is to buff her willpower and give her readying effects.  Arwen doesn't really benefit from being a hero like Rosie would."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609451","commentId":3609451,"userName":"ColinEdwards","timestamp":1548953955,"content":" \n\n> 11 minutes ago, dalestephenson said:\n> \n> A sword-﻿thained﻿ ﻿﻿﻿﻿﻿Rosie or Arwen is now a hero, not an ally (and no longer﻿ just 2 resources in cost﻿)﻿\n\nYes... But it's a meaningless comparison otherwise, the resource generation is the deciding factor not the other ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609489","commentId":3609489,"userName":"dalestephenson","timestamp":1548955591,"content":"Fair enough.  But part of the reason that Arwen and Rosie are so awesome is because they are 2 resources in cost.  So let's look at it the other way:\n\nSuppose Dori with his 1/2/2/5 stats and his exact same ability were in form of a 2-cost tactics ally.  Would Arwen and Rosie be \"better\"?  I think you'd find Dori would be *way* more popular and would be considered ridiculously overpowered.\n\nSuppose 2/0/0/2 Rosie and 2/0/1/2 Arwen with their amazing abilites were 10-threat heroes.  Would Arwen and Rosie be considered \"better\" than Dori?  Both would be considered hideously overpriced for what they provide, and Rosie's high threat works directly against the Hobbit decks she wants to be in.\n\nSuppose 2/0/0/2 Rosie and 2/0/1/2 Arwen with their amazing abilities were 4-threat and 5-threat heroes.  I think they would be *much* more popular than Dori.\n\nYou can't remove the cost from the equation.  Arwen and Rosie are popular, Dori is not.  But that's *because* they are 2-cost allies instead of 10-threat heroes.  If you take out cost considerations, I question whether they really are better, even though Rosie's ability itself is more powerful."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609695","commentId":3609695,"userName":"Halberto","timestamp":1548965006,"content":"Cost / treath and card tape (hero/ally) cannot be left outside the evaluation.\n\nSure, the ability can be rated in itself but in the real game life experience those elememts are pivotal in defining which cards end up being  played. \n\nStill Dori in some circumstances can be a real toolkit hero to solve the puzzle posed by some specific quests "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3609982","commentId":3609982,"userName":"ColinEdwards","timestamp":1548978604,"content":" \n\n> 6 hours ago, dalestephenson said:\n> \n> Suppose Dori with his 1/2/2/5 stats and his exact same ability were in form of a 2-cost tactics ally.  Would Arwen and Rosie be \"better\"?  I think you'd find Dori would be *way* more popular and would be considered ridiculously overpowered.\n\nI think you are just confusing yourself now ... if there was a 2 cost ally with 1-2-2-5 stats, that'd be an awesome ally - WITHOUT considering his ability - that's not a useful thing to consider when trying to evaluate how good the ability is.\n\nIf there was an Arwen hero with the same stats/threat as the existing Arwen hero, but with her ally skill, I think she'd still see a LOT of play, (which is saying a lot, since Arwen is among the best hero's in the game.)\n(Rosie is already very powerful with sword thane; giving her hero status out of the box would be very popular.)\n\nThe real failure of Dori is that there is no synergy in his abilities. You have to hold him - and someone else - back if you are going to defend. If you are using him to boost, you aren't defending with him... so his stats are a waste.  Arwyn/Rosie both help you quest or defend (or in Rosie's case: attack). No matter what you do with Dori - you are wasting his ability or some of his stats."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610019","commentId":3610019,"userName":"dalestephenson","timestamp":1548981292,"content":"Abilities don't exist in a vacuum.  I wasn't pushing back against the idea that Rosie's *ability* isn't better than Dori's.  Certainly Rosie's ability is better than Dori's assuming Hobbit Heroes are involved in combat, it's considerably more flexible and lasts for the whole round.  But that's not the same as Rosie being better *as a character* than Dori.  Rosie's got her ability, and it's a really terrific ability.  But when she's not using her ability she's a 2 wp quester, and 2/0/0/2 has less value than 1/2/2/5 sentinel.  Yes, if a 2-cost ally is more valuable than a hero, that says bad things about the hero.  But they aren't, even though there's a lot of allies that have abilities that would be *really powerful* if they were on heroes instead.  Think of Guardian of Esgaroth or North Realm Lookout powers on a hero.\n\nYes, Arwen with her hero stats and her ally ability would be very powerful and popular.  It's a terrific ability.  But with ally ability and ally stats, she wouldn't be popular at ten threat, and if you're claiming that Arwen + Sword Thain is better than Dori 100% of the time, I disagree.  Rosie as a hobbit hero with the same ability would be very popular, but ten threat would take a lot of the attraction away.\n\nDori's a 1-wp hero without a questing-related ability.  Reserving him for combat isn't wasting him, it's the natural fate of combat-related hero.  But if you have combat, it's unlikely to be wasted.  He can defend across the table, he can help another hero defend anywhere on the table, and he can attack if he's not needed for defense.  Of all the 2-defense heroes in the game, Dori is the one hero who's *least* likely to waste that stat, because he can still put it to use when he's too banged up to keep defending himself.  And he can keep other 2/3 defense heroes in the defensive game far longer.\n\nI really think Dori's ability should have been better, but the flaw in Dori isn't that his ability is bad or useless.  He's got extraordinary flexibility, and in quests with boss fights (a large chunk of them) he gets you to tower defense much faster.  The big problem is Beregond providing 4 defense for the same threat cost, 6 defense with a single 1-cost attachment.  You don't need to use two hero actions to set some up 4+ defense because Beregond will do it himself.  If Beregond (and now Spirit Dain) didn't exist, I think you'd see a lot of Dori fans, because strong hero defense out of the gate is really, really useful in helping you build your board state."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610064","commentId":3610064,"userName":"Authraw","timestamp":1548984889,"content":"Another thing to consider is that a lot of us play primarily in solo, and cards that work best in multiplayer often get overlooked in that context. I think Dori falls into that category.\n\nWhen I build a solo deck, I often break it down into 3 things:\n\n1. How will I quest successfully? \n\n2. How will I handle enemy attacks?\n\n3. How will I clear enemies from the board?\n\nDori is clearly meant to help solve #2, but he can't do it by himself. Furthermore, if I'm planning to use Dori effectively, my answer for #2 is almost certainly \"a hero defender other than Dori\". That locks down 2 of my 3 hero choices just answering question #2, leaving me with only one hero slot remaining to answer questions #1 and #3.\n\nThat doesn't mean that you can't do it, of course. Grimbeorn is pretty compelling since he answers #3 as well, leaving your final hero slot to help you answer question #1 (although you'd still have to get clever with your questing in a majority Tactics deck, but I digress). \n\nAnyway, my point is that Dori is pretty difficult to build around in a solo environment, which is likely to hamper his reputation even further. See also: Tactics Brand Son of Bain. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610367","commentId":3610367,"userName":"ColinEdwards","timestamp":1549025325,"content":"Brand, Bilbo and Dori rocking and wrecking their way through Rhovanion? \n\nThe deck you want to see someone else at the table play? Or if you see that do you groan and quietly put the nightmare cards back into the box?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610398","commentId":3610398,"userName":"dalestephenson","timestamp":1549027528,"content":"I don't play nightmare, which may skew my perceptions, but it very much depends on what deck I'm running.  Do I have a potential hero defender for Dori to buff?  Do I have a character I want Brand to be readying?\n\nOne of my earliest Dori fellowships had both Brand and Dori (of course) in it, Dori and the Rings:\n\nhttps://ringsdb.com/fellowship/view/113 [https://ringsdb.com/fellowship/view/113]\n\nDori, TaBrand, TaLegolas were on one side in a mono-tactics deck that didn't really want to engage enemies, with Gandalf/Galadriel/Elrond on the other side.  With those three there's practically always someone worth readying with Brand; Elrond to use Vilya, Galadriel to use her power, Gandalf to use Word of Command.  Gandalf and Elrond are both potential targets for Burning Branch and first class defenders with Dori's help.  Subbing in Bilbo for Legolas gives me less initial killing power, but also gives my Three Rings deck more card draw.  Yes, I'd be happy to see that lineup on the other side of the table if I'm running three rings.\n\nOn the other hand, if I'm bringing my Beorn's Path descendant deck of SpEowyn/Thalin/TaGimli, seeing Dori/Bilbo/Brand on the other side of the table doesn't do much for me.  Unless there's multiple enemies out, Brand's ability doesn't help me much, and while TaGimli could be a good defender with Dori's help, I really want him killing things instead.  Getting more cards with Bilbo would be welcome, though.\n\nThe main issue is that in multiplayer, you'd typically rather see Beregond to do defending for you rather than Dori to help you defend.  OTOH, if I'm running Spirit Beregond, having Dori around as a back up defender or (if not needed for an extra defense) someone who can make sure my ability triggers wouldn't be a bad thing.  There's a number of quests that having Beregond + Dori on turn one can make much easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610412","commentId":3610412,"userName":"Amicus Draconis","timestamp":1549029191,"content":"> 21 hours ago, dalestephenson said:\n> \n> So is the fact that Arwen's defensive boost can't be bumped at all, Rosie's is difficult to boost, and Dori's is easy to boost.\n\nUnless I am missing something, Arwen's ability does stack. So with cards like Spare Hood and Cloak, Elwing's Flight, Tale of Tinúviel, To Arms! (all Spirit), Grim Resolve, Ever Vigilant, A Very Good Tale or Strength of Arms (all Leadership) you can ready her and exhaust again. Just be sure to not give her Valiant Determination."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610708","commentId":3610708,"userName":"dalestephenson","timestamp":1549042852,"content":"Good point, her boost is fixed, but it's not limited for how often she can use it.  Of all the readying effects to get double duty out of Arwen-ally, Spare Hood and Cloak is best because it gives her a handy way to exhaust again.  Readying her with Ever Vigilant after she quests won't help you if you have to wait for player attacks to be able to exhaust her again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3610726","commentId":3610726,"userName":"Amicus Draconis","timestamp":1549043990,"content":"Well, she could target herself twice and defend as a sentinel with 3 defence after questing. Maybe add in an Elven Mail, a Cloak of Lórien and an Ancestral Armour. Though whether this is practical is another question."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3611996","commentId":3611996,"userName":"Seastan","timestamp":1549181801,"content":"I agree as mentioned previously that the problem with Dori is Beregond. In almost every case, swapping out Dori for Beregond would be a straight upgrade to the deck. So the main reason to run Dori is because someone is already running Beregond. But this means that in solo, almost every viable Dori deck is going to be Beregond/Dori/Questing hero.\n\nSo he's not useless, but from a solo deckbuilding perspective he is pretty restrictive and boring. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612093","commentId":3612093,"userName":"dalestephenson","timestamp":1549200921,"content":"I would widen the possible viable solo decks to Quester/Defender/Dori -- Grimbeorn is probably the best choice out there, but Dori might pair well with any of the heroes who are lesser defenders than Beregond (without Dori's help) but have their best stat in defense.  For example Quester/Eleanor/Dori might be more interesting, if less powerful, than Quester/Eleanor/Beregond.  Either version of Dain, Erkenbrand, both Denethors, Fastred, LeGimli I question whether the deck would necessarily be better (or more fun to play) with a Beregond instead of Dori -- though in all those cases swapping Dori out for an attacking hero probably would make the deck better.\n\nI think Dori is best for solo two-handed play, because without other players involved there's no moral obligation at all to field the most efficient deck possible, and I think Dori's more fun to play than Beregond."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612209","commentId":3612209,"userName":"Seastan","timestamp":1549213843,"content":"I had thought about it, but no I still I think Quester/(3 defense defender)/Beregond is a better deck than Quester/(3 defense defender)/Dori. I value the ability to start off the game defending for 3 and 4 more highly than defending once for 5 (or twice for 3 and 2), especially since Beregond will quickly get to 6."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612247","commentId":3612247,"userName":"Wandalf the Gizzard","timestamp":1549217840,"content":"If it's not too much trouble, could you guys continue the Dori conversation in another thread? It's helpful and interesting, but mostly off-topic. Thanks! :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612248","commentId":3612248,"userName":"dalestephenson","timestamp":1549217962,"content":"It's quite possible that a Quester/(3 defense defender)/Beregond is a better deck in general than a Quester/(3 defense defender)/Dori.  Beregond's so darn good he's tough to beat when it comes to defense, but I was addressing viability rather than best possible -- and also the more subjective question of \"interesting\", which matters more than power level for one-deck play since there are no other players to affect.  What I like about Dori is that he can turn a lot of heroes into my primary defenders, whether it's a counterattacker like Grimbeorn, or attack/defense heroes with a Destrier, or a 2+ defense elf with Light of Valinor, or defenders like Fastred or LeGimli that *want* to defend but start with inadequate defense to do it regularly.  Not terribly efficient in a solo deck without someone readying -- but for that matter, a Quester/(3 defense defender)/Beregond solo deck is usually going to be inferior to a Quester/Attacker/Beregond deck.  The superiority of an attacking hero to a backup defender is the big reason Dori isn't popular for solo decks in the first place, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612249","commentId":3612249,"userName":"dalestephenson","timestamp":1549218068,"content":"Sorry for the topic drift -- although to be fair, Heirs of Numenor quests are *excellent* for defense-minded heroes.  Siege questing for the win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612305","commentId":3612305,"userName":"Seastan","timestamp":1549222659,"content":"Back on topic: for me Heirs of Numenor doesn't pack the punch it once had, but I think it's more due to my own improvement at the game and experience with those particular quests rather than having an expanded cardpool. I've gone back and played the quests in minimum purchase mode (using cards just from Core+HoN) and beaten them without too much trouble, whereas when I first played the quests I found them challenging even with a much bigger pool of Core+Mirkwood+KD+Dwarrowdelf+HoN."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612355","commentId":3612355,"userName":"GrandSpleen","timestamp":1549226160,"content":"Heirs of Numenor hit me like a ton of bricks when I first played it, which was at release, playing 2-player.  However, my experience seems to be different than others at the table here.  I considered and still consider Peril in Pelargir the easiest of the bunch and the one I'm most likely to come back to from time to time.  Into Ithilien was absolutely brutal for me, after my one win against it I did not come back to it for a very long time.  The next time I did, it was a 5 player game (yes 5) and we got trounced in 1 or 2 rounds.  Haven't played it since.  Siege of Cair Andros was the most interesting for me mechanically and my win was satisfying, it was very hard and took many attempts, but fewer than Into Ithilien.  I won with pre-errata Thror's Map trickery, I haven't come back to it since then, so it's been years and I haven't beaten it with the card pool as it currently exists.   (Same for Carn Dum actually, I relied upon pre-errata Boromir to win and I haven't returned to it since)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612503","commentId":3612503,"userName":"Wandalf the Gizzard","timestamp":1549243060,"content":"That's really interesting! how/why did you manage five? :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612512","commentId":3612512,"userName":"GrandSpleen","timestamp":1549243691,"content":"On occasion we end up with 5 people coming in for a LotR night, and several of us want to play together rather than split into groups, so we end up with 5. Works OK with some scenarios and not OK with others.  On the evening occasion we were actually having a get-together at my place and doing LotR as a drinking game, so we did 5 player games all night."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612739","commentId":3612739,"userName":"ColinEdwards","timestamp":1549276184,"content":"> 15 hours ago, Seastan said:\n> \n> Back﻿ on topic: for me Heirs of Numenor doesn't pack the punch it once had, bu﻿t﻿ I think it's more due to my own improvement ﻿at ﻿the game and experience with those particular quests rather than having an expanded cardpool. \n\nMy experience is that HoN benefits from decks specifically constructed to beat each missions; the battle and siege keywords can wreck a lot of generically decent decks.\n\nWhat we did (originally) was play the mission on easy with whatever decks we had, then come back for the next session with decks designed to beat the mission. (We played two missions per session: the old mission on normal, the 'new' mission on easy.) That really helped push our deck building skills.\n\nThis thread has really encouraged me to go back and try it again with two games a session, doing normal / nightmare this time.\n\nEdited February 4, 2019 by ColinEdwards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3612785","commentId":3612785,"userName":"Halberto","timestamp":1549282868,"content":"This discussion make me want to go back to HoN and try it again progression stile (with no blocking warg errata) and see if present I find Into Ithilien still crazy difficult. \n\nI have improved a lot as deckbuilder and player since then but still..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3613295","commentId":3613295,"userName":"Wandalf the Gizzard","timestamp":1549313636,"content":"> On 1/30/2019 at 6:05 PM, TwiceBorn said:\n> \n> Just for the fun of it, give Into Ithilien another try in progression mode with the pre-errata Blocking Wargs. It's definitely beatable, as many here have done it, but I'm just curious to see if your own personal experience would change significantly.  \n\nOkay, so I've played quite a few progression style games of Into Ithilien with pre-errata Blocking Wargs now. It certainly did make the quest significantly harder, but not enough to change my stance. I did lose many more games over these playthroughs, but due more to stage-one Mumaks than Blocking Wargs. :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png] It was a good learning experience, though, and I have more insight into Into Ithilien's initial reception."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3613327","commentId":3613327,"userName":"GrandSpleen","timestamp":1549314544,"content":"Maybe it's not that Heirs of Numenor isn't the hardest expansion anymore.  Maybe it still is, but everyone had a perceptual shift and repeated loss is now considered standard so Heirs doesn't seem so hard :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3618883","commentId":3618883,"userName":"Green Leader","timestamp":1549729690,"content":"Has anyone played the Nightmare HoN quests? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3618941","commentId":3618941,"userName":"Authraw","timestamp":1549734274,"content":"> 1 hour ago, Green Leader said:\n> \n> Has anyone played the Nightmare HoN quests? \n\nI did for my blog:\n\nhttps://darklingdoor.wordpress.com/thematic-nightmare/ [https://darklingdoor.wordpress.com/thematic-nightmare/]\n\nWhat did you want to know? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3620274","commentId":3620274,"userName":"Green Leader","timestamp":1549864095,"content":"> On 2/9/2019 at 11:44 AM, Authraw said:\n> \n> I did for my blog:\n> \n> https://darklingdoor.wordpress.com/thematic-nightmare/ [https://darklingdoor.wordpress.com/thematic-nightmare/]\n> \n> What did you want to know? \n\nI was just curious, but thanks for the link to your blog. It looks fantastic. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3927231","commentId":3927231,"userName":"MMOfan","timestamp":1586858571,"content":"The overall gaming fun went from 9.8 to 1.1 in my first dozen plays of this expansion box.\n\nPublishing something that only attracts 2% of the nerds in what is supposed to be a MAIN production line is commercially stupid or silly at best.\n\nPublishing hardcore mode with special small box expansions is smart !, but doing a complete shake up and shedding 90% of your more casual player base who go from the basic box and a few small box expansions and then doing something like this is simply not done, not fun, not commercially smart.\n\nIt is PRETTY clear they managed to roll back afterwards and tried to avoid some of these huge mistakes in the AH LCG with superb different playing difficulties to choose from from the start...\n\nI have this game 9 years now and never stumbled into this Numenor expansion while still having played hundreds of LotR card sessions... All I can say now is that Marvel Champions actually is far smarter and more fun at its start to cater for ALL buying players.\n\nFar more designers control is a necessity these days and frankly Heirs of Numenor is probably the worst box published in my LCG fandom (LotR, AH, SW LCG and now Marvel Champions).\n\n \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3927284","commentId":3927284,"userName":"EBerling","timestamp":1586874914,"content":"As a counterpoint, I love the Heirs of Numenor quests, both thematically and mechanistically.  Granted, I haven't been playing that long and I only play Normal non-progression style, but I've enjoyed the box set in both 1-Handed, 2-Player, and 3-Player experiences without directly counter-building decks toward the set (e.g. the Grey Wanderer deck I've taken through HoN was the same deck I took through Mirkwood and Dwarrowdelf)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3927974","commentId":3927974,"userName":"Valhalla Gaming","timestamp":1587034512,"content":"These quests are indeed hard, and frankly the fact they removed power of Mordor from the siege quest in nightmare mode is an admission that the quests had some issues, but personally I really enjoyed the boxes challenge, specifically on nightmare mode. Into Ithilien and siege arent overly complex but still present a challenge which I really appreciated.\n\nAs for the non nightmare version, you can deck build around the encounter and trivialize a lot of the cards, such as usually making the masters malice whiff etc.\n\nI don't envy people who played against the quests at release though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/289839-heirs-of-numenor-dethroned/?do=findComment&comment=3940616","commentId":3940616,"userName":"Vince79","timestamp":1589678424,"content":"> On 1/26/2019 at 8:00 PM, Wandalf the Gizzard said:\n> \n> I have a bold statement to make: HEIRS OF NUMENOR IS NOT THAT HARD! I\n\nI've been going through each scenario in the game in order, and my impression is that each scenario is harder than the last.  That's only a very general tendency, and there are certainly some exceptions (every once in awhile there's an unexpectedly easy one).  But I think there's some truth in there somewhere."}]}