{"url":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/","title":"Do objectives count as player attachments?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/?do=findComment&comment=3610402","commentId":3610402,"userName":"tobbAddol","timestamp":1549028044,"content":"So if I've claimed an objective and attached it to one of my heroes, will it be affected by card texts relating to \"player attachments\"? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/?do=findComment&comment=3610695","commentId":3610695,"userName":"Wandalf the Gizzard","timestamp":1549042302,"content":"It depends on exactly what kind of attachment the card references, and if you actually control the objective/attachment."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/?do=findComment&comment=3610961","commentId":3610961,"userName":"GrandSpleen","timestamp":1549054658,"content":"I think most cards will use the language \"player card attachment,\" and an objective would not count for that.  Do you have an example of a card using other language?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/?do=findComment&comment=3617012","commentId":3617012,"userName":"mewmartigan","timestamp":1549585694,"content":"I recently had a similar question because I was attaching objectives (like an orc prisoner) to Beorn. Beorn cannot have attachments and in the FAQ it seems that once an objective attaches to you, it is treated as an attachment. So as I understand it, I wasn't able to attach objectives (such as the swords from The Three Trials) to Beorn.\n\nSo in reference to your question, if the objective is now treated as an attachment, I would assume it is subject to effects.\n\nHere is the FAQ quote thanks to Wandalf the Gizzard from my previous post\n\nAny objective card that attaches to another card is\ntreated as an attachment in addition to its other card\ntypes.\nAny non-objective card that attaches to another card\nloses its original card type and gains the attachment\ncard type.\nThe “Attach to...” rules text on an attachment is only a\nplay restriction, and is not taken into account after the\ncard is already attached.\nEdited February 8, 2019 by mewmartigan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290197-do-objectives-count-as-player-attachments/?do=findComment&comment=3638385","commentId":3638385,"userName":"DrPeterEnis","timestamp":1551582199,"content":"As you have quoted only non-objective cards (since you are also explicitly mentioning objectives...) lose their previous type.\n\nI'm not too sure it would make a difference even if it wasn't. Every card in the Encounter Deck at the Beginning of the game is an encounter card. Unless a card effect explicitly makes a card count as player card, that card still is an encounter card (I am not aware of any card effect in the game that would do that at the moment). While I am not aware of any card referencing \"player attachment\" I would suspect it beeing an synominous (and wrongly worded) \"player card attachment\".\n\nUnless specifically mentioned, players don't get control over encounter cards, that get attached to their character(s).\n\n \n\nThere are\n\n1) effects that target \"all attachments\", \"one of player x attachments\", etc.\n\nor\n\n2) effects that target \"one attachment player x controls\"  or all attachment player x controls\"\n\n \n\n1) Would apply to Encounter-card attachments (and in case of x attachments you could choose the encounter-attachment) while 2) would not.\n\n \n\n \n\n \n\n \n\n "}]}