{"url":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/","title":"Solo League 6 -- Ringmaker cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3611136","commentId":3611136,"userName":"dalestephenson","timestamp":1549063827,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Voice of Isengard and the Ringmaker cycle. The quests are:\n\n1) Fords of Isen (Deluxe)\n2) Trouble in Tharbad (AP3)\n3) Antlered Crown (AP6)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests -- this means you must have at least one of Tactics Eomer, Haldir, and Erkenbrand.  Grima conflicts with the objective ally Grima from the first quest--but if your heart is set on playing Grima instead of the designated three, I'd be willing to put that up for a vote.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Antlered crown and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Trouble in Tharbad it does not matter how many tokens I needed to defeat Fords of Isen.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker. You are required to reveal which Heroes you used, and how many cards in your deck came from outside VoI/Ringmaker cycle, LR/Angmar cycle and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have mattered in all but one league, though we haven't had a zero-token winner in the last two months. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from VoI/Ringmaker, LR/Angmar or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from VoI/Ringmaker and LR/Angmar. More is better.\n\n3rd) The number of heroes used from this list: TaEomer, Haldir, Erkenbrand (and Grima if we vote to allow him). More is better.\n\n4th) The number of cards in the deck outside VoI/Ringmaker and LR/Angmar. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Voice of Isengard, Trouble in Tharbad, and the Antlered Crown. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in January's Solo League (if you didn't play or finish January's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for April's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in April's league. March's cycle will chosen by Dennis Fitzpatrick, winner of January's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nFords of Isen: February 11th\nTrouble in Tharbad: February 18th\nThe Antlered Crown: February 25th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1rqjjQJ3kkWe7UoFqOK_no9kYQMEB_X2J38A1TMS_a4w/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1rqjjQJ3kkWe7UoFqOK_no9kYQMEB_X2J38A1TMS_a4w/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself.\n\nEdited February 1, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3622088","commentId":3622088,"userName":"dalestephenson","timestamp":1549994969,"content":"The Fords of Isen demands quick questing to get Grima before Stage One goes away.  How many tokens did we need to do that (outside cards listed in parens):\n\n0 dalestephenson (17)\n1 Thanee (38)\n4 Velensk (35)\n7 SkiHorse4848 (10)\n10 redboot (0)\n\nI was the only one who made it through unscathed, as a low-threat Strider deck (thanks, Folco) let Haldir pick off enemies in staging with impunity.  He's much much more useful in that environment than in my Stereotypical Silvan Deck -- even when you can keep enemies in staging, it takes forever to eliminate them without his Bow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3629239","commentId":3629239,"userName":"dalestephenson","timestamp":1550669190,"content":"Trouble at Tharbad is the easiest of the three quest this month (I think), albeit one that plays quite differently than the other two.  My Haldir Strider deck was built for this sort of challenge, but when I attempted it with a Stereotypical Silvan Deck I took a token -- when Galadriel doesn't have Nenya, her ability is pretty useless in this one.\n\nHere's how our official entries did against the quest (outside cards in parens):\n\n0 dalestephenson (17)\n0 SkiHorse848 (32)\n0 Thanee (38)\n1 Gearhead (32)\n2 Velensk (35)\n6 redboot (0)\n\nRedboot was running a Celeborn/Haldir/Galadriel deck; I'm guessing he had bad luck getting Nenya.  He took zero tokens using his Rohan deck.\n\nHere's the standings through the first two quests:\n\n0 dalestephenson (17)\n1 Gearhead (32)\n1 Thanee (38)\n2 SkiHorse 848 (32)\n6 Velensk (35)\n16 redboot (0)\n\nLast quest is the one I think is the toughest; Antlered Crown (though not all our results agree with that).  Deadline is 11 pm February 25th (next Monday), but there's no signup deadline so you can still join and knock out the quests over the weekend.  (Or for those of us who have finished, run another deck for fun -- I've almost finished my second run with the Stereotypical Silvan Deck, beating Antlered Crown with 4 tokens and 2 tokens.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3629675","commentId":3629675,"userName":"Miceldars","timestamp":1550693692,"content":"Ended with only 1 token, I'm happy. I had a good luck on my second run on antlered crown, with 2 elrond's councel in hand, so I could clear the first locations quickly"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3634753","commentId":3634753,"userName":"dalestephenson","timestamp":1551209203,"content":"Here's how we did against the final quest, the Antlered Crown (outside cards in parens):\n\n0 SkiHorse4848 (32)\n1 dalestephenson (17)\n1 Miceldars (28)\n1 Thanee (38)\n2 Velensk (35)\n11 redboot (0)\n\nCongrats to SkiHorse4848 for being the only one to make it through The Antlered Crown unscathed.  And now for the final totals:\n\n1 dalestephenson (17)\n1 Miceldars (28)\n2 SkiHorse4848 (32)\n2 Thanee (38)\n8 Velensk (35)\n27 redboot (0)\n\nAs the winner, I'm going to choose LOTR saga as the cycle for April's league.  Miceldars can choose a quest from that set to play, and SkiHorse4848 can choose a quest to exclude.  Redboot can choose another cycle to use as a supplement for player cards.\n\nThank you for playing, and I hope to see you next month as we take another crack at the Angmar Awakened cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3636052","commentId":3636052,"userName":"gearhead","timestamp":1551322493,"content":"Finished with 2 tokens. I had a bad luck draw that killed the ally in Tharbad. And, in the Antlered Crown, I was overwhelmed my first time by the enemies.\n\nFun run. Thanks again Dale for running this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3644521","commentId":3644521,"userName":"Miceldars","timestamp":1552249974,"content":"Sorry, didn't see you chose LOTR saga.\n\nI didn't play The flame of the west and The mountain of fire yet. I'll choose A shadow of the past."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3644583","commentId":3644583,"userName":"dalestephenson","timestamp":1552255047,"content":"Black Gate Opens was excluded by skihorse4848.  Randomly selecting the other two we get\n\nA Shadow of the Past (from Black Riders)\n\nThe Passage of the Marshes (from Land of Shadow)\n\nShelob's Lair (from Land of Shadow)\n\nA wide selection of possible mandatory heroes: Sam, LoPippin, Fatty, TaMerry, Damrod, LeFaramir.  Fellowship Frodo does not count as a mandatory hero, though as all three are Frodo quests we could mandate the same Frodo must be used for each -- or we could just use the Black Riders Frodo for the first quest and the Land of Shadow Frodo for the other two.  What do you think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3644783","commentId":3644783,"userName":"Miceldars","timestamp":1552288070,"content":"I prefer to let each player choose a Frodo and use it for all three quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3651729","commentId":3651729,"userName":"dalestephenson","timestamp":1553044295,"content":"Redboot has chosen HN/Against the Shadow for supplemental player cards in April's league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290237-solo-league-6-ringmaker-cycle/?do=findComment&comment=3651804","commentId":3651804,"userName":"Vermithrax","timestamp":1553053793,"content":"I really hope I can make the 8th one happen.  I’m only to Helms Deep in the sagas. I’m going to try and get through Land of Shadow before this starts in what - two weeks?\n\nEdited March 20, 2019 by Vermithrax"}]}