{"url":"https://community.fantasyflightgames.com/topic/290200-rules-text-and-in-play-cards/","title":"Rules text and in play cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290200-rules-text-and-in-play-cards/?do=findComment&comment=3610450","commentId":3610450,"userName":"Alonewolf87","timestamp":1549032098,"content":"If I am not mistaken there has been a previous ruling (in reference to Beorn hero) that a card ability is in effect only as long as the card is in play, and while cards are in the discard pile abilities no longer works (except for cards like Elven-Light or ally Glorfindel which specifically says differently of course). I am having a little trouble finding it, so I wanted to ask if someone could help me with that.\n\nEdited February 1, 2019 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290200-rules-text-and-in-play-cards/?do=findComment&comment=3610466","commentId":3610466,"userName":"Rouxxor","timestamp":1549032865,"content":"Most of what you are looking must be in the core set rule book or the rules reference. So there is not even need to fetch for an official answer. The following quotes are from the web rule reference.\n\nOut of play areas are anything outside the game hands, decks and discards pile. All the rest seem to be in play areas.\n\nThe precision that must concern Beorn is:\n\n> Quote\n> \n> Card abilities can only be initiated or affect the\n> game from an in-play area unless they specifically\n> refer to being used from an out-of-play area, or\n> require that the card be out of play for the ability\n> to resolve. Play restrictions and permissions are an\n> exception that may affect how a card may or may\n> not be deployed or used.\n\nI also found, about in play :\n\n> Quote\n> \n> Constant Ability\n> A constant ability is any non-keyword ability whose\n> text contains no boldface timing trigger defining its\n> ability type. A constant ability becomes active as soon\n> as its card enters play and remains active while the card\n> is in play.\n\nand\n\n> Quote\n> \n> Only cards in play have their ability.\n> \n> Card abilities only interact with, and can only\n> target, cards that are in play, unless the ability\n> specifically refers to an out-of-play area or element.\n> Card abilities on characters and attachments can\n> only be initiated or affect the game from an inplay\n> area unless they specifically refer to being\n> used from an out-of-play area, or require that the\n> card be out of play for the ability to resolve. Event\n> cards implicitly interact with the game from an\n> out-of-play area, as established by the rules of the\n> event cardtype.\n\n \n\nEdited February 1, 2019 by Rouxxor"}]}