{"url":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/","title":"Have We Sunk to a New Low?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614001","commentId":3614001,"userName":"Felswrath","timestamp":1549381048,"content":"We are now desecrating tombs of our heroes for their gear! In this current wave we have received Orcrist and now Thorin's Ring. Is this not really disturbing and dark? Now admittedly they are guarded by enemies and locations, so presumably they were stolen by orcs and the likes. Which begs the question: What have the dwarves of Erebor been doing? Why has the King Under the Mountain's casket been stolen and the possessions buried with him drifting around Middle Earth? It bothers me leastwise! "},{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614059","commentId":3614059,"userName":"dalestephenson","timestamp":1549384706,"content":"Thror's Ring was taken from Thrain by Sauron in the dungeons of Dol Goldur -- my hat's off to the orcs that managed to whisk that away from the Lord of the Rings!\n\nI'm also impressed with them managing to whisk Glamdring away, though as easily as Pippin managed the Palantir it may not be as hard to rob a wizard as I thought."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614125","commentId":3614125,"userName":"Wandalf the Gizzard","timestamp":1549387630,"content":"I'm also surprised that some Gondorian rangers convinced a Hobbit to bring a pony named Bill to a war. :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png] Get used to creative deck-building from this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614549","commentId":3614549,"userName":"Amicus Draconis","timestamp":1549403247,"content":"I see this as a nod to the Hobbit, where Thorin and Company found Glamdring, Orcrist and Sting guarded in a Troll Cave and the Arkenstone and Girion's Necklace in the Erebor, guarded by Smaug. And if using these items bothers you, think about eagles in Moria, sailing Ents or a Fellowship consisting of Éowyn, Pippin and Balin. The latter died when the Hobbit was 4 years old and Éowyn surely never left Edoras on an adventure prior to the Battle of the Pelennor Fields.\n\nEdited February 6, 2019 by Amicus Draconis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614580","commentId":3614580,"userName":"dalestephenson","timestamp":1549404568,"content":"To be fair, Balin hero is only provided in the Hobbit saga, and the Pippin hero provided outside of the saga (Spirit Pippin) would never be paired with Eowyn.  And there are certainly thematic players who don't use Ents when sailing or Eagles in Moria, or use Balin anywhere outside the Hobbit saga.  Such players are limited in their choices for Siege of Annuminas!  (Eowyn is, I believe, the only hero actually born after Balin died, but only Aragorn and possibly Denethor were born before Thorin died.)\n\nI too think it's likely that Eowyn never had a chance to adventure because she was trapped in Edoras waiting on her uncle.  \"Shall I always be left behind when the Riders depart, to mind the house while they win renown, and find food and beds when they return?\"  But I think it would take less change of timeline to alter Eowyn's fate than (for instance) to make our Hobbit friends want to wander before they left the shire.  As she points out to Aragorn, she has been trained for war.  \"...Am I not of the House of Eorl, a shieldmaiden and not a dry-nurse?  ...I am of the House of Eorl and not a serving-woman.  I can ride and wield blade, and I do not fear either pain or death.\"  Her record bears her out on this, and her 1 attack and 1 defense does her an injustice (though remedied by the ability of her tactics form).  Without knowing how long she was trapped in Edoras, it's impossible to say if the teenage Eowyn had the opportunity to ride, and possibly battle, on the fields of Rohan with her brother."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290434-have-we-sunk-to-a-new-low/?do=findComment&comment=3614829","commentId":3614829,"userName":"Felswrath","timestamp":1549426959,"content":"I understand that things don't always make sense here. I only made it through Ithilien thanks to Treebeard crushing Haradrim! I was just having some fun. I also misread Thror's Ring as Thorin's Ring, so I figured that the heroes had hired Gollum to bite it off Thorin's dead hand or something like that."}]}