{"url":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/","title":"Hi, I’m new","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3620209","commentId":3620209,"userName":"WillisRBC","timestamp":1549854517,"content":"Hi all.  I’m new to the game.  I have 2 core sets and a couple of the saga boxes.  Will I not be able to get the ones that are listed as out of stock?  I know the game has been around for a while, but do we think it has life left?  I saw that they had released the digital version of the game, but I have trouble paying for something I won’t have a physical copy of if the digital game is discontinued.  Made that mistake with the decipher Lotr card game years ago."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3620218","commentId":3620218,"userName":"dalestephenson","timestamp":1549855474,"content":"Reprints have been very slow in coming and sell out quickly, but nothing associated with the game should be considered officially out of print -- and they just printed a huge mass of reprints (some shipping to stores, some still on the boat), so if you're filling out your collection there's no better time than the present and near future.  I think there is certainly at least one more cycle left to be released, we now know all the heroes in the current cycle and the two in the Limited Edition starter were borrowed from a future release.  As long as the game sells well enough and the license is kept, I see no reason for the game to stop.\n\nI can't speak to the longevity of the digital game, but that's a mechanically different game that shares some elements (and re-uses the artwork) from the physical game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3620462","commentId":3620462,"userName":"Wandalf the Gizzard","timestamp":1549893067,"content":"What ^ said! :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]  And welcome to LotR LCG!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3620487","commentId":3620487,"userName":"Onidsen","timestamp":1549894780,"content":"Welcome to the game! She's got a fair bit of life in her yet. FFG will likely keep reprinting until they actually give us a \"game is dead\" announcement, and maybe even after that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3620533","commentId":3620533,"userName":"Durins_Father","timestamp":1549897721,"content":"Welcome to the game, don't worry about things being out of print, a new print run is scheduled this month for at least some cycles of APs, so there will be plenty of content for you to get in the near future. The game has at the very least another cycle to go before the end, and due to its popularity and the other LOTR themed games coming out of FFG, it is unlikely that the game will die soon.\nSo relax and get to know your cards a little. The game isn't the easiest one, but it is a lot of fun once you get the hang of it. If you need community based content to help you, check out this list: https://visionofthepalantir.com/2018/04/08/blogroll-and-community-resources/ [https://visionofthepalantir.com/2018/04/08/blogroll-and-community-resources/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3641040","commentId":3641040,"userName":"987654321","timestamp":1551898555,"content":"Welcome to the game!\n\nA game based on Tolkien's Legendarium, which in practice means Zombie Thorin Oakenshield and some hobbit becoming the Steward of Gondor.\n\nWhen you decide to play a quick game, it will take forever to build your deck and another forever to shuffle it.\n\nThen you will start playing, and it will usually be really difficult, and once you think you more or less control the situation, WHAM! enemies everywhere, impossible threat in the staging area and to top it all off whacky side effects that forbid you from actually doing anything useful while you try to hold the tide for as long as you can and mutter quietly: \"...why?\".\n\nOr maybe you are confortable during the entire game while nothing important happens, slowly adding ever more progress on that massive quest and sincerely hoping that either you get an enemy that doesn't die in one combat phase or end the quest already before you pass out from boredom.\n\nYou can also have the opportunity to explore places in Middle-Earth both heavily explored and barely touched upon by the original lore. But mostly the latter, leading you to pick up your map 80% of the time a place is mentioned.\n\nIn either case, you will decide to visit the website to get an idea of the published materials and...whoa. Now that's a lot of content. Literal years of content. You should expect to get up to date in 2024 or so.\n\nThen comes the deckbuilding options, which at first look massive and hugely varied until you actually start playing and realize that it's much easier than it looks, you just have to put Éowyn with two other heroes and that will be everyting for like three cycles.*\n\nThe community is awesome, especially the blog Tales from the Cards [https://talesfromthecards.wordpress.com], although that one comes with a perk: the blog's writer Ian Martin takes as much time to publish new stuff as his surnamesake George.\n\nThis game is also responsible for the greatest evil ever created by mankind: Sleeping Sentry. Don't ask what that card does if you value your sanity.\n\nThis game is awesome.\n\n*Although, to be fair, you can literally pick any card in the collection and Seastan will beat The Battle of Carn Dûm with it. And a few monts later that card is guaranteed to be nerfed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3641064","commentId":3641064,"userName":"Nickpes","timestamp":1551900449,"content":"> 30 minutes ago, 987654321 said:\n> \n>  \n> \n> *Although, to be fair, you can literally pick any card in the collection and Seastan will beat The Battle of Carn Dûm with it. And a few monts later that card is guaranteed to be nerfed.\n\n😂 Laughed on this, which is true offcourse"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3641327","commentId":3641327,"userName":"Vince79","timestamp":1551918719,"content":"> On 2/10/2019 at 10:08 PM, WillisRBC said:\n> \n> Hi all.  I’m new to the game.  I have 2 core sets and a couple of the saga boxes.  Will I not be able to get the ones that are listed as out of stock? \n\nWelcome to the game.  I think you will be able to get what you want, as long as you have two things:  patience and alertness.\n\nI've been playing for about six months, and I didn't know if I would be able to get everything I wanted, but as of right now I'm only missing two adventure packs.\n\nI benefited from the recent release of a lot of material around the beginning of the year - I had a feeling they were going to release more stuff after the new year, and they did, even more than I expected.  But as has been said, it tends to sell out quickly so you have to jump on it when it becomes available.  Best of luck to you!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3641937","commentId":3641937,"userName":"General_Grievous","timestamp":1551979183,"content":"Hail and welcome friend! Gondor still holds against the forces of lack of reprints and their rapid selling out of said products.\n\nOk seriously such a good game though, been playing for 6 months, have most of it, and having a blast playing solo, with my wife, or coop as a four player fellowship. Hands down best game of all time. Apparently the rest of the free world agrees with me and it's a good sign that everything is sold out, because it does reprint, but then immediately gets sold out. This game is a sound game and a great money-maker for FFG. And it's nowhere near dying yet. There is at minimum another cycle in the works but we are waiting on thematically the Shire, Wizard, Mordor to make a few. But they have gone to some pretty crazy and obscure places of the map already and hopefully keep doing so for the rest of our lifetimes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290736-hi-i%E2%80%99m-new/?do=findComment&comment=3642015","commentId":3642015,"userName":"alcuin18","timestamp":1551983298,"content":"Welcome to the best card game out there!\n\nSometimes you do have to wait a bit for reprints. I just got Shadow and Flame (Yay Elrond!) and a couple of others I've been waiting on for awhile but all the content is worth playing. I recommend the saga expansions to start with. Great player cards and you can replay the events of the books."}]}