{"url":"https://community.fantasyflightgames.com/topic/290807-saga-question/","title":"Saga Question","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3621660","commentId":3621660,"userName":"Vince79","timestamp":1549963843,"content":"From what I understand, you can play the Saga scenarios as a campaign as well as individually.\n\nHere's my question:\n\nAre the two Hobbit boxes separate from the four LOTR boxes?  In other words, can you start the campaign from the Black Riders box?\n\nIf you complete the campaign of the two Hobbit boxes, is there any carryover into the LOTR campaign?\n\nAre they two separate campaigns, or is it just one big campaign?  Or is each its own campaign (for a total of six)?\n\n \n\nAnd while I'm on the subject, can you mix cards from the Saga boxes in with the Deluxe expansions when building a deck?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3621776","commentId":3621776,"userName":"Hannibal_pjv","timestamp":1549980591,"content":"Yes they are different Saga campaigns. And they do not carry over.\n\nYou may mix them somewhat... But I would not do it. Boon cards can not be used, but some normal player cards yes.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3621851","commentId":3621851,"userName":"dalestephenson","timestamp":1549984143,"content":"There are two classes of saga player cards:\n\n1) Regular player cards that may be used freely anywhere -- these are in the leadership, lore, spirit, tactics, or neutral spheres.\n\n2) Cards tied specifically to the saga expansions -- fellowship sphere and boons for LOTR saga, burglar sphere and treasures for Hobbit saga.\n\nMechanically nothing would break if you used a fellowship/burglar hero and fellowship/burglar cards outside of their sagas, though since the saga-linked heroes have zero threat cost it would be a bit overpowered.  Nothing also would break if you used treasures/boons/burdens outside their sagas, though again it would affect the difficulty substantially."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3621886","commentId":3621886,"userName":"stimpaksam","timestamp":1549985305,"content":"A lot of the Treasure cards from the Hobbit series have since gotten their own player cards that can be used outside of the Sagas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3626100","commentId":3626100,"userName":"Vince79","timestamp":1550284725,"content":"> On 2/12/2019 at 9:09 AM, Hannibal_pjv said:\n> \n> Yes they are different Saga campaigns. And they do not carry over.\n\nWhen you say they are different campaigns, does that mean that each box is a separate campaign?\n\nOr does that mean that there is a Hobbit campaign, and a LOTR campaign?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/290807-saga-question/?do=findComment&comment=3626149","commentId":3626149,"userName":"Kjeld","timestamp":1550291559,"content":"> 1 hour ago, Vince79 said:\n> \n> Or does that mean that there is a Hobbit campaign, and a LOTR campaign?\n\nYes, one campaign for the events of The Hobbit, and one for the events of Lord of the Rings."}]}