{"url":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/","title":"Records Attachments and Discard Pile Events","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3626000","commentId":3626000,"userName":"Levanthalas","timestamp":1550276278,"content":"Hello all.\n\nI have a rules question that I haven't been able to find an answer to. Apologize if I missed another topic that addresses this.\n\n \n\nHow do the \"Record\" attachments (Scroll of Isildur, Book of Eldacar, Tome of Atanatar, Map of Earnil), interact with the events which count copies in the discard pile (Skyward Volley, Elwing's Flight, The Evening Star, Anchor Watch)?\n\nThe relevant text of the record attachments reads: \"Action: Discard <title> to play any <symbol> event card in your discard pile as if it were in your hand. Then, place that card on the bottom of your deck.\"\n\nThe relevant line about playing attachments from the rulebook reads: \"An event card is played from a player's hand, its text effects are resolved, and the card is then placed in its owner's discard pile.\"\n\nThe ambiguity in the description of where event cards are located during their resolution is what leaves me unsure. It is clear that the card is not moved to the discard pile until after its effects are resolved. This leaves two options:\n\nOption A) When the card is \"played,\" it enters a player's play area (or some other non-hand, non-discard pile state). Its effects are then resolved. The card is then moved to the discard pile.\n\nOption B) The card is \"played\" by paying the resource cost, but does not actually move \"locations\" until the card effect is resolved (thus remaining in the player's hand). Then the card is moved to the discard pile.\n\nI see 3 possibilities, depending on if Option A or B is correct:\n\n1) If Option A is true: although the event is actually in your discard pile, when you play it using a Record, it moves out of the discard pile to some other state while its effects are resolved. Then, after resolving the effect of the card, it is placed back in the discard pile. The Record's card text then takes over, and moves the card from the discard pile to the bottom of your deck. This leads to 3 resolutions. All situations leading from Option A end similarly, unless I've missed something.\n\n2) If Option B is true: because you play the event \"As if it was in your hand,\" it explicitly does not count as being in your discard pile during the resolution, and therefore you count as having 2 copies in the discard pile. This also leads to 3 resolutions of the effect.\n\n3) This is the case I am most interested in. If Option B is true, the card is played, and one effect is resolved. The count of identically named cards in your discard pile is then counted. (In this case 3). The effect is then resolved an additional 3 times, leading to a total of 4 resolutions. I find this to be the most interesting possibility, and what I believe makes the most sense IF AND ONLY IF Option B is true.\n\n \n\nI would love to hear anyone's thoughts on this, and especially would love to see any official rulings that make this more clear, as it may affect other \"Discard play\" cards (such as Elven-Light, or others) that I have not thought of yet. If we can't get a consensus, I'll probably submit an official question, but I don't want to do that if there's an obvious answer out there that I just missed.\n\n \n\nThanks for taking the time to read and respond. Sorry for the long post, just wanted to cover the bases and present my thoughts."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3626078","commentId":3626078,"userName":"Wandalf the Gizzard","timestamp":1550282260,"content":"I would rule that the event played from the discard pile would not count itself, since the event is treated as if it was in your hand. Triggering one of those events four times would be really fun, though! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nAs an aside, when an event or treachery is being resolved, it is in a \"limbo\" state (in an event's case, neither in play or in your hand)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3626093","commentId":3626093,"userName":"Levanthalas","timestamp":1550283901,"content":"Is there anywhere you can point me to about the \"limbo\" state's existence? I looked for something like that but couldn't find any specific rule about it. I probably just missed it.\n\n \n\nThanks for the reply!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3626254","commentId":3626254,"userName":"Alonewolf87","timestamp":1550308900,"content":"> 9 hours ago, Levanthalas said:\n> \n> 2) If Option B is true: because you pl﻿ay the event \"As if it was in your h﻿and,\" it explicitly does not count as being in your discard pile during the resolution, and therefore you count﻿ as having 2 copies in the discard pile. This also leads to 3 resolutions of the eff﻿ect.﻿\n\nThis is how it would work in my opinion, but I also learned to not presume much with the rules of this game since I saw a few bizzare rulings."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3626320","commentId":3626320,"userName":"Wandalf the Gizzard","timestamp":1550323467,"content":"> 10 hours ago, Levanthalas said:\n> \n> Is there anywhere you can point me to about the \"limbo\" state's existence? I looked for something like that but couldn't find any specific rule about it. I probably just missed it.\n> \n>  \n> \n> Thanks for the reply!\n\nI doubt you’d find this in the FAQ or Rules Reference. I had a rules question for the developer about a fishy encounter deck combo, and the “limbo” state was part of the answer.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3627010","commentId":3627010,"userName":"player3351457","timestamp":1550448766,"content":"I believe option A needs to be the case. If you try to marry the rules with phase-lasting cards, it seems an effect is triggered and must stay in play until the effects resolve, which would be at the end of the phase.\n\nThings that resolve instantly, such as Galadhrims Greeting, need no clarification. But that might change how we play cards if an event must stay in play until the effects are fully resolved. For example, if you play Elrond's counsel which lowers threat but also gives a +1 willpower boost, you then cannot recycle that card during that same phase, since it is in play until the end of the phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3627101","commentId":3627101,"userName":"sappidus","timestamp":1550458155,"content":"There is an official ruling on this—as pointed out above, the card leaves your discard pile while it is being played via a Record:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3627102","commentId":3627102,"userName":"sappidus","timestamp":1550458350,"content":"> 2 hours ago, player3351457 said:\n> \n> But﻿ that might change how we play cards if an event must stay in play until the effects are fully resolved. For example, if you play Elrond's counsel which lowers threat but also gives a +1 willpower boost, you then cannot recycle that card during that same phase, since it i﻿s in play until the end of the phase.﻿﻿﻿﻿\n\nThis is incorrect. RR Lasting Effects covers the relevant rules.\n\nEssentially, anything with an \"until\" creates a lasting effect that is independent of its source, and the event thus goes to the discard pile right away (rather than sticking around as you posit).\n\nEdited February 18, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3627394","commentId":3627394,"userName":"player3351457","timestamp":1550498189,"content":"> 11 hours ago, sappidus said:\n> \n> This is incorrect. RR Lasting Effects covers the relevant rules.\n> \n> Essentially, anything with an \"until\" creates a lasting effect that is independent of its source, and the event thus goes to the discard pile right away (rather than sticking around as you posit).\n\nThanks for clarifying!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291011-records-attachments-and-discard-pile-events/?do=findComment&comment=3627673","commentId":3627673,"userName":"Levanthalas","timestamp":1550517437,"content":"> 16 hours ago, sappidus said:\n> \n> There is an official ruling on this—as pointed out above, the card leaves your discard pile while it is being played via a Record:\n> \n>  \n\nThanks for sharing the link to that official ruling. I figured it was the kind of thing that had come up before, but I must have missed it on your thread. "}]}