{"url":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/","title":"The Three Trials is bogus in solo","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632323","commentId":3632323,"userName":"mewmartigan","timestamp":1550976587,"content":"It almost isn't worth playing as I know exactly when I am going to lose every time, over and over.\n\nWhen you travel to the Hallowed Circle at the end, each guardian attacks, then the combat phase is next. You have to defend 6 boss level attacks in a row. Then if you don't manage to quest through on the next turn (which requires a minimum of 12), you immediately have to defend 3 more boss attacks.\n\nI'm just skipping over this one for now, maybe I'll look up a custom built deck later. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632329","commentId":3632329,"userName":"Onidsen","timestamp":1550977333,"content":"I find it's much easier to beat if you kill all 3 guardians before you travel to the hallowed circle. Nothing says that you have to travel immediately.\n\nIt does require at least a little bit of building for it, though, especially in true solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632334","commentId":3632334,"userName":"mewmartigan","timestamp":1550977721,"content":"Killing them is probably a good idea but even that will take a few additional rounds. I tried that once and got location locked. Some of the locations in this quest do some unpleasant things too.\n\nEdited February 24, 2019 by mewmartigan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632394","commentId":3632394,"userName":"GrandSpleen","timestamp":1550990087,"content":"This is one of those quests with weird balance issues.  2-player is the sweet spot.  Solo makes the Guardians oppressive -- although Onidsen pointed out a good tactical shift that you seem not to have considered, based on your response.  Try a different strat and let it know if it influences your opinion of the quest's difficulty.\n\n3- and 4-player makes the Guardians less challenging but you have a good chance of getting location locked if your table is not built properly.\n\nAlso, the Time effects are going to nail you more in higher player counts due to a higher chance of revealing that one treachery that reduces them and the fact that, in 4-player, revealing that treachery will automatically trigger any Guardian currently in play, since it will remove 4 time counters.  You might see that come out twice in the same round.  With Raven's Guardian in play, you'll get 1 damage to every character you control every time that card comes out.\n\nThat one location which limits the number of allies you can have will hit much harder in 4-player than it will in solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632409","commentId":3632409,"userName":"John Constantine","timestamp":1550995186,"content":"That's strange, I remember it being one of the easy ones, beating it on my first try."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632606","commentId":3632606,"userName":"mewmartigan","timestamp":1551026720,"content":"I'll probably try a few more times trying to kill the guardians before traveling and not threating out. The time effects will be interesting.\n\nThanks all!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632652","commentId":3632652,"userName":"Vermithrax","timestamp":1551031682,"content":"I remember this one being hard to design solo for.  I had to change my hero lineup several times before I hit on a combination that worked."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3632879","commentId":3632879,"userName":"Halberto","timestamp":1551044785,"content":" I won very consistently in pure solo when it was released with Idraen,  lore Aragorn and Beregond. \n\nBeregond + shield defend the guardian, gondorian fire plus unexpected courage build the attack power you need to kill guardian in 1 hit in the final stage. Aragorn let you draw cards and reset you threat. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3633768","commentId":3633768,"userName":"mewmartigan","timestamp":1551125844,"content":"I figured gondorian fire or blood of numenor would factor into a solo deck somewhere.  😄"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3633784","commentId":3633784,"userName":"Halberto","timestamp":1551126550,"content":"Yes, as boring as they are Fire and Blood solve many puzzle in this game...\n\nIn my defence I must say that I try to avoid them as much as possible. I don't remember to have used any of them after this quest in pure solo (and to defeat the balrog)..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291379-the-three-trials-is-bogus-in-solo/?do=findComment&comment=3634016","commentId":3634016,"userName":"Vince79","timestamp":1551142276,"content":"You know, originally I was irritated with these scenarios that are seemingly designed without the solo player in mind.\n\nBut I realize now there are still plenty of scenarios in this game left, so I'm cool with writing a few of them off."}]}