{"url":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/","title":"Favourite Ally?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638208","commentId":3638208,"userName":"GILLIES291","timestamp":1551555754,"content":"As the title says, who is your favourite ally and why? If it's too hard you can break it up by sphere. But still try to give an overall favourite.\n\nTactics: Eagles of the Misty Mountains - Really wanted to say Boromir or Legolas but honestly these beautiful birds are what makes my favourite play style possible and grow into an amazingly powerful force of nature once a few of their kin join them.\n\n \n\nSpirit: Zigil Miner - when I'm not flying with Eagles I play a lot of Gandalf hero, and these guys are staples of that play, being able to turn your deck that's just sitting there into cold hard cash now! Runner up the new Wild Stallion.\n\n \n\nLeadership: Wiglaf - the newest ally on my list but this guy is quickly climbing to the top. Epic Viking-style art, his high cost is partially offset by being able to get a free item played on him, and once you start putting attachments on him, he becomes better than most heroes. Seriously just add the included-in-the-same-pack Wild Stallion and Ancestral Armor and you have a 3/3/4 hero that can do everything for you, quest, defend and fight. Just awesome!\n\n \n\nLore: Warden of Healing - Really hard to narrow down a single Lore ally, Henamarth, Gleowine, Gildor, and Wellinghall Preserver, wandering Ent, to name a few are all amazing allies, but being able to heal 2 separate damage off of anyone each round is just so awesome for his cost, even better when combined with Elrond.\n\n \n\nNeutral: Treebeard - Gandalf is classic, Saruman is fun, Rangers are good multi-role troops but nothing compares to the awesomeness that is Treebeard, and as much as I love his hero incarnation, this version is actually better. Solid ally that is in every single force I make.\n\n \n\n \n\nOverall my pick for favourite ally has got to be Treebeard, he may not be as flashy as the new stuff, or as classic as the original tried and tested stuff, but dang he sure is tough and a great ally to whatever fellowship I am assembling.\n\n \n\nSo what's yours?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638445","commentId":3638445,"userName":"GrandSpleen","timestamp":1551597977,"content":"Without going and looking at a big list of allies, I can say these:\n\nSpirit: probably Arwen, hard to beat her utility.\n\nLore: Anborn, I like recycling traps.\n\nTactics: Legolas comes to mind for card draw in a sphere mostly lacking it.\n\nLeadership: I think Rosie Cotton takes it.\n\nNeutral: kinda like the Ranger of Cardolan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638458","commentId":3638458,"userName":"lleimmoen","timestamp":1551602007,"content":"Tactics: Boromir (a great design)\n\nLeadership: Faramir (perhaps even more powerful, but I prefer the above, or below)\n\nSpirit: Glorfindel (perfect for Noldor discard, quite powerful elsewhere)\n\nLore: Gildor Inglorion (as above, and even better in Vilya decks)\n\nNeutral: Gandalf (like both versions, and I also like Treebeard, of course)\n\nEdited March 3, 2019 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638474","commentId":3638474,"userName":"dalestephenson","timestamp":1551608084,"content":"Tactics: Honour Guard.  Love that damage prevention\n\nSpirit: Arwen Undomiel, 2 willpower for 2 cost plus defense enhancement\n\nLore: Quickbeam, 2 wp and 3 att for 2 cost. Also love Wellinghall Preservers\n\nLeadership: Redwater Sentry.  Ridiculously good once he gets an attachment.\n\nNeutral: Treebeard -- core Gandalf is great, but Treebead is also great and doesn't go away."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638600","commentId":3638600,"userName":"lleimmoen","timestamp":1551634299,"content":"Of course all these preferences are based on decks, style you play, sometimes, like with me, even the reading favourites. However, I would like to point out this, not trying to detour the thread too far, it is often the allies of cost 2 and 4 (and in extreme 1 and 5) that get mentioned. The 3-cost allies seem far less popular. I remember pointing this out in the second year of the game’s existence, and I think it has not changed much in its 9th year. There are just not many well balanced 3-cost allies, compared to the cheap (2 cost, or less) and strong (4 cost or more). Which is in a way interesting, since you usually play with three heroes. My favourite of those are Meneldor and Orophin, but I am quite sure, had he been released earlier, Meneldor would have cost 4."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638644","commentId":3638644,"userName":"Kjeld","timestamp":1551638913,"content":"> 1 hour ago, lleimmoen said:\n> \n> There are just not many well balanced 3-cost allies, compared to the cheap (2 cost, or less) and strong (4 cost or more). Which is in a way interesting, since you usually play with three heroes. My favourite of those are Meneldor and Orophin, but I am quite sure, had he been released earlier, Meneldor would have cost 4.\n\nA number of excellent 3-cost allies come to mind: Bofur (sp and ta), Wellinghall Preserver, Galadriel, Pelargir Shipwright, Redwater Sentry, Emery, Gamling, Warden of Helm's Deep, Hama, and Azain Silverbeard. Granted, there are a huge number of duds, as well (Bombur, I'm looking at you!)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638658","commentId":3638658,"userName":"lleimmoen","timestamp":1551640741,"content":"I was just looking through the 20 favourites, and guess how many of those are 3-cost, one, the Sentry. And he, just like Meneldor, has come out in the last year. I think they might have finally figured out the formula, but still, this is not a big sample so far, yet one out of 20 is very few, given there are many more 3-cost than say 1-cost and especially 5-cost in the game.\n\nPS. And personally, out of your list, I do not consider excellent many of those, Shipwright and Emery are very situational, basically only mono-Spirit deck allies, Warden, Hama and Azain all seem rather avaerage to me, Spirit Bofur is only good if not played with the 3-cost. I would only rate high the Sentry, Preserver and Galadriel, but still never consider them among those favourites in this thread, and I did consider at least two or three for each sphere.\n\nEdited March 3, 2019 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638665","commentId":3638665,"userName":"GILLIES291","timestamp":1551641459,"content":"That's an interesting observation! And true so far for us haha. Though Wellinghall did get my second place. My wife's favourite ally is Gamling as she plays a lot of Rohan. And another of the girls that plays with us in our couples multiplayer loves the Kili/Fili combo.\n\n \n\nPersonally if we are just saying 3-cost, Beechbone can start to feel like Cyclops from the X-MEN with an Ent Draught attached so he would probably be my favourite 3 cost. But Daughters of the Nimrodel has gorgeous art. Rivendell Minstrell also misses out mentioning but she is amazing with multi-sphere fellowships and decks that rely on key songs like Dunedain/Noldor mashups. Lastly Veteran of Osgiliath is just cool looking and solid for high-threat builds like my Gandalf/Treebeard/Elrond deck.\n\n \n\nBut funny how our no 3 costs made the list this far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638702","commentId":3638702,"userName":"PickleTheHutt","timestamp":1551647022,"content":"Favorite or most powerful? Those answers can differ quite a bit.\n\nNote: I'm playing progression style and just finished Darrowdelf, so my answers only include allies to that point.\n\nMost generally powerful/useful:\n\nSpirit: Arwen (Northern Tracker is amazing but Arwen's cost and utility wins out)\n\nLeadership: Faramir (does Sneak Attack Gandalf count as a Leadership ally? :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] )\n\nTactics: Trollshaw Scout (I love the cheap eagles, but unless you're running an eagles deck, I think this guy is better for killing quickly)\n\nLore: Warden of Healing (just soooo good, see ya never again Daughter of the Nimrodel)\n\nNeutral: Gandalf (obligatory)\n\n \n\nMost fun/favorite (for me of course):\n\nSpirit: Arwen (she really opens up some fun combos that can't be used otherwise)\n\nLeadership: Snowborn Scout (the dude is always willing to die for the greater good)\n\nTactics: Eagles of the Misty Mountains (so much fun to use with the cheap eagles and Support of the Eagles on a hero)\n\nLore: Miner of the Iron Hills (he's not fun on his own, but removing those nasty attachments lets you have fun with your heroes so I'm giving him the nod)\n\nNeutral: Radagast (Eagles, eagles everywhere!)\n\nEdited March 3, 2019 by PickleTheHutt"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638707","commentId":3638707,"userName":"Onidsen","timestamp":1551647439,"content":"Speaking of 3-cost allies, it's interesting to me that nobody has yet mentioned the Rider of Rohan or Grimbold. Both of those are excellent. Other really good 3-cost allies that haven't yet been brought up: Marksman of Lorien, Rhovanion Outrider, Erebor Battle Master, Guardian of Rivendell, Elrond, Guardian of Arnor/Fornost Bowman, Steward of Orthanc, East Road Ranger, Beorning Guardian.\n\nDo any of them make my list of #1 favorite allies? No, but it's close - Rider of Rohan and Rhovanion Outrider are tied for second place for my favorite Spirit ally (Arwen takes the #1 spot hands down, and Wild Stallion is a really good contender too). I think that a simple list of top #1 favorite ally doesn't really give us a good sense of these sorts of things, go.\n\nHere's my list of top 3 in each sphere:\n\nSpirit: Arwen, Rhovanion Outrider, Rider of Rohan\n\nTactics: Honour Guard, Westfold Outrider, Grimbold\n\nLeadership: Snowbourne Scout, Knight of the White Tower, Orthanc Guard (not a good ally, but a really fun one in the right deck)\n\nLore: Gleowine, East Road Ranger, Imladris Caregiver\n\nNote that this list reflects strongly the decks I've been playing recently. Ask me a year ago, and I'd have given different answers"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3638917","commentId":3638917,"userName":"lleimmoen","timestamp":1551688235,"content":"I really like Marksman of Lorien. With Thranduil now, she is even more amazing.\n\nAnd so is Rhovanion Outrider, he was a good ally even before Dale became the thing.\n\nPS. Kudos to the OP for an interesting thread! It is nice to have these every once in a while. And of course we will disagree on issues, that is what makes things worth the debate...\n\nPPS. I have totally forgot to mention ally Beorn so far, he has been my favourite since the day 1. And I have always tried to cheat him in, of course, via Sneak or SaF, then Vilya. Funny now with Skin-changer I don’t because I play that guy in a deck with Beorn hero...\n\nEdited March 4, 2019 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3639122","commentId":3639122,"userName":"Ywingscum","timestamp":1551712617,"content":"Firyal "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3639181","commentId":3639181,"userName":"Vermithrax","timestamp":1551717317,"content":"Depends on the day of the week, the deck i'm playing and the scenario.  \n\nWith that thought in mind I've really been liking Erestor from The Long Dark.  The encounter decks are pretty tuned these days whereas my deck often packs multiple copies of uniques.  These uniques then become dead draws once one is already in play.  Erestor cycles those away to keep tempo.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3639752","commentId":3639752,"userName":"lleimmoen","timestamp":1551778875,"content":"This is an interesting choice, because when he came out I think he was considered quite average, and it was when the stats of many allies were inferior to those today. Yet, I myself do tend to put him in many a deck, and he would have fit the Noldor discard one perfectly, had it not been for Erestor hero version. I still wish they added a point of defense or two points of attack but the ability in Leadership with his decent questing is indeed very valuable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3642887","commentId":3642887,"userName":"Rajam","timestamp":1552067011,"content":"Leadership Faramir\n\nLore Firyal\n\nTactics Yazan\n\nNeutral Treebeard\n\nSpirit Rhovanion Outrider\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3643285","commentId":3643285,"userName":"GrandSpleen","timestamp":1552084070,"content":"> On 3/5/2019 at 1:41 AM, lleimmoen said:\n> \n> This is an interesting choice, because when he came out I think he was considered quite average, and it was when the stats of many allies were inferior to those today. Yet, I myself do tend to put him in many a deck, and he would have fit the Noldor discard one perfectly, had it not been for Erestor hero version. I still wish they added a point of defense or two points of attack but the ability in Leadership with his decent questing is indeed very valuable.\n\nI can’t remember his reception at release, that was right around the time that I started playing, so I wasn’t active in the community. I did however use him in a lot of my decks back in the day, as a solution when a leadership deck ends up with lots of money and no cards to play (common problem). Still would be quite good in a deck running To the Sea and access to leadership.\n\nEdited March 8, 2019 by GrandSpleen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3643579","commentId":3643579,"userName":"lleimmoen","timestamp":1552115305,"content":"Sure, he is great. It is just often that I run the hero version with TtS!TtS!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3643997","commentId":3643997,"userName":"OlorinCZ","timestamp":1552165462,"content":"Leadership: Sam´s beloved - Bill the pony....or Rosie...depends ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]\n\nLore: Imladris caregiver (the best healing in his niche without exhaust, 2 HP,...)\n\nSpirit: Arwen (the most commented here - for me the best ally - art, versatility, +3 stats (2will and 1 defense) fo 2 resources. Only downside is her hero version, who is also excellent) \n\nTactics: Vigilant Dúnadan (My favourite decks are Dunedain and he is the wall of the North) \n\nNeutral: Envoy as most versatile. Ranger of the North as my secreat love. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291700-favourite-ally/?do=findComment&comment=3645017","commentId":3645017,"userName":"Ywingscum","timestamp":1552315197,"content":"My leadership vote goes to Redwater Sentry.  Throw haubrek on him for free and he can tank"}]}