{"url":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/","title":"Guess the New Cycle","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639749","commentId":3639749,"userName":"lleimmoen","timestamp":1551778474,"content":"With the last adventure of this cycle announced, I hope the new cycle announcement cannot be so far off. And given the promise both Thorin Stonehelm and Gildor Inglorion will be released, I assume there shall be another cycle.\n\nSo, the fun times, what are the predictions? As I said elsewhere, I guess, or hope mostly, the two blue wizzards will be in the big box, though they may not be able to name them Alatar and Pallando (I hope I got those right). And perhaps we shall visit the East since we have been to the South already. It seems like the last place to go before retracing our steps...\n\nI have more wishes but I will save them for the discussion (should there be any); one however I will say now: please, let us have Tom Bombadil! The encounter player card seems a perfect fit for him, with a player card (a song, Hey Tom Bombadillo, perhaps) to place it into the encounter deck.\n\nEdited March 5, 2019 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639764","commentId":3639764,"userName":"Jekzer","timestamp":1551780359,"content":"I'm more on the Shire cycle side.\n\nUsually the last or second to last AP give hints about next cycle. And we saw a good amount of new hobbit cards in the 5th AP.\n\nOf course, that doesn't mean this time has to be the same in terms of hints --> announcement, but my bet is in a Hobbit-themed Deluxe and a cycle that goes from he Shire to Barrow Downs and maybe Blue Mountains."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639783","commentId":3639783,"userName":"lleimmoen","timestamp":1551783010,"content":"I would actually like that more than exploring the East. The Haradrim was by far my least favourite cycle. And it would lean more toward Tom Bombadil, though that has little to do with the guess. However, the Angmar cycle already featured heavily in the area but by all means, it is the most described area in the books, so we should go there again, and perhaps more West this time, as you mentioned. The Hobbit theme has been given a nice boost recently and it would be great to get just a few more, especially allies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639860","commentId":3639860,"userName":"dalestephenson","timestamp":1551791992,"content":"I'm guessing Rhun simply from geographical proximity, there's no better jumping-off spot to explore east than from Dale.  Thorin Stonehelm also is adjacent.  But I agree Gildor makes more sense in/around the regions of the shire and we need more hobbits for Tom Cotton play with.  Of course, there's no guarantee that Thorin and Gildor are both drawn from the same cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639863","commentId":3639863,"userName":"Felswrath","timestamp":1551792081,"content":"I would like to see Rhun, but I think the Shire, Blue Mountains, Tower Hills area is more likely. I'm honestly not an expert on the release schedule (I came into the game about halfway through Harad), but I did look up the announcements and releases in that area. The last AP for Harad was announced in January 2017. It was released in December of that year. Wild if Rhovanion was announced in early December 2017 only a couple of weeks before The Crossings of Poros. So it could conceivably be quite some time before we learn about the next cycle. I wouldn't guess any sooner than GenCon. But that's just me. I make no claims of being an expert."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639866","commentId":3639866,"userName":"Felswrath","timestamp":1551792259,"content":"Also, Hobbits could be like Ents and Rohan who have their cards scattered all around as opposed to having dedicated sets. (Voice of Isengard kind of is, but it's honestly pretty Isengard heavy as opposed to being the Rohon Box.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639905","commentId":3639905,"userName":"lleimmoen","timestamp":1551795929,"content":"I do not know when. But in the past it was that the announcements for packs came long before the actual packs, and usually all packs in a cycle were announced before the first adventure was in store. It is different now, and sometimes the pack is already available before the next one is even announced. Some people already had Mount Gundabad before we knew what the name of the last adventure was."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3639985","commentId":3639985,"userName":"stimpaksam","timestamp":1551800512,"content":"Yeah, things have been discombobulated the last few years when it comes to announcements and releases for whatever reasons.\n\nWe could get the next cycle announced anytime between today and Christmas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640021","commentId":3640021,"userName":"stimpaksam","timestamp":1551803002,"content":"To the people guessing The Shire how could they center 9 quests on it? Is The Shire bigger than I'm imagining? I always guessed if they do go there it'll be a POD of the Scouring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640078","commentId":3640078,"userName":"Ywingscum","timestamp":1551807360,"content":"The deluxe box can be the shire, leading into the cycle going elsewhere "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640087","commentId":3640087,"userName":"Wandalf the Gizzard","timestamp":1551807876,"content":"> 1 hour ago, stimpaksam said:\n> \n> To the people guessing The Shire how could they center 9 quests on it? Is The Shire bigger than I'm imagining? I always guessed if they do go there it'll be a POD of the Scouring.\n\nYou always have Eriador, at least what wasn't covered in Angmar Awakened."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640104","commentId":3640104,"userName":"Vince79","timestamp":1551808892,"content":"> 1 hour ago, stimpaksam said:\n> \n> To the people guessing The Shire how could they center 9 quests on it? Is The Shire bigger than I'm imagining? I always guessed if they do go there it'll be a POD of the Scouring.\n\nThe problem with doing the Scouring is that this game supposedly takes place in the time between the Hobbit and LOTR, right?  That kind of takes the Scouring out of it, although I think it would be cool.\n\nI like the idea of a Shire expansion (love it, actually), the only thing is I can't see Hobbits as being very powerful.  So I'm not sure how well it would fit in with the rest of the game.  There would be some Rangers lurking in the shadows, and maybe some Elves passing through, but that's not enough to fix it IMO."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640160","commentId":3640160,"userName":"banania","timestamp":1551811605,"content":" \n\n> 2 hours ago, stimpaksam said:\n> \n> To the people guessing The Shire how could they center 9 quests on it? Is The Shire bigger than I'm imagining? I always guessed if they do go there it'll be a POD of the Scouring.\n\nI read that a lot.\n\nMaking 9 quests out of a ME region is not about size!!\n\nI'm sure it's waaaaaay more difficult to come up with quests theme and ideas in Ered Mithrin, or worst, in place like Forochel.... which may be a thousand times the size of the Shire. Why?\n\nBecause the Shire probably has the most detailed descriptions, map and history of all places in ME. The material there is really consistent. There are so much content to make quests in the Shire, you can't even begin to imagine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640182","commentId":3640182,"userName":"Wandalf the Gizzard","timestamp":1551812571,"content":"> 1 hour ago, Vince79 said:\n> \n> The problem with doing the Scouring is that this game supposedly takes place in the time between the Hobbit and LOTR, right?  That kind of takes the Scouring out of it, although I think it would be cool. ﻿﻿\n\n*cough* saga expansions *cough*"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640184","commentId":3640184,"userName":"lleimmoen","timestamp":1551812678,"content":"Yes. The size here does not matter, plus the Shire would probably be just the beginning."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640230","commentId":3640230,"userName":"dalestephenson","timestamp":1551815554,"content":"Given the peaceful life in the shire, and the sheltered inhabitants possible benefiting from an invasion of dragons (in Frodo's opinion), quests involving hobbits themselves facing mortal enemies seem unlikely -- there's a dearth of that sort of thing between Bullroarer Took and Scouring of the Shire.  However, we do know there was a lot of stuff going on that the hobbits just weren't aware of.  Per Halbarad:\n\n\"A little people, but of great worth are the Shire-folk.  Little do they know of our long labour for the safekeeping of their borders, and yet I grudge it not.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640257","commentId":3640257,"userName":"Kjeld","timestamp":1551816641,"content":"I would like to see a cycle that began on the borders of the Shire, per Halbarad's allusion to the \"long labour\" of safeguarding those borders, but then exploring Eriador to the West and North. It would be a good opportunity to visit the White Towers, Lake Evendim, the Blue Mountains (Ered Luin) and Forochel. There are many possibilities for a story line progressing through quests among all of these locales -- defending against a looming incursion of wolves/wargs, encountering and then assisting a pilgrimage of wandering elves to the White Towers, information gathered there from the Palantir of Elostirion initiates a quest to Lake Evendim and the ruins of Annuminas for clues/artifacts/information on the lost palantiri, which leads to a quest north in search of the lost palantiri in the Bay of Forochel, which leads to a run-in with the Lossoth people, perhaps leading to a new quest to help them against some evil critters up in the North, and so on."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640517","commentId":3640517,"userName":"Vince79","timestamp":1551833075,"content":"> 5 hours ago, Wandalf the Gizzard said:\n> \n> *cough* saga expansions *cough*\n\nThis thread is about discussing the new cycle though, which would be a deluxe expansion plus adventure packs.\n\nBut I agree, The Scouring of The Shire would make for a great saga expansion, I would love to see it.  Even though I thought the Saga expansions were done, they've finished the books after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640534","commentId":3640534,"userName":"Gizlivadi","timestamp":1551835997,"content":"I love how so many people now speak of new Istari and palantiri. I remember when it was mostly me. Maybe Caleb will listen now!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640641","commentId":3640641,"userName":"lleimmoen","timestamp":1551858165,"content":"And I see it is still mostly just me wishing for Tom, haha.\n\nWhether we get more Istari (and I have to say I have always wished so), it has already been decided by now. I believe the cards are usually designed at least one cycle ahead. I am quite sure there should be at least one more, but whether we get more than one, that seems more uncertain.\n\nAs for the potential “Shire” cycle, of course I too imagine it mostly as helping the rangers guard the border, plus some secret local investigation, maybe. Then, wander off West and South, those areas could still feel most interesting and ‘new’ in the game, I believe.\n\nEdited March 6, 2019 by lleimmoen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640661","commentId":3640661,"userName":"Jekzer","timestamp":1551863880,"content":"I've even thought of more light-hearted quests for a Shire cycle.\n\nSomething like The Hunt of the Great Boar, being a festival-like hunt of that animal.\n\nMaybe shifting halfway to more nefarious deeds, such as orc invasions, wights raising and uniting forces with the rangers to stop those threats. I know it's not cannon, since hobbits are unaware of that ranger protection, but oh well.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640788","commentId":3640788,"userName":"Gizlivadi","timestamp":1551882075,"content":"> 6 hours ago, lleimmoen said:\n> \n> And I see it is still mostly just me wishing for Tom, haha.\n> \n> Whether we get more Istari (and I have to say I have always wished so), it has already been decided by now. I believe the cards are usually designed at least one cycle ahead. I am quite sure there should be at least one more, but whether we get more than one, that seems more uncertain.\n> \n> As for the potential “Shire” cycle, of course I too imagine it mostly as helping the rangers guard the border, plus some secret local investigation, maybe. Then, wander off West and South, those areas could still feel most interesting and ‘new’ in the game, I believe.\n\nI have wished for Tom (and Goldberry) for years now and have been vocal about it. My discord avatar is Goldberry precisely because even in encounter cards she has absolutely no representation in the game, and that's a problem. I've said for a while now that probably the best design option for them is as neutral allies with the encounter keyword."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640803","commentId":3640803,"userName":"lleimmoen","timestamp":1551882905,"content":"Great, then we agree. The encounter keyword solves the problem of the naysayers, I feel. And we need them outside of PoD. Please!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640808","commentId":3640808,"userName":"dalestephenson","timestamp":1551883190,"content":"The Old Forest and the Barrow Wights are the two dangers that are *obviously* present on the Shire's borders, and even that an adventurous Took or Brandybuck of the Shire might well get themselves entangled in.  When there is a Shire-area cycle, I would expect to see quests in both and Bombadil/Goldberry should certainly make appearance.\n\nDespite his enormous power level, I wouldn't object to Tom's appearance as a powerful one-turn ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640919","commentId":3640919,"userName":"Gizlivadi","timestamp":1551888805,"content":"He's in the DCG already right? It's only a matter of time IMO till we see him as a player card in the LCG, even with encounter keyword (which makes perfect sense thematically btw) along with Goldberry!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3640939","commentId":3640939,"userName":"lleimmoen","timestamp":1551889862,"content":"You guys make me hopeful. Tom & Goldberry really seem the last thing missing in the game for me. Of course I would still like to see a lot more, but when we get them, I will feel the game has accomplished (as it has been doing greatly these past years)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642093","commentId":3642093,"userName":"banania","timestamp":1551988641,"content":"The short of list of \"what we need before we can call it off\" is really dwindling since last cycle gave us four archetypes (Woodmen, Beorning, Dale, Creature) no one would dare dream about two years ago, alongside Radagast, Thranduil, Bard son of Brand, marginally Thorin Stonehelm (not in regular cycle, but that now does exist as a hero).\n\nMy short list is now: Tom Bombadil, Goldberry, Spirit Aragorn, Saruman hero.\n\nEdited March 7, 2019 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642208","commentId":3642208,"userName":"fbnaulin","timestamp":1551997343,"content":"> 2 hours ago, banania said:\n> \n> My short list is now: Tom Bombadil, Goldberry, Spirit Aragorn, Saruman hero.\n\nAmen.\n\nI'm guessing The Shire as well. Rhûn is too obscure to the general public if they want to have fresh products in shelves when Amazon LotR TV series arrive."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642257","commentId":3642257,"userName":"Gizlivadi","timestamp":1552001632,"content":"> 3 hours ago, banania said:\n> \n> The short of list of \"what we need before we can call it off\" is really dwindling since last cycle gave us four archetypes (Woodmen, Beorning, Dale, Creature) no one would dare dream about two years ago, alongside Radagast, Thranduil, Bard son of Brand, marginally Thorin Stonehelm (not in regular cycle, but that now does exist as a hero).\n> \n> My short list is now: Tom Bombadil, Goldberry, Spirit Aragorn, Saruman hero.\n\nAlso hoping for a true and comprehensive artifact theme with new palantiri, neutral events and rings. Also blue wizards. Apart from that your list is pretty much the same as mine."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642297","commentId":3642297,"userName":"Wandalf the Gizzard","timestamp":1552006415,"content":"I truly wonder whether an artifact deck archetype would really be necessary as long as all the artifacts are represented in card form. A doomed sub-theme would be nice, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642501","commentId":3642501,"userName":"lleimmoen","timestamp":1552038183,"content":"> 13 hours ago, banania said:\n> \n> The short of list of \"what we need before we can call it off\" is really dwindling since last cycle gave us four archetypes (Woodmen, Beorning, Dale, Creature) no one would dare dream about two years ago, alongside Radagast, Thranduil, Bard son of Brand, marginally Thorin Stonehelm (not in regular cycle, but that now does exist as a hero).\n> \n> My short list is now: Tom Bombadil, Goldberry, Spirit Aragorn, Saruman hero.\n\nAs said before, I definitelly go rest happy with Tom and Goldberry. I really do not need another Aragorn, and if an ally would be better. I am hopeful for more Istari now, and more support for them. And if we are getting another cycle, I really think Hobbits and Beornings are the other two traits that could get more, though of course the latter will always be only a complementary trait (no matter how favoured by players, me included), I think. But yes, the bottom line, the shortlist is getting shorter but I am sure they will try a new thing with the new cycle as they tend to, probably something more dramatic than ever, especially should it be the last."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3642503","commentId":3642503,"userName":"lleimmoen","timestamp":1552038265,"content":"PS. The hype with the Amazon show is getting extreme, Second Age no less, so one day we might get a game of that era..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3643095","commentId":3643095,"userName":"Vince79","timestamp":1552074130,"content":"Since it sounds like so much has been covered already, how far away do you think we are from a second edition?\n\nAnd would that make people happy or angry?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3643296","commentId":3643296,"userName":"TwiceBorn","timestamp":1552085323,"content":"While I think a Shire/NW Eriador cycle is most likely, I also believe that a cycle exploring Rhun and pre-War Mordor is possible, and would be a natural place to introduce new Istari (the two Blue Wizards went into the East, didn't they?).\n\n \n\nEDIT: A Lorien/Rohan cycle also seems conspicuously absent.\n\nEdited March 8, 2019 by TwiceBorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3643503","commentId":3643503,"userName":"Wandalf the Gizzard","timestamp":1552103210,"content":"I think many people would be very sad if a second edition was made, just for love of the game, but it wouldn’t be like the game was dead. The second edition would continue receiving new content and be very similar to LotR as we know it.\n\nSome people that recently bought a boatload of reprints might be upset, though. Then again, it’s not like they can’t still play their new first edition stuff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3643657","commentId":3643657,"userName":"banania","timestamp":1552133462,"content":"I think we are very far from second edition, as the DCG and Journeys in ME just look like \"second editions\" to me.\n\nI'd say that the Amazon's hype is more likely to boost the game sells. The amount of new players posting here, on BGG or discord is outstanding for an 8-years old game.\n\nThe future is bright."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3643767","commentId":3643767,"userName":"Wandalf the Gizzard","timestamp":1552144673,"content":"> 3 hours ago, banania said:\n> \n> I think we are very far from second edition, as the DCG and Journeys in ME just look like \"second editions\" to me.\n\nPart of the reason I'm not fully on board with the DCG. I don't need another whole LotR LCG to sink time into by deck-building and strategizing. I wanted a quick half-hour or so play experience to give me my LotR fix and tone back on the LCG's difficulty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3645199","commentId":3645199,"userName":"Felswrath","timestamp":1552325199,"content":"So to my understanding, there are essentially 5 regions of Middle Earth that we have not had campaigns in (or at least very little  exposure to). So my wonder is what heroes would correspond to them?\n\n1: North Western Middle Earth (Shire, Tower Hills, Ered Luin, etc.): This box could certainly get us Gildor and I could see a Red Noldor hero, a Hobbit hero, a Dunedain hero, and even possibly a dwarf hero. (Hobbit is probably most likely, though there is certainly a desire for another Red Noldor hero.\n\n2: Rhun: People want the Blue Wizards, but it's left to be said whether or not FFG will get the rights to name them. We could possibly see Thorin Stonehelm here, though, and another Dale hero would probably be welcome.\n\n3: Mordor: Saruman perhaps, maybe Blue Aragorn, or a new Frodo?\n\n4: Rohan: There is desire for a Green Rohan hero other than Grima, but I honestly think, FFG is avoiding this color for Rohan for the most part. A red or purple Rohan hero could be useful. Maybe even a new Gandalf who can search the top 5 cards of your deck for an attachment to play on him (color match not needed).\n\n5: Western Gondor: We likely won't get much more for Outlands, but there are plenty of characters from this region who could be represented in the game as Gondor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3645411","commentId":3645411,"userName":"Wandalf the Gizzard","timestamp":1552337412,"content":"> 3 hours ago, Felswrath said:\n> \n> So to my understanding, there are essentially 5 regions of Middle Earth that we have not had campaigns in (or at least very little  exposure to). So my wonder is what heroes would correspond to them?\n> \n> 1: North Western Middle Earth (Shire, Tower Hills, Ered Luin, etc.): This box could certainly get us Gildor and I could see a Red Noldor hero, a Hobbit hero, a Dunedain hero, and even possibly a dwarf hero. (Hobbit is probably most likely, though there is certainly a desire for another Red Noldor hero.\n> \n> 2: Rhun: People want the Blue Wizards, but it's left to be said whether or not FFG will get the rights to name them. We could possibly see Thorin Stonehelm here, though, and another Dale hero would probably be welcome.\n> \n> 3: Mordor: Saruman perhaps, maybe Blue Aragorn, or a new Frodo?\n> \n> 4: Rohan: There is desire for a Green Rohan hero other than Grima, but I honestly think, FFG is avoiding this color for Rohan for the most part. A red or purple Rohan hero could be useful. Maybe even a new Gandalf who can search the top 5 cards of your deck for an attachment to play on him (color match not needed).\n> \n> 5: Western Gondor: We likely won't get much more for Outlands, but there are plenty of characters from this region who could be represented in the game as Gondor.\n\n-ish"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3645436","commentId":3645436,"userName":"lleimmoen","timestamp":1552339542,"content":"> 3 hours ago, Felswrath said:\n> \n> So to my understanding, there are essentially 5 regions of Middle Earth that we have not had campaigns in (or at least very little  exposure to). So my wonder is what heroes would correspond to them?\n> \n> 1: North Western Middle Earth (Shire, Tower Hills, Ered Luin, etc.): This box could certainly get us Gildor and I could see a Red Noldor hero, a Hobbit hero, a Dunedain hero, and even possibly a dwarf hero. (Hobbit is probably most likely, though there is certainly a desire for another Red Noldor hero.\n> \n> 2: Rhun: People want the Blue Wizards, but it's left to be said whether or not FFG will get the rights to name them. We could possibly see Thorin Stonehelm here, though, and another Dale hero would probably be welcome.\n> \n> 3: Mordor: Saruman perhaps, maybe Blue Aragorn, or a new Frodo?\n> \n> 4: Rohan: There is desire for a Green Rohan hero other than Grima, but I honestly think, FFG is avoiding this color for Rohan for the most part. A red or purple Rohan hero could be useful. Maybe even a new Gandalf who can search the top 5 cards of your deck for an attachment to play on him (color match not needed).\n> \n> 5: Western Gondor: We likely won't get much more for Outlands, but there are plenty of characters from this region who could be represented in the game as Gondor.\n\nI still see #1&2 the most likely. Beside Legolas and Gimli they kept the two heroes within a ‘nation’ trait, so I expect them to do so again. I would really like Gildor and Tactics Glorfindel best. I do not think they can name the Blue wizzards as Tolkien did in Unfinished Tales but since they did come up with so many names already I see no problem with two more for Istari characters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650515","commentId":3650515,"userName":"Felswrath","timestamp":1552937105,"content":"I've been thinking about it, and I don't think that the Blue Wizards, Alatar and Palando are as unlikely to show up with those names as we've assumed. The game has strayed from their license for the Lord of the Rings and the Hobbit more than we may think. I can site two examples.\n\nThe first is fairly well known: Khamul the Easterling. Now he was a pretty small deal in the game ( a single enemy in a Nightmare Deck) and came from a pretty well known History of Middle Earth book: The Unfinished Tales. Yet still it shows a stray from what we understood to be allowed by the license.\n\nHowever, there is one name that is even more significant. I just completed the Dream Chaser Cycle yesterday and was looking at it. I decided I wanted to know exactly where Cobas Haven was located(I correctly guessed between Dol Amroth and Anfalas.). So I looked up at my wall map of Middle Earth and there's no Cobas Haven in Gondor. I look in my encyclopedia of Middle Earth which details all the names used in the Hobbit, The Lord of the Rings, and The Silmarillion: nothing. I google the name, and the article from Tolkien Gateway comes up. It turns out that the name comes from The War of the Ring from the History of the Lord of the Rings series. Here we have not a single card from a nightmare deck, but an entire adventure pack set in a location whose name not only doesn't appear in what we understand to be FFG's licensed materials, but also appears in the title of that Adventure Pack!\n\nAll of a sudden, having a couple of Wizards who appear in the Unfinished Tales doesn't strike me as so far fetched."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650546","commentId":3650546,"userName":"dalestephenson","timestamp":1552939267,"content":"I'd like to see them show up, but Alatar and Pallando (Unfinished Tales) are their names in Valinor -- permission or not, those probably *shouldn't* be the names of the blue wizards in the game.  Morinehtar and Romestano should be their names in the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650557","commentId":3650557,"userName":"Felswrath","timestamp":1552939645,"content":"Nice catch, @dalestephenson!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650608","commentId":3650608,"userName":"banania","timestamp":1552942294,"content":"In case their actual names are out of copyright limits, they can simply make \"Blue Wizard\" non-unique allies with the text box bearing the following mention: Limit 2 cards with the title \"Blue Wizard\" in play.\n\nLike this:\n\n \n\n06-Blue Wizard II-1.jpg [//content.invisioncic.com/Mfantflight/monthly_2019_03/2069624352_06-BlueWizardII-1.jpg.c1c46d5ddc429933f10aeb61ae462a34.jpg] [//content.invisioncic.com/Mfantflight/monthly_2019_03/2069624352_06-BlueWizardII-1.jpg.c1c46d5ddc429933f10aeb61ae462a34.jpg]\n\n05-Blue Wizard I-1.jpg [//content.invisioncic.com/Mfantflight/monthly_2019_03/734502124_05-BlueWizardI-1.jpg.5a212a17e42db1597d18714709d08672.jpg] [//content.invisioncic.com/Mfantflight/monthly_2019_03/734502124_05-BlueWizardI-1.jpg.5a212a17e42db1597d18714709d08672.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650612","commentId":3650612,"userName":"lleimmoen","timestamp":1552942361,"content":"> 1 hour ago, Felswrath said:\n> \n> I've been thinking about it, and I don't think that the Blue Wizards, Alatar and Palando are as unlikely to show up with those names as we've assumed. The game has strayed from their license for the Lord of the Rings and the Hobbit more than we may think. I can site two examples.\n> \n> The first is fairly well known: Khamul the Easterling. Now he was a pretty small deal in the game ( a single enemy in a Nightmare Deck) and came from a pretty well known History of Middle Earth book: The Unfinished Tales. Yet still it shows a stray from what we understood to be allowed by the license.\n> \n> However, there is one name that is even more significant. I just completed the Dream Chaser Cycle yesterday and was looking at it. I decided I wanted to know exactly where Cobas Haven was located(I correctly guessed between Dol Amroth and Anfalas.). So I looked up at my wall map of Middle Earth and there's no Cobas Haven in Gondor. I look in my encyclopedia of Middle Earth which details all the names used in the Hobbit, The Lord of the Rings, and The Silmarillion: nothing. I google the name, and the article from Tolkien Gateway comes up. It turns out that the name comes from The War of the Ring from the History of the Lord of the Rings series. Here we have not a single card from a nightmare deck, but an entire adventure pack set in a location whose name not only doesn't appear in what we understand to be FFG's licensed materials, but also appears in the title of that Adventure Pack!\n> \n> All of a sudden, having a couple of Wizards who appear in the Unfinished Tales doesn't strike me as so far fetched.\n\nGreat info. I mean I know all that, especially about Khamul, but still was unaware... thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3650641","commentId":3650641,"userName":"kypatzer","timestamp":1552943883,"content":"I think if the deluxe is set in the shire it could open up some different type of quests for Caleb. I’m picturing something that breaks the mold - like a quest around Bilbo trying to get to The Green Dragon Inn while trying to avoid the Sackville-Baggins."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3655964","commentId":3655964,"userName":"flightmaster101","timestamp":1553409719,"content":"> On 3/18/2019 at 2:18 PM, kypatzer said:\n> \n> I think if the deluxe is set in the shire it could open up some different type of quests for Caleb. I’m picturing something that breaks the mold - like a quest around Bilbo trying to get to The Green Dragon Inn while trying to avoid the Sackville-Baggins.\n\nThen my Rohan deck, led by Eomer, murders the Sackville-Baggins’."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3665848","commentId":3665848,"userName":"TwiceBorn","timestamp":1554221007,"content":"> On 3/8/2019 at 3:48 PM, TwiceBorn said:\n> \n> While I think a Shire/NW Eriador cycle is most likely, I also believe that a cycle exploring Rhun and pre-War Mordor is possible, and would be a natural place to introduce new Istari (the two Blue Wizards went into the East, didn't they?).\n> \n>  \n> \n> EDIT: A Lorien/Rohan cycle also seems conspicuously absent.\n\nCALLED IT!!! SO EXCITED!!!\n\nhttps://www.fantasyflightgames.com/en/news/2019/4/2/a-shadow-in-the-east/ [https://www.fantasyflightgames.com/en/news/2019/4/2/a-shadow-in-the-east/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3666222","commentId":3666222,"userName":"Jekzer","timestamp":1554235129,"content":"> 3 hours ago, TwiceBorn said:\n> \n> CALLED IT!!! SO EXCITED!!!\n> \n> https://www.fantasyflightgames.com/en/news/2019/4/2/a-shadow-in-the-east/ [https://www.fantasyflightgames.com/en/news/2019/4/2/a-shadow-in-the-east/]\n> \n>  \n\nHaha bravo!\n\nIt seems by the name of the cycle we will explore not only Rhun, but also Mordor, maybe?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3666401","commentId":3666401,"userName":"dalestephenson","timestamp":1554244607,"content":"Mordor is East for Gondor, but for Rhun it is South and West.  I hope the entire cycle can be spared for Rhun, vast space that it is; let Mordor be grouped with Khand, which we didn't see at all in the Harad cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291801-guess-the-new-cycle/?do=findComment&comment=3667750","commentId":3667750,"userName":"Miceldars","timestamp":1554362973,"content":"I like the idea of Sméagol hero. It seams good to me"}]}