{"url":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/","title":"New Storage Solutions hub, and we need you!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3643889","commentId":3643889,"userName":"Durins_Father","timestamp":1552157866,"content":"Greetings all,\n\nFor a while now I have had my storage solutions posted on Vision of the Palantir, but I have received comments of people who appreciate the article, but are also looking for other ways to store the many different cards and items that come with this game. Because of this, I have been wanting to expand the storage part of the blog and am now going to create a hub there to host many different storage solutions from players all around the community. But since I am but one player, I need some more input from the rest of the community. That's where you all come in.\n\nI would like to ask anyone who wants to share their storage solutions with the rest of the community to make a short article (like this, but you can shorten it a little https://visionofthepalantir.com/2018/09/22/storage-solutions-ii/ [https://visionofthepalantir.com/2018/09/22/storage-solutions-ii/]) and write a little about the boxes, binders, sleeves, and various other things you use to store and protect your collection. This can be your chance to show off your unique boxes, or creative ways you found work best for you. Add in some pictures of your collection as a visual aid, and send it to me via any platform you can reach me on (Forums, Discord, Facebook, Twitter, VotP contact form, etc). I would prefer the articles in easy to copy format, like a simple Word document or gdocs file. The pictures can be added in the document itself or sent as separate attachments if you want. Please add to the file your name (can be a screen name if you want), a rough estimate of what portion of the game you own, and if the storage solution was relatively cheap or expensive compared to the cost of the cards. If you want to give exact prices, feel free to add those too.\n\nI will start next week with collecting all of the articles and putting them on Vision of the Palantir. That way, newer players can browse through the collections of others when looking for ways to store their own cards. It will also serve as a gallery of the various methods you can store this many cards.\n\nIf you have questions, feel free to ask them in the comments. I will be online for the majority of tomorrow and the day after. I will post an update to this project next week when I get started on the hub.\n\nGood luck with your games, and I'm looking forward to seeing your storage solutions.\n\nDurins_Father"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3643890","commentId":3643890,"userName":"Durins_Father","timestamp":1552157937,"content":"Also, this does not count as a valid solution: 20181101_191237-e1547561834525.jpg?w=658 [https://visionofthepalantir.files.wordpress.com/2019/01/20181101_191237-e1547561834525.jpg?w=658&amp;h=345&amp;%23038;crop=1]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3643982","commentId":3643982,"userName":"OlorinCZ","timestamp":1552164642,"content":"The horror! The horror!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3643994","commentId":3643994,"userName":"icabod","timestamp":1552165396,"content":"> 2 hours ago, Durins_Father said:\n> \n> this does not count as a valid﻿ solution﻿﻿﻿\n\nHave you been speaking to my wife?  I'm sure this is her proposed storage solution for my games."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3644082","commentId":3644082,"userName":"Wandalf the Gizzard","timestamp":1552178809,"content":"I always have to raise the listed price of a game in my mind, because I must have a functional storage solution."},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3648494","commentId":3648494,"userName":"Pericles","timestamp":1552650103,"content":"I just listened to your interview on Cardboard of the Rings, Durins_Father.  Thank you for sharing!  I found the discussion very interesting.  I am not quite the completionist that others might be, as I just pick-up a pack every once in a while, but I think I still have enough to support at least 4 solid, competitive decks.  Your ideas have motivated me to see what I can do with my collection.  Thanks, again!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3648848","commentId":3648848,"userName":"Durins_Father","timestamp":1552678189,"content":"> 7 hours ago, Pericles said:\n> \n> I just listened to your interview on Cardboard of the Rings, Durins_Father.  Thank you for sharing!  I found the discussion very interesting.  I am not quite the completionist that others might be, as I just pick-up a pack every once in a while, but I think I still have enough to support at least 4 solid, competitive decks.  Your ideas have motivated me to see what I can do with my collection.  Thanks, again!\n\nGreat to hear that. Picking up packs one by one isn't a bad approach, considering the lack of content available at the same time and potential financial restrictions (at least in my case). You'll slowly build your cardpoo lup to sustain more decks, but 4 is already enough to experiment with different decktypes without building a new deck again and again.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3649602","commentId":3649602,"userName":"Durins_Father","timestamp":1552822523,"content":"Major update to this thread, the hub is now online!\n\nI have started the hub on VotP which can be found here: https://visionofthepalantir.com/storage-hub/ [https://visionofthepalantir.com/storage-hub/]\n\nYou will be able to see the first 2 articles there from both me and a community member who shared his solutions in the form of an article with some pictures.\n\nIf you want to have your storage solution here as well, feel free to send me the article explaining the methods you chose for your storage and send some pictures as well. You can reach me via multiple outlets, including these forums.\n\nHope to see a lot more articles on here soon!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3677990","commentId":3677990,"userName":"Durins_Father","timestamp":1555239728,"content":"We are still looking for people who want their solutions featured on the hub. Not only will it allow you to get more interaction with the community, but it will also provide new players with a taste of the various options they have when storing this game. (It will also allow me to keep some content going while I'm graduating).\n\nFeel free to send me a message with your article and pictures, or you can send them to me via prinsdaan@hotmail.com. Looking forward to seeing the hub grow in the future!\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3685015","commentId":3685015,"userName":"Durins_Father","timestamp":1555847556,"content":"Thanks to McDog3 for sending me his storage solutions yesterday. The article can now be found here [https://visionofthepalantir.com/2019/04/21/storage-solutions-mcdog3/] and on the hub itself [https://visionofthepalantir.com/storage-hub/].\n\nI hope this will help those of you looking to store your cards with exploring the various options. This solution is best fitted for completionists, who like a modular collection to bring to meetups. All cards of one cycle (including Nightmare) fits in one box, giving you enough to play for a night!\n\nI hope to receive more articles like this from people over the coming weeks, so that the storage hub can grow even bigger!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3688508","commentId":3688508,"userName":"Durins_Father","timestamp":1556200994,"content":"We are really starting to get this ball rolling, feel free to send us your articles and pictures as well!\nToday I bring you the solution of Codus, from the Discord servers. His solution involves custom made laser cut deck boxes that are perfect to store on your shelf or to bring with you. His one deck solution is gorgeous with custom tokens and a custom made threat tracker: https://visionofthepalantir.com/2019/04/25/storage-solutions-codus/ [https://visionofthepalantir.com/2019/04/25/storage-solutions-codus/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3688625","commentId":3688625,"userName":"LoPocket","timestamp":1556206200,"content":"Great post! I enjoy my storage solution and would be happy to share it with everybody. Is there an email I can reach you at to send pictures and breakdown?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3688742","commentId":3688742,"userName":"Durins_Father","timestamp":1556212944,"content":"> 1 hour ago, LoPocket said:\n> \n> Great post! I enjoy my storage solution and would be happy to share it with everybody. Is there an email I can reach you at to send pictures and breakdown?\n\nYou are more than welcome to send your breakdown in any text format to prinsdaan@hotmail.com\nFor the pictures, I'd appreciate it if you could put them in a zip-folder and attach it to the email, makes things easier for me.\nFeel free to mark in your writeup where you want certain pictures to be, that way I can try to find a spot for all of them.\nTurn-around times on these articles can be within the hour of receiving the email, if I'm bored enough at work 😛\nLooking forward to your writeup!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3695079","commentId":3695079,"userName":"Durins_Father","timestamp":1556865394,"content":"Even in the month of May, the storage hub continues to grow. This time, Catastrophic shares his solutions in this article. His solution focusses on storing encounter sets in the original larger Core Set boxes, while storing the player cards in binders chronologically. Check the article out here: https://visionofthepalantir.com/2019/05/01/storage-solutions-catastrophic/ [https://visionofthepalantir.com/2019/05/01/storage-solutions-catastrophic/]\n\nLooking forward to receiving more solutions in the coming month!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3697062","commentId":3697062,"userName":"Durins_Father","timestamp":1557222141,"content":"Even more solutions were sent this week, so here is another storage solution by a community member. This solution is better suited for players with a growing card pool that want to keep their cards in a dedicated box instead of their Core Set box. Check out the article here: https://visionofthepalantir.com/2019/05/07/storage-solutions-solanum/ [https://visionofthepalantir.com/2019/05/07/storage-solutions-solanum/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3701438","commentId":3701438,"userName":"Durins_Father","timestamp":1557818205,"content":"Some more famous community members are also joining in with the storage hub. Today, Dave Walsh from the Card Talk podcast shares his solutions, which feature custom cardboard boxes with some amazing artwork inspired by the game. The links to all files and retailers are in the article itself. Check out the article here: visionofthepalantir.com/2019/05/14/storage-solutions-dave-walsh-of-card-talk/ [http://visionofthepalantir.com/2019/05/14/storage-solutions-dave-walsh-of-card-talk/]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3721381","commentId":3721381,"userName":"Durins_Father","timestamp":1560601415,"content":"It has been a month since I last uploaded a Storage solution article, but I did find a new one in my inbox yesterday. So here is the storage solution of Discord user Nemesis: https://visionofthepalantir.com/2019/06/15/storage-solutions-nemesis/ [https://visionofthepalantir.com/2019/06/15/storage-solutions-nemesis/]\n\nIt is a foam core insert that allows players with an earlier card pool to store all their cards in their old Core Set box. The solution is lighter than MDF solutions and allows for customization.\nI will be happy to receive more articles in the coming weeks from those of you looking to share your storage solution!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3740203","commentId":3740203,"userName":"Durins_Father","timestamp":1563180551,"content":"Look what I found in my inbox last week: Another storage solutions article!\n\nThis one is from community memeber Idrial, who has created a large box to fill with his collection. He has laser-engraved the box with the Doors of Durin and even managed to fit in a map of Middle Earth in the box. For pictures and links to how this was done, see this article: https://visionofthepalantir.com/2019/07/15/storage-solutions-idrial/ [https://visionofthepalantir.com/2019/07/15/storage-solutions-idrial/]\n\nI'm always looking for more articles like this, so feel free to reach out if you have a storage solution that you like to share!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3810338","commentId":3810338,"userName":"Durins_Father","timestamp":1571661447,"content":"Bringing this back from the dead like I was Daechannar\n\nI have updated my storage solutions to complete the trilogy. I have gone into more depth on the parts that aren't new, but I also added in a lot of the stuff that I got new at Con of the Rings 2019. \nHere's the article for everyone to read: https://visionofthepalantir.com/2019/10/21/storage-solutions-iii/ [https://visionofthepalantir.com/2019/10/21/storage-solutions-iii/]\n\nIf you want more storage solutions, check the other links in this thread or go to the Storage hub. We are always looking for more articles, so if you want to share your article, feel free to reach out. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/291970-new-storage-solutions-hub-and-we-need-you/?do=findComment&comment=3921242","commentId":3921242,"userName":"Durins_Father","timestamp":1585480769,"content":"It has been a while since I have received any storage solutions, but with the virus keeping everyone indoors and with many newer players asking around about solutions, I thought I might revive this thread a little. For those that are stuck inside with nothing to do, feel free to message me with an article on your storage solutions. You can send me a bunch of pictures included with the article so that they can be featured on the blog as soon as a few days after receiving your mail/message. Not only will this keep you busy, it will also provide the community with something to read, and new players with more inspiration on how to store their cards, tokens, mats, decks, etc.\n\nYou can message me through any medium you can find me on (these forums, facebook, twitter, discord) or you can contact the blog through this link: https://visionofthepalantir.com/contact/ [https://visionofthepalantir.com/contact/]\nTogether we can pull through these strange times, giving back to the community that is supporting everyone!"}]}