{"url":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/","title":"Nightmare Decks","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3645397","commentId":3645397,"userName":"TXCanuck","timestamp":1552335827,"content":"It’s been nearly six months since the last round of nightmare decks were released.  Any thoughts if we’re going to get more soon?  What do you think will be next ?  Flame of the West or the Harad cycle?\n\nAlso for those of you have played a lot with nightmare version, what is your favorite?  I have them all but have only played up through Khazad Dum so up now my favorite has been Return to Mirkwood,"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3645672","commentId":3645672,"userName":"General_Grievous","timestamp":1552359787,"content":"I sure hope they add Flame of The West and Mountain of Fire to at least finish those off. I haven't gotten to nightmares yet but definitely interested."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3645826","commentId":3645826,"userName":"Rajam","timestamp":1552391597,"content":"I've all the nightmare packs released but only played about 30% or 40%% of them due to time constrains. What I've played is:\n\n- Mirkood cycle except for Escape from Dol Guldur and the Dead Marshes. Return to Mirkwood is the one I recommend as well. Hills of Emyn Muil the least.\n\n- Khazad Dum cycle except for Shadow and Flame. Flight From Moria is super swingy depending on which quests you get (the one that makes you reveal 1 encounter per player is brutal in multiplayer), and probably the hardest. 7th level and Into the Pit are fun, although not that hard.\n\n- Peril in Pelargir is your average nightmare quest. I've also played The Siege of Cair Andros and The Morgul Vale with a group of 4 people, and I'm pretty sure we didn't achieve any victory in a whole day playing those quests o_O\n\n- The Fords of Isen, To Catch an Orc, Into Fangorn, The Nin-in-Eilph and Celebrimbor's Secret from the Voice of Isengard cycle. To Catch an Orc is the toughest, although I dislike the mechanic of removing like half your deck. The Nin-in-Eilph is recommended if you like challenges. Celebrimbor's Secret is easy and not that recommended tbh\n\n- I played the whole Angmar Awakened cycle and this is definitely the cycle I recommend the most. It has the best nightmare quests I've played: Intruders in Chetwood, Deadman's Dike, The Treachery of Rhudaur, Battle of Carn Dum, The Dread Realm. The \"easiest\" quest imo is Across the Ettenmoors, despite having some titanic monsters, it doesn't add any sort of special mechanic. Escape From Mount Gram becomes one of the hardest quests after being one of the easiest in regular mode. My personal favorite is Battle of Carn Dum and probably the nightmare I'd recommend the most. As a side bonus, the NM art is superb in this cycle.\n\n- The Fate of Numenor is the only nightmare I've played from the Grey Havens cycle and is a recommended one, with an overall better balance (all encounter cards feel about equally punishing).\n\n(Haven't played NM Saga quests yet)\n\n \n\nHonestly, the NM quests only get better as you go on. The Mirkood cycle is a bit meh, but then you get Angmar Awakened and NM quests shine. I recently got the last NM packs from the Grey Havens cycle and I'm confident they'll be top notch material : )\n\nEdited March 12, 2019 by Rajam"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3645954","commentId":3645954,"userName":"Wandalf the Gizzard","timestamp":1552401112,"content":"@Rajam [https://community.fantasyflightgames.com/profile/265631-rajam/] You should give Dead Marshes nightmare a shot. It really makes the quest a lot better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3646675","commentId":3646675,"userName":"Rouxxor","timestamp":1552474864,"content":"Since the expansion release are slowing down it is logical that nightmare release rhythm follow this. I'm still pretty confident about the release of nightmare in the future. It is my main playing resource so I'm also waiting for it ;).\n\nAbout the best nightmare my personal list is:\nBattle of the five armies\nEncounter at Amon Dun\nThe Dread Realm\nDunland trap\nInto Ithilien\nDefense of Cair Andros\nTempest on Cobas Haven\nShadow and Flame Nightmare\nRaid on the grey haven\nDesolation of Eriador\nBlood of Gondor\nSecret of Celebrimbor\n\nSo most of the cycle 5 and some other from one cycle or another. You may notice that none of the saga scenario have been cited :/. Though Helm's Deep and A Journey in the dark are not that bad.\n\nEnjoy :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3663484","commentId":3663484,"userName":"urloony","timestamp":1553998251,"content":"> On 3/11/2019 at 4:23 PM, TXCanuck said:\n> \n> It’s been nearly six months since the last round of nightmare decks were released.  Any thoughts if we’re going to get more soon?  What do you think will be next ?  Flame of the West or the Harad cycle?\n> \n> Also for those of you have played a lot with nightmare version, what is your favorite?  I have them all but have only played up through Khazad Dum so up now my favorite has been Return to Mirkwood,\n\nI've been wondering this myself lately.  A few FFG games have slowed in production this and Armada have both slowed.  It's nice to see reprints on the way, my hope is that the Nightmare decks will come as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3721023","commentId":3721023,"userName":"DropDeadCriminal","timestamp":1560535964,"content":"With 2 Saga expansions, 2 deluxe expansions, and 2 full cycles still to catch up I'd love to see these start getting pumped out again. At the very least put out the Saga nightmare decks since they have closed the saga. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/292064-nightmare-decks/?do=findComment&comment=3721910","commentId":3721910,"userName":"Iranon","timestamp":1560701345,"content":"I hope they do Nightmare decks for everything! But I agree that if they don't at least finish the Nightmare Saga quests, it'll be a real shame."}]}