{"url":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/","title":"We need orc decks and scenarios","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646235","commentId":3646235,"userName":"Thaeggan","timestamp":1552417041,"content":"It hit me last night that I believe it would be very cool to play as the bad guys verses a good guy encounter deck. This needs to be a thing because there are plenty of scenarios where orcs win battles and would be an interesting spin on the LCG."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646288","commentId":3646288,"userName":"Felswrath","timestamp":1552419577,"content":"I've thought of this as well. The primary issue is that it would likely have to be stand alone. As such, FFG likely could not afford to give us a core at $40. And I don't know how many existing players would like to buy a $50-$60 stand alone box."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646308","commentId":3646308,"userName":"dalestephenson","timestamp":1552420572,"content":"While I'm not adamantly opposed to the generic idea of playing the bad guys in a game, Tolkien has created a world where the bad guys have overwhelming force and the good guys need the most improbable events (and/or grace of the Valar) to eke out victory.  That doesn't seem a very good fit for a cooperative game.  I can see the evil core set quests now:\n\nSpread Spiders All Over Mirkwood (difficulty level 1)\n\nScatter Orc Hosts Up and Down Anduin (difficulty level 2)\n\nKeep Thrain Imprisoned In Dol Goldur (difficulty level 0)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646321","commentId":3646321,"userName":"Willange","timestamp":1552421009,"content":"You could do some awesome evil quests that would be quite difficult, I think.  \n\nInfiltrate Lothlorien to spy the movement of elves/the fellowship.\nHoldout on weathertop against Dunedain Rangers\nSteal jewels from a dwarven vault in the Lonely Mountain/Thorin's Hall/Erebor\nLead a raid against Pelargir\nGet past the Dunedain to raid the Shire\nTame some cave trolls\nGo to war with another Orc tribe\nMordor vs Isengard skirmishes\n\nThere is so much you could do that would be reasonably difficult from the evil perspective."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646429","commentId":3646429,"userName":"Vince79","timestamp":1552429983,"content":"I enjoy playing good, so I don't feel limited by it, but I'm sure there are people who would enjoy it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646472","commentId":3646472,"userName":"Will Anderson","timestamp":1552435042,"content":"I see the thematic problem being less Sauron's power (there are plenty of examples of his failures) than the fractious nature of evil in Middle Earth; something of the co-operative feel may be lost playing a collection of orc-chiefs. I certainly have no objection to FFG experimenting with the idea, even if I think it very unlikely that they will. If anyone remembers ME:CCG, it issued a release where the players took on the role of one of the Nazgul and which I found to be a thematic improvement on the original (based around the Istari). Of course the major difference is that ME:CCG was a competitive game that suited the idea of competing lieutenants.\n\nA much more modest spin on the idea might be to have an expanded set of heroes or allies like Grima (and I need to believe Saruman's arrival is imminent!) that have detrimental effects based on their weaknesses or corruptibility. A mechanic could be created whereby heroes could fall into shadow as an additional way to be eliminated other than by death or threating out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646537","commentId":3646537,"userName":"Thaeggan","timestamp":1552442736,"content":"Won't really need to fight heroes though, just random thematic mobs will work. Of course, if a hero is part of the fight and actually dies, then great put that sucker in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646551","commentId":3646551,"userName":"Vermithrax","timestamp":1552444904,"content":"> 6 hours ago, dalestephenson said:\n> \n> Spread Spiders All Over Mirkwood (difficulty level 1)\n\nI’m in!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646571","commentId":3646571,"userName":"TheSpitfired","timestamp":1552448537,"content":"I had reckoned that I already made my Middle Earth CCG references for the year, but that's exactly what I thought of when I saw this thread.\n\nI've wondered what all you could do with this. It would be a fun test to do one deluxe expansion with a cycle to see if it could work. I think you have to change the resource spheres to more \"shadowy\" counterparts and I also think you could come  up with a few deck archetypes among the various factions. Just off the top of my head...\n\nUruk-Hai, Morder Orcs/Goblins, Corsairs, Haradrim (Oliphant deck!!!), Easterlings, Dunlendings, Sackville-Bagginses (half kidding), maybe even another set with the Balrog or Dragons trying to be a power? There's a lot of variety here, not all the evils were necessarily aligned which could make it interesting. \n\nThe real question would be can these be different than our \"good guy\" factions or are they just dark mirror versions? Does that even matter if it's a stand-alone game? \n\nI think initial scenarios could include cutting through Elven territory to get somewhere, inner-faction civil wars, maybe attempts to appease potential allies, minor skirmishes with Ithilien rangers, nomadic Dwarves or around the borders of the Shire, raiding a border village, sailing on the seas with the Corsairs...this could go on.\n\nI think the potential is certainly there!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646586","commentId":3646586,"userName":"Kjeld","timestamp":1552452317,"content":"> 58 minutes ago, TheSpitfired said:\n> \n> There's a lot of variety here, not all the evils were necessarily aligned which could make it interesting. \n> \n> The real question would be can these be different than our \"good guy\" factions or are they just dark mirror versions?\n\nTherein lies your answer. Rather than building synergy with more cards on the table, as do the heroes, the evil factions would squabble and fragment due to greed and internal power struggles. In game terms, the individual cards would generally be stronger, but would suffer negative bonuses with other cards on the table and would constantly be threatening to turn on you or each other if you can't keep them in line. Would be a really interesting way to explore trade-offs among traits and of risk/reward."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646606","commentId":3646606,"userName":"GILLIES291","timestamp":1552455788,"content":"Well sheesh I feel edgy playing Grima Hero and Saruman Ally already haha. It's an interesting thought and personally I'm plenty happy playing the heroes against evil and would do so until the end of time if they keep putting out expansions. For the sake of discussion I can think up a few routes though:\n\n1. More \"dark heroes\" Saruman (readying off of Doomed effect and being able to search for and/or play Doomed event cards of any color so he can cast all his spells, Gollum (able to hide from an enemy or avoid an attack and maybe helping with locations but at  the expense of threat for either or both effects and maybe must have a character named Frodo in play or he scurries off and leaves).\n\n \n\n2. Shadows of Mordor, or if they don't have that license (but they do have a few video game ones already), then something like that. So a Mordor cycle where you can bribe or have a couple Orc/Goblin objective allies or even a special hero that is one trying to seek redemption, ok more likely profit haha. And causing harrying campaigns against other war chieftains.\n\n \n\n3. Straight up new core set/different game one shot. Except your threat starts at 50, you minus off your dark heroes and when you reach 0 you are no longer threatening and lose haha. Then you could have either an entire mirror campaign/alternate reality story where you are blocking the efforts of the fellowship or else just separate storyline. Though imagine one where you are the Balrog trying to catch a fleeing party in Moria, leading a pack of Uruk-Hai to take out Boromir and catch some Hobbits and so on.\n\n \n\nAnyways I would prefer them in that order but as I said I'm happy to play my Grima/Eowyn/Erestor decks and keep on summoning Saruman ally to help as far as playing as the bad guys goes. But always down for more LOTR, I just like the good guys more here. Now if this was Star Wars and it was play the Empire or Rebels... different story hahaha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646684","commentId":3646684,"userName":"dalestephenson","timestamp":1552475883,"content":"We do have a corsair hero and an entire Haradrim deck -- so all you need to do is come up with a custom scenario and you can recast them as \"bad guys\".  All the FFG-invented heroes could be recast as bad guys, and custom \"evil\" heroes would be easy to make/use.\n\nNot having thought about it too deeply, I wonder if it would be practical to substitute enemies for allies in encounter/player decks -- many of the attachment events even thematically could be used by evil as well as good.  You'd need an easy algorithm to figure threat/engagement for allies and cost for enemies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646815","commentId":3646815,"userName":"Amicus Draconis","timestamp":1552489562,"content":"Well, costs for enemies are simple: add their stats and divide by two :D. Threat is totally different, though I read something about Spiders in the Core set having a lower threat than their stats indicate, maybe there is a formula there.\n\nThe bigger problem is, that enemies can do all at once: \"quest\" as long as they are in the staging area, attack at the beginning of the encounter phase and then defend against player attacks. The next thing is, that player characters for the most part are specialized in one task. A Galadriel's Handmaiden for instance would hinder your questing, but play no role in combat: just engage and \"tank\" her, she does not deal any damage anyway. What about Beregond? He has no willpower, so he is useless in staging and his single point of attack won't do much damage, so why would you bother killing him? You need 5 attack for just a single wound on him. Now compare his stats to a Cave-troll. Same defense but all other stats are higher by 3 to 5 points, so it would need a threatcost of 21 (or cost 10+ resources). Not to mention a built in Firefoot.\n\nAs nice as the idea is to turn the tables, enemies and characters are built asymmetrically for good reason, so I fear even with an algorithm for swapping threat/resource cost and engagement cost, this would not work in the end.\n\nWhen thinking about this I now see, why the digital game is, as it is. Gameplay is far more symetrical between good and evil, characters and enemies can guard their comrades, cards from Sauron cost resources and so on. Maybe FFG at one point allows monster play in the digital game, but for the LCG I see no way."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646901","commentId":3646901,"userName":"TheSpitfired","timestamp":1552492948,"content":"You aren’t just flipping hero cards into an encounter deck if you do this though. You are redesigning characters from the ground up and only keeping the mechanics.\n\nTo follow your example If you’re trying to do a quest and Beregond is in the staging area, you’ve got a major problem. He’s going to have a high “threat” (For threat generated by heroes I’d rename it resistance) and he’s going to be a stalwart defender, probably one with an ability that gets him back in the staging area after combat. \n\nThat’s where I think it would work best as a stand-alone expansion product. All you need from the core are your tokens and a resistance tracker. \n\nThe four evil spheres:\n\nShadow (covert type strategies, resistance reduction - Spirit mirror)\n\nFear (innovative solutions to keep going for fear of consequences - lore mirror)\n\nForce (attrition and raw power for combat - tactics mirror)\n\nAmbition (the dark lord’s will to conquer everything - leadership mirror)\n\nEven If it never happens, fun discussion!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3646925","commentId":3646925,"userName":"Thaeggan","timestamp":1552493511,"content":"I honestly feel like we have the cards we need already. Current player ally cards and encounter lands can be the encounter deck. Not sure why everyone is so focused on Heros being in the encounter deck unless they were there and fell in battle.\n\nUnique enemies can be heros, using an encounter card's threat could be their cost to play.\n\nShadow effects can be when played effects\n\nScenarios will be hard to balance, but I dont think questing makes sense as an orc army, rather needing to kill or capture X enemies.\n\nI dont have the time to flesh one out for kicks this weekend.\n\nEdited March 13, 2019 by Thaeggan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3647066","commentId":3647066,"userName":"Amicus Draconis","timestamp":1552500124,"content":"> 1 hour ago, TheSpitfired said:\n> \n> You aren’t just flipping hero cards into an encounter deck if you do this though. You are redesigning characters from the ground up and only keeping the mechanics.\n> \n> To follow your example If you’re trying to do a quest and Beregond is in the staging area, you’ve got a major problem. He’s going to have a high “threat” (For threat generated by heroes I’d rename it resistance) and he’s going to be a stalwart defender, probably one with an ability that gets him back in the staging area after combat. \n> \n> That’s where I think it would work best as a stand-alone expansion product. All you need from the core are your tokens and a resistance tracker.\n\nThese were just my thoughts on dale's idea of substituting enemies for allies. Yes, I know, there is no ally Beregond for now, but you could also work with Defender of Rammas.\n\n> 6 hours ago, dalestephenson said:\n> \n> Not having thought about it too deeply, I wonder if it would be practical to substitute enemies for allies in encounter/player decks -- many of the attachment events even thematically could be used by evil as well as good.  You'd need an easy algorithm to figure threat/engagement for allies and cost for enemies.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/292109-we-need-orc-decks-and-scenarios/?do=findComment&comment=3647162","commentId":3647162,"userName":"Felswrath","timestamp":1552507064,"content":"I was skeptical at first, but I think this might be able to work. My main issue with the idea is that I think it would be too risky of a move for the normal line, but I think I have a solution: PoD. Imagine this: The Fall of Osgiliath (cost $20 US) includes 80 cards. \n\n2 Tactics (or equivilent) heroes: 1 orc warrior, 1 Haradrim soldier\n\n2 Leadership (or equivilent) heroes: 1 orc lieutenant, 1 Easterling captain\n\n18 player cards of each color above listed\n\n3 quest cards: 1A and 1B Secure the Eastern Shore; 2A The Crossing 2B Assaulting the Harbor 3A and 3B Storming the Western Quarter (At the resolve of 1B, the players are instructed to progress to a random 2A quest card.)\n\n37 Forces of the West Cards (1 set of 32 cards that are used through out, and 1 set of 5 cards that is shuffled into the deck at stage 2)\n\n \n\nThe Fall of Osgiliath  Reinforcement Pack (cost $15 US) includes 60 cards.\n\n3 Lore (or equivilent) heroes: 1 nazgul, 1 morgul sorceror, 1 Haradrim mage\n\n1 Tactics hero: Easterling Warrior\n\n1 Leadership hero: Orc Scout\n\n21 Lore Player cards\n\n3 Tactics player cards\n\n3 Leadership player cards\n\n6 Neutral Player Cards\n\n2 2A Quest cards 2 sets of 5 Forces of the West cards to be shuffled into the deck at stage 2\n\n \n\nThings that are different:\n\n- Minimum deck size is 30 cards and your discard pile is shuffled if you run out of cards.\n\n- Maximum number of heroes is 2.\n\n- Heroes belonging to the first player receive 2 resources instead of 1.\n\n- A heightened emphasis on trying to take the first player token in order to gain the benefits that are incumbent with it.\n\n \n\nEdited March 13, 2019 by Felswrath"}]}