{"url":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/","title":"2nd age expansion","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3646295","commentId":3646295,"userName":"Ozil23","timestamp":1552420131,"content":"Even before the announcement of the Amazon series focusing on the second age, I had always thought that this could be the next saga expansion. It has a great theme and players would be super excited because of the release of the series based on this. It´  s a win-win. \n\n \n\nImagine playing all of the second age with pretty cool heroes such as Gil-Galad, Elendil, Celembribor, Elrond, Isildur, etc. \n\nThere are some darn good scenarios, storylines or missions you could play; \n\n* The forging of the rings\n\n* The founding of Gondor and Arnor\n\n* The battle of Minas Ithil\n\n*The last alliance (battle of Dagorlad, Siege of Barad-Dur, final battle of Elendil and Gil-Galad against Sauron).\n\n \n\nJust imagine a 2 player game, one using an elf deck consisting of Gil-Galad, Elrond and Cirdan and the other using a men deck (Elendil, Isildur, Anarion). Thematic at it´  s fullest, fun and a breath of fresh air for the game. I would certainly buy every single thing they throw at us. \n\n \n\n \n\nDo you think it could be possible? Do they have the rights to do this, I know they have at least The Hobbit and LOTR), can they do it?\n\n \n\n \n\nLooking forward to you your comments. \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3646324","commentId":3646324,"userName":"dalestephenson","timestamp":1552421072,"content":"There's a lot of information in the Appendices that could be used for first age, second age, or early third age -- not nearly as much information as in the Silmarillion and other works, but the Second Age has *much* less information than the First Age, so there's much more scope for Making Things Up.  I do think making First Age LOTR would be unsatisfying if the cards had to be restricted to the bare-bones available from text and appendices, and could not use all the detail available elsewhere.  And the existing game is so firmly based on the printed lore that I have a hard time seeing them base game content on the new series, however well done it may be.\n\nA saga expansion set at the beginning of the Third Age (original War of the Ring) would be the best bet given the existing license, this is described fairly well in the text and appendices IMO.\n\nMy dream is that the Tolkien Estate licenses to FFG now that Christopher Tolkien isn't in the way anymore; but the amount of revenue on offer from FFG would be so pathetically small compared to the TV series I don't know if they would even be open to that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3646406","commentId":3646406,"userName":"Amicus Draconis","timestamp":1552427766,"content":"In case you do not know yet, there is a fan made first age box and half a cycle by Tales from the Cards covering the stories of Beren and Túrin. As to scenarios in the past, I would be most interested in the rise and fall of old realms like Angmar, Eregion, Khazad-dûm and my favourite, Arnor. Most of it would be in the Third Age however.\n\nEdited March 12, 2019 by Amicus Draconis"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3646428","commentId":3646428,"userName":"Vince79","timestamp":1552429884,"content":"I'm a big fan of The Silmarillion (and some of the other books based on that material).  So I'd love to see it.  \n\nNot sure about the licensing issues though, ideally the Tolkien Estate will become more lenient in the future about what they license out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3646638","commentId":3646638,"userName":"lleimmoen","timestamp":1552467347,"content":"Yes I think this would be a great way to boost things up again. I think they did try it with the Hobbit saga, which was anncounced around the time of the first Hobbit movie build up. But I think the rights might be an issue, though I am not sure, of course.\n\nWe already have characters that could not possibly meet, so I my wish would be in time they kept adding more and more, First and Second age included (but the former might be especially tricky, though for me even more exciting, looking at you Fingolfin, Turin, Huan)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3647146","commentId":3647146,"userName":"Wandalf the Gizzard","timestamp":1552505642,"content":"I'd pay good money for a Dagor Dagorath expansion. :wub: [//content.invisioncic.com/Mfantflight/emoticons/default_wub.png]\n\nAnyone for Epic Multiplayer squared? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nEdited March 13, 2019 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3647455","commentId":3647455,"userName":"Nickpes","timestamp":1552538912,"content":"> 9 hours ago, Wandalf the Gizzard said:\n> \n> I'd pay good money for a Dagor Dagorath expansion. :wub: [//content.invisioncic.com/Mfantflight/emoticons/default_wub.png]\n> \n> Anyone for Epic Multiplayer squared? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nMe too... But put aside licensing, having a Manwe, Eonwe,  Ingwion etc player cards would be difficult to make I guess. Especially the valar host cards. They should be super powered compared to other player cards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/292114-2nd-age-expansion/?do=findComment&comment=3650037","commentId":3650037,"userName":"Hannibal_pjv","timestamp":1552904806,"content":"Yep. It should be completely new game or those cards could not be used in normal games... though you meet armias of balrogs and several dragon in the same battle, so you need that extra oomph :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n \n\nEdited March 18, 2019 by Hannibal_pjv"}]}