{"url":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/","title":"Help with story line","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3665826","commentId":3665826,"userName":"FriendofYoda","timestamp":1554219963,"content":"I recently received a bunch of expansions for the game, having previously only owned the core set, but they are a bit mix and match due to being gifts.\n\n \n\nI would like to try and organize them into a bit of a story but it seems a bit all over the place. I have the Grey Havens Deluxe Exp and the Sands of Harad Deluxe Exp also, alongside 3 of the adventure packs for each of those cycles (I can pull the exact names once home tonight).\n\n \n\nI wonder if there's already a community resource, or perhaps a lore expert here, that might be able to organize some kind of order I should follow or perhaps how this series of quests might possibly fit together?\n\n \n\nPerhaps others have had this issue also?\n\n \n\nI'd love to pick up all the boxes that follow the story of the books, but haven't been able to find them all in stock anywhere"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3665856","commentId":3665856,"userName":"Wandalf the Gizzard","timestamp":1554221284,"content":"All cycles take place between the Hobbit and Lord of the Rings saga expansions. Specifically in the seventeen years between Bilbo's farewell party and when Frodo leaves the Shire for Rivendell.\n\nAll the cycles from Against the Shadow up to the current cycle are connected through an overarching story, so those would be played in order of release\n\nShadows of Mirkwood and Dwarrowdelf are not connected to the other cycles (there is even a huge thematic disconnect with the Khazad-dum/Dwarrowdelf cycle), but probably took place several years before the other cycles.\n\nThis thread is very helpful:\n\nThe second post in it, by Ellareth, is what you're looking for. It is not up to date, but the cycles released after Against the Shadow are in chronological order already, anyway; like I said.\n\nOne problem with the timeline is that Against the Shadow happens way too close to the events of the LotR books for 5+ cycles to take place afterwards, but what can you do? Ask FFG to stop making cycles so the timeline remains canon? :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nAnyway, hope that helps some."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3665878","commentId":3665878,"userName":"dalestephenson","timestamp":1554221838,"content":"Putting Ringmaker's events in the 17 year span is tough enough to justify.  I think Heirs/AtS, VoI/Ringmaker, and LR/Angmar really don't have much of a story hook with adjacent cycles , but Harad picks up exactly where Dreamchaser left off, and the Haradrim figure prominently in Wilds' text.\n\nThe hunt for Gollum canonically took place between 3009 and 3017, with Gollum being captured in 3017, just the year before the saga.\n\nI think KD/Dwarrowdelf would've been better if placed *before* Balin's five years in Moria, to avoid the conflict with canon.  There's no reason the game should constrain itself to the years between Bilbo's party and the beginning of the saga."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3665957","commentId":3665957,"userName":"Wandalf the Gizzard","timestamp":1554225104,"content":"I'd figured after the Against the Shadow cycle, the heroes headed through the Gap of Rohan and agreed to take on Saruman's quest before continuing north to Eriador for the Angmar Awakened cycle; which would leave them situated for Dreamchaser.\n\n> 53 minutes ago, dalestephenson said:\n> \n> I think KD/Dwarrowdelf would've been better if placed *before* Balin's five years in Moria, to avoid the conflict with canon.  There's no reason the game should constrain itself to the years between Bilbo's party and the beginning of the saga.\n\nDo you mean just Dwarrowdelf? The whole point of the three KD quests was to search for Balin's colony."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666050","commentId":3666050,"userName":"dalestephenson","timestamp":1554229063,"content":"That's precisely what I don't like about the KD and Dwarrowdelf quests.  The fate of Balin's colony was quite clearly unknown at the time the fellowship passed through it, though the worst was feared.  But in KD the heroes enter Moria specifically to take a message to Balin from the White Council, and discover his fate.  In Dwarrowdelf, the heroes are sent by Elrond, to investigate \"the source of the increased Orc activity along the Misty Mountains\" and go straight to Moria.  If *either* party succeeds at their task, it affects the canon -- this isn't true of any of the other cycles, which would just change history if the heroes fail rather than succeeded.  Risking spoiling the main story is an occupational hazard of going through Moria after Balin's death -- but if the heroes had gone through Moria *before* Balin went there, we could still have adventures in Moria without conflicting with the text.\n\nIt's true that after AtS, the heroes were headed west towards the Gap of Rohan, but the events of the final quest took place close to Minas Morgul.  The text spoiled where the next cycle would start, but gave no particular reason why the heroes would be going that way.  They arrived in Gondor by ship from the Grey Havens.\n\nAt the end of Ringmaker, the heroes (who at the beginning were described as in the employ and favor of Gandalf) resume their journey north to Rivendell, asked to give greetings to Elrond and also to say \"hello\" to Gandalf if they meet him.  So the heroes who were sent by the White Council at the beggining of Heirs, are perceived by Saruman (the head of the White Council) to be working for Gandalf, and are travelling to Rivendell to report back to Elrond...\n\nLost Realm starts in Rivendell and references their \"important errands in Gondor and Dunland\".  One wonders how much they told Elrond about their labors in Dunland, given that they were *not* errands the council (or Saruman) sent them on and were just done out self-preservation.  It also ends in Rivendell, when a message comes that leads them to travel to the Great Havens.\n\nSo you have connecting text in the prologues and epilogues.  What you *don't* have is connections between the quests themselves.  Morgul Vale ends near Minas Morgul.  Fords of Isen starts in the Gap of Rohan -- the two locations arent' close.  Antlered Crown ends in Dunland.  Intruders in Chetwood starts near Bree -- the two locations aren't close.  Dread Realm ends in Angmar.  Voyage Across Beleagar starts on the high seas.  Again, not close.  In campaign terms, it would be easy to justify swapping out heroes partially or completely between cycles.\n\nBut that's not true of Dreamchaser/Harad.  City of Corsairs ends with the heroes in Umbar, with enemies all around them and no means of escape -- and that's exactly where Escape from Umbar starts.  There's an immediacy that doesn't exist with any of the other cycles.\n\nThe transition between Crossing of Poros and Wilds is much like the other cycles, separated in time and space.  What's unique about this prologue is that the heroes aren't going on yet another errand on behalf of the White Council.  They are specifically travelling to Dale *only* because they are seeking a home for their Haradrim friends from the previous cycle.  The motive for them act relies on the previous cycle.\n\nYou could put Angmar/Ringmaker/Shadow in any order without any impact to continuity, because even though they are loosely linked by the flavor at the beginning and end of cycles, the tasks being performed are completely independent and the motivation of heroes and evil alike are completely unaffected by what has happened before.  That's not true of the last three cycles.  But it may well be that the next cycle is functionally independent like most of the other cycles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666198","commentId":3666198,"userName":"Wandalf the Gizzard","timestamp":1554234517,"content":"All very true, Dale. Nice write-up! Story continuity is what I meant, not actual quest location. Sorry if I didn’t make that clear."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666216","commentId":3666216,"userName":"Onidsen","timestamp":1554234914,"content":"I remain unconvinced that the Against the Shadow cycle is meant to play through the events of T.A. 3018 and that particular probing attack into Gondor. We know that a century earlier (2901) that raids by Orcs and Haradrim drove most of the population of Ithilien across the river. Surely the border hadn't been quiet since then. In 3018, there is a probing attack to test the defenses of Gondor in preparation for the attack on Minas Tirith that came in 3019, but there could easily have been an attack between 10 and 20 years earlier, in which Boromir and Faramir distinguished themselves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666392","commentId":3666392,"userName":"Wandalf the Gizzard","timestamp":1554244221,"content":"I agree Against the shadow would have been somewhat earlier than 3018, just so the cycles after it fit.\n\n> 4 hours ago, dalestephenson said:\n> \n> But it may well be that the next cycle is functionally independent like most of the other cycles.\n\nFor the purposes of the story, it's positioned perfectly given the location of the Ered Mithrin cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666407","commentId":3666407,"userName":"dalestephenson","timestamp":1554245145,"content":"Agreed, I predicted Rhun originally because of its admirable proximity to Dale.  But I don't think Kahliel's folk will figure into the next cycle at all--I think they'll find a home in/around Dale.  But there may be some connection between \"Fate of Wilderland\" and what's happening in Dorwinion, a place we haven't heard anything about since The Hobbit.  (Don't bring Galion, he'll just get drunk.)\n\nBut ironically, the 5th pack puts us at Mount Gundabad, a long ways *west* of Dale and very close to Angmar.  The Shire is closer than the Sea of Rhun.  Maybe the 6th pack will bring us east again."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3666533","commentId":3666533,"userName":"Felswrath","timestamp":1554255968,"content":"Perhaps our Harad friends will settle at Mount Gundabad. Seems like a bit of a lore stretch, but I could see it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293265-help-with-story-line/?do=findComment&comment=3681532","commentId":3681532,"userName":"aliprandifabio","timestamp":1555511294,"content":"Hi all, \nThis is the file I made few weeks ago.\nI don't know if it is chronologically correct, but you can help me to fix the item.\n\n \n\nHere you can download the file: https://ufile.io/y9iq9013 [https://ufile.io/y9iq9013]"}]}