{"url":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/","title":"Solo League 8 -- LOTR saga (with Heirs/AtS cards)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3664821","commentId":3664821,"userName":"dalestephenson","timestamp":1554135667,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the LOTR saga. The quests are:\n\n1) The Shadow of the Past (Black Riders)\n2) The Passage of the Marshes (Land of Shadow)\n3) Shelob's Lair (Land of Shadow)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the (non-saga) heroes must be from a box with those quests.  This means that you must have at least one of Sam, Lore Pippin, Fatty, Tactics Merry, Leadership Faramir, and Damrod.  You must also choose one of the four versions of Fellowshp Frodo to use against all three quests.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Shelob's Lair and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Passage of the Marshes it does not matter how many tokens I needed to defeat A Shadow of the Past.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker. You are required to reveal which Heroes you used, and how many cards in your deck came from outside LOTR saga, Heirs/AtS cycle and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from LOTR saga, Heirs/AtS or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from LOTR saga and Heirs/AtS. More is better.\n\n3rd) The number of heroes used from this list: Sam, LoPippin, Fatty, TaMerry, LeFaramir, Damrod. More is better.\n\n4th) The number of cards in the deck outside LOTR saga and Heirs/AtS. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Black Riders and Land of Shadow. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in March's Solo League (if you didn't play or finish March's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for June's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in June's league. May's cycle will be KD/Dwarrowdelf.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nA Shadow of the Past: April 8th\nThe Passage of the Marshes: April 15th\nShelob's Lair: April 24th\n\n8 ) I've created a google spreadsheet for results here: \nhttps://docs.google.com/spreadsheets/d/1SPfeCIsrwE5TDrXfngRuz5U-1EqySGxYZ1UbRmY7l0g/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1SPfeCIsrwE5TDrXfngRuz5U-1EqySGxYZ1UbRmY7l0g/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665050","commentId":3665050,"userName":"Yepesnopes","timestamp":1554145788,"content":"Can we use cards that have been spoiled but not yet published like Sting from Mount Gundabad?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665082","commentId":3665082,"userName":"dalestephenson","timestamp":1554147106,"content":"You can use cards that will be released before the end of the league.  So Mount Gundabad is legal, Fate of Wilderland is not.\n\nIf you're doing a hobbit deck Mount Gundabad certainly has terrific cards.  I was tempted to include some in my deck, but ringsdb didn't have the new cards yet and I didn't want to proxy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665099","commentId":3665099,"userName":"Yepesnopes","timestamp":1554147920,"content":"I printed them the moment they were posted on fantasy flight web page :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665204","commentId":3665204,"userName":"GILLIES291","timestamp":1554154140,"content":"Ok quick question, what is AtS? I'm assuming Heirs of Numenor is Heirs but no idea on AtS"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665209","commentId":3665209,"userName":"dalestephenson","timestamp":1554154568,"content":"AtS is Against the Shadow, it's the name for the cycle of APs that require Heirs of Numenor to play.\n\nIt means Damrod has access to some of his traps :)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3665277","commentId":3665277,"userName":"GILLIES291","timestamp":1554159723,"content":"Ah perfect that makes sense, still sort of new at the game and the cycle names is something I didn't know. So any of the Grey packs are cool to use along with the listed Saga ones. Thank you"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3670692","commentId":3670692,"userName":"Yepesnopes","timestamp":1554659365,"content":"I passed the Black Riders in nightmare mode with zero tokens, but I have been very lucky. I had and awesome first turn where I put Legolas into play thanks to Timely Aid. I also had Bill the Pony. This allowed me to start taking down the Black riders from turn 1. I doubt I will be that lucky again :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThe Black Riders is such a great scenario! I really love it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3672565","commentId":3672565,"userName":"GILLIES291","timestamp":1554821122,"content":"The Sons of Gondor have escaped the Shire! I built up a swarm deck with no outside cards from the required list led by Boromir, Lore Pippin and Mablung. Many Gondorians laid down their lives, but in the end we scrapped out a hard fought victory. I stalled on phase 1, then just didn't bother with trying to pass the hide tests on phase 2 and sacrificed allies to the Nazgul attacks since I had way to many allies at that point. \n\n \n\nLooking forward to the next one, but dreading taking my weaker swarm against Shelob."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3673183","commentId":3673183,"userName":"dalestephenson","timestamp":1554856927,"content":"A Shadow of the Past went down easy for me -- I had two Friend of Friends in my opening hand, and I got Hennamarth Riversong early.  That let me tailor the questing to stay on stage one until I felt ready to move on, and I managed to take down each quest stage's Black Rider in a single turn (once with an assist from Gandalf's direct damage).  I even ended the quest with Sneak Attack and Gandalf in hand, unneeded.\n\nEveryone else made it through as well.  Only four of us (so far) went up against the first quest, outside cards in parens:\n\n0 Gillies291 (0)\n0 dalestephenson (6)\n0 Yepesnopes [nightmare] (22)\n0 Thanee (49)\n\nYepesnopes and I have the same hero lineup, though I'm playing easier quests.  Thanee is using Sam, but with LoAragorn and Galadriel -- and he's the only one not using the Black Riders Frodo, opting for the Mountain of Fire version.  Gillies291 not only has no outside cards, his LeBoromir/LoPippin/Mablung Gondor deck is the *only* published deck at ringsdb with that hero combination.  (Thanee's lineup has only one creator for the three published decks, but if Thanee published his deck there would be two creators.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3673194","commentId":3673194,"userName":"GILLIES291","timestamp":1554858629,"content":"Nice! A new hero combo for a new player haha. I'm not sure how well it will hold up against the next quests. But it's good on card draw/resources so that's nice. I wanted to do a trap deck but the Nazgul and Shelob are all unable to have attachments. And catching ravens/the occasional wandering Orc didn't seem strong enough to build a deck around."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3675651","commentId":3675651,"userName":"GILLIES291","timestamp":1555051494,"content":"The Sons of Gondor have finished their quests! \n\nDead Marshes went fairly well drawing the lucky Riversong and Gleowine (these two are my MVP champions for this whole month) which helped me stall and summon the full strength of the Gondorian army before laying siege to the dead that would not die. Easy victory.\n\n \n\nShelob's lair was the one I most dreaded taking my fairly weak Swarm against, and rightfully so, a rough starting hand of no Riversong meant I was questing blind, which shortly turned into me passing onto stage 2 too quickly, which I had forgotten meant I can only play 1 ally a round. Sufficient to say for a swarm it did not go well. Slowly Shelob picked off my allies until eventually after an hour of battling (and Shelob summoning two more Nazgul to help that I didn't have the strength to Quest, defend and fight against) I lost with threat and two cripples heroes. Poor Mablung was bitten by Shelob's poison and I deeply regretted not bringing any condition removal.\n\nKnowing that I had a better feel for the quest I tried again, and lucked out on my mulligan calling once again Riversong and Gleowine to my hand. Sufficient to say I was able to stall, play all 3 Gandalfs, and engage/fight the odd enemy to help draw more coins and cards, and before long I had almost every single Gondorian ally in play. With this and my deck almost empty I carried on to phase 2. I was able to pass that phase much more swiftly and smoothly, using Boromir to defend against Shelob using his Staff of Lebethron to dodge the worst of the shadow effects. \n\nFinally made it to the 3rd phase and held off against Shelob, dealing her just enough damage to drop a resource from her and eventually slew the fell spawn of ****. \n\n \n\nSo the swarm turned out to be not too bad against this challenge. Though I lucked out by not drawing any of Shelob's Poison on Shelob and having all of my heroes and the forces of Gondor to battle the queen. It was also thematically fun to have Pippin helping his Gondorian brethren escort Frodo on his path to the mountain.\n\nThe first game was rough though, very rough.\n\n \n\nAnyways thanks for reading and may the Favor of the Valar be with you against the final quest. \n\nEdited April 12, 2019 by GILLIES291"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3675731","commentId":3675731,"userName":"Yepesnopes","timestamp":1555064304,"content":"I have finished The Passage of the Marshes nightmare.\n\nThis scenario was not too difficult. During my test runs I discovered that the key for beating this quest was to take down Gollum on turn 1, latest turn 2. So, first round no questing and beating him hard.\n\nI mulligan hard for anything that allowed me extra combat power (1 of the three Daggers of Westernesse or a Timely Aid). This time it was a Timely Aid, which brought Firyal into the table. Not what I wanted! It took me two turn to take down Gollum and some threat. Firyal (this card is broken in solo) really navigated my deck easily through the quest phase, getting rid of some nasty treacheries. Also, in turn 3 I summoned Yazan with an Elf-stone which pretty much solved the combat part.\n\nWell, now I will go into Shelob's lair.... how many tokens is going to be this time?\n\n \n\nShelob's lair did not went good. I was very very unlucky with my starting hands /mulligan and I was wiped out  within a few turns as I could not take down the enemies and quest. But ok, it compensates for my previous luck I guess :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThe hilarious thing is that on my final attempt (with 3 tokens), I had 3 Timely Aids in my starting hand and 3 resources on Sam. I called for aid Firyal, Yazan and Rossie Cotton. After this first turn, the run was quite smooth 😛\n\nEdited April 12, 2019 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3684083","commentId":3684083,"userName":"dalestephenson","timestamp":1555707179,"content":"I don't generally fear Passage Through the Marshes, but it went badly for me.\n\nIt started out great -- I had two Friend of Friends in my hand and drew into Rosie Cotton quickly.  All I needed to was bump off Gollum quickly, and things would go well.  But a funny thing happened along the way...\n\nThe first problem was the Nazgul.  I got the treachery that makes you either add a Nazgul to the staging area or exhaust the ring and reveal another card.  I did the latter and out came a Nazgul.  With its -15 engagement cost it engaged me that turn, do not collect a card, do not ready Sam, and do not collect $200.  I let Barliman take him undefended in hopes of knocking off Gollum, but that was the other problem.\n\nEvery time I discarded a card from the deck I got +3 or +4 defense on Gollum, and since the one card that didn't show up early was Dagger of Westernessee, even with Rosie's help I was only chipping away at Gollum one  hp at a time.  Meanwhile, the Nazgul was eating my allies alive.  I finally folded when it looked like I'd be engaged with four enemies (still including Gollum) and could only defend against two of them.\n\nThe second go (with one token) went better -- I never got a second copy of Friends of Friends and it was a little dicy early when Sam got two damage on him, but Gollum didn't get his defense buff and I knocked him off early, built up my army, and used Treebeard for defense until Sam got his Staff of Lebethron.  I built up my army in stage one and then quested through stage two and three in one turn each.\n\nStill, I was the only one to take a token (outside cards in parens):\n\n0 Gillies291 (0)\n0 Yepesnopes [nightmare] (22)\n0 Thanee (44)\n1 dalestephenson (6)\n\nAnd cumulative through the first two quests:\n\n0 Gillies291 (0)\n0 Yepesnopes [nightmare] (22)\n0 Thanee (44)\n1 dalestephenson (6)\n\nI'm sorry for the delayed report, taxes interfered with my playing.  I'm the only one who hasn't finished the final quest, but if there's another player who is wanting to start but needs more time to finish than the deadline next Monday, just let me know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3684211","commentId":3684211,"userName":"Vermithrax","timestamp":1555721964,"content":"I wanted to get in on this one but i'm still working through Journey to the Crossroads in my progression.  I'll return to the excitement in May."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3693448","commentId":3693448,"userName":"dalestephenson","timestamp":1556716840,"content":"Sorry for being so late with the final results.  The final quest actually went down fairly easily for me -- I was able to tank up Sam (with Fast Hitch, Cloak, Staff, Friend of Friends) so he could take one shadow-free attack from Shelob each turn, which made the quest much much easier.  I finished with 0 tokens and was not alone (outside cards in parens):\n\n0 dalestephenson (6)\n0 Skihorse4848 (23)\n0 Thanee (49)\n1 Gillies291 (0)\n3 Yepesnopes [nightmare] (22)\n\nWe can only speculate how many tokens the rest of us would have taken if we'd played the nightmare version.  Since I'm the only one to take a token on the first two quests, here's the final standings:\n\n0 Skihorse4848 (23)\n0 Thanee (49)\n1 Gillies291 (0)\n1 dalestephenson (6)\n3 Yepesnopes [nightmare] (22)\n\nSkihorse4848 is the winner and gets to choose a cycle for June's league.  Thanee is second and gets to choose a quest from the cycle.  Gillies291 is third and gets to exclude a quest from the cycle.  Yepesnopes (courtesy of nightmare quests) is last and gets to chose a supplemental cycle for player cards.  I win nothing, but I do get to post May's league today.  Thank you all for playing, I hope you enjoyed it -- on to Moria!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3694195","commentId":3694195,"userName":"dalestephenson","timestamp":1556787329,"content":"Skihorse4848 has chosen Print on Demand, and Thanee has chosen Murder At the Prancing Pony for the quest to play.  Gillies291 can now select a POD quest not to play (note -- I'm excluding Woodland Realm and Wizard's Quest, since they aren't actually published yet).  Yepesnopes gets to choose the supplemental cycle, though in this case it's really the only cycle for player cards.\n\nMurder at the Prancing Pony had Legolas as its promotional hero, so we know TaLegolas will be one of the choices for mandatory hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3694505","commentId":3694505,"userName":"GILLIES291","timestamp":1556814213,"content":"I would choose not Attack on Dol Guldur as I currently only have half of the PODs. I'll keep my eyes open for murder at the prancing pony though haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3694542","commentId":3694542,"userName":"dalestephenson","timestamp":1556816600,"content":"RNG says:\n\nBattle of Laketown\n\nRuins of Belegost\n\nMurder at the Prancing Pony (chosen)\n\nThat means the mandatory hero list consists of TaLegolas and TaGimli (Beorn's Path doesn't show a hero for Battle of Laketown). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3695283","commentId":3695283,"userName":"Yepesnopes","timestamp":1556891908,"content":"Is there any cycle that has not been chosen yet for player cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3695329","commentId":3695329,"userName":"dalestephenson","timestamp":1556895473,"content":"Ered Mithrin."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3695416","commentId":3695416,"userName":"Yepesnopes","timestamp":1556899981,"content":"Let’s go for it then!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293201-solo-league-8-lotr-saga-with-heirsats-cards/?do=findComment&comment=3707263","commentId":3707263,"userName":"dalestephenson","timestamp":1558560994,"content":"Since the winner pick didn't include player cards (other than the mandatory heroes), I let skihorse4848 pick another cycle to supplement Ered Mithrin.  So Mirkwood cycle will also be available for player cards."}]}