{"url":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/","title":"If there were only 5 heroes left...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668421","commentId":3668421,"userName":"RebelX","timestamp":1554408127,"content":"I do not want this thread to be derailed by a discussion on how likely it is that the game is dying soon, but let us assume for a moment that this was the case and the designers would ask you to submit him a list with 5 (types of) heroes you would like to have in the last packs. You could choose on whatever criteria you like (which tribe needs some more support, which are you favorites, etc.).\n\n\n\nAs you will see from my list, I am an elf guy and as I am not an expert on Tolkien lore I will not chose a particular character for the most part (and you also do not need to do that.\n\n\n\n1.       Silvan Spirit Hero: medium threat level with either a defensive or willpower focus. Galadriel is obviously very strong (and technically Noldor) and Legolas does not really fit the Silvan theme. So I really feel that this is the sphere where another sylvan hero would be the most welcome\n\n\n\n2.       Silvan Tactics Hero: medium to high threat and hopefully one of the better defenders in the game (in that case the Spirit hero should be willpower focused). Tactics Legolas is to this day a very good hero, but it would be great to have the option to be able to mix it up a bit. Especially considering that Tactics has quite a few really good silvan cards.\n\n\n\n3.       Noldor tactics (preferably Glorfindel): as with silvan, Noldor only has one tactics option and Elladan comes with the burden that you cannot really play him without Elrohil. Therefore enter Glorfindel. Yes, we do already have two versions, but Lore Glorfindel has one of the weakest abilities of any hero and Spirit Glorfindel while being very good only has a negative ability and is not terribly exciting to play. Give us a Glorfindel with a 12 threat and a powerful and especially interesting ability that is worth every point. Make him one of the stand-out heroes in the game. He should be the focal point of decks and not a pure stats guy (as spirit Glorfindel basically is).\n\n\n\n4.       Noldor Leadership (preferably Elrond): Yes, we will get Gildor, but I am not really excited for him. Lore Elrond is probably perfect, so my feelings about the Leadership Noldor being Elrond are not as strong as with Glorfindel in tactics (a Glorfindel leadership hero would obviously also be an option).\n\n\n\n5.       Spirit Aragorn: To complete the collection and it would just feel right to close the game with the character that was printed on the first card of the core set. His ability should make him a strong defender as we have had an readying Aragorn, a threat level-controlling-Aragorn, an (kind of) attack-boosting Aragorn.\n\n\n\n\n\n \n\nHonorably mentioned: A Rohan Lore Hero and an Hobbit Leadership Hero.\n\n\n\nIf you like you could also name one player card that you would hope for. Mine would be a Silvan weapon in Lore (granting +1 attack default and +2 if a special condition is met).\n\n\n\n\n\n \n\nI am really looking forward to your ideas.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668558","commentId":3668558,"userName":"dalestephenson","timestamp":1554415475,"content":"Leadership Frodo\n\nLore Widfara (Rohirrim)\n\nSpirit Sam\n\nSpirit Aragorn\n\nTactics Faramir\n\nBut five is simply not enough, and FFG will provide some invented (mostly female) heroes as well.\n\nI want my Lobelia Sackville-Baggins hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668604","commentId":3668604,"userName":"Bendrie","timestamp":1554418528,"content":"Leadership: we should definitely get a Gamling or Grimbold hero, preferably Gamling with some effect to inspire Rohirrim with his banner.\n\nTactics: I would also LOVE to see a new Noldor in Tactics, but I think the game needs Gwahir for an eagle hero finally.\n\nLore: I think Rossiel really needs a partner for victory display, which could maybe be an Orophin with attack power that increases against enemies in victory display who share a trait.\n\nSpirit: I reckon a Gondor or Outlands hero like Angbor the Fearless with Lamedon allies OR now that we have Derufin spoiled, maybe Duinhir his dad with some Blackroot Vale archers would be nice. (Not to mention Forlong the Fat as a hero would make a great defender).\n\nNeutral: I think Saruman is definitely one that would be a lot of fun to play, with some effect to switch spheres each turn as he has many colours.\n\n \n\nI would also really want to see Aeglos, Gil-Galad's spear as an artefact weapon for tactics... could be a guarded attachment for +2 attack and something for Noldor synergy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668622","commentId":3668622,"userName":"Will Anderson","timestamp":1554420523,"content":"I'd prefer heroes with no previous versions, and also favour those who would be more active around the time of the Hobbit rather than the LotR.\n\n \n\n1. Hobbit Leadership (Paladin or Esmeralda Took). I do enjoy Sam's abilities, but we need another leadership option. I tend to do very thematic line-ups, so I'd like a Took that might've gone on an adventure in their youth to replace Sam with, as we know he never left the Shire prior to LotR.\n\n2. Saruman. Hopefully Neutral. As long as he's 14 threat and has some sort of access to all spheres (Saruman of Many Colours just fits too well) I'm happy.\n\n3. Tactics Bofur. Was pleased to get Thorin Stonehelm, but I still think the Dwarves deserve another (decent) Tactics hero. A high defense would be nice.\n\n4. Lore Farmer Maggott. Bombadil knew and praised him, and I've always felt there was a hidden story here.\n\n5. Dale hero (Bain or FFG-created), either Leadership or Tactics. Just want more hero options for a great new archetype.\n\n \n\nI'd love to get Dis (Thorin's sister) as a Spirit ally, maybe with the thematic restriction that she can only be played if all that player's heroes are Dwarves."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668830","commentId":3668830,"userName":"GILLIES291","timestamp":1554454838,"content":"Wow some great ideas so far, I am going to echo some as well.\n\n \n\nNeutral - Saruman, with ability to play Doomed event cards of any sphere and perhaps a way to summon Doomed cards and/or readying himself after raising threat from player card effect doomed.\n\n \n\nTactics- Gwahir, King of the Eagles is who we need to complete the Eagles theme. Perhaps \"Once per round, after an Eagle ally is returned to your hand you may play that ally for no cost.\" \n\n \n\nSpirit Aragorn, would be cool to have one of each sphere. \"Response, when Aragorn is declared as a defender, you may return the top card from your discard pile to your hand to give him +X shield for this attack, where X is the cost of the card returned to your hand. Limit once per round. \n\n \n\nTom Bombadil, I know I know call me crazy but maybe: \"Tom Bombadil Cannot Quest, Attack, or Defend. Action: Exhaust Tom Bombadil to choose an enemy, that enemy does not contribute its threat and cannot attack this round.\"\n\n \n\nGoldberry, make her super low threat and give her \"Goldberry Cannot Quest, Attack, or Defend. Action: Exhaust Goldberry to ready another hero.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668929","commentId":3668929,"userName":"player3351457","timestamp":1554464431,"content":"> 2 hours ago, GILLIES291 said:\n> \n> Wow some great ideas so far, I am going to echo some as well.\n> \n>  \n> \n> Neutral - Saruman, with ability to play Doomed event cards of any sphere and perhaps a way to summon Doomed cards and/or readying himself after raising threat from player card effect doomed.\n> \n>  \n> \n> Tactics- Gwahir, King of the Eagles is who we need to complete the Eagles theme. Perhaps \"Once per round, after an Eagle ally is returned to your hand you may play that ally for no cost.\" \n> \n>  \n> \n> Spirit Aragorn, would be cool to have one of each sphere. \"Response, when Aragorn is declared as a defender, you may return the top card from your discard pile to your hand to give him +X shield for this attack, where X is the cost of the card returned to your hand. Limit once per round. \n> \n>  \n> \n> Tom Bombadil, I know I know call me crazy but maybe: \"Tom Bombadil Cannot Quest, Attack, or Defend. Action: Exhaust Tom Bombadil to choose an enemy, that enemy does not contribute its threat and cannot attack this round.\"\n> \n>  \n> \n> Goldberry, make her super low threat and give her \"Goldberry Cannot Quest, Attack, or Defend. Action: Exhaust Goldberry to ready another hero.\"\n\nLove your heroes. Spirit aragorn and hero arwen work incredibly well together.\n\nCount me as one who wants a tactics Silvan hero. Legolas is strong but getting a little old, not to mention it doesn't really fit into synergy of the other silvans."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3668937","commentId":3668937,"userName":"John Constantine","timestamp":1554464791,"content":"Gimme 5 Sarumans, 1 of each sphere and 1 neutral."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669056","commentId":3669056,"userName":"pixcalcis","timestamp":1554472194,"content":"1. Spirit Aragorn\n\n2. Leadership or Lore Frodo\n\n3. Either a tactics or spirit silvan... I imagine they would use Elena from Journeys in Middle Earth.  \n\n4. Saruman. I imagine him being neutral, but he could fit in other spheres too.\n\n5. Spirit Sam.  Everyone else in the fellowship have had more hero versions than Sam (and Frodo if you discount the fellowship versions). That definitely needs to be rectified.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669064","commentId":3669064,"userName":"player3351457","timestamp":1554472450,"content":"We got our leadership Frodo!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669085","commentId":3669085,"userName":"Felswrath","timestamp":1554473501,"content":"Leadership Dale Hero: Resourse Phase call out a card type, then if any player cards of this type enter your hand during the planning phase, you may reduce their cost by 1 for this round.\n\nTactics Gwaihir: Combat Action spend tactics resource to search your deck and discard pile for an Eagle ally and put it into play. At the end of the round if that card came from your discard pile, discard it. If it came from your deck return it to your hand.\n\nLore Palando: Response: After you play an ally, if that ally has a trait that no other allies you control posses, draw a card.\n\nSpirit Alatar: Alatar can pay for ally cards of any sphere. Forced: After an ally enters play, if you can spot another ally that shares the same sphere and at least one trait with this ally, raise your threat by one.\n\nSpirit (Beregond's Son): Response, after (Berry's Son) comits to the quest, you may spend 1 Spirit of Tactics resource to ready a character you control. Response, after you play an ally, you may discard a card from your hand with the same cost to gain 1 resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669109","commentId":3669109,"userName":"Amicus Draconis","timestamp":1554474546,"content":"I would like to have Saruman, Gwaihir, Targon, Angbor and Lothíriel. And if I can name more than five, then there would also be Paladin Took and Saradoc Brandybock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669360","commentId":3669360,"userName":"lleimmoen","timestamp":1554488800,"content":"I would certainly like to see\n\nTactics Glorfindel. This is easily my number hero wish, even though the Spirit hero version is my favourite hero already, and the ally is really good. But Noldor need a Tactics hero and there simply is not a better representation than Glorfindel at this point of time in Middle-earth.\n\nNeutral Saruman. Yeah, I like to dislike the character in the books, he is more of a Villain to me than Sauron in some respects, but I like to see his good side, and the game hero representation as I do not get to play the ally so much, the doomed 3 just seems too much for the ability, though it can save the game, sometimes.\n\nLore Gildor. This is a very unlikely wish as we are getting the Leadership version, which I am not too excited about, also because of the art. As an alternate, a Blue Wizzard.\n\nSpirit Boromir. Another never gonna be, but I just like Boromir so much and Spirit seems a good place for him too, at least as I see Spirit.\n\nLeadership Galadriel. A more active version. Not much more, but still. As an alternate, a Blue Wizzard.\n\nMore than any of these, I would like to see Tom Bombadil and Goldberry player cards, though. Without them the game will not feel complete."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669369","commentId":3669369,"userName":"GILLIES291","timestamp":1554489207,"content":"Spirit Boromir would be cool, maybe something like: Response; while Boromir is committed to the quest, after  an enemy is revealed from the Encounter deck he may take one damage to engage that enemy. \n\nAfter Boromir takes any amount of damage, ready him. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669372","commentId":3669372,"userName":"GILLIES291","timestamp":1554489470,"content":"> 4 hours ago, player3351457 said:\n> \n> We got our leadership Frodo!\n\nWas there another preview? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669422","commentId":3669422,"userName":"Felswrath","timestamp":1554492036,"content":"> 42 minutes ago, GILLIES291 said:\n> \n> Was there another preview? \n\nHe's in the French Preview, alongside a Contract card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293392-if-there-were-only-5-heroes-left/?do=findComment&comment=3669441","commentId":3669441,"userName":"lleimmoen","timestamp":1554492533,"content":"> 54 minutes ago, GILLIES291 said:\n> \n> Spirit Boromir would be cool, maybe something like: Response; while Boromir is committed to the quest, after  an enemy is revealed from the Encounter deck he may take one damage to engage that enemy. \n> \n> After Boromir takes any amount of damage, ready him. \n\nYeah, good idea. But I would also like to see his questing side, maybe using attack instead of willpower for a cost? Or adding to it..."}]}