{"url":"https://community.fantasyflightgames.com/topic/293656-mount-gundabad-when-to-flip-quest-cards/","title":"Mount Gundabad: when to flip quest cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293656-mount-gundabad-when-to-flip-quest-cards/?do=findComment&comment=3672909","commentId":3672909,"userName":"GrandSpleen","timestamp":1554839276,"content":"Hi all,\n\nThere was a contradiction in the rules insert versus the card text on the Mount Gundabad quest cards. Essentially: you don't flip these over immediately when you advance.  Instead, you flip from side A to B only at the beginning of the quest phase.\n\nThe rules insert said to flip them at the beginning of the staging step, while the quest cards themselves had the correct text--- flip them at the beginning of the quest phase.  I asked this question and got the reply from Caleb (lead designer).\n\nQuestion:\n\nHi, In Mount Gundabad, the instructions on the quest cards tell the player to flip from side 2A to side to 2B at the beginning of the quest phase. However, the rules insert says to do that at the beginning of the staging step, under the 'creating the quest deck' section (which parallels what players did in Flight from Moria). Which is correct? Thank you!\n\n \n\nResponse:\n\nThe cards are correct. You should flip the quest cards over at the beginning of the quest phase.\n\nI hope you enjoy Mount Gundabad!\n\nCheers,\n\nCaleb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293656-mount-gundabad-when-to-flip-quest-cards/?do=findComment&comment=3673092","commentId":3673092,"userName":"Wandalf the Gizzard","timestamp":1554848070,"content":"I guess FFG wanted an excuse to use the Golden Rule! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293656-mount-gundabad-when-to-flip-quest-cards/?do=findComment&comment=3681271","commentId":3681271,"userName":"Rouxxor","timestamp":1555492594,"content":"THe scenario seem better this way: else you just never apply those forced effects. But that is quite ****** up that the keyword of the mechanic is incorrect. Thanks for asking!"}]}