{"url":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/","title":"Gather Information, or How To Annoy Your Friend","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675350","commentId":3675350,"userName":"icabod","timestamp":1555020945,"content":"I was just looking through the cards that come in The Lost Realm, and noticed an oddity in the wording of Gather Information [http://hallofbeorn.com/LotR/Details/Gather-Information-TLR], a side-quest:\n\n> Quote\n> \n> Response: After this stage is defeated, each player may search his deck for 1 card and add it to his hand. Each player shuffles his deck.\n\nAm I correct in thinking that in a multi-player game if any player decides to search his deck for 1 card, all players must shuffle their decks?  That's how I read the wording, and I can think of a scenario where a player may not want to perform the search, but shuffling their deck would be annoying...\n\nPlayer A uses the action of Gildor Inglorian [http://hallofbeorn.com/LotR/Details/Gildor-Inglorion-THoEM] or Gandalf's Search [http://hallofbeorn.com/LotR/Details/Gandalf%27s-Search-Core] to arrange next 3 or X cards that they'll get from their deck... \"Hooray!\" they think. \"On the next three or X card draws I will get exactly what I want when I want it. Look at me, aren't I clever.\"\n\nPlayer B, on successfully completing the Gather Information side-quest, decides they want the ever-important Brok Ironfist [http://hallofbeorn.com/LotR/Details/Brok-Ironfist-Core] from his deck, so he decides to search for Brok, add him to his hand, and shuffle his deck.\n\nPlayer A glares at Player B, shuffles his deck in anger, bending some of his cards (\"Why did I not sleeve?!?\" he will later cry).\n\n \n\nOr am I mis-reading the card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675556","commentId":3675556,"userName":"dalestephenson","timestamp":1555039341,"content":"Since \"each player shuffles his deck\", player A will have to shuffle his deck regardless of whether anyone searched their deck for a card or not.  If he doesn't want to do that, he should convince the first player not to choose Gather Information as the current quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675603","commentId":3675603,"userName":"Miceldars","timestamp":1555047866,"content":"I'm pretty sure in my french version of this card, only players who search a card in their deck have to shuffle it. But maybe I am confusing with another card"},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675808","commentId":3675808,"userName":"Amicus Draconis","timestamp":1555073256,"content":"I would say differently. The effect is a response, so when no one searches their deck, no one has to shuffle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675895","commentId":3675895,"userName":"Miceldars","timestamp":1555079095,"content":"I just checked, and effectively each player have to shuffle his deck, no matter he search a card or not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675903","commentId":3675903,"userName":"icabod","timestamp":1555079854,"content":"As Amicus states, it's a response so it's optional... but if one player takes advantage of the response, then all players have to shuffle, is how it reads to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3675932","commentId":3675932,"userName":"PocketWraith","timestamp":1555081678,"content":"I mean, you skipped the step where player A can also search his deck for any card they want and add it to their hand before shuffling, an ability I would consider more valuable than simply arranging the next 3 draws."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3676020","commentId":3676020,"userName":"dalestephenson","timestamp":1555088070,"content":"A fair point about the response.  If the response is not taken, then no one does anything.  But there's no requirement that if the response is taken that *someone* gets a card, that part is optional.  If you're really trying to annoy your friend who doesn't want to shuffle, you'd take the response and *not* grab a card, just to make it clear that you're a griefer.\n\nIn practice, I can't imagine that Gather Information would be chosen as the current quest unless all players want to grab a card.  I typically pack one copy of the card in each of my two-deck fellowships, because gather information is how you help your friend, not how you annoy them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293789-gather-information-or-how-to-annoy-your-friend/?do=findComment&comment=3676171","commentId":3676171,"userName":"icabod","timestamp":1555092268,"content":"For me it's a rhetorical question, as I play solo and don't have The Lost Realm (tho' it's tempting to try sneaking it past the wife)... I was just curious on the wording being all players, rather than just those that searched their decks."}]}