{"url":"https://community.fantasyflightgames.com/topic/293963-quest-phase/","title":"Quest phase","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/293963-quest-phase/?do=findComment&comment=3678846","commentId":3678846,"userName":"Corvin90","timestamp":1555314126,"content":"Hi,\n\nI have a question regarding actions windows in the quest phase in a two player game :\n\nIs there an action window after the first player commits his characters to the quest and before the second player commits his characters to the quest ?\n\n \n\nThe fact this step is \"in green\" seems to suggest that there is an action window.\n\nBut the rulebook says\n\n> Quote\n> \n> Players have the opportunity to take\n> actions and play event cards at the end of each step.\n\nand\n\n> Quote\n> \n> Step 1: Commit Characters\n> \n> Each player may commit characters to the current quest\n> card. Characters are exhausted when they commit to\n> a quest. Players commit characters to the quest as a\n> team, starting with the first player, and then proceeding\n> clockwise around the table.\n\nI have a doubt because the rulebook says that \"actions can be taken at the end of each step\" and \"Players commit characters to the quest as a\nteam\" which may say that the committing is \"atomic\".\n\n \n\nI am asking because with dwarf decks, it could be useful to play \"Lure of Moria\" after the first player commits his characters to the quest and before the second player does if the second player have exhausted characters during the planning phase.\n\nThank you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293963-quest-phase/?do=findComment&comment=3679268","commentId":3679268,"userName":"sappidus","timestamp":1555346312,"content":"The Rules Reference (which you should take a look at if you haven't already, as it updates the original rulebook) specifies that there is no action window during the step of all players committing characters in player order [3.2], only before and after. So, with respect to action windows, committing is indeed atomic.\n\nNote, however, that you can still trigger appropriate Responses between players committing, e.g., Longbeard Elder or Firyal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/293963-quest-phase/?do=findComment&comment=3679418","commentId":3679418,"userName":"Corvin90","timestamp":1555353638,"content":"Thank you for your response and the reference to the Rules Reference. I did not know it existed and it is very useful !"}]}