{"url":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/","title":"Decipher&#039;s Lord of the Rings TCG","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3680254","commentId":3680254,"userName":"Felswrath","timestamp":1555421194,"content":"Did anybody else play Decipher's LoTR card game? \n\nI got into it at the very end: 2010, l believe. It was a nice time because I could get entire booster boxes for about $20, and I had a lot of fun with my sister and friends playing it. Ultimately, though, I sold it to fund other games, and it wasn't until later that I jumped on FFG's bandwagon.\n\nI have a lot of complaints with the movies, but the visuals are nowhere near the top, for the most part, I think Jackson did a phenomenal job with them! As such, the use of stills for card art was great, and it was always fun to find scenes that didn't make it into the movies (Such as Easterlings at Minas Tirith). Admitted, I much prefer the paintings from FFG, though.\n\nUnfortunately, it was at this point that my praise stops. The game's competitive nature does not strike me as very fitting for the Lord of the Rings. Having as many Frodo cards as players totally breaks any suspension of disbelief. Also the fact that Frodo had to bring the Ring through Rohan and never goes to Mount Doom was just weird. \n\nThe main thing I'd note is that Decipher's game was a decent game with a Lotr theme, while FFG's is a game that was designed up from LOTR.\n\nNot only would I never go back now, but I am honestly pained when I see the game and how much it pales in comparison to the current game. I don't regret having gotten into it at all, though, at the time, I had a lot of fun experiences and strengthened many relationships through it.\n\nWhat were your thoughts and experiences of the game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3680440","commentId":3680440,"userName":"Pericles","timestamp":1555432558,"content":"> 3 hours ago, Felswrath said:\n> \n> ... the use of stills for card art was great, and it was always fun to find scenes that didn't make it into the movies (Such as Easterlings at Minas Tirith). Admitted, I much prefer the paintings from FFG, though.\n> \n>  \n\nMy friends and I played it for a bit.  We were big into the SW:CCG, and interested in the Tolkien theme, so it seemed like a natural fit.  It didn't hold our interest long, however, mostly for the reasons you pointed out.\n\nI wanted to quote your comment above because our affinity to the SW:CCG actually tainted our opinion of the art for the SW LCG and LotR LCG.  As \"purists\", we thought the cards should only use movie stills, and not original art.  I'm glad we came around, however, as the artist's interpretations of the books are one of my favorite parts of the game now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3681819","commentId":3681819,"userName":"Hannibal_pjv","timestamp":1555526039,"content":"I have plaeyd the Middle earth the Wizard, Desipher ccg and this Lcg... the best one os old Middle earth the Wizard. It was middle each in the cards. The desipher and this Lcg ones Are draw to me. Very different games though... but the co-op suits nicely to Lotr theme so Lcg has Little edge in there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3683852","commentId":3683852,"userName":"gokubb","timestamp":1555685098,"content":"I agree with Hannibal. The Middle Earth CCG was the best LotR card game. I really like the LCG and it’s cooperative nature, but I prefer competitive games. Unlike Decipher’s, there was global uniqueness. If you played Frodo, your opponent couldn’t. And the goal of the game wasn’t to destroy the ring (although that was an alternate win condition). The goal of the game was to be the chosen wizard or nazgul to challenge the opposing side, achieved through gaining marshaling points. It was a complex and intricate system that I really wish was still around. \n\nI did play Decipher’s for some time. I liked it as a competitive game through the first cycle. However, once they jumped to the Two Towers block, they threw me off by replacing the site path instead of adding to it. Basically made a form of unofficial rotation that I just didn’t like.\n\nEdited April 19, 2019 by gokubb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3684106","commentId":3684106,"userName":"Hannibal_pjv","timestamp":1555710946,"content":"That is why I made own rules that allowed to play whole game from shire to mounth doom. It was / is good variant!\n\ni have 3 different variant. One is 9 location long, one is 12 and the longest is 27... the last one is too long IMHO, but I really like those 9 and 12 sites whole story variant :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3685539","commentId":3685539,"userName":"TheSpitfired","timestamp":1555927838,"content":"I absolutely loved the Middle-Eartch CCG by Iron Crown Enterprises, I try to not talk about it too much when in the LCG threads but the game was so well designed it's hard not to. What was really cool is that for a long time some of the early sets (base set + Dragons expansion) were still really cheap allowing for a low entry point that still gives you good deck variety, but now it seems like even those sets are going up in price - I just looked at Ebay while typing this in fact. Don't even think about the later sets like Lidless Eye (which let you play as the Ringwraiths) as that set has always been expensive. \n\nThat being said, the Decipher game looks to be at that spot - lots of cheap playable starter decks and some of the mechanics do look really interesting - If I got this right, I like how playing your hero cards generates points for your opponent to play their shadow cards. That to me seemed like a good enough take to distinguish it from Middle-Earth. Plus Decipher had a knack for finding good stills to put on their cards in all their games, not just LOTR. I'd still say the LCG far and wide has the best art, and I love the solo/cooperative aspects of it. Short of re-releasing Middle-Earth CCG as a living card game of its own I think you'd be hard pressed to do a LOTR card game as well as what FFG has done.\n\nSo I guess you could classify Decipher's LOTR CCG as one I wanted to check out but never committed to. Saved the money for LCG sets and packs instead. Maybe someday..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3690418","commentId":3690418,"userName":"CDavis7M","timestamp":1556393244,"content":"I play FFG's LCG (obviously) and Middle Earth CCG (online and at CONs). I never got into Decipher's LotR TCG but I loved Star Wars CCG back in the day. I'm not sure how active LotR TCG is, or whether it's worth getting into. But maybe I should pick up a few packs and check it out.\n\n \n\nMy favorite aspect of the LCG is that you can play it solor, which is how I do most of my gaming. I hope the solo LotR experience continues on. And with Journeys in ME allowing for that, things are looking great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3690559","commentId":3690559,"userName":"Vince79","timestamp":1556411231,"content":"For those of you who played Decipher's LotR TCG, could you use multiples of each card?   Like in FFG's LOTR LCG, you can have up to three copies of each card.  How many could you have in Decipher's game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3690791","commentId":3690791,"userName":"Felswrath","timestamp":1556452754,"content":"I'm pretty sure it was 3 in that game too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3691293","commentId":3691293,"userName":"Vince79","timestamp":1556509043,"content":"> 15 hours ago, Felswrath said:\n> \n> I'm pretty sure it was 3 in that game too.\n\nThanks, Felswrath."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3691306","commentId":3691306,"userName":"BobCharlie","timestamp":1556510665,"content":"I played the digital version of Decipher's LOTR TCG. It was pretty well done for the time (2003) and had sealed deck tournaments, draft tournaments, league play, and of course casual play. A company called Worlds Apart in Denver developed it, but it was later bought by SOE (Sony Online Entertainment) and they proceeded to kill it off along with several others such as Star Trek Online CCG, Magic: The Gathering Tactics, and Pirates CSG Online.  They actually mailed physical promo cards for LOTR release events, which was pretty cool. \n\nThe digital version still lives on in a much more basic form than Worlds Apart's version. Just look up Gemp-LotR and you can play it for free!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3691654","commentId":3691654,"userName":"Gizlivadi","timestamp":1556550973,"content":"> 10 hours ago, Vince79 said:\n> \n> Thanks, Felswrath.\n\nActually it was 4."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294034-deciphers-lord-of-the-rings-tcg/?do=findComment&comment=3694287","commentId":3694287,"userName":"nekhomanta","timestamp":1556799075,"content":"> On 4/29/2019 at 5:04 AM, BobCharlie said:\n> \n> I played the digital version of Decipher's LOTR TCG. It was pretty well done for the time (2003) and had sealed deck tournaments, draft tournaments, league play, and of course casual play. A company called Worlds Apart in Denver developed it, but it was later bought by SOE (Sony Online Entertainment) and they proceeded to kill it off along with several others such as Star Trek Online CCG, Magic: The Gathering Tactics, and Pirates CSG Online.  They actually mailed physical promo cards for LOTR release events, which was pretty cool. \n> \n> The digital version still lives on in a much more basic form than Worlds Apart's version. Just look up Gemp-LotR and you can play it for free!\n\nYou are talking about digital version only. Decipher was developing physical cards until his license expired. They didn't renew it, especially having a lot of financial problems due to fraud (caused by financial director if I recall correctly) and focused only on own brands that didn't work out. For example Wars (CCG with Star Wars CCG mechanics but based on own world) and then company tried to build up on Fight Club game with weird distribution system (viral based on word of mouth, no store presence etc). I collected and played the Decipher game mainly during \"film trilogy\" blocks (sets 1-10). I think that \"pool\" mechanic was very clever and you could create plenty of thematic decks based on different affiliations/mechanics."}]}