{"url":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/","title":"Guardian of Esgaroth stat limit (add Wild Stallion or Faramir)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/?do=findComment&comment=3682693","commentId":3682693,"userName":"JYoder","timestamp":1555591849,"content":" \n\nGuardian of Esgaroth says \"Limit +3 to each\" but I assume that's only for the 3 attachments on him and not a max on his stats overall. Meaning, if one of his attachments is Wild Stallion, then he'd have +4 to each stat?\n\nAnd just as if you had ally Faramir in play, then he could be +5 willpower... but I'm not sure, as maybe \"Limit +3 to each\" should be viewed as an overall max on each stat. Thoughts?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/?do=findComment&comment=3682706","commentId":3682706,"userName":"Alonewolf87","timestamp":1555592521,"content":"The limit is only on its own ability, not on other stats boosting abilities which might affect him.\n\nSo a Guardian of Esgaroth with attached a Wild Stallion, a Squire Helm and Valiant Determination and considering that LeBrand is in play would be a 6 Willpower, 5 Attack, 5 Defense, 7 hit points monster ally which does not exhaust to quest.\n\nEdited April 18, 2019 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/?do=findComment&comment=3682729","commentId":3682729,"userName":"JYoder","timestamp":1555594341,"content":" \n\nThanks. And that's an official ruling, or just what the community believes? Not to be devil's advocate, but that \"Limit +3 to each\" does seem rather definite, and doesn't explicitly say it's in regards to the attachments.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/?do=findComment&comment=3682743","commentId":3682743,"userName":"dalestephenson","timestamp":1555594740,"content":"It's in parens immediately after his own ability was described, so there's no reason to think it applies to anything but his own ability.  That would be akin to \"Limit 1 per hero\" attachments preventing you from putting any other attachments on that hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294153-guardian-of-esgaroth-stat-limit-add-wild-stallion-or-faramir/?do=findComment&comment=3682760","commentId":3682760,"userName":"Alonewolf87","timestamp":1555595354,"content":"> 16 minutes ago, JYoder said:\n> \n> Thanks. And that's an official ruling, or just what the community believes? Not to be devil's advocate, but that \"Limit +3 to each\" does seem rather definite, and doesn't explicitly say it's in regards to the attachments.\n\nI don't think we need an official ruling since if that limit was to be applied to any kind of stat boosting it would be worded differently. As it stands it's clear that the limit should be applied only to the Guardian's own ability.\n\nIf you want some sort of \"official\" confirmation I will let you know that during the Lure of Middle Earth of this March I played a Dale deck using that same combination I mentioned at a table with Caleb Grace againts Fire in the Night and he didn't raise any objections to it, so it seems legit... (but beware any treacheries/shadow effects blanking characters text boxes since they will rob the Guardian of many of its boosts possibily even killing it if it was already wounded)\n\nEdited April 18, 2019 by Alonewolf87"}]}