{"url":"https://community.fantasyflightgames.com/topic/294692-tale-of-tin%C3%BAviel/","title":"Tale of Tinúviel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/294692-tale-of-tin%C3%BAviel/?do=findComment&comment=3692109","commentId":3692109,"userName":"player3351457","timestamp":1556574913,"content":"The text reads: \"Exhaust a Noldor character to ready a Dúnedain character, or vice-versa. Until the end of the phase, add the exhausted character's printed Willpower to the other character's Willpower, Attack, and Defense.\"\n\nIt does not specify whether or not these characters need to be under your control. Usually, however one cannot exhaust a character that one doesn't control. So if I have a setup where player 1 has noldor and player 2 has dunedain, player 1 can exhaust the noldor to ready the dunedain, but not the dunedain to ready the noldor. Correct? Or because of the absence of the phrase \"you control\", can player 1 exhaust the dunedain?\n\nFurthermore, if both are controlled by player 2, can player 1 still play this card?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294692-tale-of-tin%C3%BAviel/?do=findComment&comment=3692117","commentId":3692117,"userName":"PocketWraith","timestamp":1556575414,"content":"You need to control the character you exhaust, as exhausting that character is part of the cost of the effect and you cannot pay costs with cards you don't control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294692-tale-of-tin%C3%BAviel/?do=findComment&comment=3692133","commentId":3692133,"userName":"Wandalf the Gizzard","timestamp":1556576491,"content":"Whoever plays Tale of Tinuviel must control the character that becomes exhausted, but the character that gets boosted and readied can be under any player’s control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294692-tale-of-tin%C3%BAviel/?do=findComment&comment=3692333","commentId":3692333,"userName":"Halberto","timestamp":1556608350,"content":"Nice but niche card\n\n \n\nYes, to play it you must control the character who exaust.  The readied and boosted character can be under any player control."}]}