{"url":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/","title":"Solo League 9 -- Dwarrowdelf (with Hobbit Saga cards)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3694021","commentId":3694021,"userName":"dalestephenson","timestamp":1556759285,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the KD/Dwarrowdelf saga. The quests are:\n\n1) Flight from Moria (Khazad Dum deluxe)\n2) The Watcher in the Water\n3) Shadow and Flame\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Bifur, Dwalin, Lore Aragorn, and Elrond.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Shadow and Flame and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Wacher in the Water it does not matter how many tokens I needed to defeat Flight from Moria.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker. You are required to reveal which Heroes you used, and how many cards in your deck came from outside KD/Dwarrowdelf, Hobbit saga and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from KD/Dwarrowdelf, Hobbit saga or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from Hobbit saga and KD/Dwarrowdelf. More is better.\n\n3rd) The number of heroes used from this list: Bifur, Dwalin, LoAragorn, Elrond. More is better.\n\n4th) The number of cards in the deck outside Hobbit saga and KD/Dwarrowdelf. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Khazad Dum, Watcher in the Water, and Shadow and Flame. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in April's Solo League (if you didn't play or finish April's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for July's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in July's league. June's cycle will be chosen by the winner of April's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nFlight From Moria: May 13th\nWatcher in the Water: May 20th\nShadow and Flame: May 27th\n\n😎 I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1jANFIG04ZYHNaKqFMfhVC85L0k5FVaXYgm7u7aHrgcM/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1jANFIG04ZYHNaKqFMfhVC85L0k5FVaXYgm7u7aHrgcM/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3694686","commentId":3694686,"userName":"Wandalf the Gizzard","timestamp":1556826703,"content":"Let's kick things off! Thanks for running this, Dale!\n\nHere's the deck I'm using: https://ringsdb.com/decklist/view/11998/sololeague9-1.0 [https://ringsdb.com/decklist/view/11998/sololeague9-1.0]\n\nI essentially threw all caution to the wind by starting with 35 threat, but 3x Sneak Attack and Gandalf will help. The deck is basically a Dwarf swarm deck, with resource smoothing from Elrond. There are only four outside cards used, and all of them are from a second Core Set.\n\nI beat Flight from Moria on the first attempt, but I decked myself, lost Gimli to A Foe Beyond, and almost threated out before I sealed the win! I had a great starting hand, but the encounter deck fought back with a Goblin Archer, and both Great Cave Trolls showing up very early. New Devilry prevented me from grabbing the Abandoned Tools with Narrow Paths, which would prove pivotal. By the time I arrived at Escape from Darkness, my deck was empty and my board was full. At this point I had to decide whether I wanted to cycle back through the quest cards for Narrow Paths to grab Abandoned Tools, or camp out and sit until it came off the top of the encounter deck.\n\nWell, I chose the latter, and Abandoned Tools was LITERALLY THE LAST CARD IN THE ENCOUNTER DECK! :lol: [//content.invisioncic.com/Mfantflight/emoticons/default_laugh.png] My heart skipped a beat when it went by as a shadow card, but thankfully the when the reshuffle regressed to the mean; the Tools where only four cards deep. Dain had a life-time supply of Cram by now to sustain his excavation efforts, and I escaped from the Black Pit by the skin of my teeth, at forty-five threat.\n\nEdited May 2, 2019 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3694784","commentId":3694784,"userName":"dalestephenson","timestamp":1556833912,"content":"I'm running a Stereotypical non-Gandalf Vilay deck -- I was toying with other deck ideas, but never got around to making a new deck and I like to have a complete sample entry in the spreadsheet before posting, so I grabbed a deck I'd already published.  Turns out it only has four outside cards as well (ABB, 2x Gildor, and Haldir).\n\nIf Watcher in the Water had orcs, I'd want to do a Dwalin deck just for fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3695487","commentId":3695487,"userName":"Wandalf the Gizzard","timestamp":1556903745,"content":"I beat Watcher in the Water with zero tokens after a hard-fought slog-fest. Two Mountain Wargs were revealed on round one, and Bitter Winds gave me no room to work. I crawled back to the top though, and by the time I advanced to stage two, the Watcher had nothing on my trio of Battlemasters.\n\nI'm starting to realize, though that this deck is horrendously ill-suited for Shadow and Flame. 😕"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3695744","commentId":3695744,"userName":"Wandalf the Gizzard","timestamp":1556922252,"content":"And the sweep is complete! Elrond and Co took down Durin's Bane on the first attempt pretty handily, despite not matching up very well with Shadow and Flame. I unfortunately had to feed the Balrog a bunch of three cost allies since the deck had very few true chumps, but it didn't matter in the end. For the first time in three games I had Steward of Gondor and a card draw agent in my opening hand. I'm quite impressed with my new Elrond/Dwarf deck! It's scrappy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3696433","commentId":3696433,"userName":"Vermithrax","timestamp":1557107589,"content":"Thanks for running this.  I'm onboard this month and here we go with Flight From Moria...\n \nGame 1:  I end up having to accept my second mulligan which was not a good mix.  Then the first card the encounter deck throws my way is Great Cave Troll.  Tried to overcome the encounter deck but just started too far behind the curve.  Threat gets out of control, Cave Troll pops in for a visit and whittles away all my guys making the one battle master I managed to put into play useless.  I quickly run out of allies and that was that.\n \nGame 2:  This one also got off to a rocky start.  I jousted with the encounter deck for a few rounds until I finally drew Gandalf to go with my Sneak Attack.  He got my engine going by drawing cards which lead to A Very Good Tale dumping more dwarves on the table.  Still took a bit of dancing with the encounter deck as over time it built up a couple Goblin Archers.  Had to use more Gandalf power to get them out of the staging area.  Meanwhile A Very Good Tale is doing its thing and i'm building up quite the pack of dwarves.  The encounter deck wasn't out of tricks though as it threw two Great Cave Trolls at me, fortunately at different times.  I chumped both and got lucky with the shadow cards.  My battle masters made sure the trolls didn’t stick around long.  Abandoned Tools got tossed away as a shadow so i had to use Narrow Paths to get them back.  All the while The Nameless Fear threat keeps going up (thanks trolls).  There was one point where I thought I lost due to A Foe Beyond but fortunately Dori was around to take the hit.  I finally reached Escape from the Darkness and between a couple Crams and an Erebor record keeper Bombur was able to dig the party out.  At game end there was 13 threat on The Nameless Fear.\nEdited May 6, 2019 by Vermithrax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3697872","commentId":3697872,"userName":"rees263","timestamp":1557325051,"content":"I'll be taking part in the league for the first time this month. I tested two different decks and eventually settled on Dwarves. This is the deck:\n\nhttps://ringsdb.com/decklist/view/12068/sololeague9-1.0 [https://ringsdb.com/decklist/view/12068/sololeague9-1.0]\n\nI believe based on the rules I'm using three outside cards (One each of extra copies of Unexpected Courage, A Test of Will and Erebor Hammersmith), please correct me if I'm wrong.\n\nI made it through Flight From Moria with no tokens. There was a brief moment of panic on turn two, when Hasty Council was revealed followed immediately by A Foe Beyond and I was forced to deal 4 damage to Dain. However, this did allow me to bypass the Wrong Turn quest card. Abandoned Tools was discarded early as a Shadow card, but I got it back with Narrow Paths. Mostly I got a fairly easy ride from the encounter deck. The only thing of note was that seemingly every time I killed a Goblin Spearman it replaced itself via its Shadow Effect. Escape from Darkness was the very last quest card that I saw (having bypassed all the others except Narrow Paths), which I cleared in three turns even with a Cave In thanks to Erebor Record Keeper. Dain would have perished to a Shadow Effect on the last turn had Dori not been in play. The Nameless Fear was at five threat.\n\nWhen I first played this quest progression style I had so much trouble with it 2-handed, it was strange to revisit it and have such an easier time. It was also a pleasant realisation that quite a few of the encounter cards are basically negligible in solo like The Mountain's Roots."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3697947","commentId":3697947,"userName":"Wandalf the Gizzard","timestamp":1557331058,"content":"I just realized Miner of the Iron Hills is a core set two-of and Dain is also an outside card, so I'm running six outside cards. I updated the google document accordingly."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3698257","commentId":3698257,"userName":"dalestephenson","timestamp":1557362213,"content":"Only outside cards actually in the deck count for the first tiebreaker, so Dain should not be added to the count."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3698523","commentId":3698523,"userName":"Wandalf the Gizzard","timestamp":1557407003,"content":"Okay, great! Thanks for the heads-up. Hopefully that's the last mistake."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3698627","commentId":3698627,"userName":"rees263","timestamp":1557416593,"content":"Watcher in the Water:\n\nStarted off with a Striking Tentacle in the staging area which is not ideal. Decided I would skip questing in order to deal with it ASAP. I was able to defend it's attack. but risked an undefended attack from another Tentacle that showed up during staging. Thanks to Erebor Record Keeper I was able to dispatch the Striking Tentacle and didn't see another one all game. Fortunately that was the most pressure I was under for the whole quest. By the end of round two I had an empty staging area, no engaged enemies and two characters with Grasping Tentacles attached.\n\nA couple of Stagnant Creeks showed up (one hit, one miss), but overall a fairly easy ride for the rest of the quest. By the time the Watcher showed up I was well prepared. Couldn't engage straight away because there was a Thrashing Tentacle that was refusing to die and Henamarth Riversong was no help either because I wasn't drawing the right cards to clear the Doors of Durin. In the end I had to Gandalf away the Tentacle and then killed the Watcher in one go.\n\nNo tokens required, still hate tentacles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3703407","commentId":3703407,"userName":"Vermithrax","timestamp":1558046725,"content":"I had a moment to take on The Watcher in the Water\n \nGame 1:  The encounter deck leads with Warg Lair which brings out a Warg.  Then every round thereafter the encounter deck revealed a tentacle.  Too many tentacles for my dwarf swarm to keep up with so the encounter deck wins this one.\n \nGame 2: This time the encounter deck went easy on the initial reveals (two Disturbed Waters and some locations) allowing me to rush a bunch of dwarves into play with the help of Gandalf and A Very Good Tale.  I soon had a good mix of utility dwarves including Dori, a Battle Master, Longbeard Map-Maker, and Erebor Record Keeper.\n \nWhen i got to stage 2b I had cleared the board of enemies.  With no tentacles in play I was able to engage The Watcher, block with Bombur who had A Burning Brand and then Sneak Attack a second Battle Master to get rid of The Watcher.\n \nOne token."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3703773","commentId":3703773,"userName":"rees263","timestamp":1558100856,"content":"Shadow and Flame started well - the plan was to use Nori to avoid Durin's Bane while building up the Dwarf swarm. I had plenty of Allies in my hand to keep my threat at zero. However, I did lose few early to a treachery and due to failed questing (curse you Orc Drummer!).\n\nI mostly revealed enemies early on and chose to engage a few. Unfortunately this lead once again to multiplying Goblins. \n\nAfter the Drummer fiasco it took all the allies in my hand to drop my threat down to one, and I was forced to travel to Second Deep to avoid Durin's Bane (thanks to Ever My Heart Rises). Thankfully at this point Henamarth Riversong showed up and the rest was pretty straightforward.\n\nGandalf showed up and helped me put more than 30 damage onto Durin's Bane over two turns before pushing him into the Dark Pit. It was a close run thing since there were only 8 cards left in my deck at the time.\n\nFinal tally: 0 tokens"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3705701","commentId":3705701,"userName":"Vermithrax","timestamp":1558388790,"content":"Finished up Shadow and Flame but it took me 2 tokens to do so.\n\nGame 1:  I could not get the draw engine going fast enough and my allies kept getting picked off by the Balrog.  This prevented my ability to establish a board state and the encounter deck wins.\n\nGame 2:  Balrog acquires a taste for dwarves.  Encounter deck wins.\n\nGame 3:  Had a really good start but the encounter deck was also very determined.  Early rounds were touch and go.  Ended up fighting the encounter deck for 15 rounds.  Funniest thing about this game was the encounter deck running low on cards while getting filled up with Ranging Goblins.  They would pop out for a cheap shot, Durin’s Bane would destroy an ally and Ranging Goblin(s) would dive back into the encounter deck.  This game I held my board state and incrementally increased my ally count.  I got a couple battle masters into play and whittled the Balrog down until I could reach the Dark Pit and toss it in.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3706987","commentId":3706987,"userName":"dalestephenson","timestamp":1558540870,"content":"Sorry for missing the update last week.\n\nEscape from Moria is an inconsistent quest -- if you get the random quests in the right order, it can be fairly straightforward, but bad luck with Foe Beyond (or Sudden Pitfall) can be miserable.  I probably had 10 different stage 2s, but Foe Beyond never showed up and I *finally* got the Tools on Elrond, with UC and Miruvor.  Three readies in the Refresh phase, I had only to survive one more card -- and I had Test of Will in hand in case it was New Devilry.  Most of us managed to make it through (outside cards in parens)\n\n0 rees263 (3)\n0 dalestephenson (4)\n0 Wandalf the Gizzard (5)\n0 Thanee (27)\n1 Skihorse4848 (0)\n1 Vermithrax (9)\n\nWatcher in the Water has those miserable tentacles, which protect a regenerating boss enemy, or an alternate win condition of Durin's Door which can miserable without scrying.  But as luck would have it, all of us have Lore access. Praise Hennamarth Riversong!\n\n0 Skihorse4848 (0)\n0 rees263 (3)\n0 dalestephenson (4)\n0 Wandalf the Gizzard (5)\n0 Thanee (27)\n1 Vermithrax (9)\n\nHere's the standings before Shadow and Flame, the toughest of the lot:\n\n0 rees263 (3)\n0 dalestephenson (4)\n0 Wandalf the Gizzard (5)\n0 Thanee (27)\n1 Skihorse4848 (0)\n2 Vermithrax (9)\n\nThere's a three day weekend coming up (at least in the US), so plenty of time to join and play all three quests if you like."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3712709","commentId":3712709,"userName":"dalestephenson","timestamp":1559407848,"content":"My first try against Shadow and Flame was thwarted by a shadow taking out Beravor after Vilya failed to provide a chump blocker, but the second time I was able to chump/heal until my accumulated Gandalf plays got enough damage to dispense with the Balrog.  Here's how we did against the final quest (outside cards in parens):\n\n0 rees263 (3)\n0 Wandalf The Gizzard (5)\n0 Thanee (27)\n1 dalestephenson (4)\n2 Vermithrax (9)\n5 skihorse4848 (0)\n\nThe final standings are (unsurprisingly) in the same order:\n\n0 rees263 (3)\n0 Wandalf The Gizzard (5)\n0 Thanee (27)\n1 dalestephenson (4)\n4 Vermithrax (9)\n6 skihorse4848 (0)\n\nrees263 takes first place and can choose the cycle for July's league.  Wandalf is second and can choose a quest to play from the cycle.  Thanee is third and can exclude a cycle.  And skihorse4848 gets to choose a supplementary cycle for player cards.\n\nThank you for playing and I apologize for my tardy updates.  I hope you will play in June's league, featuring print-on-demand quests with Ered Mithrin/Mirkwood cards.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3712746","commentId":3712746,"userName":"rees263","timestamp":1559413985,"content":"I'd like to choose the Dream-chaser cycle please"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3712805","commentId":3712805,"userName":"Wandalf the Gizzard","timestamp":1559424407,"content":"I don't have any Dream-chaser quests, so won't participate in that league. Dale, how about letting someone else chose? Anyway, thanks for running this!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3712877","commentId":3712877,"userName":"dalestephenson","timestamp":1559437779,"content":"I'll let Thanee decide whether to pick or exclude, and let the other choice drop down to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3712878","commentId":3712878,"userName":"Wandalf the Gizzard","timestamp":1559437913,"content":"That'll work. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3733234","commentId":3733234,"userName":"dalestephenson","timestamp":1562102001,"content":"Thanee selected Temple of the Deceived.  I'll exclude Voyage Across Beleagar since we played that one last time Dreamchaser came up.  Randomly selecting the other quests:\n\nFate of Numenor (Deluxe quest #2)\nRaid on the Grey Havens (Deluxe quest #3)\nTemple of the Deceived (AP #3)\n\nMandatory hero will be Cirdan, Galdor, or Elfhelm.  Skihorse4848 can choose the supplementary player card cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/?do=findComment&comment=3733362","commentId":3733362,"userName":"rees263","timestamp":1562119245,"content":"Aww, not one sailing quest 😢"}]}