{"url":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/","title":"Flight from Moria - Frustrating!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699736","commentId":3699736,"userName":"tripecac","timestamp":1557533357,"content":"I was doing pretty well.  I had the abandoned tools and was chipping away at the exit.\n\nBut then I drew New Devilry, so I had to switch to another quest card.\n\nI found the exit again, and was chipping away (starting with 0 progress) and had 3 on it and then again, New Devilry came and threw that out the window.\n\nA third time I found the exit, and was progressing nicely, but then again, you guessed it, New Devilry.\n\nThis time I found the a quest card that let me choose to either discard a card each (and eliminate the player if the card is a treachery) or pick another quest card.  I was very tired by this point, so I chose the riskier option.  I discarded the first card and it was an enemy (good).  For the 2nd player it was a treachery, so bye bye 2nd player.  And then, thanks to some lousy shadow cards, my other player lost 2 heroes by the end of the turn.\n\nSo, it all came crumbling down.\n\nWhat an aggravating quest!\n\nI think what really bothers me is not knowing how much time it will take to finish.  I was expecting an hour, but New Devilry kept prolonging the game, until I passed the 2 hour mark.  By then I was really, really tired of the scenario, so I stopped playing safe and took a risk that lost me the game.\n\nHas anyone else found this scenario frustrating and exhausting?\n\nAre there other scenarios like this in later cycles, where the game seems to be \"toying with us\" until we finally quit (or self-destruct) from exhaustion?\n\nEdited May 11, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699816","commentId":3699816,"userName":"rees263","timestamp":1557546376,"content":"One of the ways around this is to include readying effects so that you can put more than one progress token on the quest each round. This won't eliminate the chance of seeing New Devilry, but there will be fewer opportunities for it to ruin your day"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699859","commentId":3699859,"userName":"tripecac","timestamp":1557557671,"content":"I played again a few hours later, and managed to get Unexpected Courage on Dain (who had Abandoned Tools).  This time I won, and overall it felt pretty easy, even after losing 2 heroes on the way (I was playing 2-handed). \n\nSongs are awesome, especially when used with Steward of Gondor and Horn of Gondor.  Those 2 heroes were not actually missed, especially since by then I had lots of allies out.\n\nAnyway, something I thought about before I played that second game:\n\n1) Playing 2-handed seems to lengthen the game, which makes losing more painful.\n\n2) Using ringsdb to deck build, and then exporting to OCTGN means each deck build has quite a bit of \"overhead\", which makes losing more painful.\n\nIs that what you guys have noticed too? \n\nDo you also feel that playing 2-handed via OCTGN makes losing more \"painful\" than playing 1-handed and/or with physical cards?\n\nWhat do you do to make losing less painful?\n\nIs this where Easy Mode comes into play?\n\nEdited May 11, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699892","commentId":3699892,"userName":"Amicus Draconis","timestamp":1557569847,"content":"Using Eleanor and Boromir would certainly help. Otherwise have a lot of Tests of Will and readying effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699939","commentId":3699939,"userName":"PocketWraith","timestamp":1557580510,"content":"A while back I wrote a blog post about how I might redesign (Nightmare) Flight from Moria to fix some problems with it. The potential for New Devilry to appear partway through a slow victory condition was one of the things I particularly felt should be changed.\n\nhttps://wardenofarnor.wordpress.com/2017/12/29/what-might-have-been-flight-from-moria/ [https://wardenofarnor.wordpress.com/2017/12/29/what-might-have-been-flight-from-moria/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3699951","commentId":3699951,"userName":"Vermithrax","timestamp":1557585610,"content":"A few of us are playing Flight From Moria as part of the May solo league.  If you are looking for deck thoughts you could poke around on that thread.\n\nhttps://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/ [https://community.fantasyflightgames.com/topic/294790-solo-league-9-dwarrowdelf-with-hobbit-saga-cards/]\n\nThe Flight From Moria exit can be a real pain since it needs 4 progress and you can only do that with a single exhaust every round.  As rees263 mentions you want to be ready for that.\n\nThere will be certain quests that seem insurmountable at first.  I think this is part of the game's appeal.  When i first started playing it took me a bit to accept that some quests you just have to design for.  I've come to really enjoy that.  Other quests give you an easier time and allow you to explore different win conditions and therefore different decks.  Those are fun.\n\nI hear you on the overhead.  I don't play 2-handed for that reason.  I prefer a single deck.  This comes with its own challenges.\n\nYou could try 'easy' mode or perhaps the variant we use during the solo league (see link above)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295155-flight-from-moria-frustrating/?do=findComment&comment=3700164","commentId":3700164,"userName":"Wandalf the Gizzard","timestamp":1557617081,"content":"I'm only frustrated with Flight from Moria when New Devilry wrecks me while I'm on Escape from Darkness. Because of that, I run some cancellation to make sure that doesn't happen. If New Devilry is revealed more than once in a solo game, well there's not much you do about that sort of bad shuffle."}]}