{"url":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/","title":"Secrecy in Dwarrowdelf - Try it or wait for bigger card pool?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704235","commentId":3704235,"userName":"tripecac","timestamp":1558150190,"content":"I'm going progression style, and today opened Redhorn Gate.  It introduces the Secrecy mechanic.\n\nWhenever I open a new pack, I put at least one copy of each new card in one of my decks (I play 2 handed).  That way, I force myself to learn the new cards instead of sticking with my old favorites.  If I then lose the quest, I am free to go back to using whatever cards I want.\n\nI recently finished the 3 Khazad Dum quests with 2 Dwarf-themed decks.  All 6 heroes were Dwarves, and almost all of the allies (I couldn't resist Gandalf and a Northern Tracker or two). \n\nI wanted to start the Dwarrowdelf cycle with similarly Dwarf-centric decks, but now Redhorn Gate adds Secrecy cards, and at least one Hobbit-specific card. \n\nSo, in order to use the new cards, I had to add at least one Hobbit, and then I realized that my Dwarves' starting threats were too high, so I started trying to find ways to reduce them, and then started looking at Denethor as a way to take advantage of one of the Secrecy cards, and then started thinking about 2 hero decks and by then was utterly overwhelmed by the number of changes I would need to make, so I stopped trying to deck build and started reading articles about Secrecy.\n\nThe problem is, most of the prominent Secrecy articles were written long after the Dwarrowdelf cycle.  They, in fact, often state that Secrecy wasn't really viable \"in the beginning\" and only recently started becoming worthwhile, thanks to the increased card pool.\n\nSo I am wondering:\n\nShould I try Secrecy now,  \"progression style\" (which means limiting the cards to Dwarrowdelf and earlier), or should I save my attempts at Secrecy for a later cycle?  If so, at what point does Secrecy become worth trying out?\n\nNOTE: I'm not really into deck building (yet), but I don't want to copy other people's decks, so I'm not looking for specific card or deck advice.  I'm just wondering if running a Secrecy deck (or two) with Dwarrowdelf-era cards would be fun... or frustrating. \n\nThanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704241","commentId":3704241,"userName":"PocketWraith","timestamp":1558151777,"content":"OK, so firstly I'm just going to tell you that the final quest of the cycle drops everyone's threat to 0 at the start, so that's a perfect environment for Secrecy even if you don't use it anywhere else.\n\nAs to the possibility of using it elsewhere, Dwarrowdelf-era Secrecy can be done, but it pretty much requires you to go 2-hero and can be hard to pull off. This will probably be exacerbated by your additional conditions, trying to fit a bunch of other new cards into your decks at the same time. And add to that the fact that the Secrecy cards are spread throughout the cycle, so building a Secrecy deck for Redhorn Gate is going to mean expending a fair amount of effort in your deckbuilding just to get Timely Aid and Needful To Know. I mean, Timely Aid is a great card in Secrecy, but it's harder to justify building Secrecy just for that one card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704243","commentId":3704243,"userName":"tripecac","timestamp":1558152031,"content":"Okay, so to save some headache, should I skip the new Secrecy (and Hobbit) cards for now, and come back to them in a later cycle (or perhaps the last quest of Dwarrowdelf)?\n\nDo the Dwarrowdelf packs add other [good] non-Secrecy themed cards, or is Secrecy the main focus of this cycle?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704362","commentId":3704362,"userName":"Wandalf the Gizzard","timestamp":1558188700,"content":"I only built and played a secrecy deck once I had all six dwarrowdelf cycle adventure packs. That worked just fine for me, so I'd recommend it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704391","commentId":3704391,"userName":"Vermithrax","timestamp":1558193314,"content":"\nYou should try to make a deck which takes advantage of secrecy.  Without giving you a deck list or even 'spoiling' future cards I'll say this:\n\nSecrecy (at least to me) is not about constantly maintaining threat at 20 or below.  The mechanics of the game actively fight against this. Also if you try to maintain that low threat the entire game you'll find you've packed your deck with threat reduction cards and not much else.\n\nWhat does work is treating Secrecy like an early game ramp.  Consider the one you just opened in the Redhorn Gate - Timely Aid.  This is an amazing card and i've built decks around it (and Sneak Attack).  Heck I'll even play that thing in a leadership deck because leadership can afford to just pay 4 and be spoiled for choice when it comes to which ally to drop into play.\n\nAnyway if you can come up with a deck that has starting threat 20 or below - then you've got the possibility of bringing a strong ally into play for one resource (Northern Tracker anyone? ) on turn one.  Thats really good.\n\nHowever, until you open up more Dwarrowdelf packs you'll be missing two other key cards which opens the secrecy ramp strategy up.\n\nIn summary - try it - but wait till you've found the other two cards.  I'm intentionally not mentioning them because you sound like the kind of player that likes the discovery.  Have fun discovering :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited May 18, 2019 by Vermithrax"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295387-secrecy-in-dwarrowdelf-try-it-or-wait-for-bigger-card-pool/?do=findComment&comment=3704814","commentId":3704814,"userName":"tripecac","timestamp":1558281800,"content":"Thanks!\n\nI went ahead and used my Dwarf decks to play The Redhorn gate, and managed to win.  Tough scenario!  The third stage caught me by surprise, and killed Dain!  I still managed to win, but it was a struggle.\n\nI wonder how a secrecy deck would deal with that third stage.  The key would be high-willpower allies, right?  How many allies are 2 willpower or more, though?"}]}