{"url":"https://community.fantasyflightgames.com/topic/295427-erestor-lore-hero/","title":"Erestor - lore hero","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295427-erestor-lore-hero/?do=findComment&comment=3704747","commentId":3704747,"userName":"bitzurock","timestamp":1558262351,"content":"Hi!\n\nQuestion..the printed text on this card says:\n\n\"Draw 3 additional cards at the beginning of the resource phase.\n\nAt the end of the round, discard all cards in your hand.\"\n\nIs this a forced action? Or we can trigger it only when we decide."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295427-erestor-lore-hero/?do=findComment&comment=3704780","commentId":3704780,"userName":"icabod","timestamp":1558273465,"content":"From the FAQ, 1.36...\n\nTriggered abilities are abilities on cards that have a bold trigger word such as Action or Response. These abilities are only applied when they are triggered. Passive abilities are abilities on cards that have an ongoing effect without a bold trigger word. Because passive abilities don't have a trigger they are always active and cannot be \"triggered\". \n\nThis implies that the ability is not optional, as there is no way to trigger it. So each resource phase you must draw 3 additional cards, and discard your hand at the end of each round.\n\nIf it was optional it would likely be worded as \"Resource Action: draw 3 additional cards in the resource phase and discard your hand at the end of the round. \"\n\nEdited May 19, 2019 by icabod\nAdded an example of if it were optional"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295427-erestor-lore-hero/?do=findComment&comment=3704873","commentId":3704873,"userName":"Flrbb","timestamp":1558289189,"content":"There are effects which treat a text box as blank. Mostly, when a character has damage. That results in e.g. a core Gandalf which has not to be discarded or your Erestor effect which isn't anymore. :)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295427-erestor-lore-hero/?do=findComment&comment=3704885","commentId":3704885,"userName":"Wandalf the Gizzard","timestamp":1558290596,"content":"It's forced, so you have to do it."}]}