{"url":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/","title":"Black Serpent- Chaos in the Night","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3704875","commentId":3704875,"userName":"asgardianphil","timestamp":1558289300,"content":"I'm playing this two handed solo. I'm at 49 threat and 48 threat. \n\nI have the black serpent engaged with 6 damage and the quest has 6 progress. \n\nThis is going to be my last turn and I have two enemies engaged with player 1 and three other enemies engaged with player 2 who also has the black serpent with the serpents garb attached making him immune to player card effects. (The worst possible combo as I'm playing tactics spear of the citadel and gondorian spearman combos)\n\nSo in this quest phase during staging I draw two encounter cards. They are both Chaos in The Night and I have no cancellation.\n\nCard reads- when revealed: the first player must choose: either raise each players threat by 3,or progress cannot be placed on quest cards until the end of the round.\n\n I choose the second effect on the first card, and I believe I had to choose the first effect on the second card as each choice has to change the game state where possible.  Did I do this correctly? That's how I understand the FAQ reads on this sort of situation. \n\nThus losing the game. That's twice now this card has lost me the game on threat 49 when victory was within my grasp in that turn. The previous time it was the shadow effect of this card. Which removed all progress from the current quest. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3704897","commentId":3704897,"userName":"Wandalf the Gizzard","timestamp":1558291744,"content":"From the Online Rules Reference glossary, under Ability, Card Ability:\n\nA card ability can only be initiated if its effect has the potential to change the game state. This potential is assessed without taking into account the consequences of the cost payment or any other ability interactions. (emphasis mine)\n\nBased on that, I would say you can actually chose the second option (no progress) for both copies.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3705241","commentId":3705241,"userName":"Crusaderlord","timestamp":1558339383,"content":"That is interesting - i also have always played that if a card has 2 effects to choose from but one is something i cannot do due to the board state then i have to pick the other one even though this is more detrimental to me.  I must confess i just thought of it that way rather then trying to get beneath the rules - it would give me a break now and again if you can legitimately choose the option that leads to no real effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3705248","commentId":3705248,"userName":"Alonewolf87","timestamp":1558342633,"content":"> 52 minutes ago, Crusaderlord said:\n> \n> That is interesting - i also have always played that if a card has 2 effects to choose from but one is something i cannot do due to the board state then i have to pick the other one even though this is more detrimental to me.\n\nGenerally speaking that is the right way to do it, the point here is if going for the second time for the \"no progress this round\" choice is something that you *can* do twice or not. It's not the same as, let's say, \"do X o discard a questing ally\" when you don't have any questing ally under your control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3705280","commentId":3705280,"userName":"sappidus","timestamp":1558350257,"content":"I don't know the answer to this question. But let me pose a slightly different hypothetical situation for discussion:\n\nSuppose there were a location in the staging area saying something like, \"While this location is in the staging area, progress cannot be placed on quest cards.\" Then you reveal Chaos in the Night. Can you take the no-progress choice?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295434-black-serpent-chaos-in-the-night/?do=findComment&comment=3705290","commentId":3705290,"userName":"antonick","timestamp":1558353628,"content":"I think that in this case it becomes  more clear that you can take the no-progress choice.\n\nThe location could be explored after all, and it has a passive ability not lasting until the end of the round."}]}