{"url":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/","title":"Solo League 10 -- Print on Demand (with Mirkwood and WoR/EM cards)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3712715","commentId":3712715,"userName":"dalestephenson","timestamp":1559409148,"content":"Welcome to the LOTR Solo League. This month we'll be playing three print-on-demand quests, using cards from the first cycle (Mirkwood) and most recent cycle (Ered Mithrin). The quests are:\n\n1) Battle of Laketown\n2) Ruins of Belegost\n3) Murder at the Prancing Pony\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must match a promotional hero from these quests. This means that you must have at least one of Tactics Gimli (core, Ruins of Belegost) and Tactics Legolas (core, Murder at the Prancing Pony).\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Battle of Laketown and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Murder at the Prancing Pony it does not matter how many tokens I needed to defeat Ruins of Belegost.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker. You are required to reveal which Heroes you used, and how many cards in your deck came from outside WoR/EredMithrin, Mirkwood and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from WoR/EredMithrin, Mirkwood or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from core/Mirkwood and WoR/EredMithrin. More is better.\n\n3rd) The number of heroes used from this list: TaGimli, TaLegolas. More is better.\n\n4th) The number of cards in the deck outside Hobbit saga and KD/Dwarrowdelf. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) Performance in May's Solo League (if you didn't play or finish May's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for August's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in August's league. July's cycle will be chosen by the winner of May's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nBattle of Laketown: June 10th\nRuins of Belegost: June 17th\nMurder at the Prancing Pony: June 24th\n\nIf you can't finish by the final deadline but can finish before the end of the month, let me know and I can extend it.\n\n8 ) I've created a google spreadsheet for results here: \nhttps://docs.google.com/spreadsheets/d/1b4gm1sUzgpXfsLeReKwi7Nz_6h9OnK1f1BMWo-Tyl0Q/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1b4gm1sUzgpXfsLeReKwi7Nz_6h9OnK1f1BMWo-Tyl0Q/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3733222","commentId":3733222,"userName":"dalestephenson","timestamp":1562101171,"content":"Between work, life and a stint out of town I haven't been online for a few weeks -- plus Battle of Laketown sapped my will to live, let alone play LOTR.  I've now beaten Laketown with 24 tokens and Belegost with 12 tokens (might be able to improve on both of those), but have lost with 6 tokens against Prancing Pony and haven't beaten it yet.  However, I'm the only one to actually make a deck.  I'll leave the spreadsheet active through the weekend in case someone still wants to beat their head against a Print-on-Demand wall, and if not I'll make something up for August and exclude Print-on-Demand as a cycle choice going forward..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3733446","commentId":3733446,"userName":"GILLIES291","timestamp":1562131372,"content":"I would have totally been in but I only have 5 of the PODs, Laketown, Osgiliath, Annuminas,  Old Forest and Barrowdowns. Still working on collecting more but only have up to the end of the Angmar cycle for deluxes. I do have all Sagas so in for that haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3733459","commentId":3733459,"userName":"Miceldars","timestamp":1562133574,"content":"I don't have any of the Pod quests, so...\n\nSo dale, you are the only one who tried to do it, you will have the full power to decide for august solo league 😛"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3733712","commentId":3733712,"userName":"Yepesnopes","timestamp":1562165004,"content":"I got the wrong artefacts or I discarded them all the time... I got so lost in Belegost :( [//content.invisioncic.com/Mfantflight/emoticons/default_sad.png] It should be called the Ruins of BeLost\n\n \n\nP.S: I feel no shame for using the broken combo of Gloin + Elrond + Warden of Healing to beat these quests :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nEdited July 4, 2019 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3738566","commentId":3738566,"userName":"dalestephenson","timestamp":1562929814,"content":"Closing the league out:\n\nThere were only two decks competing -- mine was a Dale deck + TaGimli (required hero).  Gimli doesn't do anything to help a Dale deck, and I made some choices I eventually regretted when assembling the deck (not enough attachments that could go on any Dale ally).  Yepesnopes ran a Gloin/Elrond/TaGimli deck; with Narvi's Belt, extra hit points and a Warden of Healing Gloin can take undefended attacks with impunity.  That would have been handy.\n\nBattle of Laketown I found soul-crushing, I had to get up to 24 tokens before I had enough chumps to power through to the final stage.  I think this quest would be much easier in multi-player.  Outside cards in parens:\n\n4 Yepesnopes (32)\n24 dalestephenson (6)\n\nFor Belegost I dropped down to 12 tokens, and that was enough to make it through the quest.  With so many tokens in the first quest I didn't take the time to play it again, and it was tough enough that I wasn't confident I could drop that far anyway.  But I found it a much more enjoyable quest than Battle of Laketown and liked the exploring and treasures.  Oddly enough, this is the quest Yepesnopes had the most trouble with\n\n5 Yepesnopes (32)\n12 dalestephenson (6)\n\nFor Prancing Pony I started with 6 tokens, but I couldn't manage the threat increases.  At 12 tokens and 18 tokens I wasn't getting what I wanted despite a fistful of cards, and threat and missed guesses took me down.  Finally with 24 tokens I was able to get Ramshackle out of the way for repeated Gandalf threat reductions, and I guessed the location correctly and only had to face two suspects (falsely accussed Todd the Troll and Jake Wolf-Pelt) for three rounds.  Since I had so many tokens I just settled for 24.\n\n4 Yepesnopes (32)\n24 dalestephenson (6)\n\nFinal standings:\n13 Yepesnopes (32)\n60 dalestephenson (6)\n\nYepesnopes gets to choose the cycle for August, and will also get the third place prize of excluding a quest.  I get the second place prize of choosing a quest and the last place prize of choosing an additional cycle for player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3742692","commentId":3742692,"userName":"Yepesnopes","timestamp":1563467425,"content":"Using Gloin + Elrond + Warden of healing is the closest thing to cheating we have in the game right now. Besides, you used a deck with only 6 cards outside the pool. I would like that you choose the next cycle to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3742717","commentId":3742717,"userName":"dalestephenson","timestamp":1563469733,"content":"I'll choose WoR/Ered Mithrin, since the cycle is now complete.  Over to you to pick a quest to include and exclude."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3742752","commentId":3742752,"userName":"Yepesnopes","timestamp":1563472635,"content":"Include: Fire in the night\n\nExclude: The Kings Quest"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295879-solo-league-10-print-on-demand-with-mirkwood-and-worem-cards/?do=findComment&comment=3742765","commentId":3742765,"userName":"dalestephenson","timestamp":1563473400,"content":"Ouch!  Fire in the Night is tough.  RNG says:\n\nRoam Across Rhovanion, Ghost of Framsburg.\n\nSo the mandatory hero list includes Haldan, Thranduil, and SpDain -- Woodman/Silvan/Mining.  Woodmen need the most help, so I'll add GH/Dreamchaser cycle for player cards, that gives them another two lore location attachments.  "}]}