{"url":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/","title":"Levels of LOTR LCG players","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713028","commentId":3713028,"userName":"Durins_Father","timestamp":1559475851,"content":"An article that has been long in the making, and hopefully will contain useful tips to both new players and older ones. I have constructed a tier list of how experienced you are with the game and how involved you are with its community. On top of that, I also added several achievements for people to collect over their time playing this game. https://visionofthepalantir.com/…/levels-of-lotr-lcg-playe…/ [https://l.facebook.com/l.php?u=https%3A%2F%2Fvisionofthepalantir.com%2F2019%2F06%2F02%2Flevels-of-lotr-lcg-players%2F%3Ffbclid%3DIwAR2rTX35eqVP0DorJ7WmzIXBheJF4Cq9GT0_703H1UMsW7aPoROUCjkZRcg&h=AT0Qa4wNyTEZCwYhMxQSOr7tvlHKlWwrF7JJxhdzHVg9TfobP2sBZOOkWdAaK5Eb5MvvTtr0LoWpEZ4xCYP6jTfeYdzqSYdkMbf6wcCgtMfTi6kWHQY1fXsUmyq01TOWBnhCDwowpN7jfd_Xfy0qB6ys]\n\nIf you have more tips for players at different levels or want to add more achievements to the list, let me know and I'll see what I can do. Also, be sure to fill in the two polls I included.\n\nRegular scenario analyses should continue soon, and with Patreon nearing the $75 mark, I am gonna start working on the second physical strategy guide as well and release it once we hit that amount of support. Hope you all enjoy!\n\nEdited June 2, 2019 by Durins_Father"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713213","commentId":3713213,"userName":"Calvadur","timestamp":1559502731,"content":"Cool list!\n\nI think more achievements for actually playing the game or achieving (hehe) some special \"objectives\"  would be cool. Some stuff that came to my mind on the train home:\n\n \n\n1) Don't feed te troll: Win Jourey along the Anduin without taking damage from a hill troll\n\n2) Restarting would have been faster...: Win The dead marhes after shuffling Gollum into the encounter deck.\n\n3) No you take him (MP only): Have no player guard Gollum 2 turns in a row\n\n4) Digging is for dwarfs: Escape from Moria without using the old tools in flight from Moria\n\n5) Body and mind: Win the watcher in the water both ways\n\n6) I don't need no heroes...: Win Foundations of stone after/while controlling zero heroes\n\n7) I'll make my own nightmare-mode!: Win Shadow and flame after triggering Lore Aragorns ability during the first turn!\n\n😎 Quizmaster: Fail no riddle in dungeons deep and caverns dim\n\n9) The colourful wizard: Win the Siege of Cair Andros with a three coloured deck!\n\n10) Our long forgotten Gold: Acquire every tressure during the hobbit quests\n\n11) It's easier this way: Kill the Lich-King in massing at osgiliath\n\n12) Not even sweating: Win battle of lake town with zero damage on lake town\n\n13) I like cheese: Win Assault on Osgiliath in one turn.\n\n14) Death by a thousand cuts: Defeat the Nazgul in the Morgul Vale in one turn.\n\n15) Brave, but madness: Commit no characters to a hide test i shadow from the past\n\n16) What could go wrong? Shuffle every ring-wraith into the encounterdeck during a knife in the dark\n\n17) Durin's... what? Win journey in the dark without facing the balrog\n\n18) It's treason then: Kill your own mad hero in breaking of the fellowship\n\n19) Free from the burden: Cleanse yourself from a burden in breaking of the fellowship\n\n20) Is that all, Saruman? Win Helm's deep without a stage with the defense keyword being defeated\n\n21) You shall not pass: Let no enemy escape during journey to the crossroads\n\n22) No man can kill him: Defeat the lich-king during the pelennor fields using only Eowyn (and Merry)\n\n23) I can do this all day: Collect 15 tokens during the black gate opens\n\n24) Never gonna give you up: Collect all boons possible during you campagne (depending on player count)\n\n25) Never gonna let you down: Avoid all burdens possible during your campagne (depending on player count)\n\n26) Save them for the way home: Don't use any \"one-time-only\" boon during your campagne\n\n27) Ain't nobody got time for that: Draw your whole deck during the fors of the Isen\n\n28) Attack is the best defense: Win Siege of Cair Andros after loosing all three Cair Andros locations\n\n29) Save the forest! Defeat no huorns during into fangorn\n\n30) Worst week of my life: Win the wastes of Eriador in 7 days and 7 nights\n\n31) No secret is save: Defeat all 3 side quests in treachery of rhudaur\n\n32) Your strength becomes your weakness: Have the complete encounterdeck in the staging area!\n\n33) King of the sea: Defeat the Stormcaller during the first round in the city of corsairs \n\n34) Working as intended: Equip Beorn with a restricted attachments\n\n35) Thematic Win!: Win a game by discarding Boromir for his action\n\n \n\nI'm not sure if all of these are actually possible or how luck dependant they are as it's quite long since I played some of the quests. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713300","commentId":3713300,"userName":"GILLIES291","timestamp":1559512177,"content":"Haha awesome list! You could add: Never gonna run around and desert you: Have no heroes listed in the fallen heroes at the end of each saga campaign. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713302","commentId":3713302,"userName":"GILLIES291","timestamp":1559512350,"content":"Or for a darker one:\n\n\"Lone survivor\" - Have at least 24 (or another number) heroes in the fallen heroes campaign at the end of the campaign. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713370","commentId":3713370,"userName":"GILLIES291","timestamp":1559526561,"content":"So turns out I am a casual player, I feel like I'm dedicated hahaha. But I only have half of the content so far, and have no plans to play online, it's such an amazing and beautiful tactile solo experience and my wife is my main companion for questing. But good article! Thanks for sharing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713448","commentId":3713448,"userName":"Flrbb","timestamp":1559541641,"content":"> 18 hours ago, Durins_Father said:\n> \n> tgame. https://visionofthepalantir.com/…/levels-of-lotr-lcg-playe…/ [https://l.facebook.com/l.php?u=https%3A%2F%2Fvisionofthepalantir.com%2F2019%2F06%2F02%2Flevels-of-lotr-lcg-players%2F%3Ffbclid%3DIwAR2rTX35eqVP0DorJ7WmzIXBheJF4Cq9GT0_703H1UMsW7aPoROUCjkZRcg&h=AT0Qa4wNyTEZCwYhMxQSOr7tvlHKlWwrF7JJxhdzHVg9TfobP2sBZOOkWdAaK5Eb5MvvTtr0LoWpEZ4xCYP6jTfeYdzqSYdkMbf6wcCgtMfTi6kWHQY1fXsUmyq01TOWBnhCDwowpN7jfd_Xfy0qB6ys]\n\nIs it on purpose that your link refers to a Facebook link which refers to your blog?\n\nGood article! Was nice to read and it is good to know that someone tries to make categories of player behaviour. (That sentence of mine might not sound in a positive way, but it is ment to be positive - not native speaker here. Sorry) Well, but I do think that there is missing a step between dedicated player and master. Between the other categories the \"steps\" are smaller. \n\nI would call me a dedicated player, but there is much more to explore before *baam* suddenly master. :D (in your categories I would be stuck at the tier which \"requires\" to go to conventions, open game events and such)\n\nIn my experience there are somewhat minor and major dedicated players. Dunno how to name them. Probably the difference is one is a gaming addicted geek and the other one just plays very, very often.\n\n> 10 hours ago, Calvadur said:\n> \n>  \n> \n> I think more achievements for actually playing the game or achieving (hehe) some special \"objectives\"  would be cool. Some stuff that came to my mind on the train home:\n> \n>  \n\nI like your ideas and your sense of humour, really! :)\n\nMight be a good addition (or even a new article)!!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713452","commentId":3713452,"userName":"Flrbb","timestamp":1559542453,"content":"Just checked my archivements:\n\nGot only two out of eight from the article. The last time I started a campaign the last box(es) weren't published. So I guess I do not get the first two. xD\n\nBut a better rate from Calvadurs list: roughly 12/35"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713457","commentId":3713457,"userName":"Durins_Father","timestamp":1559543900,"content":"> 29 minutes ago, Flrbb said:\n> \n> but I do think that there is missing a step between dedicated player and master. Between the other categories the \"steps\" are smaller. \n\nYou are correct that there was a level in between those two levels at one point. But I decided to cut it, as the tips were just going to be: \"Get better and buy more content\". I might adjust the article to include my Veteran level at one point, though it will have some consequences for the polls. The steps between the others are indeed smaller, though not small enough for some players to fall in between the two levels.\n\n \n\n> 32 minutes ago, Flrbb said:\n> \n> Is it on purpose that your link refers to a Facebook link which refers to your blog?\n\nIt wasn't, but that's probably because I copied the post from the post in the facebook group. It shouldn't be a huge issue, but I'll keep an eye on it in the future.\n\n \n\n@Calvadur [https://community.fantasyflightgames.com/profile/258336-calvadur/] That's a pretty sweet list there. I will look over them at some point and may include some achievements to the list. They are a bit smaller and scenario specific though, so perhaps I could add each one to the end of the matching scenario analysis. Just to give people a challenge when playing that scenario. There are some pretty nice achievements in there that are easier to obtain than those in the article, thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713879","commentId":3713879,"userName":"player3351457","timestamp":1559585142,"content":"> 22 hours ago, Calvadur said:\n> \n> 6) I don't need no heroes...: Win Foundations of stone after/while controlling zero heroes\n\nIsn't this a loss condition?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3713890","commentId":3713890,"userName":"sappidus","timestamp":1559586156,"content":"> 14 minutes ago, player3351457 said:\n> \n> Isn't this a loss condition?\n\nNo. FAQ on the Lost and Alone treachery of that quest:\n\n\n\n> If your last hero gets shuffled into your deck you are not eliminated from the game; heroes are not considered to be killed unless they are in your discard pile. You will continue playing until you either draw the hero, are eliminated through other means, or the game ends.\n\n\n\n[http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Card468 [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Card468]]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3714218","commentId":3714218,"userName":"Durins_Father","timestamp":1559631207,"content":"I so hope that this means that if Smeagol hero turns to an enemy, and he was your last hero, that you aren't eliminated. That could make for some fun gameplay. But I expect we will get a ruling on that at some point."},{"commentUrl":"https://community.fantasyflightgames.com/topic/295909-levels-of-lotr-lcg-players/?do=findComment&comment=3714410","commentId":3714410,"userName":"Amicus Draconis","timestamp":1559661442,"content":"I wonder what will happen with Sméagol in The Long Dark when Lost and Alone is drawn."}]}