{"url":"https://community.fantasyflightgames.com/topic/296122-mithril-shirt-and-hero-abilities-that-cause-damage/","title":"Mithril Shirt and hero abilities that cause damage","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/296122-mithril-shirt-and-hero-abilities-that-cause-damage/?do=findComment&comment=3716681","commentId":3716681,"userName":"DAAAN","timestamp":1559908564,"content":"Hi there, \n\nI'm looking to get some clarification on how the new and interesting mithril Shirt works with abilities that trigger by causing damage. In particular I'm thinking about Treebeard and Erkenbrand.\n\nI've seen rulings about song of mocking and honor guard that say it that as the damage was cancelled or redirected, the ability doesn't resolve. Does that hold true for reduction as well?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296122-mithril-shirt-and-hero-abilities-that-cause-damage/?do=findComment&comment=3716975","commentId":3716975,"userName":"sappidus","timestamp":1559936504,"content":"My take on this (unconfirmed by rulings as of yet) is that Mithril Shirt is essentially a replacement effect—you were going to receive X damage? do this other thing instead!—which means the receiving of X damage never \"happened\" in the first place. As both Treebeard and Erkenbrand have the damage dealing as their costs, the never-happening means that you can't trigger the effect.\n\n(The fact that the \"other thing\" mentioned above is another instance of taking damage [possibly 0] is irrelevant, in my view; I'm of the view that the same reasoning works against Quickbeam hero as well.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296122-mithril-shirt-and-hero-abilities-that-cause-damage/?do=findComment&comment=3741814","commentId":3741814,"userName":"Distractionbeast","timestamp":1563369517,"content":"If the damage is part of the cost, the effect won't trigger.  However, the damage prevention, being a \"Response\" effect, is optional, so you can choose to ignore it selectively when needed."}]}