{"url":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/","title":"Boromir Alt Art","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722249","commentId":3722249,"userName":"Goldeneye007","timestamp":1560771686,"content":"Hello,\n\nI know this is a snowball’s chance in mount doom but.....I’m looking for the gencon Alt art of tactics boromir. Favorite hero and I’ve been scouring eBay and other sites for almost a year now to no luck. Is anyone here have a copy that they would want to sell to me? Honestly name your price, or trades whatever it is, I’m willing to make a deal and open to any kind of payment/trade. I just have not seen one pop up on resale sites anywhere. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722352","commentId":3722352,"userName":"Durins_Father","timestamp":1560782691,"content":"Good luck with that, there aren't many sellers of those, as there were very few copies ever printed. Continuously checking eBay and checking in with the facebook community would be best, as sometimes there are copies being sold there.\n\nYou can also check with a local card printer to make an unofficial copy while you wait. It's not the same thing, but it will save you a lot of time and money."},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722713","commentId":3722713,"userName":"Goldeneye007","timestamp":1560809652,"content":"I appreciate the response. Yeah it’s the only one I want of the Alt art and I can’t find it. Honestly at a “name your price I’ll pay”  point. Which Facebook community page are you referring to? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722735","commentId":3722735,"userName":"old toby","timestamp":1560811901,"content":"goldeneye,\n\nwhile i can't help, i'm rooting for you.  i think we both started in this game around the same time last year, and we are similar in that we know what we want and are willing to pay for it.  i was searching for the same card, around the same time.  I've seen your posts on BGG as well.  drop lines wherever you can, cuz its free and the worst anyone can say is 'no.' \n\ni set a few different searches on ebay.  I have 'lord of the rings card game,' 'lord of the rings lcg,' 'lotr lcg alt art,' and 'lotr lcg promo.' as saved searches and i check them 4-5 times a day.  a few months back one hit on ebay and i bought it within a hour or so of it being listed.  perhaps 3 months before there was another.  they don't come up often and when one does, it probably goes super quick.  patience and persistence is what paid off for me.  that and a lot of luck i suppose.  but you can find em on ebay, even if 99% of the time you look you won't find one.\n\ni admire your desire, and i'm hoping you pick one up.  i tracked down a 'hands upon the bow' playmat from a seller in the Ukraine.  paid a lot for it.  too much perhaps.  especially when another one came up on ebay for $15.  It was the first and only listing for that playmat I've seen in 8 months.  I bought it on general principle as well just to average down my buyer's remorse.  that ebay seller also listed four other older fellowship/game night mats and I bought those too just cuz.  that's how this game goes in terms of the rares.  you just have to keep at it.  and i mean you have to check more often than every other person who wants one! \n\nlastly, if it were me, and it was 'get alt-art Boromir or die trying,' then this is what my 'i don't care what anyone thinks, i'm gonna either get the card or go down with the ship' plan:  the holders of these cards are most likely old school players.  the ones that make the decks we use to beat quests we can't beat, or answer the questions we have.  anyway, many of these folks are going to be at GenCon.  While it may be too late for this year, you might consider next year.  My plan would be to go with the express and perhaps lone purpose of asking every single person at the LOTR LCG sessions if they had one they would sell/trade.  Yeah, after a bit I'd be 'that guy' and i can imagine it might grate on some.  I'd be respectful, but I'd ask all the same.  I'm not really sure what else you can do.  Unless you take Durin's Father's advice and just art cow print it yourself.  Again, I'm hoping it works out.  Cuz I know you've been hunting one for a good while now...\n\nall the best,\n\ntoby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722753","commentId":3722753,"userName":"GILLIES291","timestamp":1560813666,"content":"I also searched for one for quite awhile and eventually gave up. Very rare, but good luck to you and seconds if anyone finds two! Hahaha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722793","commentId":3722793,"userName":"Goldeneye007","timestamp":1560818573,"content":"Thanks for the kind words Toby. I usually check eBay and international ebays everyday. Just saw one sold on April 22nd. Can’t believe I missed it. I’ve been posting on Reddit, discord’s, bgg, with no luck. It’s a pretty grim outlook at this point. I won’t give up but I’ve accepted I won’t ever find one. I will be at gencon this year so I can maybe ask around. There’s no limit on price for me. \n\nFantasy flight could make some extra cash if they reprint those  I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722804","commentId":3722804,"userName":"old toby","timestamp":1560820462,"content":"Goldeneye, \n\nthats the one i got; 4/22.  I will stay on the lookout.  If i see another, ill buy it right away and contact you.  If you score one in the meantime, please report back on this thread so i dont get stuck with another!  Good luck!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/296440-boromir-alt-art/?do=findComment&comment=3722832","commentId":3722832,"userName":"Goldeneye007","timestamp":1560826569,"content":"Nice find! I really appreciate it. I will be sure to let you know if I am successful as you are!"}]}