{"url":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/","title":"Solo League 11 -- Dreamchaser with Ringmaker cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3734475","commentId":3734475,"userName":"dalestephenson","timestamp":1562247092,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the GH/Dreamchaser saga. The quests are:\n\n1) Fate of Numenor (Grey Havens deluxe)\n2) Raid on the Grey Havens (Grey Havens deluxe)\n3) Temple of the Deceived\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Galdor, Cirdan, and Elfhelm.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Temple of the Deceived and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Raid on the Grey Havens it does not matter how many tokens I needed to defeat Fate of Numenor.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside GH/Dreamchaser, VoI/Ringmaker and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from GH/Dreamcahser, VoI/Ringmaker or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from Hobbit saga and KD/Dwarrowdelf. More is better.\n\n3rd) The number of heroes used from this list: Elfhelm, Galdor, Cirdan. More is better.\n\n4th) The number of cards in the deck outside GH/Dreamchaser and VoI/Ringmaker. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Grey Havens and Temple of the Deceived. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in JUne's Solo League (if you didn't play or finish June's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for September's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in September's league. August's cycle will be chosen by the winner of June's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring -- the first two deadlines are only to be included in intermediate standings.\n\nFate of Numenor: July 15th\nRaid on the Grey Havens: July 22nd\nTemple of the Deceived: July 29th\n\n😎 I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1DlH3mNKv_6PDF16BrpTiB03f8rco-wno-Ld7KOzUO90/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1DlH3mNKv_6PDF16BrpTiB03f8rco-wno-Ld7KOzUO90/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3740630","commentId":3740630,"userName":"rees263","timestamp":1563227595,"content":"I never tried any of this cycle in true solo before. These quests all seem to have their own challenges for a solo player. Raid on the Grey Havens should present the biggest challenge, so I had that in mind when I built my deck.\n\nCirdan (with Narya) seems to be the strongest option for heroes so I went in that direction. Decklist here:\n\nhttps://ringsdb.com/decklist/view/12562/julysololeague-1.0 [https://ringsdb.com/decklist/view/12562/julysololeague-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3741596","commentId":3741596,"userName":"rees263","timestamp":1563325329,"content":"Fate of Numenor:\n\nNothing much to say really, maybe the most straightforward quest I've run in a long time. I barely encountered any enemies and cancelled the treachery which adds an extra uncharted location. Was able to use some location control to peek on the final turns, but still took three rounds to find the Shrine. Having time to build up some allies in a Narya deck almost feels like cheating. Not a luxury I'll have in the next quest.\n\n0 tokens"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3741921","commentId":3741921,"userName":"dalestephenson","timestamp":1563378178,"content":"Fate of Numenor I didn't think would be too difficult, but my deck is attachment-heavy and ally limited, so my top willpower isn't impressive.  I hit both Ruins of Ages past so I had seven uncharted after moving to stage 2, and I took threat increases questing before managing to clear two and travel to the Shrine of Morgoth.  Since Merry's 4 willpower was so important (2 + Elfhelm + Windfola), I couldn't afford using him for threat reduction.  Finally with 48 threat and just one progress left on the Shrine, I revealed a Throngs of the Unfaithful -- this wasn't a bad result, because even if I surged into something with high enough threat to prevent progress, Arod would give me the final point when I killed the Throng.  Alas, it surged into a reshuffled Ruins of Agest past, and the Doomed 2 ended the quest in failure.\n\nWith 1 token I made it through more easily, since Ruins of Ages Past confined itself to be a harmless shadow.  rees263 made it through unscatched with his Cirdan/Narya deck, so here's the standings through the first quest (outside cards in parens)\n\n0 rees263 (26)\n1 dalestephenson (20)\n\nNext up is Raid on the Grey Havens, easily the toughest of the three quests. Put a deck together and see what you can do!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3743102","commentId":3743102,"userName":"rees263","timestamp":1563508064,"content":"Raid on the Grey Havens:\n\nThis one was a struggle. In testing my deck I found that it was possible to beat this quest without help, but I suppose that it still needs a good draw because I ended up needing four attempts.\n\nEach of my losses was due to the effect of The Havens Burn. You really need to clear the board of enemies straight away, which is partly why I chose Tactics Eowyn. Unfortunately it takes a couple of turns before I have enough combat power to deal with multiple enemies and it wasn't working out.\n\nTwo of the losses turned on the fact that I failed to clear an active location by a single progress token. One of these featured a double surge of The Fires Spread and this caused a chain of aflame locations. I often find that an early aflame location being discarded is enough to end the quest straight away.\n\nIn my final attempt the extra resources were key as I was able to get my force up and running in time to deal with all the enemies. I decided to take a bit of extra time to make sure I was ready for Sahir and Na'asiyah and the board was totally clear when I moved onto stage 2.\n\nThey came into play with 7 tokens each and the chump I threw in front of Na'asiyah revealed The Fires Spread as a shadow card, meaning I came dangerously close to losing. Fortunately I didn't and I won next turn, with Gandalf clearing away Na'asiyah and taking Sahir's last attack as I cleared all the damage from the Dreamchaser.\n\nDefinitely a tough quest solo, especially since you can end up with 12+ threat in the staging area on turn one.\n\n3 tokens\n\nEdited July 20, 2019 by rees263"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3747413","commentId":3747413,"userName":"dalestephenson","timestamp":1564077158,"content":"I beat Raid on my first attempt -- but it was with three tokens, so I might be able to improve on that.  Early on it was dicey as I took threat increases during the questing phase, but I was able to kill off the Ravager quickly and after that point it went smoothly -- once I got some extra questing I was able to use Merry for threat reduction, taking me down from 39 to the low 30s as corsairs came out.  By the time I finished off the first stage I had so many attachments on Grimbeorn that he was able to counterattack and kill both Na'asiyah and Sahir, while Treebeard readied three times to defend and help kill the other two that popped out.\n\nBut I never could have killed off the Ravager so quickly without the extra resources, so I fear my next attempt.  Against my provisional 3, here's how others have done against the quest:\n\n0 Yepesnopes (37)\n2 Thanee (39)\n3 rees263 (26)\n\nYepesnopes hasn't posted a result for the first quest, so here's the cumulative using my current score:\n\n2 Thanee (39)\n3 rees263 (26)\n4 dalestephenson (20)\n\nDeadline is this monday, but if you need more time let me know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3747618","commentId":3747618,"userName":"Onidsen","timestamp":1564090292,"content":"@dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] Is it too late to join in? I have a fair amount of free time this weekend, so I think I can get through the 3 quests by the Monday deadline."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3747645","commentId":3747645,"userName":"dalestephenson","timestamp":1564091831,"content":"It's not too late to join."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3747995","commentId":3747995,"userName":"rees263","timestamp":1564152163,"content":"Temple of the Deceived:\n\nThis was a crazy quest. After 2 unlucky shadows in a row I lost Beregond on round 3! Luckily this was long enough to have built up some allies and Na'asiyah was ready to jump in as my defender. I did miss the threat reduction though.\n\nThis quest allows you to take your time to an extent, and once I got Steward on Cirdan I barely noticed I was down a hero. The rest of the quest was spent thoroughly exploring the island and with an ally army I cruised to victory. \n\nBy the end I had peeked under almost every location. I didn't count rounds but it must have been 25 plus because I went through my deck and almost threated out even with a lot of reduction effects. Overall not too tough a quest.\n\n0 tokens. Total for the month: 3"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3748688","commentId":3748688,"userName":"Onidsen","timestamp":1564251368,"content":"Alright - got my deck [https://ringsdb.com/deck/view/165389] ready. It's a basic Noldor deck, with 9 cards and 1 hero outside of a single Core + the allowed cards (Dreamchaser + Voice of Isengard). Early versions of the deck aimed at 0 card, using Galadriel instead of Arwen, but that proved not to be powerful enough to deal with Raid on the Grey Havens - the combination of not having enough starting willpower and no resource acceleration until I could find the Steward/Narya combo was a fatal flaw.\n\nElven-light is the staple of a Noldor deck, and it turns Arwen into a powerhouse. Again, I tried to play a deck without it, but there simply wasn't enough card draw. The third Steward is for consistency's sake - I want to be able to beat Raid, and I'll need Steward for that. I ended up caving, and going with Light of Valinor instead of Unexpected Courage, it's cheaper, easier to get into play, and I would only save a single card-outside-of-the-preferred-set by using Courage. Finally, the Elrond's Counsel was to counteract the Doomed from - I originally had a number of other cards in there, but being able to adjust willpower after staging is always useful. There is surprisingly little threat reduction within the preferred set.\n\nFate of Numenor was a simple quest - even though I didn't ever get a defender into play. Beat it in a single attempt (although I made several mistakes, but I was able to correct them after the fact, and they didn't affect the win - I tend to keep Elven-light on the OCTGN play surface for convenience, and I forgot to shuffle them back in when I used Will of the West). Glorfindel readied by Narya was enough to deal with defenses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3748980","commentId":3748980,"userName":"Onidsen","timestamp":1564302402,"content":"Just finished Raid on the Grey Havens. It was tougher than in the test runs - I lost twice, once due to the Havens Burn, once due to Dreamchaser burning. Both losses started with a White Ship in the staging area, with the first card of staging being a second copy of Sahir's Ravager. The first time, I muddled through and kept going for many more turns than I ought to have been able to - I actually kept revealing locations that could take new damage from the enemies in play instead of losing the final location that would have lost me the game. But finally, my luck failed and I took one damage more than the locations could take.\n\nThe second game revealed 2 Ravagers, an Arsonist and a Pirate in the first 3 turns (thanks to losing locations), and my draws were horrible so I couldn't get enough attack power into play to kill enemies off.\n\nThe final game revealed a location as the first card in staging, and so I got a little bit of a break. The starting location was a White Ship again, of course, but that's a lot easier to handle when there aren't a bunch of enemies in staging. I got Steward and Narya into play on the first turn, along with a Handmaiden, and broke even questing the first round. After that, the game got steadily more and more under control - I revealed an Arsonist on the second round, travelled to the White Ship, grabbed a second Arsonist, and killed them both using Glorfindel + Narya.\n\nWhen I finally advanced, Sahir and Na'asiyah each got 8 resources. I chumped them both the first turn, then played Gandalf to kill Na'asiyah. Sahir got worn down over the next several turns while my army of questing allies kept damage off of the Dreamchaser and even rode the last Ravager in the staging area down. (I love that card!)\n\nOn to Temple of the Deceived!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3749410","commentId":3749410,"userName":"Onidsen","timestamp":1564379342,"content":"Finished Temple of the Deceived.\n\nI have decided that I am not a fan of this quest - the Exploration mechanic is kind of interesting, but the amount of mistakes I make due to unfamiliarity ends up making it more frustrating than exciting and new.\n\nI actually had to play this quest 5 times to get a win. 3 of the other 4 times were due to missing a rule and realizing that I'd done something wrong in such a way that it would have invalidated the win (if I had gotten to a win). I don't know if those count as \"losses\" for the purposes of the league rules, so I kept track of them separately. I also lost once - again due to a rules mistake. I was just fine - even with 3 copies of Drowned Dead and the Temple Guardian in play, until I realized that sacrificing Glorfindel to the Drowned Dead would have placed him on the bottom of my deck, where I couldn't play him again the next round (which I had done, getting rid of the Temple Guardian and one of the Drowned Dead - Narya + a powered up Captain Sahir is awesome). And so I would have faced at 2 undefended attacks that round, which would have killed 2 heroes.\n\nAgain - I don't know whether I should record this as 1 token or 4 (I only ever played with the benefit of 1 token, counting the loss as a loss and the plays that were discarded due to egregious rules errors as unknown). I'm currently in the spreadsheet as 1, but I'm more than happy to record it as 5 tokens if that is the best way to interpret the league rules.\n\nIn any case, I'm done, and this was a fun month to be a part of. Thanks for running this @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3749610","commentId":3749610,"userName":"dalestephenson","timestamp":1564410307,"content":"For major rule mistakes I'd just use your judgement.   If it's in your favor, replay if you win or were winning, count as a loss if you lose or were losing.  If the outcome was in doubt and it's \"early\" just replay, if it's late assume the loss.  If the mistake hurt your chances, replay *if* in your judgement you lost or were losing because of the mistake, and if you win count the win.  If you're not sure what will happen when you realize it, just replay or (at your option) just continue under the correct rules and take the win/loss whichever happens.  If you make multiple mistakes both for and against you, just replay.\n\nPlacing Glorfindel in the discard was certainly mistake in your favor.  However, if you could have chumped with another ally and just chose Glorfindel because you didn't notice the forced effect, it may not have actually affected the outcome if played by correct rules.  If you think you would've won if you would've noticed, replay is correct; if you think there's a significant chance of loss count it as a loss.  You are in a better position to judge the importance of the mistake than I am, so I'll let whatever result you choose to record stand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3750989","commentId":3750989,"userName":"dalestephenson","timestamp":1564578677,"content":"After finally settling for two tokens in the Raid (my one-token attempt was stopped in round two by two Sahir's Ravagers engaging with only Grimbeorn ready), I was looking forward to a nice, cautious playthrough of Temple of the Deceived.  For the most part I was able to do that -- the Steward of Gondor in my opening hand and a favorable starting location meant I could quest successfully early, and build up resources on Sahir and Na'asiyah.  Indeed, I ended up building a ton of resources on *everybody*, as my threat kept slipping up and up and up while I failed to draw my questing allies.  As I slowly explored I had to keep SpMerry questing and my threat crept up -- I had an early Gandalf, but gambled on using him for cards instead of threat reduction, and the other two never showed up.  Eventually I got a couple and was able to use SpMerry for threat reduction, dropping me from mid-40s down to around 40, but as I approached the temple and a treachery killed them off, I had to use Merry as a quester again -- threat peaked at 47 and I choose to quest unsuccessfully several times just to get Merry's threat reduction (he had Hobbit Pony), before I finally cleared the temple.  (The reapparance of the Guardian was no problem, Na'asiyah had 11 resources by then.) It was a long slog, but it ended in victory.\n\nKey moments -- Throngs of Unfaithful being discarded as shadows as I worked through the deck.  Nearly my entire deck was cost 2 or less, so they would've never gone away.\n\nHere's how we did against the cursed island (outside cards in Parens)\n\n0 dalestephenson (20)\n0 rees263 (26)\n0 Thanee (39)\n1 Onidsen (9)\n\nAnd here's the cumulative tokens:\n\n2 Thanee (39) [Cirdan/Arwen/Erestor]\n3 Onidsen (9) [Cirdan/Arwen/Galdor]\n3 dalestephenson (20) [Elfhelm/SpMerry/Grimbeorn]\n3 rees263 (26) [Cirdan/SpBeregond/TEowyn]\n\nThanee's use of more outside cards paid off, as he took no tokens outside Raid and finished alone in first place.  Tiebreakers separated the rest of us.  Still, the Noldor decks win this round, although my solo Elfhelm deck managed to hang tough.\n\nThanee gets to choose the cycle for September's league, Onidsen gets to choose a quest from the cycle to play, I get to choose a quest to exclude, and rees263 gets to choose a supplemental cycle for player cards.  Next month is three quests from Ered Mithrin, with GH/Dreamchaser as a supplement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3751252","commentId":3751252,"userName":"dalestephenson","timestamp":1564599672,"content":"Thanee has chosen Harad for September's cycle.  Over to Onidsen to select a quest from that cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3751345","commentId":3751345,"userName":"Onidsen","timestamp":1564607974,"content":"I'll select The Black Serpent"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3751361","commentId":3751361,"userName":"dalestephenson","timestamp":1564609227,"content":"I'll exclude Race Across Harad.  Randomizer says:\n\nEscape From Umbar (Sands of Harad)\n\nBlack Serpent (AP #4)\n\nDungeons of Cirith Gurat (Ap #5)\n\nMandatory hero is one of LeGimli, SpLegolas, Fastred, and Folco Boffin.\n\nEdited July 31, 2019 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297126-solo-league-11-dreamchaser-with-ringmaker-cards/?do=findComment&comment=3753943","commentId":3753943,"userName":"rees263","timestamp":1564755936,"content":"Okay I'll add the Ring-maker cycle"}]}