{"url":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/","title":"&quot;Once per round&quot; outside a round","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3741103","commentId":3741103,"userName":"sappidus","timestamp":1563288172,"content":"I submitted the following as a rules query a few months ago, but never got a response:\n\nYou've previously ruled that effects occurring \"at the end of a phase\" are not occurring within that phase, and also that effects that last \"until the end of a phase\" cannot be triggered outside a phase. [https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3698806 [https://community.fantasyflightgames.com/topic/277776-unofficial-official-rulings-thread/?do=findComment&comment=3698806]]\n\nI presume effects referring to rounds work the same way. How does this interact with \"Limit once per round\" abilities?\n\nI will be more specific. It's round #10, and I have ally Galdor and heroes Erestor & Arwen. I want to trigger Galdor in all of the following 3 ways:\n\nA. in round #10, after discarding from Arwen\n\nB. between rounds #10/11 (?), after discarding from Erestor's \"at the end of the round\" effect\n\nC. in round #11, after discarding from Arwen\n\nIf Erestor's ability is not during a round, can I do (B) at all? (i.e., is Galdor and Erestor a combo?)\n\nIf I *am* allowed to do (B), which of (A) & (C) can I do? Both? Neither? Or just one of them; and if so, which one?\n\nWhat do y'all think?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3741106","commentId":3741106,"userName":"dalestephenson","timestamp":1563288345,"content":"I think they should have ruled that things that happen at the \"end of a phase\" happen *within* the phase instead of outside it.  \"Until\" should be interpreted inclusively instead of exclusively, as the English language permits and as would make more sense mechanically when playing."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3741861","commentId":3741861,"userName":"Wandalf the Gizzard","timestamp":1563373530,"content":"To find the answer, we would need to ask how should \"'until the end of the phase/round\" be treated differently than \"'at the end of the phase/round?\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3745312","commentId":3745312,"userName":"Seastan","timestamp":1563820151,"content":"If I were the designer, I'd put an entry in the rules reference that clarifies that all instances of \"at the end of the X\" should be implicitly understood as \"immediately before the end of the X\". That is, after all game framework steps that occur during X, but still within X.\n\nThis would make all interactions with \"once per X\" and \"until the end of the X\" behave the way most players think it should intuitively. They don't carry over to the next X, and they don't allow you extra triggers of the effect or shut the option of using them.\n\nSimilarly, \"at the beginning of the X\" should be implicitly understood as \"immediately after the beginning of the X\", i.e. before any framework steps in X."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3748462","commentId":3748462,"userName":"player3351457","timestamp":1564200278,"content":"I would hope you could trigger B.\n\nIt's a response. Responses are allowed to be triggered ANY time the condition is met, unless there is a pre-conditioned \"cannot\" in play. Right? \n\nIf erestor's passive text triggers in such a way that even responses are ignored, wouldn't something like silver harp miss its chance to retrieve a card discarded by erestor? Would there be no way to retrieve a card discarded by erestor until the resource phase action window (which would be too late for responses)?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/297577-once-per-round-outside-a-round/?do=findComment&comment=3748676","commentId":3748676,"userName":"Amicus Draconis","timestamp":1564250043,"content":"Intuitively I would say, you can trigger Galdor at the end of but still within the round with Erestor's passive effect, as long as you have not used him in this round already. But then I think, some rulings are just too complicated in this game: In an ideal case you would only need the rule books / sheets, your cards and nothing else, as everything would be printed perfectly clear, which I guess is quite impossible."}]}