{"url":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/","title":"Nightmare mode and Easy mode","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3740793","commentId":3740793,"userName":"alcuin18","timestamp":1563244083,"content":"I've never played a nightmare mode quest and was wondering if anyone has played one while also using easy mode? Or is that possible? \n\nAlso, I noticed that in the mode explanation section of the insert that came with The Lost Realm cycle it says easy mode was also designed for players that enjoy cooperative mode. I'm assuming this means multiplayer. I've noticed that easy mode doesn't necessarily make the quest easier in multiplayer it just does away with some of the possible game ending encounter deck combinations that can come off the deck when you have to reveal three or more encounter cards. Has anyone else found this to be the case?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3740885","commentId":3740885,"userName":"Hannibal_pjv","timestamp":1563257913,"content":"Easy mode makes the start of the game much, much easier because you have more resources to set up your team. The ability to remove some cards has an effect in longer run. (Some harder cards Are removed)\n\ni normally play it so that when playing with new players I take that one extra resource from the easy mode to allow new player more easily to play their cards in the Beginning of the game. It alone makes the game really much easier, because you get your engine going much Sooner than normal.\n\nEdited July 29, 2019 by Hannibal_pjv\nTypo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3749821","commentId":3749821,"userName":"Rouxxor","timestamp":1564426764,"content":"Easy, normal and nightmare are the three option available for most scenario. Playing Easy mode on nightmare is not something that have been planned, there is not real point of taking off the cards you usually take off in easy mode because nightmare cards are often even harder, so you may in fact make your scenario more difficult. It could also result in a bug (identical cards are removed from both modes, and those care are needed at some point). You can still add the resources to your characters to simulate a easy-ish mode.\n\nEasy mode is supposed to be for any number of players. Some though enemy are often removed, and they are annoying no matter the number of players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3749857","commentId":3749857,"userName":"sappidus","timestamp":1564430987,"content":"> 1 hour ago, Rouxxor said:\n> \n> You﻿ can﻿ still add the resources to your characters to simulate a easy-ish mode.﻿\n\nIn my head, I call this \"slightmare\" mode, though I've never actually tried it.\n\nTo the OP question about regular easy mode: yes, I have found that occasional injections of easy mode play into my playgroup helps keep morale afloat when we've felt a little too bludgeoned by too many normal-mode losses. As you say, it's often not really \"easy\" at all—I like that term invented a while back, story mode—but it nevertheless does take some of the edge off the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3750010","commentId":3750010,"userName":"soullos","timestamp":1564443182,"content":"Not sure if this is what you meant by combining the two modes, but lately I have been trying my hand at using nightmare cards but not removing the cards based on the nightmare insert card (any conflicts just randomize or choose before the game nightmare or original version). So that means that the easiest cards (which are normally removed in nightmare mode) are still present and the encounter deck is much thicker so it's harder to combo off devastating results. Guess you'll call it Hard mode or something. If things get a little hairier add extra resources during setup as in Easy mode. It gives me an excuse to use those nightmare cards that have been collecting dust all these years. I do only play solo so I can't comment on the multiplayer aspect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3753542","commentId":3753542,"userName":"alcuin18","timestamp":1564715425,"content":"Thanks for the response! I have another question for those of you familiar with nightmare mode. Which nightmare quest is the best one to start with if you've never played nightmare before? I'm looking to get a single one and not one for a deluxe expansion just to see if my playgroup likes them or not. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3765742","commentId":3765742,"userName":"Rouxxor","timestamp":1566113078,"content":"> On 8/2/2019 at 5:10 AM, alcuin18 said:\n> \n> Thanks for the response! I have another question for those of you familiar with nightmare mode. Which nightmare quest is the best one to start with if you've never played nightmare before? I'm looking to get a single one and not one for a deluxe expansion just to see if my playgroup likes them or not. Thanks!\n\nHard to say without knowing your will. Do you want the hardest? Dol Guldur, Five armies or Deadman's pike would be the best but they all come in deluxe package. So Encounter At Amon Duin would be the best in line.\n\nDo you want a thematic addition? Shadow in Flame, Defense of cair andros (still in deluxe) or raid of the grey havens get the best\n\nDo you want a nightmare that make a scenario way more interesting? Encounter At Amon duin (again), Eriador waste or flight of the stormcaller\n\nDo you want beautiful cards that don't actually make the scenario harder? Go for battle of Carn Dum\n\nWant the best illustration? I don't look carefully of that thing between the name of the card and it text so I won't be your men on this one.\n\nTell me what kind of scenario you like in regular lord of the rings, I might have a clue about what you may like in nightmare ;)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3794045","commentId":3794045,"userName":"alcuin18","timestamp":1569532959,"content":"Well, so far my playgroup has enjoyed the Grey Havens the most so are the nightmare modes for those quests pretty fun?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3794443","commentId":3794443,"userName":"Wandalf the Gizzard","timestamp":1569585057,"content":"I can’t speak from experience, but I’ve great things about them, @alcuin18 [https://community.fantasyflightgames.com/profile/330286-alcuin18/]."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3794457","commentId":3794457,"userName":"Durins_Father","timestamp":1569586385,"content":"The first two Grey Havens quests are pretty fun in Nightmare, with Voyage across Belegaer probably being my favourite. It adds new quest cards for stage 2 that can be troublesome to get through if you aren't sailing hard enough. Raid on the Grey Havens NM is a very daunting quest in my experience, with ships going up in flames more quickly. The NM version does include the other 3 ships as well in location form, putting more pressure on the players to clear locations and not let their fleet be burned down. \n\nAs for other Nightmare quests, I will advise the Mirkwood and Against the Shadow cycle. These needed some fixes that the NM version provides, and it changes up some mechanics here and there that make the quests more fun to play through again. NM Amon Din is likely the biggest step in difficulty from Normal to NM out of all the quests, so be warned."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807269","commentId":3807269,"userName":"Valhalla Gaming","timestamp":1571237299,"content":"Nightmare mode is generally a means to elevate the mechanics of an encounter, closing off ways to bypass/trivialize them, raise overall difficulty, and occasionally elevate theme.\n\nYou certainly could play this on easy mode but in a lot of cases it would probably diminish the intended pronounced mechanics. That being said, even in the worst case it would essentially be an alternative version of the quest. \n\nI love the nightmare decks in general, but I feel like our tastes will vary. That being said across the board the art is fairly fantastic, and the mechanics really dialed in. Off the top of my head I enjoyed watcher in the water, druadan forest, and the stewards fear but its hard for me to attribute how much nightmare mode contributed since I've only played on that mode."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807281","commentId":3807281,"userName":"Vince79","timestamp":1571238654,"content":"From what I've seen on YouTube (and I'm guilty of this myself sometimes), a lot of people make things easier by taking mulligans until they get a hand that they feel they can work with.  That simulates an easy-ish mode of sorts.  To be fair, on some of the harder scenarios, there's no sense playing unless you get a good hand because you can see right off that you're going to lose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807467","commentId":3807467,"userName":"Wandalf the Gizzard","timestamp":1571253352,"content":"> 4 hours ago, Vince79 said:\n> \n> From what I've seen on YouTube (and I'm guilty of this myself sometimes), a lot of people make things easier by taking mulligans until they get a hand that they feel they can work with.\n\nUhh . . . Can you give us a few examples of different channels doing that? Thanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807564","commentId":3807564,"userName":"Vince79","timestamp":1571261984,"content":"> 2 hours ago, Wandalf the Gizzard said:\n> \n> Uhh . . . Can you give us a few examples of different channels doing that? Thanks.\n\nI don't really pay attention to channels, I just watch a few videos here and there.  I've also seen people changing the initial encounter cards that they draw until they get some they like.  I'm not advocating it, I'm just saying there are people who do it, since we were talking about ways to make the game easier.\n\nAlthough I don't remember the specific video (or even the scenario), I remember watching one guy who was taking repeated mulligans, and he said \"All these hands count as losses, but I'm not going to bother playing them out because I know I will lose with them\".  Which I can kind of understand, why waste an hour when you know what's going to happen?  Some of the scenarios bury you early if you don't have the weapons to deal with them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807620","commentId":3807620,"userName":"sappidus","timestamp":1571267254,"content":"> 1 hour ago, Vince79 said:\n> \n> Although I don't remember the specific video (or even the scenario), I remember watching one guy who was taking repeated mulligans, and he said \"All these hands count as losses, but I'm not going to bother playing them out because I know I will lose with them\".  Which I can kind of understand, why waste an hour when you know what's going to happen?  Some of the scenarios bury you early if you don't have the weapons to deal with them.\n\nAre you referring to this, perhaps?\n\n\n\nThis is a bit of a special case, IMHO, as it may just be the single hardest quest in the game in true solo, and as he says, he didn't want to waste people's time with a 20-hr video that actually would detail all the losses…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807748","commentId":3807748,"userName":"Valhalla Gaming","timestamp":1571289322,"content":"> 14 hours ago, Vince79 said:\n> \n> From what I've seen on YouTube (and I'm guilty of this myself sometimes), a lot of people make things easier by taking mulligans until they get a hand that they feel they can work with.  That simulates an easy-ish mode of sorts.  To be fair, on some of the harder scenarios, there's no sense playing unless you get a good hand because you can see right off that you're going to lose.\n\nInteresting, I've never done bad hand mulligans but I am definitely a fan of this quick reset if a sequence of cards is clearly a loss since there are definitely a lot of board states where there is no way to win, even as soon as the first turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807840","commentId":3807840,"userName":"Hannibal_pjv","timestamp":1571312386,"content":"Also the ”new mulligan” rule from AH and L5R where you can keep some cards and discard some and draw new ones to replase the discarded ones is actully very good way of making the game easier if needed and not as gamy as multible mulligans!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807860","commentId":3807860,"userName":"Vince79","timestamp":1571314648,"content":"> 13 hours ago, sappidus said:\n> \n> This is a bit of a special case, IMHO, as it may just be the single hardest quest in the game in true solo, and as he says, he didn't want to waste people's time with a 20-hr video that actually would detail all the losses…\n\nThat's one of them.  I had forgotten about the also common practice in that scenario of choosing which hero to be the prisoner, when it's supposed to be random.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807884","commentId":3807884,"userName":"BillK62","timestamp":1571317497,"content":"These ideas--choosing to keep a card or two when drawing a hand mulligan, choosing the prisoner in Escape from Dol Guldur, and restarting if Quest 1A drops a game-wrecking card during setup before you've gotten to play any cards in preparation--could take some of the frustrations out of the game. The latter two allude to happenings that can wreck a game from the first moments--so why not \"reshuffled everything, re-deal, and start over\"--or equivalently and much more quickly, just grab up that game-wrecking turn-up card, cram it back into the deck, and deal a different one?\n\nI'm adding them to my arsenal (for re-playings of tough scenarios, that is).\n\nEdited October 17, 2019 by BillK62"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297564-nightmare-mode-and-easy-mode/?do=findComment&comment=3807899","commentId":3807899,"userName":"Wandalf the Gizzard","timestamp":1571318742,"content":"> 1 hour ago, Vince79 said:\n> \n> That's one of them.  I had forgotten about the also common practice in that scenario of choosing which hero to be the prisoner, when it's supposed to be random.  \n\nJust like how you mentioned players counted extra mulligans as losses in the videos you watched, I often chose the prisoner and multiply my win percentage by one third. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}