{"url":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/","title":"Wastes of Eriador","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3745933","commentId":3745933,"userName":"alcuin18","timestamp":1563907554,"content":"My play group just finished \"attempting\" Wastes of Eriador. We limped into the final quest card only to be hit with a seemingly unbeatable loop. The pack leader says he cannot be optionally engaged. Day says return engaged enemies to the staging area and enemies do not make engagement checks. Nightfall says you cannot place progress on quests. The quest card says to remove all progress from the quest when it becomes day. The pack leader cannot take damage while there is no progress on the quest card. Am I reading this incorrectly or is it impossible to beat the final stage of this quest? What are we missing? Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3745966","commentId":3745966,"userName":"dalestephenson","timestamp":1563909977,"content":"Day: place progress\n\nNight: Damage the Pack Leader\n\nDay: previous progress disappears, place progress again\n\nNight: Damage the Pack Leader again\n\nWhat you're missing is that progress is removed at the *beginning* of the day, and you can place progress in the questing phase after that."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3746010","commentId":3746010,"userName":"Amicus Draconis","timestamp":1563914952,"content":"You could also try to kill the Warg Leader while it is in the staging area during the day with direct damage and/or staging area attacks, like Haldir with 2 Rivendell Blades and a Black Arrow, 2 Gandalfs or tactics ´Éoywn with Herugrim and Forth Eorlingas."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3746049","commentId":3746049,"userName":"dalestephenson","timestamp":1563919715,"content":"Can't do direct damage in the day, since day removes the progress tokens and you need 5 progress tokens on the quest to damage him.\n\nIf you place enough progress in the day, you can damage him in staging during the night's quest phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3746455","commentId":3746455,"userName":"Amicus Draconis","timestamp":1563977064,"content":"I see no reason not to damage him after placing enough progress during the day. Maybe I am missing something?\nAt the end of the round flip the objective to day, disengage all enemies, start a new round, place 5 progress on the quest card in the quest phase and then nuke the Pack Leader. He is not immune to player card effects, he could also be engaged by say a Westfold Outrider after finishing the enemy attack step."},{"commentUrl":"https://community.fantasyflightgames.com/topic/297864-wastes-of-eriador/?do=findComment&comment=3746566","commentId":3746566,"userName":"dalestephenson","timestamp":1563985002,"content":"Sorry, you're correct.  I was thinking of damage during the quest phase itself (e.g. sneak Gandalf in the questing phase, TaBilbo, LeEomer, Argalad), but there's no reason you couldn't damage after the progress is placed.  In fact, IIRC my Dori and the Damage fellowhsip finished the Pack Leader off in daytime with Hail of Stones."}]}