{"url":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/","title":"Question about &quot;Lightless Grotto&quot;","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749426","commentId":3749426,"userName":"JeffreyShep","timestamp":1564381362,"content":"Hello, I have a question about the Lighless Grotto (The Wilds of Rhovanion).\n\nThere is a Lightless Grotto as an active location. \n\nhttp://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_63.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_63.jpg]\n\nAfter commiting characters to the quest, I discard cards from the top of the encounter deck until a treachery is discarded. I resolve the When Revealed effect of that card but I do NOT reveal that card because it has just been discarded. \n\nWhat happens if the discarded card is Denizen of the Deep and there is no ennemy in the staging area ?\n\nhttp://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_47.jpg [http://www.cardgamedb.com/forums/uploads/lotr/ffg_MEC65_47.jpg]\n\nThe card gains Surge. But Surge is a keyword that is resolved when an encounter card is revealed from the encounter deck. Denizen of the Deep was not revealed from the encounter deck and \"resolve the when revealed effect\" is not the same that \"reveal the card\", imo. \n\nMy point of view is the card gains the Surge keyword but this keyword is not resolved beceause the card was not revealed from the encounter deck.\n\nIn the same way, if there is a Doomed keyword on the treachery discarded, the players do not raise their threat. \n\nWhat do you think about this ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749639","commentId":3749639,"userName":"sappidus","timestamp":1564412125,"content":"Sounds good to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749695","commentId":3749695,"userName":"stimpaksam","timestamp":1564416278,"content":"My guess is because the adding of Surge is part of the When Revealed effect it would in fact surge in this instant. If it had a normal Surge keyword then it wouldn't. Again, I'm just guessing here."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749720","commentId":3749720,"userName":"JeffreyShep","timestamp":1564417737,"content":"I see what you mean stimpaksam, but the issue is in the definition of the Surge Keyword : \n\n> Quote\n> \n> Surge\n> Surge is a keyword ability. When an encounter card\n> with the surge keyword is revealed, reveal 1 additional\n> encounter card.\n> If an encounter card has more than 1 instance of surge,\n> reveal 1 additional encounter card for each separate\n> instance.\n> Resolve the surge keyword immediately after resolving\n> the staging of the encounter card.\n\nThe Surge needs the revelation, it's in its definition. \n\nSurge doesn't just mean \"Reveal an additional card\". It means, imo, \"Reveal an additional card if the card with the surge keyword was revealed\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749784","commentId":3749784,"userName":"Amicus Draconis","timestamp":1564422687,"content":"The rules reference and the Learn to Play both say the same as the original rulebook:\n\n> Quote\n> \n> When an encounter card with the surge keyword is revealed during the staging step of the quest phase, reveal 1 additional card from the encounter deck. Resolve the surge keyword immediately after resolving any when revealed effects on the card.\n\nAs this is not the staging step (step 2) of the quest phase but the step for comitting characters (step 1), surge does not trigger.\n\nOn the other hand, the faq says:\n\n> Quote\n> \n> Surge, Doomed, and Guarded keywords should be resolved any time the card on which they occur is revealed from the encounter deck, including during setup.\n\nThis time the staging step is not mentioned, but any time is specified, including setup. Still, the card needs to be revealed, which it is not in the case of Lightless Grotto, so again surge does not trigger.\n\nIf it said \"After the players commit characters to the quest, discard cards from the encounter deck until a treachery is discarded. Reveal that treachery.\", then it would surge.\n\nEven though both definitions differ at some points, they both ask for revealed cards, but the Lightless Grotto does not qualify."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3749804","commentId":3749804,"userName":"player3351457","timestamp":1564424342,"content":"I would say you are right. The way we play, when guarded cards force a discard until we get an enemy, we don't resolve the when revealed or surge/doom because it specifically says to \"discard\" and then to \"add\". Sometimes it says to \"discard until .... then reveal that card and add it to the staging area.\" That's the distinction I look for. Otherwise, it was added from the discard pile, not revealed from the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3750278","commentId":3750278,"userName":"Wandalf the Gizzard","timestamp":1564491315,"content":"I would not resolve the surge in that case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3750442","commentId":3750442,"userName":"CJMatos","timestamp":1564504498,"content":"Í would resolve the Surge in that case due to being part of the effect as @stimpaksam [https://community.fantasyflightgames.com/profile/309009-stimpaksam/] said.\n\n \n\nIf the Treachery card had Surge and a When Revealed efects then i wouldn't resolve Surge because it wasn't part of the when revealed effect that was triggered by the Location mentioned in opening post"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3750458","commentId":3750458,"userName":"Wandalf the Gizzard","timestamp":1564505793,"content":"Actually, this conversation brings up an important point. The Surge keyword is technically supposed to trigger before resolving any when revealed effects. So by the time a treachery that whiffs gains Surge due to its when revealed, the opportunity for that newly gained keyword to trigger has already passed! :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]\n\nObviously the intention is that a new card is revealed from the encounter deck, but I like pointing random things out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3750492","commentId":3750492,"userName":"Wandalf the Gizzard","timestamp":1564508247,"content":"I mean, am I wrong, Amicus? Haha!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298062-question-about-lightless-grotto/?do=findComment&comment=3750567","commentId":3750567,"userName":"Amicus Draconis","timestamp":1564514205,"content":"> 1 hour ago, Wandalf the Gizzard said:\n> \n> I mean, am I wrong, Amicus? Haha!\n\nI find it funny, that all those treacheries should whiff anyway."}]}