{"url":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/","title":"Hobbit Saga - We Must Away Ere Break of Day - Problem with the ending!!! (spoilers)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760065","commentId":3760065,"userName":"tripecac","timestamp":1565378336,"content":"I was finally doing well in the first Hobbit saga scenario (after 3 failed attempts).  This time, I was in Stage 2, had massive armies on both sides (I play 2 handed), had killed 2 trolls, and was itching kill the 3rd.\n\nBilbo had Troll Purse attached, Troll Key was attached to the last troll, and Troll Cave was in the staging area.  So, all I had to do was grab the Troll Key, travel to the Troll Cave, and explore it.  That would take 2 turns max.  Bilbo was ready, and all I needed to do was damage the final troll with an attack.\n\nThe first encounter card forced the troll to engage the player with Bilbo.  It sacked 2 characters, but I had so many that it didn't matter.\n\nAll I needed to do was hit the troll.\n\nBut then, when I resolved my questing, I saw that I had so much willpower that it completely emptied the encounter deck.  This forced me to go to Stage 3.  Which immediately ended the game.  Yikes.\n\nSince Troll Cave was not yet in the Victory display, my understanding is that this means I cannot discover Sting, Glamdring, and Orcrist, correct?\n\nThis stinks!  I was doing so well... but I guess I ended up doing \"too well\"....\n\nHmmm...\n\nAnd then I realised: this ending doesn't make sense.\n\nYou see, by questing too well, I forced dawn to arrive, which froze the trolls. Okay, that's a little weird, but I can accept that. \n\nHowever, what I don't like is this next bit:\n\nAccording to the game, since the trolls froze before I had explored the Troll Cave, I didn't have a chance of discovering the treasure.  No chance.  Zero.  Zip.  Never mind the fact that we had the purse, the last troll had the key, and the cave was right there in front of us (in the staging area).  It's as if the dwarves, in a fit of idiocy, decided to simply drop the purse, ignore the key, and ignore the cave.  \"Oh well, job done, nothing more for us here, on to Erebor!\"  No curiosity whatsoever.\n\nBut this is opposite from the book!  In the book, the trolls were frozen before the cave was even discovered, right?  After the fight, the Dwarves explored a bit, and *then* found the cave.\n\nSo why can't we explore the Troll Cave *after* eliminating the trolls?  That's what I was expecting to happen anyway, since it's consistent with the story.  (This was my first time seeing the third quest card, so the fact that the game ended immediately was a nasty surprise).\n\nI don't understand why the game forces us to explore the cave before finishing off the trolls.  That's just such an unexpected deviation from the book.  And, since familiarity with the book is part of the appeal of the saga expansion, it seems strange that the game would try to \"trick\" us like this, almost as if it is punishing us for trusting the book/lore too much.\n\nIs this why some people don't rate the Hobbit sagas highly?  Do these sort of thematic/gameplay conflicts recur throughout the Hobbit saga?  Or is this the worst offence? \n\nOr did I completely read the game/quest wrong?  Am I missing something here?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760107","commentId":3760107,"userName":"Hannibal_pjv","timestamp":1565382152,"content":"It is just a game... so it is not allways logical.\n\ni don`t think that you did mis anything. I Also did ”win” wilpower wictory and well was not too happy. But I did avoid it at the second run. The Lotr Lcg is a pusle and you just have to figure out how to solve it. And no, it does not make any logical Sense ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760132","commentId":3760132,"userName":"dalestephenson","timestamp":1565384313,"content":"I sympathize with you, but after the trolls are killed/frozen there's really nothing left to fight, so it would be anticlimatic if you were allowed to \"discover\" the cave and quest to it at that point.\n\nOne minor point -- if the troll *did* have the Key when turned to stone it would be problematic.  They were only able to get in because the troll had lost the key.  From the Hobbit:\n\n-----\n\n...they came on a big door of stone leading to a cave.  But they could not open it, not though they all pushed while Gandalf tried various incantations.\n\n\"Would this be any good?\" asked Bilbo, when they were getting tired and angry.  \"I found it on the ground where the trolls had their fight.\"  He held out a largish key, though no doubt William had thought it very small and secret.  It must have fallen out of his pocket, very luckily, before he was turned to stone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760548","commentId":3760548,"userName":"tripecac","timestamp":1565460884,"content":"I played again, and had the same result this morning.  It was even \"worse\" actually:  I ended up over-questing by 11, with only 4 cards left in the encounter deck, and neither the purse nor key were in play.  So, another \"win\", but no treasure. \n\nIt seems pretty tricky to draw the key at the right time during Stage 2:\n\n1) it can't be a shadow card\n2) it can't be one of those cards we discard whenever we overquest\n\nYes, I know there are some encounter cards which let us put cards from the encounter discard pile back on top of the encounter deck, but those cards don't work if they were discarded too early or too late.\n\nIt seems that the only way to guarantee the key is to:\n\n1) never engage enemies (which means keeping threat really low and preventing encounter cards from forcing engagements)\n2) never overquest\n\nThese 2 requirements are very hard to achieve, at least for me.  Can a deck even be built to do that?\n\nOr are they other ways to guarantee that the key is never discarded?\n\nUnless I am misinterpreting something, it seems that we are not really intended to get the treasure unless we are either:\n\na) lucky\nb) really good at encounter deck manipulation, or\nc) willing to play the same scenario over and over until we get a \"treasured\" win\n\nI for one think 2 [untreasured] wins (after 3 earlier losses) is pretty much my limit, so unless there is a an easy \"fix\" that I haven't considered, I think I will give up on the treasure and just continue to the next scenario.\n\nWill the rest of the Hobbit saga be significantly more difficult without those treasures?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760615","commentId":3760615,"userName":"Trumpet95","timestamp":1565469535,"content":"Are you aware of the errata?\n\nThey have added \"If Troll Key (Purse) is discarded, add it to the staging area\"\n\nhttp://hallofbeorn.com/LotR/Details/Troll-Key-THOHaUH?Lang=EN [http://hallofbeorn.com/LotR/Details/Troll-Key-THOHaUH?Lang=EN]\n\n \n\nhttp://hallofbeorn.com/LotR/Details/Troll-Purse-THOHaUH?Lang=EN [http://hallofbeorn.com/LotR/Details/Troll-Purse-THOHaUH?Lang=EN]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760946","commentId":3760946,"userName":"tripecac","timestamp":1565534206,"content":"I played using OCTGN, which had that errata in place.\n\nHowever, FAQ 1.9 says this:\n\n\"When a card is drawn as a Shadow card, only its Shadow text is considered to be active.\"\n\nTherefore, when a Troll Purse or Troll Key is drawn as a shadow card, none of the non-Shadow text on the Troll Purse and Troll Key is \"active\", so it's as if those cards are totally blank.  This means we completely ignore any text on the card which talks about what to do before or after it is discarded, since that text is effectively \"not active\".  The only way those cards' text becomes active is if those cards are put into play \"normally\" (and not as shadow effects).\n\nCorrect?\n\nOr is there a rule somewhere saying that sometimes, some parts of a card's non-shadow text can be regarded as \"active\" even when the card is drawn as a shadow card? \n\nI've seen other cards where the shadow effect refers to the non-shadow effect, but that sort of text is not present on Troll Purse or Troll Key, so my interpretation is that those cards are treated as blank cards when resolved as shadow cards.\n\nEdited August 11, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3760994","commentId":3760994,"userName":"rees263","timestamp":1565538811,"content":"What you are missing is that once the shadow card is discarded it's normal text takes over again. \"When X is discarded\" would take effect in the discard pile and return them to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3761158","commentId":3761158,"userName":"tripecac","timestamp":1565559207,"content":"Is there a place in the rule book or FAQ which says a card's \"if [this card] is discarded\" text is triggered whenever it is placed in the discard pile, regardless of where is was prior to the discard pile?\n\nIf the \"if [this card] is discarded\" wording triggers every time the card is placed in the discard pile, then wouldn't that create an endless loop if Troll Key or Troll Purse is revealed or discarded during Stage 1?\n\n1) discard the card (since no trolls) <-- or is this interpretation incorrect?  Should the purse/key stay in the staging area until a troll arrives?\n2) add the card to the staging area (triggered by \"if [this card] is discarded\" card text)\n3) goto 1\n\nMaybe what is throwing me is #1.  When I first played this quest, I drew a Troll Key in Stage 1. Since there were no trolls, I googled what to do, and read that we're supposed to discard the card.  So I did... and I played it like that the rest of my times through the quest.\n\nHowever, I just now did some more googling, and see that people say we should leave the key/purse in the staging area.  This contradicts that earlier advice, but avoids the endless loop, so it seems more logically sound.  However, that interpretation favours of the player, and usually we're supposed to interpret rules *against* the player.\n\nSo is the Stage 1 discard interpretation incorrect?  Would the correct thing be to keep the Troll Key and Troll Purse in play (in the staging area or attached to a troll) as soon as it is drawn or discarded, for whatever reason?\n\nOf course, that interpretation only works if we are allowed to obey the \"if [this card] is discarded\" wording.\n\nAre there other cards with \"if [this card] is discarded\" wording?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3761183","commentId":3761183,"userName":"Onidsen","timestamp":1565562593,"content":"Troll-Key.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-Hobbit-Over-Hill-and-Under-Hill/Troll-Key.jpg]\n\nThe key does not say to discard it if there are no Troll enemies in play, so if it is revealed from the encounter deck it should remain in the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3761257","commentId":3761257,"userName":"tripecac","timestamp":1565572584,"content":"This is the topic I read when researching the Stage 1 purse/key issue :\n\n\nIt says that Caleb [Grace I presume] told us this:\n\nIf there are no Troll enemies in play when Troll Purse or Troll Key are revealed, then they are placed in the discard pile.\nCheers,\nCaleb\n\n\nOnce I read Caleb's ruling, I stopped researching the issue.  From then on, whenever I saw a purse or key in Stage 1, I put it in the discard pile and left it there.\n\n \n\nIs the consensus now that Caleb was wrong?\n\nEdited August 12, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3761302","commentId":3761302,"userName":"rees263","timestamp":1565580427,"content":"Not wrong per se. That ruling predates the errata, so there was a change in Caleb's stance. Now if the key or purse is revealed or discarded in stage one you just leave them in the staging area until the Trolls turn up in stage two."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298646-hobbit-saga-we-must-away-ere-break-of-day-problem-with-the-ending-spoilers/?do=findComment&comment=3761323","commentId":3761323,"userName":"tripecac","timestamp":1565583047,"content":"I see... and if they ever enter the discard pile in Stage 2, as either a shadow card or an \"overquesting\" card, we also move them from the discard pile to the staging area?\n\nThat definitely makes it easier. "}]}