{"url":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/","title":"Print On Demand","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764485","commentId":3764485,"userName":"alcuin18","timestamp":1565912850,"content":"My family recently completed our entire collection of regular scenarios and saga expansions and now we're thinking of moving on to the standalone quests. Other than Fog on the Barrow-downs and The Old Forest which I know are part of the saga campaign mode, which of the other standalone quests would all of you say are the best for a group?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764513","commentId":3764513,"userName":"mewmartigan","timestamp":1565916544,"content":"I feel like the Battle of Laketown could have been a Hobbit saga scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764521","commentId":3764521,"userName":"GILLIES291","timestamp":1565917368,"content":"> 12 minutes ago, mewmartigan said:\n> \n> I feel like the Battle of Laketown could have been a Hobbit saga scenario.\n\nBut it's so hard! Hahaha.\n\nI vote Massing at Osgiliath but only because I have just played a handful of them. Murder at the Prancing Pony is highly spoken of and the one I'm most looking forward too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764738","commentId":3764738,"userName":"Kjeld","timestamp":1565961973,"content":"Massing at Osgiliath is still a very solid quest, even after all these years.\n\nRuins of Belegost, while very difficult, does offer a fairly unique game play experience -- after all, who doesn't want to raid a dragon's lair for loot?\n\nMurder at the Prancing Pony is also quite unique, and a good addition.\n\nWoodland Realm and Wizard's Quest let you play competitively, sort of, and have the novelty of letting you try your hand at constructing an encounter deck.\n\nPersonally, I don't find Assault on Dol Guldur or Seige of Annuminas to be anything particularly special. They're hard, certainly, but don't add as much to the game (unless you like the idea of more than 4 players).\n\nThe rest are related to the Sagas (including, unofficially, Battle of Laketown)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764759","commentId":3764759,"userName":"Wandalf the Gizzard","timestamp":1565964003,"content":"Definitely the Woodland Realm and Wizard's Quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3764819","commentId":3764819,"userName":"JonG","timestamp":1565968788,"content":"OK, I only play solitaire, but here's my take on the PoDs:\n\n- Fog on the Barrow Downs - good but fiddly to set up and play\n- Murder in the Prancing Pony - crime story that is very different from any others. As a result it's a bit marmite I think. Good to get because it's like nothing else.\n- Battle of Lake Town. Seriously difficult - rated a 9 for difficulty I believe. Boost your tactics cards to beat this one.\n- Massing at Osgiliath. Been a while since I played it but my memory was that it was pretty good if reasonably difficult. There are one or two insta-death cards in the Encounter Deck if memory serves, which can be frustrating. Worth buying.\n- The Old Forest. Straightforward to play and not too difficult. Just played it again recently and I enjoyed it even though it stomped my Silvan deck. Worth getting.\n- Ruins of Belegost. Old fashioned Dungeon crawl with treasure. Is very difficult, and can be frustrating as to a degree it relies on finding cards in the encounter deck. Worth getting and fun to play but you'll need good decks for this one.\n- Stone of Erech. In many people's top ten best AP's. Very thematic, not too challenging or fiddly to play. Absolutely superb scenario which I've played well over 25 times, and an insta-buy. \n\n\n\n- Siege of Annuminas. This was designed for multiplayer, but I really enjoyed it solo. You'll need lots of Progress tokens!\n\nI've never played The Wizards Quest or Woodland Realm scenarios, but they were designed specifically for groups as semi-competitive games. I do hear mixed reports about them, but they are different and you may enjoy them for that reason. \n\nI've also never played Assault on Dol Guldur but apparently it is very difficult. The report is that it didn't go down well, but maybe some other posters can confirm.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/298913-print-on-demand/?do=findComment&comment=3768605","commentId":3768605,"userName":"cheapmate","timestamp":1566462702,"content":"Fog on the Barrow Downs and The Old Forest are excellent additions to the Saga expansions and I always use them in a campaign\n\nMurder at the Prancing Pony is like Clue on steroids, love the setting and characters\n\nBattle of Laketown is a favorite, but so hard 😅"}]}