{"url":"https://community.fantasyflightgames.com/topic/298986-one-progression-mode-to-rule-them-all-beta/","title":"One Progression Mode to Rule them All (beta)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/298986-one-progression-mode-to-rule-them-all-beta/?do=findComment&comment=3765751","commentId":3765751,"userName":"Zura","timestamp":1566115519,"content":"So, me and my friends have been toying with the idea of finishing the game progression-style. But to be honest, regular progression while fun, proven to be just replaying the old quests with the card-pool we already have beaten them with at the time of their relase. So we wanted to replace the original \"progression\" with something a bit more challenging, while still keeping the whole progress idea afloat. I'm sharing the basic rules so (hopefully) a more than one group can test this out and we can tweak the final relase to be balanced right of the bat, so i'm really counting on some feedback. This simple but engaging mode is what we came up with:\n\nOne Progression to rule them all:\n\n> At the start of the progression campaign,  each player notes all the player cards from a single core set, with the exception of Gandalf, which is limited to once per player at the start of the campaign. This is his starting card pool.\n\n> Each participating player builds a deck based on this cardpool, following the normal rules of the game. The starting deck needs to be 30 cards or more.\n\n> To unlock a playset of a card from a pack that you have already beaten all the previous scenarios for, a player needs to pay 3 EXP. Players gain exp by finishing missions (more about it below). To unlock an addictional copy of a core set card, a player needs to pay 1 EXP. To unlock a hero from a pack that they have already beaten all the prior scenarios for, a player needs to pay 6 EXP. Here are the exceptions to the standard pricing system:\n\n * Gandalf x1 (Core set) - 3 EXP\n * Unexpected Courage x1 (Core set) - 3 EXP \n * Dain Ironfoot (Shadows of Mirkwood) - 12 EXP\n * Arwen Undomiel (dwarrowdelf) - 6 EXP\n * Vilya (Dwarrowdelf) - 9 EXP\n * Light of Valinor (Dwarrowdelf) - 9 EXP\n * Beregond (HoN) - 12 EXP\n * Hirluin the Fair (AtS) - 12 EXP\n * Gondorian Shield (AtS) - 9 EXP\n * Arwen Undomiel (AA) - 12 EXP\n * Glorfindel (Dream-chaser) - 9 EXP\n * Denethor (Dream-chaser) - 12 EXP\n * Quickbeam (LOTR Saga) - 9 EXP\n * Gandalf (LOTR Saga) - 12 EXP\n * Brand son of Bain (TwoR) - 12 EXP\n * Dain Ironfoot (EM) - 12 EXP\n\n> Players gain EXP for succesfully completing the missions. Here's the reward structure:\n\n * Victory +1 EXP\n * Finishing the quest for the first time +1 EXP\n * Finishing a 6+ difficulty level quest +1 EXP\n * Finishing a quest on normal mode or higher  +1 EXP\n * Finishing a quest on nightmare mode +1 EXP\n\nEach quest can be replayed up to 3 times in total. After that, the quest becomes locked. \n\n \n\n> Unlocking a quest:\n\nFor the ones unfamiliar with progression mode idea, you can only play the quests that you have finished all the previous quests for. However, we will be making an exception: LOTR Saga and Hobbit Saga do count as independent cycles and can be player anytime between the cycles. However, the players cannot stop playing the cycle they are currently in in order to play one of the SAGA campaigns.\n\n \n\n> Addictional rules:\n\n * By the Dead Marches quest, the player card decks need to be 50 cards or more.\n * The standalone quests can be played anytime between the cycles similarly to LOTR Sagas. Because playing them does not unlock access to a bigger cardpool, finishing the standalone quest grants players with +3 addictional EXP.\n\n \n\nI think that would be all for now. I'm in the process of compiling and testing the rules and possibly making a card unlock excel spreedsheet for conveniency. If you decide to give it a shot, have fun and i'm waiting for your feedback!\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/298986-one-progression-mode-to-rule-them-all-beta/?do=findComment&comment=3767160","commentId":3767160,"userName":"Flrbb","timestamp":1566312070,"content":"Just wondering... how many are \"me and my friends\"?\n\nI am asking, because my playgroup does play almost always with four players and we do a complete quest walk through at the moment. Started with Hobbit Saga, continuing with the regular quests in release order. Right now we started sailing. But we are a group of people with medicore deck building skills. So, not playing nightmare and no restricted card pool. But we have to switch to easy mode every now and then, even skipping some of the hardest quests. ... From my point of view even more restrictions to deck building would let us lose every game. xD I guess it is a matter of player count (and skill of course)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/298986-one-progression-mode-to-rule-them-all-beta/?do=findComment&comment=3768587","commentId":3768587,"userName":"Zura","timestamp":1566459606,"content":"> On 8/20/2019 at 4:41 PM, Flrbb said:\n> \n> Just wondering... how many are \"me and my friends\"?\n> \n> I am asking, because my playgroup does play almost always with four players and we do a complete quest walk through at the moment. Started with Hobbit Saga, continuing with the regular quests in release order. Right now we started sailing. But we are a group of people with medicore deck building skills. So, not playing nightmare and no restricted card pool. But we have to switch to easy mode every now and then, even skipping some of the hardest quests. ... From my point of view even more restrictions to deck building would let us lose every game. xD I guess it is a matter of player count (and skill of course).\n\nThere's 5 of us, we've been mostly playing 3 or 4 people. It's been working out fine, addictional restrictions actually make you consider deckbuilding a lot more when preparing and unlocking cards is pretty rewarding."}]}