{"url":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/","title":"Danger in Dorwinion (Spoilers)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772791","commentId":3772791,"userName":"Alonewolf87","timestamp":1566983395,"content":"Is it only me or does it seems very complex actually finishing this quest in 4 players due to the sheer amount of turns one has necessarily to spend (from my account at the bare minimum you need is 16 turns: 2 for the first stage, 12 for the second stage and again 2 for the third) finishing it? Sure the Clues can reduce by 3 that number but it's still a very long quest, one of the longest ever, and without low starting threat and/or a lot of threat reduction you are basically doomed (and that's without considering what happens if you get the Sauron Worship Plot).\n\nSure also in solo it could take a while, but you can manage to handle the lack of locations to explore somehow with encounter deck scrying and manipulation (one of the quest where A Shadow of the Past might actually shine I guess) and by fishing out locations from the encounter deck, but in 4 players there is, to my knowledge, no easy way around to the \"1 active location explored each turn\" limit."},{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772818","commentId":3772818,"userName":"dalestephenson","timestamp":1566989963,"content":"Isn't second stage 3+X resources, so 4 turns solo and 7 turns 4-player, assuming 1 location cleared per turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772827","commentId":3772827,"userName":"Alonewolf87","timestamp":1566991032,"content":"> 16 minutes ago, dalestephenson said:\n> \n> Isn't second stage 3+X resources, so 4 turns solo and 7 turns 4-player, assuming 1 location cleared per turn.\n\nOk, we misread that, I thought it was 3 times the number of players."},{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772840","commentId":3772840,"userName":"sappidus","timestamp":1566992739,"content":"> 21 minutes ago, Alonewolf87 said:\n> \n> Ok, we misread that, I thought it was 3 times the number of players.\n\nThat's a big difference!\n\n(Technically, you can get more than 1 active location explored per turn with things like Thrór's Map/Ghân/Strider's Path/South Away and various progress-placing effects. Might take longer to set up having enough progress around than to actually beat the quest normally though, ha.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772911","commentId":3772911,"userName":"Durins_Father","timestamp":1566998992,"content":"Looping South Away with a location with a Woodmen's Path attached and Strength of Will can lead you to explore multiple active locations per turn. Though that is a pretty big combo you'd have to pull off. Not impossible to explore a location through questing, then travelling and popping an Asfaloth or Mirkwood Explorer. But that quest does demand a strong deck, so it will be difficult to get everything set up at the right time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/299386-danger-in-dorwinion-spoilers/?do=findComment&comment=3772989","commentId":3772989,"userName":"Alonewolf87","timestamp":1567004113,"content":"> 3 hours ago, sappidus said:\n> \n> (Technically, you can get more than 1 active location explored per turn with things like Thrór's Map/Ghân/Strider's Path/South Away and various progress-placing effects. Might take longer to set up having enough progress around than to actually beat the quest normally though, ha.)\n\nWe indeed ended up using Ghan-Buri-Ghan + Legolas to explore 2 locations in one round to accelerate towards the third and final stage of the quest. In the end we played it today and were able to finish it during the 10th round (and of course we got the Sauron Worship Plot and ended up with a 42 threat elimination level), but Galadrim's Greeting + Dwarven Tomb + Backtrack took care of our threats luckily. Also during the first few turns when we had three of those locations which limit threat reduction in the staging area Earendil's Song was crucial to keep the high threat deck of Leadership and Lore to get too high, dumping everything on Spirit."}]}