{"url":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/","title":"Shadow and Flame","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3791372","commentId":3791372,"userName":"Vince79","timestamp":1569214654,"content":"I've been playing Shadow and Flame lately.  I've been trying it with three dwarf heroes as I have the rest of the Dwarrowdelf cycle.  Still haven't won, but I've been doing better after tweaking the deck repeatedly.  Not sure if it can be done consistently though.  Seems like having Hama to recycle Feint is a big part of the strategy, but then it wouldn't be as much of a dwarf deck. \n\nI have a question about Counter-spell.  It has Shadow as a keyword above the text.  I assume that means that it becomes an attachment whether it is revealed in the staging area as a treachery card, or if pops up as a shadow card.  Is that correct?\n\nI don't really enjoy scenarios that are this difficult to be honest, they just get annoying after awhile.  At least we solo players got a break on Foundations of Stone.  This is supposed to be a hard scenario for multiplay, but it was one of the easier ones in Dwarrowdelf for solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3791398","commentId":3791398,"userName":"Amicus Draconis","timestamp":1569221073,"content":"I have taken Frodo to defend against the Balrog, there is plenty of threat to spare, and a powered up Gimli to bring the demon to 0 hitpoints. Frodo might not be a dwarf, but he is the easiest solution in my opinion for a single player in progression style.\nThe Trait on Counter-spell is just a trait, it does not have a shadow effect, therefor it just gets discarded as a shadow."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3791458","commentId":3791458,"userName":"Alonewolf87","timestamp":1569235546,"content":"> 5 hours ago, Vince79 said:\n> \n> I've been playing Shadow and Flame lately.  I've been trying it with three dwarf heroes as I have the rest of the Dwarrowdelf cycle.  Still haven't won, but I've been doing better after tweaking the deck repeatedly.  Not sure if it can be done consistently though.  Seems like having Hama to recycle Feint is a big part of the strategy, but then it wouldn't be as much of a dwarf deck. \n\nIf you have Nori you can keep mantaining your threat at 0 playing the allies, but if you are playing progression style that's not an option I guess."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792049","commentId":3792049,"userName":"Vince79","timestamp":1569289145,"content":"> 18 hours ago, Amicus Draconis said:\n> \n> The Trait on Counter-spell is just a trait, it does not have a shadow effect, therefor it just gets discarded as a shadow.\n\nIs  that right, is that what everybody else thinks?  That would certainly make things easier.  I couldn't find any official info on a \"shadow keyword\", so I just took my best guess on what to do with it.  \n\nI may have to give up on my idea of playing this with a true dwarf deck.  Even if I get lucky and win, that doesn't make it consistent.  Maybe it needs a deck specifically tailored to it,  sort of like Journey to Rhosgobel from the Mirkwood Cycle.  Using Frodo makes a lot of sense.  I also used Gimli to take Durin's Bane down to zero, but it's indestructible so that alone doesn't kill it.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792158","commentId":3792158,"userName":"Alonewolf87","timestamp":1569310943,"content":"> 5 hours ago, Vince79 said:\n> \n> Is  that right, is that what everybody else thinks?  That would certainly make things easier.  I couldn't find any official info on a \"shadow keyword\", so I just took my best guess on what to do with it. \n\nYeah, it's a trait that establish a connection to the Balrog/Durin's Bane/The Nameless Fear and it does not relate to shadow cards/shadow effects. It's similar to the Sorcery trait which appears on some treacheries in the Lost Realm cycle, but there is clearly spelled out which interactions they have with other cards. Since in this case there are no specific indications about it it's simply thematic stuff.\n\n> 6 hours ago, Vince79 said:\n> \n> I may have to give up on my idea of playing this with a true dwarf deck.  Even if I get lucky and win, that doesn't make it consistent.  Maybe it needs a deck specifically tailored to it,  sort of like Journey to Rhosgobel from the Mirkwood Cycle.  Using Frodo makes a lot of sense.  I also used Gimli to take Durin's Bane down to zero, but it's indestructible so that alone doesn't kill it.  \n\nAs I said before with Nori a true dwarf deck can easily approach this quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792524","commentId":3792524,"userName":"Vince79","timestamp":1569354958,"content":"> 12 hours ago, Alonewolf87 said:\n> \n> As I said before with Nori a true dwarf deck can easily approach this quest.\n\nSounds like something to think about in the future, but  right now I'm playing progressive style.\n\nI played another game in the meantime.  Without the Counter-spell card bothering me as a shadow effect, I got farther this time, and might have even won with some luck, but it wasn't to be.  I think the answer is really to switch to a non-dwarf deck, but I've been putting it off.  The question is which three heroes to go with?  I've seen good arguments for Frodo, Hama, and Elrond, but then I'd be giving up Leadership (at least before any card effects that would give me a Leadership icon). "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792583","commentId":3792583,"userName":"dalestephenson","timestamp":1569361494,"content":"If you're playing progression style, you should ignore errata released after that point in the progression.  This makes Hama an excellent choice for solo Shadow and Flame, as he can use Feint on the Balrog every turn."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792720","commentId":3792720,"userName":"Vince79","timestamp":1569382032,"content":"> 5 hours ago, dalestephenson said:\n> \n> If you're playing progression style, you should ignore errata released after that point in the progression.  This makes Hama an excellent choice for solo Shadow and Flame, as he can use Feint on the Balrog every turn.\n\nI hadn't realized it had been changed until you brought it up.  Now he's limited to using his ability three times per game.   Eh, I don't really like that they've changed it.  Oh well. \n\nI mean, some might consider it an unfair advantage, but the Balrog has a lot of unfair advantages too.  Fits the theme though, I guess.\n\nEdited September 25, 2019 by Vince79"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792825","commentId":3792825,"userName":"dalestephenson","timestamp":1569403026,"content":"It was changed long after Hama was introduced, and as Hama was introduced in the same cycle as the Balrog, the interaction could not have been escaped.  In fact, the interaction was obvious enough that *Feint* received errata, preventing Hama from affecting multiplayer games as well.  Hama stopping the Balrog is Working as Designed.  Using Hama to recycle Gwaihir's Debt from the most recent cycle indefinitely would not be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3792860","commentId":3792860,"userName":"mttrchrds","timestamp":1569411849,"content":"I didn't find this scenario much fun as progression solo I must say. There are several game ending cards in the encounter deck. Once I beat it a couple of times I moved on.\n\nThe starting threat of zero does open up some areas to experiment with however e.g. using some high threat heroes together (e.g. Elrond, Aragorn etc). Also, gives you chance to try some secrecy cards in the early rounds (e.g. Resourceful).\n\nI've moved on to two-handed solo since Over Hill and Under Hill (which will be next on your journey I guess) - and I'm actually enjoying the game even more like this."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3793514","commentId":3793514,"userName":"Vince79","timestamp":1569474855,"content":"> 17 hours ago, mttrchrds said:\n> \n> I didn't find this scenario much fun as progression solo I must say. There are several game ending cards in the encounter deck. \n\nThat's no lie.  I find this scenario annoying so far, to be honest.  A few wrong cards pop up and you're done.  And it seems like every card in this encounter deck is a killer.  Usually in most scenarios you can hope for a lull or a break somewhere along the line, but not here.  And that stupid Goblin Swordsman who gets added to the staging area when it was a shadow card, I'm totally sick of that one.  \n\nYou're right, Over Hill and Under Hill is up next.  This scenario aside though, I've really like playing one handed, at least so far."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3794356","commentId":3794356,"userName":"PigsAreOurEquals","timestamp":1569570018,"content":"This is a tough scenrario. The only progression style win I managed was with Elrond + Gimli (and I think Aragorn) and ally Arwen. With plenty of healing and extra HP Gimli can tank the Balrog. And ultimately finish him off.\n\nIf I remember well the \"the pit\"pit location stays in play for a very long time as well. This made it a good target for path of need.\n\nGood luck, it's hard but when you finally beat it it's great!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3795096","commentId":3795096,"userName":"Vince79","timestamp":1569647237,"content":"> 21 hours ago, PigsAreOurEquals said:\n> \n> This is a tough scenrario. The only progression style win I managed was with Elrond + Gimli (and I think Aragorn) and ally Arwen. With plenty of healing and extra HP Gimli can tank the Balrog. And ultimately finish him off.\n> \n> If I remember well the \"the pit\"pit location stays in play for a very long time as well. This made it a good target for path of need.\n\nAs far as I can tell, the \"Dark Pit\" is the only way to win the game.\n\nThe problem I've had with Gimli is you put a Citadel Plate or two on him and power him up, then you get that treachery card that says \"Discard all attachments you control\" and poof he's dead.  I know Test of Will will stop this, but I haven't had it available when this has happened\n\nI've played Elrond, Hama, and Bilbo a few times.  Seemed like I had neither enough questing power nor enough killing power to finish.  Might work next time if I get a lucky draw, who knows?  Aragorn's an interesting idea (in place of Elrond)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3795101","commentId":3795101,"userName":"TwiceBorn","timestamp":1569649215,"content":"Looked back at my score sheets from when I played the scenario back in 2015, one-handed solo progression on standard difficulty.\n\nI won on my fifth attempt using Aragorn (leadership), Frodo (Spirit), and Elrond (Lore)... and never played another solo game for that quest afterwards.\n\nPlayed it 26 times 2-handed with various hero combos (also progression), winning 5/26. \n\nSo whether straight solo or 2-handed, my win ratio was about 20%.\n\nIt's worth noting that not once did I use Hama (pre or post-errata) in any of those games.\n\n \n\nEDIT (strategy tip):\n\n\n\nI seem to remember bombarding the balrog with a rapid sequence of Sneak Attacks with Gandalf and/or Beorn, and launching as many Vassals of the Windlord at the same time as I could. There's nothing like calling a strike force of eagles into the underground depths of Moria.\n\n🙂\n\n\n\n \n\nEdited September 28, 2019 by TwiceBorn"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3795364","commentId":3795364,"userName":"Vince79","timestamp":1569706945,"content":"> On 9/28/2019 at 1:40 AM, TwiceBorn said:\n> \n> I won on my fifth attempt using Aragorn (leadership), Frodo (Spirit), and Elrond (Lore)... and never played another solo game for that quest afterwards.\n\nSo I finally won a game against Shadow and Flame, using the pre-errata Hama.  Post-errata Hama, I don't think I'd bother.\n\nI want to try the Frodo strategy, so I might try Aragorn, Frodo, and Bilbo (I like his card draw ability) next.\n\nEdited to say:  I don't know though, might need Elrond for questing.\n\nThis is distracting me from playing the second quest of Journeys in Middle Earth, I like that game too.  Right now I'm enjoying LOTR LCG though.  Who know finding the time to play games would be such a problem lol?\n\nEdited September 30, 2019 by Vince79"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3796385","commentId":3796385,"userName":"PigsAreOurEquals","timestamp":1569874419,"content":"> On 9/28/2019 at 7:07 AM, Vince79 said:\n> \n> The problem I've had with Gimli is you put a Citadel Plate or two on him and power him up, then you get that treachery card that says \"Discard all attachments you control\" and poof he's dead.  I know Test of Will will stop this, but I haven't had it available when this has happened\n> \n>  \n\nIIRC I used Elrond with Arwen to defend. He does need to be consitently healed every turn. But his built-in ability helps with that. Gimli was there for the attack power. \n\n\nThreat reduction helps a lot too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3798703","commentId":3798703,"userName":"Vince79","timestamp":1570122300,"content":"Just got a win with Aragorn, Frodo, and Bilbo, but it was exhausting lol.  I think I'm ready to move on from this scenario."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3798891","commentId":3798891,"userName":"Amicus Draconis","timestamp":1570131953,"content":"Congrats on the win!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3799289","commentId":3799289,"userName":"Vince79","timestamp":1570178331,"content":"> 14 hours ago, Amicus Draconis said:\n> \n> Congrats on the win!\n\nThanks.  I had won before with pre-errata Hama, that really seems to be the best way to go with this scenario.  Although I guess that's no longer \"official\".  But if you're really playing progressive style, it makes sense to play under the rules at the time they were released. \n\nI don't know, I haven't really enjoyed this scenario that much anyway, it's mostly just annoying.  But facing a balrog shouldn't be a picnic, so what are you going to do?  I thought the Dwarrowdelf cycle as a whole was frigging fantastic though.\n\nIn some perverse way, I guess it makes sense that you can't beat the Balrog with a dwarf deck.  Because the dwarves lost in Moria in the book, so it's true to source material.\n\nEdited to say:   Won my second straight game against Shadow and Flame with Aragorn, Bilbo, and Frodo.  Nearly ran out of cards, only had two left at the end to kill Durin's Bane with.\n\nEdited October 4, 2019 by Vince79"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3807178","commentId":3807178,"userName":"Valhalla Gaming","timestamp":1571224838,"content":"While I enjoyed the Dwarrowdelf cycle quite a bit(on nightmare, not sure how much that differs from the base experience), it felt more ambitious than the Mirkwood cycle, but also uneven at times, lacking the polish of later quests. Shadow and flame for me wasn't a hit, although I didn't struggle too much with it, for example, but I loved the watcher encounter. \n\nIn regards to difficulty/frustration, I love difficult challenges and don't mind losing and resetting, but certain ones hit the sweet spot, while others fall short. I give them immense praise though, I've definitely adored the majority of quests and only been lukewarm on very few."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300345-shadow-and-flame/?do=findComment&comment=3809909","commentId":3809909,"userName":"PigsAreOurEquals","timestamp":1571595623,"content":"Dwarrowdelf also has some of the best player cards and heros. Of the top of my head:\n\n-master of the forge, Elrond+ Vilya, Glorfindel, light of valinor & Asfaloth, sword that was broken, ally Arwen, daeron's runes "}]}