{"url":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/","title":"The Balrog / Doom, Doom, Doom","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791903","commentId":3791903,"userName":"caribecards","timestamp":1569270583,"content":"Hi guys,\n\n1. While The Balrog is in the staging area the only way to attack him is if I have characters that can perform ranged attacks, am I right?\n\n2. During the combat phase, can The Balrog attack me while he is in the staging area?, if so, do I need to deal a shadow card on him?\n\n3. Regarding to the Forced effects on the Doom, Doom, Doom card, I would think the those effects can be resolved in any order, if so, if the second forced effect is resolved first The Balrog shouldn't attack the first round he enters in the game, am I right?\n\nThank you for your help!\n\nEdited September 23, 2019 by caribecards"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791918","commentId":3791918,"userName":"stimpaksam","timestamp":1569272507,"content":"> 43 minutes ago, caribecards said:\n> \n> Hi guys,\n> \n> 1. While The Balrog is in the staging area the only way to attack him is if I have characters that can perform ranged attacks, am I right?\n> \n> 2. During the combat phase, can The Balrog attack me while he is in the staging area?, if so, do I need to deal a shadow card on him?\n> \n> 3. Regarding to the Forced effects on the Doom, Doom, Doom card, I would think the those effects can be resolved in any order, if so, if the second forced effect is resolved first The Balrog shouldn't attack the first round he enters in the game, am I right?\n> \n> Thank you for your help!\n\n1. Incorrect. It says that while it's in the staging area it's considered engaged with the first player. That means characters with or without range can attack it but ONLY the first player.\n\n2. Yes. He never leaves the staging area and attacks like normal. That means you deal it a shadow card.\n\n3. While you're correct about being able to choose the order of simultaneous effects, you can't pick the bottom one first because the Balrog is not in play at that time. You'll have to resolve the top most forced effect first, then the second one. That means the Balrog will attack twice the round it enters play. Once at the end of the quest phase and in the combat phase.\n\nEdited September 23, 2019 by stimpaksam\nspelling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791931","commentId":3791931,"userName":"Boromore","timestamp":1569273034,"content":"On shadow cards, the general rule is that enemies get a shadow card for each attack, unless a card effect specifically states otherwise. So a shadow card for the end of quest phase attack, and another for the combat phase attack. \n\nMy interpretation on Doom, Doom, Doom is different. I don't see why the first player can't resolve the second Forced effect first. If you have an either / or choice, you must choose one that changes the game state. But as worded, these are two equal Forced effects - you HAVE to apply them both. I'd argue you can choose the order of resolution, same as you could the previous round, for example.\n\n \n\nEdited September 23, 2019 by Boromore\n."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791949","commentId":3791949,"userName":"stimpaksam","timestamp":1569274405,"content":"> 17 minutes ago, Boromore said:\n> \n> ...these are two equal Forced effects - you HAVE to apply them both.\n\nOf course, but you have to start with the one that changes the game state first. In this case it's the first forced effect.\n\nPlus I also found this statement from Caleb back in 2014 regarding Doom, doom, doom. He took a different stance but with the same outcome as I mentioned above.\n\n\"Encounter card effects should always be resolved in reading order - from top to bottom. Therefore, you must resolve the first Forced effect on Doom, Doom, Doom (if able) before resolving the 2nd Forced effect. That means that the Balrog will make an attack during the quest phase that it is added to the staging area.\nI hope you’re enjoying The Road Darkens!\"\nCheers,\nCaleb\n\nhttps://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/ [https://community.fantasyflightgames.com/topic/124771-does-the-balrog-attack-right-after-coming-into-play-journey-in-the-dark/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791966","commentId":3791966,"userName":"NathanH","timestamp":1569275441,"content":"Interestingly, if the second Forced effect was on the Balrog rather than Doom, Doom Doom, then the Balrog wouldn't attack in the quest phase on the turn it enters play. At least, it probably wouldn't; the \"end of phase\" timing regularly confuses me.\n\nEdited September 23, 2019 by NathanH"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791972","commentId":3791972,"userName":"Boromore","timestamp":1569276584,"content":"Yep, I stand corrected! Thanks (I think?)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300377-the-balrog-doom-doom-doom/?do=findComment&comment=3791974","commentId":3791974,"userName":"caribecards","timestamp":1569276899,"content":"Thank you guys,\n\nAt the end I think that the intention of those effects is that The Balrog attacks twice the first turn he enters play.\n\nI think the order would be clear if the first forced effect doesn't mention \"at the end of the quest phase\", then it clearly would be first effect to be resolved."}]}