{"url":"https://community.fantasyflightgames.com/topic/300556-sneak-attack-and-host-of-galadhrim-discussion/","title":"Sneak Attack and Host of Galadhrim discussion","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300556-sneak-attack-and-host-of-galadhrim-discussion/?do=findComment&comment=3795209","commentId":3795209,"userName":"sappidus","timestamp":1569680403,"content":"To continue discussion on this ruling, wherein Caleb ruled that an ally Sneak Attack'ed in, then recalled and replayed via Host of Galadhrim, is still subject to the return to hand clause of Sneak Attack…\n\nHost-of-Galadhrim.jpg [https://s3.amazonaws.com/hallofbeorn-resources/Images/Cards/The-City-of-Ulfast/Host-of-Galadhrim.jpg]\n\n@NathanH [https://community.fantasyflightgames.com/profile/254124-nathanh/]:\n\n> Quote\n> \n> Don't like this one. It seems much neater if a card that leaves play and then returns is treated as a completely unrelated card. Also leads to unresolvable situations: sneak attack a Silvan Ally, let's call it Bob, during planning, use The Tree People to return it to your hand. Play Drinking Song, shuffle your hand back into your deck and draw a new hand. This hand contains a copy of Bob. Is it the copy of Bob that the Sneak Attack is targeting, or not? We do not know.\n\nI do not like this ruling either.\n\nBut to play Sauron's advocate here… Consider this: HoG itself—and thus, the Game—has to 'know' which specific allies returned to your hand (those allies; otherwise with it you'd be able to play Silvans in your hand that weren't on the board when you played HoG). So in that specific case I can see why the Game still reports back to Sneak Attack, \"yo, this is still that same Greenwood Archer.\"\n\nNow, Caleb's wording of the ruling is kind of vague IMHO, so I really don't know what he thinks about the situation you pose. Possibly he would say that the Game has no way of knowing it is the same card (even if it is only a 1x in your deck). I am not even precisely sure what he thinks of even simpler situations (e.g., Sneak Attack Bob, Elven-king Bob back to your hand, play Bob normally; what happens to Bob at the end of the phase?), although I can hazard a guess.\n\nIn the end, I think it all requires further digging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300556-sneak-attack-and-host-of-galadhrim-discussion/?do=findComment&comment=3795272","commentId":3795272,"userName":"player3351457","timestamp":1569691202,"content":"I think it ultimately does make sense. We can do a whole bunch of wild things with allies, and the fact that it came out of play and then back into play should not affect the text of the event card. I am sure there are other shenanigans this would open up if it was ruled that once out of play all lasting effects cancel, and then all you have to do is bring it back into play. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300556-sneak-attack-and-host-of-galadhrim-discussion/?do=findComment&comment=3795771","commentId":3795771,"userName":"dalestephenson","timestamp":1569794837,"content":"I think the Sauron's advocate is the best defense of the ruling -- Sneak Attack doesn't lose track specifically because Host of the Galadhrim doesn't lose track -- it remembers \"those allies\" and puts them back in play.  That's not true of any of the other return-to-hand commands, so I wouldn't use the ruling to justify Sneak Attack removing a card that was originally sneaked, but subsequently repaid at full price.\n\nIt's good that Host of the Galadhrim remembers the allies it pulled out of play to put them back, even if they are no longer Silvan any more."}]}