{"url":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/","title":"If quest stage changes before end of questing, do we resolve questing against new stage?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3799561","commentId":3799561,"userName":"tripecac","timestamp":1570209160,"content":"Here's one situation:\n\nCroaking Crows in in play.  First encounter card is a location.  This causes progress to be put on Smaug the Golden.  He's now got 6, so we immediately change to Stage 4A, which gets resolved and then flipped to 4B.\n\nNow, what happens to the rest of questing?  Once we finish drawing encounter cards, do we resolve questing against the newest stage (Stage 4B in our example), which means we could possibly finish that quest stage the same turn?  Or is questing aborted for the round, due to the change in quest stage?\n\nEdited October 4, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3799575","commentId":3799575,"userName":"tripecac","timestamp":1570210006,"content":"Page 10 of the latest FAQ says this (when talking about Legolas):\n\n> Quote\n> \n> Quest cards are immediately replaced as soon as players place enough progress on them, and this replacement does not interrupt the current round sequence. If the current quest card only needs 1 progress on it, then a player could also trigger the Blade’s effect first, and then Legolas’ in order to maximize the number of progress tokens placed. (There is no carry-over progress from an effect).\n\nI interpret this as meaning that if the quest stage changes for any reason, we do *not* interrupt the questing flow.  Instead, it sounds like we do this:\n\n1) replace the current quest stage with the new one\n2) follow the setup rules on the quest stage (usually sides A and B)\n3) continue drawing 1 encounter card per player (assuming both the old and new quest stage expect you to draw 1 per player - I'm not sure what happens if different stages require different numbers of encounter cards drawn per round and you are mid-way through drawing those cards)\n4) compare your willpower vs the staged threat to determine if questing was successful\n5) apply consequences of questing (based on rules of new quest stage)\n6) if successful, add progress tokens to new quest stage (after adding them to active location, of course)\n\nDoes that sound correct?\n\n\nIf so, then if in my example, I have enough willpower to add 7 progress to Stage 4B, then I immediately jump back to 2B.  That would definitely be helpful!\n\nEdited October 4, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3799622","commentId":3799622,"userName":"NathanH","timestamp":1570214463,"content":"Yes, you resolve questing on the new stage, unless there is a specific rule on a card in play that states otherwise."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3799624","commentId":3799624,"userName":"tripecac","timestamp":1570214762,"content":"Awesome, thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800103","commentId":3800103,"userName":"Wandalf the Gizzard","timestamp":1570277356,"content":"I had to let out a nervous laugh when I saw this thread. Last time this question came up, a redundantly long discussion was manufactured that led to a twenty page thread on the order of quest resolution.\n\nEdited October 5, 2019 by Wandalf the Gizzard\n-"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800114","commentId":3800114,"userName":"sappidus","timestamp":1570280620,"content":"I believe this is the relevant ruling. All progress is canceled:\n\n \n\nEdited October 5, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800128","commentId":3800128,"userName":"sappidus","timestamp":1570282178,"content":"> 19 hours ago, tripecac said:\n> \n> I interpret this as meaning that if the quest stage changes for any reason, we do *not* interrupt the questing flow.\n\nI think your interpretation may be a bit off here. The FAQ situation with Blade of Gondolin and core Legolas is about sequentially triggering two Responses with the same trigger condition. Legolas' progress being placed on the new stage is a result of the current quest being said new stage at the time the ability is actually resolved—this is not really the same situation as resolving questing during the Quest Phase.\n\nI basically agree with @Boromore [https://community.fantasyflightgames.com/profile/281899-boromore/]'s interpretation that he shared in the ruling I linked above: the current quest is locked in by the time you start staging and progress from questing won't be placed on other quest cards (except for those rare encounter cards that explicitly refer to, and change, the current quest).\n\nNote this somewhat different situation, which is not directly relevant but is nonetheless interesting:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800175","commentId":3800175,"userName":"dalestephenson","timestamp":1570289240,"content":"I don't think Boromore's answer is the relevant ruling.  In that case, he had *already quested successfully*, and that triggered the final token -- progress had yet to be placed, but because the stage advanced during quest resolution the \"remaining progress\" could not be placed.\n\nIn this case, the advance to stage 4 happened during staging, not quest resolution, due to Croaking Crows.  That causes the stage to change, but quest resolution has yet to happen and when it does happen stage 4b, not stage 2b, will be the current quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800217","commentId":3800217,"userName":"tripecac","timestamp":1570293864,"content":"I see what you guys are saying.  And I definitely don't want this topic to turn into a 20 page leviathan.\n\nIn terms of Caleb's rulings, this sentence seems to be key:\n\n> Quote\n> \n> If you could defeat stage 4B immediately after advancing to that stage, it would negate the entire purpose for that stage existing in the adventure.\n\nI can understand why Caleb, as a designer, would not want players to be able to skip Stage 4B (which resembles a frantic action sequence in a movie).  It's part of the \"plot\" of the quest.\n\nHowever, I think the word \"immediately\" (which both Caleb and I used) is open for interpretation. \n\nI am looking at page 21 of the Rules Reference Guide.  In section III Quest Phase I can see the following \"Framework Steps\" listed:\n\n> Quote\n> \n> - 3.1 Quest phase begins\n> - Action Window\n> - 3.2 Commit characters\n> - Action Window\n> - 3.3 Staging\n> - Action Window\n> - 3.4 Quest resolution\n> - Action Window\n> - 3.5 Quest phase ends\n\nIn my example, the quest stage changed before I had reached the end of 3.3 Staging.  So, I hadn't yet reached 3.4 Quest Resolution (where you compute progress) yet.  I still had more encounter cards to draw.\n\n1) During Staging, an encounter card was drawn which forced the switch from Stage 2B to 4A (and then 4B). \n2) After that, I resumed Staging (drawing and resolving encounter cards).\n3) After that, I had an Action Window, in which I could use cards or effects to boost Willpower, tweak staging area threat, etc.\n4) After that, I started Quest Resolution (comparing willpower vs threat to compute how much progress/threat would result from questing).\n5) After that, I placed progress on active location until it was fully explored, and then resolved any effects of exploring that location.\n6) Finally, I placed remaining progress on the current quest stage, which was 4B.\n\nBetween the start of Stage 4B and the placing of progress on it, there was still quite a bit of activity (encounter cards, player actions, etc.).  So, the defeat of Stage 4B was not \"immediate\" in terms of game timing (as page 21 of the rules reference clearly shows), even though I used that term casually in my previous post. \n\nWhen Caleb and I used the word \"immediately\", we did so casually, and, to be honest, a bit sloppily.  In my case, I used it incorrectly.  In Caleb's case, my guess is that he was trying to say that the overall intent was to get players to \"feel the pain\" of Stage 4B... but intent is fuzzy, and we're after crystal-clear game rules which we can apply again and again without having to repeatedly post questions like these on the forum.  Once we understand the game rules, it is then our job as players to battle against them, using whatever tactics, tricks, and luck we can find!   So if the designers leave a \"weakness\" in the rules (like a bare patch in Smaug's armour), then we, as players, should be permitted, and even expected, to take advantage of that bare patch... just like Bard did.\n\nSo when Caleb said \"immediately\", did he mean:\n\na) \"within the same Framework Step\"\nb) \"within the same Phase\"\nc) \"within the same Round\" or\nd) something else ? \n\nWe don't know.  We can only guess.  And post questions about it.\n\nSo what do the rules say?\n\nPage 12 of the FAQ clearly indicates that players can make progress against 2 different quest stages within the same Phase; they use Legolas in the Combat Phase as an example.  Since the FAQ was updated long after The Lonely Mountain was released, I don't think we can brush off the FAQ's ruling as \"out-dated\" relative to the mechanics of The Lonely Mountain.\n\nSo, if we can make progress against multiple quest stages in the Combat Phase, then why not the Quest Phase? Where is it written that the Quest Phase is \"different\" in that respect?\n\nIn fact, you could argue that Legolas's multi-stage progress is happening during a smaller \"time interval\" (within Player Attack Resolution somewhere between 6.8.3 Determine Combat Damage and the following Action Window) compared to what's happening in The Lonely Mountain (3.3 Staging -> Action Window -> 3.4 Quest Resolution).  So if Legolas can do it, why can't we?  Is Legolas really *that* awesome???  After all, we're not talking about the movies now, are we? :)\n\nSo why can't we change stages multiple times in the Quest Phase?  So far the rules seem to be saying we can.\n\nIn fact, the previous scenario had us doing just that!!!  In Flies and Spiders, when we defeat Stage 1B, we go to Stage 2A/2B... and then within that same Quest Phase (and even the same Framework Step), a \"When Revealed\" effect forces the stage to change again, to Stage 3A/3B!  The jump from Stage 1 to 2 to 3 all happens in the same Quest Phase.  \n\nThat very concept of multiple stage changes per Phase is still fresh in our minds when we start playing the next scenario, which is The Lonely Mountain.\n\nSo at that point, it is only natural for the player to think that multi-stage progress is now just another part of the game.  We were, after all, just shown that it could be done!  And that FAQ ruling quite clearly supports the idea.\n\n \n\nLook, I understand that the designers of The Lonely Mountain may have \"intended\" for us to spend at least a round or two in Stage 4B.  (And in I fact already did, having spent several rounds in 4B before returning to 2B for a second go at the treasure.)  However, their rules are just not thorough enough to ensure that their intent is experienced by every player, every time through the game.  They win some, they lose some... just like us.\n\n \n\nI don't know how the rest of you guys feel, but to me, the quests and cards in the Hobbit saga are the most confusing, frustrating, and \"buggy\" so far.  I like the general idea of the quests.  I like having Bilbo floating around, and the powerful Treasures.  And I like the extreme focus of the encounter sets (which makes it easier to anticipate which sort of threats are coming at you)... But man, there are so many moments in the Hobbit saga where I feel like they needed to test this stuff more, and spend more time clarifying and smoothing out the rules. \n\nThe Hobbit saga is a rough, awkward ride... like that Rhosgobel Rabbit sled.  It's entertaining on the surface but ultimately becomes a little cringe-inducing.  It feels rushed and clunky, like the movies. \n\nI'm glad The Hobbit saga exists, and I've enjoyed many moments while playing it, but it really could use a heavy revision.  Of course, that would mean a 2.0, and none of us want that... because they wouldn't stop at The Hobbit.  They'd go back and \"2.0\" everything.  And soon we'd be broke again.  With zero time left for anything else.  And you can bet they'd neuter Steward of Gondor if they get a chance.  And that's my Easy Mode. \n\nSo I'll keep mumbling and grumbling my way through the Hobbit saga.  Almost done with it now.  Just 1 more quest to go.  And after that will be... let's see... The Battle of Lake Town and The Heirs of Numenor.  Sounds good to me.  After these glitchy Hobbit quests, those should be a piece of cake, right?\n\nEdited October 5, 2019 by tripecac"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800291","commentId":3800291,"userName":"Wandalf the Gizzard","timestamp":1570304919,"content":"It comes down to whether we should take the card text and rules as written, or play the game the way the developer intended it to be played. A matter of principle, my dear Watson! ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800340","commentId":3800340,"userName":"dalestephenson","timestamp":1570315913,"content":"The designer did use the word \"immediate\" and was referring to a rules question where placed progress could clear 4B *immediately* after advancing to it.  Neither is true when you advance the quest during staging -- I think the \"designer's intent\" was simply that you couldn't use one successful questing resolution to clear both 2B *and* 4B, not to prohibit you from clearing 4B in one turn when 4B is the only quest stage in play during quest resolution.\n\nFurther, if the original designer didn't want the possibility of advancing from 2B to 4A during staging, he wouldn't have created Croaking Crows (3x, surge) or Pretending to Sleep (3x, surge) in the first place.  Being in stage 4 instead of stage 2 isn't some sort of prize; you lose the opportunity to burgle, you lose the chance to move to 3a (the only stage where you actually win), and you get a nastier and possibly higher threat dragon in staging to boot.  And since there's no benefit to overquesting in stage two, you might not clear stage four anyways when you go there unexpectedly. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300797-if-quest-stage-changes-before-end-of-questing-do-we-resolve-questing-against-new-stage/?do=findComment&comment=3800376","commentId":3800376,"userName":"sappidus","timestamp":1570322059,"content":"I may have gotten the details wrong here. Regardless, I do think asking officially would be the easiest way to find out."}]}