{"url":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/","title":"Solo League 14 -- LOTR saga with Ringmaker player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3800159","commentId":3800159,"userName":"dalestephenson","timestamp":1570288071,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the LOTR saga. The quests are:\n\n1) Journey in the Dark\n2) Breaking of the Fellowship\n3) Helm's Deep\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the (non-fellowship) heroes must be from a box with those quests. This means that you must have at least one of Gandalf, SpTheoden, or Treebeard.  As these are saga quests, you will also have a fellowship hero.  For Helm's Deep this must be the Aragorn that comes in Treason of Saruman, but for the other two quests you must use the same fellowship Frodo (it can be any of the four versions).\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Journey in the Dark and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing Helm's Deep it does not matter how many tokens I needed to defeat Breaking of the Fellowship.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside LOTR saga, VoI/Ringmaker and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from LOTR saga, VoI/Ringmaker or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from LOTR Saga or VoI/Ringmaker. More is better.\n\n3rd) The number of heroes used from this list: Gandalf, Treebeard, Spirit Theoden. More is better.\n\n4th) The number of cards in the deck outside LOTR saga and VoI/Ringmaker. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside The Road Darkens and Treason of Saruman. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in September's Solo League (if you didn't play or finish September's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for December's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in December's league. November's cycle will be chosen by the winner of September's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring (and can be delayed if requested) -- the first two deadlines are only to be included in intermediate standings.\n\nJourney in the Dark: October 14th\nBreaking of the Fellowship: October 21st\nHelm's Deep: October 28th\n\n8 ) I've created a google spreadsheet for results here: \nhttps://docs.google.com/spreadsheets/d/1lh_OpjEosBJGxQtSUUIVkRYEna4Uucn8p5_rsl62RnU/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1lh_OpjEosBJGxQtSUUIVkRYEna4Uucn8p5_rsl62RnU/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3800250","commentId":3800250,"userName":"General_Grievous","timestamp":1570301761,"content":"Awesome! Totally in for this month! What are the rules surrounding boons/burdens? Can we still use items such as Anduril, Glamdring or Sting?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3800332","commentId":3800332,"userName":"dalestephenson","timestamp":1570314620,"content":"No boons or burdens, the quests are completely independent.  On the plus side, it means you can sacrifice a hero against the Balrog without losing him, and can take Poisoned Counsels in Helm's Deep without worrying it will harm your campaign.\n\nSting and Glamdring are available as guarded cards from the Ered Mithrin cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3800506","commentId":3800506,"userName":"Zura","timestamp":1570365905,"content":"had a huge break, but will participate in this round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3801923","commentId":3801923,"userName":"General_Grievous","timestamp":1570548880,"content":"First quest done, I chose Land of Shadow Frodo and so with a starting Willpower of 14 I was able to race through Moria first try finishing the round before the Balrog showed up.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3802652","commentId":3802652,"userName":"General_Grievous","timestamp":1570633843,"content":"The fellowship is broken! This solo league is the first time I have tried Silvins and I am having a ton of fun with their style of play. Being able to use the high Willpower to quickly get to past phase 1, cancel key attacks from the Uruk-Hai Captain in phase 2 and then choosing Orc Hunting was a great combo made possible by the Silvins. Also getting Wizard Pipe, Steward of Gondor and Nenya in play by the second round also was a stroke of Elvish luck. I think it only went so well because Galadriel, Celeborn and their Lothlorien allies knew the forest and river around there so well haha.\n\nHelm's Deep should be interesting though as I won't be able to just race through it with high Willpower like I did the first two. To Rohan we go!\n\nEdited October 9, 2019 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3802961","commentId":3802961,"userName":"General_Grievous","timestamp":1570653371,"content":"Helm's Deep has been held. I chose to shuffle in Poisoned Counsels so I could get Bilbo Ally into play and search my deck for Wizard Pipe getting a 2 for 1 kind of deal. And also started out with the key cards Gandalf's Staff, Unexpected Courage and a host of Silvin allies. I did ok for the first few rounds, keeping my threat low enough to avoid the Soldier of Isenguard with Galdriel since I couldn't use her to contribute to the Quest without her ring yet. Locations began piling up and on round 5 I lost Stage 2, round 6 stage 3 and round 7 I managed to hold on thanks to having a second Helm's Gate to soak up some questing points. Baugh guides and Daughter of the Nimrodel were MVPs for me being able to help keep Gandalf/Aragorn ready and deal with the archery damage respectively. \n\n \n\nAll in all I had a ton of fun with Silvins and probably would not have explored this archetype as soon as I did without this month's solo league so thank you Dale and the others for that. Looking forward to hearing everyone else's play reports and how well Gandalf hero did for them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3809312","commentId":3809312,"userName":"dalestephenson","timestamp":1571497446,"content":"Journey in the Dark is a tough quest in the saga campaign, since to avoid a fallen hero or taking all four burdens you need to race through before the Balrog shows up.  Here we can lose heroes with impunity, and leave a living Balrog behind in stage three with no issues.\n\nBut as it turns out, my Stereotypical Three Rings deck had Vilya and Nenya in the opening hand, and I was able to race through -- three turns on the first stage, four on the second stage (an ill-timed Mines of Moria left me one progress short for three turns), and Test of Will used to cancel two Doom removals.\n\nThanee and General Grevious both are using Gandalf hero as well, but Grevious is using 0 outside cards and passed up Elrond for a Galadriel-Celeborn-Gandalf Silvan deck composed entirely of core/saga/ringmaker cards.  We all made it through unscathed (outside cards in parens):\n\n0 General Grevious (0)\n0 dalestephenson (28)\n0 Thanee (31)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3809648","commentId":3809648,"userName":"rees263","timestamp":1571552852,"content":"I've never used Treebeard before so this was a good excuse to do so. I decided on the classic combination of Leadership and Lore since I couldn't come up with a good trisphere build and settled on Leadership Denethor and Sam to accompany Treebeard. I included plenty of healing and allies for questing. List is here: https://ringsdb.com/decklist/view/13469/octobersololeague-1.0 [https://ringsdb.com/decklist/view/13469/octobersololeague-1.0]\n\nJourney in the Dark was not too bad. I was able to quest to the end with 2 tokens still on Doom, Doom, Doom. Henamarth Riversong and The Hidden Way were great for managing the encounter deck and I got to sneak attack Gandalf a couple of times to push through the quest. I used the Frodo from The Mountain of Fire since you aren't punished in the Road Darkens quests for having the ring exhausted so there was no risk taking the extra resources.\n\nI almost picked Breaking of the Fellowship because I love the way the separate staging areas are handled in the quest. I didn't because the solo version didn't appeal as much, but I still had a lot of fun. Treebeard is great for pushing through the first stage of the quest and then the stage 3 quest that discards enemies helped to keep the encounter deck in line. I actually lost Denethor part way through to a shadow card, but with Steward of Gondor on Treebeard I didn't miss him that much.\n\nHelm's Deep started well since I got Faramir and Wellinghall Preserver into play in round one. There were couple of tough spots - Warrior of Dunland was my first encounter reveal and I took a lot of archery damage for a couple of rounds because I kept revealing enemies. I was glad in the late game since I was able to keep the threat level manageable. I did draw Poisoned Counsels, but my hand was almost empty and Gleowine and Erestor allowed me to refill straight away. It was a little strange to play without Spirit, since in my Campaign run I used Eleanor almost entirely for dealing with Devilry of Saruman. I did end up seeing it once, but since I was thinking about it and had used Faramir already that round. The Hidden Way allowed me to effectively bypass Helm's Gate on stage three and Henamarth let me strategically place progress tokens so I wouldn't have to reveal extra cards. In the end I managed to skip stage 4 entirely.\n\nI'd never played Journey or Helm's Deep outside of campaign mode before and in general I think that made them somewhat easier.\n\nFinal count - 0 tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3820537","commentId":3820537,"userName":"dalestephenson","timestamp":1572770521,"content":"Sorry for the delay in posting results.\n\nThe second quest, Breaking of the Fellowship, is the easiest of the three in the campaign, though the first two stages remind me of Journey Along the Anduin's second and third stage, except without the ability to optionally engage enemies and with the super-annoying toughness/archery Uruk-Hai.  But not having to worry about finding and clearing Seat of Seeing to remove a burden simplified things -- plus choosing Guarding the Hobbits for stage 3 (readying all heroes after questing sucesssfully) was incredibly powerful in a Three Ring deck.\n\nThe other players also needed no tokens.  rees263 joined with a non-Gandalf deck, using a Treebeard-Sam-LeDenethor Ent deck.  Outside cards in parens:\n\n0 General_Greivous (0)\n0 rees263 (25)\n0 dalestephenson (28)\n0 Thanee (31)\n\nThe third quest, Helm's Deep, can be intimidating in solo campaign, but without campaign elements taking Poisoned Counsels is a no-brainer -- especially when you have Gandalf and can see it coming.  I was a bit unlucky in the first stage -- I had Vilya in my opening hand and wouldn't mulligan, but the only allies in hand were Ioreth (free) and Master of the Forge.  Glorfindel was the 7th card, but we move to 1B before beginning the first turn, so I could neither get him for free nor Vilya him before drawing.  Still, the extra turn was well worth it, it didn't raise my threat (Galadriel), gave me more resources, and in the end I was able to use Vilya on Treebeard my first turn, who is even more awesome than Glorfindel.\n\nPoisoned Counsels ended up as the top card a surprising amount of times, but Master of Forge always made it go away -- I had other options as the game progressed to permanently deal with it, Wizard Pipe (doesn't draw), Mirror of Galadriel (doesn't draw), Expert Treasure Hunter when questing successfully (did that a surprising amount of times).  A couple of Elrond's Counsel let me keep my starting Isengardian in staging through the first stage, keeping the number of reveals down, and between Vilya and the other attachments I cruised -- when Theoden rode out, it was a triumphant running down rather than a desparate suicidal sorty.  I had:\n\nGandalf ready (Unexpected Courage) with his staff and Shadowfax and Narya.\nElrond ready (Light of Valinor) with Burning Brand and Magic Ring.\nFellowship Aragorn exhausted, but with four resources to allow readying any hero twice.\nTreebeard ally exhausted, but with seven resources to ready himself three times.\nGlorfindel ally exhausted, but with a first full of expendable cards (plus a Silver Harp to allow one discard for free).\nElladan/Elrohir allies readied by optionally engaging the enemy added to staging.\nBeorn and Yazan allies ready and waiting....\n\nWith all that firepower, it was almost a shame to only have two enemies to kill.  But none of the other players needed tokens for the quest either, leaving the final standings:\n\n0 General_Greivous (0)\n0 rees263 (25)\n0 dalestephenson (28)\n0 Thanee (31)\n\nOn the first tiebreaker, General Greivous wins the league and gets to select the cycle for December.  rees263 is second and gets to choose a quest from that cycle to play, I'm third and get to choose a quest to exclude, and Thanee's zero-token performance gets him last place and the choice of a supplemental cycle for player cards.  Thanks for playing!\n\nJoin us this month for Against the Shadow, as we face Steward's Fear, Druadan Forest, and Blood of Gondor.  I'll post a link to the spreadsheet later today."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3820943","commentId":3820943,"userName":"General_Grievous","timestamp":1572848192,"content":"Awesome! Thank you for organizing this dale and great to play through some super thematic quests with a cool deck-building challenge. For the December cycle I would like to choose the Dream-chaser cycle. My wife and I just finished playing through it tonight and it was my favourite one yet, even more so than the Sagas and I love those. So would be cool to take to the seas with you fine gentleman as we battle corsairs, search for lost treasure and parlay with Sahir and Na'asiyah."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3821895","commentId":3821895,"userName":"rees263","timestamp":1572964210,"content":"When I chose the Dream Chaser cycle earlier in the year I was disappointed that we didn't get to do a Sailing quest so I'll make up for it and choose the most Sailing-y quest - A Storm on Cobas Haven."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3822330","commentId":3822330,"userName":"dalestephenson","timestamp":1572991694,"content":"I'm going to exclude Temple of the Deceived since we played on both prior visits to Dreamchaser.  RNG gives us:\n\nVoyage Across Beleager (Grey Havens)\n\nFlight of the Stormcaller (AP1)\n\nA Storm on Cobas Haven (AP5)\n\nSo it's sailing, sailing, sailing...  Choice of heroes are Cirdan, Galdor, and Na'asiyah.  Thanee has chosen LR/Angmar for supplemental player cards. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3822349","commentId":3822349,"userName":"General_Grievous","timestamp":1572994865,"content":"Awesomeness! Love the super sailing theme and will be a fun December one, now to work on my Against the Shadow deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3822441","commentId":3822441,"userName":"rees263","timestamp":1573005813,"content":"> 3 hours ago, dalestephenson said:\n> \n> I'm going to exclude Temple of the Deceived since we played on both prior visits to Dreamchaser.  RNG gives us:\n> \n> Voyage Across Beleager (Grey Havens)\n> \n> Flight of the Stormcaller (AP1)\n> \n> A Storm on Cobas Haven (AP5)\n> \n> So it's sailing, sailing, sailing...  Choice of heroes are Cirdan, Galdor, and Na'asiyah.  Thanee has chosen LR/Angmar for supplemental player cards. \n\nYay for super sailing!\n\nDenethor is the hero from Stormcaller so we can use him too right?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300832-solo-league-14-lotr-saga-with-ringmaker-player-cards/?do=findComment&comment=3822728","commentId":3822728,"userName":"dalestephenson","timestamp":1573053478,"content":"Correct.  LeDenethor is the fourth mandatory hero option."}]}