{"url":"https://community.fantasyflightgames.com/topic/300960-out-of-play-cards-with-attachments-and-tokens/","title":"Out of play cards with attachments and tokens","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300960-out-of-play-cards-with-attachments-and-tokens/?do=findComment&comment=3802610","commentId":3802610,"userName":"Boromore","timestamp":1570630246,"content":"This question is from \"Across the Ettenmoors\" Nightmare scenario, although I'm sure I've met the question before. \"Rescue from the Trolls\" puts a hero out of play until the side quest is completed. \n\nWhen the hero comes back into play, what happens to any attachments on the hero card? Similarly, what happens to any tokens (resources and damage)?\n\nApologies if that has been dealt with before - couldn't find anything on a quick search."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300960-out-of-play-cards-with-attachments-and-tokens/?do=findComment&comment=3802687","commentId":3802687,"userName":"sappidus","timestamp":1570636018,"content":"The relevant text on the side quest:\n\n> Quote\n> \n> When Revealed: Each player places the lowest-threat-cost hero he controls facedown underneath Rescue from the Trolls, out of play.\n\nThe hero transitioning from in play to out of play certainly satisfies the condition of leaving play, which means attachments get discarded (<http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule498 [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule498]>).\n\nAs far as any tokens on the hero go, I believe they should just be returned to the token bank, even though the RR is silent on specifically what happens to them. I cannot think of any situation in the game where a card is returned from out of play and by default \"remembers\" what tokens had been on it when it left play (ignoring some weirdness about flipping), though of course I welcome anyone to correct me.\n\nEdited October 9, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300960-out-of-play-cards-with-attachments-and-tokens/?do=findComment&comment=3802696","commentId":3802696,"userName":"Boromore","timestamp":1570636672,"content":"Thanks - makes sense. Of course, I see the attachment rule clearly, now that you have kindly focussed my gaze!"}]}