{"url":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/","title":"Looking for playtesters (OCTGN)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/?do=findComment&comment=3803301","commentId":3803301,"userName":"banania","timestamp":1570688113,"content":"Dear Community,\n\nI am looking for playtesters for three (custom) scenarios I have recently built and playtested on my own.\n\nYou can be a beginner or an old grognard of the game. There are no requirements other than:\n- You must be able to play the game on OCTGN (that allows for quick games)\n- In the first step, I would like you to test the scenarios with only the Core Set player cards at your disposal\n- In the second step, you can use any deck at your disposal\n\nIf you have the opportunity to apply/playtest as a team (2 players) or are willing to play two-handed, let me know, as I think the game is best tailored for two people.\n\nAll files will be communicated in OCTGN format.\n\nI am looking for a second batch of playtesters willing to test player cards that will accompany those scenarios\n\nYou can be a beginner or an old grognard of the game. There are no requirements other than:\n- In the first step, I would like you to build your decks using only those player cards and cards from the Core Set, test it against the reduced quest gauntlet below\n- In the second step, you can build a deck with the whole card pool\n\nAll files will be communicated in OCTGN format and pdf format if you want to proxy and test them live.\n\nPlease apply using my email address at mathieu.smartin __at___ gmail.com or pm me here, or boardgamegeek. I will use a discord channel to communicate more easily. So if you have a discord account all the better (I’ll send you the link to the channel)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/?do=findComment&comment=3803561","commentId":3803561,"userName":"player3351457","timestamp":1570721374,"content":"What type of output are you looking for for the playtesters? Are you looking for a generic review, a full play-by-play, an after action report, or a recording of the full game... or any of the above?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/?do=findComment&comment=3803718","commentId":3803718,"userName":"banania","timestamp":1570730404,"content":"Generic review, difficulty assessment, rule questions, bugs, etc. No need for anything too detailed, or to record your game.\n\nAlthough try to make a side note what deck you're using.\n\nEdited October 10, 2019 by banania"},{"commentUrl":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/?do=findComment&comment=3817050","commentId":3817050,"userName":"banania","timestamp":1572342206,"content":"I am still looking for playtesters!\n\nThis deluxe fan-made expansion is now available to you playtesters either in OCTGN or pdf printable format. Feel free to pm, join us on discord or contact me on my email address."},{"commentUrl":"https://community.fantasyflightgames.com/topic/300987-looking-for-playtesters-octgn/?do=findComment&comment=3920265","commentId":3920265,"userName":"banania","timestamp":1585316838,"content":"Im necro-upping that thread.\n\nIf you're quarantined and wants some more LOTR LCG goodness, drop me an email or a private message.\n\nThe scenarios are playable on OCTGN by a simple zip extraction."}]}