{"url":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/","title":"The Hobbit","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805231","commentId":3805231,"userName":"Vince79","timestamp":1570921121,"content":"So I've started playing Over Hill and Under Hill, the first Saga Expansion.  I guess this is considered a campaign, but I'm a little fuzzy on how this is supposed to work.\n\nAre you supposed to play all three (or all six) scenarios consecutively?  What if you lose one, does that mean you're out and you have to start over?  Or can you win the first one, lose the second one several times until you beat it, then go on to third one, etc.?\n\nAre you supposed to keep one deck throughout the campaign or can you change them for each scenario?  Are you supposed to keep the same heroes or can you swap them out also?  Or am I overthinking this whole thing and should just play the scenarios however I want?\n\nI settled on a deck and I've played the first scenario, \"We must away ere break of day\" several times.  I've been winning about half the time, is that good for this quest?  I haven't been able to get the treasure though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805313","commentId":3805313,"userName":"player3351457","timestamp":1570939985,"content":"In theory, you should play them all (6) consecutively. I would recommend this as it tells the story in order.\n\nIf you lose, replay until you beat it. Even if you beat it, it's good replay until you get the goodies involved. (Treasure) You don't have to start over though that might be a fun twist on campaign mode, depending on how much you like the early scenarios.\n\nYou don't have to keep the same deck, but you should keep the same heroes. Though this isn't explicitly laid out in the rules I don't think, it is a custom for campaigns to keep the same heroes and adjust the contents of the deck depending on the usefulness or unusefulness of the cards. I know for the Saga campaign, you are to keep the same heroes throughout. \n\nYou are overthinking it a little... enjoy the hobbit campaign. It's built for some fun perks and the treasure cards are great.\n\nI'd say that first scenario is always a dogfight. Getting through it with a .500 record is pretty solid."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805363","commentId":3805363,"userName":"Amicus Draconis","timestamp":1570963233,"content":"You can play the Hobbit saga in any order you want, just keep in mind, that they tell a story, if you play them consecutively. You also can swap heroes out at will, but if you want to use treasure cards in your decks, you need to follow these rules:\n\n> Quote\n> \n> A player is permitted to add a treasure card to his deck if both of the following conditions are met:\n> \n> 1. The player has discovered the specific treasure card he wishes to use through game text in a previous scenario using the same group of heroes he is currently playing with.\n> \n> 2. The specific treasure card belongs to a treasure set that is listed in the setup instructions for the scenario currently being played. The treasure set icon appears in place of a sphere icon on treasure cards, and can also be used to identify which scenario it can be discovered in.\n\nIf you play the scenarios in their correct order and stick to 1), you will automatically fulfil 2) as well."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805394","commentId":3805394,"userName":"Vince79","timestamp":1570972160,"content":"I thought I had read somewhere that you had to play with the same group of heroes when going through a saga.  Does that mean that you have to also keep the same group of heroes through \"On the Doorstep\" as well?\n\nThis is just my personal opinion, but:  From a thematic standpoint, it makes sense to be able to change the heroes.  If you are in a fellowship of nine, or a group of 12 dwarves plus a wizard and a hobbit, why would you always have to use the same three or four characters?  Let some of the others get some spotlight lol.\n\nI probably am overthinking things, but I don't want to get through three of the quests only to find I'd been playing it wrong the whole time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805428","commentId":3805428,"userName":"Amicus Draconis","timestamp":1570979476,"content":"The Hobbit boxes cannot be played as saga, which is a different concept introduced with The Black Riders. The only rule forcing you to stick to your heroes is the one I quoted above. But of course you can always houserule the treasures and use them in the next deck with different heroes, though I would advise to earn them in the first place for more theme."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805597","commentId":3805597,"userName":"Vince79","timestamp":1571014928,"content":"> 9 hours ago, Amicus Draconis said:\n> \n> The Hobbit boxes cannot be played as saga, which is a different concept introduced with The Black Riders. The only rule forcing you to stick to your heroes is the one I quoted above. But of course you can always houserule the treasures and use them in the next deck with different heroes\n\nHonestly, I don't mind sticking with the same heroes.  I'm just saying I don't really see the rationale for having to do so, because Thorin's party included more than four heroes.  \n\nI don't really follow what you're saying about not being able to play the Hobbit boxes as a saga.  I guess I don't know what a saga is, because I haven't got that far yet?  I thought Under Hill and Over Hill and On the Doorstep were called saga expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805598","commentId":3805598,"userName":"Vince79","timestamp":1571014941,"content":"> 9 hours ago, Amicus Draconis said:\n> \n> The Hobbit boxes cannot be played as saga, which is a different concept introduced with The Black Riders. The only rule forcing you to stick to your heroes is the one I quoted above. But of course you can always houserule the treasures and use them in the next deck with different heroes\n\nHonestly, I don't mind sticking with the same heroes.  I'm just saying I don't really see the rationale for having to do so, because Thorin's party included more than four heroes.  \n\nI don't really follow what you're saying about not being able to play the Hobbit boxes as a saga.  I guess I don't know what a saga is, because I haven't got that far yet?  I thought Under Hill and Over Hill and On the Doorstep were called saga expansions."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805713","commentId":3805713,"userName":"rees263","timestamp":1571033980,"content":"The Hobbit boxes are the first Saga boxes. However, unlike the LotR Sagas, there is no campaign mode.\n\nThe only \"campaign elements\" are the treasure cards, the rules for which are quoted above. Otherwise the only difference to regular quests is the mandatory Bilbo Baggins hero.\n\nBeing able to actually earn the treasures is a big part of the challenge in We Must Away and also another scenario in On the Doorstep."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805854","commentId":3805854,"userName":"Vince79","timestamp":1571061814,"content":"> 7 hours ago, rees263 said:\n> \n> The Hobbit boxes are the first Saga boxes. However, unlike the LotR Sagas, there is no campaign mode.\n\nOkay.  I guess I'll find out about \"campaign mode\" when I get to the Black Riders.  Assuming I ever get there lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3805887","commentId":3805887,"userName":"Amicus Draconis","timestamp":1571064323,"content":"> 13 hours ago, Vince79 said:\n> \n> Honestly, I don't mind sticking with the same heroes.  I'm just saying I don't really see the rationale for having to do so, because Thorin's party included more than four heroes.  \n> \n> I don't really follow what you're saying about not being able to play the Hobbit boxes as a saga.  I guess I don't know what a saga is, because I haven't got that far yet?  I thought Under Hill and Over Hill and On the Doorstep were called saga expansions.\n\nYes, you are right, I mixed up saga with campaign. The Hobbit boxes are saga expansions, as they are similar to deluxe expansions but without a cycle that follows it. The campaign is what you can start with Black Riders."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3806107","commentId":3806107,"userName":"Rob_Oz","timestamp":1571080106,"content":"The Saga boxes are LOTR:LCG products that directly parallel Tolkien's written work. The quests are from either the Hobbit or The Lord of the Rings Trilogy. Hero and ally player cards in these boxes are also from these works. Thus, the term Saga doesn't really refer to a game-play style, but rather that these products are from the stories Tolkien wrote.\n\nThe two Saga boxes for The Hobbit tell the story over six quests. You can play them in any order you wish, with any player cards you wish. The treasure cards are the only aspect of The Hobbit boxes that could be described as a campaign style of play. I.E. - a game element that carries over from one quest to the next. Players are not required to use those rules if they don't care for them.\n\nThe six Saga boxes for The Lord of the Rings (The Black Riders/The Road Darkens/The Treason of Saruman/The Land of Shadow/Flame of the West/Mount Doom) introduce Campaign mode, though you are NOT required to play these quests in that fashion. Campaign mode incentivizes the players to use the same heroes from quest to quest to create a sense of story continuity. Players are not required to use the same heroes from quest to quest in Campaign mode, but there are penalties for not doing so, should you choose to play that way. And again, there is no requirement to play Campaign mode if you don't want to. Many players enjoy it, however, and elect to play it.\n\nDeluxe cycles, on the other hand, use the Middle Earth setting for their quests but are not drawn from stories written by Tolkien. Player cards in Deluxe boxes are a mix of material created by Tolkien and FFG created material.\n\nHope this helps clarify what the term \"Saga\" means."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807156","commentId":3807156,"userName":"Valhalla Gaming","timestamp":1571221265,"content":"The Hobbit is played kind of like a precursor of the sagas, basically as long as you've obtained treasure using the same team of heroes you're allowed to use that treasure in your deck. Of course you could also play them just as standalone quests, though you still need to use Bilbo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807279","commentId":3807279,"userName":"Vince79","timestamp":1571238347,"content":"> 4 hours ago, programdude said:\n> \n> The Hobbit is played kind of like a precursor of the sagas, basically as long as you've obtained treasure using the same team of heroes you're allowed to use that treasure in your deck. Of course you could also play them just as standalone quests, though you still need to use Bilbo.\n\nI'm still winning about 50% of my \"We Must Away Ere Break of Day\" games, but I still haven't obtained the treasure yet.\n\nI can't believe it has only recently occurred to me that if Troll Camp pops up at some point, you should leave it in the staging area (so you can get the sacks off, and claim the troll key and the troll purse).  The enemies in this deck are pretty inconsequential until you get to the trolls (but the treachery cards are nasty).  I must be slow.  At first, I was focused on how to be the trolls and was waiting for troll camp to show up. \n\nHalf the time I lose this it's because my threat runs out though, so how you manage your time is a big factor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807284","commentId":3807284,"userName":"Valhalla Gaming","timestamp":1571239057,"content":"> 4 minutes ago, Vince79 said:\n> \n> I'm still winning about 50% of my \"We Must Away Ere Break of Day\" games, but I still haven't obtained the treasure yet.\n> \n> I can't believe it has only recently occurred to me that if Troll Camp pops up at some point, you should leave it in the staging area (so you can get the sacks off, and claim the troll key and the troll purse).  The enemies in this deck are pretty inconsequential until you get to the trolls (but the treachery cards are nasty).  I must be slow.  At first, I was focused on how to be the trolls and was waiting for troll camp to show up. \n> \n> Half the time I lose this it's because my threat runs out though, so how you manage your time is a big factor.\n\nI wasn't a big fan of how you got the treasure in the first box since it depends on waiting for a flip and its kind of odd you can slay the trolls but not get their key. Although I have some qualms with the lonely mountain quest I like how it plays out farrrr more in terms of amassing treasure. To be honest I think \"we must away ere break of day\" is a great quest in terms of playability and theme, but marred by the fact you will likely need to re try it just for the treasure. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807306","commentId":3807306,"userName":"Vince79","timestamp":1571241973,"content":"> 47 minutes ago, programdude said:\n> \n> To be honest I think \"we must away ere break of day\" is a great quest in terms of playability and theme, but marred by the fact you will likely need to re try it just for the treasure. \n\nYeah, I mean honestly I don't really care about the treasure, but I'm assuming you need it for future scenarios (or it's at least very useful)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807753","commentId":3807753,"userName":"Valhalla Gaming","timestamp":1571290203,"content":"> 13 hours ago, Vince79 said:\n> \n> Yeah, I mean honestly I don't really care about the treasure, but I'm assuming you need it for future scenarios (or it's at least very useful).\n\nI didn't get the treasure when I beat it on nightmare mode and honestly didn't feel motivated to go back and hope I got lucky. The treasure is decent no doubt but not essential and overshadowed by the treasure in the second box I believe. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3807863","commentId":3807863,"userName":"Vince79","timestamp":1571314899,"content":"> 6 hours ago, programdude said:\n> \n> I didn't get the treasure when I beat it on nightmare mode and honestly didn't feel motivated to go back and hope I got lucky. The treasure is decent no doubt but not essential and overshadowed by the treasure in the second box I believe. \n\nSeems like you should get the treasure just to stay true to the books, since in the story they get those blades there.  Still, it seems like a weakness of this scenario that you have to depend on one or two cards coming up in order to get the treasure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3808213","commentId":3808213,"userName":"Valhalla Gaming","timestamp":1571342005,"content":"> 7 hours ago, Vince79 said:\n> \n> Seems like you should get the treasure just to stay true to the books, since in the story they get those blades there.  Still, it seems like a weakness of this scenario that you have to depend on one or two cards coming up in order to get the treasure.\n\nI wish it was streamlined better, I did like that the nightmare Smaug encounter forces you to get every single treasure, though that ones pretty grueling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3808764","commentId":3808764,"userName":"Vince79","timestamp":1571414851,"content":"Finally got the treasure in \"We must away ere break of day\".  You've got to be careful setting this up, and pay attention to the order of things.  One time I clumsily killed the troll before travelling to the troll cave, so I lost the treasure.  I also used Bilbo to quest one time and ended up advancing to the next card, which left Bilbo exhausted and unable to remove his sack lol. \n\nThe last few games I've gone through my entire deck setting things up.  Probably overkill, but oh well.  On to the next.\n\nEdited October 19, 2019 by Vince79"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3809883","commentId":3809883,"userName":"Vince79","timestamp":1571592750,"content":"Won \"Over the Misty Mountains Grim\" on my third attempt, using the same deck I used for the first quest (from the Hobbit).  If I hadn't won on the third try, I was going to probably tweak the deck a bit.  This scenario might be even tougher than the last one, aside from the challenge of getting the treasure.  I had three stone trolls in the staging area at once at one point, but I still managed to prevail.\n\nThe key to this one is to quest strongly at first (until the encounter deck gets swapped out).  The first encounter deck is heavy on locations, and the enemies are few and fairly easy to deal with.  You can get into location lock or close to it if you're not careful.  Then it's goblin swarm time.\n\nErebor Battle Master has really been an MVP of my dwarf decks, it can lay out some serious hurt and is one of my favorite cards now.  And yeah, I'm using the post-errata version."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3815125","commentId":3815125,"userName":"Vince79","timestamp":1572058681,"content":"So....  got to the third scenario, Dungeons Deep and Caverns Dim.  Yikes.  I've read a lot of complaints about this scenario and I can see why.  I've lost my first three attempts, so I'm tweaking my deck a bit.  Started by adding Will of the West and Imlardris Stargazer, we'll see if that helps any.\n\nThe riddle bit is rather annoying, not just because Bilbo can get killed (and you can't buff him to protect him) before you complete the quest card, but because you also have to discard a lot of cards out of your deck that you could use.  Last game a few rounds in and I had discarded all my Gandalfs.\n\nI've read some people suggest a mono deck, but then that defeats the purpose of keeping the same heroes through all three quests.  Unless you keep the heroes and just change the deck.  Anyway, I haven't come to that point yet, but I might get there lol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3815129","commentId":3815129,"userName":"rees263","timestamp":1572059776,"content":"Unfortunately Imladris Stargazer won't help with the Riddles since you have to shuffle your deck each time. What you can do is rebuild your deck to contain mostly similar cards (i.e. mostly 2 cost allies). Your ability to do this will be dicated somewhat by your card pool and your hero choices. If you are trisphere that does make things more difficult but not impossible. You could even record that contents of your deck so you can make educated guesses based on what's most likely to be revealed.\n\nThe easier you make the riddles, the easier the rest of the quest will be since you won't have to add as many cards to the staging area."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3815255","commentId":3815255,"userName":"Wandalf the Gizzard","timestamp":1572097062,"content":"I like to pack threat reduction and use the Magic Ring liberally. Those extra resources on Bilbo are life-savers. Songs are also helpful once Bilbo has a considerable stash."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3815861","commentId":3815861,"userName":"Vince79","timestamp":1572200919,"content":"Finally got a win, using tips from both of the above posts.  Tweaked my deck, never really got near to an actual mono deck, but I did manage to increase my odds with the riddles, and wasn't so afraid to use the Magic Ring.  Never even had to use threat reduction.  Played three games, won one.  In another game, I got through the riddle part, but was killed by a large pack of wargs in the 1B section.  So I don't know, I could probably tweak it more and do better, but I'll probably leave it as is.\n\nOne card that I added to make the riddles easier was Master of the Forge, which allows you to look at your top five cards and add an attachment to your hand.  I found this surprisingly useful, especially since I had never used that card before.  \n\nI guess Heirs of Numenor (which I hear is difficult) was released before the next Hobbit saga, so I guess i'll tackle that next.  Actually first is The Battle of Lake-Town, a Print on Demand scenario.  I'll probably go through \"Caverns Dim\" a few more times though.\n\nQUESTION:  Do you take the Treasure cards from \"Over Hill\" into \"On the Doorstep\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3816290","commentId":3816290,"userName":"Wandalf the Gizzard","timestamp":1572272107,"content":"> 19 hours ago, Vince79 said:\n> \n>  \n> \n> QUESTION:  Do you take the Treasure cards from \"Over Hill\" into \"On the Doorstep\"?\n\nYou sure can! As long as you use the same heroes in each quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3816718","commentId":3816718,"userName":"Vince79","timestamp":1572295190,"content":"> 6 hours ago, Wandalf the Gizzard said:\n> \n> You sure can! As long as you use the same heroes in each quest.\n\nSeems like an odd limitation considering On the Doorstep comes with some hero cards of its own.  \n\nAre there any rules or guidelines on using Saga cards in the \"regular\" Deluxe expansions or adventure pack scenarios?  I'm assuming you can't use the treasure cards, and maybe not Bilbo?   But what about the other cards, are they all fair game?\n\nFunny how they encourage you to use the same group of heroes when one of my biggest faults is probably sticking with the same cards unless they aren't working.  I should probably be experimenting more, I'm sure there are a lot of different approaches you could take to deck building."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301078-the-hobbit/?do=findComment&comment=3816821","commentId":3816821,"userName":"Wandalf the Gizzard","timestamp":1572301354,"content":"No treasure cards, and no Bilbo (so by extension, no baggins cards). Other than that, all the player cards act the same way in regular quests."}]}