{"url":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/","title":"Looking for advice on which mode to play the sagas on","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3806805","commentId":3806805,"userName":"Valhalla Gaming","timestamp":1571169176,"content":"Relatively new player/fanatic here, have bought up every product available, and now that I'm around three cycles deep on nightmare mode/having finished the hobbit in NM I figured it was about time to contemplate diving into the Saga expansions. \n\nIt will be me and a friend or two and my question is essentially if:\n\nA. I should play through the campaign with regular rules but on normal mode.\n\nB. I should play through the campaign with regular rules but on nightmare mode.\n\nC. I should forego the campaign and just play through it all on nightmare but as sequential, standalone quests.\n\nD. Something else.\n\nI ask this because while the difficulty is one of the main things I love about the game, and I also love the idea of there being a potential for failure in your campaign, I'm wondering that if due to hero death/the threat raising, that nightmare mode is just too difficult to reasonably clear in any fun manner. The hobbit boxes were quite brutal and required extremely specific deck building which seems like it would be frustrating in a campaign style play through where your decks have to be a little looser. Granted I know the saga boxes wont have anything quite as extreme as riddles. Feedback appreciated, as well as any house rules you use."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3806889","commentId":3806889,"userName":"Zura","timestamp":1571174772,"content":"go normal, they left sagas with half the nightmare boxes missing. Campaign mode ofc"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3806920","commentId":3806920,"userName":"Valhalla Gaming","timestamp":1571177083,"content":"> 37 minutes ago, Zura said:\n> \n> go normal, they left sagas with half the nightmare boxes missing. Campaign mode ofc\n\nYeah I know its unfinished but you could still play nightmare then switch over. Do you think the normal versions of the scenarios are gonna be a snore for people who are used to nightmare decks though?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3807205","commentId":3807205,"userName":"Wandalf the Gizzard","timestamp":1571228761,"content":"If you’ve already played a lot of nightmare, go for it! In campaign mode, of course. There are several saga quests that are as hard as some nightmare quests, but their nightmare versions don’t increase the difficulty as much as easy quests’ nightmare versions do. Does that make any sense?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3807226","commentId":3807226,"userName":"Valhalla Gaming","timestamp":1571231952,"content":"If I understand correctly you're saying at baseline the saga quests are hard. but that nightmare does not boost up the sagas difficulty as much as nightmare mode does for standard scenarios?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301161-looking-for-advice-on-which-mode-to-play-the-sagas-on/?do=findComment&comment=3807469","commentId":3807469,"userName":"Wandalf the Gizzard","timestamp":1571253444,"content":"> 5 hours ago, programdude said:\n> \n> If I understand correctly you're saying at baseline the saga quests are hard. but that nightmare does not boost up the sagas difficulty as much as nightmare mode does for standard scenarios?\n\nSort of. Mostly that nightmare does not boost up the hard saga quest difficulty as much as it boosts the easy saga quests. So it makes all the saga quests closer together in terms of difficulty. ;) [//content.invisioncic.com/Mfantflight/emoticons/default_wink.png]"}]}