{"url":"https://community.fantasyflightgames.com/topic/301173-new-frodo-and-elevensies/","title":"New Frodo and Elevensies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/301173-new-frodo-and-elevensies/?do=findComment&comment=3807053","commentId":3807053,"userName":"player3351457","timestamp":1571193535,"content":"So part of me believes that when the creators make new heroes, they automatically know all the cards that might have some play with the newfound abilities. Another part of me thinks that every combo that seems like it ought to work but doesn't sit 100% okay with my gut tends to fail.\n\nI digress. This isn't a big one -- if you commit leadership frodo to the quest, trigger his ability, ready a character, then, before resolving questing, use elevensies, do you get both threat reductions if you quest successfully? Could you also use hobbit pony to re-commit him and trigger his ability again, for a possible 3 threat reduction (for a slightly expensive 2 multi sphere cost?)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301173-new-frodo-and-elevensies/?do=findComment&comment=3807162","commentId":3807162,"userName":"Alonewolf87","timestamp":1571222279,"content":"> 11 hours ago, player3351457 said:\n> \n> if you commit leadership frodo to the quest, trigger his ability, ready a character, then, before resolving questing, use elevensies, do you get both threat reductions if you quest successfully?\n\nI don't see why not, there is no clause stating that Frodo must remain commited to the quest to get its threat reduction. Even if an encounter card removed Frodo from the quest you would still get its threat reduction as long as you quested successfully.\n\n> 11 hours ago, player3351457 said:\n> \n> Could you also use hobbit pony to re-commit him and trigger his ability again, for a possible 3 threat reduction (for a slightly expensive 2 multi sphere cost?)\n\nThis is more debatable I guess. Does triggering Frodo's response a second time set up a second delayed effect or since there is already one in place is simply overriden? Personally I would say yes, you get both threat reductions, since all the timing conditions are respected, and you are still talking about a three card combo costing you three resources so it does not seems unbalanced.\n\nEdited October 16, 2019 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301173-new-frodo-and-elevensies/?do=findComment&comment=3807209","commentId":3807209,"userName":"Wandalf the Gizzard","timestamp":1571229289,"content":"I think the answer is yes to both."}]}