{"url":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/","title":"Reviewing every quest that I&#039;ve played","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3814523","commentId":3814523,"userName":"Valhalla Gaming","timestamp":1571992672,"content":"I plan on updating this as I go through the cycles since A. I personally enjoy reading other peoples thoughts on quest as its always interesting seeing what people loved, hated, struggled with, or crushed. There are some quests that are incredibly divisive and I've heard totally opposite opinions on. B. It could be useful to new players wanting to pick up some of the best quests the game has to offer, and C. I wanted to document my fresh thoughts on quests and see if they evolve over the years.\n\nI'll note what difficulty I played these on as I go, but I generally play on nightmare, either solo or with a friend, though increasingly I've been doing three player. While I am technically a new player relatively speaking(only one new product since I started playing), my friend group and I have gone hard with the content- Other than the first cycle of content we had every player card, though we do limit ourselves to 3 copies of a card amongst all the decks at the table. \n\nTo give an idea of what my general tastes are, my ideal quest is one that is quite challenging but can be beaten by swapping a handful of cards and maybe a hero, as opposed to a total deck overhaul since especially when playing with friends thats a major speed bump in an evening of playing. Creative scenarios that have me grinning from how they take the games mechanics and take it in a creative direction are always nice to see, since I feel like they are what's really elevated this game and separates it from a lot of others. Quests with setup time that don't give you an adequately unique/enjoyable experience aren't great, and when there is just too many triggers and things to keep track of the game can go from deep to a headache, especially with new/a lot of players.\n\n------------------------------------------\n\nMirkwood Cycle- I'm going to phone things in here and give a general summary since this is the most distant content in my mind, though I'll revise this section once I play through it again. In general the Mirkwood cycle is about as vanilla and (mostly) easy as the game gets, though thats not a bad thing per se, as it is pretty ideal for new players to learn and then later appreciate the more intricate mechanics of later sets. The nightmare packs here were an awesome addition, since they essentially elevate encounters that would have you nodding off otherwise into fairly legitimate quests. I cant say I plan on revisiting this block of content often though, aside from perhaps when I'm introducing new players. As far as the stinkers of this block, the mechanics of Escape from Dol Guldur and Journey to Rhosgobel aren't my favorite. Although I do like the occasional quest that interrupts powerful but fragile decks by messing with their heroes, the manner in which escape does it is definitely one of my less favorite implementations(the Harad cycle has a much more interesting take on it). As for Journey, its one of the quests in the first block that I find frustrates and disheartens new players, and considering the main purpose of this cycle is showing new players the ropes, I rank it pretty lowly. \n\n------------------------------------------\n\nDwarrowdelf Cycle- This cycle is a huge step up from Mirkwood in my eyes, and I feel like it is where the genius of the game starts to blossom. One thing thats not gameplay related that I've found weird is how this cycle starts in Moria in what feels like a recreation of the book/movies, leaves Moria, then returns to it and comes full circle by recreating the entrance to Moria then the fight with the Balrog. However that doesn't change that these quests are overall almost all memorable and fun.\n\nKhazadum- I played this box very early on into owning the game and I think its normal mode quests are excellent for new players. The seventh level is a great combat oriented quest to get a feel for combat/make players who already enjoy combat feel powerful. Flight from Moria is a cool quest as it is likely the first time you'll encounter a quest with a non linear progression which is quite a delight to see for the first time- Naturally it is a bit luck based but due to the relatively low difficulty it makes for a fun but not frustrating experience. However, while I found both the seventh level and into the pit well made nightmare decks, I found the nightmare variation of Flight from Moria to be an unideal kind of difficult. There are surge cards which affect the balrogs stats permanently, and revealing those and potentially one of the quests that adds itself to the victory display(the victory points from it adding to the balrogs stats further), can have this be one of those quests you wipe and reset rapidly over and over. I also thing that even if you play on nightmare you should ignore the nightmare mode effect of shuffling the deck whenever a quest is bypassed. Yes its checks the box of making the encounter harder, but honestly feels like its against the fun/theme of exploring different routes in an attempt to escape, and it only amplifies the extent that luck determines the outcome. \n\nOne thing I'll mention before diving into the quests proper is the Sudden Pitfall treachery card. While it is a preposterous card and I would never want to see it in later cycles, because of the low difficulty of most of these encounters in normal mode I actually didnt find it to be much of a problem once everyone at the table respected its presence. If you are questing with allies it can actually be fairly weak. Its shadow effect is quite terrifying and unfair as well, but cautious blocks as well as shadow effect cancellations can save the day. In a way I love the design, since there is just one copy yet its presence can warp the whole game.\n\nRedhorn Gate- Love this quest. Put simply I played it once blind on nightmare mode blind with a friend, and we both truly felt the theme of being worn down and battered by a snowstorm, especially when we saw exactly what the last quest card did(and I won't spoil incase you want to tackle it the same way), which alone nearly killed us considering we had not catered our deck to the encounter at all. I appreciate how it tries and kill you in a unique way, though I could see my opinion being dampened if I had been rocking a mono tactics deck. I also have to assume this quest is super easy on normal mode due to one shotting it on nightmare.\n\nRoad to Rivindell- This is definitely the weakest of the cycle for me aside from the nightmare version of Flight from Moria. Yes I am going to start off with the obligatory reference to sleepless sentry. Unlike sudden pitfall there are two copies of it in the deck, and its potential for damage is generally a good bit higher, considering unless you have effects to ready a character, you are going to be likely taking some undefended attacks and lose a hero or two. Speaking of losing heroes, the shadow effect is a total blowout, and can on its own wipe a player out completely in a manner truly unprecedented for shadow effects. This card often overshadows the frankly equally silly orc ambush treachery card, which I honestly think is an even worse designed card since it has the incredibly weak floor of having a single orc engaging a player, and the incredibly high ceiling of every single orc enemy in the discard pile which is very likely to be close to TEN if the game has progressed a bit- And instead of having the grace to be a card that is just either a big hit or miss, its got surge so that its never a bad hit for Sauron. \n\nBut now that I've gotten that out of the way this quests true sin is that its pretty easy/boring aside from that. It is the one quest I barely remember despite playing it on nightmare mode aside from my friend and I chuckling after losing horribly to one of those treacheries, adding some cancellation effects to our decks, then easily crushing the encounter. Simply put you either will have a terrible time losing to overpowered cards- get lucky- or make changes to your deck, crush the quest, then forget it. Honestly it is a shame that they didn't adopt their policy of removing the poorly designed cards from the nightmare deck like they do for heirs of Numenor.\n\nWatcher in the Water- Like the rest of this block of content I've only played this on two player nightmare mode and it might just be the best the cycle has to offer, trumping even the Balrog. The tentacles being individual enemies was a simple and kind of obvious, but extremely effective way of creating a boss fight that wasn't just one dude in the staging area. That being coupled with the way you guess the password to the entrance had me grinning after a few moments of total disbelief while reading the door location which I will definitely leave unspoiled. This is one of the best balances between theme and difficulty.\n\nThe Long Dark- This is undoubtedly the second least memorable quest in the cycle, but in a bit of a refreshing way and while being infinitely more functional than RTR. The test mechanic is- I believe- the second time a test mechanic was implemented in the game, and it makes for a more vanilla and relaxed experience than the quest before it and is certainly a nice victory lap before the quest that comes after it...\n\nFoundations of Stone- Maybe I wasn't as adept of a deck builder when I was tackling this quest, but man was this quest brutal and simultaneously unique and thematic. The art, especially on some of the nightmare cards, really has you feeling like you have stumbled into some places that would best be forgotten, and the ability of these monsters to spiral out of control while potentially ruining your deck gives the encounter a chaotic and almost lovecraftian feel to everything. It is especially cool that the encounter goes from pretty typical to abruptly dividing your party at the same time it is introducing these terrors to you. Truth be told I technically haven't beaten this encounter since our one win was later invalidated by realizing my friend had been cheating a bit, but I am looking forward to a rematch, ideally with even more players. This is right up there with Watcher for the best this block has to offer.\n\nShadow and Flame- After my pretty unpleasant last nightmare mode encounter with the Balrog in Flight from Moria, I was very happy to have the cycle end with a far more satisfactory showdown. While I like the Watcher boss fight better, and there are certainly quests in general I enjoy more in terms of combat based encounters, I think they did well here, especially with the nightmare additions. The Balrogs personal shadow deck not only makes him a lot more terrifying, but comes packed with amazing art, along with the servant of flames in the main deck. The counter spell card is a very cool but fair card, and one of the examples of a card really capturing the theme, as well as showing a side of the balrogs power that isn't really explored in most media. Strategy spoilers ahead: This boss roughed us up a few times, with one particular nasty element being the shadow card that could essentially strip your tanks attachments off, turning my Beregond into ash more than once. However I discovered that feint and the wizard's voice neutered the Balrog hard. Its a little awkward when cards are quite that extremely powerful since it nearly forces their sure, but on the other hand its nice giving cards their time to shine, and having a boss they are useful against since so many are (rightfully) immune to card effects.\n\n----------------------------------------------\n\nHeirs of Numenor- This box is famous for its difficulty, and it is easy to see why. I played this on normal mode when I first started playing and beat peril in pelagir easily with a friend, then was humbled with countless attempts on Into Ithilien before finally scraping out a win and then attempting to beat siege solo, which resulted in countless scoops to a certain terribly designed card- Power of Mordor. \n\nI have mentioned the poor design of sleepless sentry and orc ambush, but they pale in comparison to this card. The card turns every quest its in on its head if it resolves(and has also resulted in a lot of confusion with players in The Morgul Vale quest) as it will have several new cards flipping in a lot of cases, getting off many triggers, it is time consuming to resolve, has a sizable doomed 3 tacked onto it needlessly, and worst of all it defeats the theme of, in particular, the Siege of Cair Andros. The whole idea of the quest is trying to secure locations before they are lost, shoring up defenses and eliminating some quest phases. However Power of Mordor can often on turn 1 completely invalidate that whole premise by getting rid of those locations meaning you will need to do every quest card, all while dooming you 3 and converting those potentially useful locations into detrimental cards. \n\nAnd you know what? The creators agree with that sentiment, removing the card altogether from the nightmare encounters. I respect them immensely for using the nightmare decks to create more consistently difficult quests, while removing cards that were a design mistake. This will be the one time I suggest removing a card from an encounter deck, but if you are playing on normal mode you really ought to take it out too. \n\nMini rant aside, I played through this box on nightmare and had a fairly similar play through as my first time, beating Peril easily with a friend, then struggling with Into Ithilien, albeit less times than normal mode probably mostly due to experience/a bigger card pool, and then we finished with quite a few attempts on Siege which while incredibly difficult was a joy to play especially when compared to the base version. While I sympathize with the people who played this when it first came out, today it is a great set of quests, especially on nightmare mode. It is also interesting that although everyone agrees this box is very hard, that I have heard every combination of opinion in terms of which quests are challenging, even seeing some people struggling on peril but breezing through siege. \n\nSteward's Fear- Yet another quest that falls into the love category. This seems to be a clear template for Murder at the Prancing Pony, and while I think that quest is a masterpiece, this one is still an instant classic to me. As usual I played on nightmare mode with a friend and we got roughed up pretty bad by some of the underworld deck cards flipping, however after changing to a more combat oriented deck the fighting in this encounter is really quite manageable. I am a big proponent of quests with replay value, and considering there are three different bosses and a slew of different plots, this is among the most replayable out there. This is a prime example of a quest that requires set up but is well worth the slightly extra bit of work(it also doesn't hurt its not difficult enough to require many resets). The flavor of the betrayal treachery card in the deck can be rough, but is a major flavor win, and definitely fair if you play around it.\n\nDespite this being one of the most memorable quests, as well as one of my highest recommendations there are a few problems with it I'd be remiss in not pointing out. First of all, and perhaps most notably, the villains tend to be a total pushover compared to what you have to go through to get to them. This can often lead to a bit of a quick finish and anticlimax, which the nightmare tries to address by adding in doom/surge cards that equip to the boss if he's out. While an admirable attempt to address the issue, I actually have never seen a single one of these actually equip to a boss, and instead just get pettily doomed by them throughout the game. Secondly I find it simultaneously very cool that each villain has a synergistic plot that works with them, however in practice it means that some games you could randomly have a huge spike in difficulty, while other times neither the plot of villain will amount to much. Lastly though it didn't bother me much, for some reason the card that cancels the questing phase really aggravated my friend. However its a testament that despite having what seem like big flaws, I still love this quest so much.\n\nDruadan Forest- I get the distinct impression this is one of those quests that plays veryyy differently in normal mode. I enjoyed how humbling the resource deprivation was. Definitely easy to counteract by discounting cards/things that get cards out for free or close to it, but with random decks it was a brutal challenge and when we got to the final stage it really did feel like we had to desperately entreat the Wose’s for our lives. On normal mode I fear the mechanics would be too easy to force your way past, but I’ll have to try it sometime to see. Particularly in a game with a lot of players I could see the Druadan Drummer being a big problem. By the time I beat this I had a whole new appreciation for the resource phase. \n\nAssault on Osgiliath- One of my friends who had casually been playing hunkered down and really learned the game with me playing this on nightmare. Our decks went from casual Rohan synergy decks to fine tuned cut throat decks over the course of a 24 hour straight session of re tooling the decks and throwing them against the encounter I became very well acquainted with this nightmare mode, and from what I’ve gleaned its considered one of the most elevated encounters by nightmare mode, with the normal version being possible to almost accidentally win if you get lucky flips.\n\nThere is a lot to keep track of at first glance, from the different conditions under which an Osgiliath location will leave your control, to the triggers for each of the unique locations getting completed, to the fact you can spill over progress to a non unique location under certain conditions, but ultimately the name of the game is clearing out what can be an intense initial assault and then A. having an answer to the nightmare only condition attachment that reveals an extra encounter card when the enemies in the staging area are less than the number of locations you have B. Maintaining threat since that is really the only way you can lose once you stabilize, and the deck is geared to wear down your threat well, potentially even ending your quest phase while doing so. The encounter is rough but very fair - While there is archery damage and and a couple of shadow cards that can slightly buff attack or ping some damage, there are no cards that will randomly hit you with damage making for a very focused quest. The designers knocked it out of the park with this one, taking a fun but underdeveloped idea and turning it into a compelling quest.\n\nBlood of Gondor- Wow was this a difficulty intensive quest. The nightmare deck starting you off with a hidden card is surprisingly cruel, and the black Numenorian brutalizes your threat if you aren't aggressively turning cards over. It is surprising that even with two potent allies for the first phase, how overwhelmed you will get.\n\nThis was a rare occasion I had to completely build a new deck for this quest, utilizing the crossroads to quest using siege, thicket of spears while only questing with one guy for 4 so that I could precisely crack back and kill the Numenorian. I then finished the first quest, fending off the attacks as ideally as possible, travelled to the crossroads and made an almost all or nothing questing with siege, with the exact 17 needed to finish the crossroads and quest. However I came up three short, lost a hero and my white tower watchman, then made another quest attempt, this time finishing it 5 over, but with certain death staring me down if I hadn’t. My heroes were Beregond, Mablung, and grimbeon, with Mablung giving me just enough fuel to maintain chump blockers, defenders of Ramas, and deploy thicket of spears. I wouldn’t want to see too many quests like this one, with it requiring extremely specific answers and a bit of luck, but as a deck building exercise it was fun.\n\nMorgul Vale- Cool idea for a quest and they managed to pull it off without completely invalidating questing since the lands are nasty. My friend and I managed to get to the final stage with threat totally under control and three damage on the Nazgul our first attempt, but the to the tower card definitely wrecks any kind of drawn out strategy like that, as there are cards that flat out add tokens to it, and you will be just about at 10 by one go through the deck. Feint and tactics tricks definitely do feel near essential, though I ultimately beat it with mono spirit, using sneak attacks and Gandalf to speed up the clock on the Nazgul since he only takes one damage and I was not trying to wait 5 turns. He did get one of the full heal shadow cards when I had three damage on him which leads to my biggest critique- That at least on nightmare mode I found this encounter to annoy me due to how vexing healing is or a bodyguard being revealed, since the former can spell doom or draw things out for several more turns, and the later usually just felt like a turn wasted. Overall it was a suitable conclusion to this block of content.\n\n------------------------------------------------\n\nThe Voice of Isengard- So surprise, but other than giving to catch an orc one attempt on nightmare, I have only played this in normal but will update this with my thoughts once I've played through on nightmare. Fords of Isen was an unexpectedly difficult quest for a normal mode quest, albeit a blind attempt. I could see the dunedlings being polarizing, but I enjoy when the game takes shots at cards that are generally staples and makes you have to reconsider their inclusion as it necessitates trying different cards. To catch an orc is a quest I've heard very different opinions of and I can see why. Its a really neat idea, but it takes a lot of setup time to reset if you're playing with sleeves, and was frankly easy to the point of being boring on normal mode, whereas in nightmare mode I turn one unveiled a vigilant orc who tore through me. I think I am steadily entering the camp of people who do not like quests that require biding your time waiting for a certain card to flip, however I'm also looking forward to giving it a proper attempt on nightmare. \n\nInto Fangorn was a very fun and unique quest. I am a big fan of how the Huron's work, although I could see myself being less enthused if I was running a trap deck or anything that required attaching anything to enemies. This game has so much traditional combat its really nice seeing that mixed up here.\n\nThe Dunland Trap- This is one of the quest names I've seen pop up since I first got into this game. A recurring theme with this cycle is that I was at a bare minimum familiar with all of the quest names, and had heard extremely positive and extremely negative things about each one, with this   and the Nin-In-Eilph being the most polarizing. I can certainly see why! But first of all- If you are a fan of challenging encounters and are down to build a deck just for an encounter, just play this before reading my thoughts on it in the next paragraph, as it is definitely one that deserves a blind play, especially with a friend.\n\nIn some ways this is a simple quest in the sense that you are getting through one quest card, being stripped of cards, and then just need to survive for what can be a very short period of time. I can sympathize with people who don't like the quest as even on normal mode it feels a bit like a nightmare deck and thus requires specific deck building, and due to the item, mount, swarm, and ally hate it renders a lot of decks as not viable. Although I generally prefer quests that can be beaten with a little deck tweaking, I found myself enjoying this quest despite finding it a bit overwhelming on the first few attempts. My friend and I were crushed so soundly our first attempt that we were half convinced the final stage was going to give us some benefit after how badly the stage two hinders you.\n\nOne of the reasons I ultimately enjoyed this quest was because it confirmed that Dunedling's would be a recurring theme and that its stern difficulty prompted me to make a deck that partially countered them- A deck with Vilya to play cards without them being in your hand so that you aren't out of luck when your hand gets discarded, and can benefit from the Plains of Endewaith not having you draw cards without being unable to develop your board state. I also used Arwen to pitch cards from my hand to keep it small, and tactics Eowyn to handle the aggressive beginning. This deck was able to get me through the whole block with ease with one exception. Ultimately I beat this both solo and with my friend, with the solo win being more convincing. \n\nIf I had to point out a few questionable design elements that people might not like, the most evident is that it has the potential for massive variability that exceed the norm. For example hills of Dunland has the potential from any draw trigger(including the one you trigger to try and get rid of it) to net each player a new enemy, each of which could completely ruin a turns calculations for combat, but just as easily each player could flip nothing. Heck, even if players had been trying to keep their hands low and had one card in hand, they could flip and engage Dunland Chieftans off of hills which then flipped a single card that is another Dunedling. But like I said, I actually didn't mind these elements, as the encounter is a quick reset. My one little quibble with a card is \"In need of rest\", which if it attaches to a hero who has less life than there are time counters on the final quest- You simply lose unless you are packing healing or condition removal. My problem with it really isn't its power level, so much as the fact that I feel like this is a quest you are meant to go down swinging against, but this just makes you nod and pick up your cards if you know you don't have an answer. To be clear I don't mind it slowly killing the hero in and of itself, so much as the fact their death triggers a game loss unlike in most scenarios. If I had to make an argument for it, it would be that if you do have answers its fairly weak, and that in certain situations it can be nearly a dead card(such as if you are imminently facing the game ending attack).\n\nAnyways I've gone on long enough. This was definitely a high point in a lot of ways, and I am looking forward to tackling nightmare mode sometime that I'm ready for what I suspect will be a serious challenge. \n\nThe Three Trials- The one unfortunate thing about The Dunland Trap is that it takes you by surprise, amps you up, only for you to promptly walk over the following two quests. While I am sure in progression mode this would have been a different story, I beat this one easily both in true solo and with my friend. Now in a way that was welcome, since I could use the breather after Trap, but its a bit of a shame since I love the lore/concept for this encounter, so to effortlessly best the guardians was a bit anticlimactic. I think the main problem in terms of difficulty is that some cards just don't do enough when you've got the situation under control, such as the card \"turned around\" which I usually flipped, took off an irrelevant and then proceeded to finish that phase of the quest. Because of just how cool but easy this quest is I am looking forward to its nightmare mode immensely.\n\nTrouble In Tharbad- Yet another cool, yet easy scenario. I essentially have to refer to the above for now, basically my friend and I lost once to a misplay, but then just quested hard to get our threat to zero, repeated the process, then won. Everything in it felt fine with the exception of Nalir, the detrimental dwarf ally who succeeds only at making the players dislike him(which is perhaps the intention). It is a good encounter for casual play or a new player, but for me I am mostly looking forward to nightmare.\n\nNin-In-Eilph- Anddddd we're back in the thick of it. This quest manages to be nightmare level difficulty much like The Dunland Trap. We attempted it several times in two player mode to no avail, with me only finishing it solo, but barely. Much like Dunland Trap I have heard people praise this one and curse it with equal passion. Also much like The Dunland Trap, I can see how someone could feel either way about it. You certainly need to be willing to take on a challenge, which will include some effects that will hinder your usual flow of gameplay, such as the 2A's stopping resource acceleration, card draw, playing more than one card, or having to discard cards. Even with my Vilya deck and not caring about most of the hindering effects of the 2A's the quest managed to be a challenge.\n\nAside from the hindering quest effects and the boss that pops up for the last two parts, the encounter really only boils down to two cards. 1. The surprisingly problematic Giant Swamp Adder which is just tanky enough to not be easily killed while accomplishing anything else, and can easily tear through your team with his countless attacks, especially if multiple are out. 2. The shifting marshland treachery/shadow card which will either be removing a time counter and having those Adders attack you, or being a shadow card and having an adder attack you again. \n\nThe boss can be a bit of a nuisance and make your defeats more crushing, but in my experience you either had the game under control, and the adder population in check, or you were already losing. I am curious to read about other peoples experience with this particular quest, I'd imagine the people who dislike it felt like it was overly oppressive, which I could certainly imagine it would feel like with certain decks. For me, if I had taken too many more attempts I definitely would have felt burnt out since unlike with The Dunland Trap, I was losing to a single card with a bit of support from a single treachery. Although I slightly dread nightmare mode I am hoping it makes the angles that challenge is coming at you more varied. \n\nAs for the positives - while having random quest stages you advance to adds some RNG elements, I personally find it a welcome trade off considering how uncommon quests incorporate them. A boss that harasses you throughout a quest  before you ultimately deal with it is enjoyable, though a minor quibble is that it was definitely annoying to be playing it blind, only for the boss to come back for the final phase. The theme is spot on in terms of a swamp wearing on you as you trudge through it. Much like Dunland Trap I recommend this, but only to those seeking a challenge. \n\nCelebbrimor's Secret- This was a very similar experience for me as Trouble in Tharbad, essentially questing hard and then killing Bellach. In this case I think even just adding more players would have ramped up the challenge, since as it stands I honestly don't even really know what the encounter was supposed to feel like. From what I can tell it is a pretty awesome theme for a quest and I look forward to seeing it in nightmare/multiplayer.\n\nUpdate: Upon a replay with a friend the mechanics definitely manifested a lot more. The orcs progress objective still only ever got one card under it, but perhaps thats how its intended. We did lose our first attempt but handled it fairly easily on our second. My opinion of it has certainly improved, with us certainly needing to plan carefully, but I think it might still be one where I need to play it on nightmare to fully appreciate.\n\nThe Antlered Crown- With the quests yo-yoing between super hard and extremely tame I was wondering which extreme this one would fall under. However at least for me, despite one shotting it, it still didn't feel like a pushover. I still get the feeling I didn't get the full range of the mechanics, namely because I believe there was only one trigger of a locations time effect, but the enemies still kept me on my toes. Much like the previous quest I am definitely looking forward to seeing how this plays out in multiplayer or nightmare.\n\nUpdate: Much like the previous quest, when playing in two player mode the quest shaped up much more interestingly, with time counters on buildings actually triggering and generally more action with significantly more challenge. I cant be sure if it was because my house was slightly noisier than usual or if it was the quest itself but I did start wanting to just be done with the quest at the very end, when victory was clear but there were still a lot of triggers and tokens to manage. I still like the quest overall but it is not as on point as a lot of the other quests depicting big battles.\n\n-----------------------------------------------\n\nThe Lost Realm- Played through the box on normal. I found Intruders in Chetwood to be ok, basically a middle of the road fairly forgettable quest but inoffensive, believe we beat it in one shot playing two players. New players who like combat oriented seventh level-esque quests will enjoy it. The Weather Hills was a bit of a weird one. I appreciated it being fairly difficult as it took several attempts for us to beat it, and it was a bit more memorable than intruders. However it was a little fiddly with a lot of triggers to keep track of and it was extremely annoying to reset the quest if you got two stage two and had to shuffle the deck together, not one I am particularly looking forward to revisiting. \n\nHowever the Deadman's Dike was worth the price of admission alone and made me go from being pretty \"meh\" on this cycle to being very excited for whats to come. There is a lot I enjoyed here- First of all the way in which the quest makes milling your deck a negative is very clever, from it triggering threat increases on lands, to making cards you cast cost more for copies in your discard, which punishes running 3 copies of cards and hurts usual staples like Dareon's Runes which I always appreciate. The fact that it is a combat heavy quest that managed to feel very unique and involve thinking beyond the usual number crunching was brilliant. I also appreciated the design of some of the cards being genuinely quite weak early game and very steadily ratcheting up, eventually becoming cards you had to counter or that you'd wipe to. While it didn't happen to us, the one criticism I'd have is that the boss could theoretically pull a Smaug and attack a ton of times which is a little swingy and I could have seen souring my experience. But as it was we had three or four good attempts and managed to squeeze out a very satisfying win. This quest has set the bar high for me this cycle.\n\nThe Wastes of Eriador- I really liked the idea of day/night mechanics as soon as I saw a version of them in the Stone of Erech(granted in that case it was evening turning to night) so I was thrilled to see it here, with relaxing day turns being ones you could thrive on, and nights being dangerous, essentially struggling to survive. However at least on my play through it didn't quite pan out that way. Yes days were easy, but me and my friend actually got so far ahead that nights weren't dangerous so much as they were skipped turns. But then on the turn we advanced to the final stage we had flipped exclusively enemies, meaning the middle was absolutely flooded, making the quest go from a snooze fest to an absolutely brutal combat exchange in which my friend had to be sacrificed with me just barely able to finish the quest. This made for a very uneven encounter, with most of it feeling boring, and then it feeling nearly unfair. If we had lost on our attempt, I think we both would have groaned and not wanted to try again, expecting the first turns to be a joke that wasted time until the real challenge. However I do think if more enemies flipped early and more lands flipped for the last phase it would have been a nice balance. As of now though, it was a pretty meh experience in terms of gameplay, but I did like how it cleverly conveyed an epic multi day journey, making progress during the day and fighting for life at night. \n\nEscape From Mount Gram- I get wary anytime a hero is being removed as part of a quest, let alone two since that can make for a very un-fun experience but this hit the nail on the head far more than escape from Dol Guldur. I havent fully thought through what safeguards the quest has against getting locked out early, but it seems like they did a good enough job that you should be able to get some kind of team together, at least that was me and my friends experience. As I was running a Vilya deck, my actual deck was hilariously just a handful of events, whereas my friend had a huge deck and a tiny captured pile. The quest played out thematically, in our case with me busting out a good number of strong allies, and reinforcing my friend, and then the orc guards forming a proper counterattack. I feel like the difficulty was just right for a scenario with out there mechanics, as well as one with significant setup, as it would be a pain to reset over and over. Speaking of setup its always unfortunate when you need to hunt for sleeves that match your deck just to be able to properly play(all heroes in my collection are one sleeve color with the rest of our decks being unique to the player), but I am still glad they do it occasionally.\n\nI think this quest is definitely for people who want to have a slightly more casual time, and its one of those quests that I think would be even better with more people, since it will inevitably lead to more unique and silly situations. Mind you this was playing the quest blind, I am sure it would be less fun to cater a deck to the quest in particular since a lot of our fun came from the ways our decks either thrived or stumbled in the unique environment. It is definitely a quest I'd play again on normal and one that I will expect to fully have to make a deck for in nightmare.\n\nAcross the Ettenmoors- Honestly I know for a fact my one time through this quest with a friend was NOT indicative of its actual quality. I see what the quest was trying to go for, and its pretty cool. I suspect you were supposed to feel like you were getting worn down over a long journey much like the Redhorn Gate, but despite playing with two players we somehow got through the whole quest without really seeing any of those big enemies. The main thing that happened was we milled all the big scary monsters when prompted to flip cards until we saw a side quest, then we proceeded to just never reveal one of the substantial monsters that I suspect were supposed to be a big part of the challenge. As a result we were downright confused when we flipped the third card, expecting something to really humble us, only to realize that we had the game in the bag. I might even solo this one or play it again on normal at some point to get a better feel for it. \n\nThe Treachery of Rhudar- This was another cool one. I was happy to see the undead return as they made a good impression on me in the first encounter with them. In a way it felt like a farrrrrr less difficult version of siege of Cair Andros with you hastening to conquer short term objectives for long term gains. My friend and I were able to clear two quests(only failing to get a third because another side quest flipped and it itself had two of the +6 quest point cards on it. With two quests completed and the middle under control, it was a simple matter to then get the required damage on Thaurdir. This falls under the category of something great for casual play and that I think will benefit greatly from nightmare mode.\n\nThe Battle of Carn Dum- Now unlike the last few quests this is one that decisively does NOT need nightmare mode to be a challenge. The difficulty spiked into the stratosphere with this one, totally throwing my friend and I for a loop. It is easily harder than a lot of nightmare quests, and there are certainly opening sequences of cards that can decimate you. The quest is so hard that on the second card I actually forgot that the boss was supposed to be attacking both players and we were still losing despite that mistake. \n\nI actually quite like this quest for its challenge and giving us a satisfactory showdown with a recurring antagonist, and the undead theme I continue to enjoy. My main critique is that Thraudrir's ability really should only trigger off the first revealed sorcery. I'd be happy to hear others opinions on this, but the sad effect of it triggering off every sorcery is that in multiplayer games the quests difficulty skyrockets and becomes unmanageable. While I am sure we could have eventually got a win, I ended up doing this solo with my friend not wanting to go through the swingy grind which I can't blame them for. \n\nThis is a quest that puts some of the most intense pressure on you out of the gate that I've seen, and demands you bring your A game in terms of questing, surviving, and fighting back. I'm glad not every quest is this hard but I do love the challenge existing. \n\nThe Dread Realm- So after the last quest I had expected this one to be anticlimactic, thinking that battle felt akin to an epic finale, and that this one would pale in comparison to its difficulty. But to be honest I am happy to say that it far exceeded my expectations in terms of challenge, fun, and design. It took me and my friend a whole night of attempts but we finally downed it. I appreciated that the quest actually punishes players using cards like Dareon's runes which usually feel like a mindless auto include when deck building. In some ways it actually punished my Vilya deck by invalidating the fact that I had cheated out high value allies by killing them and turning them into undead with the possession card. The boss themself was a pushover compared to the previous quests, but that was only after adding some condition removal(which I might add doesn't work on half the sorceries). I also enjoyed that the quest had you thinking long and hard about usually obvious choices, such as discarding a card to Arwen which suddenly you must consider because having a copy of an ally in your discard pile can be a huge liability.\n\nA lot of times quests that involve a boss are pushovers once they fall but that really wasn't the case here. Even with access to healing the final stage necessitates you using some haste, thus being a success in terms of each quest card providing a distinct feel.\n\n------------------------------------------\n\nThe Grey Havens- What a great set of quests these are! First of all I played Sall of these and the rest of the block on two player normal, though a third person jumped in for a quest or two. Despite it not sticking out when recollecting it, Voyage across Belegaer is just about the perfect introduction to sailing. While its an awesome quest, theres not much to say about it aside from it being one you absolutely should play before playing the later quests in the block. \n\nSpeaking of sailing, I've got to say I love it, and respect the design team immensely for trying something even more outside the box than usual. While I wouldn't want every cycle to have something quite as out there, with as many cycles as they've made it was very much time to shake things up, and I think they knocked it out of the park. The fact that she ships are each unique and give different buffs is a delight, and gives you even more things to experiment with. They did a perfect job of emulating what sea battles should feel like, and sprinkled in just the right amount of sailing throughout the block to get used to and enjoy the mechanic without it becoming old.\n\nFate of Numenor, serves a similar purpose as Voyage, but for introducing the players to uncharted locations, a cool little mechanic they use throughout the block as well. Once again, despite being a great quest, it doesn't stick out much when compared to the later, more developed scenarios in the block. With these too easy quests, as well as the ones later in the block, I really cant help but be excited to play them on nightmare!\n\nUnlike the fairly low difficulty of the first two quests, Raid on the Grey Havens will give adept players their first taste of challenge, almost jarringly spiking the difficulty through the roof. That being said, it is a welcome level of difficulty after the prior tutorials, and also the excellent characters that are Captain Sahir and Na'asiyah, who we'll talk about later to avoid spoilers. \n\nThere is a lot going on here- managing locations burning down, dealing with enemies, and two veryyy potent bosses. However I found it to be a very agreeable level of challenge, with it being the kind of encounter you and your friend could grit your teeth against, slightly tweak your decks, and beat in 2-4 attempts. \n\nAll in all this was an amazing set which, spoiler alert, is the introduction to an amazing cycle. As amazing as it is, I do recommend players only play it once they have a few other blocks under their belts, since I think part of the enjoyment it offers comes from the breaking of the status quo, so new players would experience two seemingly gimmicky quests, followed by a hard one- For anyone else, this is a must buy!\n\nFlight of the Stormcaller- You're gonna hear this a lot- but this is an excellent quest! This one mixes the race concept that has been used a couple times throughout the games lifespan with the sailing mechanic, to great effect. While we beat this quest in one attempt, it certainly didn't come across as too easy. Players will have some options in terms of how they can win the quest at the end, either though combat or questing, as well as an additional way to lose, in the form of the Stormcaller outpacing you. This is the perfect post-tutorial debut for the sailing mechanic!\n\nThe Thing in the Depths- Unsatisfied with being anything but unrelentingly good, thing in the depths gives us another winner(though turn back now if you don't want anything spoiled).\n\nYou are fighting your way onto and across Sahir's ship, dueling once more with the two bosses from earlier and the encounter deck simulates this excellently, with locations being different parts of the ship you are securing. Then, in an amazing moment, the tentacles of some leviathan from beneath shoot up and seize the ship and start to pull it under- You and Sahir lock eyes- and begin to fight the monster in a temporary truce. \n\nThe flavor alone is enough to make me love this quest- They could have easily have just had you get attacked by the monster while on your ship, but no, they went the extra mile and made an epic scene of it with two very different phases. \n\nIf I had a complaint it would be that for whatever reason, we had a pretty easy time with the second phase, but perhaps that could have just been lucky deck choice.\n\nTemple of the Deceived- This quest has your alliance with the pirates continue as you trek across an unexplored island to find a temple with treasure. This quest further shows just what you can do within the system that is the LOTR LCG since you literally build the island out of two sided cards and flip them as you journey. You can kill a boss early on to aid in finding the exact location of your destination, or just cross your fingers and stumble to one of the four potential locations. \n\nI am very excited nightmare mode exists for this, since as cool as this is, it is more of a demo to me for what a very different version of dealing with locations could look like- With the difficulty being back down to tutorial level, more or less.\n\nThe Drowned Ruins- A swimming level in LOTR lcg? Turns out its adapted excellently, with you essentially needing to go underwater multiple times to reach your goal, once again joined by your pirate allies. What that consists of is choosing to dive underwater with one of the two sided locations you'll find, and as pleasant as some of the surface level locations can be, you will find the underwater sides horrifyingly debilitating placing limits on you like not being able to attack. The genius design here that is interesting in terms of gameplay and emulates swimming so well, is that you can choose to surface if you cant survive with the debilitating effects that being submerged involves. It is interesting seeing if. your deck can stand up to the various ways the deck tries to shut you down, but at least for us it was fun and not too challenging.\n\nThen, surprise surprise, Sahir betrays you when you reach your destination, with him attacking you, seizing the treasure and causing the chamber to begin to flood as he flees. While the first part of the quest was a slow process, this is essentially a massive push to escape since once you forcibly go underwater the turn after you advance to this stage you are stuck there! Either needing to get out or drown. All in all this quest wins in terms of theme, mechanics, and story progression, with a moderate but not overwhelming difficulty.\n\nA Storm on Cobas Haven- Sailing is back! And they are not babying you, with this being quite a challenging quest to tackle. You are essentially trying to gain control of the various locations, recruit ships to your cause, and then either outrun your enemy ships, or defeat them in battle.\n\nThis is a cool encounter in the sense there are a lot of decision to make. Which ship to use? Which location to start with out? How to resolve the last part of the quest? Its fun, and is the most combat heavy sailing related quest there is IMO. And it flows right into the conclusion of the block which is...\n\nCity of Corsairs- This is how I wish every block ended, an extremely hard, epic showdown that all the quests have been building towards. You begin by battling the Stormcaller on the high seas, where you either have to destroy it, or rush past it with sailing and questing(easier said than done with a deck with only roughly 25% success symbols. There is a small perk if you destroy the Stormcaller, since the quest normally will give each enemy a resource if you advance without destroying it, but other than that it is totally up to you which direction you take. From what little I've seen after completing it, the majority of people seem to linger on the first stage as much as they can and build up, with some even using secrecy decks to avoid engaging the Stormcaller(which is normally a big problem since its a powerful enemy and you will get boarded each time it engages you), so perhaps this encounter can be mostly trivialized with that approach.\n\nButtttt with our approach we battled the Stormcaller, weakening it over the course of a few rounds before finishing it, crash landing, and storming the city. This quest is just straight questing, symbolizing the fight to reach Sahir at the Shattered monument, a location that all but necessitates you have no enemies out when it is added to the staging area, since it generates a resource on each enemy(which will ultimately become fuel for Sahir's attacking and survivability. You essentially have to kill every raider, with every resource from them shifting to Sahir where it serves as extra life, and for each 5 on him he gets an additional attack. Needless to say this can get overwhelming if you entered this phase with enemies in the middle or are unable to clear the location, this can spiral out of control.\n\nBut once Sahir goes down, that is it! And now let me address Sahir, my favorite villain in the LCG. It felt like with the previous block they had developed a good template/idea of how to implement a recurring villain, though the final encounter with him was a litttttle over tuned even for my taste, as well as the final encounter being against his master, who was just introduced and easier than him- But with this block they did it right, having you fight him, ally with him, be betrayed by him, chase him, then slay him. LOTR LCG doesn't have strong writing, but what it does do well is tell a story through mechanics. As players we dont need to read something long winded, we just need to look at a quest card and say \"oh crap Sahir just assaulted me and ran. While I wouldn't want every single block to follow this exact formula, it is far more effective than having the block be quests that feel very unrelated, or villains just abruptly showing up. \n\nAnd not only is Sahir my favorite villain, this is my favorite block of content, the couple parts that were too easy were unique, and the rest was an ideal level of challenge. Again though, despite it being my favorite, I think it is best avoided for newcomers to the game. \n\n---------------------------------------\n\nThe wilds of Rhovanion- Having just finished up with my favorite cycle to date(I played Harad solo way back), I was skeptical if this one would be able to measure up at all. Needless to say once I saw the quest name Journey up the Anduin, and that it used classic cards from the core set I was grinning and loved taking on the cards in a more modern format.\n\nThe final quest was pretty cool as well, with the battle with the fire drake- It is a similar kind of dungeon crawl to ruins of belagost, which is another great quest. The special mechanic- the Cave Deck- is pretty cool, filled with nasty locations and some very helpful ones that you flip and make the active location right after you travel to a deep location, discarding that one. This can result in some RNG, though this particular quest does give you the option to sift through the top couple cards to mitigate that if the right locations flip. I liked the brutality of the anti ally deep location, since I tend to like when the game through a little hate to some generally powerful strategies.\n\nAll in all a great box, and left me hungry for more.\n\nThe Withered Heath- I'm of two minds about this quest. It essentially consists of tracking a dragon, hunting for signs of it in the cave deck, fighting that dragon, then trying to catch it(ideally before its licked its wounds), and finishing the job. The flavor is awesome, and frankly sometimes it plays out quite ideally. However the big problem I have with this one is RNG. Sometime, turn one you will already have a dragon sign, you'll quickly beat the dragon down, then grab the other signs and pummel it. However other games, even when you are dominating the quest, you will be yawning, just waiting to find the signs. I've had two really boring runs of this, one which we actually threated out for which felt anticlimactic, and the other which we won but it just took so long it felt like we lost. I'd warn against playing this with more than two players, and honestly be prepared for a possibly very long quest, with the potential of it being short. I'd honestly say if you want a reasonable length game to randomly remove a few of the cave deck locations(you could bet removing the good ones yeah, but it raises the chance of pulling a dragon sign). All in all this is sadly a mixed bag in a game with so many legendary quests available. \n\nRoam Across Rhovanion- Now this is more like it. This is a quest with a lot of variance, since although you will complete all the steps of the quest each time, you will be doing them in different orders, and thus having different boons(or burdens) at different stages. I felt like the encounter deck did a good job at challenging my deck from a variety of angles, which I loved. It certainly requires combat prowess, and in my particular game I was near overwhelmed and had to resort to desperate blocks, chumps, and undefended attacks. I was able to beat it in one attempt but just barely- I will say that Durin's key, while it has an incredible positive effect, in a one or perhaps even two player game, its negative effect is absolutely horrible, so with lower player numbers the game is a bit RNG, since you would always want to get that quest last. I got it first and it drastically increased the struggle, which was fun, but certainly unbalanced. This is one I will certainly revisit, especially with 2-3 players.\n\nFire in the Night- Always get excited to see what one card quests have to offer and this one doesn't disappoint. This felt like the standalone scenario vs. Smaug, but a very modern take on it. I like that there are minions working with the boss, and that it is not a straight up brawl initially, you are essentially throwing guys in the way of the dragons attacks on the city, while questing against the side quests in the side quest deck, which either offer a beneficial effect or stop a negative one. Once you have done three of them you essentially get Dagnir's attention and they begin to attack you, but are also vulnerable. Love this kind of take on a boss fight, and found the difficulty to be ideal for an epic mid cycle encounter, probably my favorite of the cycle thus far.\n\nThe Ghosts of Framsburg- A pretty solid quest in the broad scheme of things but it felt like a let-down compared to the rest of the block, especially as a follow up to Fire in the Night. Also, as a bonus, you can completely break the third quest in this, which is supposed to be the hardest. How do you break it? Just get the shade in the victory display with either the quest that searched the top of the deck or into the wild and because the final quest just required him to be in the victory display, you've inadvertently achieved the victory condition more or less. When two friends and I did this, we actually errata'd it to make the shade come out to avoid ruining the experience. A low point, but still not an overtly bad quest. \n\nMount Gundabad- I was a bit skeptical of this encounter, since if you've read my reviews, I wasn't the biggest fan of the flight from Moria especially on nightmare mode. I also was slightly spoiled from glimpsing at the following quest that this was the climactic showdown with Dagnir and was skeptical that using a similar format as that quest could possibly give a satisfying conclusion. Strangely I was both correct in that assumption, yet impressed. \n\nI am sure there are quite a few ways this could play out, and there is inevitably some RNG between the caves deck and the quest deck, but I found it surprisingly smooth compared to other attempts at this, with it feeling less like a trudge and more like you were always getting something done. Sneaking past goblins, fending them off as your bro reforges the blade, and the adventure turning into the climactic battle. It is certainly a great quest, but weirdly I almost would have narratively wished that this quest could have been swapped with the initial encounter, with you potentially wounding Dagnir here, then finishing him off when he spitefully retaliates with reinforcements, but thats more me just liking the idea of the harder encounter being the climax. Objectively this was still a great time and an excellent experience.\n\nFate of the Wilderlands- While the first encounter with Dagnir hyped me up a lot, I appreciated the conclusion of the block being a tribute to the hobbit, with the dragon falling and orcs swarming. Despite being a three part quest, it is a fairly intuitive and straightforward battle that has one clear goal from the beginning. I liked that this was a fun and very combat oriented push against urdurg, with a very intense beginning where we actually lost by 6 on our first attempt which was a failure and again on our second attempt which was a success. It was a very different take on a boss battle too, with him honestly going down quite easy, although they fortunately included the clause that he couldn't take damage if he hadn't attacked previously. \n\nAll in all this is an awesome block of content, though for me I think it didn't quite push past the sailing and pirate antics of my favorite one. \n\n----------------------------------------------\n\nA Shadow in the East- So the one downside with not recording my thoughts of quests right after I play them is that sometimes a quest will overshadow the others  bit, and in this box that happened to the extreme. I played the River Running solo and found it to be quite easy- Which doesn't mean the quest is easy per se, since sometimes with solo you dodge powerful sequences of cards. However what I will say for this quest is its a great intro to the Easterlings which do a good job of quickly distinguishing themselves from the many we've encountered in the past, with them having an array of treachery attachments that can attach to them when flipped or be fetched back, resulting in some interesting board states and challenges. \n\nDanger in Dorwinion I grinned as I set it up, realizing this was essentially a new steward's fear, especially since one player hadn't experienced that quest. Now perhaps I am spoiled from murder at the prancing pony, and the nightmare version of the steward's fear, or by coincidence the encounter deck and our decks meshed weirdly, but despite really liking a lot of the mechanics, for whatever reason we were kind of crushing it, and as a result it felt like a bit of a slog. That being said, I looked at the different plots afterwards and we hit submit or die, which was ineffectual since I had a beefed up Beregond meaning no one ever died and the attack buff was nearly irrelevant, whereas all the other plots would have applied a lot of pressure to us making it more interesting. So while this fell flat I'm excited to tackle it again and who knows, perhaps it will eclipse stewards fear on the next playthrough or two.\n\nAnd onto the star of the show. Now objectively you could say there are multiple levels of RNG in this quest and you'd be right, **** we lost one game against it because of a 50/50 flip from the power of Mordor deck that threated out an essential player, and revealing certain quest stages at different times can give a very different experience. Butttt I love this quest, and we eagerly smashed our face against it multiple times, honestly surprised by the sharp spike in challenge. This is one of those quests that assaults you from every angle, requiring questing, threat mitigation, combat, and even deck building if you want to dodge some of the terrifying effects like the quest that mills from the top of your deck and discards matching copies from your hand/field, which can truly show you how fragile you deck really is. This was a great introduction to the Thane as well, who as I played the following quests started to give me the impression of being Sahir 2.0. \n\nI think the real sprinkles ontop of the interesting mechanics and challenge however, was the Mordor flavor- Aside from the saga you don't really get the direct Sauron flavor, but its here in spades, specifically in the power of Mordor deck. This is one I certainly rank as a tough one, at least at 3 players, and will certainly want to revisit, along with the rest of this very solid box of quests, especially since this quest overshadowed the first 2!\n\nWrath and Ruin- This quest had my attention since the moment I read its name. Between the name invoking Theoden vibes and I being a follow up to such a good quest I was very suspicious if it could actually live up to expectations. However as soon as I saw we were returning to the gaining locations mechanic, I was grinning much like with Danger in Dorwinion. However the difference is this is an awesome quest that is both incredibly challenging but relatively intuitive. We nearly threated out while beating it in an epic 4 player game, with Beregond plus the card that makes defenders not tap and get +2 defense having an insane moment of blocking 11 enemies in a turn when we pushed to the last phase. Can't believe we still struggled even while arranging that play! This was a fun follow up to the Thane's character as well, for some reason I am thinking he might get possessed by Sauron or channel him in some way in the finale but only time will tell.\n\n \n\n-----------------------------------------------\n\nLOTR SAGA:\n\nThe Saga quests were the treat I'd been saving for myself since getting into the game. I wanted to be adept with the rules and have something big to look forward to, and I finally took the plunge, albeit on normal mode, which it turns out I'm glad about since some of these quests are tough! I am not playing on campaign mode, but I am playing them with 2-4 players. I'm going to summarize them by box, since there is overlap in mechanics and the heroes you play with throughout each.\n\nThe Black Riders:\n\nAnd we're off! First lets talk Frodo(The way I played it is that we used the fellowship hero that came with each block, since thats also generally what seemed intended. I like this Frodo! Mediocre stats sure, but he is basically a get out of jail free card in an absolute pinch. I will say I enjoy not needing a first player token when playing saga quests.\n\nI enjoyed the quests that kicked off the saga. They weren't the most grand scale, but then again they shouldn't have been. Especially with the re draw effect of Frodo it felt like a scramble away from all of the Nazgul.\n\nShadow of the past was pretty crisp to me, ideal difficulty to kick things off at least. \n\nA knife in the dark was mechanically fine but had some thematic clashes that were jarring to the point I re checked quest cards to make sure I hadn't made a mistake(namely says and non nazguls accosting you at weather-top. This is probably the most extreme example of them struggling with one of these sprawling type quests, but for it being the low point I'd say thats pretty decent. Its also pretty easy to blow Bill Ferny out of the water if you are prepared for it.\n\nAs for Flight to the ford, we crushed it pretty handily, but it was quite thematic and felt like a pretty reasonable representation of the actual tale.\n\nThe Road Darkens:\n\nSo, first things first, for whatever reason with the decks we played the Frodo from this set really didn't do much for us. Perhaps it was never even contemplating putting the hero who our survival depended on in harms way for a block, or perhaps it was just coincidence that any time he theoretically could be useful we had blockers, or just that we used him to quest every turn. However, I am happy to say the mediocre Frodo didn't really diminish the experience here. \n\nI must say, that as the person who usually is the deck master, I adored the fact this box didn't require mixing and matching sets. I get why its essential for the game but man is it nice for a change. \n\nThe Sagas have a challenge, in that they want to convey a LOT of story in as few cards and quests as possible. The Ring goes South for example is looking to convey the story from the council of Elrond to passing the watcher and does so with grace. The council is presented by an extremely cool quest where it is decided where each of the players at the tables cards will go, resulting in a card played for free, a card added to the hand, a card discarded, and a card returned to the deck. Super smart design to kick things off. You then flee from/fight wargs, and arrive at the watcher, having to free the ring bearer from its clutches before fleeing into Khazadum. If I had to nitpick I would say fighting wargs at the watcher doesn't feel right, but really this didnt bother me in the least. Super fun quest!\n\nIn Journey in the dark, you essentially are in a race against the balrog, though you likely will be caught by him in the last moments. I honestly expected to be bored by this encounter considering that Moria/Balrog is the one thing that has been done to death in this game, yet it managed to distill and purify the experience to feel like a very fluid iteration of the novel/movie. I like the different ways to conclude the encounter, and the overall sense of urgency. DOOM, DOOM, DOOM indeed.\n\nBreaking of the fellowship is an incredible quest, a truly pivotal moment in the saga thats hard to pull off. Because of the split quest mechanic I think that its best played with more players for the theme to seep through. I also think its best to be able to enjoy the card \"Fallen into Evil\" which literally steals a hero and turns them into an enemy(in other words, one of the most powerful treacheries) without it being an instant concede. Really my only complaint is that card since I FULLY agree something along the lines of it had to exist, but its so powerful that it adds such RNG since its a 1 of and can be countered, and is an instant concede if it resolves in 1 or even 2 players. Still, I respect and dig the quest, overall a great box.\n\nThe Treason of Saruman\n\nOnce again, lets talk the fellowship hero. In this case, ooo baby this Aragorn is my favorite fellowship hero period. What a versatile and powerful ability, coupled with Aragorn's good stats. This feels like a valuable asset, and frankly one thats perhaps too strong aside from the helms deep quest.\n\nThe Uruk-Hai is an awesome quest but I'll start off with the thing that is a downside right away. If you just want to jump into it with friends, you essentially want to choose as low threat captive heroes as possible(since each player gets one stolen), meaning you can't technically just dive in with your usual decks. That minor nit pick aside this is a super fun quest that perfect captures this part of the saga. There are quite a few \"race\" quests in the game, but this one stands out in terms of mechanics. I am sure this one would be fun in terms of making very specialized two hero decks for, doubly so on nightmare mode, I'd imagine.\n\nHelm's Deep-  Yeah I broke format and bolded it, what of it? The designers clearly felt the pressure in terms of living up to the absolutely epic status this battle has achieved between the books and movies. And honestly? They delivered. Nothing can quite capture the moment you look at your friend in awe when you realize the enemy deck is questing against YOU. This is not a quest for casual play, and I would imagine it would be the first serious block to players in a campaign. The quest gives players the options of taking Grima's poisoned councils in exchange for essentially a free turn and free ally played, naturally this can give you a HUGE boost. However poisoned councils is an RNG based, hugely swingy card. Something I'd hate to see in the first few turns, but could be a real spectacle later on. That being said I really can't imagine tackling this quest without the benefit taking on the council gives you, since this quest goes HARD. \n\nI like this quest since it is essentially designed to enact the battle itself of getting out of control and nearly besting you until the final moments. Much like the battle of the five armies and the later battle of pellanor fields, this is a truly massive conflict distilled down to a digestible form. After the pure stress of the initial phases it is awesome that the final stage is simply to clear out every last enemy in play. A truly thematic, difficult, but awesome, quest.\n\nRoad to Isengard- This was a fun little unwind session for me and a friend after the Helm's deep scenario. I am sure for some deck combos this could be an intense encounter, but for us we were able to get all the Ents in the first fun little mini game( which admittedly is RNG Based) and beat the scenario in a one shot. While we found it easy, it was not like we didn't feel the power of Saruman pushing back at all which was the main thing I was looking for.\n\n \n\n \n\nThe land of shadow\n\nFlame of the West\n\n-----------------------------------------------\n\nOver Hill and Under Hill- I went into the hobbit boxes having read some pretty scathing comments against their quality, and thus was skeptical. I tackled these playing solo and on nightmare mode in the hopes that the nightmare decks would fix whatever problems people had with the quests in a similar way to how the heirs of Numenor nightmare mode addressed some broken elements, however incase they didn't I, didn't want to be playing multiplayer and ruining someone else's day. I am glad my expectations were set low because although I wasn't floored by the quality, I was able to enjoy the quests for what they were.\n\nMust away ere break of day- The problem with this quest is that to do the thing that you will inevitably want to do(get the treasure) you need to not only build a super specific deck, but get lucky. As I've mentioned, I think this game is at its weakest when you are just waiting for things to flip off the top. Because I'm a completonist I really wanted the treasure, but also didn't want to keep trying the quest and waiting, or cheat and just take the treasure. As a result instead of enjoying the pretty cool adaption, with a thematic way of conveying waiting for the sun to come up, I left this quest a bit annoyed.\n\nOver the misty mountain grim- Solo this felt unbalanced and swingy. The first deck can potentially have you getting a hero one shot on turn one from guffawing giants, getting boulders surged at you, or just get two giants in the middle which a slow start probably cant handle, or you could get a crow flipped/dud treachery card, giving you a chance to set up and comfortably quest hard. After turn 1 as long as you have an ally up incase a giant comes for you, or you have enough quest to power through it, it’ll be a total breeze. With more players it would likely be less of an instant loss or win I feel though.\n\nLikewise with the second half, in my play through on nightmare mode I paid one resource, revealed the land that you need to pay from bilbos pool to damage goblins, and a dud treachery, I chump blocked the king and he didn’t flip a goblin. Then the following turn I was able to quest hard enough to finish the location allowing me to feint the goblin king and kill him with the allies I had left up leaving the middle empty and thus winning by questing hard twice. Like the first part of the quest I feel like it is too swingy in solo. After beating it I looked through the deck and saw a fair share of surge cards/cards that gained surged when the king was dead. No doubt if I revealed two surge cards when arriving at 2B I would have been in for a very different experience. All that said though I liked the quest in concept and actually look forward to playing it multiplayer.\n\nDungeons Deep and Caverns Dim- Not gonna lie, was initially quite soured on this one because I was playing it wrong by ALWAYS revealing the card but then also doing the riddle, making for a totally overwhelming experience. \n\nWhile this is the ultimate example of the kind of quest you do NOT want to see when you and your friends are tackling quests happily, looking to swap 5-10 cards in your deck tops- I also respect the design. First and foremost it does really capture the flavor of this part of the story quite well. I just made a mono color spirit deck that focused heavily on 1 cost events, at which point the riddle portion was mostly handled, and the enemies were a fierce but fair competition for my main force. The nightmare location that appears in phase 3 as well as not letting gollum take damage are great changes to make the final phase not an anticlimax. Very glad not a lot of quests are like this but I do appreciate them existing and considering this was the quest I've read the most poor opinions of I was honestly impressed.\n\nOn the Doorstep- Tackled this solo mode on nightmare as well. As with the previous Hobbit box people seemed pretty sour on this box with the exception of the battle of the five armies which most people considered excellent. Overall this box was more enjoyable to me, with the first and last being quests I can recommend and only the second one as a fairly questionable quest. \n\nFlies and Spiders- Very well designed and fun even in solo despite it seeming like it would scale up in multiplayer in terms of enjoyability. Whereas the encounters from the first hobbit box felt like they would have been tough not on nightmare mode, this ones nightmare elements were definitely the part that stuck out the most, with any early addercop would meaning demise. When all resources got discarded and everyone got exhausted I was worried for a moment the quest was going to go downhill but they managed to make freeing your team both fun and thematic.\n\nThe lonely mountain- Yeesh this one is crazy on Nightmare mode. It is pretty awesome thematically in a lot of ways, butttt you have to build your deck fairly uniformly, have tons of card draw, abuse the action window during the burgle resolution- which once you do lets you slog to the end fairly consistently, but then comes you crossing your fingers for the infamous Smaug attacks and I’d be lying if I said I had a contrarian opinion. I’ve been ok with single attacks that can spiral to the heavens like in siege of Cair Andros, and the occasional shadow card resulting in an extra attack, but even if you’ve played perfectly you are getting attacked by Smaug at least once(twice if playing on nightmare.) and that could either be you chumping two attacks and then easily questing for the win, or getting completely blown out by seven attacks and immediately losing in a situation there was no way around seeing as you can’t feint Smaug or mitigate his attacks. I do kind of appreciate that the nightmare version insists on you collecting all the treasure, and in general think this way of obtaining treasure is far better than in the first hobbit box.\n\nBattle of the five armies- Glad the the finale of the hobbit boxes was epic and managed to be challenging but not the kind of difficulty that required a total deck overhaul. I played this with two players and it was a to-the-wire challenge until finally stabilizing before the final quest. It definitely captured fighting a battle on multiple fronts however I will say that while the nightmare decks usually enhance flavor if anything, that this time points are lost for the eagle coming out of the deck because as amazing as the quest was, and as rewarding as it was to finally cut down Bolg, I didn’t fully get the feeling of the five armies. Heck even if the eagle was in the deck I dont think I fully would get that feeling but I guess it was too hard to balance having friendly allies in the deck. One other downside is it certainly has the capacity to blow you out turn one through a plethora of avenues, but once you are past the first few turns its a great eb and flow encounter.\n\n-------------------------------------------------------\n\nStandalone quests:\n\nSiege of Dol Guldur- This is a weird one for me. While its not what I would consider a bad quest, to me it is one of the most inelegant quests. What I mean by that is that it is the quest that I mentally flinch at a bit when it is suggested- Particularly if a new or unfamiliar player is involved. There are a lot of counter related things to be keeping track of- counters that need to be paid, counters that need to be transferred, end of round counters being added or removed, and then eventually revealing a random stage to trigger its effect then deciding on a new stage to go to, while also tallying up siege damage. None of these on their own are that bad, but the prospect of explaining and conveying them to new players, and the micromanaging of everything- Just doesn’t click with me. Its a shame since every other standalone quest I think ranges from good-flawless, but this just comes up short. I am glad it exists, but it is something I’d steer away from playing aside from solo or with someone acquainted with the game thoroughly, or ideally someone familiar with the encounter.\n\nMurder at the Prancing pony- I have to say this is the gold standard when it comes to standalone quests. It is like a beefed up version of the Steward's fear, really capturing the feel of going on a hunt for your culprit and his hideout with a pretty staggering amount of replay value due to the different combinations and options for culprits. Despite being something I played months ago it is still one of my most vivid experiences with the game and I think it serves as one of the best examples of how creative the creators can get with the LOTR LCG format. If I had to give it a critique, it would be that the threat can feel out of control if you have high starting threat and/or no way to mitigate threat, but thats a minor quibble since I understand the necessity of the threat clock.\n\nMassing at Osgiliath-  Despite MATPP being my favorite standalone quests, I think this is one of the first ones most people should buy. My playgroup was awed when we jumped from Mirkwood content into this and saw how many enemies started in the middle. It is just about the perfect bridge between \"easy\" and \"hard\" content in this game. It is also one of the best quests to test a combat oriented deck against, and what I bust out anytime someone new who likes tactics is playing.\n\nThe Stone of Erech- I've got a love hate relationship with this quest. On the one hand I really realllllly like the mechanic of the game getting way harder as midnight approaches. The problem is that because your attack stat is basically useless due to only being able to attack the undead with your quest, it requires fairly specific decbuilding so its not like some of the other standalone scenarios you can just jump into. I enjoy the theme so much I even forgot once that that was a factor and played it with a friend who was running a tactics deck, though fortunately I set up Massing At Osgiliath to cleanse their palette after. The theme of effect negation is also pretty decidedly crirppling/unfun which makes this a really hard quest to justify busting out. The final unfortunate element is that its pretty easy to quest hard and get the quest finished with before you even get deep into the night.\n\nYet I don't think this is a bad quest- It's important that some quests offer incentive to build outside the box from time to time, it just sady isn't a crowd pleaser as a result. \n\nBattle of Laketown- This is the standalone quest equivalent of Heirs of Numenor in the sense that it is one of the earliest standalone quests ever released and also extremely difficult. In terms of standalone quests, this wears the crown as the most difficult available. One thing I like about this quest is that its difficulty actually enhances the theme as opposed to getting in the way of it. You really do feel like you are trying to fend off a nigh unstoppable dragon while he's destroying a city. It is also impressive that this was pulled off in a compelling way with only a single enemy(albeit one that very cleverly has different versions you fight to add variety). Despite its theme and great design it is the kind of encounter that you really do have to want a challenge going into to fully enjoy. \n\nEdited March 29 by programdude"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3814818","commentId":3814818,"userName":"JonG","timestamp":1572022657,"content":"Nice write-up. I pretty much agree with everything you've written. Khazad Dum/Dwarrowdelf is a fab starting point and beating Shadow and Flame is one of the great moments in the game. The Mirkwood Cycle Adventures are OK although I have to say that I didn't like Emyn Muil (just boring!) I think you've got Heirs of Numenor to a tee (Stewards Fear is indeed a classic!), but I would just add that I think it offers some great player cards (especially the Gondor synergies). I haven't played Voice of Isengard for some years, but my memory is that it was fiddly although perfectly good as I recall. I also really disliked the Hobbit adventures and am thinking of getting rid of them. \n\nWhere I do disagree with you is with the Stone of Erech. I think that it's one of the all-time great quests; not too difficult despite the emphasis on quest, not too fiddly despite the time mechanism, and just so awesomely thematic. We can't all agree I suppose, but maybe it's worth another try?\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3814877","commentId":3814877,"userName":"Valhalla Gaming","timestamp":1572026693,"content":"> 47 minutes ago, JonG said:\n> \n> Nice write-up. I pretty much agree with everything you've written. Khazad Dum/Dwarrowdelf is a fab starting point and beating Shadow and Flame is one of the great moments in the game. The Mirkwood Cycle Adventures are OK although I have to say that I didn't like Emyn Muil (just boring!) I think you've got Heirs of Numenor to a tee (Stewards Fear is indeed a classic!), but I would just add that I think it offers some great player cards (especially the Gondor synergies). I haven't played Voice of Isengard for some years, but my memory is that it was fiddly although perfectly good as I recall. I also really disliked the Hobbit adventures and am thinking of getting rid of them. \n> \n> Where I do disagree with you is with the Stone of Erech. I think that it's one of the all-time great quests; not too difficult despite the emphasis on quest, not too fiddly despite the time mechanism, and just so awesomely thematic. We can't all agree I suppose, but maybe it's worth another try?\n> \n>  \n> \n>  \n\nI probably didn't convey my thoughts on Stone of Erech properly. I do personally enjoy it, and its actually one of the easier quests when compared to standalone quests or nightmare quests. To be honest I wish it was ever so slightly more difficult because it can be possible to barely see the amazing flavor play out if you beat it quickly.\n\nHowever I have found that its one that you need to be careful when you bring it out, as one of my friends really got aggravated by the negation effects rendering his decks impotent, and another time a different friend had built a combat oriented deck only to realize most of his cards were dead. \n\nI think quests like this existing are a must, since it allows for unique deck building opportunities, but as a result it is also not as universally easy to recommend as some of the other quests. \n\nI'll probably go back and clarify various things/clean up my post in addition to adding more quests, since it ended up being 4 am with me half asleep by the time I stopped 😛"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3815083","commentId":3815083,"userName":"Amicus Draconis","timestamp":1572050202,"content":"> 6 hours ago, programdude said:\n> \n> However I have found that its one that you need to be careful when you bring it out, as one of my friends really got aggravated by the negation effects rendering his decks impotent, and another time a different friend had built a combat oriented deck only to realize most of his cards were dead.\n\nThat reminds me on my first time playing this quest. I had recently finished the Dwarrowdelf cycle progression style and as I got more non dwarven heroes I more and more swapped the heroes out for the new ones (save for Háma), which lead to the desire to build two proper dwarf decks with all 6 dwarven heroes available.\n\nAfter building what I thought to be decent decks, I started playing the quest and immediately realized, that the spectral keyword is going to mess with my decks. Still I decided to give them a try and surprisingly I managed to beat the quest. It was rather unusual to equip Gimli with Celebrían's Stone and a Dwarrowdelf Axe to kill enemies, but it worked. And all the combat allies were put to good use during midnight on stage 3. The only problem came from engaging the Lord of the Dead on Dáin's side, disabling his buffs and severely weakening my fellowship. Had I engaged the Lord on Gimli's side, it would not have been easy enough to chump block him, as I never got Arwen out of my deck to make Dáin a sentinel."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3815190","commentId":3815190,"userName":"Valhalla Gaming","timestamp":1572079217,"content":"> 7 hours ago, Amicus Draconis said:\n> \n> That reminds me on my first time playing this quest. I had recently finished the Dwarrowdelf cycle progression style and as I got more non dwarven heroes I more and more swapped the heroes out for the new ones (save for Háma), which lead to the desire to build two proper dwarf decks with all 6 dwarven heroes available.\n> \n> After building what I thought to be decent decks, I started playing the quest and immediately realized, that the spectral keyword is going to mess with my decks. Still I decided to give them a try and surprisingly I managed to beat the quest. It was rather unusual to equip Gimli with Celebrían's Stone and a Dwarrowdelf Axe to kill enemies, but it worked. And all the combat allies were put to good use during midnight on stage 3. The only problem came from engaging the Lord of the Dead on Dáin's side, disabling his buffs and severely weakening my fellowship. Had I engaged the Lord on Gimli's side, it would not have been easy enough to chump block him, as I never got Arwen out of my deck to make Dáin a sentinel.\n\nThat is one of the cool things about that quest- Because it is not an oppressively difficult quest in general you can certainly beat it with less than optimal decks and its a fun challenge. My first time playing it was blind and my friend and I were able to squeeze out a win despite very far from optimal decks. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3816172","commentId":3816172,"userName":"Crusaderlord","timestamp":1572256838,"content":"Nice write up and i also like to read what others feel about quests - i myself only play solo with one deck and it seems i tend to find quests harder than you in general.\n\nMy website has my own views on which quests i liked the best but i like an adventure rather than a puzzle > http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/ [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3816969","commentId":3816969,"userName":"Valhalla Gaming","timestamp":1572316662,"content":"> 16 hours ago, Crusaderlord said:\n> \n> Nice write up and i also like to read what others feel about quests - i myself only play solo with one deck and it seems i tend to find quests harder than you in general.\n> \n> My website has my own views on which quests i liked the best but i like an adventure rather than a puzzle > http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/ [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/]\n\nPart of the reason I switched to normal mode once I got to the Ringmaker block was because I wanted a bit more room to breathe when first experiencing a scenario to enjoy the adventure feel as opposed to being crushed repeatedly, needing to change decks etc. \n\nHowever when a scenario is too easy it also has the effect of not feeling like an adventure, such as with some of the quests in the Ringmaker cycle that were a breeze solo but scaled up in difficulty in multiplayer and felt like far more fleshed out encounters. \n\nSome nightmare decks and even some of the harder regular quests are certainly only enjoyable when you are in the mood to really grit your teeth and struggle, whereas sometimes it fixes a quest from being one you can sleepwalk past the mechanics of. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3890029","commentId":3890029,"userName":"General_Grievous","timestamp":1581319590,"content":"Great post! Thank you for sharing and I look forward to seeing you review the rest!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3892129","commentId":3892129,"userName":"Valhalla Gaming","timestamp":1581507269,"content":"Just added my experience with the Dreamchaser cycle, my favorite so far! Also have been playing the sagas with friends a bit but will save my thoughts for that later on when I'm closer to finished."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3913961","commentId":3913961,"userName":"Valhalla Gaming","timestamp":1584184672,"content":"Just updated with some of the Sagas, and some of the Rhovanion block. Man do I love this game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3914331","commentId":3914331,"userName":"General_Grievous","timestamp":1584252021,"content":"Great read! Thanks for the new reviews! And it's the best game ever. And the one my wife always wants to play."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301513-reviewing-every-quest-that-ive-played/?do=findComment&comment=3921319","commentId":3921319,"userName":"Valhalla Gaming","timestamp":1585503361,"content":"> On 3/15/2020 at 2:00 AM, General_Grievous said:\n> \n> Great read! Thanks for the new reviews! And it's the best game ever. And the one my wife always wants to play.\n\nSounds like you've got a keeper indeed!\n\nVengeance of Mordor block has honestly surprised me, its been a very good blend of challenge, creativity, and throwbacks. Big expectations for the last three quests from it!"}]}