{"url":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/","title":"A riddle for you...","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3822615","commentId":3822615,"userName":"player3351457","timestamp":1573040969,"content":"I thought up a mental exercise with a buddy of mine.\n\nSuppose one player is running the three hunters contract. How many allies can you get onto the three hunters side? You can assume 4 players are playing.\n\nPost your number first and then we can compare notes after a good amount of responses."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3822635","commentId":3822635,"userName":"sappidus","timestamp":1573044600,"content":"There are some clear ways to grant a partner an ally, e.g., Wandering Took Wandering Tooks, Riders of the Mark, Curious Brandybucks, Blue Mountain Traders.\n\nThe Three Hunters deck itself can \"include\" Rangers of the North.\n\nStand and Fight recursion will get a bunch more.\n\nBut my favorite approach to this would have to be a boatload of unique allies, a Defender of the West, and Bartering (and as many ways to recur Bartering as possible). Anyone can play a unique ally and get Defender of the West attached. Then when the ally has joined the Three Hunters player, anyone can play a Bartering, and the owner of the DotW can reattach it to another unique ally. Rinse and repeat.\n\nHow many times can you repeat this in 4 players? Well, 3x Bartering for everyone, throw in Scrolls of Isildur, Second Breakfast, Will of the West, all the tricks… It adds up to a lot. But IIRC the answer is actually that any one player can recur any given card an arbitrary amount of times with Galadhrim Weaver, Elven-king, and an empty deck—so you can commit one person mostly to recurring Bartering over and over while two other players keep on contributing unique allies to be moved to the 4th player with the contract.\n\nAnyway, combining all the above approaches, my final answer is: \"a lot\".\n\nEdited November 6, 2019 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3822724","commentId":3822724,"userName":"Flrbb","timestamp":1573053147,"content":"Eagles of the North can also be controlled by that player which has that contract. It's the same as Rangers of the North.\n\nEdited November 6, 2019 by Flrbb"},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3822753","commentId":3822753,"userName":"Alonewolf87","timestamp":1573056345,"content":"> 49 minutes ago, Flrbb said:\n> \n> Eagles of the North can also be controlled by that player which has that contract. It's the same as Rangers of the North.\n\nWith the added difficulty of having to pass a Eagle ally to the player before hand, differently from Rangers Summons which just needs a Dunedain hero.\n\n> 4 hours ago, player3351457 said:\n> \n> Suppose one player is running the three hunters contract. How many allies can you get onto the three hunters side? You can assume 4 players are playing.\n\nAre we also considering objective-allies in some quests?\n\nIn any case I think Sappidus already gave an exhausting answer\n\n> 3 hours ago, sappidus said:\n> \n> anyone can play a Bartering,\n\nJust a small nitpick, only the Three Hunters player can play Bartering since it targets an attachment on \"a character you control\"."},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3822756","commentId":3822756,"userName":"Alonewolf87","timestamp":1573056418,"content":"> 3 hours ago, sappidus said:\n> \n> Wandering Took Wandering Tooks, Riders of the Mark, Curious Brandybucks, Blue Mountain Traders.\n\nThere is also stuff like Emery and Reinforcements, which let us put allies into play under \"any player control\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3823359","commentId":3823359,"userName":"Flrbb","timestamp":1573126268,"content":"> 19 hours ago, Alonewolf87 said:\n> \n> With the added difficulty of having to pass a Eagle ally to the player before hand, differently from Rangers Summons which just needs a Dunedain hero.\n\nWell, yes and no. It's true, that you need an eagle to shuffle the Eagles of the North into the encounter deck, but the player with the contract can take control of them when they get revealed.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/301965-a-riddle-for-you/?do=findComment&comment=3823468","commentId":3823468,"userName":"Alonewolf87","timestamp":1573137054,"content":"> 2 hours ago, Flrbb said:\n> \n> but the player with the contract can take control of them when they get revealed.\n\nRight, it's not necessarily the first player, I misremembered."}]}