{"url":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/","title":"The Master Ring and Sacked!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3824550","commentId":3824550,"userName":"RogueSeventeen","timestamp":1573243167,"content":"Hey guys,\n\nCan you use The Master Ring to cancel Sacked!?  I assume so because you're canceling the whole card and not directly the uncancellable When Revealed effects, kind of like when you cancel the Shadow Effect, but yea... I dunno. \n\nThanks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3824577","commentId":3824577,"userName":"Wandalf the Gizzard","timestamp":1573247292,"content":"I would rule that you absolutely can, for the same reason you mentioned! You can cancel cards with\"uncancellable\" when revealed effects with a card that has similar wording, The Door is Closed, so I'd wager the same would go for the Master Ring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3824600","commentId":3824600,"userName":"player3351457","timestamp":1573249774,"content":"The Door is Closed overrules the \"cannot\" rule?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3825050","commentId":3825050,"userName":"PocketWraith","timestamp":1573318727,"content":"I don't think that's right. I'm pretty sure things which can't be cancelled... can't be cancelled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3825072","commentId":3825072,"userName":"Amicus Draconis","timestamp":1573322302,"content":"I agree with the Warden, as the FAQ says:\n\n(1.14) The word “cannot”\n\nIf a card effect uses the word “cannot”, then it is an absolute: that effect cannot be overridden by other effects."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3826231","commentId":3826231,"userName":"Wandalf the Gizzard","timestamp":1573491917,"content":"Well, The Door is Closed doesn't cancel the when-revealed effect, it cancels the whole card, ignoring whatever text is in the \"when revealed.\"\n\nI was pretty sure that's how we've treated cards like that since they were first released."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3826674","commentId":3826674,"userName":"RogueSeventeen","timestamp":1573526808,"content":"Thanks, guys.  If cannot was absolute then you couldn't cancel the shadow effect either, right?  But we know you can, so maybe cannot is not always absolute?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3826680","commentId":3826680,"userName":"PocketWraith","timestamp":1573528282,"content":"Cannot being absolute has nothing to do with the shadow effect. The \"cannot be cancelled\" is part of the When Revealed, which has no bearing on the shadow effect. If the shadow effect said \"cannot be cancelled\" then that shadow effect couldn't be cancelled, because cannot is absolute, but in turn that would have no bearing on the When Revealed.\n\nAnyway, on reflection, I think Wandalf may be right (though I'm not 100%). The past ruling I was vaguely remembering (which I can't actually find) was an instance where the inbility to cancel came from elsewhere rather than being on the card being revealed, which is a bit of a different case. That being said, strictly the text of The Door Is Closed! says \"cancel *its effects* aand discard it.\" So it's definitely arguable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3827125","commentId":3827125,"userName":"RogueSeventeen","timestamp":1573580242,"content":"I was just being a little facetious, I understand cannot is absolute on the When Revealed effect.  But just like with the shadow effect, nowhere does it say \"this encounter card cannot be cancelled,\" which is what The Master Ring targets.  So yea, I'm becoming more convinced you can do it..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3827306","commentId":3827306,"userName":"Wandalf the Gizzard","timestamp":1573589236,"content":"> 16 hours ago, PocketWraith said:\n> \n> The past ruling I was vaguely remembering (which I can't actually find) was an instance where the inbility to cancel came from elsewhere rather than being on the card being revealed, which is a bit of a different case.\n\nThis is likely the case. I was running off of memory as well (always comes back to bite me) and remembered some ruling allowing you to cancel an entire card by bypassing the \"uncancellable\" when revealed effect."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3829238","commentId":3829238,"userName":"Amicus Draconis","timestamp":1573767474,"content":"I was asking Caleb this week and got the following answer:\n\n \n\n> Quote\n> \n>  \n> \n> The text “cannot be canceled” is absolute. There is nothing in the game that lets you dodge that effect.\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\nI am not surprised at all, as The Door is Closed! cancels the effects on an encounter card after it has been revealed, in which case the When revealed is active, even if only for a short time."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3829423","commentId":3829423,"userName":"PocketWraith","timestamp":1573787775,"content":"That being said, in the specific case of Sacked! it might still work, because while you can't cancel the When Revealed, there's nothing to stop the second half of the sentence, which discards the card. This is actually directly comparable to the aforementioned previous ruling which I vaguely remember but can't find, where The Door is Closed! could be used to discard a revealed enemy even though encounter card effects couldn't be cancelled. It may still be debatable in this case though because the timing is weird."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302063-the-master-ring-and-sacked/?do=findComment&comment=3849890","commentId":3849890,"userName":"Boromore","timestamp":1576501310,"content":"Sections 1.53 and 1.54 in the FAQ ( https://images-cdn.fantasyflightgames.com/filer_public/1d/bb/1dbb319c-6b1e-466e-9177-75a5857b5cfa/lotr_faq_19_printer_friendly.pdf [https://images-cdn.fantasyflightgames.com/filer_public/1d/bb/1dbb319c-6b1e-466e-9177-75a5857b5cfa/lotr_faq_19_printer_friendly.pdf] ) give a bit more clarity, but unfortunately do not nail the \"Cannot\" issue. "}]}