{"url":"https://community.fantasyflightgames.com/topic/302328-the-best-worst-start/","title":"The best worst start","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/302328-the-best-worst-start/?do=findComment&comment=3829495","commentId":3829495,"userName":"TheSpitfired","timestamp":1573806927,"content":"I had to share this story because it made me laugh all game.\n\nI sat down with two friends to start our journey into the Mirkwood cycle at 3 players. Hunt for Gollum first. We get all set up and ready to go. For those that may not know you start the quest by revealing one card per player and placing it in the encounter area.\n\nEasy enough right?\n\nThe first card revealed, Old Wives Tales. You have to discard a resource from every hero and each hero who can’t is exhausted. So that happened.\n\nSecond card a location, no big deal. \n\nThird card, Massing at Night, 3 more cards being drawn.\n\nAnother location, Pursued by Shadow (increase threat by one for each character not committed to the quest), Eastern Crows (surge), Hunters from Mordor.\n\nWe start the quest with all nine heroes exhausted and nine threat in the staging area. The first round even with allies we could bring in we quested rather unsuccessfully and each of our threats went up by 9.\n\nWe fought it tooth and nail. We almost cleared the second stage but eventually we were done in via threat. It was so much fun. It really was, we were laughing about it the whole time as we did the best we could. I don’t think I’ve ever had a start that bad.\n\nWhat a fun game!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/302328-the-best-worst-start/?do=findComment&comment=3829545","commentId":3829545,"userName":"General_Grievous","timestamp":1573815492,"content":"That's great hahaha.\n\n \n\nSometimes you get those chain encounter deck runs that just obliterate you haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/302328-the-best-worst-start/?do=findComment&comment=3830291","commentId":3830291,"userName":"Amicus Draconis","timestamp":1573903472,"content":"Now imagine drawing three Signs of Gollum, each guarded by Hunters of Mordor."}]}