{"url":"https://community.fantasyflightgames.com/topic/302870-elf-stone-and-ranger-provisions-with-burglars-turn/","title":"Elf-Stone and Ranger Provisions with Burglar&#039;s Turn","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/302870-elf-stone-and-ranger-provisions-with-burglars-turn/?do=findComment&comment=3839210","commentId":3839210,"userName":"nvbostwick","timestamp":1574987371,"content":"Looking for a ruling on how the cards Elf-Stone and Ranger Provisions work with the new Burglar's Turn contract. When would you get those card effects? I can see it happening as soon as the active location is explored? Or does it need to attach to another location after the active is explored and then when that subsequent location is explored you gain the benefits. Just looking for some clarity. Thanks!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/302870-elf-stone-and-ranger-provisions-with-burglars-turn/?do=findComment&comment=3841059","commentId":3841059,"userName":"Halberto","timestamp":1575309729,"content":"I would say after the location they were attached to, as consequence of having been put into play via contract effect, is explored. So when the  subsequent location is dealt with. The first time they are guarded attachment and enter into play when the guardong location is explored. At that point they are put into play for free and attached to a new eligible location. When this new location is explored the cards effect trigger. \n\nBut this contra t is not so clear as the others in term of its text and the connected interaction.  \n\nIf the ruling is different then it would be a nice boost to the contract. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/302870-elf-stone-and-ranger-provisions-with-burglars-turn/?do=findComment&comment=3841219","commentId":3841219,"userName":"GrandSpleen","timestamp":1575319913,"content":"Since the elf-stone or ranger provision card is effectively a guarded attachment, I don't think their card text would apply when the attached location is explored. \n\nIf memory serves, a related ruling would trap attachments on Nameless Thing enemies in Foundations of Stone. I believe the traps, although attached to the enemy, do not function in that case."},{"commentUrl":"https://community.fantasyflightgames.com/topic/302870-elf-stone-and-ranger-provisions-with-burglars-turn/?do=findComment&comment=3841401","commentId":3841401,"userName":"dalestephenson","timestamp":1575338075,"content":"Agreed, they would either be put into play on a (different) location or added to the Burglar's hand."}]}