{"url":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/","title":"Conflict at the Carrock","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/?do=findComment&comment=3843978","commentId":3843978,"userName":"Markspinner","timestamp":1575656055,"content":"Spoilers Ahead!\n\nNew LOTR player here and wow is this tough!  I thought I was kicking butt and was thinking wow how is this rated 7 difficulty.  Then the four trolls with 10 health appear and absolutely stomp me!  Their crazy abilities are nothing to sneeze at either.  And I thought AH LCG had some rough scenarios!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/?do=findComment&comment=3844447","commentId":3844447,"userName":"Wandalf the Gizzard","timestamp":1575729595,"content":"Yup, LotR has quite a few of those \"Wait what!\" moments! Haha!\n\nConflict at the Carrock is a classic though, at least for me. Do you want any strategy tips?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/?do=findComment&comment=3844505","commentId":3844505,"userName":"player3351457","timestamp":1575738831,"content":"As you play the game some more, many scenarios have some nuances that you can pick up on. One thing the Conflict teaches you is that if you see a quest card with a \"just quest on through\" and \"set aside these enemies\" that you might be in for a battle at the end, so prepare accordingly. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/?do=findComment&comment=3844569","commentId":3844569,"userName":"Fredmans74","timestamp":1575746847,"content":"I learned the hard way to appreciate these wtf moments. When you beat those scenarios you simultaneously take your play and deckbuilding to a new level. Conflict at the Carrock was my first hurdle, and it made me a much better player and I felt so good for beating it. I just beat Siege of Cair Andros for the first time, so the game has several more scenarios of this kind.\n\n/Fredmans"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303116-conflict-at-the-carrock/?do=findComment&comment=3845128","commentId":3845128,"userName":"Vince79","timestamp":1575832952,"content":"Here's another thread I started awhile back about this scenario, maybe you could pick up some tips there:\n\nhttps://community.fantasyflightgames.com/topic/291789-conflict-at-the-carrock/?tab=comments#comment-3639641 [https://community.fantasyflightgames.com/topic/291789-conflict-at-the-carrock/?tab=comments#comment-3639641]\n\nFunny thing is, I don't remember writing that, and I very much doubt I would use that particular deck now, the way it's set up.  I was pretty much of a newb at the time (still am, I guess, but I'm getting the hang of it).  The main thing I remember (I think) was trying to keep the threat low and not letting all the trolls jump me at once.  I find Wandalf gives pretty good advice, so I'd listen to him.\n\nI play solo progressive style, so all those cards would have been available at the time of the scenario's release.  "}]}