{"url":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/","title":"The Ithryn Luin","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3845868","commentId":3845868,"userName":"Ely Hill","timestamp":1575943619,"content":"Hello, LOTR LCG community! I am a long time player from the cardboard gen, and have kept up collecting expansions on this fantastic game! I currently am missing only some of the POD stuff. I love how well the designers have matched most of the game mechanics with the theme. On that note, I would like to share my thoughts for some custom Istari cards that I think do justice to the order, and fit in with the way the Istari trait has been developing. Of course we will never see the two blues because of copyright stuff, but I believe these would be great for personal fun and creativity. If some one out there with some time, internet access, and artistic skill (all of which I am very limited at currently) wanted to create printable versions of these cards I would be ecstatic. Here they are:\n\nLore Hero  *Pallando\n\nIstari\n\n(10) Threat 2 Willpower 1 Attack 3 Def. 4 Hit Points. \n\nWhile playing a card with the printed secrecy keyword, Pallando gains the printed Leadership, Spirit, and Tactics icons. \n\nResponse: After you play an event card with the printed secrecy keyword ready Pallando. \n\n\"Wilt thou learn the lore that was long secret of the Five that came from a far country?\" - Unfinished Tales\n\nNeutral Attachment   *Palando's  Staff \n\nCost 2\n\nArtifact, Item, Staff.\n\nAttatch to Pallando.\n\nAction: Exhaust Palando's Staff to (choose one): Treat your threat as it were 20 when playing the first card this phase, or search the top 5 cards of your deck for a card with the printed secrecy keyword and add it to your hand. (Shuffle your deck.)\n\nTactics Hero *Alatar\n\nIstari\n\n(10) Threat 2 Willpower 3 Attack 1 Def. 4 Hit Points. \n\nWhen you play a card with the printed guarded keyword, Alatar gains the printed Leadership, Spirit, and Lore icons.\n\nResponse: After you play a card with the printed guarded keyword, Alatar does not exhaust to quest this round.\n\n\"Their task was to circumvent Sauron.\" -The Peoples of Middle-earth\n\nNeutral Attachment  *Alatar's Staff\n\nCost 2\n\nAttatch to Alatar.\n\nAction: Exhaust Alatar's Staff to (choose one): Place 2 progress tokens on a non-unique location guarding a card, deal 2 damage to a non-unique enemy guarding a card, or lower the (threat) of each encounter card guarding a card by 2 till the end of the phase. \n\nNeutral Event:  Rods of the Five Wizards\n\nCost 1\n\nSpell.\n\nAction: Search your deck for a STAFF card and attach it to an eligible Istari character in play.  Shuffle your deck. \n\n\"Are we not both members of a high and ancient order, most excellent in Middle-earth?\" -Saruman, The Two Towers\n\n \n\nKeep in mind where and where there is not printed vs. not printed keywords or keyword vs. no keyword. It matters in interactions with cards like 'Leaf Brooch' or 'Noiseless Movment' for example. These wizards could give some help to often under used or underappreciated keyword archtypes, like the new Saruman is going to do for Doomed. Also, I believe the two character's match thematically to what little we know about them. Anyway, any comments or suggestions from all you fellow players would be appreciated. Long live the game!\n\n \n\nEdited December 20, 2019 by Ely Hill\nSphere Edit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3846970","commentId":3846970,"userName":"Tyrion Gru","timestamp":1576085914,"content":"Me likey! As a MECCG player, it would be nice to see the two Blue Wizards on the table. Perhaps the \"Long Extended Party\" project Seastan and others are working on would be interested in these two guys.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3847008","commentId":3847008,"userName":"AllWingsStandyingBy","timestamp":1576088247,"content":"Just for the nostalgia of the Middle-Earth CCG, it'd be neat to see Alatar and Pallando.\n\nI love how you've kept the \"Alatar the Hunter\" theme from the Middle-Earth CCG, and having him play with Guarded cards as a sub-theme is an excellent way to get at that, especially since outside of a Burglar's Turn most people view Guarded Cards as generally unplayable (or, at least, as \"win more\" cards).  I think, though, I'd make him Tactics instead of Leadership, given that the theme of hunting down beats and enjoying the kill, which just feels more like Tactics than Leadership to me.  The idea you have for his staff is simply splendid!\n\nSecrecy is a neat mechanic for Pallando, as I've always struggled to see how \"The Soul-Keeper\" could be best implemented.  The fact that he basically disappears is a nice tongue-in-cheek nod to Secrecy, if nothing else.  My attempts at representing Pallando have tired to play with his old ME-CCG mechanics of having a bigger hand size, and a mechanic that deals with increased starting hand or better card-draw sort of suits that Gray Havens Noldor theme (which is also neat since MECCG had the Gray Havens as Pallando's home site).  That said, I never landed on anything that felt all that workable.\n \n\nEdited December 11, 2019 by AllWingsStandyingBy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3848000","commentId":3848000,"userName":"General_Grievous","timestamp":1576182496,"content":"Fantastic ideas! And I really love the themes/keywords that needed help and you are rocking with these two and their appropriate staff items. I still haven't given up hope for them this cycle though because:\n\na.)so much fan service and long-requested heroes have been released and these guys and spirit Aragorn are the only massively requested heroes still missing\n\nb.) the accurate so far hints posted on this forum mentioned a hero with two faces or sides which duality hero pairs are basically sons of elrond or blue wizards and we have the former \n\nc.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3852670","commentId":3852670,"userName":"Ely Hill","timestamp":1576804610,"content":"After careful consideration, I had to agree with All Wings Standing By. The primary reason for having Alatar be Leadership was because of the reaction between him and The King Return. However, in retrospect Tactics fits him better for several reasons: The Kings Return doesn't make sense thematically, he now would be a good hero to couple with Radagast for those expensive tactic creatures and events like Gwahir's Debt, and it makes perfect sense thematically with Alatar being the \"Darkness Slayer.\" Anyway, the post has been edited to reflect this. Thank you for your imput. I would love to see these two as official cards by the end of Vengance of Mordor, but am pretty dubious. Either way, I think most if not all of us would love playable verisions of these two blues."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3852730","commentId":3852730,"userName":"AllWingsStandyingBy","timestamp":1576811214,"content":"> 1 hour ago, Ely Hill said:\n> \n> I would love to see these two as official cards by the end of Vengance of Mordor, but am pretty dubious.\n\n\nSadly, I think there's pretty much a 0% chance of this happening.\n\nWe know there's only two heroes left unknown in the cycle, and they are likely one tactics and one spirit character.  Most people are betting on the Spirit Hero being Aragorn, so that he has options in all four spheres.\n\nEven then, Alatar and Pallando are, as I understand it, creations of Iron Crown Enterprises back in the mid-late 90s when they had the license to Tolkien's works (inlcuding, importantly, the Simillarion and the Kudak Tales, neither of which I suspect FFG has the rights to -- or at least, they haven't used any flavor text or IP from those properties yet).  While FFG has certainly been allowed to create some of their own characters for the LCG (e.g. Bereavor, Thurindir, Gleowine, Brok Ironfist, etc etc etc), I dunno how likely it is they'd be able to create Blue Wizards.\n\nI'm actually kinda hoping that we see one of the fallen \"blue wizards\" appear as an Encounter enemy this cycle, since I think both blue wizards were said to have wandered East and basically vanished.  IF that were to happen in the next few adventure packs, that'd increase the odds of getting a Blue Wizard hero as a \"redeemed\" encounter enemy, but it's probably a long shot.\n\nEdited December 20, 2019 by AllWingsStandyingBy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3852793","commentId":3852793,"userName":"Kjeld","timestamp":1576819892,"content":"> 2 hours ago, AllWingsStandyingBy said:\n> \n> Even then, Alatar and Pallando are, as I understand it, creations of Iron Crown Enterprises back in the mid-late 90s when they had the license to Tolkien's works (inlcuding, importantly, the Simillarion and the Kudak Tales, neither of which I suspect FFG has the rights to -- or at least, they haven't used any flavor text or IP from those properties yet).  While FFG has certainly been allowed to create some of their own characters for the LCG (e.g. Bereavor, Thurindir, Gleowine, Brok Ironfist, etc etc etc), I dunno how likely it is they'd be able to create Blue Wizards.\n\nTolkien named them Alatar and Pallando in Unfinished Tales, though in his later writings (published in Peoples of Middle Earth) he also names them Morinehtar and Rómestámo. In any case, FFG doesn't have the rights to either of those publications, I don't believe.\n\nAs a final note, I.C.E. used \"Kuduk lore\" to refer to their own inventions. Kuduk is another name for Hobbits.\n\nEdited December 20, 2019 by Kjeld"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3852950","commentId":3852950,"userName":"Amicus Draconis","timestamp":1576848635,"content":"But FFG uses names like Cobas Haven, Framsburg, Andrath and Khâmul, which are all taken from Unfinished Tails."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3853165","commentId":3853165,"userName":"Kjeld","timestamp":1576861820,"content":"> 3 hours ago, Amicus Draconis said:\n> \n> But FFG uses names like Cobas Haven, Framsburg, Andrath and Khâmul, which are all taken from Unfinished Tails.\n\nWell, in that case, maybe we will see the Blue Wizards!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3853640","commentId":3853640,"userName":"General_Grievous","timestamp":1576901307,"content":"It's that card with two faces hint, telling you it's got to be them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3853842","commentId":3853842,"userName":"Ely Hill","timestamp":1576941976,"content":"I sure hope you are right General. My best guess is a Wilyador Tactics hero and a double sided Spiragorn/ King Elessar Hero"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989466","commentId":3989466,"userName":"Ely Hill","timestamp":1600308625,"content":"So I was finally able to figure out strange eons. I made these cards and a few others I thought were missing from the meta-collection.  Some of the art I was not able to discover the artist on however, so I improvised. \n\nA-High-and-Ancient-Order-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/A-High-and-Ancient-Order-Front-Face.jpg.adf42da4f8ad7bf2fe73d3f3d8fec33e.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/A-High-and-Ancient-Order-Front-Face.jpg.adf42da4f8ad7bf2fe73d3f3d8fec33e.jpg]\n\nAlatar-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/Alatar-Front-Face.jpg.73289f0800badf5405f7581174a801cd.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/Alatar-Front-Face.jpg.73289f0800badf5405f7581174a801cd.jpg]\n\nAlatar's-Staff-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/1622801357_Alatars-Staff-Front-Face.jpg.c572b5285e6f22154d29ea412339edc7.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/1622801357_Alatars-Staff-Front-Face.jpg.c572b5285e6f22154d29ea412339edc7.jpg]\n\nGoldberry-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/Goldberry-Front-Face.jpg.d4a2b484e0178d375959a641f3f59ad7.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/Goldberry-Front-Face.jpg.d4a2b484e0178d375959a641f3f59ad7.jpg]\n\nHúrin-the-Tall-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/1536703821_Hrin-the-Tall-Front-Face.jpg.ec51d19a27d04ef6303e294b30d340f2.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/1536703821_Hrin-the-Tall-Front-Face.jpg.ec51d19a27d04ef6303e294b30d340f2.jpg]\n\nPallando-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/Pallando-Front-Face.jpg.e53712bfdac96135b56882ffb9097ad8.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/Pallando-Front-Face.jpg.e53712bfdac96135b56882ffb9097ad8.jpg]\n\nRods-of-the-Five-Wizards!-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/Rods-of-the-Five-Wizards!-Front-Face.jpg.f3a22a37fb8743f1305c368d5295412c.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/Rods-of-the-Five-Wizards!-Front-Face.jpg.f3a22a37fb8743f1305c368d5295412c.jpg]\n\nWarden-of-the-Keys-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/Warden-of-the-Keys-Front-Face.jpg.a257730e4d0850b6381480b3fbdc561a.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/Warden-of-the-Keys-Front-Face.jpg.a257730e4d0850b6381480b3fbdc561a.jpg]\n\nWídfara-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/345242496_Wdfara-Front-Face.jpg.065de703825e921ff7409dd1d6740d23.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/345242496_Wdfara-Front-Face.jpg.065de703825e921ff7409dd1d6740d23.jpg]\n\nPallando's-Staff-Front-Face.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_09/3034307_Pallandos-Staff-Front-Face.jpg.773e2c6a9e856723d1e78e23a2568e9e.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_09/3034307_Pallandos-Staff-Front-Face.jpg.773e2c6a9e856723d1e78e23a2568e9e.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989688","commentId":3989688,"userName":"Felswrath","timestamp":1600353586,"content":"I like these a lot, but I feel that Widfara should be nerfed somehow. Either he should cost 4, or he should lose the affect about all Rohan heroes being able to pay for him."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989693","commentId":3989693,"userName":"LoPocket","timestamp":1600354016,"content":"Love these ideas! Any chance you have the high quality versions of them so I can print them out?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989701","commentId":3989701,"userName":"Alonewolf87","timestamp":1600355136,"content":"Rods of the Five Wizards should have a limitation like \"play only if you control an Istari hero\", or \"attach to an eligible Istari character you control\" otherwise in multiplayer you could put the Staffs in other players deck and a full deck search for 1 neutral resource and basically no limitations (unlike Word of Command) is definitely too powerful.\n\nAn High and Ancient Order is too powerful, especially at 0 cost (and combined with cards like Steward of Gondor). Perhaps you could have it cost 1 and worded (in a better way) like this \"choose an exhausted Staff attachment you control. Choose one of its options not yet chosen this round and apply it\".\n\nPallando, Alatar and their Staffs seems okay.\n\nWidfara should have 2 Attack OR cost 4.\n\nGoldberry is put into play with its Quest Action for free?\n\nHurin and Warden of the Keys seems good.\n\n \n\nEdited September 17 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989809","commentId":3989809,"userName":"dalestephenson","timestamp":1600365204,"content":"Alonewolf, I'm not sure why you think Rods of the Five Wizards needs nerfing.  It can only pull a staff, so the fact it can do a full deck search isn't overpowered, and how is it a problem if a non-Istari deck in a fellowship finds a staff in the exact same way an Istari deck would find a staff?\n\nAgree High and Ancient Order is very cheap for its effect, though it at least can't be recurred.\n\nI like Pallando's secrecy angle, but I'm less keen on Alatar's Guarded angle.  The Guarded player attachments tend to be unique and are not that numerous, so outside quests where the encounter deck produces plentiful guarding I don't know how effective Alatar would be.  Tactics also takes away Word of Command, which works with all other wizards.  I think making him Valour-friendly might be interesting, especially with Hurin.\n\nAgree Widfara is underpriced.  I agree leaving out Widfara is a huge miss, I was hoping for him as a lore Rohan hero.\n\nWith Goldberry's quest action, couldn't she be put in a non-hobbit deck?  She isn't really being played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989823","commentId":3989823,"userName":"Alonewolf87","timestamp":1600365980,"content":"> 19 minutes ago, dalestephenson said:\n> \n> Alonewolf, I'm not sure why you think Rods of the Five Wizards needs nerfing.  It can only pull a staff, so the fact it can do a full deck search isn't overpowered, and how is it a problem if a non-Istari deck in a fellowship finds a staff in the exact same way an Istari deck would find a staff?\n\nBecause it's also putting it into play for free (so saving 2 resources) so in general I think there should be some more limitations to it*. The fellowship part was more of a secondary consideration, but still the deck space saved can be quite important for a deck which plays a couple of Istari hero.\n\n*Like Raise the Shire has both the \"engagement cost lower than your threat\" (for the full deck search) and only hobbit allies limitations to it. And it's only a temporary staying in play for the ally (which might be a benefit I know).\n\n \n\nEdited September 17 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989883","commentId":3989883,"userName":"dalestephenson","timestamp":1600371909,"content":"I missed that it was also putting the card into play.  If I really, really wanted the Staff (certainly the case for Saruman or Radagast, and would also be the case for Pallando's staff) I'd probably run three of this card (and only a single copy of the actual staff unless the quest has attachment-hate) even if it costs 2 with it playing the staff for free.  Discount on the staff *and* finding it anywhere in the deck is a fantastic deal, and I agree it's undercosted.\n\nKeeping it undercosted, but prohibiting a non-Istari deck from taking advantage of it strikes me as a minor nerf that would affect a minority of users.  Yes, Istari toys can use deck space, but one of the benefits of a dedicated fellowship is spreading out the toys to get combos together more quickly-- why punish only that case, and only for that attachment?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3989913","commentId":3989913,"userName":"Alonewolf87","timestamp":1600375274,"content":"> 56 minutes ago, dalestephenson said:\n> \n> Keeping it undercosted, but prohibiting a non-Istari deck from taking advantage of it strikes me as a minor nerf that would affect a minority of users.  Yes, Istari toys can use deck space, but one of the benefits of a dedicated fellowship is spreading out the toys to get combos together more quickly-- why punish only that case, and only for that attachment?\n\nYou might be right.\n\nPerhaps a mix of the two ideas like Cost 4 and \"reduce the cost of playing this card by 1 for each Istari hero you control\"?\n\nEdited September 17 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/303211-the-ithryn-luin/?do=findComment&comment=3990001","commentId":3990001,"userName":"Ely Hill","timestamp":1600390186,"content":"It has been fun to read the comments so far, and I appreciate everybody's input. It is nice to get some different perspectives on these custom cards. I have already nerfed a few cards based on your suggestions:\n\nA High and Ancient Order was I card that I thought should be particularly special, because it invokes a power only a character with the Istari trait has. However, as Alonewolf pointed out, its' being able to ready cards like Steward (which is already OP) or Unexpected Courage is to much. Accordingly I have limited it to reading only Item or Artifact Attachments.  \n\nGoldberry was ambiguous on whether or not her resource cost must be met. I have added Quest Action: Pay Goldberries' resource cost to  \n\nWidfara was underpriced and that was something I wanted to get the communities input on. I wanted him to be Spirit, but to be accessible to all Rohan decks, especially Leadership (as Rohan is somewhat weak in that area).  He now is priced at 4 resources.  \n\nI am still not convinced Rods is OP. Essentially you are exchanging a card draw and a neutral resource for a directed card draw and two resources. Coupled with the probability that you include several copies in your deck which uses extra deck space, and also if you have a Staff in your hand Rods does not target it and so can  easily become a dead card.  \n\nI would appreciate more feed back on any of these cards or ideas you may have about the nerfs I have presented. Thanks to strange eons the cards are easy to update based on suggestions. \n\nAlso, I would be happy to share files with you BobbyMcBobface if you contact me directly I will provide you with contact information. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\n     \n\nEdited September 18 by Ely Hill\nMissing Information"}]}