{"url":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/","title":"Help me understand the Dwarrowdelf situation","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859062","commentId":3859062,"userName":"rogertravisjr","timestamp":1577795727,"content":"Couldn't FFG easily reprint this cycle? Just by itself? \n\nCould we pay them up front?\n\nThese cards are so darn essential to nearly every good deck. It's soul-crushing to see them listed on Amazon for $40 each."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859394","commentId":3859394,"userName":"icabod","timestamp":1577827255,"content":"Yes, they could easily reprint this cycle, and indeed they did earlier this year, along with many other cycles."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859516","commentId":3859516,"userName":"TheSpitfired","timestamp":1577838025,"content":"It has been my experience that about the time you decide you want to buy a particular cycle it goes out of stock. Hang tight and stay vigilant. When I decided earlier this year that I wanted to complete my collection I pretty much had to watch this site, my FLGS and several others every day. Especially with some packs and cycles they will appear and disappear in less than 24 hours. Just ask anyone trying to get The Steward's Fear. I'd say it took about 4-5 months but I was able to get everything I didn't have and never for more than MSRP.\n\nFor what it's worth at the moment of this posting Road to Rivendell and The Long Dark are available now in the FFG store. So you can get your Khazad-Dum cycle 1/3rd done if you really want."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859612","commentId":3859612,"userName":"Vince79","timestamp":1577856607,"content":"> 5 hours ago, TheSpitfired said:\n> \n> For what it's worth at the moment of this posting Road to Rivendell and The Long Dark are available now in the FFG store. So you can get your Khazad-Dum cycle 1/3rd done if you really want.\n\nAnd if you want it, I would suggest doing so.  Get what you can, as it comes up.\n\nAnother thing you can do is go to the bigger online retailers and sign up to be notified if a certain product comes in stock."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859630","commentId":3859630,"userName":"John Constantine","timestamp":1577865826,"content":"The Long Dark awaits."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859672","commentId":3859672,"userName":"rogertravisjr","timestamp":1577879631,"content":"To be clear, I did pick up Road to Rivendell and the Long Dark last week. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]\n\nThanks for the encouragement."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3859899","commentId":3859899,"userName":"Thaeggan","timestamp":1577917436,"content":"Currently sitting on 4 expansions that are all missing 1 adventure pack from each. As had happened for every other expansion I bought before for the LCG.\n\nI pulled the trigger on getting the remaining 4 deluxe expansions and cycles and their cycles because I'll be buying them eventually anyways and might as well get them now. Sadly, 2 of  the adventure packs I need are currently in stock on the FFG page and 2 of them are not. Seeing as how I won't be playing the cycles soon because my group is not playing enough, I'm waiting for them to go on other board game sites that are cheaper in the base price and shipping.\n\nAlways a hassle buying from FFG. I even wanted to buy the figure pack for Journeys in Middle Earth and of course when I looked, it was out of stock for about a month."},{"commentUrl":"https://community.fantasyflightgames.com/topic/303878-help-me-understand-the-dwarrowdelf-situation/?do=findComment&comment=3860366","commentId":3860366,"userName":"bdavis969","timestamp":1577988580,"content":"Early 2019 was a good time to finish up getting all the packs. This is what I found finishing up my set:\n\nThere is no FLGS around in my area that carries LOTR LCG (TCG) and I don't frequent them enough to get them to start carrying it.\n\nTrying to buy non-preorder from FFG becomes pretty expensive with shipping costs, if you care about keeping costs low. On the other hand, buying preorder sets like The Vengeance of Mordor can be nice. FFG/Asmodee doesn't charge shipping or tax (I am guessing if you are outside of MN) with preorder sets and these sets are coming with bonus art cards with the preorder.\n\nAmazon is good if a particular cycle is available because usually most packs are below msrp and a third party is usually in-line with Amazon (so you get the same cost but don't have to pay sales tax). I have been seeing Amazon and eBay charging tax now, so maybe escaping sales tax isn't available anymore.\n\nIn the end, surprisingly eBay became a go to for multi-pack purchases. A lot of packs on eBay are listed under msrp ($12 range), but have $3 - $5 shipping, so it brings a single pack cost above msrp. If you find 2+ packs that you need, a lot of times the shipping price doesn't change (or changes very minimally). So there were several times I bought 4, 5, or 6 packs at a time at lower than msrp ($12ish) and the shipping cost spread across that many packs kept cost below msrp ($13ish) and eBay wasn't charging sales tax in early 2019.\n\nJust keep at it. I think I had the same frustration in 2017/2018, seeing packs from Shadows of Mirkwood and Dwarrowdelf way above msrp. Hopefully they reprint soon. I did a quick search and the other four packs are $30+ on eBay."}]}