{"url":"https://community.fantasyflightgames.com/topic/304774-2-years-of-vision-of-the-palantir-thank-you/","title":"2 years of Vision of the Palantir, Thank you!","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/304774-2-years-of-vision-of-the-palantir-thank-you/?do=findComment&comment=3876151","commentId":3876151,"userName":"Durins_Father","timestamp":1579625195,"content":"Hi all, \n\nToday I celebrate the fact that I started the Vision of the Palantir blog 2 years ago. I am pleased to see this project grow to what it is today, including scenario analyses, archetype overviews, player card analyses, and helpful articles to players new and old. Thanks to so many of you, I have had the motivation to carry on with the blog through some difficult times, and I am looking forward to where the blog will go to during the next year of its life. I hope to round out 2 more cycles of normal quests, and the first cycle of Nightmare quests, and will see what else will be created along the way. In this article [https://visionofthepalantir.com/2020/01/21/second-year-anniversary/] I go around thanking everyone, but I hope to meet some of you along the way in person at events or if anyone happens to wander into my neck of the woods (NL, hit me up for some games!). \n\nI'll also would like to ask you to visit this link [https://www.patreon.com/bePatron?u=7631819]to see how you can contribute to the blog's efforts. I am currently working on plans for making this year's loot, but with several Patrons dropping the game, the part of the funding might have to come out of my own pocket. So if you want to support the blog and get some of the epic loot that I will be making before the summer is over (if everything is going to plan), then check out the Patron site [https://www.patreon.com/bePatron?u=7631819] and its reward tiers. Your support in comments and views on the blog is not to be understated either, it has really helped me to continue this project when quiting it would have been so much easier. Big thanks to everyone here, and I hope to meet on the road ahead. \n\nDurins_Father"}]}