{"url":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/","title":"Fantasy Flight created heroes","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876134","commentId":3876134,"userName":"rhtm70","timestamp":1579623108,"content":"     I was wondering if anyone has seen an article or explanation as to why Fantasy Flight decided to create I guess what would be considered non-lore heroes for the game instead of just using characters from the books. For instance, instead of Thalin why not make him Fili or Kili? Or have Rumil or Orophin as heroes instead of just allies?\n\n     I can understand in the case of female created heroes as there aren't that many named female heroes in the books they are allowed to use. Anyway, I'm not complaining as I love this game and what they've done with it (except for location lock haha), it's just out of curiosity about how these decisions are made.\n\nThanks in advance!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876142","commentId":3876142,"userName":"Kjeld","timestamp":1579624020,"content":"Most of the FFG-created heroes are used to flesh out peoples that do not necessarily have a named representative in the official lore. So, for example, we have heroes like Kahliel and Haldan to represent Harad and Woodmen. Several of the characters -- including Thalin, Eleanor, Argalad, and Beravor -- are taken from FFG's Middle-Earth Quest game. Still others, like Rossiel (Silvan), Lanwyn (Dale), or Amarthiul (Dunedain) allow the game designers to introduce novel gameplay mechanics that don't necessarily line up well with named characters from the lore. Rossiel represents, more or less, an apprentice to the Lady Galadriel and is skilled in elven magic -- we don't see a Tolkien-created character like that, but it is within the lore to assume that such a character may have existed. Likewise, there is no named Dale scout, so we have Lanwyn.\n\nOn the whole, I think that FFG has done a very good job managing its own additions to the LotR lore. They mostly are natural extensions of Tolkien canon, filling in gaps and giving us a glimpse into the more obscure corners of Middle Earth and its people."},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876150","commentId":3876150,"userName":"rees263","timestamp":1579625173,"content":"Another consideration for this is the uniqueness rule. Without new characters the existing characters would need to be reused more often and you would run into more conflicts which could limit deck building options."},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876166","commentId":3876166,"userName":"EBerling","timestamp":1579626424,"content":"For what it's worth, I really appreciate the FFG-created heroes, and they are some of my favorite characters to run.  For me, it's easier to build my own internal \"head-canon\" around the idea of some less-known heroes forming a company and going on lots of adventures around the huge sandbox that is Middle-Earth.   There are so many peoples and places in Middle-Earth that it helps make the world feel bigger, more interesting, and more well-built when unknown characters get to play in it.  If the same two dozen Kings/Queens/Princes/Wizards (plus a half-dozen Hobbits) are the only people doing anything in the world, it starts to suffer from that original Star Wars Extended Universe syndrome where the same four characters are at the heart of every single noteworthy event in the entire galaxy, which becomes as preposterous as it is boring.\n\n\nTo that end, I love seeing newly created Heroes, unique allies, and objective allies/enemies appear in the game, and given that I certainly do not feel like this game was anywhere near running out of new content that I'd enjoy seeing, since I'd be as exited about an entire cycle of Thurindirs, Bereavors, and Thalins as I am about seeing Saruman or Smeagol.  New content is new content!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876307","commentId":3876307,"userName":"General_Grievous","timestamp":1579635353,"content":"As the others said above it's partially the lack of female heroes in the lore (though why no Rosie Cotton and Ioreth??!), continuing other FFGs games characters, and to help with uniqueness and options in multiplayer. I would add that they also allow for some great storytelling devices as nothing like having an objective ally or enemy become a hero you eventually get, fulfilling their narrative roles and evolving them into a permanent hero in your group (well if you choose to use them).\n\nPersonally my third favorite hero in the game is Eleanor (gorgeous art that oddly looks like my wife + an amazing game-saving effect + decent defender + cool representation of Gondor nobility that we don't get to hear anything about and bam she became one of my favorite characters, even over the few strong female characters we have in the lore)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876385","commentId":3876385,"userName":"phillos","timestamp":1579639012,"content":"To be fair they've done a good job of covering book characters as well.  You gotta scrape down hard to find a book character that hasn't at least been included as an ally.  I like that we have original characters in this game since it makes the setting feel bigger.  If you could only pick from book characters then that means there are no other heroic characters around to do some of these none Saga quests, which would seem odd.\n\nEdited January 21 by phillos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876455","commentId":3876455,"userName":"Amicus Draconis","timestamp":1579643532,"content":"> 4 hours ago, EBerling said:\n> \n> ... it starts to suffer from that original Star Wars Extended Universe syndrome where the same four characters are at the heart of every single noteworthy event in the entire galaxy, which becomes as preposterous as it is boring.\n\nI still love most of the old EU stories (I cannot say the same about Disney's work). I can understand your opinion, but I have grown rather attached to Han, Luke and Leia and other lesser known characters like Mara and Corran. And it is no surprise that these characters appear in many stories: Luke is the new Jedi Grand Master and Leia Head of State of the New Republic. And besides, there is at least on major event where the original trio hardly played any role: The Liberation of Coruscant in 6ABY."},{"commentUrl":"https://community.fantasyflightgames.com/topic/304772-fantasy-flight-created-heroes/?do=findComment&comment=3876592","commentId":3876592,"userName":"rhtm70","timestamp":1579656204,"content":"I agree they've done a good job on the original characters. I was asking more from a design perspective on the choice to include those and some of you have given some good answers. Thanks for the responses!"}]}