{"url":"https://community.fantasyflightgames.com/topic/304847-crazy-cob/","title":"Crazy Cob","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/304847-crazy-cob/?do=findComment&comment=3877499","commentId":3877499,"userName":"Vince79","timestamp":1579740671,"content":"This spider enemy from the Flies and Spiders scenario says:\n\n\"When Revealed: This enemy attacks the character with the most poison attached.\"\n\nWhat if no characters have any poison attached?  Does no one get attacked, or do you just pick somebody to get attacked?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/304847-crazy-cob/?do=findComment&comment=3877506","commentId":3877506,"userName":"stimpaksam","timestamp":1579741884,"content":"This was in the FAQ Page 15:\n\nQ: If there are no characters with poison attached when Crazy Cob (OtD 29) is revealed from the encounter deck, does it still make an attack?\n\nA: Yes. Since each character has 0 poison, the first player will choose which character Crazy Cob attacks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/304847-crazy-cob/?do=findComment&comment=3877600","commentId":3877600,"userName":"Vince79","timestamp":1579756490,"content":"Okay, thanks.  I have a follow up question related to the Flies and Spiders scenario.\n\nI had The Spider's Glade as the active location.  It says\n\n\"Forced: At the start of each quest phase, search the encounter deck for 1 Spider enemy and add it to the staging area.\"\n\nBut at the time, there was only one card left in the encounter deck, and it was not a spider.  What I did was I just didn't add a spider to the staging area.  Was that the correct call?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/304847-crazy-cob/?do=findComment&comment=3877618","commentId":3877618,"userName":"GrandSpleen","timestamp":1579758763,"content":"You were correct. If the deck is empty you need to shuffle it immediately, but the effect on Spider's Glade doesn't cause you to discard cards, so the deck would not get emptied. All you can do is look the 1 encounter card there, fail to find a spider, and then move on.  Ends up helping you as it shows you what card is coming up. Thanks, Spider's Glade!"}]}