{"url":"https://community.fantasyflightgames.com/topic/305066-a-bare-patch/","title":"A Bare Patch","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305066-a-bare-patch/?do=findComment&comment=3880529","commentId":3880529,"userName":"Vince79","timestamp":1580189832,"content":"Ran across this question playing The Lonely Mountain.  The card A Bare Patch from the encounter set states:\n\n\n\"Response: After the players quest successfully, the first player makes a burgle attempt. If successful, attach A Bare Patch to Smaug the Magnificent.\"\n\nHere's my question:  If I successfully burgle, do I have to take a treasure card from The Lonely Mountain?  Since A Bare Patch is an objective card, could it not perhaps be considered the treasure?  The only reason I ask is because the quest card for The Burglar's Turn specifically says to take a treasure if the burgle is successful, and A Bare Patch does not.  \n\nI'm guessing you have to take the treasure, but I thought it was odd that one card specifically points it out and the other does not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305066-a-bare-patch/?do=findComment&comment=3880636","commentId":3880636,"userName":"rees263","timestamp":1580217998,"content":"The burgle attempts for stage 2B and for A Bare Patch are completely separate.\n\nWhile you are on 2B you have to take a treasure if you are successful because that's what the forced effect on the quest card is telling you.\n\nOnce you have moved on to 3B you no longer have the ability to get more treasure. Instead, you may (responses are optional) make a burgle attempt in order to attach A Bare Patch to Smaug. This burgle will not get you any treasure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305066-a-bare-patch/?do=findComment&comment=3880968","commentId":3880968,"userName":"Vince79","timestamp":1580239422,"content":"> 5 hours ago, rees263 said:\n> \n> Once you have moved on to 3B you no longer have the ability to get more treasure. Instead, you may (responses are optional) make a burgle attempt in order to attach A Bare Patch to Smaug. This burgle will not get you any treasure.\n\nThat's actually the answer I was hoping for.  The On the Doorstep rulebook says burgling represents an attempt to steal treasure from the dragon's lair.  So I was thinking that might mean you have to take some treasure.  I guess in this case it represents Bilbo trying to find Smaug's weak spot.\n\nTo be honest, I don't really care about the treasure in this quest, even if some of them are pretty handy.  I'd rather have the reduced threat on The Lonely Mountain, and it only carries over into one more scenario anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305066-a-bare-patch/?do=findComment&comment=3881511","commentId":3881511,"userName":"rees263","timestamp":1580304620,"content":"A couple of them are really nice to have (Thror's Golden Cup and The Arkenstone). The others are pretty forgettable. Orcrist and Glamdring are much better."}]}