{"url":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/","title":"Rank the cycles (quest and story)","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3885865","commentId":3885865,"userName":"DunedainLoreKeeper","timestamp":1580774704,"content":"So I'm trying to figure out where to go back into the game after a break. I'm halfway through Harad, but so far the story and quests haven't really appealed to me. So, how do you rank the cycles you've played? Ignoring the player cards entirely. I have enough player cards to try out new decks, but I'm looking for the best quests in the game.\n\n \n\nHere's my list:\n\n1. Angmar Awakened (Favorite part of the lore, likeable allies, fun diverse quests, satisfying bossfight)\n\n2. Dream-chaser (Innovative sailing mechanics, pirates themed, dissapointing reveal of the mystery)\n\n3. Khazad-Dum (Feels very much like Moria, very close to the books, repeats the same story within the cycle, bs treachery's)\n\n4 Against the shadow (Some really cool quests, some boring ones, annoying mono-sphere treachery's)\n\n5 Haradrim (I'm only up to the second AP, nothing stoot out for me so far, does it get better?)\n\n6 Shadows of Mirkwood (Early development questionable design but also fun and memorable, Anduin still holds up as one of the best)\n\n7 Ring Maker (Story didn't grap me as cool as helping Saruman is, SO MANY COUNTERS AND TRIGGERS, such a mental chore to play)\n\n8 Hobbit Saga (Thematic at the cost of fun quest design, too gimicky)\n\n \n\nUnranked:\n\nLotR saga, Ered Mithril, Vengance of Mordor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3885885","commentId":3885885,"userName":"Vince79","timestamp":1580775993,"content":"Hmm, I've only played four of those, but I'll rank what I know:\n\n1.  Dwarrowdelf Cycle (You got the name wrong lol.  This was the highlight of the game for me, fun, thematic, all those dwarf cards).\n\n2.  Shadows of Mirkwood (Yeah, there's some flaws but the game hadn't gotten too fiddly yet).\n\n3.  Hobbit Saga (I agree too gimmicky but I liked the treasures and using Bilbo, I thought it was fun playing the stories from the book).\n\n4.  Against the Shadow (A little too fiddly for my taste, but the main reason I put this last is I felt like I was banging my head against a wall for almost the whole cycle.  Only one or two places to take a breather.  Others may like it for just that reason though).\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3885921","commentId":3885921,"userName":"Will Anderson","timestamp":1580779728,"content":"I think you've provided some good summaries there. Here are my thoughts:\n\n \n\n1. Lord of the Rings Saga – Almost all of the quests I consider good or great. Perfect realisation of theme without compromising on mechanics. Love the boons/burdens and fallen heroes, just wish there was even more of the campaign aspect.\n\n2. Dwarrowdelf – Much nostalgia for this cycle, even if there are some weaknesses in quest mechanics – and the general wrongness of investigating Moria before the LotR. But it does feel like Moria with its good use of locations, and if you have the Nightmare packs it holds up especially well.\n\n3. Angmar Awakened – Would rank this lower if I wanted to avoid teeth-gnashing, but overall the cycle's a win for showing us Arnor in all its darkness and throwing up formidable challenges. Escape from Mount Gram is the only loser for me in this one.\n\n4. Ered Mithrin – Varied quests with the right amount of difficulty. One thing I really dislike is the story; thought the refugee plot should have ended in Gondor, and the whole rehashing of/homage to The Hobbit did not work for me. But I'd been clamouring for dragons and treasure and dwarf-ruins in the NE for years and the game delivered, so not going to complain much.\n\n5. Dream-chaser – Enjoyed the ships and sailing, didn't care for the pirate-ish stuff (too Hollywood does 18th c Caribbean for me). Always happy to play this one through though. Pursuing a Corsair fleet and exploring Numenorean ruins are both thematic wins.\n\n6. Shadows of Mirkwood – Bit of an odd one, as a number of quests have not aged well or were always weak. Really benefits from the Nightmare treatment. Big points for capturing and expanding a great piece of lore and getting the general feel of the region. Journey Down the Anduin and Conflict at the Carrock are always fun, and thematically Hunt for Gollum and Return to Mirkwood are perfect.\n\n7. Against the Shadow – I may still be slightly biased for how punishing it was when it first came out (and how many times I had to play the bloody Morgul Vale), but now appreciate the almost puzzle-like nature of the first couple rounds of Peril in Pelargir and Ambush in Ithilien. And Steward's Fear will likely always make my top ten. Thematically it's okay, but nothing that creative.\n\n8. Ring-maker – This was my least favourite cycle for a long while, but has climbed a bit due to its premise of unwittingly doing tasks for Saruman. I like how it sets up the Isengard situation we see in LotR and there's a really good variety in the quests when it comes to where you go and what you're doing. Downsides are all the tokens/counters, general fiddliness, and punishment for card draw.\n\n9. Haradrim – Quite a few mechanically solid quests, but this cycle was a real dud on theme. Way too samey overall; I did not want to see more spiders, wargs and orcs here, and fighting apes and tigers was just odd (though I did enjoy capturing the oliphants). A missed opportunity to explore Umbar in any sort of depth.\n\n10. Hobbit Saga – As you said. Appreciate the experimentation to represent theme (which is harder to do than with LotR) but it didn't work for the most part. Glad they learned their lesson. I do like Battle of Five Armies.\n\nEdited February 4 by Will Anderson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3886291","commentId":3886291,"userName":"Wandalf the Gizzard","timestamp":1580828786,"content":"My collection is quite limited compared to the vast card pool of today (just up to heirs of numenor), but Khazad-dum/Dwarrowdelf is by far my favorite of the cycles I own, regarding both player cards and quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3886448","commentId":3886448,"userName":"Ywingscum","timestamp":1580837864,"content":"Fun excercise. \n\n1. Ered Mithrin- Wilds is when I rejoined the game and was current with.  I also enjoyed the story and setting and quests and player cards easily my favourite.\n\n2. Angmar Awakened\n\n3. A Shadow in the East my second current cycle and enjoyable challenge \n\n4 Harad enjoyed this cycle\n\n5 Dream Chaser was so much fun\n\n6 Mirkwood love the setting and nostalgia to my first round of playing this game \n\n8 Hobbit Saga really enjoyed it\n\n9 Dwarrowdelf petty good cycle\n\n10 Heirs of Numenor definitely liked this cycle just don’t remember it all that well now\n\n11 ring maker this cycle had to of my least favourite quests \n\nnot ranked LoTR saga as I still haven’t played those boxes yet\n\nEdited February 4 by Ywingscum"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3886548","commentId":3886548,"userName":"dalestephenson","timestamp":1580843305,"content":"Leaving out the current cycle since it isn't finished.\n\nStory:\n\n1. LOTR -- it's not an original story to the designers, but it's the best story, and the quests invoke the events of the trilogy well.\n\n2. Hobbit -- again benefits from being invented by Tolkien directly, but the designers did a great job of invoking the elements of the story\n\n3. Ringmaker -- of the original stories, I like this one the best by far.  The amount of damage the heroes do in good faith while working for Saruman is truly impressive.\n\n4. Harad -- while this lacks anything like the deep implications of Ringmaker, I like the story of good people in a land dominated by Sauron, resisting evil against hopeless odds out of love for their family and friends.\n\n5. Angmar -- long connected story with dire consequences at stake in an iconic but unexplored area of the map.\n\n6. Heirs -- yes, the end surprised me.\n\n7. Dreamchaser -- I like the story, Na'asiyah, and exploring the oceans, but the artifact at stake doesn't impress me with as much menace as the cycles listed above.  I also take off points for ending the cycle in a cliffhanger!\n\n8.  Core/Mirkwood -- ostensibly following the canonical search for gollum, there's not enough Gollum in it.\n\n9.  Ered Mithrin -- for the most part I love the dragon-hunting story, but the treatment of Urdug in Roam Across Rhovanion was horrifying.\n\n10. Dwarrowdelf -- the story is well told and the setting of the Mines of Moria is probably my favorite in the game.  The problem is that by completing the cycle you learn both Balin's fate and that there's a Balrog in Moria, meaning you *have* to lose in order to avoid upsetting the canonical timeline.\n\nQuest design:\n\n1. Dreamchaser -- my favorite for quest design, I think all the quests are good.\n\n2. Harad -- I don't think it's as innovative as Dreamchaser, but I again think the quests are all solid\n\n3. Mithrin -- mostly well designed, but Ghost of Framsburg can take *forever* to defeat.\n\n4. Angmar -- well designed, but the brutality of the shadows makes it not as fun as the  top three.\n\n5. LOTR -- for the most part exceptional, but the very end of the saga boosts into nightmare status and punishes ally-heavy decks you may have used all through the saga.  Campaign boon/burden is great, but permanent boons give you an incentive to use same heroes for all quests in campaign rather than alternating between Aragorn-path and Frodo-path quests after the breaking of the fellowship.\n\n6. Ringmaker -- Nin-in-Eleph is terrible, but I enjoyed the other quests despite the card draw hate.  It is the fiddliest of the cycles, though.\n\n7.  Dwarrowdelf -- for the most part enjoyable, but I have a hard time forgiving Sleeping Sentry and Sudden Pitfall for existing.\n\n8. Core/Mirkwood -- most of the quests are a little rough, Escape is ridiculously unbalanced against one-deck play, Emyn Muil takes forever.  It's early and it shows.\n\n9. Hobbit -- while the quests are highly thematic, the mechanisms can be highly annoying.  The riddle quest practically forces a deck remake, and having to stall to get the Troll treasures is incredibly annoying.\n\n10. Heirs/ATS -- Battle/Siege questing were innovative and praiseworthy, but too many enemies are actively un-fun (Zealous Traitor, anyone), and too many cards punish you for not playing tactics mono-sphere.  But The Power of Mordor is the biggest reason I put this cycle last, it has the potential to ruin every quest it appears in."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3886714","commentId":3886714,"userName":"PocketWraith","timestamp":1580852877,"content":"I'm making my judgements entirely on the basis of quest design and disregarding the story:\n\n1. Ered Mithrin\n2. Angmar Awakened\n3. Dreamchaser\n4. LotR Saga\n5. Haradrim\n6. Against the Shadow\n7. Ringmaker\n8. Dwarrowdelf\n9. Shadows of Mirkwood\n10. Hobbit Saga\n\nMy top 3 are fairly interchangeable to me honestly, but I put them in the order I did on the basis of consistency - in particular comparing Angmar to Dreamchaser I'd say the best quests are better in the latter, but the worst quests are also worse. Ered Mithrin in turn has even less bad points which come to mind (though it may also be benefitting from being still fresh and newish) and reaches comparable highs to my favourites from Dreamchaser.\nA similar point applies to 4 and 5 but in reverse - I'd say the Haradrim cycle is more consistent, but the highs of quests like Pelennor Fields are enough for me to give the saga the nod.\nThe lower half of my list I'm honestly just not that fond of in general, compared to the upper half. There are some good quests in there, but there are also some very bad ones, and there are problems all over the place, including in the better quests. This game had some definite growing pains in its quest design in my opinion."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887036","commentId":3887036,"userName":"Alonewolf87","timestamp":1580895287,"content":"In my opinion, as a mix of mechanics, theme and fun I would rank them as such:\n\n1) Ered Mithrin\n2) LOTR Saga\n3) Dreamchaser\n4) Angmar Awakened\n5) Harad\n6) Ringmaker\n7) Shadows of Mirkwood\n8 ) Dwarrovdelf\n9) Against the Shadow\n10) Hobbit Saga\n\nKeeping in mind that we always played them as a 4 players group.\n\nIn general I feel confident in saying that the overall quality (both mechanical and narrative) of the quests has only been increasing lately, as Caleb's grasp of the game and quality of writing improved over the years. That's why I have very high expectations for Vengeance of Mordor (I still have to get Wrath and Ruin 😢)\n\n \n\nEdited February 5 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887473","commentId":3887473,"userName":"DunedainLoreKeeper","timestamp":1580939293,"content":"Thank you for all the responses. It's interesting to see so much diversity in the top 3. Ered Mithrin seems to score higher than Haradrim and the LOTR on most lists, so I think I'll skip ahead to that cycle. The Middle Earth ccg left me with a fondness for the dwarven rings, so some lore in that area would be fun.\n\n> On 2/4/2020 at 2:28 AM, Will Anderson said:\n> \n> 2. Dwarrowdelf – Much nostalgia for this cycle, even if there are some weaknesses in quest mechanics – and the general wrongness of investigating Moria before the LotR. But it does feel like Moria with its good use of locations, and if you have the Nightmare packs it holds up especially well.\n\nI guess technically both Aragorn and Gandalf entered Moria during the timeframe of the game at some point and left again. But they didn't find Balin's tomb or directly encounter the Balrog so 7th level and Shadow and Flame are the only quests truly non-canon."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887512","commentId":3887512,"userName":"Will Anderson","timestamp":1580942255,"content":"True, nothing wrong with going into Moria per se - just so long as the nature of the Balrog and the fate of the colony remain mysteries. And I see why they included those aspects at the time. Great cycle regardless.\n\nEred Mithrin will satisfy some desire for dwarf-lore, though I do wish the game would have touched more on the history of the dwarven rings and other dwarves beside Durin's Folk. Since you like the CCG, The Ghost of Framsburg should also have some enjoyable resonance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887528","commentId":3887528,"userName":"dalestephenson","timestamp":1580944146,"content":"It's a pity IMO that the timeframe of the game wasn't set betwen the end of the Hobbit and Frodo leaving the shire, rather than confining it to the narrow window between the Party and Frodo's departure.  That would've allowed passage through Moria before Balin arrived, as both Aragorn and Gandalf are known to have done.  It also would've allowed more characters active in that period to become allies and/or heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887533","commentId":3887533,"userName":"dalestephenson","timestamp":1580945112,"content":"Caveat -- I don't know exactly when Aragorn and Gandalf passed through, but I think it's *highly* unlikely that it was after Balin entered Moria.  For Aragorn we at least know he was in proximity to Moria in 2980 when he met Arwen, this was nine years before Balin entered Moria.  2980 is listed as the end year for Aragorn's \"great journeys and errantries\", 2957 being the start year.\n\nGandalf arrived \"maybe a thousand years\" after the third age started, and the Istari are mentioned in the Tale of Years c. 1100.  At that point the dwarves were still *in* Moria, the Balrog didn't show up and ruin things until 1980-1.  Wandering about for nearly a thousand years it would be strange if Gandalf *hadn't* passed through Moria before the fall, especially since he spent enough time with dwarves to get his own name.   But from the text it seems that extending the timeframe of the game wouldn't cover Gandalf's last visit, \"I sought there long for Thrain son of Thror after he was lost.\"  That places it before his visit to Dol Goldur in 2850."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887740","commentId":3887740,"userName":"General_Grievous","timestamp":1580970021,"content":"1. Dreamchaser -Ships, Pirates, best quests and FFG story in the game. It's the Elven blood in me but I'm called to the Sea!\n2. Ered Mithrin - Dragon battles are sweet! Also cool throwback to the core set.\n3. LOTR Saga - best story obviously haha, and solid thematic quests, it only loses a couple spots because of how absurdly hard and unfun the final quest is and the amount of deck rebuilding it takes to pass it through.\n4. Angmar Awakened - super hard but awesome theme and story\n5. Haradrim - great continuation to Dreamchaser and some new settings mixed in with great quest design.\n6. Against the Shadow - excellent Gondorian storyline, arguably my second favourite story but some savagely hard quests haha\n7. Ringmaker - great story, time mechanic is a love it or hate thing.\n8. Dwarrowdelf -kind of a mish-mash of quests it feels like with not much story, some really savage treachery cards but great deluxe set quests and also best boss battles in the game\n9. Shadows of Mirkwood - not the most exciting and almost zero story to speak of but it is nostalgia and some great theme that all future cycles built on so it deserves its respect.\n10. Hobbit Saga -great theme but sheesh half of these quests are hard (looking at you Trolls, Gollum and Smaug!) and the unofficial associated POD Battle of Laketown is the perhaps one of the hardest quests in the game. \n\nEdited February 6 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887750","commentId":3887750,"userName":"Miceldars","timestamp":1580972845,"content":"Harad and Ered Mithrin are not in the list because I havent played them.\n\n1)Dreamchaser --> I like every quest in this cycle, where others always have a quest I don't want to play a second time\n\n2)Darrowdelf --> I really like the moria theme\n\n3)Angmar --> some great quest (Escape from Mount Gram), it could be number 1 or 2 if it hasn't the horrible Battle of Carn Durm (one of the impossible quests in this game)\n\n4)Against the shadow --> second nearly impossible quest with Cair Andros, but others are ok. And it's the only cycle where you can play mono tactic most of the time\n\n5)Shadow of mirkwood --> first cycle of the game, so the quests are not really great, but I like most of them (there is 3 quests I don't like, I let you guess which one)\n\n6)LOTR saga --> The first box is really great, but the more I progress through other boxes the worst it become. I really don't like the last one, where Mount Doom is another impossible quest and The black gate open is not fun at all\n\n7)Hobbit saga --> I don't know why, but I haven't a good memory of this saga. And Battle of the five armies is one of the quests I have never completed\n\n8)Ringmaker --> I REALLY don't like that ******** ever-present time mechanic"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887842","commentId":3887842,"userName":"banania","timestamp":1580997953,"content":"1) Against the Shadow: first real narrative of the game, and quite plausible, I like all quests, even with the Battle/SIege questing which is not too annoying with a modern day cardpool.\n\n2) Angmar Awaneked: both the narrative and the quests are close to perfection. I rank it behind Against the Shadow because I'm a Gondor fanboy, but if I were a bit more impartial, this would be first.\n\n3) Ered Mithrin: Fram+Beowulf narrative is really good but a few quests were a bit of a let down for me (Ghost of Framsburg, Roam Across Rhovanion)\n\n4) The LOTR Saga: nuff said. It's only 4th because a few quest are kinda \"meh\" (Road to Isengard, all the Land of Shadow box, the Siege of Gondor). if it were just for the Black Riders augmented with Fog on the Barrow Downs and The Old Forest, I would rank it even the Angmar Awakened cycle.\n\n5) Shadows of Mirkwood: following Aragorn's chase in the appendix was a clever idea, but the game was too young to really make it shine like it could have. The Nightmare version helps a bit bettering the cycle.\n\n6) Dream-Chaser: really cool narrative even if on a weird stance with the jungles, grottos and all those undeads, but all quests are really fun, innovative and well balanced\n\n7) Haradrim: unmemorable narrative in my opinion, ok quests\n\n8 ) The Hobbit: first quests designed by Caleb, so they're not perfect, but I like them, especially the second box\n\n9) Ring-Maker: those Time tokens and mechanics were just dead annoying. Too bad because the narrative covers so many things about Saruman pre-LOTR (forging of its ring, designing the uruk-hai and aligning the Dunlendings)\n\n \n\n==> this concludes the first part of my list. Obviously it's too early to rate Vengeance of the Mordor cycle, but it would probably be on par with Ered Mithrin cycle. Anything below rank 3) was actually hard to rank, so that's why I'm taking a pause here. Because, yes Ring-Maker is 9, and Dwarrowdelf is 10, but Ring-Maker is infinitely better. So I will be finishing with:\n\n \n\n10) Dwarrowdelf: non-sensical narrative (contradicting heavily with lore) that gets repeated twice (the saga scenario \"Journey in the Dark\" is more than enough to cover Moria, thanks). Most quests have a poor design and an overly thick encounter deck. Probably the worst batch of player cards. Both the two-powerful-ones that unbalanced the game for years (Glorfindel+LoV+Asfaloth) and the actual worst one is from this cycle (The End Comes). Oh, and Sleeping Sentry. Dumbest card in the game. Worst player card and encounter card of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3887957","commentId":3887957,"userName":"Amicus Draconis","timestamp":1581006086,"content":"When Dain Ironfoot looked into Moria after the Battle of Azanulbizar, he saw Durin's Bane and fortold, the time to reclaim Moria had not come yet. Would he not have told someone (Lothlórien is nearby, Gandalf had contact to the dwarves), what is hiding in Moria?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3888040","commentId":3888040,"userName":"dalestephenson","timestamp":1581012387,"content":"He *did* tell Thrain immediately after the battle of Azanulbizar, in the presence of witnesses.  He identified it as \"Durin's Bane\", and when the fellowship first saw the Balrog, Gimli immediately recognized it as Durin's Bane.\n\nThe Balrog slew two dwarvish kings in different years, and Moria was abandoned by survivors -- it seems unlikely to me that none of them were eyewitnesses to Durin's Bane at that time.  Gandalf was already in Middle Earth and we know spent enough time with the dwarves to acquire a Dwarvish name.  He surely had some information.  OTOH, none of the dwarves would ever have seen a Balrog during the first age; Legolas is the first character to see it who was possibly in middle-earth at that time, and Thranduil's realm played no role AFAIK in the wars of the first age.\n\nOTOH, it may very well be that the wise guessed that Durin's Bane could be a Balrog.  Gandalf doesn't seem surprised that Durin's Bane is one, he just understood why he had such a struggle.  Celeborn and Galadriel had \"long feared that under Caradhras a terror slept,\" and Celeborn's reaction is not to it existing, but \"that the Dwarves had stirred up this evil in Moria again.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3888082","commentId":3888082,"userName":"DunedainLoreKeeper","timestamp":1581016188,"content":"> 11 hours ago, Miceldars said:\n> \n> 3)Angmar --> some great quest (Escape from Mount Gram), it could be number 1 or 2 if it hasn't the horrible Battle of Carn Durm (one of the impossible quests in this game)\n\nIf you're playing Battle of Carn Dum solo, house-rule it and add ally Amarthiul to your start. Kinda makes sense for him to be there and helps with the brutal battle questing turn 1 so your deck can get rolling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3888844","commentId":3888844,"userName":"Amicus Draconis","timestamp":1581106191,"content":"> On 2/6/2020 at 7:06 PM, dalestephenson said:\n> \n> He *did* tell Thrain immediately after the battle of Azanulbizar, in the presence of witnesses.  He identified it as \"Durin's Bane\", and when the fellowship first saw the Balrog, Gimli immediately recognized it as Durin's Bane.\n\nAnd yet he, the King under the Mountain, allowed Balin to establish a colony in Moria, even though he foresaw another power must come first. As Glóin says \"Dáin did not give leave willingly\".\n\n> Quote\n> \n> The Balrog slew two dwarvish kings in different years, and Moria was abandoned by survivors -- it seems unlikely to me that none of them were eyewitnesses to Durin's Bane at that time.  Gandalf was already in Middle Earth and we know spent enough time with the dwarves to acquire a Dwarvish name.  He surely had some information.  OTOH, none of the dwarves would ever have seen a Balrog during the first age; Legolas is the first character to see it who was possibly in middle-earth at that time, and Thranduil's realm played no role AFAIK in the wars of the first age.\n> \n> OTOH, it may very well be that the wise guessed that Durin's Bane could be a Balrog.  Gandalf doesn't seem surprised that Durin's Bane is one, he just understood why he had such a struggle.  Celeborn and Galadriel had \"long feared that under Caradhras a terror slept,\" and Celeborn's reaction is not to it existing, but \"that the Dwarves had stirred up this evil in Moria again.\"\n\nI have reread The Ring Goes South and Journey In The Dark yesterday. Gandalf only mentions Durin's Bane when he explains Mithril to Sam, though he does not specify, what it could be. Both the Wizard and Aragorn do not want to enter the mines because of Goblin presence and their bad experience from this place, but they are forced in to avoid detection by Saruman through his crebain and by Sauron through his hounds. Aragorn clearly is worried about possible Orc encounters in the mine. As he says \"The Warg that one hears is worse than the Orc that one fears\". At least he should have feared the Balrog, if he knew one was in there."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3888876","commentId":3888876,"userName":"dalestephenson","timestamp":1581108942,"content":"Gandalf seems foolishly optimistic when describing Moria, saying that \"if there are Orcs there, it may prove ill for us, that is true.  But most of the Orcs of the Misty Mountains were scattered or destroyed in the Battle of the Five Armies.  The Eagles report that the Orcs are gathering again from afar; but there is a hope that Moria is still free.  There is even a chance that Dwarves are there...\"\n\nIt's a curious statement, though at this point he's trying to convince the Fellowship to go through Moria -- unsuccessfully, until they hear the wolves.  There's a greater chance that it is orc-free than that some remnant of Balin's company survived?\n\nAnd Aragorn has *certainly* been through Moria since the Battle of Five Armies, and \"the memory is very evil\".  He knows full well it is not orc-free, though he doesn't contradict Gandalf on that point.  He also curiously warns Gandalf that he is *personally* at risk from entering Moria, even though he guarantees the others (after they enter) that Gandalf will make sure the rest of them get out alive.  Gandalf \"sought there long\" *before* the Battle of Five Armies, and this time they would just be passing through.  Does he know something he's not sharing?\n\nDain allowed Balin to establish a dwarf colony -- though it's clear he was unwilling and it's *not* clear he could have prevented it. Balin probably heard the interchange between Thrain and Dain, he was four years older than Dain and both lost their fathers at Nanduhirion.  Given that Dain had seen Durin's bane in 2799 and it had slain Durin VI in 1980 and Nain I in 1981, it's not reasonable to suppose that Durin's Bane had died of old age between 2799 and 2989.\n\nI suppose it's possible that despite Dain telling Thrain about seeing Durin's bane there were dwarves who were unaware of the interchange.  Dwarves seem particularly bad at communication.  Gimli doubts that Balin *ever* came to Moria as they passed through and found no sign, despite the fact that Balin sent messages they had entered Moria and \"for a while we had news\".  Did he think that Balin actually thought better of entering Moria, went to relax on a beach somewhere and had forgotten to write for the last 24 years?  Gloing actually tells Frodo that \"It is largely on account of Balin that I have come to ask the advice of those that dwell in Rivendell.\"  A little late, Gloin!\n\nAnd despite Dain's warning, Balin actually survived five years in Moria without running across Durin's Bane, and when he died it was from an unexpected ambush, not part of the war of extermination that followed.  Even then, the Dwarvish account taking us right to the end of the colony without the readable parts even mentioning Durin's Bane -- after finishing the account in the Book there's no indication that anything besides orcs and the Watcher in the Water were involved.  The Balrog apparently kept a low profile, and Gandalf was able to seek *long* in Moria for Thrain without running across him.  The fellowship was horrendously unlucky to attracted its attention in just a few days in Moria -- unless it wasn't an accident and the Balrog, like the Watcher, may have been attracted by Sauron's ring."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3888965","commentId":3888965,"userName":"Alonewolf87","timestamp":1581119634,"content":"> 2 hours ago, dalestephenson said:\n> \n> Given that Dain had seen Durin's bane in 2799 and it had slain Durin VI in 1980 and Nain I in 1981, it's not reasonable to suppose that Durin's Bane had died of old age between 2799 and 2989.\n\nIt's not stated that Dain directly saw Durin's Bane (or understood exactly what it was) only that \"when he came down from the Gate he looked grey in the face, as one who has felt great fear\". He later tells to Thrain \"Only I have looked through the shadow of the Gate. Beyond the shadow it waits for you still: Durin's Bane\". It seems more like it felt an evil and fearful presence in Moria, without discerning its exact nature nor coming actually close to seeing it.\n\n> 2 hours ago, dalestephenson said:\n> \n> Gandalf seems foolishly optimistic when describing Moria, saying that \"if there are Orcs there, it may prove ill for us, that is true.  But most of the Orcs of the Misty Mountains were scattered or destroyed in the Battle of the Five Armies.  The Eagles report that the Orcs are gathering again from afar; but there is a hope that Moria is still free.  There is even a chance that Dwarves are there...\"\n> \n> It's a curious statement, though at this point he's trying to convince the Fellowship to go through Moria -- unsuccessfully, until they hear the wolves.  There's a greater chance that it is orc-free than that some remnant of Balin's company survived?\n\nI always credited that \"error\" on Gandalf part as a way to persuade the others to take a road that was indeed risky, but still possibly less dangerous than the other options.\n\n> 2 hours ago, dalestephenson said:\n> \n> And Aragorn has *certainly* been through Moria since the Battle of Five Armies, and \"the memory is very evil\".  He knows full well it is not orc-free, though he doesn't contradict Gandalf on that point.  He also curiously warns Gandalf that he is *personally* at risk from entering Moria, even though he guarantees the others (after they enter) that Gandalf will make sure the rest of them get out alive.  Gandalf \"sought there long\" *before* the Battle of Five Armies, and this time they would just be passing through.  Does he know something he's not sharing?\n\n \n\n> On 2/6/2020 at 7:06 PM, dalestephenson said:\n> \n> OTOH, it may very well be that the wise guessed that Durin's Bane could be a Balrog.\n\nI am also of this opinion and that explains Aragorn warning to Gandalf, knowing that if they ever got to face the Balrog he was the only one who could fight with it, and still at great personal peril.\n\n> 2 hours ago, dalestephenson said:\n> \n> The Balrog apparently kept a low profile, and Gandalf was able to seek *long* in Moria for Thrain without running across him.  The fellowship was horrendously unlucky to attracted its attention in just a few days in Moria -- unless it wasn't an accident and the Balrog, like the Watcher, may have been attracted by Sauron's ring.\n\nThat's my opinion too, both the Balrog low profile (he must have learned quite well to conceal itself after escaping the War of Wrath) and the Ring attraction of evil beings....though everyone knows who the real evil mastermind is in all that\n\n4a1164c113590d990987832ddb6c61db.gif [https://i.pinimg.com/originals/4a/11/64/4a1164c113590d990987832ddb6c61db.gif]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889006","commentId":3889006,"userName":"Rouxxor","timestamp":1581126383,"content":"1- Cycle 5: Angmar Awakened. Mechanically speaking it is the best cycle, it is even a no-match. A vast variety of quest, there is no 2 quest that look alike in the cycle and each is highly replayable. I realize how good it was when the nightmare come to spice up all that. My only regret is that 1nightmare failed to make the The Battle of Carn-Dûm one of the hardest scenario in the game.\n2- Cycle 4: Ringmaker. The only story that is consider to be really good. Time counters are not popular but I found them really interesting: they introduced a rhythm in the game that was really missing in the beginning of the game. There is some memorable quest, especially with nightmare.\n3- Cycle 3: Against the Shadows. To me the real start of our actual game: a story, some quests that require a good deckbuilding. They are not as good as they where, and I probably rate it too high only because it has nightmare when many cycles haven't. The story was okay.\n4- Cycle 9: Mordor. The temple of mordor is a blast, and the average of the quest is quite good. So even without knowing the last I still put it high.\n5- Saga Sda. It is quite odd to class it among cycle who have 2 times less quests. The average of a saga Sda quest is quite low, but it also have the best scenario (not only for me, it is also the result of the last poll): battle of pelenor fields. And I like the last 2, even if they aren't fit for the end of the campaign.\n6- Cycle 6: Dreamchaser. The boat idea was fun, but making 5 or 6 quest using it was way too much! And all the scenario with a map are not very good, not really replayable. I still like raid of the grey havens, a things in the depths and a storm in the cobas haven, but the cycle is quite irregular.\n7- Cycle 7: Haradrim. I Really like some of the quest (race accros harad and crossing of poros) and the average of scenario is okay.\n8- Cycle 8: Ered Mithrin. Not a large diversity, only one scenario who raise up (fire in the night)\n9- Cycle 1: Shadow over Mirkwood. The beginning of the game. Many design errors, scenario who are quite easily when you understand how to handle them. Quite hard to play them now, even in nightmare. I still like escape from Dol Guldur, still the harder quest in the game thank to the hardest nightmare.\n10- Hobbit Saga. Battle of the five armies is one of my favorite scenario but the rest is quite trash.\n11- Cycle 2: Dwarrodelf. Worst scenario. Worst design (nothing happens, then an effect kill you unless you have a counter, that you can keep for this card since the rest of effects are almost blank), a story that doesn't work. The end of the cycle with foundations of the stone and shadow and flame is quite better than the rest, but it still have some mark of the flues of the beginning of the cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889128","commentId":3889128,"userName":"Amicus Draconis","timestamp":1581164244,"content":"> 14 hours ago, dalestephenson said:\n> \n> Gandalf seems foolishly optimistic when describing Moria, saying that \"if there are Orcs there, it may prove ill for us, that is true.  But most of the Orcs of the Misty Mountains were scattered or destroyed in the Battle of the Five Armies.  The Eagles report that the Orcs are gathering again from afar; but there is a hope that Moria is still free.  There is even a chance that Dwarves are there...\"\n> \n> It's a curious statement, though at this point he's trying to convince the Fellowship to go through Moria -- unsuccessfully, until they hear the wolves.  There's a greater chance that it is orc-free than that some remnant of Balin's company survived?\n\nThis only makes sense, if Gandalf tries to convinve the fellowship to go through Moria. And as Aragorn is against it, they try to climb the mountains. Gandalf obviously sees Saruman as a greater threat than Orcs in Moria.\n\n> Quote\n> \n> And Aragorn has *certainly* been through Moria since the Battle of Five Armies, and \"the memory is very evil\".  He knows full well it is not orc-free, though he doesn't contradict Gandalf on that point.  He also curiously warns Gandalf that he is *personally* at risk from entering Moria, even though he guarantees the others (after they enter) that Gandalf will make sure the rest of them get out alive.  Gandalf \"sought there long\" *before* the Battle of Five Armies, and this time they would just be passing through.  Does he know something he's not sharing?\n\nThe warning for Gandalf to me feels more like a prediction than actual knowledge.\n\n> Quote\n> \n>  \n> \n> Dain allowed Balin to establish a dwarf colony -- though it's clear he was unwilling and it's *not* clear he could have prevented it. Balin probably heard the interchange between Thrain and Dain, he was four years older than Dain and both lost their fathers at Nanduhirion.  Given that Dain had seen Durin's bane in 2799 and it had slain Durin VI in 1980 and Nain I in 1981, it's not reasonable to suppose that Durin's Bane had died of old age between 2799 and 2989.\n> \n>  \n\nThere is no reason to believe that Balin would openly defy his king. If Glóin says, that Dáin gave leave unwillingly, he would also have had to power to prevent Balin from going there. Balin and Glóin both were in Thráin's following after the Battle, so they probably participated in it, too.\n\n> Quote\n> \n>  \n> \n> I suppose it's possible that despite Dain telling Thrain about seeing Durin's bane there were dwarves who were unaware of the interchange.  Dwarves seem particularly bad at communication.  Gimli doubts that Balin *ever* came to Moria as they passed through and found no sign, despite the fact that Balin sent messages they had entered Moria and \"for a while we had news\".  Did he think that Balin actually thought better of entering Moria, went to relax on a beach somewhere and had forgotten to write for the last 24 years?  Gloing actually tells Frodo that \"It is largely on account of Balin that I have come to ask the advice of those that dwell in Rivendell.\"  A little late, Gloin!\n> \n>  \n\nIt is strange indeed that Glóin would warn Bilbo of Sauron's messenger in the same year, but waited 24 years to check Balin's whereabouts.\n\n> Quote\n> \n> And despite Dain's warning, Balin actually survived five years in Moria without running across Durin's Bane, and when he died it was from an unexpected ambush, not part of the war of extermination that followed.  Even then, the Dwarvish account taking us right to the end of the colony without the readable parts even mentioning Durin's Bane -- after finishing the account in the Book there's no indication that anything besides orcs and the Watcher in the Water were involved.  The Balrog apparently kept a low profile, and Gandalf was able to seek *long* in Moria for Thrain without running across him.  The fellowship was horrendously unlucky to attracted its attention in just a few days in Moria -- unless it wasn't an accident and the Balrog, like the Watcher, may have been attracted by Sauron's ring.\n\nThis all leads to my assumption of a plothole, as there are just too many things to not make sense.\n\n> 11 hours ago, Alonewolf87 said:\n> \n> It's not stated that Dain directly saw Durin's Bane (or understood exactly what it was) only that \"when he came down from the Gate he looked grey in the face, as one who has felt great fear\". He later tells to Thrain \"Only I have looked through the shadow of the Gate. Beyond the shadow it waits for you still: Durin's Bane\". It seems more like it felt an evil and fearful presence in Moria, without discerning its exact nature nor coming actually close to seeing it.\n\nBut why then would he call it Durin's Bane, if he has not seen it but only felt an evil presence? It just as well could have been a Nazgûl or something entirely different. Remember, even the Black Pool in front of the Door's of Durin had a sense of gloom in it.\n\n> Quote\n> \n> I always credited that \"error\" on Gandalf part as a way to persuade the others to take a road that was indeed risky, but still possibly less dangerous than the other options.\n\nThat makes the most sense.\n\n> Quote\n> \n> I am also of this opinion and that explains Aragorn warning to Gandalf, knowing that if they ever got to face the Balrog he was the only one who could fight with it, and still at great personal peril.\n\nThis assumes, that Aragorn knows about the Balrog, which I doubt. He is only talking about Orcs in Moria. And why would he be certain, that everyone else would be able to leave? The Balrog is powerful enough to kill them all. They just were lucky, that the demon came from behind. If it dad blocked the way over the Bridge of Khazâd-dûm, noone would have survived. And what if Gandalf had chosen to break the bridge and flee? He surely would not have had to stand directly on it, especially if he sees, that the Balrog wields a whip.\n\n> Quote\n> \n>  \n> \n> That's my opinion too, both the Balrog low profile (he must have learned quite well to conceal itself after escaping the War of Wrath) and the Ring attraction of evil beings....though everyone knows who the real evil mastermind is in all that\n> \n> 4a1164c113590d990987832ddb6c61db.gif [https://i.pinimg.com/originals/4a/11/64/4a1164c113590d990987832ddb6c61db.gif]\n> \n>  \n\nWhy would the Balrog keep a low profile in a dark mine for over a thousand years after killing Durin VI? I am not sure whether the Orcs in Moria were in league with him, but they could have told him, that the Valar have not been to Middle-earth for more than one and a half ages."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889245","commentId":3889245,"userName":"dalestephenson","timestamp":1581181101,"content":"I agree that Gloin and Balin are present at the battle, and also after the battle when Thrain said to the survivors \"Good! We have the victory. Khazad-dum is ours!\".  Durin's Folk openly rejected the idea of taking it, and his kinsman Dain said \"You are the father of our Folk, and we have bled for you, and will again.  But we will not enter Khazad-dum.\"  Being Durin's hour does not confer absolute power, Dain (and Durin's Folk collectively) felt free to reject Thrain's desires after the battle and Balin was free to reject Dain's disapproval.  Surely Dain would not have prevented Balin from leaving by force.\n\nBut my main point is that although Dain knew that Durin's Bane was still active at the time of the battle, he revealed that information immediately after.  There's no reason to think that Balin did not witness the interchange then, nor that Dain failed to remind Balin that it's probably still around.  There's nothing in the text IMO that suggests Balin *didn't know* that Durin's Bane was a possible problem, despite the fact that he went anyways.  If there's one person in the text who provably contributed to the disaster by keeping his mouth shut, it is Gandalf.  Gloin revealed in Elrond's Council that it was partly in hopes of finding the Ring of Thror that Balin went to Moria; Gandalf knew better.\n\nI think an assumption of a plothole is the last resort, only to be resorted to when the text is irreconcilable.  Characters in the text not behaving as we might expect don't rise to that level IMO, especially when the character in question is a Balrog!  The text shows that the Balrog *did* keep a low profile.  Once released/discovered he drove the dwarves out *the following year*, not exactly Smaug-speed in dwarf killing.  And he must have done it with allies, because we also read in the tale of years \"Many of the Silvan Elves of Lorien flee south.  Amroth and Nimrodel are lost.\"  And the text has him not (visibly) interfering with Balin for five years, nor interfering with Gandalf's search or preventing Aragorn from passing through.  Does that make it a plothole when he clamps down on the Fellowship in a few days?\n\nLow-probability events are not plotholes, they should be expected to be happened at low probability.  But where the Ring is concerned, low probability events happen at *high* probability and do so from the time Bilbo discovers the ring down to the time where Gollum unluckily slips in Sammath Naur.  The Ring itself of course is an actor in these things, no one thinks it remarkable that Gollum finds the company in the vastness of Moria (nor even notes that he somehow managed to get across the bridge before them) due to the draw of the ring.  But is Gollum the only being of evil that the ring draws?  The Watcher took Frodo amongst all the company, and neither the storm on Caradhras nor the behavior of the wolves was normal.  The Ring may well have called the Balrog.  It may not be a coincidence that the Balrog showed up in the very year that the Witch-King gathered the Nazgul to Mordor.\n\nValar are not the only possible enemy to a Balrog, as it learned to its cost.  Besides the Istari, Glorfindel is back and in reasonable proximity.  He clearly has a finely-developed sense of preservation, abandoning Morgoth to save himself.  He kept hiding when Sauron was next door learning ring-lore, he kept hiding when Sauron submitted to the might of Numenor, he kept hiding when open war between Mordor and the Last Alliance was going on, he kept hiding while the realm of the North endured -- and he surfaces five years after the Witch-King vanishes, in the year when the Witch-King establishes himself well south.  Either he has no interest in serving Sauron, or he's just totally unaware of current events.  The last is certainly possible if the Dwarves released him from a trapped condition, but even *after* emerging he's still low key, staying in the shadows and letting the Orcs do his dirty work.  Is he hiding from Glorfindel, or is he really hiding from Sauron?  One thing I feel confident about -- if he can wield a whip and a sword, he could also wield The Ring.\n\nAnd if so, why would Gandalf consent to ever bring the company into Moria?  Did it never occur to him that Durin's Bane might still be in existence, or that it might be a Balrog, or that it might be attracted by the ring?  Why would he even consider Moria before the trip over Caradhras fails?  Well, as he says \"However it may prove, one must tread the path that need chooses.\"  Boromir said \"The wolf that one hears is worse than the orc that one fears\", and that applies to more dangerous beings at well.  With Sauron and Saruman both actively on the hunt for them and seemingly having them spotted, trying to sneak past Durin's Bane to throw them off their trail may have seemed the best choice.\n\nGandalf's all about chasing low-probability outcomes.  He bet the fate of Middle Earth on Frodo's ability to throw the ring into the fire at Mount Doom, even when Frodo had *already proven* he lacked the will to throw the ring in his own harmless fire.\n\n\"You see?  Already you too, Frodo cannot easily let it go, nor will to damage it.  And I could not 'make' you, except by force, which would break your mind.\"\n\nBy any sane reckoning, that should have made the entire quest an exercise in futility, with no chance of success.  But Gandalf believes in miracles.\n\n\"Behind that there was something else at work, beyond any design of the Ring-maker.  I can put it no plainer than by saying that Bilbo was *meant* to find the Ring, and *not* by its maker.  In which case you also were *meant* to have it.  And that may be an encouraging thought.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889247","commentId":3889247,"userName":"Alonewolf87","timestamp":1581181290,"content":"> 4 hours ago, Amicus Draconis said:\n> \n> But why then would he call it Durin's Bane, if he has not seen it but only felt an evil presence? It just as well could have been a Nazgûl or something entirely different. Remember, even the Black Pool in front of the Door's of Durin had a sense of gloom in it.\n\nThere could have been stories passed down through the Dwarves of the great fear and shadow which was called Durin's Bane, so Dain might have made the connection.\n\n> 4 hours ago, Amicus Draconis said:\n> \n> Why would the Balrog keep a low profile in a dark mine for over a thousand years after killing Durin VI? I am not sure whether the Orcs in Moria were in league with him, but they could have told him, that the Valar have not been to Middle-earth for more than one and a half ages.\n\nThere were still some great powers in Middle-Earth during the Second and Third Age, from Elrond and Glorfindel to Celeborn and Galadriel that might have proven dangerous for the Balrog if they knew it still lived hidden in the mines and shafts of Khazad-Dum.\n\n> 4 hours ago, Amicus Draconis said:\n> \n> This assumes, that Aragorn knows about the Balrog, which I doubt. He is only talking about Orcs in Moria. And why would he be certain, that everyone else would be able to leave? The Balrog is powerful enough to kill them all. They just were lucky, that the demon came from behind. If it dad blocked the way over the Bridge of Khazâd-dûm, noone would have survived. And what if Gandalf had chosen to break the bridge and flee? He surely would not have had to stand directly on it, especially if he sees, that the Balrog wields a whip.\n\nThere sure might have been some pre-science at hand, it would not have been the first time something like that happened. Aragorn might not have known it was specifically a Balrog, but it might have understood that something more dire than some Orcs was living in Moria and thought that Gandalf would have been the only one to possibily have the skill and power to face whatever was infesting the mines.\n\nBut, as much as I enjoy this kind of talks,  I fear we are straying a bit from the argument of the topic :D [//content.invisioncic.com/Mfantflight/emoticons/default_biggrin.png]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889300","commentId":3889300,"userName":"Vince79","timestamp":1581191133,"content":"I'm surprised that you've all played through all those cycles.  I find the game very time consuming, what with tweaking decks and strategies for each quest.  I've been playing for a year and a half and I've only played through three cycles and the Hobbit saga.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889325","commentId":3889325,"userName":"dalestephenson","timestamp":1581194785,"content":"I generally do not rebuild decks for specific quests and am annoyed when I am forced to do so.  I like to build a couple decks and take them through an entire cycle (either separately or together) with only swapping in a few sideboard cards like condition removal when necessary.\n\nBut the other aspect is that it's way easier for me to create a deck than test it, because I have ringsdb at my computer but play with physical cards.  I've got dozens of decks I've created that are still waiting to be played."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889432","commentId":3889432,"userName":"Vince79","timestamp":1581209270,"content":"> 3 hours ago, dalestephenson said:\n> \n> I generally do not rebuild decks for specific quests and am annoyed when I am forced to do so.  I like to build a couple decks and take them through an entire cycle (either separately or together) with only swapping in a few sideboard cards like condition removal when necessary.\n\nI've heard this complaint before about building decks for specific quests.  I've also heard some people say that you should be able to build one master deck that will get you through all scenarios.  That latter bit seems a little far-fetched to me, but people can approach the game however they want, I guess.  I notice that for the most part, the right deck will get you through the entire cycle, maybe with the exception of one quest here and there.  Each cycle appears to demand its own themed deck to me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889550","commentId":3889550,"userName":"Alonewolf87","timestamp":1581237464,"content":"> 7 hours ago, Vince79 said:\n> \n> I've heard this complaint before about building decks for specific quests.  I've also heard some people say that you should be able to build one master deck that will get you through all scenarios.  That latter bit seems a little far-fetched to me, but people can approach the game however they want, I guess. \n\nThat's surely just one way of playing the game, valid as many many others, but I can attest that's definitely doable, me and my wife made four mono-sphere decks (tweaked with new cards whenever we got them) and took them through all the quests of the game. It took us 1 year and a half, but it was quite worth it. Still we found ourselves (well mainly me) wanting to try and play many other different decks. I was able to scratch that particular itch at last year Lure of Middle Earth, where I played at least six or seven different decks.\n\nEdited February 9 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889558","commentId":3889558,"userName":"AllWingsStandyingBy","timestamp":1581239639,"content":"> 17 minutes ago, Alonewolf87 said:\n> \n> That's surely just one way of playing the game, valid as many many others, but I can attest that's definitely doable, me and my wife made four mono-sphere decks (tweaked with new cards whenever we got them) and took them through all the quests of the game.\n\n\nDid you play 4-Handed, so to speak?  Each of you running two of the decks, such that you had all four spheres covered in each quest?  Congrats either way!\n\n \n\n> 8 hours ago, Vince79 said:\n> \n>  I've also heard some people say that you should be able to build one master deck that will get you through all scenarios. \n\n\nThis is certainly how I prefer to play, since custom-building a deck to handle a particular quest just sort of feels like \"gaming the system\" to me, in addition to being a bit tedious.  Which means I prefer the challenge of trying to find a toolbox sort of deck that has a few answers for a variety of challenges, meaning it can't just laser in on min-maxing one particular gimmick.  Of course, there will always be greater hurdles than others (e.g. trying to do Journey to Rhosgobel without any Ranged/Eagles or trying to solo Return to Mirkwood without any threat reduction).\n\nThat said, for those who really enjoy deck-building, I'm sure tech-ing against a particular quest is a satisfying exercise that puts a much greater variety of cards onto the table (e.g. like silver bullet cards that trigger off of Forest or Underground locations), which is nice since otherwise a lot of those cards never get touched.\n\nI think there's a plurality of ways to experience and enjoy the game, and that's one of it's greatest strengths.  Sometimes my playgroup and I adopt thematic limitations just for new challenges, like \"we're going to run through the Mirkwood cycle in 4 Player, but we all have to use only Gondor heroes/allies.\"  The build constraint allows for (read: requires) building entirely new decks.  And some cards that are pretty lackluster can become pretty awesome in such a four-handed cycle-run (e.g. Leadership Boromir or For Gondor! or Gondorian Discipline)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889577","commentId":3889577,"userName":"Alonewolf87","timestamp":1581247745,"content":"> 2 hours ago, AllWingsStandyingBy said:\n> \n> Did you play 4-Handed, so to speak?  Each of you running two of the decks, such that you had all four spheres covered in each quest?  Congrats either way!\n\nYes, exactly.\n\n> 2 hours ago, AllWingsStandyingBy said:\n> \n> I think there's a plurality of ways to experience and enjoy the game, and that's one of it's greatest strengths.  Sometimes my playgroup and I adopt thematic limitations just for new challenges, like \"we're going to run through the Mirkwood cycle in 4 Player, but we all have to use only Gondor heroes/allies.\"  The build constraint allows for (read: requires) building entirely new decks.  And some cards that are pretty lackluster can become pretty awesome in such a four-handed cycle-run (e.g. Leadership Boromir or For Gondor! or Gondorian Discipline).\n\nIndeed, the very high replayability of the quest and of the card pool are one of the main attractions of the game for me. And LeBoromir (especially with Visionary Leadership) was one of the lynchpins of our decks, since we built the Fellowship around a Gondor swarm of sort."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889666","commentId":3889666,"userName":"EBerling","timestamp":1581266619,"content":"I've only played through Mirkwood, Dwarrowdelf, and the first bit of Against the Shadow.  \n\nI think Dwarrowdelf is my favorite thus far, as it really feels claustrophobic and the goblin swarms and Balrog present neat combat situations.  I think Foundation of Stone is my favorite quest of the 21 I have played so far, but I would also wager that Road to Rivendell is my least favorite, since it has a variety of \"you lose\" treacheries / shadow effects that basically require you to have cancel cards or lose, which is the kind of design I hate because it necessitates that you either spam Spirit (my least favorite sphere) or pray to the Gods of Staging that you just avoid the cards.  As bad as Sleeping Sentry is, I still remember the first time my group played that quest 3 Player when back-to-back Orc Ambushes put 14 goblin enemies into staging from the discard and then had them immediately engage Player 1.  That said, Journey to Rhosgobel (Exhausition, Swarming Insects) and Return to Mirkwood (Gollum's tantrum +8 Threat treachery) aren't much better.  Even then, I really like the theme of those three quests, and they certainly do a great job of evoking the feel and struggle of those situations very well. \n\nThe idea of having to sled a wounded Eagle to Rhosgobel and then hunt for healing herbs is quite possibly even my favorite narrative from any of the first 21 quests, but it's absurdly difficult for 1-Handed (since you don't stage enough cards to find enough Athelas) and even with more players it's very dependent on Staging luck, especially if you're not scouting+setting the Encounter deck with lots of scrye cards (since the clock of treachery-damage and Wilyador's bleeding runs so quickly--maybe you'll flip some early Athelas and maybe you won't...), and enemies are such that you cannot even fight them unless you bring Ranged and Eagles, which encourages tailoring your deck against it, or else helplessly sitting there as birds and bats peck and nip your heroes to death,  aaaaaand as insult to injury it's the only quest in the first two cycles that has anything objective-related for healers and healing cards to finally offer, yet it so utterly penalizes them (discarded after one heal) that they're basically wasted resources even in the context of a quest that is all about healing.\n\nNevertheless, even despite these annoyances, I have really enjoyed the feel and the function of all of the quests I've played so far, and I happily replay all of them. \n\nI finally built my first Gray Wanderer deck this past week, and tested it by running it solo 1-Handed through the entire Mirkwood Cycle (save Dol Goldur, for obvious reasons...) and it went 7 for 8, only losing Rhosgobel (I didn't stage any Athelas or the locations that fish it).  Return to Mirkwood was dicey, but terribly exciting, finishing three threat shy of being eliminated despite starting at such low single-hero threat.  I appreciate even the hard/painful/semi-random quests (in moderation), and I think the card pool is rich enough nowadays that it's not unreasonable to expect that a single deck can be built to be versatile enough to at least have a chance at handling most situations.  I'm looking forward to trying to take the Gray Wanderer 1-Handed through Dwarrowdelf next, and time will tell if it can stomach the brutality of Road to Rivendell."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889681","commentId":3889681,"userName":"Valhalla Gaming","timestamp":1581270078,"content":"This is actually pretty hard, I felt that the game really hit its stride with the against the shadows block and has generally become more and more innovative while also smoothing out game mechanics. \n\nWhile nothing to write home about, the story has also certainly improved, going from feeling fairly disjointed, to pretty generic(against the shadows), to having an interesting overall concept in ring-maker, to having a main antagonist in Angmar Awakened, with Dream-Chaser being the clear MVP when played sequentially... Speaking of which:\n\n1. Dream-Chaser: I love that they were willing to go crazy with this block and think it really paid off. Sailing is very innovative, and I really like that the boats have different abilities that you can mix and match between your decks, or even build around. The difficulty was a very nice spread when played sequentially. A couple of the quests were a little on the easy side, but served as fun interludes(and I'm sure on nightmare will be a treat). It is usually anticlimactic when the final quest of a block is too easy but that was very much not the case here, with the climactic challenge of Sahir being one of the most epic and satisfying showdowns. \n\nWhile the actual story of the LCG isn't impressive, they hit the nail on the head here, with Sahir going from foe, to ally, to traitor. The more the designers weave characters and storytelling into the quests themselves the better- Since reading about Sahir wouldn't have been nearly as effective as you yourself dueling him, trucing with him to fight a Kraken, only to be betrayed by him alongside his ally. Thraudir in the previous cycle was a good start for this kind of design, but here they perfected it. \n\n2. Angmar Awakened: In terms of both storytelling(mainly giving points for having a boss you want to put down) and gameplay this is number 2 for me. If I had to raise a complaint it would be that the quests tended to either be too easy or very challenging, at least as memory serves, as opposed to the near perfect spread that Dream-Chaser was. The second to last quest was also one of the only normal mode encounters I feel was overtuned in terms of difficulty(mainly because the sorcery trigger really should have only happened once per round, but I digress), and made the final quest which otherwise would have been a perfect way to close out the cycle, feel a little anticlimactic. \n\n3. Against the shadow(Nightmare): So this is where my list gets a little weird, since I played from the first set up through this one on nightmare mode exclusively so my experience will have varied from others. I did play the big box on both normal and hard and can say that the nightmare decks drastically improved it, with them even removing some of the nonsense/unfun cards from the encounter decks. The \"story\" is a disjointed and generic mess, but the individual quests were pretty awesome, with The Steward's Fear being where I think their creativity started to kick into high gear. \n\n4. Ring Maker- The story was light here but I thought it worked decently, I do love the idea of ignorantly helping Saruman. The quests here were really good, though especially for the ones I played solo mode, a couple of the quests were so easy I couldn't fully appreciate the mechanics, while others were breakneck in terms of difficulty(Dunland trap and Nin-in-Eilph I'm looking at you). The dwarf ally was truly atrocious and has some nicknames in my house I won't repeat in polite company. A few of the quests here I'm really eager to play on nightmare mode and see how they fleshed them out. The final quest was reasonably challenging/climactic. \n\n5. Haradrim- I really enjoyed the Haradrim block, though for some reason I can't place my finger on it doesn't stand out in my mind compared to the top contenders. I usually groan when a quest is going to steal your heroes, but really, really liked the approach here of giving you unique units to help free them. What I will say is there was no low point here and this was one of the most consistent blocks of content.\n\n6. Dwarrowdelf(Nightmare)- I'm pretty sure I wouldn't have cared for this block playing it on normal, however nightmare elevated a few of the quests. While the story is a disjointed fever dream of Moria related things, I really liked the watcher quest on nightmare, thought the Balrog rematch was pretty cool, as well as the red horn gate/contending with Lovecraftian terrors in the deep. I think this is another one nightmare mode enhanced, both by removing some crude elements, while enhancing overall difficulty.\n\n 7.  Shadows of Mirkwood(nightmare and normal)- Really not much to say here, while the content is an ideal starting point for players, I've been so spoiled by memorable quests that these ones barely register and on normal mode are a cakewalk. \n\n8 Hobbit Saga- I played this as a solo puzzle on nightmare mode and while I can see why it gets hate, when played this way its really not too bad. It is the polar opposite of the kind of content you'd want to sit down and tackle with some friends though, with the exception of the battle of the five armies which is simply a stellar quest. \n\nThe LOTR Saga I haven't finished yet, but from what I've seen so far on normal mode, I've been a huge fan. \n\nI've reviewed every quest I've played here: \n\nThough its missing a few of my most current quests."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3889910","commentId":3889910,"userName":"Vince79","timestamp":1581299824,"content":"> 16 hours ago, AllWingsStandyingBy said:\n> \n> That said, for those who really enjoy deck-building, I'm sure tech-ing against a particular quest is a satisfying exercise that puts a much greater variety of cards onto the table (e.g. like silver bullet cards that trigger off of Forest or Underground locations), which is nice since otherwise a lot of those cards never get touched.\n\nWell, I play one handed solo, so that might have something to do with it.  If you play two handed, you could probably get away more with having the one-size-fits-all deck.  Some quests just really call for a specific deck to my mind.  Like you mentioned, Journey to Rhosgobel is kind of a unique scenario, I can't imagine playing it without giving some mind to the goal you're trying to accomplish.\n\nThen if you consider all the expansions and adventure packs there are, that's a pretty big expense to outlay if you're only going to use 40 or 50 cards out of the whole bunch.  By trying lots of different decks, I get to use cards and approaches I probably wouldn't otherwise see.  Like there's the \"horde of allies\" approach opposed to the \"Few allies, buff all the heroes to the max with attachments\" approach.\n\nThen the different cycles seem to call for different cards thematically.  I can't imagine playing Dwarrowdelf without dwarves, it's what the whole cycle is about.\n\nWow, the Hobbit cycle is not getting much love here, is it?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3893722","commentId":3893722,"userName":"PocketWraith","timestamp":1581650159,"content":"> On 2/8/2020 at 7:45 PM, Vince79 said:\n> \n> I'm surprised that you've all played through all those cycles.  I find the game very time consuming, what with tweaking decks and strategies for each quest.  I've been playing for a year and a half and I've only played through three cycles and the Hobbit saga.  \n\nWell, the game has been out for 9 years, so some of the people responding here may have played the game for six times as long as you have.\nAlso, some people play faster or deckbuild faster than others, and some people play more often than others.\n\n> On 2/10/2020 at 1:57 AM, Vince79 said:\n> \n> Well, I play one handed solo, so that might have something to do with it.  If you play two handed, you could probably get away more with having the one-size-fits-all deck.  Some quests just really call for a specific deck to my mind.  Like you mentioned, Journey to Rhosgobel is kind of a unique scenario, I can't imagine playing it without giving some mind to the goal you're trying to accomplish.\n\nActually I'd say the vast majority of players looking for the One Deck to Rule Them All are solo players. But then a lot of such decks may end up as more just One Deck to Rule Most of Them because of quests like Journey to Rhosgobel. Even Seastan's infamous One Deck [https://ringsdb.com/decklist/view/8682/the-one-deck-1.0], which has actually beaten every quest released at the time he built it, took an excessive number of attempts to score a win against Mount Doom due to being very ill-suited to the particular demands of that quest, and against Nightmare Escape from Dol Guldur because Nightmare Escape from Dol Guldur is ridiculous especially in solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894050","commentId":3894050,"userName":"EBerling","timestamp":1581698206,"content":"> 13 hours ago, PocketWraith said:\n> \n> Even Seastan's infamous One Deck [https://ringsdb.com/decklist/view/8682/the-one-deck-1.0], which has actually beaten every quest released at the time he built it, took an excessive number of attempts to score a win against Mount Doom due to being very ill-suited to the particular demands of that quest, and against Nightmare Escape from Dol Guldur because Nightmare Escape from Dol Guldur is ridiculous especially in solo.\n\n\nWhat happens here with Redhorn Gate and Road to Rivendell?  Because a third of Dwarrowdelf starts with objective-ally Arwen in play, did Sestan just kept his Arwen Hero in play (basically playing with two Arwens on the board), or did he actually discard his Arwen hero and play with only two heroes?  Those quests are \"easy\" enough and Arwen absurdly powerful enough that it might be worth tackling those two quests down a hero just to have Arwen as an option for the other 90+ quests in the run.  The alternative would be to look for a One To Rule Them All deck that has no heroes that appear as objective allies/heroes, which excludes a handful of folks."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894066","commentId":3894066,"userName":"Zura","timestamp":1581698953,"content":"> 11 minutes ago, EBerling said:\n> \n> \n> What happens here with Redhorn Gate and Road to Rivendell?  Because a third of Dwarrowdelf starts with objective-ally Arwen in play, did Sestan just kept his Arwen Hero in play (basically playing with two Arwens on the board), or did he actually discard his Arwen hero and play with only two heroes?  Those quests are \"easy\" enough and Arwen absurdly powerful enough that it might be worth tackling those two quests down a hero just to have Arwen as an option for the other 90+ quests in the run.  The alternative would be to look for a One To Rule Them All deck that has no heroes that appear as objective allies/heroes, which excludes a handful of folks.\n\nhe kept arwen but it's possible with discarding her"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894257","commentId":3894257,"userName":"Vince79","timestamp":1581710193,"content":"> 16 hours ago, PocketWraith said:\n> \n> Actually I'd say the vast majority of players looking for the One Deck to Rule Them All are solo players. \n\nThat's interesting, because I've been thinking they must be playing in groups, so if they're lacking something maybe the other players can provide it.  Because I play true solo, and I can't imagine only ever playing one deck.  As you say, a lot of quests seem to call for a specially built deck.  I can barely go from one scenario to another without thinking \"Hmm, I should throw this card in here and take that one out.  This quest calls for a lot of healing.  There are condition attachments in this one, I better add Miner of the Iron Hills\", that sort of thing.  There are so many different challenges I don't understand how one deck could possibly be built to deal with them all.  I mean people do it, so it must work, but on some scenarios their win percentage must drop pretty low.  But maybe that's part of the fun and challenge for them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894334","commentId":3894334,"userName":"dalestephenson","timestamp":1581713498,"content":"I think Seastan's deck is highly unusual, perhaps unique, in that it *actually beat* all the quests.  It's the only deck that *could* beat all quests, but with so many quests it would get extremely boring.\n\nMost One Deck makers, I think, enjoy the process of building a deck *capable* of defeating all quests, but aren't particularly interested in *actually* defeating all decks.  In the case of errata-prompting decks that are actually broken, proving that deck *can* beat most quests on the first turn is sufficient -- actually playing it out would be pointless.  Seastan has published 235 decks at ringsdb, even if some are revisions of the same deck it's pretty clear he hasn't been looking for a single deck he can just keep playing forever.\n\nThe question of how many quests to play with a given general-purpose decks is all about personal enjoyment.  When I first started playing Dori fellowships, I'd play only a couple quests and then move on to the next one -- but I felt like I didn't have enough time to really enjoy them with so few plays, so now I've been playing an entire cycle with the same pair of decks (sometimes modifying it mid-cycle not in response to a particular quest, but to make it better in general).  I've enjoyed that, but the flip side is that I have assorted Dori fellowships created and never played.  I have *far* more decks to try than I have time to try them!\n\nWhat about the specific requirements of a quest?  *Most* quests don't require extremely specific deckbuilding, and it annoys me (Riddles) when it does.  I try to cope with things like conditions with a modest number of sideboard cards I can add in -- the most common being location-management, condition-removal, healing, threat reduction, and shadow protection.  I rarely bother taking cards out -- if I need more healing, I just drop in a few cards I think will help and just let the card count rise.\n\nThere are quests that are sufficiently tough that my deck(s) and skills just aren't good enough to beat it without extreme luck; but as far as I'm concerned the Grace of the Valar variant is an adequate way to deal with such quests.  Not every solo deck needs to be capable of taking down Carn Dum without help."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894603","commentId":3894603,"userName":"Vince79","timestamp":1581738028,"content":"Having one deck to rule them all would presumably be taking shape over time, as the card pool increases.  So just how much of a \"one\" deck is it really?  Eventually it will reach a point where it is done (when the game is finished, most likely).  But it can't be considered a \"progressive\" style deck if you go back and play all the quests - not that it matters.  \n\nSeems like if you just stick to one deck of 50 cards (or whatever size it might be), you're missing out on a lot of different cards and styles you could be playing.  But I guess just because you have \"one deck\", that doesn't mean you have to play it all the time.  It just means you have it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3894734","commentId":3894734,"userName":"dalestephenson","timestamp":1581777097,"content":"I think \"One Deck to Rule Them All\" necessitates having access to \"them all\".  Those are decks constructed from the entire card pool, with the intent that they can beat the whole corpus of quests.  It's possible for a deck iterated slowly as you go through the entire progression to become such a deck at the end, but it must be very rare.  I myself took the Beorn's Path decks progression-style through Dreamchaser/Land of Shadow, but LeAragorn/Theodred/LoDenethor and SpEowyn/Thalin/Gimli likely aren't ideal heroes for One Deck status.  Nor, during progression did they beat all the quests without sometimes working together, and/or dropping to semi-easy/easy mode.  And I figured a win by *either* deck was enough to keep progressing.\n\nBut I haven't played either deck in a while, since I lost my campaign notes for what boons/burdens they'd selected and didn't feel like repeating the first twelve saga quests.  I have so many decks to play that I don't know when I'll revisit my old friends, and so many heroes I've never even tried.\n\nProgression-style players play a lot of different ways.  Someone like me may take the same heroes and just tweak his deck from pack to pack, somebody else may build a new deck or decks from scratch when opening a new pack.  Some may do both.  There's no right or wrong, and I have no idea what style of play is most common."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3907300","commentId":3907300,"userName":"JonG","timestamp":1583344848,"content":"I'm a bit unusual because unlike most LoTR LCG Players, I don't like the Sagas as I find them too grinding. I prefer the looser system of the adventure cycles where I can do what I please at my own pace (i.e. just break out a pack and play as I choose).\n\n \n\nI'm principally interested in a mix of how immersive the stories are, how fun the scenarios are too play, and how good/thematic player cards are. They're all good (no duds in this game!) but based on the above views my rankings would be;\n\nDwarrowdelf\n\nDreamchaser\n\nAngmar Awakened\n\nAgainst the Shadow\n\nHaradrim\n\nRing Maker\n\nHunt for Gollum\n\n \n\nHaven't played the others.\n\n \n\n \n\n \n\nEdited March 4 by JonG"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3908922","commentId":3908922,"userName":"Vince79","timestamp":1583534530,"content":"> On 2/9/2020 at 11:43 AM, EBerling said:\n> \n> The idea of having to sled a wounded Eagle to Rhosgobel and then hunt for healing herbs is quite possibly even my favorite narrative from any of the first 21 quests, but it's absurdly difficult for 1-Handed (since you don't stage enough cards to find enough Athelas)\n\nI play one handed and I didn't think it was that difficult.  It does call for a very specific deck though.  Not saying it's easy, but there are a lot of scenarios I thought were too difficult, and that wasn't one of them."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3910038","commentId":3910038,"userName":"EBerling","timestamp":1583761627,"content":"> On 3/6/2020 at 5:42 PM, Vince79 said:\n> \n> I play one handed and I didn't think it was that difficult.  It does call for a very specific deck though.  Not saying it's easy, but there are a lot of scenarios I thought were too difficult, and that wasn't one of them.\n\n\nWell, when I say \"difficult\" I mean \"difficult without tailoring a specific deck against said quest.\" \n\nPersonally, I'm a player that doesn't believe in tailoring decks to particular quests because it often trivializes the challenge of the game while also meaning your deck-building every time you want to play a new quest.  Siege of Cair Andros is a challenging quest for the typical deck, but you can throw together a tailored mono-tactics deck and cake walk it, because you're now entirely immune to The Master's Malice and the economy-shutdown of Orc Vanguards, not to mention your stat spread is typically way better for Siege/Battle questing.  Factor in the protection afforded from 3x Fient/Thicket of Spears and it's like \"simply walking into Mordor\" sorts of easy.\n\nI enjoy the deck-building aspect of the solo game by trying to build a generalist deck that is capable of 1-Handed Solo-ing entire cycles, which I realize is not how everyone approaches the game.  I enjoy the challenge of trying to make a deck that's a toolbox of various options, and I get my satisfaction from watching it beat a disgusting quest without being specifically tailored against it.  For instance, my take on a Grey Wanderer deck has now beaten the entire Mirkwood Cycle, Dwarrowdelf Cycle, and Heirs of Numenor box in 1-Handed solo (caveat: obviously skipping Escape from Dol Guldor), and quests like Rhosgobel and Cair Andros were the real gate-keeper quests potentially preventing such a run.  Interestingly, quests I've found to be easy in multiplayer like Redhorn Gate and Foundations of Stone were very tricky for a 1-Handed Wanderer, because cards like Bitter Cold and Lost and Alone (respectively) become horrifying cards for a lone hero.  \n\nAnd I think that's a great strength of the game.  There are so many different ways to approach it (1-Handed, 2-Handed, multiplayer, Deckbuilding to Quests, Deckbuilding to Cycles, Searching for \"The One\" kind of generalist deck, etc.) and each mode of tackling and experiencing the game leads to different sorts of challenges, experiences, and rewards.\n\nEdited March 9 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3910619","commentId":3910619,"userName":"Vince79","timestamp":1583813755,"content":"> 14 hours ago, EBerling said:\n> \n> Well, when I say \"difficult\" I mean \"difficult without tailoring a specific deck against said quest.\" \n\nI see.  As you note, we all play the game differently, and I think that's a good thing.  It's actually kind of amazing that this game supports so many different approaches.\n\nIf Siege of Cair Andros is the one I'm thinking of though, I wouldn't describe it as a cakewalk even with a mono-Tactics deck.  If anything, the game seems to be asking you to use a mono-Tactics deck.  Which I was fine with, because up until that point I had never played a monosphere deck, except when I first started out with the Core Set and I played each sphere independently to get a feel for them.  So I looked at it as an opportunity to try something new.  \n\nSimilar with A Journey to Rhosgobel.  It encouraged me to use some cards I had never used before, like some healing cards, eagle cards, and Radagast.  Generally, like you, I like to find one themed deck to play through a cycle with one handed.  I'll add or subtract some cards here and there throughout the cycle, but I try to keep the same heroes  for the most part, but I'm cool with changing those too if  appropriate.  The Rhosgobel quest kind of stuck out like a sore thumb, it was so different than the others, but that was actually refreshing.  \n\nIt just seems to me that if a quest seems to be asking you to use certain cards, I might as well use them.  I appreciate that you like the challenge of using one deck for an entire cycle.  But if one scenario becomes a sticking point, and the winning percentage dips too low, that irritates me for a number of reasons.  For one thing, if I only win 5-10% of the time, it seems like I'm just relying on \"luck\" in some ways - waiting to get lucky with just the right encounter cards being revealed so as not to hose me.  It's certainly not all luck, you still need a good deck to have a chance.  But I see changing some cards in the same way that I see how some scenarios call for a different strategy.  For example, some quest cards you want to zip through quickly, some you want to take your time with while you build up, some you want to go not too slow, not too fast.\n\nI play one handed, but I know I'm missing out on a few game experiences by doing that.  The ranged and sentinel keywords are basically meaningless one handed, for instance.  Doesn't matter, I enjoy one handed.  Maybe one day I'll try going through two handed, or get with a group, who knows?  But I'm fine with this for now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3910831","commentId":3910831,"userName":"EBerling","timestamp":1583853778,"content":"> 10 hours ago, Vince79 said:\n> \n> But if one scenario becomes a sticking point, and the winning percentage dips too low, that irritates me for a number of reasons.  For one thing, if I only win 5-10% of the time, it seems like I'm just relying on \"luck\" in some ways - waiting to get lucky with just the right encounter cards being revealed so as not to hose me.  It's certainly not all luck, you still need a good deck to have a chance.\n\n \n\nThis is such a good point, and one that I think is often overlooked by the \"One Deck to Rule Them All\" camp, myself included. \n\nMy own personal threshold is 5 Attempts per quest.  After that, it does just feel like you're just going through the motions and waiting for the Encounter Deck to sputter out on you so you can slip through."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3940617","commentId":3940617,"userName":"Vince79","timestamp":1589678605,"content":"I've played through most of Ring-Maker cycle now and I see why most people rated it so consistently low.  The Time mechanic is simply not fun at all.  In fact, I would call it annoying.  I don't like fiddly quests anyway.  The storyline is interesting, I'll give it that.  But I can't wait to get out of it, to be honest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3940867","commentId":3940867,"userName":"NathanH","timestamp":1589754512,"content":"Time for Science! I ranked each quest according to what my response would be if someone asked me to play that quest:\n\n * 0: I won't play it\n * 1: I don't want to play it\n * 2: I don't want to play it with just any deck\n * 3: I will play it\n * 4: I look forward to playing it\n * 5: I want to play it twice\n\nHere are the results:\n\n\n\t1\t2\t3\t4\t5\t6\t7\t8\t9\tAverage\nCore\t1\t3\t1\t3\t4\t1\t2\t1\t1\t1.89\nKhazad\t3\t4\t1\t3\t2\t3\t3\t5\t1\t2.78\nHeirs\t2\t2\t2\t4\t3\t3\t3\t4\t2\t2.78\nVoice\t3\t1\t3\t2\t3\t4\t0\t4\t4\t2.67\nRealm\t4\t3\t2\t5\t4\t3\t4\t1\t4\t3.33\nHavens\t2\t3\t4\t2\t4\t3\t4\t5\t4\t3.44\nHarad\t4\t3\t4\t4\t3\t1\t3\t3\t3\t3.11\nHob 1\t1\t1\t1\t\t\t\t\t\t\t1.00\nHob 2\t3\t1\t4\t\t\t\t\t\t\t2.67\nRings 1\t2\t5\t3\t\t\t\t\t\t\t3.33\nRings 2\t4\t4\t4\t\t\t\t\t\t\t4.00\nRings 3\t2\t4\t3\t\t\t\t\t\t\t3.00\nRings 4\t3\t2\t3\t\t\t\t\t\t\t2.67\nRings 5\t2\t3\t4\t\t\t\t\t\t\t3.00\nRings 6\t3\t3\t1\t\t\t\t\t\t\t2.33\n\nScience tells us that Grey Havens and Dreamchaser are the best non-saga, and The Road Darkens is the best saga. I've left Rhovanion and beyond off, because I haven't played with them enough to form an opinion yet, apart from to say Fire in the Night is at best a 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3941663","commentId":3941663,"userName":"Vargas79","timestamp":1589933761,"content":"I’m relatively new to the game. I play solo only. I’ve so far played:\n\nShadows of Mirkwood cycle\n\nHobbit saga\n\nThe black riders & the road darkens\n\nKhazad-dum\n\n \n\nMoria is the place for me! Khazad-dum and journey in the dark from the Road Darkens had me punching the air with delight at points. I’m really in love with the game.\n\nThe Hobbit saga has a lot of detractors but I thoroughly enjoyed On the Doorstep - aside from that fiddly poison mechanic. \n \n\nShadows of Mirkwood was a bit of a bore.\n\nIve got the Dwarrowdelf cycle to complete next and then onto the Grey Havens. I’m buying full cycles when I find them. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3943002","commentId":3943002,"userName":"Crusaderlord","timestamp":1590141102,"content":"My thoughts on the deluxe boxes and cycles can be found here > http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/ [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg-expansions/]\n\nI particularly enjoy the Mines of Moria themed quests, and those around Mirkwood. So far Khazad-dum and Dwarrowdelf wins for me with Wilds of Rhovanion a strong second (not fully played through yet) - after that Angmar and Dreamchaser stand out above the rest.\n\nI keep updating my site as i play more quests and a review list of my favourite individual quests from a solo play emphasis are found here > http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/ [http://crusadersgames.co.uk/board-games/lord-of-the-rings-lcg/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305364-rank-the-cycles-quest-and-story/?do=findComment&comment=3944882","commentId":3944882,"userName":"Valhalla Gaming","timestamp":1590568746,"content":"> On 5/16/2020 at 9:23 PM, Vince79 said:\n> \n> I've played through most of Ring-Maker cycle now and I see why most people rated it so consistently low.  The Time mechanic is simply not fun at all.  In fact, I would call it annoying.  I don't like fiddly quests anyway.  The storyline is interesting, I'll give it that.  But I can't wait to get out of it, to be honest.\n\nI will say nightmare mode fixes quite a few of the say/meh quests"}]}