{"url":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/","title":"Solo League 18 -- Angmar with Mirkwood cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3885971","commentId":3885971,"userName":"dalestephenson","timestamp":1580785673,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from Lost Realm and the Angmar Awakens cycle. The quests are:\n\n1) Deadman's Dike (Lost Realm)\n2) Escape from Mount Gram (AP #2)\n3) The Dread Realm (AP #6)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Halbarad, Tactics Aragorn, Rossiel, and Arwen.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, after you draw/mulligan your initial hand you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Deadman's Dike and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing The Dread Realm it does not matter how many tokens I needed to defeat Escape from Mount Gram.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside LR/Angmar, Mirkwood and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered and decided last month's league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from LR/Angmar, Mirkwood or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from LR/Angmar and Mirkwood. More is better.\n\n3rd) The number of heroes used from this list: TaAragorn, Halbarad, Rossiel, Arwen. More is better.\n\n4th) The number of cards in the deck outside LR/Angmar and Mirkwood. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Lost Realm, Escape from Mount Gram, and Dread Realm. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in January's Solo League (if you didn't play or finish January's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for April's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in April's league. March's cycle will be chosen by the winner of January's league.\n\n7) Weekly deadlines will be on Monday at 11pm Eastern. Only the final deadline really matters for scoring (and it can be delayed if requested) -- the first two deadlines are only to be included in intermediate standings.\n\nDeadman's Dike: Febuary 10th\nEscape from Mount Gram: February 17th\nThe Dread Realm: February 24th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/19HU0UtLuWdYGX2U9LE4TTzYN8Vnd0APLRbmKvtCowGo/edit?usp=sharing [https://docs.google.com/spreadsheets/d/19HU0UtLuWdYGX2U9LE4TTzYN8Vnd0APLRbmKvtCowGo/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results (I hope to do this), but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3887963","commentId":3887963,"userName":"rees263","timestamp":1581006599,"content":"I have a query about the Valar tokens and Escape from Mount Gram. By the rules given we must make our choices on how to use the tokens before following the quest setup instructions and replacing our starting hand. Is this the intention?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3887977","commentId":3887977,"userName":"General_Grievous","timestamp":1581007550,"content":"Well the wording on the quest is draw a new starting hand of 3 cards so I would argue it could apply in either spot and makes more sense in the second one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3888044","commentId":3888044,"userName":"dalestephenson","timestamp":1581012799,"content":"As described I think the timing of the tokens is meant to be prior to quest setup, which means in this quest only resources placed on the hero you will choose would be any use.  But if you need tokens against this quest I don't mind if you do after the new hand is drawn -- the point of the variant is to help you win, after all."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3888095","commentId":3888095,"userName":"General_Grievous","timestamp":1581016841,"content":"Dead man's Dike, went fairly well, the first out of the Wild got rid of Stinker which happened to be the second card in. With secrecy and noiseless movement I never had to engage an enemy I didn't want to, and was able to focus on questing. Throughout the game I drew all three Gandalfs and both sneak attacks which really helped (I used one for Threat, two for draw and the last two for dealing direct damage to Thaurdir, again with the low threat and noiseless movement combo I was able to hold off engaging him until I was ready and then fail at questing so I could engage him with a full company ready for battle and sacrifice Henmarth Riversong to be able to kill the boss with the rest. Also randomly lost Smeagol earlier from a sorcery card reveal which causes an unanticipated attack. It was fun sneaking around through and playing with the encounter deck. No tokens used.\n\n \n\n \n\nEscape From Mount Gram\n\n \n\nI chose Sam and it was actually fun to lock up Smeagol knowing he was buried somewhere in Mount Gram like the miserable creature he is haha. I also drew Stinker as my first encounter card which was also funny as it was a dead card. Opening hand had Steward of Gondor and Resourceful in it so I wasn't wanting for resources for the rest of the game. Prison cell netted me Firyal which was incredible. And the hero I rescued first was Rossiel who became able to ready each round thanks to Swift and Silent and my low threat. We escaped without too much trouble and with so few cards in my capture deck I managed to rescue everything before progressing to the next stage. And having Treebeard and all three Wellinghall Preservers as part of my prison break made poor Jailor Gornakh's job a difficult one. And I even managed to Firyal scout the other Stinker card away so my sketchy hero has thus far been loyal to me until the end. My Elven Magic prevailed again, onto the last quest which I'm sure is going to give me some trouble. No tokens used."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3889451","commentId":3889451,"userName":"rees263","timestamp":1581213220,"content":"Went with a Rossiel deck because I've never used her before. Deck list is here:\n\nhttps://ringsdb.com/decklist/view/14412/february2020sololeague-1.0 [https://ringsdb.com/decklist/view/14412/february2020sololeague-1.0]\n\nStarting hand for Deadman's Dike was only okay and it took time to get going. Iarion became a 4/4/4/4 pretty quickly, but it took a while to clear locations and side quests, lost quite a few cards from the deck in the meantime. Gaffer Gamgee appeared and I only took one more attack this game (Thaurdir at the end). Ghan-buri-Ghan did some good work too. Still felt like it took a long time to build up enough allies. 2 early Woodman's clearings kept me out of danger, although overall locations were few and far between. Never got one in the victory display either. Eventually my force was ready and with luck and Gandalf I was able to take down Thaurdir - exactly 9 damage and quested for exactly enough. If a sorcery had been revealed I would have been in trouble. 7 cards left in the deck.\n\n0 tokens\n\nEdited February 10 by rees263"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3896028","commentId":3896028,"userName":"rees263","timestamp":1581969361,"content":"For Escape From Mount Geam I had a dubious start, revealing the Stop the Executioners side quest round one. I rescued Gildor Inglorion from the initial Prison Cell, but I was immediately foiled as Captives of Gornakh put him right back. At this point I was in serious danger of failing to quest successfully let alone beat the sidequest. I only managed it through the combination of turn one resourceful + Gandalf who was rescued from under 2B on turn one. Then, a lucky encounter draw of Feeble and Weary plus Henamarth's noble sacrifice allowed me to rescue Mirlonde plus other allies from the executioners block.\nAfter this it was smooth sailing. Careful questing plus a timely draw of Scout Ahead meant I was able to stall 1B until I had drawn the entirety of both my decks plus reshuffle the encounter deck before the additional orcs got shuffled in. By this point I was collecting 6 resources per turn and filled the board with allies. I'd also managed to put 5 encounter cards in the victory display so Rossiel was ready for almost anything.\n\nThe only wrinkle is that I lost Rossiel on the penultimate turn to an ill-timed shadow card (Angmar Marauder of course), but luckily it was far too late to matter.\n\n0 tokens\n\nEdited February 27 by rees263"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3896571","commentId":3896571,"userName":"General_Grievous","timestamp":1582040126,"content":"Took my secret heroes into Dread Realm, and too my surprise they actually performed really well. A round one Resourceful on Sam allowed me to play Steward off Gondor on Rossiel second round so money was always flowing. I also managed to put a witch of Angmar in the victory display first round which turned Rossiel into a defensive tank. The big combo this game was using the Wooland sentry pretty much every every round along with The Elven King to defend with Rossiel twice while being able to simply discard most enemies and locations as my victory display collection kept growing. I also managed to toss one copy of Stinker and drew the other as a shadow card. This deck cruised through the last scenario and finished first try with no tokens. \n\nI feel like with the Woodland Sentry and Smeagol that Rossiel decks have actually become quite potent. Still a bit luck-based and quest-dependent for sure but being able to select a particularly annoying enemy, brutal treachery, or costly location and simply remove them from the game whenever they appear again is amazing and bumps up the power of our magical Silvan hero to modern proportions.\n\n \n\nSmeagol likewise I didn't think much of on first seeing but having played him with Beorn to be able to run him in secrecy and now in a Rossiel deck, it's been pretty awesome to see him at his best, and he definitely helps make three hero secrecy decks much more viable and varied. \n\n \n\nAll in all 0 tokens and great performance of the Silvan magical trickery."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3897004","commentId":3897004,"userName":"dalestephenson","timestamp":1582065413,"content":"My thought for this month was that with Mirkwood cards, it'd be a good time to put together an Eagles deck with Radagast.  I used TaAragorn, TaEowyn, and Radagast.  I also made a big thick deck to avoid any issues from Deadman's Dike, though in retrospect I should've put in some more questing power -- Rangers of Cardolan, for example.\n\nI was worried about Deadman's Dike, I had been trying an experimental Lothiriel deck against it and it had been eating my lunch.  But this deck had more combat power (if less questing power), plus Eowyn to take down the boss at the end.  I had some dicy moments (such as when Cursed Dead helped give me six enemies at once), but with Radagast's Staff I was able to churn out the Eagles before I got to that point and was able to finish with zero tokens.  rees263 and General_Grievous also made it through unscathed with their Rossiel decks (outside cards in parens):\n\n0 General_Grievous (18)\n0 dalestephenson (29)\n0 rees263 (37)\n\nThen came Escape From Mount Gram.  I hadn't worried much about this quest, since it's the easiest of the entire cycle and usually a fun little romp.  So I had neglected to notice that my big fat deck was pretty much all allies and items, leaving a \"deck\" that consisted of the following cards:\n\n1x Song of Battle\n3x Support of the Eagles\n1x Wingfoot\n2x Feint\n3x Gwaihir's Debt\n3x The Eagles are Coming\n3x Word of Command\n\nTo say that's a worthless deck would be an understatement.  The first attempt I picked Radagast on the theory that he could play everything in the deck -- but with only 2 wp I didn't get far.\n\nThe second attempt I went with TaEowyn, but the Misty I put into play got stolen by the encounter deck and I never managed to get another quester.\n\nThe third attempt TaEowyn got further -- too far, as a general lack of threat made her overquest and sent her and TaAragorn into the second stage prematurely.  I used her ability to take out the Jailor, but failed to get any more willpower on and 3-threat enemies sent me into a tellspin.\n\nFinally the fourth attempt (three tokens) went better.  It started out badly when traveling to Prison Cell revealed two Gandalfs and Radagast's staff -- with no enemies in play.  What a terrible time for a \"free\" Gandalf.  But then I caught a huge break when the Stop the Executioner sidequest came out.  With zero threat I was able to liberate Aragorn from stage one without clearing it, then I could quest full against the side quest without worrying about overquesting.  Better yet, I saved Radagast and Hennamarth from the chopping block, giving me my full hero allotment and a way to avoid overquesting.  When I advanced to stage two I had Treebeard and a number of other allies ready, and we stomped the final stage quickly.\n\nIt could've been much worse -- it really is *not* a good deck for this quest.\n\nNeedless to say, Rossiel and her events works a lot better for this quest:\n\n0 General_Grievous (18)\n0 rees263 (37)\n3 dalestephenson (29)\n\nAnd that leaves the total:\n\n0 General_Grievous (18)\n0 rees263 (37)\n3 dalestephenson (29)\n\nStill not too late to put a deck together and lead them to ignominy at Mount Gram!  On to Dread Realm, where I'll see how badly a flock of low-willpower eagles does with managing underground locations."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3897307","commentId":3897307,"userName":"General_Grievous","timestamp":1582094452,"content":"Great write-up! Sheesh that's a rough deck to take into Mount Gram. I ran into that the first time I ever played Mount Gram as I was running Eagles and weapons and it did not work out. Rossiel or Sam are definitely the heroes for it. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3903408","commentId":3903408,"userName":"rees263","timestamp":1582809261,"content":"The Dread Realm:\n\nFull disclosure, I've never managed better than a *win on this one. I went straight in with 6 tokens because this deck has shown to be pretty hopeless against this quest.This effort ended pretty quickly, which is unsurprising when you invest all your Valar tokens into getting Treebeard into play on turn one and then he gets possessed on turn two. A new candidate for my most hated treachery!\n\nAttempt two also began with Treebeard, but this time I also managed to snag a copy of Possession with Out of the Wild. It felt really good to Close the Door on the second copy later on. My other Out of the Wilds also appeared early and got two Cursed Deads out of the deck, another great victory display candidate. One last highlight was to see five Sorcery cards with Scout Ahead and engineer all of them to whiff or be discarded as harmless shadow cards. Once I got Henamarth and Firyal in play I stalled until I was ready to take on Daechanar. Firyal also kept the number of in play sorceries down to two, one of which I cleared away with Elrond. Then it was simple enough to deal with the Boss and quest to victory. 7 tokens.\n\nTotal: 7 tokens\n\nEdited February 27 by rees263"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3903976","commentId":3903976,"userName":"General_Grievous","timestamp":1582880664,"content":"That's a super rough treachery to hit the strongest ally in the game! I think this is why I run Eleanor exclusively when playing with coop with my wife. Too many game-ending treachery cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3904054","commentId":3904054,"userName":"rees263","timestamp":1582897519,"content":"I think I'll consider Eleanor when I do a re-run - some treacheries are just so brutal."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3904122","commentId":3904122,"userName":"General_Grievous","timestamp":1582904092,"content":"She makes it so much better for treachery heavy quests, Firyal as a hero is going to be huge too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3907851","commentId":3907851,"userName":"dalestephenson","timestamp":1583425337,"content":"Sorry for the lateness of closing this out.\n\nMy first try against Dread Realm I went with four tokens, as that would be enough for me to get third place on tiebreakers.  I figured I would be OK with combat, but clearing locations before everyone died in the third stage would be dicey.\n\nUnfortunately, I failed to get the mulliganed-for Radagast's Staff, and I used my tokens on cards trying to get it.  As the Staff never showed up, I wound up having lots of cards and not enough resources.  I took my time in the first stage and built up a mighty army, other than high threat everything was under control when I moved to the second stage (three treacheries in play).\n\nAnd then more treacheries and two more reveals of Cursed Dead mucked things up.  I managed to get through the first wave by using up Treebeard's associated resources, but Thaurdir taking out an expensive chump every turn whittled my forces, and I finally ended up with more enemies than I could defend, let alone destroy.  Never got to the third stage.  Tactics Boromir would've been handy in this quest, I could've taken out seven in one blow.\n\nSo having locked in last place overall, I jumped to seven tokens to see if I could not finish last against this quest.  My initial hand was full of goodness: his staff, a Misty, Treebeard, a Wellinghall Preserver, ABB for Radagast, Rohan Warhorse for Aragorn.  I took all the tokens in resource to get as much down as possible, this proved to be a tactical error as the rest of the game I was card-starved with plenty of resources.  I got Henamarth early to know what was coming, but accidentally overquested when all he saw was a surging treachery, and wasn't as built-up as I'd like when Thaurdir came into play -- I ended up with two cursed dead, two animated and a +2 Thaurdir to defend against, but between Treebeard's ready, and Radagast Staff to ready one of my two mistys, I managed to defend all attacks while only losing a Misty, clear out all four lesser foes and take out one of the sorceries.  Next turn the sorcery treachery didn't stay in play and I dinged him again (chumping a Descendant of Thorondor), so the following turn I was able to chump with a Vassal and take him down.  It took two turns to quest through stage three, luckily no new locations came out so only Henamarth was lost.\n\nSo against the Dread Realm (outside cards in parens):\n\n0 Thanee (17)\n0 General_grievous (18)\n7 dalestephenson (29)\n7 rees263 (37)\n\nAnd for all three combined:\n\n0 Thanee (17)\n0 General_grievous (18)\n7 rees263 (37)\n11 dalestephenson (29)\n\nSo Thanee takes first and gets to choose April's cycle, General_grievous gets to choose a quest from that cycle to play, rees263 gets to choose a quest from that cycle to exclude, and I get to choose a supplemental cycle for player cards.  Thank you all for playing!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3908189","commentId":3908189,"userName":"dalestephenson","timestamp":1583449752,"content":"Thanee has chosen the Ered Mithrin cycle.  Now General_grievous gets to choose a quest from that cycle. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3908300","commentId":3908300,"userName":"General_Grievous","timestamp":1583463442,"content":"Fire in the Night to play please, love that quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3908404","commentId":3908404,"userName":"dalestephenson","timestamp":1583491118,"content":"Why are the easy quests never picked!  Over to rees263 for a quest to exclude."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3908447","commentId":3908447,"userName":"rees263","timestamp":1583500298,"content":"I think it speaks well of the cycle that there wasn't a quest that I immediately wanted to skip. \n\nThat said, lets leave out The Ghost of Framsburg."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305371-solo-league-18-angmar-with-mirkwood-cards/?do=findComment&comment=3908512","commentId":3908512,"userName":"dalestephenson","timestamp":1583505675,"content":"That should save us a few hours....\n\nRNG says:\n\nRoam Across Rhovanion and The Fate of Wilderland\n\nMandatory heroes are Haldan, Thranduil or Radagast.\n\nI'm choosing Mirkwood again to help out Radagast.  I think he can do better than he showed against Angmar."}]}