{"url":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/","title":"Tactics Bilbo with Immune enemies","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3890909","commentId":3890909,"userName":"JYoder","timestamp":1581396677,"content":" \n\nI realize Bilbo can't cause them damage, but can he still simply \"choose\" such an enemy to only boost his willpower?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3890916","commentId":3890916,"userName":"stimpaksam","timestamp":1581397963,"content":"> 19 minutes ago, JYoder said:\n> \n>  \n> \n> I realize Bilbo can't cause them damage, but can he still simply \"choose\" such an enemy to only boost his willpower?\n> \n>  \n\nUnfortunately not, you can't choose any card that's immune.\n\nPage 9 of the online rules reference: If a card is immune to a specified set of effects, it cannot be chosen as the target for or affected by effects that belong to that set.\n\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891017","commentId":3891017,"userName":"dalestephenson","timestamp":1581418481,"content":"As an aside, I'm not at all fond of preventing immune enemies from being \"chosen\" by cards when the choice doesn't actually affect the immune card in any way, shape, or form.  I don't see the enemy as a \"target\" for Bilbo's willpower, only for his damage."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891023","commentId":3891023,"userName":"player3351457","timestamp":1581421554,"content":"> 49 minutes ago, dalestephenson said:\n> \n> As an aside, I'm not at all fond of preventing immune enemies from being \"chosen\" by cards when the choice doesn't actually affect the immune card in any way, shape, or form.  I don't see the enemy as a \"target\" for Bilbo's willpower, only for his damage.\n\nI agree. Though it is a slightly different dynamic, I wish Grimbeorn could still return fire against immune enemies, even if he doesn't get the -2D ability."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891065","commentId":3891065,"userName":"sappidus","timestamp":1581426745,"content":"@stimpaksam [https://community.fantasyflightgames.com/profile/309009-stimpaksam/] is correct here, but in case anyone cares to see the explicit ruling that confirms it:\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891578","commentId":3891578,"userName":"GrandSpleen","timestamp":1581455530,"content":"I’ll chime in if only to provide the other opinion. I was happy with that ruling. Relying on the language (the word “choose”) eliminates grey areas. You don’t need to ask yourself whether this ability “affects” the immune card, ever. Reducing confusion, paradoxical rulings, ruling reversals down the line.... always the correct way to go. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891677","commentId":3891677,"userName":"dalestephenson","timestamp":1581458475,"content":"Thing is, I don't see using \"affects\" for the bright the line as an unclear way to handle interacting with cards that say \"immune to player card effects\".  The current state is \"immune to being affected by player cards, and also unusable for cards that don't actually affect this card but happen to use the word 'choose' or 'target'.\"  It doesn't make sense to me than Ghan-Buri-Ghan can reference the threat of an immune location just fine as the active location, but if his text were \"X is a location chosen at the start of the questing phase\" he could no longer use an immune location.\n\nIt also doesn't make sense that Beorn can't be chosen for Inspiring Presence, because he's immune.  The card doesn't affect *Beorn* at all, but he can't inspire *others* because the magic word \"choose\" prevents the player from reading his threat.\n\nYou can interact with the threat of an immune enemy just fine for Proud Hunters, but not for TaBilbo.\n\nI think if the designers had stuck with the idea that an immune card can't be *affected* by cards, but still could be chosen for cards that don't affect it, it would be just as easy to rule and would make more intuitive sense for the printed-on-the-card phrase \"immune to card effects\".\n\nEdited February 11 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305657-tactics-bilbo-with-immune-enemies/?do=findComment&comment=3891770","commentId":3891770,"userName":"player3351457","timestamp":1581464500,"content":"I would have preferred a more scope-specific immunity, as it clears out a chunk of cards but no all of them. For example \"immune to event card effects,\" \"immune to hero card effects.\" Etc. Yes there are attachment cards that behave like events and others, but that's part of the beauty of deck building. I suppose the stamp of \"immunity\" allows the makers to create compelling scenarios that allow for only one path to the finish, usually in some thematic fashion. But it just gets a little tiresome when you build a deck to have a whole section wiped because the cards can't effect the encounter cards in question."}]}