{"url":"https://community.fantasyflightgames.com/topic/305668-wild-stalion-and-card-draw/","title":"Wild stalion and card draw","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305668-wild-stalion-and-card-draw/?do=findComment&comment=3891129","commentId":3891129,"userName":"Miceldars","timestamp":1581431772,"content":"If I attach Wild stallion to a Dale ally without attachment, do I draw a card with Brand's effect ?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305668-wild-stalion-and-card-draw/?do=findComment&comment=3891142","commentId":3891142,"userName":"sappidus","timestamp":1581432815,"content":"If you play Wild Stallion as an ally, then use its Action to attach it to a Dale ally, this does not count as \"playing an attachment on a Dale character\" as Brand requires, so, no draw. As the RR puts it, \"Playing a card involves paying the card's resource cost and placing the card in the play area.\" [Play and Put into Play [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule564]]\n\n(As an aside, Wild Stallion reads: \"Planning Action: Attach Wild Stallion to an ally you control.\" I could see someone raising the possibility that, like Emery or Elven Jeweler, this text is active while the card is in your hand, and thus you can attach the Stallion directly from there rather than playing it as an ally first. However, I think that would be wrong—actions like Emery's literally only make sense from hand, but the Stallion's doesn't explicitly make reference to an out-of-play state, so it doesn't sneak around the usual principle of out-of-play text being inactive.)\n\nEdited February 11 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305668-wild-stalion-and-card-draw/?do=findComment&comment=3892024","commentId":3892024,"userName":"Miceldars","timestamp":1581490219,"content":"The problem is, if you attach wild stallion to an ally, you don't draw, and if then you attach a regular attachment, you don't draw either because the ally already have an attachment.\n\nBut thanks for the answer"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305668-wild-stalion-and-card-draw/?do=findComment&comment=3892181","commentId":3892181,"userName":"rees263","timestamp":1581513632,"content":"Long Lake Trader can help with that."}]}