{"url":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/","title":"Utilising Saruman hero in multiplayer","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3892214","commentId":3892214,"userName":"Zura","timestamp":1581515464,"content":"so, upon seeing Saruman first, i was really hyped for the hero making doomed worth it in multiplayer setting with his staff. But now upon playing with him for a while, i do not find him strong anymore regardless of my hype for him. \n\nThe thing is: his staff encourages you to play one doomed event a round. The two most preferable ones are legacy of numenor and deep knowledge, both preferably played during the planning phase, when Saruman's ability would only trigger if you have used word of command. But while his staff wants you to play only one event not to doom everyone, Saruman wants more to be worth it, preferably at least one event between questing and combat.  Also non-event doomed cards do not really interact with him. I tried playing my dream wicked trio: Saruman, Grima, Smeagol with 10 doomed events (3x legacy, 3x knowledge, 2x seeking stone, close call and wizards voice) but felt it was too much. But throw in any less and it stops being a Saruman deck. How do you roll with him?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3892284","commentId":3892284,"userName":"Valhalla Gaming","timestamp":1581520062,"content":"There are new cards coming out in this set and next that are generally great, like the mini sneak attack for everyone/the each player untaps a hero. I think those will need to get used too to really make him click."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3892288","commentId":3892288,"userName":"dalestephenson","timestamp":1581520237,"content":"While Legacy of Numenor and Deep Knowledge are both most useful in the planning phase, they're still very useful if played later when Saruman's readying has a purpose.  I haven't played Saruman before, but I've frequently comboed Steward of Gondor and Heir of Mardil, putting off Steward until the readying would be useful.  Unless it's critical that you need the cards/resources *now*, why not wait?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3895790","commentId":3895790,"userName":"player3351457","timestamp":1581949148,"content":"> On 2/12/2020 at 10:07 AM, programdude said:\n> \n> There are new cards coming out in this set and next that are generally great, like the mini sneak attack for everyone/the each player untaps a hero. I think those will need to get used too to really make him click.\n\nI agree with this here -- we just need more events that make sense for him.\n\nBringing steward of orthanc is a big help, too, because it turns any event into doom + card draw, so you don't need to stack your deck with unnecessary doom cards. Grima works the same way. \n\nIt is a bit of a bummer that doomed allies don't synergize with saruman. \n\nAs for the multiplayer aspect... my buddy has been wanting to run a doomed deck for a long time. And theres really only two ways I have found to pair with it: \n\n1) threat soaking friend, maybe one who starts in secrecy and can turtle while absorbing threat until the ideal board state is established.\n\n2) valour deck, which thrives on high threat anyway. This is kind of tough to build mostly because as much as they are trying to get some 40+ cards out there, there is just not enough of a pool of cards to synergize. \n\nNeither of these are very satisfying, but becomes a lot more workable because of saruman and his staff."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3896084","commentId":3896084,"userName":"Valhalla Gaming","timestamp":1581973259,"content":"> 6 hours ago, player3351457 said:\n> \n> I agree with this here -- we just need more events that make sense for him.\n> \n> Bringing steward of orthanc is a big help, too, because it turns any event into doom + card draw, so you don't need to stack your deck with unnecessary doom cards. Grima works the same way. \n> \n> It is a bit of a bummer that doomed allies don't synergize with saruman. \n> \n> As for the multiplayer aspect... my buddy has been wanting to run a doomed deck for a long time. And theres really only two ways I have found to pair with it: \n> \n> 1) threat soaking friend, maybe one who starts in secrecy and can turtle while absorbing threat until the ideal board state is established.\n> \n> 2) valour deck, which thrives on high threat anyway. This is kind of tough to build mostly because as much as they are trying to get some 40+ cards out there, there is just not enough of a pool of cards to synergize. \n> \n> Neither of these are very satisfying, but becomes a lot more workable because of saruman and his staff.\n\nI just got my set of the Wainriders today and am building something, which I honestly think with tweaks is going to pack quite the punch, even before the rest of the sets really potent doomed cards are released. My current build is Saruman, Galadriel, and Beregond(spirit). The theory is obviously to use these incremental threat reducers to mitigate my threat, while using bigger threat reduction on my allys as needed. The deck can also quest, defend, and attack very efficiently. \n\nThat being said it will take a lot of tweaking to figure out exactly what doomed cards should be run and in what quantity, as well as what the plan should be with Saruman(whether its better to give him an equipment to boost his attack, give him ranged, etc. as well as the meat and potatoes of the deck- Currently my vision is using galadriels handmaidens and stargazers to ensure essential cards are drawn(and stack the deck for flames of Arnor which I put in, mostly for the fun factor), and keep threat modest.\n\nWith such a powerful untap ability, the ability to play normally out of color effects, a huge attack, and drawbacks that are certainly manageable, I think Saruman has absolutely enormous potential and Im very eager to see what other people come up with."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3896168","commentId":3896168,"userName":"dalestephenson","timestamp":1581981765,"content":"> 9 hours ago, player3351457 said:\n> \n> As for the multiplayer aspect... my buddy has been wanting to run a doomed deck for a long time. And theres really only two ways I have found to pair with it: \n> \n> 1) threat soaking friend, maybe one who starts in secrecy and can turtle while absorbing threat until the ideal board state is established.\n> \n> 2) valour deck, which thrives on high threat anyway. This is kind of tough to build mostly because as much as they are trying to get some 40+ cards out there, there is just not enough of a pool of cards to synergize. \n> \n> Neither of these are very satisfying, but becomes a lot more workable because of saruman and his staff.\n\n3) Loragorn and Desparate Alliance."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3896232","commentId":3896232,"userName":"player3351457","timestamp":1581990087,"content":"> 2 hours ago, dalestephenson said:\n> \n> 3) Loragorn and Desparate Alliance.\n\nI've been trying to think of the best way to utilize this. Because if you run saruman and loregorn on the same side, either you need to song/celebrian stone somebody or run a spirit hero as your third, which is weird. But that does allow a two opportunity to reduce threat-- use desperate alliance to switch saruman over, reduce threat, and then bring him back... and then send aragorn over and reduce your partners threat. Two desperate alliances needed and a way to access spirit. It seems a little too expensive for my tastes.\n\nOn the other hand, loragorn fits in with a soaking deck. There would just be a lot of lore to go around. (And if you can pull off a sacrifice saruman with fall of gil-galad and bring him back, well... that's excellent too)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305727-utilising-saruman-hero-in-multiplayer/?do=findComment&comment=3896442","commentId":3896442,"userName":"dalestephenson","timestamp":1582028065,"content":"Yes, to use Loragorn in Saruman's deck you'll need two desparate alliance and spirit access.  However:\n\n1) I don't think spirit is a particularly odd third.  Yes, Saruman limits threat reduction, but spirit does a lot of things besides threat reduction, and both SpBeregond and Galadriel provide repeatable threat reduction unaffected by Saruman's limitation.  Unless you're set on combining Grima and Saruman (forcing mono-lore if you use Loragorn), spirit is as good a splash as anything else.\n\n2) Celebrian's Stone, if you can spare the restricted spot, is excellent value on Loragorn, given his access to easy readying from Keys of Orthanc or Wingfoot.  Song of Wisdom is otherwise useless in a non-spirit deck, but using Loragorn's ability is a late game feature, there's plenty of time to get the combo together.\n\n3) The expense is only in cards, not cost, and given that the combo is late game, would be in a deck with built-in-draw (Saruman) who has access to the cheapest search card in the game (Word of Command) I don't think getting the combo together would be particularly hard.\n\nWith that said, Loragorn in the partner deck doesn't need desparate alliance, and if it's also a spirit deck can use threat reduction on itself and Song of Earendil to help out Saruman, maximizing the impact.\n\n "}]}