{"url":"https://community.fantasyflightgames.com/topic/305911-hold-the-line-and-sentinel/","title":"Hold the Line and Sentinel","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305911-hold-the-line-and-sentinel/?do=findComment&comment=3895910","commentId":3895910,"userName":"player3351457","timestamp":1581960950,"content":"This is a three part question.\n\n1) Is a sentinel character across the board considered an \"eligible defender\" for you? I reread the original rule on sentinel and the declarer of the defender still belongs to the owner of the character. This is slightly different than ranged, which can be declared by any player making attacks. However, the character across the board, I would say, is still eligible to defend you, even though it is not \"your\" character.\n\n2) in this regard, can you declare two of your characters and a sentinel character across the board when you play Hold the Line?\n\n3) and finally, when there's a limit on character triggers of \"once per\", unless it says \"for the group\", it has been ruled that if another player takes control of the character, they can trigger it for themselves for the turn/phase/game (akin to Loreagorn). Does this mean, barring that the other two answers are \"yes\", that Spirit Beregond could be triggered twice (once per player) if a player across the board plays \"Hold the Line\"?\n\n \n\nI know that is a lot of thought going into one round of threat reduction, but figured I'd ask anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305911-hold-the-line-and-sentinel/?do=findComment&comment=3895954","commentId":3895954,"userName":"sappidus","timestamp":1581964276,"content":"> 50 minutes ago, player3351457 said:\n> \n> 3) and finally, when there's a limit on character triggers of \"once per\", unless it says \"for the group\", it has been ruled that if another player takes control of the character, they can trigger it for themselves for the turn/phase/game (akin to Loreagorn).\n\nThis is incorrect. See the FAQ item reproduced here:\n\nhttp://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule145 [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule145]\n\nBecause Loragorn is \"limit once per game\", the 2nd sentence of that item applies, so each player can trigger him (if they get control of him, of course).\n\nBut, as per the FAQ item's 1st sentence, a \"limit once per round\" effect like Spirit Beregond's is tied to the card (regardless of control). As long as Beregond stays in play the whole time, there will not be a way to trigger his threat reduction a second time in a single round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305911-hold-the-line-and-sentinel/?do=findComment&comment=3898975","commentId":3898975,"userName":"sappidus","timestamp":1582235037,"content":"> On 2/17/2020 at 12:35 PM, player3351457 said:\n> \n> 1) Is a sentinel character across the board considered an \"eligible defender\" for you? … 2) in this regard, can you declare two of your characters and a sentinel character across the board when you play Hold the Line?\n\nClosing the loop a little more on this, I asked Caleb:\n\nHold the Line says (in part): \"When an enemy attacks a player, that player may declare up to 3 eligible characters as defenders against this attack.\" Are Sentinel characters controlled by another player \"eligible\" for the purpose of this effect?\n\n\n\n> You cannot declare a character controlled by another player as a defender. They must be characters you control.\n> \n> Cheers, Caleb\n\n"}]}