{"url":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/","title":"The Black Riders","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3896310","commentId":3896310,"userName":"Vince79","timestamp":1582001603,"content":"Continuing with my solo progressive journey, I've now played through The Black Riders saga expansion.  I see why this is a popular box which gets high marks.  The quests were interesting and did a good job of evoking the books.  Well, except for Merry slaughtering ringwraiths single-handed lol.  Most importantly, the quests were just the right amount of difficult.  They were challenging but didn't leave you wanting to pull your hair out.  \n\nSince I'm playing by order of release (mostly), and the Saga boxes are so spread out, I didn't think it made much sense to play this in campaign mode, so I just played them as straight up scenarios.  Once I play through the rest of the Saga expansions this way, I'll go back and play it as a campaign.  These scenarios weren't really that hard, I imagine they get a little more difficult when you play through them as a campaign.\n\nWhich brings up a question:\n\nFrom what I gather, the idea of a campaign is to keep the same heroes.  You can change them, but you get penalized a threat point IIRC.  But it doesn't seem true to the books to just keep playing Sam, Merry, Pippin, and Frodo all the way through the end.  There are other characters that get introduced.  So does each expansion box let you start over with new heroes, or how do they handle that?  Does the campaign split in two when Sam and Frodo go to Mordor?  I guess I could wait to find out, but I'm curious.\n\nNext up the PoD Stone of Erech, then the Voice of Isengard cycle.  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3896334","commentId":3896334,"userName":"stimpaksam","timestamp":1582004348,"content":"Later in the campaign you're allowed to change heroes without getting the threat penalty."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3896796","commentId":3896796,"userName":"PocketWraith","timestamp":1582052925,"content":"There are multiple places in the campaign where you're allowed to change your heroes without incurring the threat penalty - at Rivendell, at Edoras, and then every time it switches between the Aragorn and Frodo parts of the story.\n\nEdited February 18 by PocketWraith"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3896830","commentId":3896830,"userName":"dalestephenson","timestamp":1582054711,"content":"With that said, if you use a different set of heroes for the Aragorn-side and the Frodo-side, you lose the benefit of permanent boons on heroes you swap out."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3897205","commentId":3897205,"userName":"Vince79","timestamp":1582080239,"content":"Shadow of the Past:  I'm always annoyed when they introduce a new game mechanic, but I have to begrudgingly admit the Hide tests worked very well thematically and as part of the game.\n\nKnife in the Dark:  I was using Son of Arnor to bring down Bill Ferny to kill.  If Son of Arnor didn't turn up with a mulligan, my odds of winning went down drastically.\n\nFlight to the Ford:  It really does feel like a race with Frodo's life ticking down.  I like to build up my forces for the end, but because of Frodo's life limit, you can't build too long.\n\n> 7 hours ago, dalestephenson said:\n> \n> With that said, if you use a different set of heroes for the Aragorn-side and the Frodo-side, you lose the benefit of permanent boons on heroes you swap out.\n\nI'm guessing that is balanced out with not having to deal with the burdens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305928-the-black-riders/?do=findComment&comment=3897209","commentId":3897209,"userName":"dalestephenson","timestamp":1582080742,"content":"Burdens don't follow specific heroes around, but permanent boons do."}]}