{"url":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/","title":"Land of Sorrow Preview Up","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896627","commentId":3896627,"userName":"EBerling","timestamp":1582043915,"content":"https://www.fantasyflightgames.com/en/news/2020/2/18/the-land-of-sorrow/ [https://www.fantasyflightgames.com/en/news/2020/2/18/the-land-of-sorrow/]\n\n\nAs someone whose favorite archetype is Eagles, this is a splendid set!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896667","commentId":3896667,"userName":"rees263","timestamp":1582046227,"content":"This pack looks incredible! Pipes, Hobbits, Eagles... So many uses for that contract too. Someone's already brewing a Hobbit deck with Rosie that's for sure.\n\nLove that Gwaihir attempts to make some of those terrible Eagle events into playable cards too!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896670","commentId":3896670,"userName":"dalestephenson","timestamp":1582046469,"content":"My thoughts:\n\nGwaihir is a powerful and well-rounded hero, but not readying in the refresh phase is a massive limitation that Eagles coming and going are not adequate compensation for.  I'm surprised he doesn't get a threat discount, especially with his threat so high.  The only bit of compensation is that with Radagast you can play Gwaihir's Debt out of the gate and (with Wizard Pipe) have Gwaihir exploit the heck out of core Gandalf.  Gwaihir/Hama/Radagast Eagle deck....\n\nI don't usually pay much mind to encounter cards, but Ulwarth looks badly designed to me -- his existence will preclude a fair number of decks from being able to attempt the quest.\n\nI like Eagle Emissary, it will be a nice boon for Eagles decks and another great way to boost Misty.\n\nWilyador as the first neutral Eagle I wasn't expecting, the low cost and maintenance from *anybody* makes him pretty splashable, I think.\n\nDale Messenger has a lot of healing potential in a Dale deck, but strikes me as a sideboard card for such decks.  The flavor text is odd -- the messengers that came to King Brand were from *Mordor*.\n\nSpare Pipe isn't terribly useful on its face, but a pipe that can go on anyone could come in handy in a Pipes deck.\n\nMessenger of the King is the most intriguing contract yet -- so many possibilities!  Treebeard and Radagast allies unfortunately off the table, but this card adds *dozens* of low-threat (if fragile) heroes to the game.  Now the twins come in all spheres!  I also like the idea of Tactics Pippin, Halbarad, Forlong, the three Haradrim, Galdor, Erestor, Gimli, Legolas, Rosie etc.  If you don't need Sentinel/Ranged, I think using this contract with the Gwaihir ally may be better than using the actual new Gwaihir hero.\n\nEdit: Put Hama in the Eagles deck, since Gwaihir's Debt is the one card that makes his errata necessary.\n\nEdited February 18 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896705","commentId":3896705,"userName":"EBerling","timestamp":1582049150,"content":"> 45 minutes ago, dalestephenson said:\n> \n> Gwaihir is a powerful and well-rounded hero, but not readying in the refresh phase is a massive limitation that Eagles coming and going are not adequate compensation for.  I'm surprised he doesn't get a threat discount, especially with his threat so high.  The only bit of compensation is that with Radagast you can play Gwaihir's Debt out of the gate and (with Wizard Pipe) have Gwaihir exploit the heck out of core Gandalf.  Gwaihir/Eomer/Radagast Eagle deck....\n\n\nI'm inclined initially to agree, especially since I find his ally version to be very valuable in Eagles decks.  While his Threat is really high in combination with his big penalty preventing normal readying and the lack of access to Restricted attachments, as long as you play one Eagle ally each planning phase he readies \"at the start of the turn\" well enough.  Still, I understand the conservative approach here, given that a 4 Attack / 3 Defense hero that starts with Ranged and Sentinel is unprecedented.  Plus, I'm also holding out hope (though it's a long shot, I'm sure) that the unspoiled Tactics card is some sort of \"Wind-Lord\" attachment for an Eagle that is akin to something like Prince of Dol Amroth, Khaliel's Headdress, Horn of the Mark, or Horn of Gondor.  Something that offers a tribal bonus for Eagles, and might also justify Gwaihir's threat.\n\n \n\n> 45 minutes ago, dalestephenson said:\n> \n> Spare Pipe isn't terribly useful on its face, but a pipe that can go on anyone could come in handy in a Pipes deck.\n\n\nThe card fan also has some sort of Pipe-Event for spirit.  Likely, being able to get more pipes in play (or attached to non-Istari, Dwarf, Hobbit, Dunedain characters) could become more valuable. \n \n\n \n\n> 45 minutes ago, dalestephenson said:\n> \n> Messenger of the King is the most intriguing contract yet -- so many possibilities!  \n\nTo say nothing of the obvious go-to Firyal, who presents as possibly one of the best heroes in the game especially in solo (9 Threat for 3 WP and incredible protection from the Encounter deck).   I agree that this Contract is incredibly exciting and versatile, especially for anyone like me who prefers to build and play thematic decks and sometimes wants more options for a particular spheres.  For instance, if you want to build a pure Rohan deck (or pure Rohan decks in multiplayer) having new options for additional heroes in every sphere offers so much for thematic deck-building (Lore = Gleowine who is a wonderfully cheap Bereavor, Leadership = Eothain, Spirit = Elfhelm or Gamling, and Tactics = Derowine, all of whom offer something compelling as a starting hero and something previously unavailable to Rohan decks).\n\nEdited February 18 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896744","commentId":3896744,"userName":"dalestephenson","timestamp":1582050860,"content":"> 24 minutes ago, EBerling said:\n> \n> The card fan also has some sort of Pipe-Event for spirit.  Likely, being able to get more pipes in play (or attached to non-Istari, Dwarf, Hobbit, Dunedain characters) could become more valuable. \n\nPerhaps a threat reduction card, since Hobbit Pipes like that?\n\nIt also looks like we might *finally* get a ranged character for the missile-minded hobbits.\n\nSong of Healing is the most spoiled of the fan -- healing in any action window triggered by any player choosing to discard.  Since there's apparently no limit to the number of times the action can be taken, I wonder why it's limit 1 per hero -- what's the point?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896797","commentId":3896797,"userName":"dalestephenson","timestamp":1582052949,"content":"Leaflock doesn't seem quite so bad as a starting hero, since you don't pay threat for his initially non-existent willpower.  In a deck with Treebeard and Quickbeam you can get his willpower to 2 in the first turn and shouldn't have much trouble maintaining it at 4.\n\nSkinbark would be fun against orc quests -- 4 base attack, ignores defense, for only 9 threat.  Squash.  Squash.  Squash.\n\nIngold can deliver an impressive three willpower for five threat, if the heroes all have a resource."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896798","commentId":3896798,"userName":"Supertoe","timestamp":1582052952,"content":"Messenger of the King doesn't work on Bill the Pony 0/10 would not play again\n\n \n\n😂"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896813","commentId":3896813,"userName":"Yepesnopes","timestamp":1582053556,"content":"With the new contract ally Legolas is a new Tactics hero must!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896816","commentId":3896816,"userName":"Zura","timestamp":1582053820,"content":"You can have a Ceorl deck with the contract, send him over to another player, then use Justice Shall be done and the second deck has 4 heroes for free :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n\nALSO FINALLY ELROHIR ELLADAN DECK without being forced into leadership tactics\n\nEdited February 18 by Zura"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896881","commentId":3896881,"userName":"Halberto","timestamp":1582057871,"content":"Best contract so far in terms of sheer deckbuilding veriety and fun. Probably one of the most powerful too with some good deck building. \n\nOn the Eagle hero, I put judgment on hold. While he seems good in tandem with radegast 24 combined threat is too high a starting base, limiting third hero choice.  The penalty of not readying is a big one but let's wait to have a full overview of how designers follow up with other eagle sinergizing cards before assessing how heavy it is. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896890","commentId":3896890,"userName":"Amicus Draconis","timestamp":1582058516,"content":"Well, there is our third card with the Archer trait. Maybe we will also get another Steward."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896917","commentId":3896917,"userName":"Halberto","timestamp":1582060295,"content":"> 29 minutes ago, Amicus Draconis said:\n> \n> Well, there is our third card with the Archer trait. Maybe we will also get another Steward.\n\nBree,  se ne more bree cards..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896949","commentId":3896949,"userName":"Felswrath","timestamp":1582062478,"content":"Angbor the Fearless could be used very effectively alongside Loregorn for a Valor deck. Take L. Boromir, Loregorn, and Angbor for 28 threat. Pillar of the kings up to 40, and then drop back down when you get too high."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3896955","commentId":3896955,"userName":"Gibby","timestamp":1582062696,"content":"Ad-hoc evaluation of unique allies as contract targets:\n\nGeneral consideration: The expectation is that the best targets are those that have low stats, but are highly costed for amazing and recurring abilities. \n\nLore Anborn: 8 threat cost, fair stats, relevant traits. Recurring traps is a relevant ability. Fair target. \nLeadership Anborn: 8 threat costs, fair status, relevant traints. Increase engagement cost and dealing damage ok, but not amazing. Ok target. \nAngbor the Fearless: 5 threat cost for a fair quester. Relevant traits. The valor trigger nombos with the low threat cost. Niche target. \nArwen: 5 threat cost, relevant traits and her tried and proven ability make her a good target. To consider: her ally cost of only 2 which is part of what makes her great in the first place. Also you can't use her hero version. Good target. \nAzain Silverbeard: 7 threat cost, relevant traits. The ability is interesting, albeit a bit niche. Could be an interesting pick for quests with a number of low HP enemies. Niche target. \nBarliman Butterbur: Nope.\nBeechbone: The general problems with ents is that it is their ally cost that makes them attractive. Paying for the stats in threat and starting with an exhausted hero is meh. \nBeorn: 13 threat costs makes him one of the more expensive hero options out there. His ability is likely a tad better then Tactics Boromir discard ability, but then Beorn lacks his mad readying skills. Niche target. \nBifur: Nothing to see here. \nBilbo Baggins: 4 threat costs for a 2WP quester that does not die to 1 damage. Looks like a good deal. Starting with a pipe is also nice. I expect that he will be a popular target. Good target. \nBill the Pony: The only way to get a hero with the coveted pony trait. Someone will play it for that reason alone, but other than that not very interesting as the main selling point of the ally is that its resource cost is 0. \nSpirit Bofur: Nothing to see here. \nTactics Bofur: 7 threat costs for 2WP, 2 ATT and 3 HP is ok. The ability to repeatedly tutor for weapons will surely make him see play. Good target. \nBombur: Maybe against quests with high threat underground locations? Very niche at best. \nBoromir: 9 threat cost with two relevant abilities and traits are likely sufficient to make him see play. The contract's readying limitation does matter here. Fair target. \nBrok Ironfist: Not very exciting to say the least. You could replace hero Brok by ally brook if the latter bites the dust just for the memes. Meh target. \nCeorl: A hero that can be passed around the table. Very interesting. Fair target. \nDamrod: Discard for small benefit. Not very interesting. Meh. \nDenethor: Pay for stats with only downside abilities? Pass. \nDerwine: 7 threat costs for 3DEF 3P sentinel with built in shadow cancelling? I expect that this will see play. Good target. \nDerufin: Discard for small benefits? I do not see the point. Meh. \nDori: His ability to take damage instead of a hero does not shine here. Pass. \nDwalin: Blank ability. Pass. \nSpirit Elfhelm: Hot tech against certain quests. Niche target. \nTactics Elfhelm: Blank ability. Pass. \nElladan and Elrohir: Ok alternative to their hero versions with lower threat cost, lower HP and lower off-stat (the one that is not boosted by the sibling). Interesting to have options against Orc heavy quests. Fair targets.\nElrond: 11 threat cost for an additional card at the start of the game and a body does that does not stick around? Pass. \nEmery: Blank ability: Pass. \nEomund: Even though his ability requires to discard him, the effect of readying everyone Rohan can be powerful. Niche target. \nEothain: 8 threat costs puts him in actual hero territory. His ability is ok, but not spectacular. Also Imrahil exists. Niche target. \nErestor: 6 threat costs for an interesting ability that is not quite as extreme as that on his hero counterpart. Good target. \nLeadership Faramir: This was featured in the article, so it better be ok. I think it is. Ok target. \nLore Faramir: Surely there has to be a quest or two where his ability matter during setup (depening on the precise rules for setup order). Niche``?\nFarmer Maggot: Meh. \nFili: Meh. \nFiryal: 9 threat costs for a good quester with an amazing ability. Good target. \nForlong: Everyone's favourite unique outlands ally as another hero? Surely this will be a thing with Hirluin and outlanded Imrahil. Good target. \nGaffer Gamgee: 3 threat cost for a hobbit hero will put a lot three hobbit decks comfortably into secrecy territory. The ability is niche, but relevant. Ok target. \nGaladriel: Nope. Another white council member that does not like this contract. \nGaldor of the havens: Same stats as his hero version, but a interesting different ability. Will see play. Good target. \nGalion: 1 threat cost for a third hero will be good enough to make it into secrecy decks wanting another spirit hero. Ok target. \nGamlin: Ability to recur Rohan allies on a stick may make this good enough. Meh stats for 6 threat costs. Niche target. \nGhan-Buri-Ghan: If you ever wanted a wose hero, here is your chance. For only for threat cost, is ability is quite ok. The discard ability will rarely be used, but it's a nice bonus. Good target. \nGildor: Hero quality stats and cost with an amazing ability. This will enable new decks. Good target. \nGimli: 9 threat cost for an allrounder make him fairly expensive. Relevant ability. Ok target. \nGleowine: 3 threat costs for card draw on a stick make this a Beravor light that will fit in a number of secrecy decks. Good target. \nGloin: Nope. \nGlordfindel: 11 threat costs with a hero-level ability make this an eligible target. Fair target. \nGrimbold: Discard hero to feint? Not great, but you get a 2 WP tactics hero for 6 threat cost. Niche target. \nGuthalf: 6 cost sentinel tactics hero. Niche target. \nGwaihir: If you always wanted a Gwaihir hero, but the actual hero Gwaihir is too expensive for you, then this will do. The response will fizzle though. Too bad. Meh. \nHalbarad: Too high cost for an all-rounder hero. Ability not relevant enough. Meh. \nHaldir of Lorien: Also too high cost for all-rounder. Ranged and sentinel are nice though. Niche taret. \nHalfast Gamgee: 5 threat cost leadership hobbit hero that quests for 2 and comes with a free resources. This will go in a number of hobbit secrecy decks. Good target. \nHama: Meh stats and discard to use ability. Very very niche at best. \nHenamarth Riversong: Everyone's favourite scrier now collects 1 lore resources for round for 3 threat cost. Squishy, but good. Good target. \nIngold: 5 cost for a strong leadership quester. Why not? Fair target. \nIoreth: Covered in article. Good target. \nJubayr: Defender that discards shadow cards. Good target. \nKili: Nope. \nLandroval: The question here is whether he can bring himself back. Need some rulings, but likely niche. \nLeaflock: An ent. Niche. \nLeogolas: Nice to have options. Good stats, traits and ability. Good target. \nLindir: Not sure on the rule here. If his ability triggers before you draw the starting hand, then this may be fantastic, but that I doubt that this is the case. Meh otherwise. \nMablung: A 5 threat cost hero that quests for 2 in ok. The ability to increase an enemies engagement cost (if the setup timing allows it to trigger) is very narrow in application. Niche target. \nMeneldor: Another mediocre way to get an eagle hero. Niche for that thematic reason, but meh otherwise. \nMerry: 4 threat costs for a 2WP quester that doesn't die to a single damage. If you can afford 3 threat cost more for Sam, then this will be the better option unless you already run him. Niche target. \nNori: 6 threat for an ok ability in a dwarven mining deck. Ok target. \nOrophin: 6 threat for a good quester/attacher stat distribution with ranged. Ok target. \nPippin: 4 threat for 2WP and 2HP is ok. Both abilities are very relevant, makeing him a stand-out amongst hobbit targets. Good target. \nPrince Imrahil: Nombo time!\nQuickbeam: An ent. The main selling point as an ally is his ridiculously low cost. Less good as a hero, though the readying make this playable in some cases I suspect - even with the contract limitation on readying. Niche target. \nRobin Smallburrow: 5 threat cost for a 2 quester and an ability that is only occasionally useful at best. Ok, but there are likely better options. Ok target. \nRosie: Everyone's favourite female leadership hero. Good target. \nRumil: Ok stats and ranged, but nothing more. Meh. \nSam Gamgee: I think the hero version is the better one here. However, this may find a spot in a hobbit deck that is looking for another spirit hobbit that isn't Pippin. \nSkinbark: Does nothing the first round, but the ability may be good enough in some quests. Haven't checked. Niche. \nSulien: 3 WP for 7 threat cost is ok, but in spirit you could pay 1 or 2 threat more to get Lothiriel or Eowyn. Niche target. \nWigalf: I suppose the readying ability makes him ok, but not exciting. Ok target. \nYazan: Hero grade stats and hero grade ability (albeit on the weaker side). Probably the worst of the Harad allies as targets. Ok target. \n\n\nIn my count that makes 17 good targets and a lot of other options to play around with. Also nothing seemed OP. A very interesting contract overall, that opens up a wealth of deckbuilding options. Happy to see this contract! \n \n\nEdited February 18 by Gibby"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897049","commentId":3897049,"userName":"dalestephenson","timestamp":1582067159,"content":"Does Bilbo's response come into play during setup?  That makes him more useful, especially with Wizards.\n\nWhether Landroval can bring himself back or not, the ability to make someone else come back might be more useful than keeping Landroval around. The unique Eagle allies don't have cool abilities, but being able to enable Gwaihir's Debt on turn one has some value, I think.  At 7 threat Meneldor is a whole lot cheaper than Gwaihir hero, without his limitation.\n\nI like the idea of Leaflock as a hero in an all-ent deck because he is only 7 threat, but can get to 2 wp easily with Treebeard/Quickbeam abilities and max at 4.\n\nBill the Pony sadly can't be a hero, since the contract is an attachment.  Of course, that also means that Wiglaf in a Dale deck *starts* with 3 willpower and an attachment he can use to ready.  Good King of Dale target.\n\nI'm not sure why you're down on Halbarad.  Yes, 9 cost makes it hard to fit in a secrecy deck, but across from one his passive effect would be extremely valuable.\n\nI'm not as high as you on Gildor -- he's got great stats, so when is he going to spare the exhaustion for his ability?  I prefer non-exhausting abilities like Galdor and Erestor have.  Dori has a similar issue -- if he didn't have to exhaust to absorb hero damage, he could be really valuable at 7 threat with a few good attachments."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897055","commentId":3897055,"userName":"player3351457","timestamp":1582067338,"content":"> 3 hours ago, Zura said:\n> \n> You can have a Ceorl deck with the contract, send him over to another player, then use Justice Shall be done and the second deck has 4 heroes for free :P [//content.invisioncic.com/Mfantflight/emoticons/default_tongue.png]\n> \n>  \n\nYou are going to want to do justice shall be done first so you can get the resource boon too😉"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897075","commentId":3897075,"userName":"asgardianphil","timestamp":1582068391,"content":"You'll be able to ready Gwaihir with unexpected courage. Just not during the refresh stage in any way. But stick UC on him and ready him in the planning stage etc.\n\n \n\nLembas will also work on Gwaihir if you also have an elf or make him an elf friend. \n\nSo I think his threat value doesn't feel so high now. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897076","commentId":3897076,"userName":"player3351457","timestamp":1582068397,"content":"> 1 hour ago, Gibby said:\n> \n> Ad-hoc evaluation of unique allies as contract targets:\n> \n> \n> In my count that makes 17 good targets and a lot of other options to play around with. Also nothing seemed OP. A very interesting contract overall, that opens up a wealth of deckbuilding options. Happy to see this contract! \n>  \n\nBless you. Your analysis is longer than the article itself lol"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897093","commentId":3897093,"userName":"player3351457","timestamp":1582068949,"content":"I would say all \"enters play\" triggers occur, as the contract says to put into play "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897131","commentId":3897131,"userName":"John Constantine","timestamp":1582071401,"content":"Fyrial is gonna be a great ally-hero for solo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897139","commentId":3897139,"userName":"player3351457","timestamp":1582072171,"content":"My take on the contract--\n\nSpirit:\n\nI think, if it stands, Lindir is my go to in a Noldor deck. The ability to pull 3 more out the gate is huge boost. Plus he can be a target for Light of Valinor, though his other stats aren't great. He does allow for a spirit boost for low threat.\n\nGlorfindel and Arwen are decent choices.\n\nLore:\n\nI like Anbor and Galdor. I think they round out their respective decks well. But yes my go-to would be fiyral. \n\nTactics:\n\nLegolas paired with the leadership gimli could work alright, though you would need some reason to exhaust him before attacks. Hands upon the bow or any range exhaustion, because you probably aren't questing with him.\n\nI really like pippin hero here. Could round out a solid tactics hobbit deck.\n\nLeadership:\n\nI love the idea of building a sniper deck around Anborn hero. Wiglaf with the auto attachment is nice (get to ready him once per phase with each successive attachment) and this works well with Brand.\n\nGimli is a solid pick as well, fits his sphere nicely.\n\n \n\nWhat I love most about this contract is that they basically gave us 30+ more heroes to combo into decks. Sure some arent great, but that just increases the possible decks and hero line ups tremendously! They gave us a lot work with with the break upcoming."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897146","commentId":3897146,"userName":"player3351457","timestamp":1582073417,"content":"My take on the other cards.\n\nHero -- withholding judgement here. I need to ponder if this is done to really push for a Gwahir - Radagast combo, though that might be a difficult deck to run on the expense side of things. The cheaper eagles certainly help the cause, but I wonder. I think it could do well in a splash leadership deck that has a lot of readying effects. 13 seems high. I will still need to think and read more thoughts on this.\n\nWilyador -- 3/5 cool. Nice stats. Works well in a multiplayer game. \n\nEagle emissary-- 3/5 non unique eagle, a bit of a double edge sword. But cheap. I like that. Tactics needs more resource generation to support these eagles, though.\n\nTactics mystery card ???\n\nSong of Healing -- 5/5 if I am reading this correctly, healing based on hand discard, anyone can trigger? No limit? I love it.\n\nDale messenger -- 3.5/5 and could be higher in the right decks. Look. Everyone is going to have heroes with attachments. For a cheap lore ally, bringing them in and spreading the healing love is excellent. In a dale deck, really good. Great way to help a partner out who doesn't have healing. \n\nSpare Pipe -- 2/5. I still like it, even with the lower rating. It's just not incredibly powerful. I like that it can go on anyone and theres no limit. 3x on Dori helps Beorn a little more (though what are you doing in that messy deck??). Like I say below I do like pipes and want to have a workable pipe deck.\n\nSmoke and Think -- has to be some event that gives a boon for pipes. I like this last push for pipes here, with two more eligible targets for wizard pipe in the last 5 packs, and new pipe in this pack, I hope there might be a chance to make a workable pipe deck. Perhaps I dream. Regardless, has to be some synergy with the spare pipe. 0 cost looks good so far.\n\nHobbit archer -- I can already tell I like it, though a 1, 1, 1, 2 stat line would be a slight disappointment, even for 2 cost. Base 2 attack would be great.\n\nLeadership mystery card....? GUARDED maybe??\n\n \n\nNo master cards?? \n\n \n\nBe gentle. I am not huge on eagle decks, and though these guys are okay in a general splash, I have to shrug a little because of their mercenary ways."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897190","commentId":3897190,"userName":"RogueSeventeen","timestamp":1582078704,"content":"Better hope you don't draw your starting ally in your hand, as we know contract setup is *after* quest setup... ... ..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897198","commentId":3897198,"userName":"RogueSeventeen","timestamp":1582079167,"content":"Oh Grey Wanderer not specifying a non-guarded attachment you ruined everything! haha"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897202","commentId":3897202,"userName":"player3351457","timestamp":1582080024,"content":"> 20 minutes ago, RogueSeventeen said:\n> \n> Better hope you don't draw your starting ally in your hand, as we know contract setup is *after* quest setup... ... ...\n\nDang it I forgot that setup on contracts happen after starting hand. That means Lindir is out.\n\nI'm not sure I understand the ruling on this. Aren't hero/deck setup effects prior to hand draw? Why do contracts get stuck with post quest setup setups?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897223","commentId":3897223,"userName":"Encolpius","timestamp":1582082807,"content":"A friend sent me the following image that has Smoke and Think and the new Hobbit ally revealed:\n\nmec82-image2500.png [https://b2b-media-production-product-catalog.s3.amazonaws.com/filer_public/87/ce/87ce1cee-5abd-451c-b9b7-9eae78173321/mec82-image2500.png]\n\nEdited February 19 by Encolpius"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897235","commentId":3897235,"userName":"player3351457","timestamp":1582083901,"content":"> 15 minutes ago, Encolpius said:\n> \n> A friend sent me the following image that has Smoke and Think and the new Hobbit ally revealed:\n> \n> mec82-image2500.png [https://b2b-media-production-product-catalog.s3.amazonaws.com/filer_public/87/ce/87ce1cee-5abd-451c-b9b7-9eae78173321/mec82-image2500.png] [https://b2b-media-production-product-catalog.s3.amazonaws.com/filer_public/87/ce/87ce1cee-5abd-451c-b9b7-9eae78173321/mec82-image2500.png]\n\nI hope the hidden word on smoke and think is \"card\" and not \"ally\", \"attachment\", or, heaven forbid, \"event\". \n\n2/5 on both. Thanks for the spoil! One leadership (probably guarded) card and one tactics (probably event based on the breakdown) left to go."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897239","commentId":3897239,"userName":"TheSpitfired","timestamp":1582084351,"content":"Gosh, I thought my one ring L-Frodo, Sam, Merry deck was pretty good, but now it's going to be incredibly tempting to swap Merry to Tactics ally Pippen! One less attack for more Willpower questing. I think it's worth it!\n\nAlso just thinking of the Elven possibilities with this contract. S-Glorfindel, Tactics Elladan and Spirit Ally Elrohir. Starting threat of 22, extremely easy ways to get that down to Secrecy levels and you get access to my two favorite Elven events: Revealed in Wrath and Fair and Perilous. Throw in some Mirkwood Long knives, plus all the classic canceling cards (Hasty Stroke, A Test of Will, Feint) and I think this deck has built itself haha. As if I don't run Elves enough as is.\n\nI was looking at the contracts released up to this point wondering where they could go next. I am floored at this one and the possibilities it presents. If my suspicions are right and this is the final cycle, we are certainly ending on a high note. If I'm wrong, how would they top this cycle? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897243","commentId":3897243,"userName":"pmdoug","timestamp":1582084620,"content":"Gwaihir is a bit difficult to play around, but it makes sense that an eagle hero wouldn't be a good fit for most decks. I'm actually glad that he's a challenging hero with high threat and a very unique stat/keyword mix. His obvious partner is Radagast, but you'll want to run a low threat third hero to fill out the board. Fortunately the new contract adds several good options, including Ioreth, Pippin, and Meneldor. Sure, your threat will probably still be pretty high, but you get to run 2 eagle heroes and an Istari hero!\n\nSpeaking of the contract, a few allies really stand out to me:\n- Le Anborn seems like a fun third for a direct damage Argalad/Thalin deck. He allows for Unlikely Friendship and Fresh Tracks, but he might be overkill in a deck that already struggles against boss enemies.\n- Angbor the Fearless might be the only Valor hero we'll ever get, but he's a good one. \n- Arwen was always amazing, and just got even better. Your main defender now has +1 def and sentinel from turn 1. Congratulations! \n- Azain is definitely quest dependent, but he'll do a ton of work when he gets the chance. He's sort of a little brother to T Thorin. Sure, Thorin will typically be the better choice, but Azain is a fun alternative. \n- Bilbo makes pipe and Istari decks work out the gate, and for only 4 threat. There are few better deals out there. \n-  Boromir is a great addition to a low threat deck, even though his readying butts heads with the contract. If he's getting his 3 defense, then he's a great hero for only 9 threat. \n- Ceorl is like a flexible mini Le Aragorn. Moving him around should allow for some fun shenanigans. \n- S Elfhelm is a champion in certain quests. He saved my butt in Temple of Doom. \n- Erestor is going into a Cirdan deck for sure. Just strain the draw deck and get the exact cards you want. Throw in some Silver Harps and go to town. \n- Firyal... wow. \n- Galdor is a great companion to S Legolas, Arwen, Erestor, etc. One of the promoted allies that just feels like an official hero. \n- Ghan-buri-Ghan is hampered by his discard effect, but I'll gladly slot him into a Haldan/Idraen deck. \n- Gimli is a higher threat all rounder, but his innate readying ensures that his stats won't be wasted. He's great in a dwarf deck, but he'll fit in most anywhere. \n- Gleowine is 3 threat mini-Beravor. Poor Lo Bilbo... \n- Glorfindel is costly at 11 threat, but he's still cheaper than Lo Glorfindel. The loss of 1 hp isn't terrible either, since that was mainly used for undefended attacks. His readying ability matches up perfectly with the contract, and he's still a great target for Light of Valinor. I'd be happy to run him in an Erestor deck. \n- Jubayr is getting on an Armored Destrier for sure. \n- Legolas is a slighty cheaper version of Core Legolas, but with a more universally useful ability. Tactics just got guaranteed turn 1 draw capability. \n- Meneldor is basically blank, but a 7 threat eagle hero should be a fun addition to a Radagast deck. \n- Pippin is possibly the best ally for this contract because he essentially offers 6 points of stats and readying for 4 threat cost. That's bonkers. I'm gonna have a hard time playing T Merry now. The biggest knock against him is that Lo Pippin is so good in the same deck type. \n- Robin, Rosie, Sam, Halfast, and Gaffer: hobbits/secrecy probably get the biggest boost from this contract of all the archetypes. \n \n\nI'm very excited for Wiglaf, but I'm a bit confused about his response. Does putting him into play for the contract trigger \"After you play Wiglaf...\" ? I know it normally would say \"from your hand\" to stop these responses, but I'm never clear on the language. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897275","commentId":3897275,"userName":"Amicus Draconis","timestamp":1582088091,"content":"I guess the missing tactics card is an attachment for Gwaihir similar to Kahliel's Headdress, to enable digging for eagle allies in the discard pile, otherwise his ability will run out of fuel.\n\nAnd what is the point of the forced effect on Eagle Messenger? Sure he is cheaper and non unique compared to the other tactics allies with 2 or more willpower.  But as long as you want to make progress he is going to become very expensive. I'd rather pay an extra resource for Bofur, Grimbold, Meneldor or Beechbone."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897292","commentId":3897292,"userName":"stimpaksam","timestamp":1582090485,"content":"> 1 hour ago, pmdoug said:\n> \n> I'm very excited for Wiglaf, but I'm a bit confused about his response. Does putting him into play for the contract trigger \"After you play Wiglaf...\" ? I know it normally would say \"from your hand\" to stop these responses, but I'm never clear on the language.\n\nI believe in order to trigger his response you have to pay his cost first, i.e. \"play\" him. The contract states to \"put an ally into play\" which bypasses having to pay its cost. So, his response would whiff when used with this contract."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897321","commentId":3897321,"userName":"General_Grievous","timestamp":1582096593,"content":"Wow. Just when I think I can't be more excited for a pack after Saruman/Green wanderer, Three Hunters, The One Ring and the awesomeness they was the last cycle; they go and one up everything.\n\n \n\nSo much to unpack here but I'll throw in my two cents.\n\nLove that it's Gwahir as the hero and our saved Eagle as an amazing ally. Thematically Gwahir being harder to use but also incredibly powerful is very appropriate, very excited to get this bird on the table with his flock. And I'm hoping there is a Tactics crown attachement for him that let's you dig for allies or bring them back from the discard. \n\nThere are some other player cards...\n\nNow the real meat of the article, the new contract, first off what a way to dramatically increase our hero count by making everyone into heroes! This is so cool, unique and will make for so many fun combinations. Here is my favourites:\n\nThe Sons of Elrond are now in all the spheres and are actually solid choices since most enemies are orcs and they open up a lot more options for pairings of the two.\n\nAnborn (Lore), this is what Traps needed, being able to start with the most eco-friendly man in Middle-Earth the recycling Dunedain is going to make traps shine. \n\nGamling, just when you thought Rohan wasn't going to be boosted anymore than it was, here is the second most Eco-friendly human in the lore, who can now begin reviving and reusing your allies round one. Let the combos commence.\n\nElfhelm (Spirit), in case you don't want to raise your threat ever again, here is your guy.\n\nFiryal, she has become the greatest solo hero in the game. Amazing Willpower, especially for Lore, and that ability that puts Core Denethor to shame, she will be the star player in this new contract.\n\nLikewise Jubyr will also be the star of defense and can easily take the title of best defender from Beregond and Erkenbrand. Who needs Burning Brand or Inner Strength when your hero can be immune to shadow effects from round one.\n\nArwen, great boost to the key aspect of defending right from round one.\n\nGimli, excellent all-arounder who can always quest but will be ready when you need him for combat.\n\nLegolas, similarly to how his first hero version allows tactics to quest unorthodoxily, our new Tacticts hero version will be a card drawing machine which is what Tactics sorely needed. Very excited to get this elf on the table.\n\nGildor, move aside Stargazer and Gandalf hero, Elrond decks have a new best friend, being able to arrange two rounds worth of Vilya targets from the top 3 cards or your hand is going to be an amazing thematic pair up. Also excellent stats for the in-between rounds or with some readying. Another excellent Elven defender and target for burning brand.\n\nBilbo, similarly to the above, Bilbo will very thematically make your Gandalf hero decks shine and let you use him to his full Gandalf-The-White potential from the first phase. \n\nHaldir, kind of the Gwahir light, great for multiplayer games.\n\nRosie, the new star of the hobbits\n\nSkinbark or beechbone are going to be destroying enemies alongside their Ent kin. You could even make a case for Leaflock finally since he is one of the cheaper Ents to make a hero and will get his full effect very quickly most times.\n\nGaldor, will go with pretty much any Noldor (or spirit Legolas) you have planned \n\nBrock iron fist......... no hahaha\n\nWiglaf to be the third dale hero with his excellent readying ability making him into a quasi-Boromir.\n\nForlong, likewise to the above, he will be a staple in Outlands decks.\n\nPippin, becomes the best low-threat questing Tactics hero in the game with a great synergistic effect\n\nAngbor, is now essentially a better Aragorn\n\n \n\nAnd so many other options! I love that this contract boosted Harad into top tier hero status, and opened the door for so many more combinations of heroes out there. Excellent work Caleb and design team! Spot on!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897323","commentId":3897323,"userName":"Flrbb","timestamp":1582096867,"content":"I do wonder for which ally they put \"attached character cannot ready more than once per phase\" on the contract!?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897332","commentId":3897332,"userName":"General_Grievous","timestamp":1582097639,"content":"> 12 minutes ago, Flrbb said:\n> \n> I do wonder for which ally they put \"attached character cannot ready more than once per phase\" on the contract!?\n\nBoromir tactics and Rosie for sure"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897363","commentId":3897363,"userName":"Gibby","timestamp":1582102059,"content":"> 9 hours ago, dalestephenson said:\n> \n> Does Bilbo's response come into play during setup?  That makes him more useful, especially with Wizards.\n> \n> Whether Landroval can bring himself back or not, the ability to make someone else come back might be more useful than keeping Landroval around. The unique Eagle allies don't have cool abilities, but being able to enable Gwaihir's Debt on turn one has some value, I think.  At 7 threat Meneldor is a whole lot cheaper than Gwaihir hero, without his limitation.\n> \n> I like the idea of Leaflock as a hero in an all-ent deck because he is only 7 threat, but can get to 2 wp easily with Treebeard/Quickbeam abilities and max at 4.\n> \n> Bill the Pony sadly can't be a hero, since the contract is an attachment.  Of course, that also means that Wiglaf in a Dale deck *starts* with 3 willpower and an attachment he can use to ready.  Good King of Dale target.\n> \n> I'm not sure why you're down on Halbarad.  Yes, 9 cost makes it hard to fit in a secrecy deck, but across from one his passive effect would be extremely valuable.\n> \n> I'm not as high as you on Gildor -- he's got great stats, so when is he going to spare the exhaustion for his ability?  I prefer non-exhausting abilities like Galdor and Erestor have.  Dori has a similar issue -- if he didn't have to exhaust to absorb hero damage, he could be really valuable at 7 threat with a few good attachments.\n\nFair points. I guess no pony heroes then - poor Bill.\n\nI’m intrigued by Gildor because of the shenanigans he enables. Without having it thought through, here is what my impression is based on:\n\n-Vilya is a thing. A single exhaust can set up two activations.\n\n-Works fine with hero Gandalf.\n\n-Combined with shuffle effects lets you sub dead cards.\n\n-Likely fun with hero Erestor. Drew a card you don’t want now, but next turn? Gildor can help.\n\n-He’s a friend of dwarven miners and can go hide a cache or two, so Zigil Miner can go to town.\n\nThe exhaust is a steep price to pay, but surely worth it in a variety of scenarios. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897385","commentId":3897385,"userName":"RebelX","timestamp":1582106058,"content":"Another point that might be worth mentioning: These objective allies might make great targets for the contract  - especially the Silvan one as it seems to read that you get to draw a card each time you quest successfully, with presumably 3 WP.\n\n \n\nIs anybody else hoping that we get those as player cards with the last AP? The Silvan one could make Silvan a card drawing powerhouse with Galadriel and ally Legolas. \n\n \n\nI am just a bit bummed that the contract won't give us a good option for a tactics silvan hero...\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897408","commentId":3897408,"userName":"JonG","timestamp":1582111005,"content":"> 13 hours ago, Gibby said:\n> \n> Ad-hoc evaluation of unique allies as contract targets:\n> \n> General consideration: The expectation is that the best targets are those that have low stats, but are highly costed for amazing and recurring abilities. \n> \n> Lore Anborn: 8 threat cost, fair stats, relevant traits. Recurring traps is a relevant ability. Fair target. \n> Leadership Anborn: 8 threat costs, fair status, relevant traints. Increase engagement cost and dealing damage ok, but not amazing. Ok target. \n> Angbor the Fearless: 5 threat cost for a fair quester. Relevant traits. The valor trigger nombos with the low threat cost. Niche target. \n> Arwen: 5 threat cost, relevant traits and her tried and proven ability make her a good target. To consider: her ally cost of only 2 which is part of what makes her great in the first place. Also you can't use her hero version. Good target. \n> Azain Silverbeard: 7 threat cost, relevant traits. The ability is interesting, albeit a bit niche. Could be an interesting pick for quests with a number of low HP enemies. Niche target. \n> Barliman Butterbur: Nope.\n> Beechbone: The general problems with ents is that it is their ally cost that makes them attractive. Paying for the stats in threat and starting with an exhausted hero is meh. \n> Beorn: 13 threat costs makes him one of the more expensive hero options out there. His ability is likely a tad better then Tactics Boromir discard ability, but then Beorn lacks his mad readying skills. Niche target. \n> Bifur: Nothing to see here. \n> Bilbo Baggins: 4 threat costs for a 2WP quester that does not die to 1 damage. Looks like a good deal. Starting with a pipe is also nice. I expect that he will be a popular target. Good target. \n> Bill the Pony: The only way to get a hero with the coveted pony trait. Someone will play it for that reason alone, but other than that not very interesting as the main selling point of the ally is that its resource cost is 0. \n> Spirit Bofur: Nothing to see here. \n> Tactics Bofur: 7 threat costs for 2WP, 2 ATT and 3 HP is ok. The ability to repeatedly tutor for weapons will surely make him see play. Good target. \n> Bombur: Maybe against quests with high threat underground locations? Very niche at best. \n> Boromir: 9 threat cost with two relevant abilities and traits are likely sufficient to make him see play. The contract's readying limitation does matter here. Fair target. \n> Brok Ironfist: Not very exciting to say the least. You could replace hero Brok by ally brook if the latter bites the dust just for the memes. Meh target. \n> Ceorl: A hero that can be passed around the table. Very interesting. Fair target. \n> Damrod: Discard for small benefit. Not very interesting. Meh. \n> Denethor: Pay for stats with only downside abilities? Pass. \n> Derwine: 7 threat costs for 3DEF 3P sentinel with built in shadow cancelling? I expect that this will see play. Good target. \n> Derufin: Discard for small benefits? I do not see the point. Meh. \n> Dori: His ability to take damage instead of a hero does not shine here. Pass. \n> Dwalin: Blank ability. Pass. \n> Spirit Elfhelm: Hot tech against certain quests. Niche target. \n> Tactics Elfhelm: Blank ability. Pass. \n> Elladan and Elrohir: Ok alternative to their hero versions with lower threat cost, lower HP and lower off-stat (the one that is not boosted by the sibling). Interesting to have options against Orc heavy quests. Fair targets.\n> Elrond: 11 threat cost for an additional card at the start of the game and a body does that does not stick around? Pass. \n> Emery: Blank ability: Pass. \n> Eomund: Even though his ability requires to discard him, the effect of readying everyone Rohan can be powerful. Niche target. \n> Eothain: 8 threat costs puts him in actual hero territory. His ability is ok, but not spectacular. Also Imrahil exists. Niche target. \n> Erestor: 6 threat costs for an interesting ability that is not quite as extreme as that on his hero counterpart. Good target. \n> Leadership Faramir: This was featured in the article, so it better be ok. I think it is. Ok target. \n> Lore Faramir: Surely there has to be a quest or two where his ability matter during setup (depening on the precise rules for setup order). Niche``?\n> Farmer Maggot: Meh. \n> Fili: Meh. \n> Firyal: 9 threat costs for a good quester with an amazing ability. Good target. \n> Forlong: Everyone's favourite unique outlands ally as another hero? Surely this will be a thing with Hirluin and outlanded Imrahil. Good target. \n> Gaffer Gamgee: 3 threat cost for a hobbit hero will put a lot three hobbit decks comfortably into secrecy territory. The ability is niche, but relevant. Ok target. \n> Galadriel: Nope. Another white council member that does not like this contract. \n> Galdor of the havens: Same stats as his hero version, but a interesting different ability. Will see play. Good target. \n> Galion: 1 threat cost for a third hero will be good enough to make it into secrecy decks wanting another spirit hero. Ok target. \n> Gamlin: Ability to recur Rohan allies on a stick may make this good enough. Meh stats for 6 threat costs. Niche target. \n> Ghan-Buri-Ghan: If you ever wanted a wose hero, here is your chance. For only for threat cost, is ability is quite ok. The discard ability will rarely be used, but it's a nice bonus. Good target. \n> Gildor: Hero quality stats and cost with an amazing ability. This will enable new decks. Good target. \n> Gimli: 9 threat cost for an allrounder make him fairly expensive. Relevant ability. Ok target. \n> Gleowine: 3 threat costs for card draw on a stick make this a Beravor light that will fit in a number of secrecy decks. Good target. \n> Gloin: Nope. \n> Glordfindel: 11 threat costs with a hero-level ability make this an eligible target. Fair target. \n> Grimbold: Discard hero to feint? Not great, but you get a 2 WP tactics hero for 6 threat cost. Niche target. \n> Guthalf: 6 cost sentinel tactics hero. Niche target. \n> Gwaihir: If you always wanted a Gwaihir hero, but the actual hero Gwaihir is too expensive for you, then this will do. The response will fizzle though. Too bad. Meh. \n> Halbarad: Too high cost for an all-rounder hero. Ability not relevant enough. Meh. \n> Haldir of Lorien: Also too high cost for all-rounder. Ranged and sentinel are nice though. Niche taret. \n> Halfast Gamgee: 5 threat cost leadership hobbit hero that quests for 2 and comes with a free resources. This will go in a number of hobbit secrecy decks. Good target. \n> Hama: Meh stats and discard to use ability. Very very niche at best. \n> Henamarth Riversong: Everyone's favourite scrier now collects 1 lore resources for round for 3 threat cost. Squishy, but good. Good target. \n> Ingold: 5 cost for a strong leadership quester. Why not? Fair target. \n> Ioreth: Covered in article. Good target. \n> Jubayr: Defender that discards shadow cards. Good target. \n> Kili: Nope. \n> Landroval: The question here is whether he can bring himself back. Need some rulings, but likely niche. \n> Leaflock: An ent. Niche. \n> Leogolas: Nice to have options. Good stats, traits and ability. Good target. \n> Lindir: Not sure on the rule here. If his ability triggers before you draw the starting hand, then this may be fantastic, but that I doubt that this is the case. Meh otherwise. \n> Mablung: A 5 threat cost hero that quests for 2 in ok. The ability to increase an enemies engagement cost (if the setup timing allows it to trigger) is very narrow in application. Niche target. \n> Meneldor: Another mediocre way to get an eagle hero. Niche for that thematic reason, but meh otherwise. \n> Merry: 4 threat costs for a 2WP quester that doesn't die to a single damage. If you can afford 3 threat cost more for Sam, then this will be the better option unless you already run him. Niche target. \n> Nori: 6 threat for an ok ability in a dwarven mining deck. Ok target. \n> Orophin: 6 threat for a good quester/attacher stat distribution with ranged. Ok target. \n> Pippin: 4 threat for 2WP and 2HP is ok. Both abilities are very relevant, makeing him a stand-out amongst hobbit targets. Good target. \n> Prince Imrahil: Nombo time!\n> Quickbeam: An ent. The main selling point as an ally is his ridiculously low cost. Less good as a hero, though the readying make this playable in some cases I suspect - even with the contract limitation on readying. Niche target. \n> Robin Smallburrow: 5 threat cost for a 2 quester and an ability that is only occasionally useful at best. Ok, but there are likely better options. Ok target. \n> Rosie: Everyone's favourite female leadership hero. Good target. \n> Rumil: Ok stats and ranged, but nothing more. Meh. \n> Sam Gamgee: I think the hero version is the better one here. However, this may find a spot in a hobbit deck that is looking for another spirit hobbit that isn't Pippin. \n> Skinbark: Does nothing the first round, but the ability may be good enough in some quests. Haven't checked. Niche. \n> Sulien: 3 WP for 7 threat cost is ok, but in spirit you could pay 1 or 2 threat more to get Lothiriel or Eowyn. Niche target. \n> Wigalf: I suppose the readying ability makes him ok, but not exciting. Ok target. \n> Yazan: Hero grade stats and hero grade ability (albeit on the weaker side). Probably the worst of the Harad allies as targets. Ok target. \n> \n> \n> In my count that makes 17 good targets and a lot of other options to play around with. Also nothing seemed OP. A very interesting contract overall, that opens up a wealth of deckbuilding options. Happy to see this contract! \n>  \n\nYou deserve a like just for doing all that work! 😉"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897423","commentId":3897423,"userName":"dalestephenson","timestamp":1582113205,"content":"> 1 hour ago, RebelX said:\n> \n> I am just a bit bummed that the contract won't give us a good option for a tactics silvan hero...\n\nLegolas-ally-turned-hero will be an *excellent* tactics silvan hero."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897425","commentId":3897425,"userName":"dalestephenson","timestamp":1582113421,"content":"> 6 hours ago, Amicus Draconis said:\n> \n> And what is the point of the forced effect on Eagle Messenger? Sure he is cheaper and non unique compared to the other tactics allies with 2 or more willpower.  But as long as you want to make progress he is going to become very expensive. I'd rather pay an extra resource for Bofur, Grimbold, Meneldor or Beechbone.\n\nExcept for Meneldor, you can't grab any of those with Eagles Are Coming.  Eagle Messenger surely isn't intended to buff Tactics questing in general, but to buff Eagles decks -- thanks to Radagast's staff, their economy is better than it used to be, but they're sorely short of questing.  You'll want Meneldor *and* Messengers in a solo Eagles deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897472","commentId":3897472,"userName":"player3351457","timestamp":1582118577,"content":"> 1 hour ago, dalestephenson said:\n> \n> Legolas-ally-turned-hero will be an *excellent* tactics silvan hero.\n\nHey, the very possibility of being able to run a tactics silvan hero besides legolas is a win for me. Rumil for 7 threat paired with Legolas is just fine, even without a good trigger (though are there some quests that start with an engaged enemy? Dropping 2-3 damage on that enemy would be nice). How many silvan tools are there, with only one tactics silvan?? Would make a nice combat deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897479","commentId":3897479,"userName":"PocketWraith","timestamp":1582119303,"content":" \n\n> 9 hours ago, pmdoug said:\n> \n> - Ghan-buri-Ghan is hampered by his discard effect, but I'll gladly slot him into a Haldan/Idraen deck. \n> \n> I'm very excited for Wiglaf, but I'm a bit confused about his response. Does putting him into play for the contract trigger \"After you play Wiglaf...\" ? I know it normally would say \"from your hand\" to stop these responses, but I'm never clear on the language.\n\nIn multiplayer Ghan will be 4 threat for usually 2-5 willpower, which is pretty solid.\n\nPutting into play is not playing. Wiglaf will not trigger.\n\n> 8 hours ago, Amicus Draconis said:\n> \n> And what is the point of the forced effect on Eagle Messenger? Sure he is cheaper and non unique compared to the other tactics allies with 2 or more willpower.  But as long as you want to make progress he is going to become very expensive. I'd rather pay an extra resource for Bofur, Grimbold, Meneldor or Beechbone.\n\nIt's an eagle. It's what they do.\n\n> 6 hours ago, Flrbb said:\n> \n> I do wonder for which ally they put \"attached character cannot ready more than once per phase\" on the contract!?\n\nI'm guessing Faramir, though triggering him twice is already pretty crazy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897513","commentId":3897513,"userName":"Thanatopsis","timestamp":1582120959,"content":"> 6 hours ago, Flrbb said:\n> \n> I do wonder for which ally they put \"attached character cannot ready more than once per phase\" on the contract!?\n\nIt's definitely principally focused on the Faramir (Le) ally. But, there is tremendously more hero readying in the game than for allies. It felt to me like the drawback to using the contract. We get to convert an ally into a hero, but we can't really go crazy with the. Ex/ Legolas will be a solid draw hero for tactics, but we can't stack 3 Unexpected Courages on him and get 4 cards in a single phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897598","commentId":3897598,"userName":"Ywingscum","timestamp":1582126304,"content":"I love Wiglaf, but I don’t think I’d use him as a hero in my Dale deck.  His ability is so nice, I love playing him with ancestral armour.  I think I’ll keep him as an ally.  But the Dale messenger will make my Dale deck.  Healing has been one of its 2 weaknesses.  Now just need a Dale threat reducer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897712","commentId":3897712,"userName":"GrandSpleen","timestamp":1582132254,"content":"Cool to see another pipe, and specifically one that is not trait-restricted. I can't think of an example at the moment, but I know a couple of times in the past I've gotten stuck when trying to build a deck with pipes because the character I wanted to put it on was not Istari, Dunedain, Dwarf, or Hobbit. Now we have one that can go anywhere."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897756","commentId":3897756,"userName":"Halberto","timestamp":1582135010,"content":"> 10 hours ago, General_Grievous said:\n> \n> Boromir tactics and Rosie for sure\n\nAnd Faramir, i think"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897805","commentId":3897805,"userName":"dalestephenson","timestamp":1582138048,"content":"The preview for Shadow in the East said that contracts were \"put into play along with their heroes at the beginning of the game with its “A” side face up.\"  This is logical, and for this particular contract essential -- since your desired ally-turned-hero comes only from the deck, not the hand.  So step 2 of setup, only after the deck shuffling.  This means that Rumil and Meneldor's enter play abilities are useless (quest hasn't set up yet), but that Lindir's enter play *should* work to let you start with an extra three cards.  Has the timing from that preview been overruled anywhere?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897806","commentId":3897806,"userName":"dalestephenson","timestamp":1582138079,"content":"It also means that you can start with an effective 49-card deck if you use this contract."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897808","commentId":3897808,"userName":"dalestephenson","timestamp":1582138174,"content":"One other thought -- since the ally's threat is *added* to the starting threat, that means it will be ignored by Loragorn's ability.  On the flip side, selecting a Hobbit for Folco or a lore ally for Mirlonde won't help.\n\nEdited February 19 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897824","commentId":3897824,"userName":"player3351457","timestamp":1582139280,"content":"> 15 minutes ago, dalestephenson said:\n> \n> The preview for Shadow in the East said that contracts were \"put into play along with their heroes at the beginning of the game with its “A” side face up.\"  This is logical, and for this particular contract essential -- since your desired ally-turned-hero comes only from the deck, not the hand.  So step 2 of setup, only after the deck shuffling.  This means that Rumil and Meneldor's enter play abilities are useless (quest hasn't set up yet), but that Lindir's enter play *should* work to let you start with an extra three cards.  Has the timing from that preview been overruled anywhere?\n\nUnfortunately it was ruled here that the setup on contracts occurs after quest setup, not before like when hero setups occur. That means that you could technically draw the attachment you want in your starting hand for the grey wanderer contract or the ally you want for the kings messenger contract. Lindir whiffs, but Rumil might not."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897836","commentId":3897836,"userName":"dalestephenson","timestamp":1582139960,"content":"That's an unfortunate ruling -- not just because it contradicts the preview article, but because it opens the door to effective setup losses.  It's bad enough with Grey Wanderer that you could miss out on your preferred attachment because it is in hand rather than in the deck, but with this contract your entire deck is designed on the presumption that you'll be able to use a specific ally as a hero -- and if your copy is in hand, you can't.\n\nYou could mitigate by including multiple copies, but that'd be a terrible waste of deck space unless you're running a Harad-ally/hero with Kahliel.\n\nSetting up the contracts, especially this one, at step 2 with the heroes is a much more logical place, though I think it would prevent Guarded uses with Grey Wanderer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897864","commentId":3897864,"userName":"player3351457","timestamp":1582141706,"content":"> 28 minutes ago, dalestephenson said:\n> \n> That's an unfortunate ruling -- not just because it contradicts the preview article, but because it opens the door to effective setup losses.  It's bad enough with Grey Wanderer that you could miss out on your preferred attachment because it is in hand rather than in the deck, but with this contract your entire deck is designed on the presumption that you'll be able to use a specific ally as a hero -- and if your copy is in hand, you can't.\n> \n> You could mitigate by including multiple copies, but that'd be a terrible waste of deck space unless you're running a Harad-ally/hero with Kahliel.\n> \n> Setting up the contracts, especially this one, at step 2 with the heroes is a much more logical place, though I think it would prevent Guarded uses with Grey Wanderer.\n\nI agree. It would have made more sense to keep the timing in the normal player setup effects and then just rule that guarded cards cannot be used with grey wanderer contract because the guarded effect cannot be completed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3897940","commentId":3897940,"userName":"Halberto","timestamp":1582144977,"content":"> 1 hour ago, dalestephenson said:\n> \n> That's an unfortunate ruling -- not just because it contradicts the preview article, but because it opens the door to effective setup losses.  It's bad enough with Grey Wanderer that you could miss out on your preferred attachment because it is in hand rather than in the deck, but with this contract your entire deck is designed on the presumption that you'll be able to use a specific ally as a hero -- and if your copy is in hand, you can't.\n> \n> You could mitigate by including multiple copies, but that'd be a terrible waste of deck space unless you're running a Harad-ally/hero with Kahliel.\n> \n> Setting up the contracts, especially this one, at step 2 with the heroes is a much more logical place, though I think it would prevent Guarded uses with Grey Wanderer.\n\nOr just reshuffle your hand and pretend you are starting a new game"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898118","commentId":3898118,"userName":"sappidus","timestamp":1582155479,"content":"> 4 hours ago, dalestephenson said:\n> \n> One other thought -- since the ally's threat is *added* to the starting threat, that means it will be ignored by Loragorn's ability.  On the flip side, selecting a Hobbit for Folco or a lore ally for Mirlonde won't help.\n\nIt is not entirely clear to me what this contract does re: starting threat for the purposes of Loragorn. I lean towards \"add… to your starting threat\" meaning that starting threat itself is modified, and thus Loragorn will reset to the level with the ally stat sum.\n\nIf the designer intent was just to raise the threat level that you start round #1 with without modifying your starting threat, it would've been easy enough to word it like Tactics Éowyn, \"Raise your threat by yadayada.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898296","commentId":3898296,"userName":"dalestephenson","timestamp":1582174004,"content":"> 4 hours ago, sappidus said:\n> \n> It is not entirely clear to me what this contract does re: starting threat for the purposes of Loragorn. I lean towards \"add… to your starting threat\" meaning that starting threat itself is modified, and thus Loragorn will reset to the level with the ally stat sum.\n> \n> If the designer intent was just to raise the threat level that you start round #1 with without modifying your starting threat, it would've been easy enough to word it like Tactics Éowyn, \"Raise your threat by yadayada.\"\n\nGood point.  TaEowyn's threat-raising ability is in-game rather than setup, but her setup reduction doesn't mention \"starting threat\", just says to reduce threat by three.  For Loragorn's purpose she counts as nine.\n\nThe \"add\" clearly shows starting threat was already established, so Mirlonde/Folco don't take advantage of ally-heroes.  I mean, technically the threat cost of a lore ally would be one less than sum of stats with Mirlonde, and Folco's threat cost would be reduced by one by an ally-hero, but too late to affect starting threat.  All it would matter for is Fall of Gil-Galad.\n\nSince the ally-heroes enter as allies and become heroes, I would think that Celeborn and Tom Cotton would give their first-round boosts to silvans/hobbits.  But Galadriel won't allow first turn questing without exhausting, since at the point they commit to the quest they won't be allies any more.\n\nRe-reading the contract, I think its immunity to card effects may prevent Wiglaf from exhausting it to ready, as I thought he could.  However, it would still give him +1 willpower and cause a card to be drawn with LeBrand."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898443","commentId":3898443,"userName":"dalestephenson","timestamp":1582200876,"content":"> 15 hours ago, Halberto said:\n> \n> Or just reshuffle your hand and pretend you are starting a new game\n\nInstant setup losses are way less annoying than during play (e.g. Sleeping Sentry), but they're still annoying.  Especially when the problem wouldn't even exist if the timing were as originally announced.  Since both contracts pulling from your deck say just \"deck\" rather than \"deck and hand\", I think it's pretty obvious the contracts were not designed to take effect after the mulligan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898457","commentId":3898457,"userName":"mttrchrds","timestamp":1582203668,"content":"Hats off to the devs for this contract. Gives the game a whole new dimension. Wonderful stuff.\n\nQuick question regarding contracts, are they unique? i.e. could each player use a copy of Messenger of the King in a multiplayer game?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898464","commentId":3898464,"userName":"Halberto","timestamp":1582205343,"content":"> 1 hour ago, dalestephenson said:\n> \n> Instant setup losses are way less annoying than during play (e.g. Sleeping Sentry), but they're still annoying.  Especially when the problem wouldn't even exist if the timing were as originally announced.  Since both contracts pulling from your deck say just \"deck\" rather than \"deck and hand\", I think it's pretty obvious the contracts were not designed to take effect after the mulligan.\n\nYou are probably right, but we all know this game is not always impeccable with timing. And let's be honest, this time the issue for the players is objectively limited. The contract is not perfectly designed in this regard, sure,  but I'm not going to  complain against a card nobody ever thought about and that is worth probably 10 cycles of heroes in terms of game variety and deckbuilding.  \n\nTiming issue is annoying? Sure. But I would welcome any time annoying cards so brilliant in terms of game play,  variety  and fun. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898468","commentId":3898468,"userName":"rees263","timestamp":1582205562,"content":"> 31 minutes ago, mttrchrds said:\n> \n> Hats off to the devs for this contract. Gives the game a whole new dimension. Wonderful stuff.\n> \n> Quick question regarding contracts, are they unique? i.e. could each player use a copy of Messenger of the King in a multiplayer game?\n\nNot unique, everyone can have the same contract."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898470","commentId":3898470,"userName":"AllWingsStandyingBy","timestamp":1582205978,"content":"> 1 hour ago, dalestephenson said:\n> \n> Since both contracts pulling from your deck say just \"deck\" rather than \"deck and hand\", I think it's pretty obvious the contracts were not designed to take effect after the mulligan.\n\n\n\nObviously.  This is a post-hoc band-aid response to some folks trying to argue they could use Grey Wanderer to grab an immediate Guarded card because their was no Encounter Deck yet.  So now anyone wanting to play Gray Wanderer has to run multiple copies of Strider and anyone running King's Messenger needs to run multiple copies of their preferred ally-to-hero.\n\nThe better solution, in my opinion, would have been to have left Contract Set-Up at the same time as Hero Set-Up and just have said that Gray Wanderer is errata'ed to say you can attach a 1-cost attachment without Guarded (or, say that you put the Guarded card into the Staging Area, and once the Encounter deck is prepared you reveal a card to be guarded).  This would have shut down the cheese of starting with Necklace of Girion attached to a wanderer without creating a bit of akward clunkiness for every single deck running Wanderer or Messenger as its contract.\n\n\nThat said, I don't want to sound overly negative.  The contracts especially and this entire cycle in general have been phenomenal additions to player options, and I couldn't be more pleased or excited as a player.  And I don't begrudge the designers or testers for Gray Wanderer's failure to include \"without Guarded\" as part of its requirement ... the timing of all the pre-game set-up windows for this game is a bit wonkier than most."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898481","commentId":3898481,"userName":"AllWingsStandyingBy","timestamp":1582206846,"content":"> 17 hours ago, Halberto said:\n> \n> Or just reshuffle your hand and pretend you are starting a new game\n\n\nSure, but there's a fine line to walk.  On the one hand, as a cooperative game that lots of people play solo, \"anything goes\" house rules are always a viable option -- people can find the joy in this game in whatever ways best suit them, but on the other hand the more times players just 'set' the start of the game to align with their preferences before actually starting a quest (e.g. just selecting the prisoner in Dol Goldur, multiple mulligans until acceptable starting-hand conditions are met, resetting from a double Hill Troll Anduin Start, etc.), the more the integrity of the game as a constructed experience becomes grayer.\n\n\nHaving sub-optimal contract timing windows that strongly encourage people to either (1) reset / take bonus mulligans until the attachment/ally is not in your starting hand OR (2) run additional redundant copies of a unique card that then bloats the deck could probably warrant a better timing window, in my opinion.\n\nEdited February 20 by AllWingsStandyingBy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898534","commentId":3898534,"userName":"dalestephenson","timestamp":1582211698,"content":"> 1 hour ago, Halberto said:\n> \n> You are probably right, but we all know this game is not always impeccable with timing. And let's be honest, this time the issue for the players is objectively limited. The contract is not perfectly designed in this regard, sure,  but I'm not going to  complain against a card nobody ever thought about and that is worth probably 10 cycles of heroes in terms of game variety and deckbuilding.  \n> \n> Timing issue is annoying? Sure. But I would welcome any time annoying cards so brilliant in terms of game play,  variety  and fun. \n\nI'm not at all complaining about the *card*, I'm complaining about the ruling -- a ruling that contradicts what was originally said about contract timing and is also inconsistent with the Setup timing for heroes and campaign boons.  I get that the original timing is problematic for Guarded attachments, but moving the timing creates IMO worse problems -- I think it would've been better to exclude Guarded attachments, or make an ad-hoc ruling that putting the Guarded attachment into play without an encounter deck creates a passive effect waiting for the encounter deck to appear so it can resolve.\n\nIt's an ill-wind that blows nobody good, of course.  For example, moving the timing may benefit Meneldor and Rumil even while it downgrades Lindir.  It also opens the possibility that you have multiple uniques in the deck that your deck could use as hero, so you can choose the one that's not in your hand *and* most responsive to the quest setup.  For Grey Wanderer, it means that if you have the 1-cost neutral Strider card already in hand, you can grab something else for your free attachment.  Arguably it makes both contracts more flexible.  But the (presumed) original timing is more sensible and more importantly, more reliable.  Turning allies into hero *dramatically* increases the deckbuilding options -- making the ally choice unreliable takes away from that, and also incentivizes mulliganing to get rid of a card instead of looking for a card.\n\nAnother possibly remedy would be to errata the \"deck\" in both contracts to \"deck and hand\", though for completeness deck, hand, and discard pile would be best, as some quests can discard from deck during their setup (also would make hero Galdor's ability slightly more useful).\n\nIf the current timing hold, the contract becomes completely useless against Escape From Mount Gram.  (Though even with the original timing the contract would be of use only if you used the contract ally as the remaining hero -- not many ally-heroes would do well in that role, though a couple would.)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898585","commentId":3898585,"userName":"Bonarchie","timestamp":1582214452,"content":"I think that the confusion arises from an oversight: there is an encounter deck during step 1 of set up according to the learn to play guide and the Rules Reference.\n\nHeroes and Contracts enter play during step 2."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898610","commentId":3898610,"userName":"player3351457","timestamp":1582215641,"content":"> 39 minutes ago, dalestephenson said:\n> \n> I'm not at all complaining about the *card*, I'm complaining about the ruling -- a ruling that contradicts what was originally said about contract timing and is also inconsistent with the Setup timing for heroes and campaign boons.  I get that the original timing is problematic for Guarded attachments, but moving the timing creates IMO worse problems -- I think it would've been better to exclude Guarded attachments, or make an ad-hoc ruling that putting the Guarded attachment into play without an encounter deck creates a passive effect waiting for the encounter deck to appear so it can resolve.\n> \n> It's an ill-wind that blows nobody good, of course.  For example, moving the timing may benefit Meneldor and Rumil even while it downgrades Lindir.  It also opens the possibility that you have multiple uniques in the deck that your deck could use as hero, so you can choose the one that's not in your hand *and* most responsive to the quest setup.  For Grey Wanderer, it means that if you have the 1-cost neutral Strider card already in hand, you can grab something else for your free attachment.  Arguably it makes both contracts more flexible.  But the (presumed) original timing is more sensible and more importantly, more reliable.  Turning allies into hero *dramatically* increases the deckbuilding options -- making the ally choice unreliable takes away from that, and also incentivizes mulliganing to get rid of a card instead of looking for a card.\n> \n> Another possibly remedy would be to errata the \"deck\" in both contracts to \"deck and hand\", though for completeness deck, hand, and discard pile would be best, as some quests can discard from deck during their setup (also would make hero Galdor's ability slightly more useful).\n> \n> If the current timing hold, the contract becomes completely useless against Escape From Mount Gram.  (Though even with the original timing the contract would be of use only if you used the contract ally as the remaining hero -- not many ally-heroes would do well in that role, though a couple would.)\n\nI would even argue that allowing for guarded cards with the grey wanderer isnt even that much of a game breaking situation. Sure you get the attack or willpower boosts free of cost, but you're also sacrificing the readying option given from strider, which is the ultimate upside when running only one hero. I'd argue that allowing guarded cards allow for some variety of options... now it's pretty much locked in that strider is the way to go.\n\nWhy rewrite the contract rules just for that conclusion? Weird, for sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898612","commentId":3898612,"userName":"dalestephenson","timestamp":1582215691,"content":"> 15 minutes ago, Bonarchie said:\n> \n> I think that the confusion arises from an oversight: there is an encounter deck during step 1 of set up according to the learn to play guide and the Rules Reference.\n> \n> Heroes and Contracts enter play during step 2.\n\nBy gum, you're right.  By rule, the encounter deck exists in step 2 already.  Mechanically, playing a guarded attachment then should work just fine -- though it has the potential to fetch a Guard that will be put out of play during scenario setup!\n\nWhen contracts were introduced we were told they would enter play during step 2, but Caleb's ruling (linked upthread) requires it to happen after step 7. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898624","commentId":3898624,"userName":"rhtm70","timestamp":1582216298,"content":"> On 2/18/2020 at 2:09 PM, dalestephenson said:\n> \n> Leaflock doesn't seem quite so bad as a starting hero, since you don't pay threat for his initially non-existent willpower.  In a deck with Treebeard and Quickbeam you can get his willpower to 2 in the first turn and shouldn't have much trouble maintaining it at 4.\n> \n> Skinbark would be fun against orc quests -- 4 base attack, ignores defense, for only 9 threat.  Squash.  Squash.  Squash.\n> \n> Ingold can deliver an impressive three willpower for five threat, if the heroes all have a resource.\n\nSkinbark was my first thought also. There are a \"few\" quests that have orcs. What's really good is their defense is not just minus but negated entirely. Put Dunedain Mark on him and he can kill even the biggest ones. I did a quick check and there are 75 orcs that he can kill in one hit with no attachments on him.\n\nEdited February 20 by rhtm70"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898629","commentId":3898629,"userName":"General_Grievous","timestamp":1582216874,"content":"> 9 minutes ago, rhtm70 said:\n> \n> Skinbark was my first thought also. There are a \"few\" quests that have orcs. What's really good is their defense is not just minus but negated entirely. Put Dunedain Mark on him and he can kill even the biggest ones. I did a quick check and there are 75 orcs that he can kill in one hit with no attachments on him.\n\nI think the Ents and Harad came out on top for this contract. Though there are some other nice niche ones too"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3898870","commentId":3898870,"userName":"AllWingsStandyingBy","timestamp":1582228637,"content":"> 4 hours ago, dalestephenson said:\n> \n> It's an ill-wind that blows nobody good, of course.  For example, moving the timing may benefit Meneldor and Rumil ...\n\n\nTaking someone like Meneldor with King's Messenger is terribly sub-optimal, even if he can put his progress on a location that has started staged.  The whole point of an Eagle/Meneldor deck is to have him cycling in and out of play a bunch, acting effectively as a Tactics Asfaloth for location control.  I've played an Eagle deck lot lately, and Meneldor is the deck's MVP and it's not uncommon to have him add double-digit progress to locations over the course of a game.  To use him as a Hero who might maybe put 2 progress onto a pre-staged location is nearly a criminal waste of his talents for anyone who wants to run Eagles.\n\nTo treat him as a 7 Threat Tactics hero that basically has no ability, cannot have Restricted attachments, and locks you out of running his intro/exit ally version is pretty pointless.  If you want 2WP Tactics for questing, take the 4 Threat Merry, and if you want an attacker there are much better options in the 7 Threat range for the contract (e.g. Legolas, who can have restricted attachments, has +1 Attack with Ranged, and grants unparalleled card-draw access).  Meneldor as a hero offers nothing, since no cards key off of the number of Eagles in play nor are their any Eagle-specific attachments.  All you gain is a 7-Threat hero to pair with an Istari hero for immediate access to Gwaihir's Debt, but that's pretty underwhelming when you can easily key Gwaihir's Debts from ally versions of Wilyador or Meneldor, and for 2 more Threat Hero-Landroval would grant immediate Gwaihir's Debt access while also offering a more robust HP pool with Sentinel and revival protection for the other heroes in the game. \n\nSummary: no contract timing window decisions should be made based upon whether it facilitates enter play abilities of Eagle or Silvan allies-turned-heroes, because even if it is conducive to their enter effect they are still very suboptimal choices outside of anyone looking at pure thematic considerations of hero lineup (eg wanting Radagast alongside two Eagles), and those folks will pick such heroes whether or not they suit timing windows.\n\n \n\n> 3 hours ago, player3351457 said:\n> \n> I would even argue that allowing for guarded cards with the grey wanderer isnt even that much of a game breaking situation. ...but you're also sacrificing the readying option given from strider, which is the ultimate upside when running only one hero.\n\n\nI mean, I think the concern is Necklace of Girion, which offers the same +2WP boost of Strider ontop of also bolstering the lone hero's resource pool.  Strider only lets the Wanderer quest unexhausted while you have < 3 characters, and it's a rare breed of lone hero that can actually remain alone the entire quest without needing to bring in allies to help quest/fight.  So, effectively Necklace of Girion is Strider, except it can't be shut off by having >5 characters and it gains an additional resource each turn... not to mention you could always start with the Necklace and then run 3x Strider, for an easy and cheap +4 WP double-dip.\n\n \n\n> 3 hours ago, General_Grievous said:\n> \n> I think the Ents and Harad came out on top for this contract. Though there are some other nice niche ones too\n\nIndeed!  Just a shame there's not a way to run 3 Harad heroes at once for pure thematic purposes, though Khaliel + Na'Asiyah + Messenger gets pretty close :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png]  Also a tragedy that we never got a tamed Mumakil creature ally that required exhausting/attaching a Harad character as additional costs to play/keep in play, but that's a lamentation for another day.  Personally, I use \"Giant Bears\" with alternative Mumak art in my Khaliel Wanderer deck, and cataphract camel alt art as his Armored Destrier, etc. ...\n\nEdited February 20 by AllWingsStandyingBy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3899001","commentId":3899001,"userName":"dalestephenson","timestamp":1582237924,"content":"Strider lets you quest unexhausted as long as you have less than three *heroes*, which is always the case for a Grey Wanderer deck.  It's true that the willpower boost will fade out once you have five allies in play, but by that time your board state should be better.  It's not clear to me that Necklace of Girion is overpowered in a way that Strider is not -- one extra resource and permanent +2 wp instead of early +2 wp and permanent action advantage doesn't seem like a dealbreaker, especially when you start in secrecy (Resourceful) and could just as easily fetch Steward of Gondor without any Guarded issues.\n\nMeneldor can place a lot of location progress when going in and out of play, but the value of that is dependent on quest and number of players -- and the ease of getting him in and out of play.  Eagles aren't as easy and cheap to bring in and out as Silvans are (yet?).  It's absolutely true that Landroval has a useful ability post-entry and is only 2 more threat -- but he's also 1 wp.  Meneldor delivers 2 willpower (max for eagles) and delivers it for the lowest threat cost.  Sentinel has limited value when you're one-deck solo and/or have 1 defense and can't take restricted attachments.  I've been running an Eagles deck in this month's solo league, and when I get Meneldor in I'm keeping him in, because I need the willpower.\n\nIt's true that Meneldor and now Wilyador can set up Gwaihir's Debt more cheaply than the earlier unique eagles, but they cost additional resources, and add another card to find to setup the combo.  As far as I'm concerned setting up Gwaihir's Debt on turn one *is* an ability worth choosing a hero for, even if said hero is otherwise blank.  It's a powerful card, IMO the only tactics card worth nerfing Hama.\n\nIn the case of both Meneldor and Rumil, the argument isn't that they're attractive choices *because* they trigger, only that the change in timing makes them more valuable as heroes because they can trigger.  The counterargument that both benefit from coming in and out of play as allies, and thus are more valuable in ally role than as heroes, may certainly be true for a deck that can make them easily come in and out of play -- but that doesn't change the fact that *if* you make them heroes, the timing benefits them.\n\nAre there quests were guaranteeing two progress up front or up to three damage to an engaged enemy up front may make them attractive as hero choices?  Not many, but they exist.  For example, in To Catch an Orc you could choose and nuke the annoying Mugash's lair, leaving you with no locations (and no threat) in staging to begin a quest where you *must* place progress every turn to succeed.  If you can manage to pair Rumil with two ranged heroes (likely NOT one-deck solo), it'd be pretty sweet for him to instantly nuke an engaged Umbar Sentry in setup in Escape From Umbar.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3899060","commentId":3899060,"userName":"dalestephenson","timestamp":1582242130,"content":"Looking at Rumil's card, it looks like his ability (\"after you play from hand\") wouldn't trigger with the contract in any case.  Also looks like he's not as useful as I thought for my Lothiriel the Elven Queen deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3899147","commentId":3899147,"userName":"AllWingsStandyingBy","timestamp":1582255891,"content":"> 4 hours ago, dalestephenson said:\n> \n> Strider lets you quest unexhausted as long as you have less than three *heroes*, which is always the case for a Grey Wanderer deck.\n\n\nWow, I've had in my head that it was < 3 characters, not heroes.  Much more tempting now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3899174","commentId":3899174,"userName":"Yepesnopes","timestamp":1582259895,"content":"I totally ignore Caleb’s rulling. It seems to me a hasty reply, and his head is totally in the Marvel Champion lcg now 😊\n\nDon’t be hasty"},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3902281","commentId":3902281,"userName":"player3351457","timestamp":1582677106,"content":"> On 2/20/2020 at 11:38 PM, Yepesnopes said:\n> \n> I totally ignore Caleb’s rulling. It seems to me a hasty reply, and his head is totally in the Marvel Champion lcg now 😊\n> \n> Don’t be hasty\n\nHouse rule: Lindor works.\n\nGive the poor elf some love."},{"commentUrl":"https://community.fantasyflightgames.com/topic/305942-land-of-sorrow-preview-up/?do=findComment&comment=3902360","commentId":3902360,"userName":"General_Grievous","timestamp":1582684017,"content":"> 2 hours ago, player3351457 said:\n> \n> House rule: Lindor works.\n> \n> Give the poor elf some love.\n\nWe have lots of small house rules to fix thematic falls. Like Hands Upon The Bow being a ranged attack, Burglar's Turn working even if travelling to a location swaps it out with a different one, ignoring game-limiting errata and so on hahaha\n\nEdited February 26 by General_Grievous"}]}