{"url":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/","title":"Ceorl - where can he go?","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3905188","commentId":3905188,"userName":"NathanH","timestamp":1583055762,"content":"Ceorl's card text reads\n\n> Quote\n> \n> Action: Spend 1 <spirit> resource to ready Ceorl. Then, you may give control of Ceorl to another player. Any player may trigger this action. (Limit once per phase).\n\nDoes \"another player\" mean \"a player other than the one triggering this action\" or \"a player other than the one currently controlling Ceorl\"? I would interpret it as the former, but this really cuts down the versatility of this action. In a two-player game, you need Ceorl's owner to have Spirit or you can't pass control."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3905199","commentId":3905199,"userName":"player3351457","timestamp":1583059402,"content":"I interpret it as the latter. \"You\" is still the controller, per the rules, but any person may trigger the cost of \"pay one spirit resource\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3905274","commentId":3905274,"userName":"rees263","timestamp":1583076605,"content":"> 4 hours ago, player3351457 said:\n> \n> I interpret it as the latter. \"You\" is still the controller, per the rules, but any person may trigger the cost of \"pay one spirit resource\"\n\nI'm going to offer a slightly different interpretation. \n\nThe \"you\" must apply to the activating player. \"Spend\" in the first sentence is an imperative and so has an implied \"you\". So the spending player is also the player who chooses the new controller.\n\nHaving said all that, I could see \"another player\" referring to other than the controller, but i have always read it as other than you, the triggering player."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3905280","commentId":3905280,"userName":"sappidus","timestamp":1583077509,"content":"FWIW, I agree with the \"you\" = controller interpretation, with the \"Any player may trigger this ability\" essentially applying to the initial trigger & cost payment.\n\nIn other words, in the parlance of RR Initiating Abilities / Playing Cards [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Rule545], I'd say the \"any player may trigger\" text is no longer relevant at step #6, when the effect of the ability actually resolves.\n\nBut I think an official ruling would be useful to settle the issue."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906062","commentId":3906062,"userName":"sappidus","timestamp":1583181516,"content":"I was wrong!\n\nCeorl says, \"Spend 1 :spirit: resource to ready Ceorl. Then, you may give control of Ceorl to another player. Any player may trigger this action.\" Who does the \"you\" refer to, Ceorl's (initial) controller, or the player who triggered the action?\n\nMore generally, for these abilities that can be triggered by any player, does it mean that the triggering player initiates the trigger and pays the cost, but the card controller actually resolves the ability? Or does it work another way? Thanks!\n\n> Quote\n> \n> “You” refers to the player who triggers the ability. The person who triggers the ability pays the cost and resolves the effect.\n> \n> Cheers, Caleb\n\n \n\nEdited March 2 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906588","commentId":3906588,"userName":"player3351457","timestamp":1583258637,"content":"> 21 hours ago, sappidus said:\n> \n> I was wrong!\n> \n> Ceorl says, \"Spend 1 :spirit: resource to ready Ceorl. Then, you may give control of Ceorl to another player. Any player may trigger this action.\" Who does the \"you\" refer to, Ceorl's (initial) controller, or the player who triggered the action?\n> \n> More generally, for these abilities that can be triggered by any player, does it mean that the triggering player initiates the trigger and pays the cost, but the card controller actually resolves the ability? Or does it work another way? Thanks!\n> \n>  \n\nHow about that!\n\nBut, is the \"you\" paying the cost able to be \"another player\" as well?\n\nIf player 2 pays the cost to trigger the response, can you then give control of Ceorl to \"another player\", namely, yourself? \n\nVery interesting that this was not clarified..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906591","commentId":3906591,"userName":"player3351457","timestamp":1583258695,"content":"Or are we interpreting this as \"if you are playing with ceorl in a two player game and would like to pass ceorl to your partner, YOU must be the one carrying the spirit resource.\""},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906597","commentId":3906597,"userName":"dalestephenson","timestamp":1583259526,"content":"Since \"you\" is clarified to be the triggering player, and since \"any player\" can trigger the ability with a spirit resource, I'm not sure what's left to clarify.  If Ceorl is in a two player game, any player with a spirit resource can move Ceorl from the player he's currently with to the other player (subject to the limit).  It does not matter at all whether Ceorl is with the triggering player or not.  With 3+ players, triggering player A could move Ceorl from player B to player C."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906613","commentId":3906613,"userName":"rees263","timestamp":1583261165,"content":"> 20 minutes ago, dalestephenson said:\n> \n>  If Ceorl is in a two player game, any player with a spirit resource can move Ceorl from the player he's currently with to the other player (subject to the limit). \n\nI don't think it's that clear cut and the original question remains unanswered.\n\nEven if we know who \"you\" is, we can't say with 100% certainty whether \"another player\" means a player other than the current controller or a player other than the one using the ability. I lean towards the latter since that seems to fit the phrasing of the ability better."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906652","commentId":3906652,"userName":"dalestephenson","timestamp":1583264017,"content":"I lean towards \"other than the current controller\", because that's the only player Ceorl can *physically* move to.  It makes no sense to me that \"you\" could *not* spend 1 spirit resource to send Ceorl to yourself, but you *could* spend 1 spirit resource to send Ceorl exactly where he already is!\n\nIt's really such a niche ability in the first place that any interpretation that makes it even more useless is suspect, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906655","commentId":3906655,"userName":"NathanH","timestamp":1583264164,"content":"On the other hand, this stops me making my Justice Shall Be Done fellowship even more absurd, so it's probably for the best."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3906812","commentId":3906812,"userName":"RogueSeventeen","timestamp":1583277268,"content":"I could see it going either way, but I'm leaning towards \"another player\" being anyone but the \"you\" triggering the response for all the reasons previously stated.  But I also think there is additional thematic justification since Ceorl is a Rohan messenger and as I see it the player spending the resource is the one \"giving him a message\" and he would therefore need to deliver it to someone else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3949949","commentId":3949949,"userName":"player3351457","timestamp":1591714993,"content":"So I've been giving this some thought, and I think the verbiage of \"another player\" can be interpreted as including the one paying the cost (but not the current controller) because of the omission of the phrase \"different player\". I really think the intention of the card was to be able to be passed around, having anyone trigger the ability and anyone receive control of Ceorl.\n\nIf I am wrong in this assumption, then Ceorl can only be passed as so:\n\n2 Player\n\nPlayer 1 currently controls Ceorl.\n\n--Player 1 must be the one to spend the 1 spirit resource, and then can pass it to player 2.\n\n3 Player\n\nPlayer 1 currently controls Ceorl. \n\n--Player 1 can spend the 1 spirit resource and pass Ceorl to either Player 2 or 3.\n\n--Player 2 can spend the 1 spirit resource and pass Ceorl to Player 3.\n\n--Player 3 can spend the 1 spirit resource and pass Ceorl to Player 2.\n\n \n\n4 player plays out similarly. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3949958","commentId":3949958,"userName":"dalestephenson","timestamp":1591717116,"content":"With the passage of time, my opinion still hasn't changed -- \"another player\" means a player other than the one who Ceorl is currently with.  Interpreting it to exclude the triggering player makes the ability practically useless."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306423-ceorl-where-can-he-go/?do=findComment&comment=3949963","commentId":3949963,"userName":"dalestephenson","timestamp":1591717939,"content":"> On 3/3/2020 at 6:14 PM, RogueSeventeen said:\n> \n> I could see it going either way, but I'm leaning towards \"another player\" being anyone but the \"you\" triggering the response for all the reasons previously stated.  But I also think there is additional thematic justification since Ceorl is a Rohan messenger and as I see it the player spending the resource is the one \"giving him a message\" and he would therefore need to deliver it to someone else.\n\nThematically, since Ceorl is a Rohan messenger, he should be able to go back and forth between different players.  Excluding a spirit-triggerer from receiving a message has the practical effect that Ceorl will likely move once, or not at all.\n\nConsider two decks, one leadership/lore and the other spirit/tactics.  The leadership deck plays Ceorl, and the spirit deck can ready Ceorl.  If \"another player\" excludes the spirit-triggerer, Ceorl can't move *at all*, and since the triggering player sending the resource *doesn't* control Ceorl, it's hard for me to see a thematic fit for him \"giving him a message\".\n\nNow consider that \"another player\" means just another player than one Ceorl is currently with.  Now the spirit player can keep triggering Ceorl and sending him back and forth -- exactly what you thematically want from a messenger."}]}