{"url":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/","title":"Mighty Prowess","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3905487","commentId":3905487,"userName":"Vince79","timestamp":1583108772,"content":"Haven't seen this elsewhere, so I'll ask:\n\nThe text of Mighty Prowess says:  \n\n\"Response: After attached hero attacks and destroys an enemy, deal 1 damage to another enemy that shares a Trait with the enemy just destroyed.\".\n\nDoes the hero have to attack and destroy the enemy alone?  Seems like most cards like this say \"If a hero participates in attack that destroys an enemy\".\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3905519","commentId":3905519,"userName":"sappidus","timestamp":1583112074,"content":"No, the hero merely has to be a participant in the attack. This goes all the way back to the Core set (Blade of Gondolin) and is perhaps more commonly encountered these days in the course of using Foe-hammer.\n\nPerhaps the clearest way to see this is to look at Tactics Brand son of Bain's wording along with the FAQ entry [http://www.lotr-lcg-quest-companion.gamersdungeon.net/#Card200] regarding him:\n\n> Quote\n> \n> Response: After Brand son of Bain attacks and defeats an enemy engaged with another player, choose and ready one of that player's characters.\n\n> Quote\n> \n> Q: Can Brand son of Bain (SoM 72) trigger his response if he participates in a ranged attack that defeats an enemy engaged with another player instead of declaring the attack himself ?\n> \n> A: Yes. Declaring an attack and participating in an attack are both subsets of attacking. In both cases Brand attacks and can trigger his response if the enemy is defeated.\n\nThe FAQ lets us know that participating in an attack is a subset of \"attacks\", so unless alone is somehow specified (as on, say, Firefoot), you should be good.\n\nEdited March 2 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3905531","commentId":3905531,"userName":"Vince79","timestamp":1583113238,"content":"> 16 minutes ago, sappidus said:\n> \n> The FAQ lets us know that participating in an attack is a subset of \"attacks\", so unless alone is somehow specified (as on, say, Firefoot), you should be good.\n\nThanks, that was how my gut would say to interpret it.  But if that is true, it seems odd that they say \"participates in an attack\" on other cards.  Why not just say \"attacks\" and save several words?  Plus it seems to muddy the waters."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3905534","commentId":3905534,"userName":"sappidus","timestamp":1583113384,"content":"Much as I love the game, I would say the waters have always been plenty muddy in its wordings and its rules. :) [//content.invisioncic.com/Mfantflight/emoticons/default_smile.png] But that's part of the fun of it for some of us, lol…"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3906063","commentId":3906063,"userName":"Distractionbeast","timestamp":1583181570,"content":"Wasn't there a clarification somewhere that only one character can actually be credited with the \"defeat\" - basically, only one character can have its damage assigned as the killing blow?  I seem to remember this, but I'm not going to look it up right now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3906075","commentId":3906075,"userName":"Vince79","timestamp":1583182296,"content":"> 10 minutes ago, Distractionbeast said:\n> \n> Wasn't there a clarification somewhere that only one character can actually be credited with the \"defeat\" - basically, only one character can have its damage assigned as the killing blow?\n\nI have no problem with that, in fact it kind of makes sense.  Either way, it makes for some muddy waters, because none of this is immediately evident, or clear from a read through from the rules."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3906093","commentId":3906093,"userName":"dalestephenson","timestamp":1583183849,"content":"There's an ancient discussion about the wording here, but no ruling:\n\nhttps://community.fantasyflightgames.com/topic/57800-dwalins-ability/ [https://community.fantasyflightgames.com/topic/57800-dwalins-ability/]\n\nI couldn't find anything about not sharing credit for a kill.  The closest is the parsing-out of damage by attacker for Heavy Stroke:\n\nhttps://community.fantasyflightgames.com/topic/68379-heavy-stroke-help/ [https://community.fantasyflightgames.com/topic/68379-heavy-stroke-help/]\n\nThat thread also wonders what the difference between Dwalin's text and Legolas' text, but there's no relevant ruling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306441-mighty-prowess/?do=findComment&comment=3906914","commentId":3906914,"userName":"sappidus","timestamp":1583290531,"content":"Foe-hammer's trigger condition is \"After a hero you control attacks and destroys an enemy...\". We know that such a hero can be attacking along with other characters and still be eligible for this effect, e.g., the FAQ on Brand son of Bain.\n\nWhat if you have two Foe-hammers in hand, two different heroes (each with a single Weapon), and they team up to attack and destroy an enemy? Can you use both Foe-hammers, one on each hero/weapon? Or is only one of them actually responsible for the \"destroys an enemy\" part of the trigger condition?\n\n\n> Each hero with a weapon attachment that participated in the attack can trigger Foe-hammer.\n> \n> Cheers, Caleb\n\n"}]}