{"url":"https://community.fantasyflightgames.com/topic/306732-multiple-shadow-cards-timing/","title":"Multiple shadow cards - timing","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/306732-multiple-shadow-cards-timing/?do=findComment&comment=3910725","commentId":3910725,"userName":"Boromore","timestamp":1583842816,"content":"My nightmare of a Nightmare Campaign continues. Specifically, in Journey to the Crossroads, I'm being attacked by a Haradrim Archer, who has two shadows cards - Southron Rearguard (Shadow: Return attacking enemy to the staging area) and Ware! Ware! (Shadow: Choose an enemy in the staging area. Engage that enemy and deal it a shadow card). There are currently no enemies in the staging area.\n\nSo, do I have the choice about which shadow to resolve first, as Ware! Ware! doesn't change the game state if picked first? And if I return the Archer to the staging area, then immediately re-engage him (apart from the annoying damage he does on engagement), what do I do about the extra shadow card - reveal it or not, as this is all mid-attack? I'm assuming the Archer still only gets the one attack, but you may disagree...\n\n(Nightmare Campaigbn is bad enough on my morale, without pummelling my brain too!)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306732-multiple-shadow-cards-timing/?do=findComment&comment=3910750","commentId":3910750,"userName":"Wandalf the Gizzard","timestamp":1583845200,"content":"I’m assuming you had some way of looking at each shadow card, because otherwise it wouldn’t matter which came first, you’d just resolve them one at a time.\n\nAnyway, returning an enemy to the staging area mid-attack shouldn’t affect the attack, so the other shadow card will still trigger as normal.\n\nEven if the shadow cards were face up and deciding which one to resolve first would have an affect on gameplay, I’d be surprised if the “you have to chose an option that changes the game state” rule applies to shadow cards.\n\nHope that helps!\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306732-multiple-shadow-cards-timing/?do=findComment&comment=3910768","commentId":3910768,"userName":"sappidus","timestamp":1583846717,"content":"I've seen a couple of threads over the years about this or similar issues, but do not recall an airtight answer. Most people seem to believe the shadow cards should be flipped and resolved one at a time, e.g.,\n\nhttps://boardgamegeek.com/thread/1243469/multiple-shadow-cardseffects [https://boardgamegeek.com/thread/1243469/multiple-shadow-cardseffects]\n \n\nIf anyone can actually find the reference rulings mentioned in those threads (or others like them), let us know.\n\nEdited March 10 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306732-multiple-shadow-cards-timing/?do=findComment&comment=3910936","commentId":3910936,"userName":"rees263","timestamp":1583859942,"content":"I'm genuinely surprised this hasn't been cleared up officially ages ago.\n\nThis (old) post includes a quote from Caleb suggesting that Shadow cards are revealed and resolved one at a time. This is how I've been doing it, going in the order they were dealt, although I appreciate this is not mandated by the rules. If they are face up who knows? I think I'd still stick with my default order.\n\nFor the original question, assuming you decided that the enemy re-engaged from the staging area, I would definitely deal the extra shadow card and resolve it - extra shadow cards occur often enough in other situations, I don't see this as being different in a meaningful way."}]}