{"url":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/","title":"One Deck and Solo League","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3915843","commentId":3915843,"userName":"Vince79","timestamp":1584501112,"content":"Some of this is in response to this thread:\n\nhttps://community.fantasyflightgames.com/topic/306571-solo-league-19-ringmaker-with-dwarrowdelf-cards/ [https://community.fantasyflightgames.com/topic/306571-solo-league-19-ringmaker-with-dwarrowdelf-cards/]\n\nbut I didn't want to derail it.  The relevant part is quoted below:\n\n> Quote\n> \n> 1) To Catch an Orc (VoI)\n> 2) The Dunland Trap (AP #1)\n> 3) The Three Trials (AP #2)\n> \n> Here are the rules:\n> \n> 1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. \n\nThis seems to buy into the idea of building one deck to take on all scenarios.  I know there are only three scenarios picked here, I was wondering why these three were selected?  I've only played the first one.\n\nI recently started playing the Voice of Isengard/Ring-maker cycle.  I put together a Rohan themed deck since that seemed appropriate.  I found one that defeated the first scenario, Fords of Isen.  So far, so good.  But when I tried to use it against To Catch an Orc, it soon became apparent it wasn't going to work.  So I switched to a deck I used for Stone of Erech, and that beat it on the first try.  That deck had no Rohan heroes, but really, if you read the story being told, it isn't necessary for the deck to be Rohan themed.\n\nSo if you are a \"one deck beats all\" kind of guy, I guess at this point you would go back to Fords of Isen and see if the non-Rohan themed deck would work against that, before moving on, because you want one deck to defeat the whole cycle (if not the whole game)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3915865","commentId":3915865,"userName":"General_Grievous","timestamp":1584507260,"content":"Yes if you are going for the solo league the goal is to build a deck that can beat all three scenerios (maybe with some grace of the valar tokens like I needed) technically you should build a deck with one of the required heroes and then play all three scenerios that are listed with the same deck (not every scenerio in the cycle, just those three!), and if you lose, just use the rules variant where you start with a token that you can use to draw another card or gain another resource for each token you have at the start of the game. So eventually even the weakest deck could start with all 50 cards drawn and 50 extra resources if you chose to start with 100 (or technically 93) as an extreme example hahaha.\n\nAs to your question of how those three are chosen, at the end of the month whoever won chooses a cycle, and other placings choose what to play, not play, and supplementary player cards for the next month's cycle. \n\nIts super fun though and I have experimented with some very different deck-building by participating and I encourage you to give it a go!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3915982","commentId":3915982,"userName":"dalestephenson","timestamp":1584541595,"content":"There's two practical reasons I chose to have one deck against all quests:\n\n1) Ease of play -- you only have to construct one deck to play, and you don't have to tweak at all between scenarios.\n\n2) Use in tie-breakers.  By using deck composition as a tiebreaker, I need the contents to be static.\n\nIt's true that sometimes the quests don't align with each other in terms of optimization.  I usually don't pay a great deal of attention the quest specifics before choosing my deck, and as a result frequently finish last -- last month's debacle was an Eagle deck whose non-captured cards were utterly useless for the (typically easy) Escape from Mount Gram.  But whether you try to optimize for the chosen quests or just use the league as an opportunity to play a deck you've been wanting to try is entirely up to you.  With enough help from the Valar, you'll make it through.\n\nOne quest is selected from the chosen cycle by the 2nd place finisher, another is excluded by the 3rd place finisher.  I select the other two by using the random function on a calculator.  The quests chosen determine which heroes form the mandatory list."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3916071","commentId":3916071,"userName":"Vince79","timestamp":1584553197,"content":"> 3 hours ago, dalestephenson said:\n> \n> I usually don't pay a great deal of attention the quest specifics before choosing my deck, and as a result frequently finish last\n\nMy habit has been that I don't even look at a quest before I play it, I always play the first time blind.  I'm beginning to wonder if this is wasting my time though, since sometimes the deck is woefully mismatched to the quest.\n\nThe reason I asked is I'm aware of the school of thought that you should play all quests with just one super deck that can take on any scenario.  I don't really buy into that idea, but it would be easier and more convenient if I had that one super deck.  I'm still progressing through the game though, so it makes sense that my decks would constantly be changing (as the available card pool becomes larger).  I was looking at the solo league and wondering if it was endorsing this \"one deck to rule them all\" idea.\n\nThe other reason it caught my attention is because the quests are from right where I happen to be in the game at the moment, Voice of Isengard/Ring-master cycle.  My pace of play has slowed recently, as I've become distracted with some other games, but I'm trying to keep moving forward at least, slow as it may be."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3916097","commentId":3916097,"userName":"dalestephenson","timestamp":1584557448,"content":"I think even those who pursue a \"One Deck\" that can defeat all quests don't really recommend that players, new or old, *should* play all quests with a super deck.  It's more of an intellectual exercise than a philosophy of play.  I'd be surprised if Seastan played his famous One Deck at all once he had proved that it could do it.\n\nOTOH, especially with one-deck play, I don't think it's unusual to create a general-purpose deck, perhaps with a sideboard, and then use it against a number of quests, perhaps an entire cycle.  The philosophy of play here is that it's more fun to create a deck, then play it against a variety of quests, then to create a deck specifically to address a particular quest (some enjoying that approach too, of course).  But it doesn't have to be a \"super\" deck -- failure is always an option.\n\nLikewise, whether to play a quest blind is also a matter of preference.  Some players prefer the experience of getting surprised by the encounter deck, even if they get smashed like a bug.  Others don't; and will read the cards ahead of time and act accordingly.  There's no right or wrong, but the total surprise can only be experienced once, unless you have no long-term memory.  Either way you'll end up in the same place if you replay a quest enough.\n\nThe league doesn't endorse a power deck to rule all quests, but it does reward defeating all three quests on the first attempt.  In that respect, a power deck with a mandatory hero is a rational approach to winning the league, especially since the quests are known well in advance, and trying your decks against the quests before you make an official run is also allowed.  Players who do this will certainly have a competitive advantage over a player who builds a never-tried deck, doesn't look at the quest, and then charges in right away to be slaughtered.  But dominance against the three quests in a league is absolutely no guarantee that it would dominate *all* quests, even the Vilya decks in the league (and there have been quite a few) don't attempt to have an answer to all quests.\n\nBut if you're that sort of player, why care?  One thing the Grace of the Valar variant does is turn the One Deck on its head -- *all* decks can beat all quests, with enough help from the Valar [insert obligatory caveat about how it's possible to create a deck incapable of beating a particular quest with infinite resources and all the cards drawn -- don't do that].  And at least for me, it is less frustrating to get increasing amounts of help until I win than it is to repeatedly lose until I give up on a deck.\n\nThere's no right or wrong reason or way to play in the league, as long as you follow the minimal restrictions and have fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3916120","commentId":3916120,"userName":"Vince79","timestamp":1584560565,"content":"> 42 minutes ago, dalestephenson said:\n> \n> I think even those who pursue a \"One Deck\" that can defeat all quests don't really recommend that players, new or old, *should* play all quests with a super deck.  It's more of an intellectual exercise than a philosophy of play.\n\nI'm sure that's the case for most.  But I was listening to the Grey Company podcast. and the host was talking about some game reports he had posted.  And he said he was attacked by a lot of posters who told him he had no idea how the game was supposed to be played, because he was supposed to build one deck to defeat all the quests.  That's the first time I had heard of this concept.\n\nI do like to go through an entire cycle with one main themed deck, since each cycle has its theme.  But if it doesn't work, I don't lose any sleep over changing it.  Some quests seem like they are practically begging me to build a specific deck for it.  Besides which, I'm playing progressive style, so as each adventure pack is added, it also adds more to the card pool, so why wouldn't I use them?  Besides, if you use the same deck all the time, how are you supposed to try new cards?  Being forced to try different decks is what has helped me learn about different approaches and styles of play.\n\nI'm still trying to play through all the quests, progressive style.  If I ever finish with that, then I might go back and try to use one deck for more things.  But by that point, I'll have more cards at my disposal too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306975-one-deck-and-solo-league/?do=findComment&comment=3917055","commentId":3917055,"userName":"Rouxxor","timestamp":1584729624,"content":"> On 3/18/2020 at 7:50 PM, dalestephenson said:\n> \n> I think even those who pursue a \"One Deck\" that can defeat all quests don't really recommend that players, new or old, *should* play all quests with a super deck.  It's more of an intellectual exercise than a philosophy of play.  I'd be surprised if Seastan played his famous One Deck at all once he had proved that it could do it.\n\nIt is not really about what \"SHOULD\", since the only things that need to be done is to have fun the way you want. But I do that, always was and will recommend anyone who feel that appealing to do so. To build general decks indented to beat all scenario edited up to the point they are playing (sometime with an exception like Dol Guldur, but most of the time really for all scenarios). Vilya deck are too powerful for some scenarios and so are not the most interesting to play but since there is many decks that can be builded this way I do like to keep playing the game like this."}]}