{"url":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/","title":"Beating City of Ulfast.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3914586","commentId":3914586,"userName":"asgardianphil","timestamp":1584312794,"content":"As usual, I'm really struggling to beat this quest and build a deck to get past even stage 3. All attempts fall short in either resource gen or card draw; I can't quite get them in properly due to focusing on threat reduction and that blasted 9 attack city guard. I feel the -10 engagement cards (treachery and site) come up far too often and are game ending when they turn up. \n\nI've been playing nothing else since this pack came out and have tried it solo and 2 handed solo. I think one handed has the best shot and my last deck was a grey wanderer spirit frodo, the idea was to focus on getting his defense high with signals, arwen, inner strength, hobbit cloak and protector of lorien). I'm questing with strider attachment, songs attachments,  arwen, bilbo, spirit sam, rosie, and 3 northern trackers.  And lots of threat reduction. \n\nHowever it's not that my deck performs badly, it's the quest forms too well too quickly. Sometimes resources go on stage 1 so fast that the game is practically over by turn 2 or 3.  \n\n \n\nSo, who's beat this quest and how did you do it. Please post decks if you can. Any advice is helpful. Cheers. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3914609","commentId":3914609,"userName":"General_Grievous","timestamp":1584314497,"content":"My wife and I beat it together with her running Dale deck and me a Gandalf/Eleanor/Legolas (Tactics) deck. Her amazing Guardian of Esgaroth loaded with attachments was able to take the attacks from the city guard, likewise with Eleanor (or you could sub another Gondorian Noble like Boromir or even Beregond) equipped Ancestral Armor, Gondorian Shield and a Raiment of War and/or Livery of the Tower and Blood of Numenor. So three Hunters or Dale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3914684","commentId":3914684,"userName":"Ywingscum","timestamp":1584327543,"content":"Took me a dozen plays, but got lucky 2handed Dale and Noldor"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3914686","commentId":3914686,"userName":"MikeGracey","timestamp":1584327951,"content":"My brother and I beat it as well. I ran a mono spirit deck with sp Glorifindel, Lothiriel, and Beregond. I had tons of willpower and threat reduction (got 3 outlands swordsmen out quick and played the sp damrod/knight of belfalas combo. My deck could put out at least 3 additional willpower each round.\n\nMy brother had Sp merry and Arwen and was using beorning skinchangers to bring in giant bears for taking down the Guard. It was quite a tough quest for sure. \n\nSome tips are using Thrors key to blank the X threat location if it comes out at a bad time. Also you gotta chump in this quest, and therefore you want shadow cancel (hasty stroke) if that terrible shadow deals 9 damage amonst characters. That will wreck you."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3914755","commentId":3914755,"userName":"Yepesnopes","timestamp":1584350535,"content":"We beat it with two grey wanderer decks. One with Gandalf, the other with Elrond. We were blocking the guard with support of the eagles on gandalf and with ancestral armour + arwen + something else on Elrond.\n\nOn the other hand, cumpbloking the city guard should work fine"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919389","commentId":3919389,"userName":"asgardianphil","timestamp":1585183753,"content":"Start of game. \n\nOpening hand:\n\nSailor of Lune\n\nLight of Valinor\n\nGuardian of Rivendell\n\nSilver Harp \n\nVeteran Sword-Elf\n\nA Test of Will\n\n \n\nI decide to keep this hand- no mulligan\n\nSet up- added Crowded Market to the staging area.\n\nTurn1:  drew elwings flight and imladris caregiver. Discarded the flight. \n\nPlayed silver Harp on cirdan. Used arwen to discard veteran sword elf and give her a resource. Silver harp puts veteran sword elf back into my hand. Played light of valinor on cirdan, grima discounts it. \n\nQuest 9 wp. Draws servant of sauron who engages me. Surge... catacombs 4 threat.\n\n9 wp vs 7 threat. 2 progress on quest. \n\nCombat: cirdan defends shadow (ulchors agent) +1 attack. 1 damage on cirdan. \n\nRefresh\n\nThreat increases by 1- servant of Mordor makes immediate attack. Grima defends... shadow (extra vigil, does nothing). No damage but grima exhausted.\n\n1 resource on the quest.\n\nEnd of turn (threat is 32)\n\n \n\nTurn 2\n\nDraws stand and fight and healing herbs. Discards healing herbs, silver Harp puts it back in my hand. \n\nArwen discards veteran sword elf to gain a resource\n\n(Servant of Mordor has shut down grima discount action)\n\nPlay sailor of Lune for 2 play guardian of Rivendell for 3, discarding healing herbs first then stand and fight.\n\nQuest 9 wp (Cirdain, arwen, sailor)\n\nStage: Cat and Mouse side quest (city guard now engagement 30)\n\n9wp vs 8 threat -1 progress on quest (total 3 of 5)\n\nTravel to crowded market. Travel effect 'adds'  messenger from Mordor to the staging area. (Reveal effect doesn't trigger)\n\nCity guards engagement is now 50\n\nCombat. guardian of Rivendell defends shadow (servant of mordor) has no effect.\n\nCirdan attacks- 1 damage on servant of Mordor\n\nRefresh: threat 33 servant makes an immediate attack, guardian of Rivendell defends. Shadow (side street) no effect\n\n1 resource on quest. City guard now engagement 45\n\n \n\nTurn 3\n\nDraws lembas and the Galadhrims greeting. Discard lembas but silver Harp saves it.\n\nPlays lembas on Cirdain  grima pays for it. He has no resources left now. \n\n(Saving the greeting till the end of questing in case I need test of will paying for. )\n\nQuesting all in for 11 ( except guardian who is already exhausted)\n\nStages ulchors agent (3 threat and reveal effect to raise my threat by 3 to 36)\n\nPlays a test of will to cancel the threat increase when revealed effect\n\n12 threat vs 11 wp. Threat increases by 1 to 34. Servant of sauron makes an immediate attack. \n\nCirdan defends. Shadow (we've been seen) gives +1. Cirdain takes 1 damage.\n\nDiscards lembas to fully heal and ready Cirdain.\n\nArwen discards imladris caregiver to gain a resource (harp already exhausted so no save)\n\nPlays Galadhrims greeting. Threat now 28. Also no cards left in hand)\n\nCombat: Cirdain defends . Shadow (extra vigil) does nothing. No damage. \n\nRefresh. Threat 29 servant makes an immediate attack.  Guardian of Rivendell defends. Shadow (catacombs) does nothing.\n\n1 resource added to stage 1 (3 now) city guard engagement is 40\n\nTurn 4\n\nEach hero now has 1 resource each.\n\nDraws elronds council and elven jeweler.  Discards jeweler but silver Harp saves. \n\nPlays elven jeweler. \n\n[At this point I'm feeling grima is locked out, I'm not drawing enough cards, arwen isn't getting used as the harp is saving the card from cirdain and I need more resources and will power for questing.  ]\n\nSaving the jeweler as chump I quest all in again without guardian for 11wp. (Greeting is on top of discard) and playing council to add 1 wp and reduce threat to 26\n\nStages guarded archway 2 threat (if engaged with city guard threat cannot be reduced)\n\n12 quest vs 15 threat (game over? Quest will spiral out of control now). \n\nThreat increases to 29, servant of Mordor makes an immediate attack. Cirdain defends. Shadow (crowded market) no effect\n\nCant engage either of the two staged enemies as they have attack 3 and 4 so will auto kill a hero. [Unless I risk ulchors agent not to get a +1 shadow and go undefended against cirdan. However, With servant attacking three times a round I can't risk it]\n\nCombat: elven jeweler chumps servant of Mordor. Shadow (patrolling the streets) gives +1 for each resource on main quest- so +3 then. 5 damage to poor jeweler. She's destroyed.\n\nRefresh: threat increases to 30. Servant makes an immediate attack. Guardian of Rivendell defends. Shadow (under guard) has no effect in this instance. \n\n1 resource on stage 1 (now 4) makes city guard 5 threat and 35 engagement.\n\nTurn 5\n\nDraws sailor of Lune and guardian of Rivendell (which I cant play as have no other cards in my hand) discards guardian but have to save it with Harp to keep an event on top of the discard) plays sailor.\n\nQuest all in for 13 wp.\n\nStages patrolling the streets (places 1 resource on stage 1 making 5 there now. I choose the restriction on putting progress on the quest as that ain't happening anyway)\n\n13 quest vs 17 threat. Threat goes up 4 and servant makes an immediate attack. cirdain defends. Shadow (messenger from mordor) +1 attack. Cirdain takes 1 damage \n\nEngagement. \n\nMessenger from Mordor, ulchors agent and city guard all engage \n\n \n\nScoop.\n\nAll heroes exhausted, 1 card in my hand (guardian of Rivendell) only 2 resources left (lore) only 3 progress of 5 made on stage 1 and threat 34. facing 4 undefended attacks (3; 2; 4; 9)\n\n \n * \n *  \n * Quote [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#]\n *  \n * Edit [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/?do=editComment&comment=3919265]\n\n\n\n\nALONEWOLF87 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/]     121 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/reputation/]\n\nhttps://community.fantasyflightgames.com/profile/329691-alonewolf87/\n *  \n *  \n *  \n\nPosted 4 hours ago [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/?do=findComment&comment=3919278]\n>   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> \n> Draws stand and fight and healing herbs. Discards healing herbs, silver Harp puts it back in my hand. \n> \n> Arwen discards veteran sword elf to gain a resource\n> \n> (Servant of Mordor has shut down grima discount action)\n> \n> Play sailor of Lune for 2 play guardian of Rivendell for 3, discarding healing herbs first then stand and fight.\n\nHere I would have discarded the Healing Herbs in the Resource Phase and used the Harp to keep Stand and Fight in the Planning Phase for next turn.\n\n>   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> \n> Scoop.\n> \n> All heroes exhausted, 1 card in my hand (guardian of Rivendell) only 2 resources left (lore) only 3 progress of 5 made on stage 1 and threat 34. facing 4 undefended attacks (3; 2; 4; 9)\n\nNot surprised (Grima is a really bad fit for this quest), but perhaps you could have risked it a bit more with some undefended attack from the Servant to kill it.\n\n>   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> \n> (Reveal effect doesn't trigger)\n\nWhy not? No active location so you needed to chose the immediate attack option.\n\nAnyway I think we are going quite off-topic. Do you want to split the topic or continue this somewhere else?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919399","commentId":3919399,"userName":"asgardianphil","timestamp":1585185813,"content":"> 22 minutes ago, asgardianphil said:\n> \n> Alonewolf87 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/]     1 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/reputation/]\n> \n> Posted 4 hours ago [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/?do=findComment&comment=3919278]\n> >   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> > \n> > Draws stand and fight and healing herbs. Discards healing herbs, silver Harp puts it back in my hand. \n> > \n> > Arwen discards veteran sword elf to gain a resource\n> > \n> > (Servant of Mordor has shut down grima discount action)\n> > \n> > Play sailor of Lune for 2 play guardian of Rivendell for 3, discarding healing herbs first then stand and fight.\n> \n> Here I would have discarded the Healing Herbs in the Resource Phase and used the Harp to keep Stand and Fight in the Planning Phase for next turn.\n> \n> >   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> > \n> > Scoop.\n> > \n> > All heroes exhausted, 1 card in my hand (guardian of Rivendell) only 2 resources left (lore) only 3 progress of 5 made on stage 1 and threat 34. facing 4 undefended attacks (3; 2; 4; 9)\n> \n> Not surprised (Grima is a really bad fit for this quest), but perhaps you could have risked it a bit more with some undefended attack from the Servant to kill it.\n> \n> >   [https://community.fantasyflightgames.com/topic/307005-things-that-couldve-been-better/page/4/#] 4 hours ago, asgardianphil [https://community.fantasyflightgames.com/?app=core&module=members&controller=profile&id=319785] said:\n> > \n> > (Reveal effect doesn't trigger)\n> \n> Why not? No active location so you needed to chose the immediate attack opt\n> \n> Anyway I think we are going quite off-topic. Do you want to split the topic or continue this somewhere else?\n\nOk so I'll try and tackle your points. The first one regarding stand and fight. I really wanted to discard veteran sword elf and then get her into play with stand and fight and I knew I wanted to keep an event on top of the discard pile to give sailor of Lune +1 quest. I looked at veteran and though that she works best when other copies are in the discard, sure I could chump with her but it was going to cost me 3 spirit resources and I needed them to get a quester out as grima was exhausted at the start of the round due to servant of Mordor attacking me in the refresh phase. Sailor really needed that event on top to make up for the missing grima 2 quest points. At this point I also had test of will in my hand and wanted a resource for it as this quest has some nasty treacheries that lower the engagement cost of city guard by 10. So I needed 1 extra resource. \n\n \n\nPoint 2. Yep I think some undefended attacks may have been doable, however servant of Mordor was attack 2 and if he got a shadow card attack booster then I'd have lost a hero. Imladris caregiver was in my hand but like the other Noldor effects he discards cards to heal, but I was running out of cards fast. Cirdan makes you discard a card, arwen needs to to discard a card. Getting Guardian of Rivendell out needs 2 discarded cards, I had too many effects that needed cards discarding and not enough cards. This enemy is nasty in that potentially he'd be attacking me in the planning phase for using Grima, then the quest phase if I quested unsuccessfully, the combat phase as normal and the refresh phase for end of turn threat. So taking him undefended was a risk. \n\n \n\nLast point (reveal effect doesnt trigger) when I drew messenger from Mordor as travel effect you are right the location hasn't yet made it to be the active location, however you don't perform when revealed effects when taking a card from the discard pile and add it to the staging area. Which is what the travel effect tells you to do. 'Discard cards from the top until an enemy is discarded. Add that enemy to the staging area'\n\n \n\nSo, I did enjoy the challenge of playing your deck. And at first thought it was going well. But as with all my games against this quest, the quest quickly shuts you down and punishes you for your decks weakness, be it lack of card draw, or resource gen, or questing or chomping even (there's a few shadow effects that really penalise against chumping) I find this quest happens to find the one card to really hurt you. In this play through it was sevant of Mordor on turn 1. \n\nI'll give it another go and make some of the changes you suggest regarding Grima. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919408","commentId":3919408,"userName":"asgardianphil","timestamp":1585186418,"content":"I was thinking of travelling to the catacombs on turn 1 but it has the potential to pull out an enemy and engage it with me, so bottled it having no allies and servant of Mordor out. I also thought about taking servants attack undefended so cirdain could attack it but it would take 3 turns to kill it doing that and it would then have 3 undefended attacks at 2 or 3+ strength almost certainly killing off a  couple of heroes. \n\n \n\n**** servant of Mordor 😈\n\n \n\n \n\nAnother turning point would have been a mulligan for some other cards. However this was my first run with this deck so I guessed I had a pretty good hand getting light of valinor and a test of will and the silver Harp. \n\nOnly you will be able to tell me if i should have mulliganed  "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919459","commentId":3919459,"userName":"Alonewolf87","timestamp":1585205321,"content":"> 5 hours ago, asgardianphil said:\n> \n> Point 2. Yep I think some undefended attacks may have been doable, however servant of Mordor was attack 2 and if he got a shadow card attack booster then I'd have lost a hero.\n\nDefinitely true, but the early game is all about taking some risks to get in a good position I think. Also the Lembas could have helped later on with the damage.\n\nBut Servant of Mordor is definitely a **** enemy...\n\n> 5 hours ago, asgardianphil said:\n> \n> Last point (reveal effect doesnt trigger) when I drew messenger from Mordor as travel effect you are right the location hasn't yet made it to be the active location, however you don't perform when revealed effects when taking a card from the discard pile and add it to the staging area. Which is what the travel effect tells you to do. 'Discard cards from the top until an enemy is discarded. Add that enemy to the staging area'\n\nI made a mistake here then, thought the enemy was \"revealed\", not \"added\".\n\n> 5 hours ago, asgardianphil said:\n> \n> Another turning point would have been a mulligan for some other cards. However this was my first run with this deck so I guessed I had a pretty good hand getting light of valinor and a test of will and the silver Harp. \n> \n> Only you will be able to tell me if i should have mulliganed  \n\nWell I have only played it a few times (and never against City of Ulfast) so I am not sure which cards would be key to mulligan for.\n\nBTW do you want me to share my Arwen/Elladan/Elrohir Three Hunters deck? That might be a better fit for this quest.\n\nEdited March 26 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919463","commentId":3919463,"userName":"asgardianphil","timestamp":1585207347,"content":"> 32 minutes ago, Alonewolf87 said:\n> \n> BTW do you want me to share my Arwen/Elladan/Elrohir Three Hunters deck? That might be a better fit for this quest.\n\nOh yes!.\n\nYes please mate. Cheers. I have 3 cores and all packs so can build any deck. \n\nOne day I will get past this guard and get into ulfast 🤣"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919467","commentId":3919467,"userName":"Alonewolf87","timestamp":1585207900,"content":"You can find it here\n\nhttps://ringsdb.com/fellowship/view/8296 [https://ringsdb.com/fellowship/view/8296]\n\nThough you might want to make some small changes (out Warden of Arnor, Rivendell Bow and Blade of Gondolin, in Celebrian's Stone and 1 more War Axe and Steed of the North)\n\nIf you want I can also take a swing with some of my decks against it in the next few days (COVID-19 gifted me with a lot of free time) and give you some feedback.\n\nEdited March 26 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919599","commentId":3919599,"userName":"asgardianphil","timestamp":1585241532,"content":"Thanks for the link. I'll give it a try with your amendments. \n\nPlease feel free to have a bash ( though I realise you have your hands full with the Havens at the mo 😉)\n\nI'm a key worker so I'm in work and doing weekend overtime too. Though some of my gaming buddies have gone off self isolating and enjoying the down time. Our weekly game night is now playing the division 2 together on the xbox 1. \n\nI'm also spending time playing through Dunwich Legacy cycle with my daughter. Just about to do blood on the altar tonight. \n\nStay safe and happy gaming buddy. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3919612","commentId":3919612,"userName":"Alonewolf87","timestamp":1585243503,"content":"> 30 minutes ago, asgardianphil said:\n> \n> Please feel free to have a bash ( though I realise you have your hands full with the Havens at the mo 😉)\n\nI might squeeze in a try tomorrow, for a change of pace.\n\n> 30 minutes ago, asgardianphil said:\n> \n> 'm a key worker so I'm in work and doing weekend overtime too.\n\nI am actually working here in Italy on an epidemiologic research on the COVID-19, but since I have now to work from home my meal breaks are much more efficient and I have more free evenings.\n\n> 32 minutes ago, asgardianphil said:\n> \n> I'm also spending time playing through Dunwich Legacy cycle with my daughter. Just about to do blood on the altar tonight. \n> \n> Stay safe and happy gaming buddy. \n\nSo cool, I hope one day to have children of my own to play these games with.\n\nYou too, stay safe"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920025","commentId":3920025,"userName":"asgardianphil","timestamp":1585273227,"content":"> 8 hours ago, Alonewolf87 said:\n> \n> I am actually working here in Italy on an epidemiologic research on the COVID-19,\n\nThis is really awesome. I'm glad to have bumped into you on the forums. 🤝\n\nok, so I tried the same deck again tonight. (After my Arkham game.)\n\nbefore taking apart a deck I usually give it a couple of goes so I've simply switched out Grima for Beravor \nKeys of Othanc and elf stone for ×2 unexpected courages \n\nSet up:\nDrew: elven jeweler, a test of will, sailor of Lune ×2, elwings flight and guardian of Rivendell. \nMulligan: imladris caregiver, elven jeweler, elven-light, the evening star and stand and fight ×2. \nPlace crowded market in staging area.\n\n\nTurn 1\nDraws veteran sword elf and the evening star. Discard veteran sword elf.\nBeravor exhausts to draw elven light and the galhadrims greeting.\nArwen discards elven light to gain a resource\nPlanning: Plays stand and fight for 3 to put veteran sword elf into play from discard pile.\nQuest: 7 WP. (Cirdain, arwen).  Stages Crowded Market. 5 threat. 2 progress on stage 1\nNo travelling\nRefresh: threat 32 and adds 1 resource to stage 1. City guard engagement is 40 and threat 2.\n\nTurn 2\nDraws veteran sword elf and sailor of Lune. Discards sword elf. \nExhausts Beravor to draw 2 cards. (Elronds council and imladris caregiver)\nArwen discards elven light to gain a resource. \nPlays sailor of Lune . Plays the evening star putting 2 progress on one of the 2 crowded markets.\nPlays elven light from discard pile and draws silver Harp. (Really happy)\nQuest: 9 wp (cirdain, arwen and sailor (event on top)) plays elronds council (+1 wp to arwen) making 10 WP and reducing threat to 29. (EC Event on top of discard pile). Stages side street (3 threat and prevents progress on locations in the staging area) total 7 threat. 3 progress on stage 1 advancing to stage 2. Choose to raise threat by 5 option. Threat dial now 34 and city guard back up to 45 engagement. \nTravel to side street. Travel effect adds street of ulfast to the staging area. \nRefresh: threat increases to 35. Add 1 resource to stage 2 (city guard now engagement 40 and threat 2)\n\nTurn 3\nDraws the galhadrims greetings and elwings flight. Discards elwings flight. \nBeravor exhausts to draw light of valinor and lembas.\nArwen discards elven light to gain a resource \nPlays silver Harp, light of valinor and lembas on cirdain\nQuest: 9  (cirdain, arwen and sailor). Stages patrolling the streets treachery. Places 1 resource on stage 2 (total 2). I choose the option to not place progress on the current quest. So 9 wp vs 8 threat. 1 progress on side street Active location.\nRefresh. Threat now 36 and add 1 resource to stage 2. (Total 3). City guard now threat 4 and engagement 30. Streets of ulfast threat 4 also.\n\nTurn 4\nDraws steed of imladris and guardian of Rivendell. Discards guardian of Rivendell but harp saves him\nPlays steed of imladris on arwen. \nPlay elven light (from bottom of discard pile leaving the other elven light on top) draws elven jeweler. \nQuest for 11 (cirdain, arwen, beravor and sailor of Lune) steed of imladris discards elven light to put 2 progress on active side street exploring it fully. Stages ulchors agent who raises my threat to 39. Makes 13 threat in staging area. Raise my threat to 41. \nTravels to crowded market adding messenger from Mordor to staging area. Doesnt trigger  the when revealed effect due to being added rather than revealed. \nCity guard engagement is now 50. \nEngagement: both messenger from Mordor and ulchors agent engage.  \nPlay elven jeweler by discarding imladris caregiver ×2. \nDeals shadow cards\nCirdain defends messenger (shadow is ulfast senrty- no effect). 2 damage on cirdain. Discards lembas to ready and heal. \nElven jeweler chumps ulchors agent (shadow is patrolling the streets +3 at this time for 6 attack). Jewler is destroyed. \nCirdain and veteran sword elf attack messenger of Mordor for 4 attack and he takes 2 damage\nRefresh. Threat 42 and add 1 resource to stage 2 (total 4. Makes city guard 45 engagement and 5 threat. Streets of ulfast now 5 threat. \n\n\nTurn 5\nDraws light of valinor and narya. Discards light of valinor\n[At this point I’m not really sure what to do. I have too many cards I need to play and not enough resources or cards for discard effects. If I use beravor it reduces quest or attack, if I clear the active location I have the city card attacking me with at least two other enemies, threat in the staging area is spiralling and I have no progress on stage 2. \nIn my hand is narya, stand and fight, x2 Galadhrims greeting,  elven jewler, the evening star and guardian of Rivendell]\n\nPlays Narya on cirdain using beravors resources. \nExhaust beravor to draw 2 cards Glorfindel and a test of will. \nArwen discards Glorfindel to gain a resource. \nPlays stand and fight to pull veteran sword elf from discard pile to table  \nQuest 9 (cirdain, arwen and sailor of lune) steed of imladris discards the evening star to place 2 progress on crowded market exploring it. Silver Harp saves it. Stages ulfast sentry 2 threat making 12 in total.\nThreat increases to 45. \nCant now travel to streets of ulfast as it will raise my threat to 50.\nEngagement: ulfast sentry and city guard engage me. Ulfast sentry adds 1 resource to stage 2 (total 5- city guard now threat 6 and engagement cost 20)\nShadow cards dealt\nPlays elven jewler by discarding Galadhrims greeting and the evening star. \nElven jewler defends city guard (shadow side street, no effect. Jewler is destroyed.\nSword elf defends ulfast sentry 6 attack ( shadow under guard- resolve travel effect of active location. There isn’t one) veteran destroyed.\nVeteran #2 defends ulchors agent (shadow wave been seen- +1 attack with splash assigned to other characters) 4 attack vs 2 def. 2 damage on veteran. \nExhaust narya and cirdain to ready veteran se and sailor ol. \nSailor ol defends messenger from Mordor. (Shadow servant of Mordor- no effect. Sailor destroyed  \nVeteran sword e attacks messenger of Mordor for 3 putting 1 damage on him (total 3)\nRefresh: threat now 46. Adds 1 resource to stage two (total 6)\n\nTurn 6 scooped as a lost cause. 4 attacks next turn against 4 characters. And its 1:10 am 😴\n\nGreat game but again resource gen hurt me. I feel I could have got further with more resources. \nEven without a turn 1 servant of Mordor showing up it’s the resources going on the stages that make this quest so difficult. If you bring a questing deck it smacks you in combat and if you bring a combat deck you get location lock and if you try both you get freight trained 🚂"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920145","commentId":3920145,"userName":"Alonewolf87","timestamp":1585300299,"content":"> 7 hours ago, asgardianphil said:\n> \n> Great game but again resource gen hurt me. I feel I could have got further with more resources. \n\nYeah it's definitely not up to the challenge. If you want we can rework it from the ground up making it an Arwen, Cirdan, Erestor deck and going the full discard strategy route.\n\n \n\n> 7 hours ago, asgardianphil said:\n> \n> Even without a turn 1 servant of Mordor showing up it’s the resources going on the stages that make this quest so difficult. If you bring a questing deck it smacks you in combat and if you bring a combat deck you get location lock and if you try both you get freight trained 🚂\n\nA possibility could be going for a full Gondor Swarm (LeBoromir, Denethor and Erestor as heroes) and use Visionary Leadership and LeBoromir to cover both questing and attacking. It's quite the effective deck usually."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920194","commentId":3920194,"userName":"Alonewolf87","timestamp":1585307497,"content":"After a very quick defeat in my first run (City Guard engaged in the 2nd round while Elrohir was not fully setup and almost killed it, I decided to scoop up there) I was able to win the second run with my Three Hunters deck. I realized though that it's not really optimized for this quest so I made some small modifications to it (that you can find here https://ringsdb.com/decklist/view/15136/forththechildrenofcelebrianinulfast-1.0 [https://ringsdb.com/decklist/view/15136/forththechildrenofcelebrianinulfast-1.0])\n\nIf you are interested I kept a playthrough of the game."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920595","commentId":3920595,"userName":"asgardianphil","timestamp":1585344939,"content":"Yes please I would be interested in seeing your play though.\n\n \n\nI'm about to start building your three hunters decks now. I'll give it a go straight after. 👍"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920607","commentId":3920607,"userName":"Alonewolf87","timestamp":1585345869,"content":"Should I post here or send you the Word file?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920687","commentId":3920687,"userName":"Valhalla Gaming","timestamp":1585353851,"content":"I very much enjoyed this quest, it was certainly tough but didn't feel oppressive, and the rules/goal of the quest essentially stay the same throughout until needing to actually kill the city guard. \n\nChump blockers are pretty ideal for this encounter so I found outlander to be a good match. In a two player attempt, I had a friend use tactics Eowyn which was pretty ideal for sinking through a good bit of damage. A lot of the quest is a matter of deciding exactly when is best to advance to the next stage, which locations to tackle when etc."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920722","commentId":3920722,"userName":"asgardianphil","timestamp":1585359045,"content":"City of Ulfast.\n\nThree Hunters Set up: Draws Gondorian Shield, Elven-Light, Round Shield, Dunedain Remedy, Elronds Council and Silver Harp Keeps hand. Searches player deck and takes the one ring and plays it on Elrohir. Searches deck and puts inner strength into hand. Searches encounter deck for streets of ulfast and adds it to the staging area.\n\n \n\nTurn 1\n\nDraws dunedain warning Arwen discards elven light to gain a resource.\n\nPlanning: plays a discounted silver Harp on arwen, gondorian shield, dunedain warning and round shield on elrohir. Arwen pays for elven light to draw another elven light.\n\nQuest: with arwen, elladan and elrohir. Plays elronds council on arwen. Threat reduces to 26. Stages side street. 8WP vs 5 threat. makes 3 progress on stage 1.\n\nTravel to streets of ulfast. Raises threat to 27.\n\nRefresh. Threat increases to 28. Adds 1 resource to stage 1\n\n \n\nTurn 2\n\nDraws open the armory. Arwen discards elven light to gain 1 resource. Arwen pays 1 resource to play elven light from discard and draws Rohan warhorse.\n\nPlanning: plays warhorse for free on elladan. Plays inner strength on elrohir. Quest: all in for 7 wp. Stages the kings lawn. 8 threat. Raises threat by 1\n\nRefresh: raises threat by 2 to 31. Add 1 resource to stage 1. (2 total)\n\n \n\nTurn 3\n\ndraws dagger of westerners. Discards elven light so arwen gains a resource.\n\nPlanning. Arwen plays for open the armoury. ( only two targets- war axe and Rivendell blade.) Takes Rivendell blade. Plays Rivendell blade for free on elladan and pays to play daggers on arwen. Three hunters now flips to side b. Arwen plays elven light from discard and draws light of valinor.\n\nQuest: arwen, elrohir and elladan for 14 wp. Stages under guard- resolve travel effect of active location (streets of ulfast) Threat increases by 3 to 34. 14 vs 9 threat. Makes 5 progress on active location which explores the 5 quest points.\n\nTravel: [cant travel to kings lawn as it would place 1 resource on stage 1 and city guard would engage me with no ready defenders]. So travel to side street. Which adds guarded archway to staging area.\n\nRefresh: threat increases by 2 to 36. Adds 1 resource to stage 1. (Total 3)\n\n \n\nTurn 4\n\nDraws unexpected courage. Discard elven light to add a resource to arwen.\n\nPlanning: plays light of valinor on elrohir. Plays elven light from discard drawing dagger of westernesse. Plays dagger on elladan.\n\nQuest: arwen, elladan and elrohir for 15 wp. Stages patrolling the streets- places 1 resource on stage 1 (total 4) and chooses option to not allow progress on main quest. So 15 vs 10 threat. Clears 3 quest point active location. Travels to kings lawn. Places 1 resource on stage 1( total 5). City guard has engagement cost 20 now.\n\nCombat. Deals shadow to city guard. Elrohir defends for 6 (shadow is ulchors secret with shadow effect triggers +1 attack. Response exhaust round shield +2 def. Response inner strength- exhausts one ring, raises threat to 37 and cancels shadow effect.) 9 att vs 8 def. Elrohir takes 1 damage.\n\nRefresh. Raises threat to 38. Adds 1 resource to stage 1 (total 6).\n\n \n\nTurn 5\n\nDraws Galadhrims greetings. Discards elven light to gain 1 resource on arwen.\n\nPlanning: plays dunedain remedy on elrohir to heal 1 damage. Plays unexpected courage on elladan.\n\nQuest: arwen, elladan and elrohir for 15 wp. Stages messenger from Mordor. (I choose the immediate attack option. Deals shadow. Elrohir defends and spends 1 resource to ready. Shadow is messenger from Mordor +1 attack. Def 6 blocks it. So 15 wp vs 11 threat. Makes 4 progress on kings lawn.\n\nEngagement. Messenger of mordor and city guard engages. Deals each a shadow card. Elrohir defends messenger from Mordor and spends 1 resource to ready. Shadow is ulfast sentry- no effect. 6 def blocks 4 att. Elrohir defends city guard. No ready this time. (He does have 2 resources left). Shadow is crowded market so no shadow effect. 6 def vs 9 att means 3 damage on elrohir. Readies elladan with unexpected courage. Elladan attacks messenger from Mordor , reduces his def by 2 and his attack is 4 killing messenger. Warhorse could ready him but Rivendell blade is useless against city guard. So his 4 attack wouldn’t get through.\n\nRefresh: threat now 39. Adds 1 resource to stage 1 ( total 7)\n\n \n\nTurn 6\n\nDraws open the armory. Discards elven light to put a resource on arwen. Spend 1 resource from elrohir and elladan to pass remedy between them and heal 1 damage fro. Elrohir. And then again to heal 1 more damage (4 resources in total)\n\nQuest all in for 15 wp. Stages patrolling the streets- adds 1 resource to stage 1 (total 8. ) then chooses the no progress on main quest option (the other option would threat me out). So 15 wp vs 11 threat. Makes 4 progress on active location exploring it and 3 progress go to waste.\n\nNot travelling to guarded archway as it would give city guard a free attack.\n\nCombat. Deals shadow to city guard. Use dunedain remedy again between the brothers to heal last damage from elrohir. They now have no resources left. Elrohir defends. Shadow is streets of ulfast, shadow effect returns city guard to staging. Exhausts round shield in response. 8 def vs 9 att. 1 damage on elrohir.\n\nRefresh. Threat increases to 40. Adds 1 resource on stage one (total 9)\n\n \n\nTurn 7\n\nDraws a test of will. Discards it to gain a resource on arwen. Harp saves it.\n\nPlanning: spend 1 from elladan to play valour action on open the armory. Only 1 target card, elven mail which goes on arwen. Plays Galadhrims greeting to lower threat to 34.\n\nQuesting all in for 16 wp stages the kings lawn. So 16 vs 15 makes 1 progress on stage 1 (total 4)\n\nTravels to kings lawn placing 1 resource on stage 1 (10 total)\n\nCombat. City guard attacks. Deals shadow. Elrohir moves remedy to arwen and back to heal 1 damage. Each spending a resource. Elrohir defends shadow is servant of Mordor giving +1 attack exhausts round shield and one ring and raises threat to 35 to cancel it with inner strength. Elrohir takes 1 damage.\n\nRefresh: threat increases to 36 adds 1 resource to stage 1( total 11)\n\n \n\nAt this point I cant win. Next card is elronds council , I have a test of will in my hand. Next encounter card is a 3 threat the kings elite. My questing would be 17 with 17 in staging. Active location has 5 quest points .\n\nScooped.\n\nGreat game. I thought I was going to win when I got unexpected courage out and with light of valinor too. But the resources going onto the quest are too fast. There's too many effects that add them from other cards. \n\nEdited March 28 by asgardianphil\nFormatting"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920728","commentId":3920728,"userName":"asgardianphil","timestamp":1585359975,"content":"> 3 hours ago, Alonewolf87 said:\n> \n> Should I post here or send you the Word file?\n\nPost here please. Cheers. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920839","commentId":3920839,"userName":"Preotet","timestamp":1585384889,"content":"> 7 hours ago, asgardianphil said:\n> \n> Turn 3\n> \n> draws dagger of westerners. Discards elven light so arwen gains a resource.\n> \n> Planning. Arwen plays for open the armoury. ( only two targets- war axe and Rivendell blade.) Takes Rivendell blade. Plays Rivendell blade for free on elladan and pays to play daggers on arwen. Three hunters now flips to side b. Arwen plays elven light from discard and draws light of valinor.\n\nYou flip the contract in the Refresh Phase."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920841","commentId":3920841,"userName":"Alonewolf87","timestamp":1585385216,"content":"> 6 hours ago, asgardianphil said:\n> \n> Post here please. Cheers. \n\nIf you spot any mistakes let me know\n\nGeneral indications: shadow cards are explicited only when they affect the game, I don't keep track of cards in the decks or the resources on the heroes\n\nCity of Ulfast\n\nLucky moments: good starting hand, good shadow cards\n\nUnlucky moments: lots of threat increase\n\n \n\nSetup: The One Ring on Elrohir, Inner Strenght pulled from the deck; Side Street as location in the staging area\n\nOpening Hand (after mulligan) Silver Harp, Steed of the North, Round Shield, War Axe, Elven Mail, Open the Armory\n\n \n\nTurn 1\n\nDraw: Golden Belt\nPlanning Phase: play Silver Harp (with discount) on Arwen; exhaust Harp to get back resource; play Inner Strength on Elrohir; play Steed of the North (with discount) on Elrohir; play War Axe (with discount) on Elladan (since I could not get to 2 restricted on 1st turn I decide to keep Elladan and Elrohir's resources for future needs)\nQuest Phase: everyone to the quest; reveal Overwhelmed (30 threat, no effect); 3 progress\nTravel Phase: travel to Side Street; discard until I get another Side Street (!) to add to the staging area\nEngagement and Combat phase: nothing\nEnd of Round: 1 resource on quest\n\nTurn 2\n\nDraw: Elven-Light\nPlanning Phase: play Open the Armory with 1 Spirit Resource, get Rivendell Blade; play Rivendell Blade on Elladan (with discount); play Elven Mail (with discount) on Elrohir; discard Elven-Light to get 1 resource on Arwen; play Elven-Light from discard pile, draw Steed of Imladris; play Steed of Imladris on Arwen (with discount); play Golden Belt and Round Shield on Elrohir\nQuest Phase: everyone to the quest; discard Elven-Light on Steed (2 progress on active location); reveal Ulfast Sentry; no progress\nTravel Phase: nothing\nEngagement phase: engage Ulfast Sentry (immediate attack, undefended, +1 attack, 3 damage on Elladan; ready Elrohir with Steed of the the North)\nCombat phase: defend Sentry with Elrohir (no shadow, no damage)\nRefresh Phase: flip contract\nEnd of round: 1 resource on quest (2 total)\n\nTurn 3\n\nDraw: Foe-Hammer\nPlanning Phase: play Elven-Light from discard pile, draw Dunedain Warning; play Warning on Elrohir\nQuest Phase: send Elrohir and Arwen to the quest (10 Willpower); discard Elven-Light on Steed and clear active location; reveal Servant of Sauron (which engages me, I ready Elrohir) which surges into We Have Been Seen (33 threat, servant attacks, undefended (2 damage on Elrohir); 4 progress, clear the current quest, advancing I decide to reveal 1 encounter card, The King's Lawm\nTravel Phase: travel to The King's Lawn (1 resource on quest)\nEngagement phase: nothing\nCombat phase: Elrohir defends Sentry (spend 1 resource to ready again, no damage); Elrohir defend Servant (no damage); Elladan spend 1 resource to kill both Servant and Sentry; use Foe-Hammer (draw Elrond's Counsel, Unexpected Courage, Elven-Mail) exhaust contract to heal 1 damage from Elladan and Elrohir; exhaust Harp to get 1 resource on Arwen\nEnd of round: 1 resource on quest (2 total)\n\nTurn 4\n\nDraw: Miruvor\nPlanning Phase: play Elven-Light from discard pile, draw Celebrian's Stone; discard Elven-Light to get back resource on Arwen; play Unexpected Courage on Elrohir; play Celebrian's Stone on Arwen\nQuest Phase: send Arwen and Elrohir to the quest (13 Willpower); exhaust Harp on Steed to put 2 progress on active location, ready Elrohir with Courage; reveal Extra Vigil and attach it to City Guard; play Elrond's Counsel (31 threat); 8 progress, 3 to clear active location, 5 on current quest\nTravel Phase: travel to Side Street, discard until I got a The King's Lawn (again!) and add it to the staging area\nEngagement phase: nothing (City Guard is merely “considered to be engaged”)\nCombat phase: Elrohir defends City Guard (shadow effect triggered. I activate Round Shield, 2 damage on Elrohir); exhaust contract to heal 1 damage from Elladan and Elrohir; Elladan attacks City Guard (1 damage, I raise my threat by 1 to 32 to discard Extra Vigil\nRefresh Phase: 1 extra threat from The King's Lawn (34 Threat)\nEnd of round: 1 resource on quest (3 total)\n\nTurn 5\n\nDraw: Light of Valinor\nPlanning Phase: play Light of Valinor on Elladan; exhaust Harp to get 1 resource on Arwen; play Elven-Light from discard pile, draw Open the Armory; spend 1 Tactics resource on Open the Armory, draw Ancestral Armor\nQuest Phase: everyone to the quest (17 Willpower, Elladan does not exhaust), discard Elven-Light on Steed to put 2 progress on active location; exhaust Unexpected Courage to ready Elrohir; reveal Messenger from Mordor (immediate attack, shadow effect for +3 attack, I trigger Round Shield, no damage); 8 progress, 1 to clear the active location, the rest clear the active quest; after advancing I raise my threat by 5 (to 39 Threat) since Elrohir is exhausted\nTravel Phase: travel to The King's Lawn (1 resource on the quest)\nEngagement phase: engage Messenger from Mordor, ready Elrohir with Steed of the North\nCombat phase: Elrohir defends Messenger (no damage); Elladan kills Messenger; exhaust contract to heal 1 damage from Elladan and Elrohir\nEnd of round: 1 resource on quest (2 total)\n\nTurn 6\n\nDraw: Steed of the North\nPlanning Phase: exhaust Harp to give Elrohir 1 resource; play Golden Belt on Elrohir; play Miruvor on Elrohir; discard Miruvor to give Elrohir 1 resource and +1 Willpower; play Ancestral Armor on Elrohir (it gets to 7 (or 9 if shadow effect triggers) defense and 8 hit points, not too shabby) discarding Steed of the North\nQuest Phase: send everyone to the quest (19 Willpower); exhaust Unexpected Courage to ready Elrohir; reveal Shadow of Fear which surges into Catacombs; 12 progress, 5 to clear the active location, 7 on current quest\nTravel Phase: travel to Catacombs, discard Crowded Market (of course!)\nEngagement phase: nothing\nCombat phase: Elrohir defends City Guard (shadow effect for +2 attack, trigger Round Shield, 2 damage); exhaust contract to heal 1 damage from Elrohir (2 total); Elladan attacks City Guard (1 damage, 2 total)\nEnd of round: 1 resource on quest (3 total)\n\nTurn 7\n\nDraw: Warrior Sword\nPlanning Phase: play Elven-Light from discard pile, draw Golden Belt; play Golden Belt, Warrior Sword and Steed of the North on Elladan (8 Attack and -2 Defense, not too shabby either) discarding Rivendell Blade; exhaust Harp to get resource to Elrohir\nQuest Phase: choose Shadow of Fear as current quest; send everyone to the quest (20 Willpower); exhaust Unexpected Courage discard Elven-Light with Steed to put 2 progress on active location; reveal Under Guard (trigger Travel effect of Catacombs, discard The King's Elite (put it engaged with me, 42 Threat); 16 progress, 2 to clear active location, the rest to clear the side quest (39 Threat)\nTravel and Engagement Phase: nothing\nCombat Phase: Elrohir defends City Guard (spend 1 resource to ready Elrohir, shadow effect for additional attack, trigger Round Shield, exhaust One Ring and raise threat (40 threat) to cancel it, no damage); Elrohir defends The King's Elite (1 resource on the main quest, spend 1 resource to ready Elrohir) no damage); Elladan attack The King's Elite (spend 1 resource to ready Elladan) and destroys it; Elladan and Elrohir attack City Guard (6 damage for a total of 8); exhaust contract to heal Elrohir (1 damage)\nEnd of round: 1 resource on quest (5 total)\n\nTurn 8\n\nDraw: Elven-Light\nPlanning Phase: play Elven-Light from the discard pile, draw Elrond's Counsel (lucky!); discard Elven-Light to give Elrohir 1 resource\nQuest Phase: play Elrond's Counsel on Arwen (38 threat), send everyone to the quest (21 Willpower); exhaust Unexpected Courage to ready Elrohir; reveal Guarded Archway; 19 progress, clear the current quest, advance to stage 4, get Ulfast Sentry as enemy\nTravel Phase: travel to Guarded Archway, City Guard attacks and Elrohir defends (spend 1 resource to ready him again, no shadow effect, 2 damage)\nEngagement phase: engage Ulfast Sentry\nCombat phase: Elrohir defends Ulfast Sentry (no damage); Elladan kills Sentry; exhaust contract to heal 1 damage from Elrohir (2 damage)\nEnd of round: 1 resource on quest\n\nTurn 9\n\nDraw: Rivendell Blade\nPlanning Phase: play Elven-Light from discard pile, draw Silver Circlet; discard Elven-Light to get back 1 resource on Arwen\nQuest Phase: send everyone to the quest (20 Willpower), discard 2nd Elven-Light on Steed to put 2 progress on active location; exhaust Unexpected Courage to ready Elrohir; reveal Ulchor's Agent (**** it, 42 threat); 15 progress (2 to clear the active location, 13 on the current quest)\nTravel Phase: nothing\nEngagement phase: engage Ulchor's Agent\nCombat phase: Elrohir defends Ulchor's Agent (spend 1 resource to ready Elrohir, no damage); Elrohir defends City Guard (spend 1 resource to ready Elrohir, shadow effect that sends it “back” to the staging area, lucky me, trigger Round Shield no damage); Elladan attack Ulchor's Agent (spend 1 resource to ready Elladan) and destroys it; Elladan and Elrohir attack City Guard (6 damage for a total of 14); exhaust contract to heal Elrohir (1 damage)\nEnd of round: 1 resource on quest (for a total of 2)\n\nTurn 10\n\nDraw: Prepare for Battle\nPlanning Phase: discard Prepare for Battle to give 1 resource to Elrohir; play Silver Circlet on Arwen discarding Silver Harp\nQuest Phase: send everyone to the quest (22 Willpower), exhaust Unexpected Courage to ready Elrohir; reveal Messenger from Mordor (immediate attack, Elrohir defends, spend 1 resource to get ready, no damage), 18 progress for a total of 31 on the current quest (so I only need to \"kill\" the City Guard now)\nTravel Phase: nothing\nEngagement phase: engage Messenger from Mordor\nCombat phase: Elrohir defend City Guard (spend resource to ready him, shadow is Extra Vigil, is attached to City Guard, I trigger Round Shield, no damage); Messenger from Mordor is undefended (I will sacrifice Arwen if needed, 4 damage on Elrohir for a total of 5); Elladan kills Messenger from Mordor (spend resource to ready Elladan); Elladan and Elrohir attack City Guard (6 damage for a total of 20) which wins the game\n\nFinal Threat: 43 (cutting it close with The One Ring)\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920979","commentId":3920979,"userName":"asgardianphil","timestamp":1585415604,"content":"Thanks for putting this on. What's really cool is that it's not so much looking for a mistake you've made but I might have made either tactically or mechanically.\n\n \n\nWell.. it looks like I have been making a few mistakes with the contract. \n\nSomeone already spotted I flipped the contract at the wrong time, but I also misread the contract to be the first restricted attachment of the phase gets a discount rather than the first one on each hero in the phase. 🙈 \n\nSo I might have done better with a few more resources. \n\nI'll give it another shot later. I loved the deck by the way. I wasn't 100% of the timing window for the brothers' readying actions. The phrase after defending or after attacking. when does that last up to? \n\nI'm a bit rushed so I haven't read all you game reports yet but I will do tonight and then play my game. I've been on overtime at work all day today. \n\nCheers. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3920998","commentId":3920998,"userName":"Alonewolf87","timestamp":1585418523,"content":"> 42 minutes ago, asgardianphil said:\n> \n> Someone already spotted I flipped the contract at the wrong time, but I also misread the contract to be the first restricted attachment of the phase gets a discount rather than the first one on each hero in the phase. 🙈 \n> \n> So I might have done better with a few more resources. \n\nYes that's a huge discount since it applies to everyone once per round.\n\n> 43 minutes ago, asgardianphil said:\n> \n> I'll give it another shot later. I loved the deck by the way. I wasn't 100% of the timing window for the brothers' readying actions. The phrase after defending or after attacking. when does that last up to? \n\nAfter you declare them as attackers/defenders, but before you resolve the attack/defense. So for example in Elrohir case is before revealing the shadow card. Following Seastan useful Guide to Action Windows [https://ringsdb.com/decklist/view/10407/a-guide-to-action-windows-1.0]deck it would be after 6.4.1 for Elrohir and after 6.8b for Elladan"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921108","commentId":3921108,"userName":"asgardianphil","timestamp":1585435636,"content":"City of Ulfast again ( to the tune of Paul McCartney's Someones Knocking at the Door, somebodies ringing the bell)\n\n \n\nPlace heroes and contract side A. Search one ring and add inner strength to my hand. Put one ring on elrohir. \n\nDraws- foe hammer, open the armory, elven light, ancestral armour, gondorian shield, the galhadrims greeting. Adds inner strength. \n\nMulligan- for gondorian shield, foe hammer, golden belt, steed of imladris, unexpected courage, golden belt. \n\nSet up: set up quest. Search and add streets of ulfast to the staging area. Then use setup action on one ring again to search for inner strength. \n\n[There's been some debate about how one ring works and when to use its effect. In my game I did it as per the new rules where you do it after cards are drawn. Alonewolf87 did it during hero placement but didn't mulligan it. This time I've done it as pre new Ruling but reckon you can still use the set up on the ring, but in that case you could take out every master card in your deck. I see why they made the new ruling now. It's a bit of a mess because neither way is ideal.]\n\n \n\nAnyhoo.\n\nTurn 1\n\nDraws Rohan warhorse.\n\nPlays golden belt on elrohir and elladan. Rohan warhorse (discounted) on elladan. Gondorian shield (discount) on elrohir.  Discarded foe hammer to gain a spirit resource. Plays unexpected courage on elrohir. \n\nQuest all in. 10. Stage the kings elite. Total 5 threat. 2 progress on stage 1. \n\nTravel to streets of ulfast. Raises threat to 30.\n\nKings elite engages. Ready elrohir with unexpected courage. \n\nCombat- Elrohir defends for 4. Shadow is extra vigil- no effect. I damage on elrohir. Add 1 resource to stage 1 \n\nRefresh: threat 31. 1 resource on stage 1(total 2)\n\nNot looking good!\n\n \n\nTurn 2.\n\nDraw dagger of westernesse. \n\nPlays steed of imladris (discount) on arwen. Dagger of westernesse (discount) on elladan. Inner strength on elrohir for 1. \n\nQuest arwen and elrohir for 5. Stages shadow of fear side quest. Surges servant of Mordor which engages me and raises my threat (SQ) to 32 so servant makes an attack. Take it undefended. Shadow is side street so no effect. 2 damage on elladan. Servant surges and draws messenger from Mordor into the staging area. When revealed - choose to raise threat by 2. Now 34. (Just enough for messenger to engage) however the servant doesn't make another attack at his forced effect is limited to once per phase). 5 quest vs 5 threat. Makes 0 progress.\n\nReady elrohir with unexpected courage.\n\nEngagement- Messenger from Mordor engages. SQ raises my threat to 35 so servant attacks. Elrohir defends and readies. Shadow is ulfast sentry so no effect. (Presumably as my threat increased in the engagement phase the game state has changed and I should make engagement checks against my new value of 35?) So... city guard is now engaged. \n\n4 attacks coming now...  9att, 4att ,5att and 2att. And an attack each round in the refresh.\n\n \n\nScooped on turn 2.\n\nThis type of play from the encounter deck is what I mostly experience. I never seem to get the lucky breaks. \n\nChin up self... there'll be another attempt tomorrow 😁\n\n \n\nhowever for those wondering...\n\nCombat phase\n\nDeals 4 shadow\n\nElrohir defends the kings elite and readies. Add 1 resource to stage 1. Shadow is catacombs- no effect. 0 damage. \n\nServant of Mordor attacks undefended. Shadow is kings lawn- no effect  (phew) 2 damage on arwen. \n\nElrohir defends messenger from Mordor. Shadow is patrolling the streets ( +1 att per resource on stage 1. In this case +3) ( I could use inner strength to cancel this but that would raise my threat and give servant of Mordor a free attack.) So I accept 7 att vs 5 def. 2 damage on elrohir. (Total 3). \n\nCity guard attacks undefended ( throwing arwen under the horse and cart). Shadow is ulfast sentry - no effect. Arwen is destroyed along with the steed. \n\nElladan. attacks servant of Mordor for 5 and defeats him. Exhaust Rohan warhorse to ready elladan\n\nElladan attacks and readies against the kings elite. For 4 att dealing 2 damage.\n\nElladan attacks messenger from Mordor for 4 att dealing 2 damage. \n\nRefresh threat now 36. Contract flips to side b. Adds 1 resource to stage 1 (4 total). \n\n \n\nTurn 3\n\nDraws a test of will\n\nState of play. City guard is threat 5 and engagement value 25. He is engaged with me along with kings elite att 5 and messenger from Mordor att 4. Active location has 5 quest points and no progress. \n\nI'm questing for 4 using unexpected courage to ready. \n\nCity guard will kill both heroes during the next two turns. \n\nNow scoop.  \n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921122","commentId":3921122,"userName":"Alonewolf87","timestamp":1585436835,"content":"I am sad that even this attempt didn't ended up well. I will try to share any suggestions I can come up with.\n\n> 23 minutes ago, asgardianphil said:\n> \n> Draws- foe hammer, open the armory, elven light, ancestral armour, gondorian shield, the galhadrims greeting. Adds inner strength. \n> \n> Mulligan- for gondorian shield, foe hammer, golden belt, steed of imladris, unexpected courage, golden belt. \n\nOne of the cards you really want to mulligan for is Elven-Light, the card draw it provides, letting you find faster the Restricted attachments is key. Also flipping the Contract at the latest on turn 2 is basically a must if you want a shot at winning this quest.\n\n> 23 minutes ago, asgardianphil said:\n> \n> Quest arwen and elrohir for 5. Stages shadow of fear side quest. Surges servant of Mordor which engages me and raises my threat (SQ) to 32 so servant makes an attack. Take it undefended. Shadow is side street so no effect. 2 damage on elladan. Servant surges and draws messenger from Mordor into the staging area. When revealed - choose to raise threat by 2. Now 34. (Just enough for messenger to engage) however the servant doesn't make another attack at his forced effect is limited to once per phase). 5 quest vs 5 threat. Makes 0 progress.\n> \n> Ready elrohir with unexpected courage.\n\nLittle advice, you still have a Window action after sending everyone to the quest so you could have readied Elrohir before staging and took the Messenger attack (reading him again with his resource) to avoid raising the threat and getting engaged by the City Guard. Still a **** combat phase ahead but a little better.\n\n> 23 minutes ago, asgardianphil said:\n> \n> Set up: set up quest. Search and add streets of ulfast to the staging area. Then use setup action on one ring again to search for inner strength. \n\nOne of the possible good starting locations would be Crowded Market, low threat and useful effect. I realize you might want to keep it for later but it can give you an emergency escape when needed. Also Streets of Ulfast might start as lower threat but in this quest any threat increase has to be avoided.\n\n \n\nEdited March 28 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921145","commentId":3921145,"userName":"asgardianphil","timestamp":1585441220,"content":"Thanks for the advice mate. \n\nI reply to your points and I have some questions about your game  finally read it all. \n\n \n\nCrowded market. I exclusively started with this location for about the first 20 or so games but travelling their always gave me a really bad enemy engaged with me. Often servant of Mordor or kings elite, the +20 was welcome but only ever bought a few spare turns. So I've been experimenting with other stating locations with kinder travel effects. Streets of ulfast is almost always going to be raise threat by 1. (Turn 1 or Servant of Mordor and kings elite could ruin that plan though).\n\nYeah, I missed the action window, readying Elrohir, its unexpected courage so why wouldn't you ready? 🤦‍♂️ and there's no action window during staging of surges just response and forced effect actions.\n\n \n\nWhen I mulligan- it was to get more restricted cards in my hand. I thought there's no guarantee with elven light, and I had no weapon for foe hammer or silver Harp. My mulligan proved just as bad  I think.\n\nI really appreciate the advice and enjoyed your play through. Well done on the win by the way. I think this game hates me and will always throw the worst combos at me. I'm never so lucky. 🥺\n\n \n\nOn to the next attempt. I'll keep chipping away. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921215","commentId":3921215,"userName":"Alonewolf87","timestamp":1585468750,"content":"> 7 hours ago, asgardianphil said:\n> \n> Crowded market. I exclusively started with this location for about the first 20 or so games but travelling their always gave me a really bad enemy engaged with me. Often servant of Mordor or kings elite, the +20 was welcome but only ever bought a few spare turns. So I've been experimenting with other stating locations with kinder travel effects. Streets of ulfast is almost always going to be raise threat by 1. (Turn 1 or Servant of Mordor and kings elite could ruin that plan though).\n\nThe risk with Streets of Ulfast (for this specific deck unless you get Elrond's Counsel) is that you will get to 30 threat and be forced to engage The King's Elite, which is (City Guard aside) the worst enemy of this deck since resource on the quest are the worst possible thing. Also you are not forced to travel to Crowded Market in the first turn (so you can avoid the risk of getting a bad enemy), you can leave it in the staging area for later.\n\n> 7 hours ago, asgardianphil said:\n> \n> When I mulligan- it was to get more restricted cards in my hand. I thought there's no guarantee with elven light, and I had no weapon for foe hammer or silver Harp. My mulligan proved just as bad  I think.\n\nYeah both hands were mediocre to bad."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921408","commentId":3921408,"userName":"asgardianphil","timestamp":1585523904,"content":"Yep, I never travelled to crowded market early every turn, but it did sit in the staging adding 2 threat and eventually when I needed to travel for the +20 the guaranteed enemy pull was never good. I thought at least with streets I should travel first turn and then it's out of the staging for a 1 threat increase.\n\n \n\nSo to keep things in flux, I've found a new deck to try, I'll get back to the Noldor deck if this attempt fails. \n\nI've picked the Halls of Beorn Elfhelm three hunters mounted deck. Not sure why, just looked cool I guess and it claims to get 16 quest on Eowyn  and huge defense and attack shenanigans with Grimbeorn.\n\n \n\nSet up. \n\nPut out contract forth the three hunters side A and heroes Elfhelm, Eowyn (spirit) and Grimbeorn the Old. Threat 30\n\nDraws Steward of Gondor, Foe hammer, celebrians stone, open the armory,  steward of gondor,  gondorian shield.\n\nNot going to mulligan this for the stewards, sheild combo and celebrains stone. \n\nSet up quest and put crowded market in the staging area. \n\n \n\nTurn 1\n\nDraws silver Harp. \n\nPlays celebrains  stone (discount) on Eowyn.  gondorian sheild (discount) on grimbeorn, open the armory (spirit resource) pulls round sheild and plays it on grimbeorn. \n\nQuest eowyn and Elfhelm for 8 stages messenger from Mordor. He makes an immediate attack. Grimbeorn defends for 4. Shadow- ulfast sentry (no shadow). No damage. Spend 1 resource to respond grimbeorn attacks messenger and deals 3 damage. 5 threat vs 8 quest = 3 progress on stage 1. \n\nNo travel and no engagement\n\nRefresh threat up to 31. Add 1 resource to stage one (total 1)\n\n \n\nTurn 2\n\nDraws armoured destrier. \n\nPlays silver Harp on Eowyn (discount), armoured destrier on elfhelm (discount).\n\nQuest eowyn and Elfhelm action: silver Harp +1 wp on eowyn. 9 quest points. Stages patrolling the streets- 1 resource on stage 1 (total  2). Choose option to prohibit progress. 7 threat vs 9 quest. No progress made. \n\nNo travel\n\nEngages messenger from Mordor. Grimbeorn defends for 4. Shadow- crowded market (no shadow). No damage. Grimbeorn spends 1 resource to attack messenger. Destroys him. \n\nRefresh threat now 32. Adds 1 resource to stage 1 (total  3). City guard now engagement 30.\n\n \n\nTurn 3\n\nDraws unexpected courage.\n\nSaves the 1 resource on each hero for next turn. \n\nQuest eowyn and Elfhelm and silver Harp +1 wp for 9. Stages guarded archway. 8 threat vs 9 qp = 1 progress on stage1 (total 4). \n\nTravel to crowded market. Adds servant of sauron to staging area. (Its surge doesn't trigger as it wasn't revealed) but it engages me. \n\nNo other engagement (city guard now 50)\n\nCombat. Grimbeorn defends for 4. Shadow- servant of sauron (no shadow). No damage. Grimbeorn spends a resource to attack it and destroys it. \n\nRefresh threat up to 33. add 1 resource to stage 1 (total  4). CG 45\n\n \n\nTurn 4\n\nDraws a test of will.\n\nPlays steward of gondor on grimbeorn. (Saving unexpected courage as I need a resource for a test of will. Some nasty treacheries in this deck. )\n\nExhaust steward to put 2 resources on grimbeorn. He's also gondor trait now too. \n\nQuest eowyn and Elfhelm and silver Harp +1 wp on eowyn for 9 quest points. Stage shadow of fear side quest. Surges into guarded archway. 9 threat vs 9 quest points = 0 progress.\n\nRefresh threat up to 34. Add 1 resource to stage 1(total 5). CG 35\n\n \n\nTurn 5\n\nDraws steward of gondor. \n\nPlays unexpected courage on grimbeorn. Exhaust Steward of gondor to add 2 resources. \n\nIs this the end?\n\nQuest eowyn and Elfhelm and silver Harp +1 wp on eowyn for 9. Stages ulfast sentry.  12 threat vs 9 quest. Threat increases to 37. \n\nEngagement. Ulfast sentry engages (raises threat to 38 SQ) and choose him to attack me. Grimbeorn defends for 5. Shadow- overwhelmed (raise threat by 2 or can't damage attacker. I choose the threat as CG will engage.) Save round shield for CG. 5 def vs 6 att = 1 damage. Spend 1 resource on grimbeorn to attack and destroy ulfast sentry. \n\nReady grimbeorn with UC. \n\nCombat. Grimbeorn defends city guard.  Def 5. Shadow- catacombs (no shadow). 9 att = 4 damage on grimbeorn. Killing him. \n\nScooped.\n\nHypothetically, If I'd have used round shield on the sentry...\n\nNo damage from the sentry. And 4 damage from city guard. \n\nRefresh threat up to  39. Adds 1 resource to stage 1 (total 7)\n\n \n\nTurn 6 alternate universe. \n\nDraws elven light.\n\nNo restricted attachment so can't flip contract to access healing and extra quest power. This 50 card deck has 25 restricted attachments... what happened?\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921409","commentId":3921409,"userName":"asgardianphil","timestamp":1585524041,"content":"This is the deck I used \n\nhttps://ringsdb.com/decklist/view/14898/alltheprettyhorses-1.0 [https://ringsdb.com/decklist/view/14898/alltheprettyhorses-1.0]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921417","commentId":3921417,"userName":"asgardianphil","timestamp":1585525017,"content":"Maybe it all comes down to the starting hand. If that's the case then I'm not sure I think that's a good design. Only to win on the best starting hand and a really lucky encounter draw. I don't think I'm a bad player (I'm certainly not the best) but this game should be achievable for mediocre players or good players with thematic decks. I've been playing through each quest once from the very first quest to this, only moving on when I get a flawless victory (ie no mistakes) and some quests have been beaten the first time but not many. Might surprise you to know it's taken me from January 2016 playing pretty much non stop. I've averaged about a month to 2 months per quest playing a few nights each week.  I've only caught up to the latest release at the end of Wilds of Rhovanion and I'm behind again now. Sure I love the game. But it's **** frustrating. I don't like easy mode and find quite often it's no easier. Take this quest.. the side quests are ruthless and in easy mode they're not removed. \n\nAnyway,  rant over, any help is still welcome 😊"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921525","commentId":3921525,"userName":"Alonewolf87","timestamp":1585554135,"content":"> 8 hours ago, asgardianphil said:\n> \n> This 50 card deck has 25 restricted attachments... what happened?\n\nYou definitely had some bad luck with the draw here.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921602","commentId":3921602,"userName":"MikeGracey","timestamp":1585575608,"content":"> 14 hours ago, asgardianphil said:\n> \n> Yep, I never travelled to crowded market early every turn, but it did sit in the staging adding 2 threat and eventually when I needed to travel for the +20 the guaranteed enemy pull was never good. I thought at least with streets I should travel first turn and then it's out of the staging for a 1 threat increase.\n> \n>  \n> \n> So to keep things in flux, I've found a new deck to try, I'll get back to the Noldor deck if this attempt fails. \n> \n> I've picked the Halls of Beorn Elfhelm three hunters mounted deck. Not sure why, just looked cool I guess and it claims to get 16 quest on Eowyn  and huge defense and attack shenanigans with Grimbeorn\n> \n>  \n\nI think this is the problem. Your playing an extremely hard quest and picking a deck that 'looks cool.' It looks cool yes, but does it have lots of threat reduction? Is its starting threat low? Can one hero actually be able to defend city guard repeatedly? I think you do need to tech against this quest, and if you don't have huge amounts of threat reduction your gonna lose."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921703","commentId":3921703,"userName":"asgardianphil","timestamp":1585587628,"content":"I have run threat reduction heavy decks against this quest but then have found another weakness cropping up  \n\nI ran a spirit frodo deck low starting threat)  that would take the city guard damage and then reduce the threat.\n\nI find the biggest problem for this quest is the resource mechanic of the city guard. The only way to stop it is to quest and clear the location. \n\nSo after so many decks where they are heavy in quest or threat reduction or combat or defense, no matter which too or three core mechanics I go for the resource mechanic is the undoing of it. Yet if I power through with high questing decks then the enemies coming out are too tough. \n\nYep this mounted deck looked cool, but the real reason I grabbed this one was the high will power it claims to achieve and the huge defense and attack grimbeorn could get to defend and take out enemies. \n\nIn my play though grimbeorn was kicking butt, however not getting out my last restricted item stalled my questing. \n\n \n\nI've even tried chumping with imrahil decks and Lothiriel gondor decks. (I read alonewolfs threat in the strategy section)\n\nIt's just a matter of time before i do beat it. And while I'm frustrated I still love this game otherwise it would have gone on ebay long ago. At the moment I just feel putting one resource on the stage at the end of round would have been enough but all the other card effects that also adds resources makes the quest for me a difficulty 9 not a 6 as published. \n\nI do have a a really good feel for this deck and will play it another time.\n\nHowever, Mikegracey if you want to create me the deck you think would beat this quest then please do, and I'll play it here and post my results. \n\nIn fact I'm going to post every game I play here until I beat it  (the poster who started the threat on win percentages take note 😁)\n\nTake care all. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921713","commentId":3921713,"userName":"Alonewolf87","timestamp":1585589651,"content":"> 31 minutes ago, asgardianphil said:\n> \n> In my play though grimbeorn was kicking butt, however not getting out my last restricted item stalled my questing. \n\nYeah, that's why some Three Hunters Deck go for the One Ring road, just to be sure of having 1/6 restricted attachments from the get go. Their weakness against this quest is that they can't chump block.\n\n> 33 minutes ago, asgardianphil said:\n> \n> It's just a matter of time before i do beat it. And while I'm frustrated I still love this game otherwise it would have gone on ebay long ago. At the moment I just feel putting one resource on the stage at the end of round would have been enough but all the other card effects that also adds resources makes the quest for me a difficulty 9 not a 6 as published. \n> \n> I do have a a really good feel for this deck and will play it another time.\n> \n> However, Mikegracey if you want to create me the deck you think would beat this quest then please do, and I'll play it here and post my results. \n\nI might put together a secrecy deck just to see how it fares against this quest, I will let you know."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921727","commentId":3921727,"userName":"asgardianphil","timestamp":1585590976,"content":"New game \n\n \n\nSet out eowyn (spirit), elfhelm, grimbeorn and forth the three hunters. \n\nDraws, elven-light, captain of gondor, a test of will, strider, celebrains stone, steward of gondor. \n\nNow this is a difficult decision  because I only have 1 restricted item but I do have elven-light and steward and a test of will. All in all a good starting hand, but not a good three hunters starting hand. That said I'm keeping it and hope elven-light does it's thing. \n\nThreat 30\n\nSet up,- adds crowded market to staging\n\n \n\nTurn 1\n\nDraws foe hammer.\n\nPlays celebrains stone (discount) on eowyn, plays strider on eowyn using grimbeorn resource. \n\nQuest with eowyn and elfhelm and discards elven-light for 11 wp. Stages we've been seen! Choose to raise threat by 1 to 31. (Saving eowyns resource for elven-light) 3 threat vs 11qp = stage 1 explored. Reveal stage 2. Choose to reveal a card from encounter deck. Overwhelmed (doomed 1)  threat goes up to 32 when revealed effect doesn't affect me. \n\nPlays elven-light from discard pile. Draws round shield. \n\nNo travel\n\nNo engagement \n\nRefresh threat up to 33. Adds one resource to stage 2( total  1) CG 40.\n\nTurn 2\n\nDraws open the armory \n\nPlays round shield on grimbeorn. (Saving eowyns resource for elven-light and grimbeorn for his ability and elfhelms towards Steward. If no enemies or treachery comes up then I can spend those resources on elven-light and open the armory)\n\nQuest as before and discards elven-light for 11 WP. Stages the kings elite. 7 threat vs 11 qp = 4 progress on stage 2. (Total 4).\n\nNo travel\n\nKings elite engages. Grimbeorn defends for 3. Shadow is kings lawn (no shadow) 2 damage on grimbeorn and 1 resource on stage 2 (total 2 CG 35) grimbeorn spends his resource to attack kings elite. 3 damage on kings elite. \n\nPay to play elven-light and draws open the armoury. \n\nRefresh threat goes up to 34. Adds 1 resource on stage 2. (Total 3 CG 30) \n\n \n\nTurn 3\n\nDraws war axe  \n\nPlays steward of gondor on grimbeorn. Exhaust it to add 2 resources to him. Grimbeorn plays open the armory draws gondorian shield which he plays on himself for a discount. Pays for war axe on himself. (He has one resource left). \n\nQuest eowyn, Elfhelm and discard elven-light for 11 wp.  Stages ulchors agent. When revealed effect increases my threat by 3 to 37. (All enemies are already going to engage me so not worth using test of will. Think this is game over now. ) 9 threat vs 11 qp = 2 progress on stage 2 ( total 6). \n\nTravel to crowded market. CG 50. Draws servant of sauron. He engages me. \n\nEngagement. ulchors agent engages.\n\nGrimbeorn defends kings elite for 5 shadow- catacombs (no shadow) he adds 1 resource to stage 2 (total 4) grimbeorn spends a resource to kill kings elite. \n\nServant of sauron makes an undefended attack. Shadow - patrolling the streets + 4 attack. Kills elfhelm. \n\nUlchors agent makes an undefended attack. Shadow is messenger from Mordor +1 att. Kills eowyn. \n\nGrimbeorn sacks off ulfast and runs for the hills. \n\nScooped. \n\nNext I'll try a chumping deck with threat reduction. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921936","commentId":3921936,"userName":"MikeGracey","timestamp":1585610162,"content":"> 6 hours ago, asgardianphil said:\n> \n>  \n> \n> However, Mikegracey if you want to create me the deck you think would beat this quest then please do, and I'll play it here and post my results. \n> \n> In fact I'm going to post every game I play here until I beat it  (the poster who started the threat on win percentages take note 😁)\n> \n> Take care all. \n\nIf you look at my first post on this topic you will get a good idea of the deck I was using. I have never posted a deck before, I just don't. But my heros are listed and my strategy is pretty simple. Put down willpower with ethir swordsmen, silver circlet and pelagir shipwrights, lower threat with greetings, elronds council and damrod (with Lothiriel). The biggest issue is attack. Thats why I play knights of belfalas. I heard people say they synergize with Lothiriel but I dont know why you would toss away a 2 cost 2 att ally. Between 3 of them, gandalf ally and Glorifindel, enemies can be handled."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3921941","commentId":3921941,"userName":"Bobbymcbobface","timestamp":1585611377,"content":"I don't own City of Ulfast, so I haven't tried it, but I had a friend use this deck to beat it...\n\nhttps://www.ringsdb.com/decklist/view/14699/monotacticsdeck-1.0 [https://www.ringsdb.com/decklist/view/14699/monotacticsdeck-1.0]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922050","commentId":3922050,"userName":"Alonewolf87","timestamp":1585641572,"content":"After looking back at the encounter deck (ans seeing how 1/4 of the cards can raise you threat one way or another) perhaps a good card to put in some deck (besides some threat reduction) would be Free to Choose, so you can easily nullify the threat increase. I might make a deck around that, perhaps a Dale one with a fully stocked Guardian of Esgaroth as main defender."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922132","commentId":3922132,"userName":"Alonewolf87","timestamp":1585667781,"content":"@asgardianphil [https://community.fantasyflightgames.com/profile/319785-asgardianphil/] I actually had a couple of good games and wins with this slighty modified version of my old Gondor Erestor swarm deck (it's slighty not thematic due to the inclusion of Erestor, but for the rest it has a strong Gondor theme)\n\nhttps://ringsdb.com/decklist/view/15225/gondor-erestorinulfast-1.0 [https://ringsdb.com/decklist/view/15225/gondor-erestorinulfast-1.0]\n\nEdited March 31 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922140","commentId":3922140,"userName":"asgardianphil","timestamp":1585669731,"content":"Thanks for the continued support guys. \n\nSome more info: I started this quest on 19th Feb just after I got the pack , it pretty much came straight after wrath and Ruin due to that pack being delayed for us in the UK. One of my first decks against this encounter was a Lothiriel deck as she was brand new and I loved her art and ability. I have a WhatsApp message dated 28th feb where I posted the deck I used to my mates. This was the deck \n\nhttps://ringsdb.com/decklist/view/14693/herecomesthebride-1.0 [https://ringsdb.com/decklist/view/14693/herecomesthebride-1.0]\n\nHere comes the bride. \n\n \n\nI loved the deck but found that I quickly ran out of allies in my hand and the turns where I failed to draw an ally was crippling. \n\nAs MikeGracey says, it needed to be a dedicated threat reducer and it wasnt. \n\nI do like window shopping for premade decks to save me a bit of time, I do make my own decks but it takes me quite a while to refine. So quite often I'm playing someone elses deck. (Afterall that's why they post them 😁) \n\nI've also found a deck from Seanstan that i want to play as it claims to take down large enemies and he's fixed it so the dale synergy gets going quite quickly. \n\nhttps://ringsdb.com/decklist/view/12498/daleforcewins-1.0 [https://ringsdb.com/decklist/view/12498/daleforcewins-1.0]\n\nDale force wins.\n\n \n\nSo I'm going to play bobbiemacbobfaces deck first followed by alonewolf87's gondor deck just posted,  then seanstans dale force deck. \n\nHopefully I'll get a game in tonight  \n\nThanks again for all you messages on here. I'm really enjoying the community spirit you're all showing me, a fellow ringer, in beating this quest. 👍\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922237","commentId":3922237,"userName":"Bobbymcbobface","timestamp":1585681983,"content":"You'll definitely want to do a few deck changes to make my deck work... More chumps and stuff"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922244","commentId":3922244,"userName":"asgardianphil","timestamp":1585683839,"content":"New game. \n\nI made a couple of changes to the deck but only from those cards recommended in the side deck options. \n\nI changed the stick around Gandalf cards for regular gandalf as the threat increase is too much in a quest already ramping up threat. \n\nI got rid of the side quests as I can never get the encounter card side quests done in the quest so I think side quests help the city guard countdown all the more.  2 born aloft (hopefully to use on Gandalf or descendents) and eagles of the misty mountains to use when the descendants are discarded. \n\n \n\nSet out heroes- eowyn (tactics), theoden (tactics), and hirgon. \n\nDraw cards- knight of mines tirith, born aloft, boromir, born aloft, the red arrow, grimbold.\n\nKeeping this hand. \n\nSet up: Threat 27 (eowyns discount) put crowded market in staging. \n\n \n\nTurn 1\n\nDraws legolas.\n\nPlays red arrow on hirgon. \n\nQuest: eowyn, theoden and hirgon for 12 wp. Stages guarded archway. 5 threat vs 12 qp. = 7 progress. Determined quested successfully so hirgon responds playing Grimbold (discounted). 5 progress on stage 1 clearing it. \n\nStage 2 revealed. Choose to reveal a card. The kings lawn. \n\nTravels to kings lawn. Adds 1 resource to stage 2 (total 1 CG 40). \n\nRefresh: threat goes up to 28. Adds 1 resource to stage 2 (total 2 CG 35)\n\nGood first turn. I realise I shouldn't have played the red arrow, I missed its action was a  valour action (doh!) And i could have got borromir or legolas out. Still, having the red arrow 1 wp  and a 2 quest grimbold still helps.\n\n \n\nTurn 2\n\nDraws knight of mines tirith. \n\nQuest: all in for 14 wp. Stages streets of ulfast. Threat 10 vs 14. = sucessfully quested so hirgon responds by discounting in borromir, then 4 progress on kings lawn. \n\nThis generally happens: when I play a tactics deck mostly locations show up and when I play the same quest switching to questing enemies show up. 😀\n\nI'm in danger of being locked out. \n\nNo engagement or combat.\n\nRefresh: increases threat to 29. Adds 1 resource to stage two (total 3 CG 30)\n\n \n\nTurn 3\n\nDraws eagles of misty mountains.\n\nQuest: eowyn, theoden, Hirgon and grimbold for 14. Stages kings elite. Threat 15 vs 14 qp. unsuccessfully quested. No hirgon response. threat goes up to 30. \n\nEngagement. Kings elite and city guard engage. \n\nDiscard grimbeorn to prevent kings elite attacking.\n\nBorromir defends city guard for 1. Shadow (ulchors agent) +1 and raise threat if destroys a character. 10 att kills boromir. Threat goes up to 31.\n\nAction: Ready eowyn threat increases to 34 and attack with 10 kings elite killing him.\n\nRefresh: threat goes up to 35. Add 1 resource to stage  two ( total 4. CG 25).\n\n \n\nTurn 4\n\nDraws legolas. \n\nPlays knight of minas tirith. Leaving  1resource on each hero. (Playing eagles would not be the best play, even with his will power I'm only drawing even with the 14 threat in the staging which means hirgon cant do his thing and I'm facing a city guard attack every turn. \n\nQuest all in bar knight for 12 wp. Stages catacombs... (really; another location!) 18 threat vs 12. Unsuccessfully quested. Threat goes up to 41. In valour. \n\nCity guard attacks. Knight of mines tirith defends for 1. Shadow (side street) no effect. Kills knight. \n\nRefresh: threat goes up to 42. Add 1 resource to stage 2 ( total 5) \n\nTurn 5\n\nDraws Gandalf (a wizard is never late... nor early. . )\n\nPlays legolas.... hehe only joking. Plays gandalf  (leaves 1 resource on hirgon) which one guys, which response do I trigger? Cards or threat?... well I'm not clearing stage 2 anytime soon so reducing a high threat by 5 won't matter so I draw: defender of cair andros, the free peoples and oath of eorl. \n\nActually not sure Gandalf is going to help. As I need another defender for city guard. Threat is 20 in staging so I'm not questing well. \n\nQuest: all in for 12. (Not Gandalf) draws patrolling the streets: adds 1 resource to stage 2 (total 6) choose option to prevent progress on quest. Now 22 threat vs 12 qp. Threat goes up to 52. \n\nGame over. \n\nEnjoyed the deck. With all these decks you get in a good first 2 turns and you think this is it; it's going well. Then the resources start to ramp up on whichever stage and it signals the end. I know I was brutally unlucky with the locations.\n\nTurn 5 or 6 is generally all I'm getting to and never past stage 2. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922246","commentId":3922246,"userName":"asgardianphil","timestamp":1585684324,"content":"Just realised I couldn't have used Gandalf to reduce threat anyway due to guarded archway. So looks like drawing three cards was the only option. Also if I'd have quested with Gandalf then I'd have taken city guard undefended. It was a Kobayashi Maru scenario situation . 😉"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922251","commentId":3922251,"userName":"Alonewolf87","timestamp":1585685601,"content":"> 29 minutes ago, asgardianphil said:\n> \n> I know I was brutally unlucky with the locations.\n\nYeah, 3 locations in 4 turns it's brutal"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922372","commentId":3922372,"userName":"Bobbymcbobface","timestamp":1585705542,"content":"> 6 hours ago, asgardianphil said:\n> \n> Enjoyed the deck. With all these decks you get in a good first 2 turns and you think this is it; it's going well. Then the resources start to ramp up on whichever stage and it signals the end. I know I was brutally unlucky with the locations.\n\nThank you for trying it! I'm sure there are cards from cycles I don't have yet that could make it even better tuned to this quest. Sounds like City of Ulfast is hard and fun. I'm looking forward to picking it up."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922467","commentId":3922467,"userName":"Alonewolf87","timestamp":1585737678,"content":"> On 3/31/2020 at 9:59 AM, Alonewolf87 said:\n> \n> I might make a deck around that, perhaps a Dale one with a fully stocked Guardian of Esgaroth as main defender.\n\nTried a couple of games with the Dale deck but it does not fire its engines fast enough for this quest. In the second game I had a fully stocked Guardian of Esgaroth with 8 defense and 7 hit points to tank the City Guard but then I lost in questing power since I didn't saw any Valiant Determination. Too bad, but it was fun.\n\nIn my experiences for now the most effective deck seems to be the Gondor-Erestor swarm one, consistently fast in the first couple of rounds (for now at least) and with good enough questing (when Visionary Leadership hits the board which usually is no later than turn 2) and attack power (and more than enough chump blockers for the City Guard)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922780","commentId":3922780,"userName":"asgardianphil","timestamp":1585789469,"content":"Trying Bobby's deck again before moving on to the next deck but with some more changes. I've taken out\n\n2 Vigilant defenders,  2 the free peoples, justice shall be done, 2 skin barks and 1 oath of work and put in 3 flight of the eagles, 2 eagles of the misty mountains, 3 meneldors, \n\nAdding more quest, direct progress and boost for misty eagles. \n\nHirgon works with eagles whereas imrahil doesnt. (Was contemplating imrahil swap but that would change the deck too much). \n\nSet up heroes\n\nDraws grimbold, last stand, eagles of the misty mountains, arid, born aloft, marksmen of lorien. \n\nKeeping this hand. \n\nSetup add crowded market to staging. \n\nReduce threat by 3 to 27  \n\nTurn 1\n\nDraws knight of mines tirith \n\nQuest all in for 11 wp. Stages catacombs. Threat 7 vs 11 wp (successfully quested. Hirgon responds plays discounted eagles of the misty mountains. Then  4 progress on stage 1. \n\nTravel to catacombs. (Discards kings lawn)\n\nRefresh threat goes up to 28. Add 1 resource to stage 1 (total 1 CG 40)\n\nTurn 2\n\nDraws legolas.\n\nQuest with eowyn, hirgon, theoden and eagles of... for 13 wp.  Stages patrolling the city treachery. Resolves travel effect of catacombs. Discards we've been seen. Phew! Theat 4 vs 14 wp quested successfully so hirgon responds playing grimbold discounted. 10 progress made. Clears catacombs and stage 1. Reveals stage 2 and chooses to raise threat by 5 to 33.\n\nRefresh. Threat goes up to 34 add 1 resource to stage 2 (total  2 CG 40)\n\n \n\nTurn 3.\n\nDraws meneldor.\n\nQuest with eowyn, hirgon, theoden, eagles of... and grimbeorn for 15 wp. Stages under guard treachery as there is no active location I discard cards untill.. side street is discarded and added to staging. Threat 7 vs 15 wp quested successfully so hirgon responds playing discounted legolas. 8 progress on stage 2. \n\nTravel to side street. Effect is to add catacombs to the staging area. \n\nRefresh. Threat increases to 35. Add 1 resource to stage 2 (total 2 CG 35)\n\n \n\nTurn 4.\n\nDraws melendor again. (Looking great)\n\nPlays arod on legolas. Plays melendor and adds 2 resources to catacombs. Play born aloft on melendor. \n\nQuest eowyn, hirgon, theoden, eagles of..., grimbeorn and melendor for 17 wp. Stages streets of ulfast. Action window use born aloft to return melendor to my hand and put 2 progress on catacombs clearing it. Then eagles grabs melendor and puts it under face down. Reclaculate wp. Is now 15. Threat is 8 vs 15 wp = 7 progress. 3 on side street and 4 on stage 2 clearing it. \n\nStage 3 revealed. Choose the city guard attack option, can't raise threat again. Wasted arod  now. Legolas defends for 1. Shadow (under guard) doesn't trigger as no active location. Legoland arod dies and\n\ntravels to streets of ulfast. Threat goes up to 36. \n\nRefresh, threat goes up to 37. Adds 1 resource to stage 3. (Total 1 CG 40)\n\n \n\nTurn 5 (never been this far before. But turn 5 is where it all goes wrong )\n\nDraws melendor again again. \n\nQuest with eowyn, hirgon, theoden, eagles and grimbeorn for 15 wp. Stages messenger from Mordor. When revealed option. I choose to raise threat to 39. Threat in staging 6 vs 15 wp quested successfully so hirgon plays discounted meneldor. ( 2 progress on active location) 9 progress made. Clears streets of ulfast and 6 progress on stage 3\n\nNo travel\n\nEngagement. Messenger from Mordor engages. \n\nCombat. Meneldor defends for 1. Shadow (cat and mouse) no shadow. Kills meneldor and he puts 2 progress on crowded market in staging clearing it. Eagles of misty mountains claims it as it goes out of play. (Two cards under eagles now.)\n\nRefresh. Threat increases to 40. Add 1 resource to stage 3 (total 2 CG 35)\n\n \n\nTurn 6\n\nDraws eagles of misty mountains. \n\nQuest with eowyn, hirgon, theoden and grimbeorn for 13 wp. Stages the kings elite. Threat 6 vs 13 wp. Quested successfully so hirgon responds playing knight of minas tirith discounted. 7 progress made on stage 3 (total 13). \n\nEngagement. Kings elite engages and city guard is engaged. \n\nAction: discards grimbeorn to cancel king elites attack. \n\nEagles of misty mountains defends messenger from Mordor for 4 def. Shadow (ulfast sentry) no shadow. \n\nMinas trith knight defends against city guard.shadow (patrolling  the streets) +2) 11 att kills knight. \n\nRefresh increases threat to 41. Add 1 resource to stage 3 (total 3 CG 30).\n\n \n\nTurn 7 \n\nDraws eagles of the misty mountains (this deck was definitely shuffled well)\n\nPlays marksman of lorien (chooses kings elite for def reduction). \n\nQuest eowyn, hirgon and theoden for 11 wp. Stages servant of sauron which engages me. Surges into we've been seen chooses to raise threat by 3 to 44.  Servant of sauron is forced to attack . Take undefended. Shadow (catacombs) no shadow.  2 damage on eowyn. \n\nThreat is 4 vs 11 wp. Quested successfully so hirgon responds playing meneldor discounted. 7 progress made clearing stage 3. \n\nReveal stage 4. Adds ulchors agent to staging (doesnt trigger when revealed). CG 45.\n\nEngagement ulchors agent engages. \n\nDeals shadow cards \n\nTake servant of Mordor undefended. Shadow (streets of ulfast) return attacker to staging. But he then engages again. \n\nMelendor defends kings elite for 1 def. Shadow (kings lawn) no shadow. Kills meneldor and eagles of misty mountains grabs it. Adds 1 resource to stage 4 (total 1 CG 40)\n\nMarksman of lorien defends messenger from Mordor for 0. Shadow (kings elite) makes additional attack. Kills marksman. Plays last stand to put 3 damage on messenger. \n\nAdditional attack from messenger from Mordor Defended by eagles of misty mountains for def 5. Shadow ( crowded market) no shadow.\n\nUlchors agent attacks undefended. Shadow (extra vigil) no effect. 3 damage on theoden. \n\nRefresh. Threat increases to 45. Add 1 resource to stage 4. (Total 2 CG 35)\n\n \n\nTurn 8\n\nDraws knight of minas tirith. \n\nGoing to scoop. Got to make 20 progress on stage 4 and 20 damage on a 4 def city guard immune to card effects. have 4 enemies engaged already. 1 ally out and 3 heroes with 2 heroes 1 hp from death. Only getting out 1 other ally per turn. card draw and resource gen is not currently enough. \n\nTough but inevitable end. I really had hope mid game. I saved eowyns attack ability for city guard but even if I had used it earlier on the kings elite it wouldnt have helped later in the long run against city guard. \n\nTill the next time.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922785","commentId":3922785,"userName":"asgardianphil","timestamp":1585790408,"content":"Next deck will be Gondor- Erestor in Ulfas. \n\n👍"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922862","commentId":3922862,"userName":"Alonewolf87","timestamp":1585812009,"content":"> 6 hours ago, asgardianphil said:\n> \n> Take servant of Mordor undefended. Shadow (streets of ulfast) return attacker to staging. But he then engages again. \n> \n> Melendor defends kings elite for 1 def. Shadow (kings lawn) no shadow. Kills meneldor and eagles of misty mountains grabs it. Adds 1 resource to stage 4 (total 1 CG 40)\n> \n> Marksman of lorien defends messenger from Mordor for 0. Shadow (kings elite) makes additional attack. Kills marksman. Plays last stand to put 3 damage on messenger. \n> \n> Additional attack from messenger from Mordor Defended by eagles of misty mountains for def 5. Shadow ( crowded market) no shadow.\n> \n> Ulchors agent attacks undefended. Shadow (extra vigil) no effect. 3 damage on theoden. \n> \n> Refresh. Threat increases to 45. Add 1 resource to stage 4. (Total 2 CG 35)\n\nAnd I also think that since the number of resources on the quest change during the combat phase City Guard should still have attacked you (albeit without a shadow card) since it was not considered engaged and the Enemy Attacks step was not finished.\n\n> 6 hours ago, asgardianphil said:\n> \n> Tough but inevitable end. I really had hope mid game. I saved eowyns attack ability for city guard but even if I had used it earlier on the kings elite it wouldnt have helped later in the long run against city guard. \n> \n> Till the next time.\n\nToo bad sorry."},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922863","commentId":3922863,"userName":"asgardianphil","timestamp":1585812257,"content":"> 1 minute ago, Alonewolf87 said:\n> > 6 hours ago, asgardianphil said:\n> > \n> > stage 4. (Total 2 CG 35)\n> \n> And I also think that since the number of resources on the quest change during the combat phase City Guard should still have attacked you (albeit without a shadow card) since it was not considered engaged and the Enemy Attacks step was not finished.\n\nDarn it, yes you are right. It's considered to be engaged rather than actually engaging. I missed that. Too much going on on the board. So, the quest Freight trained me for sure. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922866","commentId":3922866,"userName":"Alonewolf87","timestamp":1585812584,"content":"> 6 hours ago, asgardianphil said:\n> \n> Turn 2\n> \n> Draws legolas.\n> \n> Quest with eowyn, hirgon, theoden and eagles of... for 13 wp.  Stages patrolling the city treachery. Resolves travel effect of catacombs. Discards we've been seen. Phew! Theat 4 vs 14 wp quested successfully so hirgon responds playing grimbold discounted. 10 progress made. Clears catacombs and stage 1. Reveals stage 2 and chooses to raise threat by 5 to 33.\n> \n> Refresh. Threat goes up to 34 add 1 resource to stage 2 (total  2 CG 40)\n\nPerhaps here you could have played it a bit more safely by not sending the eagle to the quest and revealed the encounter card if you passed the stage, so that even if it was an enemy you would have had a defender and you would have kept a lower threat.\n\nTalking in general perhaps (besides the awful draws) you rushed a little bit too much in the first 4 turns without building up that would have helped you killing more enemies later on.\n\nIf you play on OCTGN and you want someone to assist and talk with you during a game to better spend the time let me know, lately I am basically glued to my PC 😄\n\nEdited April 2 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922959","commentId":3922959,"userName":"asgardianphil","timestamp":1585840974,"content":"> 7 hours ago, Alonewolf87 said:\n> \n> Perhaps here you could have played it a bit more safely by not sending the eagle to the quest and revealed the encounter card if you passed the stage, so that even if it was an enemy you would have had a defender and you would have kept a lower threat.\n> \n> Talking in general perhaps (besides the awful draws) you rushed a little bit too much in the first 4 turns without building up that would have helped you killing more enemies later on.\n> \n> If you play on OCTGN and you want someone to assist and talk with you during a game to better spend the time let me know, lately I am basically glued to my PC 😄\n\nYou're right, and I did think long and hard at that decision, I didnt rush it. My decision though was motivated by two things:\n\nfear of drawing any card but mostly another location due to the fact that on the following stageing I'd draw yet another location (a lot of my games have ended in location lock on this quest due the city guards threat hike and the streets of ulfast that match him), and\n\nfear of the resource engine on the quest which as I just mentioned adds masses of threat but also lowers the engagement of city guard.\n\n \n\nThe other things that went through  my mind at that decision point was:\n\nI was hopeful of getting one of the three gandalfs to lower my threat\n\nthat I wasnt generating enough resources (I almost put in a couple copies of horn of gondor) to dump a load of allies.\n\nThe allies in the deck were costly and the discount of hirgon requires a successful quest.\n\nSo, I over quested thinking to rush each stage with high wp and chump (mikeGracey's advice, which made sense to me) to keep the city guards threat low and engagement cost high by clearing the stages resources. I put more eagles in the deck for their quest power and then to buff up misty eagles for attacking city guard and using chumps to defend obviously. When I first played this deck I was surprised at how much quest power it had, but quickly came to realise that was only the quest power it had. Eagles fit the bill for hirgon and was doing really well but I needed more card draw and more resources. \n\nLooking back i did make a mistake with totalling wp should have been 13 wp and 9 progress not 14 wp and 10 progress.\n\nSo, Catacombs ate up 4 and the stage took 1 meaning an over quest of 4 threat (enough for another staged catacombs) but without misty eagles' 2 will power if another catacombs had come out I'd  not have cleared the stage. \n\nAs it turns out if I had of drawn a card instead of the 5 threat hike I'd have drawn under guard and put out side street. But in another couple of turns I'd still have been overwhelmed by enemies and city guard. This deck was only capable of putting out 1 maybe two allies a turn.  \n\nSeriously all that went through my mind at that point. 😃\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3922961","commentId":3922961,"userName":"asgardianphil","timestamp":1585841181,"content":"> 7 hours ago, Alonewolf87 said:\n> \n> If you play on OCTGN and you want someone to assist and talk with you during a game to better spend the time let me know, lately I am basically glued to my PC 😄\n> \n> Edited 7 hours ago by Alonewolf87\n\nCheers for the offer, unfortunately I dont have a pc or laptop so no octgn. I just use my mobile for most things, (which is why my grammar and caps use is poor on these forums.) If I was at PC I'd take a little more care with it all. 😃"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3923400","commentId":3923400,"userName":"asgardianphil","timestamp":1585926875,"content":"New game\n\nErestor in Ulfas.\n\nA deck created by Alonewolf87.\n\nThis deck looks really exciting putting it together. A strong leadership resource pot of gondor allies brimming with synergy.. Can't beat city of ulfast? Gondor will see it done.\n\nWe shall see.\n\nAlso this deck contains a few cards I've never yet used.\n\nSet up... Plays Erestor, Leadership Denethor and boromir.\n\nThreat 29\n\nDraws: warden of healing, wealth of gondor, envoy of pelargir, citadel custodian, ancestral armor, herald of anorien.\n\nI'm guessing my mulligan choice depends on how much of this I can play turn 1 due to erestors discard. I think I'll loose the warden and ancestral armour if i dont play them but if i play ancestral then i still loose the warden.\n\nGoing to mulligan for steward of gondor.\n\nDraws: faramir, man the walls, heir of mardil, ioreth, citadel custodian, herald of anorien.\n\nThe other hand was better. But had better cards to loose.\n\nSet up: adds 2 resource to Denethor. Add crowded market to staging.\n\n \n\nTurn 1\n\nDraws: woodmens clearing. Erestor draws: errand-rider, mablung, knight of the white tower. Plays: man the walls, faramir (discounted), Ioreth, errand-rider (moves erestors resource to boromir), herald of anorien ( doomed 2 to play mablung for free) threat now 31. Then play citadel custodian for free (5 gondor allies) and woodmans clearing on crowded market. That leaves just 2 cards that are unplayable; heir of mardil and knight of white tower.\n\nQuest: Erestor, herald of..., mablung for 5 wp. Stages patrolling the streets. Add 1 resource to stage 1 (total 1 CG 40) faramir exhausts +3 wp. 4 threat vs 8 wp. = 4 progress on stage 1.\n\nRefresh: threat now 32. Add 1 resource to stage 1 (total 2 CG 35). Erestor discards 2 cards.\n\n \n\nTurn 2\n\nDraws: soldier of gondor, man the walls, veteran of osgiliath, citadel custodian.\n\nPlays man the walls and soldier of gondor (discounted) searches and pulls squire of the citadel (the only ally). plays citadel custodian for free. Plays squire of...\n\nQuest: erestor, herald of..., mablung, x2 citadel custodians for 7 wp. Stages streets of ulfast x =2. Threat 6 vs 7 wp. (Don't need to use faramir here) 1 progress on stage 1 clearing it. Reveals stage 2 and reveal an encounter card: we've been seen: yikes possibly the worst treachery as I have 9 allies in play. I'll take the city guard attack. Squire of.. steps up and defends for 1. Shadow (extra vigil) not good! Attaches to city guard. (CG 25) Kills squire of... and he adds 1 resource to boromir.\n\nTravel to crowded market (CG 55) and stages servant of sauron. ( incidentally I discarded 5 locations, 7 treacheries and 2 side quests before the enemy showed up) servant of sauron engages me immediately.\n\nEngagement: no other engagement.\n\nCombat: Denathor defends for 3. Shadow (patrolling the streets) +0 attack. Boromir and faramir attack and kills servant of sauron.\n\nRefresh: threat now 33. Adds 1 resource to stage 2 (total 1CG 50). Erestor discards 1 card.\n\n \n\nTurn 3\n\nDraws: warden of healing, veteran of osgiliath, wealth of gondor, visionary leadership.\n\nPlays wealth of gondor adds 1 resource to boromir, warden of healing, visionary leadership on boromir. Leaving 2 resources on boromir only.\n\nQuest: erestor, herald of.., mablung, citadel custodian x2 for 11 wp. Stages side street. Exhausts farimir. Threat 7 vs 16 wp. = 9 progress (2 on crowded market 7 on stage 2). Explores crowded market. (CG 30). Woodmens clearing reduces threat by 3 now 30.\n\nTravels to streets of ulfast and threat increases by 2 now 32. City guard is considered engaged.\n\nCombat: errand rider defends for 0. Shadow (messenger from Mordor) +1 att. Kills errand-rider. Boromir, soldier of gondor, warden of healing and Denethor attack city guard for 7 att. 3 dam on CG. Raise threat to 33 to remove extra vigil. (CG 40)\n\nRefresh. Threat now 34. Add 1 resource to stage 2 (total 2 CG 35). Erestor discards 1 card.\n\n \n\nTurn 4\n\nDraws: gaining strength, citadel custodian, herald of..., warden of healing.\n\nPlays gaining strength on boromir. Plays citadel custodian for free. Plays herald of... (not going to raise threat to play warden of healing (Erestor only has 1 resource))\n\nQuest: Erestor, x2 heralds of..., mablung, and x2 citadel custodians for 13 wp. Stages the kings lawn. Exhaust farimir (otherwise won't clear the active location) + 6 wp. Threat 9 vs 19 wp. Makes 10 progress (5 on streets of ulfast and 5 on stage 2 clearing it CG 45) Reveals stage 3 chooses city guard to attack. Citadel custodian defends for 1. Shadow (catacombs) no shadow. Citadel custodian killed.\n\nTravel to kings lawn adds 1 resource to stage 3 (total 1 CG 40).\n\nRefresh: threat now 35. Adds 1 resource to stage 3 (total 2 CG 35) Erestor discards 1 card.\n\n \n\nTurn 5\n\nDraws: visionary leadership, errand-rider, steward of gondor and wealth of gondor. Plays wealth of gondor on boromir.\n\nPlays steward of gondor on boromir paid by Denethor. Plays errand-rider. Exhaust steward\n\nQuest: Erestor, x2 heralds of.., mablung, citadel custodian for 11 wp. Stages kings elite. Exhausts faramir + 5 wp. Threat 9 vs 16 wp. Making 5 progress clearing active location.\n\nEngagement. Kings elite engages and city guard is considered engaged.\n\nCombat. Citadel custodian defends kings elite ( too risky to use denethor) for 1. shadow (messenger from Mordor) +1 att. (Would have killed Denethor). Kills citadel custodian and adds 1 resource to stage 3 (total 3 CG 30). Errand-rider defends city guard for 0. shadow (we've been seen) +1 att and splash damage (!!!) 10 att - 2 hp. Kills errand-rider and 8 damage to be splashed. (Damage- 3 boromir, 3 errestor, 2 faramir) Borromir, denethor, soldier of..., warden of healing att kings elite for 7 killing it. Ioreth spends a resource to heal boromir.\n\nRefresh. Theat now 36. Adds 1 resource to stage 3 (total 4 CG 25). Erestor discards 1 card.\n\n \n\nTurn 6\n\nDraws: gaining strength, errand-rider, ancestral armor, herald of... Plays gaining strength on boromir. Exhausts steward of... 2 resources on boromir. Plays ancestral armor on Denethor. Herald of..., and errand-rider. Leaves 1 resource left on boromir. Iroeth spends a resource to heal Erestor.\n\nQuest erestor, x3 heralds of.., and mablung for 11 wp. Stages kings elite. Exhausts faramir + 5 wp. Threat 11 vs 16 wp. Makes 5 progress on stage 3.\n\nEngages kings elite.\n\nCombat: Denethor defends for 5. Shadow ( ulchors agent ) +1. So 1 damage on Denethor. Adds 1 resource to stage 3 (total 5 CG 20) Errand-rider defends city guard for 0. Shadow (under guard) no active location, no effect. Kills errand-rider. Borromir, warden of.., citadel custodian and soldier of.. all attack kings elite for 7 killing it.\n\nRefresh. Threat now 37. Adds 1 resource to stage 3 (total 7 CG 15). No cards to discard.\n\n \n\nTurn 7\n\nDraws: squire of the citadel, man the walls, steward of gondor and warden of healing.\n\nPlays man the walls to discount warden of healing. Plays squire of the citadel. Exhaust steward of gondor. Exhaust 1 warden of healing to heal Denethor and faramir.\n\nQuest, Erestor, mablung and x3 heralds of.. and citadel custodian for 13 wp. Stages under guard. No active location so adds guarded archway. Exhaust faramir + 5 wp. Threat 12 vs 18 wp. 6 progress made on stage 3. (Total 11)\n\nNo travel.\n\nCombat: City guard attacks. Squire defends for 1. Shadow (ulfast sentry) no shadow. Kills squire adds a resource to boromir. Denethor, boromir, soldier of.., warden of.., attack city guard for 7. 3 damage (total 6)\n\nRefresh threat now 38. Adds 1 resource to stage 3 (total 7 CG 10) discards 1 card.\n\n \n\nTurn 8\n\nDraws: wealth of gondor, visionary leadership, woodman clearing and envoy of pelargir. Exhausts steward\n\nPlays woodmens clearing to guarded archway. Plays wealth of gondor on boromir. Plays envoy of pelargir adding the resource back to boromir.\n\nQuest erstor, warden of healing, mablung, x3 heralds, for 13 wp. Stages side street. Exhausts faramir + 5. Threat 16 vs 18 wp 2 progress made on stage 3 (total 13) No travel.\n\nCombat: city guard attacks. Citadel custodian defends for 1. Shadow (ulfast sentry) no shadow. Kills citadel custodian. Boromir, denethor, envoy, warden and soldier of.. attack for 9. 5 damage on city guard. (Total 11)\n\nRefresh. Threat now 39. Add 1 resource to stage 3 (total 8. CG 05). discards 1 card.\n\n \n\nTurn 9\n\nDraws: soldier of gondor, angbor the fearless, woodmens clearing and envoy of pelargir. Exhaust steward\n\nPlay envoy and add 1 resource back to boromir. Play angbor and soldier of gondor. He searches and pulls soldier of gondor. Play soldier of gondor. He searches and pulls knight of white tower Plays knight of tower all from boromir (now has 2 resources left) Plays woodmens clearing on a side street.\n\nQuest: Erestor, mablung, angbor, x3 heralds, and x2 envoys for 18 wp. Stages kings lawn. Exhausts faramir + 8 wp. Threat 20 vs 26 wp makes 6 progress on stage 3 clearing it. (CG 45) reveals stage 4. Adds ulfast sentry to staging.\n\nEngagement: Ulfast sentry engages. Choose his free attack. Denethor defends for 5 against 1 att. Shadow ( extra vigil) no effect.\n\nCombat: knight of the tower defends ulfast sentry for 3 def. Shadow ( we've been seen) +1 for a 2 att. No damage. Boromir and 3 soldiers kill sentry. (overkill, I know) Warden of healing exhausts to heal faramir. (Bit late but I was keeping warden incase i needed them for other things)\n\nRefresh: threat now 41 (kings lawn). Adds 1 resource to stage 4. (Total 1 CG 40) . Discards no cards.\n\nTurn 10.\n\nDraws:  squire of the citadel, gaining strength, steward of gondor, and envoy of pelargir. (1 card left in player deck) Exhaust steward of gondor. 2 resources on boromir.\n\nPlays gaining strength on Erestor. (For healing). Plays squire of .., and envoy of.., adding 1 resource back to boromir.\n\n(So 13 threat + 1 card and at least 1 city guard attack. Can I rush the quest and get all 20 (needing at least 33) done? Counting up and leaving a couple of defenders i can muster 47 wp using visionary leader and faramir)\n\nQuest: Committing erestor, angbor (doesnt exhaust as threat in valour), knight of.., mablung, ×3 soldiers of.., x3 heralds of.. and x3 envoys of.. for 29 wp. Stages ulchors agent. When revealed raises threat to 44. Exhaust faramir + 12 wp. Threat 16 vs 41 wp. 25 progress made on stage 4.\n\nTravel to kings lawn. Adds 1 resource to stage 4 (total 2 CG 35)\n\nEngagement. Ulchors agent engages and city guard is considered engaged.\n\nCombat: Denethor defends ulchors agent for def 5. Shadow (overwhelmed) , choose attacking enemy cannot be damaged rather than a threat 2 increase. No damage on Denethor. Squire of the citadel defends city guard for 1 def. Shadow (kings elite) makes an additional attack. Squire killed and gives 1 resource to boromir . Warden of healing defends second attack from city guard for def 1. Shadow (kings elite) another attack, again! This quest is turning on the screws. Warden killed. 2nd Warden of healing defends third attack from city guard for 1 def. Shadow (kings lawn) no shadow. Warden killed.  Boromir and angbor attack for 7. Putting 3 damage on city guard ( total 14)\n\nRefresh. Threat now 45. Adds 1 resource to stage 4 (total 3 CG 30). Discards 1 card.\n\n \n\nTurn 11\n\nDraws: faramir. Player deck empty.\n\nQuest: erestor, angbor (valour), mablung, and ×3 heralds of.. for 14 wp. Stages patrolling the streets. Add 1 resource to stage 1 (total 4 CG 25) and choose option for no progress on quest. Threat 13 vs 14 wp. 1 progress on kings lawn. Didn’t need faramir this time.\n\nCombat: Denethor defends ulchors agent for 5 def. Shadow (cat and mouse) no shadow. No damage. Envoy of... defends city guard for 0 def. Shadow (messenger from Mordor) +1. Kills envoy of pelargir. Boromir, faramir, angbor and knight of white tower attack city guard for 12 att. 8 damage so only 6 of it goes on city guard.\n\n \n\n25 progress on stage 4 and 20 dmage on city guard.\n\nI win, Gondor saw it done. Wow!\n\nFor Gondor! For Gondor! For Gondor!\n\nReally chuffed 🤣"},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3923405","commentId":3923405,"userName":"asgardianphil","timestamp":1585927342,"content":"Started the quest 19th February 2020. Completed it 3rd April 2020.\n\nWhat a journey.\n\nThanks everyone. And big huge thanks to Alonewolf87 who made sure I was not alone. \n\n \n\nThe deck you created flowed like a dream. It was dead simple and was designed to do one thing... dump 30 gondor allies on the table. Buff up their attack with boromir and buff up their quest with visionary leadership. Everything else was resource gen and healing. \n\nNo gandalfs, no unexpected courages, no magical rings. \n\nI'm really surprised it was leadership that came through, I was convince the winning deck was going to be questing spirit and beregond. \n\nI am over the moon. I could actually cry I'm so elated, and that is where the designers want us. It feels like I just walked through Mordor and chucked the ring into the volcano. \n\nI think I'm going to set up a thread right off the bat for the challenge of the Wainriders as I've enjoyed this threat so much and other people can join in. No Idea yet what is in store for me there. \n\nI'm going to have a few nights off before starting  the next quest as I've hammered this over the last couple of weeks. \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/306908-beating-city-of-ulfast/?do=findComment&comment=3923417","commentId":3923417,"userName":"Alonewolf87","timestamp":1585928732,"content":"> 45 minutes ago, asgardianphil said:\n> \n> I am over the moon. I could actually cry I'm so elated, and that is where the designers want us. It feels like I just walked through Mordor and chucked the ring into the volcano. \n\nI get it, some hard won victories can give you an unparalleled burst of happiness. I still remember my first win against Mount Doom 😄\n\n> 45 minutes ago, asgardianphil said:\n> \n> The deck you created flowed like a dream. It was dead simple and was designed to do one thing... dump 30 gondor allies on the table. Buff up their attack with boromir and buff up their quest with visionary leadership. Everything else was resource gen and healing. \n> \n> No gandalfs, no unexpected courages, no magical rings. \n> \n> I'm really surprised it was leadership that came through, I was convince the winning deck was going to be questing spirit and beregond. \n\nI am glad it worked out, in retrospect is probably a good play style against this quest: fast willpower and attack together as an all-in style. The only tweak I made on my usual Gondor - Erestor deck was the inclusion of the Woodman clearing since this quest cares a bit about threat (both as increases and with the quest resource mechanic). Sure including Erestor in a Gondor deck might be a little bit unthematic, but it really fixes the usual leadership sward deck main weakness in card draw (and Leadership resource generation and Gondor allies usual low cost goes quite well with Erestor decks weakness in having difficulties playing all the cards it draws).\n\nAgainst City Guard I guess chump-blocking is quite the effective strategy (you can think about it as drawing the guards attention somewhere else with a distraction) since to build up an uber-defender who can stand against it you have to put out some effort which you don't have lot of time to accomplish.\n\nEdited April 3 by Alonewolf87"}]}