{"url":"https://community.fantasyflightgames.com/topic/307065-attack-with-zero-character/","title":"Attack with zero character","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307065-attack-with-zero-character/?do=findComment&comment=3917333","commentId":3917333,"userName":"Corvin90","timestamp":1584786302,"content":"Hello,\n\n \n\nIs it possible to declare an attack with zero character ?\n\n \n\nThe online reference rules states\n\n \n\n> Quote\n> \n> The active player chooses 1 enemy with whom he or\n> she is currently engaged, and exhausts any number\n> of characters he or she controls to declare them as\n> attackers against that enemy.\n\nCan \"any number\" mean zero ?\n\n \n\nIf we look at the quest phase, the online reference rules states\n\n> Quote\n> \n> In player order, each player has an opportunity\n> to commit any number of his or her characters to\n> the quest.\n\nI am pretty sure that it is possible to commit zero characters to the quest, but the wording is not exactly the same : it can be interpreted as \"either don't use the opportunity to commit characters to the quest, or use the opportunity and commit any (at least one) number of characters to the quest\".\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307065-attack-with-zero-character/?do=findComment&comment=3917360","commentId":3917360,"userName":"sappidus","timestamp":1584794514,"content":"> 7 hours ago, Corvin90 said:\n> \n> Is it possible to declare an attack with zero character ?\n\nThis issue is problematic IMO.\n\nBefore addressing it head on, let me enumerate a situation where the issue is important: [EDIT: see postscript]\n\n * Player 1's only ready character is a ranged hero with a Rohan Warhorse. He has an engaged weenie enemy.\n * Player 2's characters are all exhausted. He has an engaged boss enemy.\n\nDuring player attacks, P1 can declare an attack against his enemy and kill it. But when P2's turn to declare attacks comes around, if one holds that a player cannot declare an attack with 0 characters, then he cannot declare an attack against his enemy, which further means that P1's ranged character cannot join in (RR 6.8.1 seemingly depending on 6.8b happening). So the boss takes no damage that round.\n\nIf instead P1 declares an attack against the boss with his ranged character (during P1's attack declarations step), then he can put some damage in on the boss, but if the boss survives, that character cannot ready with Rohan Warhorse, and thus P1's weenie takes no damage that round.\n\nOK, yuck. So what evidence do we have for the boldfaced assertion above?\n\nYou have quoted the relevant RR text (and the Learn to Play says the same thing). Here is a line from the original Core rules:\n\n> Quote\n> \n> In order to declare an attack, a player must exhaust at least 1 ready character.\n\nWell, that seems pretty definitive, heh. But the consequence is pretty displeasing to me.\n\nWhat do others think?\n\nEDIT: P.S. Actually, in the above scenario P1 can declare against his engaged enemy, kill it, ready, then declare against the boss enemy, which is fine. I still feel like I've run into situations in 3-player where being able to declare an attack with 0 characters would matter, though…\n\nEdited March 21 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307065-attack-with-zero-character/?do=findComment&comment=3917363","commentId":3917363,"userName":"sappidus","timestamp":1584795153,"content":"> 2 hours ago, Corvin90 said:\n> \n> Can \"any number\" mean zero ?\n\nThis is an ancillary point, and you are not even doing what I'm about to describe, but it brings up an issue that I have thought about before.\n\nOne could go looking around at the various cards that use the phrase \"any number\" or \"any amount\" in their text, in an effort to figure out what any really means. There are several, e.g., Heir of Mardil, ally Boromir. But while such evidence may be suggestive, it is dangerous to extrapolate what any means in card text to what \"any\" means in rules text. A good amount of the rules text is explanatory in nature, using regular English to convey its concepts, and I suspect that a fine-toothed combing of it whilst trying to apply card-text semantics to its words would yield many contradictions, simply because the card-text use of words like common words (like then) is in some ways quite different from colloquial English. So I would consider such analysis circumstantial evidence but not definitive.\n\nEdited March 21 by sappidus"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307065-attack-with-zero-character/?do=findComment&comment=3917391","commentId":3917391,"userName":"dalestephenson","timestamp":1584800622,"content":"it was very clear cut in the original rules, so one wonders if the rewording was an intent to broaden the possibilities, or just overlooked the possibility of a 0-character attack.\n\nThere are quest-dependent cases where the question also might matter.  For example in Journey to Rhosgobel two enemies can only be attacked by Eagles or ranged characters, allowing a 0-character attack declaration would let other players' ranged characters to take two bites at the apple.  I believe there's an enemy or two in other quests that can only be attacked by heroes, allowing 0-characters attacks would let ranged heroes take two cracks.\n\nThematically I am inclined to disallow it, simply because I don't think you should be able to \"join\" an attack when no characters are actually attacking!  \n\n "}]}