{"url":"https://community.fantasyflightgames.com/topic/307083-more-than-one/","title":"More than one","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917558","commentId":3917558,"userName":"rhtm70","timestamp":1584827154,"content":"Other than the Core Set have any of you bought more than one copy of an expansion or quest pack or do you just use proxies if you need more than three of a card for two or more decks?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917608","commentId":3917608,"userName":"Vince79","timestamp":1584833947,"content":"I bought more than one Core, but you could certainly use proxies.  There are plenty of cards that you probably wouldn't use otherwise.  Doubt if that would be allowed in a tournament or something like that though.  But it doesn't look like anyone is going to have any tournaments anytime soon anyway."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917611","commentId":3917611,"userName":"dalestephenson","timestamp":1584834588,"content":"I've bought additional copies of Heirs of Numenor and Race Across Harad and am looking for an additional copy of Steward's Fear -- but that's because of an unfortunate dog-related incident.  If I wanted to use more than 3 copies of a non-core card, I'd definitely go the proxy route.\n\nHowever, if you hated proxies and money/availability was no issue, which non-core cards would I actually want to run in more than one deck at a time?  Here's a few that come to mind:\n\nDaeron's Runes -- a few edge cases aside, every deck with Lore is better at 53 cards and 3x Daeron's Runes than at 50 cards and no Daeron's Runes.  Unless you never run two lore decks at the same time, extra copies would be handy (note -- the Starter Kit gives you an extra two of these).\n\nEnvoy of Pelargir -- such a cheap flexible ally for any deck with a noble, which is most decks.  (The starter kit gives you an extra two of these, too).\n\nAll the Outland allies -- just for the spectacle of constructing super Outlands via Stand and Fight\n\nElf-Friend -- not usually, but in my \"Dori helps Galadriel play Gandalf every turn\" extra copies of Elf-Friend (and Elven-king) would help me setup quicker!  This is true of any fellowship looking to get a card combo in play ASAP; dead cards later may be worth devoting the deck space to extra copies of the key parts.\n\nMagic Ring -- such a flexible, powerful card.  At limit 1 per deck you can support three decks, but what if you have four?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917637","commentId":3917637,"userName":"Bullroarer Took","timestamp":1584838618,"content":"I used to use proxies shamelessly, but only of the core cards.  Since the set included with the ill fated digital expansion I’ve only had to proxy Dwarven Tomb and Will of the West.  I will occasionally proxy a spoiled card, but I really try to resist."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917715","commentId":3917715,"userName":"NathanH","timestamp":1584869239,"content":"Apart from Daeron's Runes and some edge cases, the only card I regularly want to have more than 3 copies of outside the core set has been Keen As Lances, since if one player is playing a victory display strategy it is pretty much free goodies if everyone plays these. I guess maybe Warden of Healing too, because it is such a good card."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917773","commentId":3917773,"userName":"General_Grievous","timestamp":1584885213,"content":"Only accidentally when they shipped me an extra copy of wrath and ruin haha. I enjoy the deck-building challenges of limited number of powerful cards. That being said Steward's Fear for Outland super swarm (via stand and fight as mentioned above) and it's just a great pack in general with all good cards, Gondorian Shield is the single greatest defensive attachment in the game (even better without Gondor heroes or combined with Steward of Gondor) and Three Hunters deck is hogging all three copies forme currently, a good harvest is an excellent event and Mithrandir's Advice is possibly the best mono-Lore card in the game. \n\nI could also make a case for Dread Realm (because Elven Light and Sword-Thain are super popular cards) and The Mumakil because those allies are boss level amazing and with the Messenger of the King contract they are also some of the best heroes in the game now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917794","commentId":3917794,"userName":"Wandalf the Gizzard","timestamp":1584889092,"content":"This conversation reminds me of Matthew (from the Grey Company) and his massive collection of Core Sets!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307083-more-than-one/?do=findComment&comment=3917817","commentId":3917817,"userName":"Ywingscum","timestamp":1584895054,"content":"Proxies.  I buy everything once.  Except I have 2 cores, even then 1 old one from 2012, and a new style one.\n\nEdited March 22 by Ywingscum"}]}