{"url":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/","title":"Timing Questions...Messenger of the King Contract","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920066","commentId":3920066,"userName":"bdavis969","timestamp":1585282835,"content":"I have two questions about timing:\n\n1. When does the setup of MotK contract happen versus drawing of the hand?\n\n2. When does the setup of MotK contract happen versus the setup of The One Ring?\n\nI want to utilize Spirit Ally Bilbo (4 threat) so basically I want to see if this works?\n\nFirst, I thought Setup(s) happen after setting heroes and drawing a hand? So with that assumption, I set my heroes (up to 2), play MotK contract, draw hand (and take mulligan if necessary), do setup of MotK contract (make Bilbo a hero for 4 threat), and use Bilbo’s response to look for a pipe since he just entered play.\n\nIf all of those steps are correct, can I then do the setup for The One Ring and target Bilbo with The One Ring, since now he is a hero?\n\nThank you\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920149","commentId":3920149,"userName":"Alonewolf87","timestamp":1585300726,"content":"We asked Caleb a similar question about Messenger of Kings and the answer is that the setup effects of player cards occurs in step 7 of the general setup of the game, but after scenario setup\n\n> Quote\n> \n>  \n> \n> Setup effects are resolved during step 7 of the game Setup instructions. You should resolve player card Setup abilities after resolving the Setup instructions for the scenario. That does mean it is possible that you could draw your only copy of a card before that, so it is good to include multiple copies or have a back up plan. It also means that Guarded cards will pull cards from the encounter deck.\n> \n> Cheers,\n> \n> Caleb\n> \n>  \n\nSo in regards to your questions\n\n> 4 hours ago, bdavis969 said:\n> \n> 1. When does the setup of MotK contract happen versus drawing of the hand?\n\nAfter, so if you have already drawn your only copy of the ally the Contract will not work\n\n> 4 hours ago, bdavis969 said:\n> \n> 2. When does the setup of MotK contract happen versus the setup of The One Ring?\n\nIn theory they are both player cards so at the same time, so you choose the order.\n\n> 4 hours ago, bdavis969 said:\n> \n> First, I thought Setup(s) happen after setting heroes and drawing a hand? So with that assumption, I set my heroes (up to 2), play MotK contract, draw hand (and take mulligan if necessary), do setup of MotK contract (make Bilbo a hero for 4 threat), and use Bilbo’s response to look for a pipe since he just entered play.\n> \n> If all of those steps are correct, can I then do the setup for The One Ring and target Bilbo with The One Ring, since now he is a hero?\n\nIt seems correct, the only wrinkle, as I said, might be if Bilbo is in your hand when you start resolving the Setup player cards effects.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920317","commentId":3920317,"userName":"EBerling","timestamp":1585323556,"content":"> 6 hours ago, Alonewolf87 said:\n> \n> In theory they are both player cards so at the same time, so you choose the order.\n\n\nAs a bit of additional wrinkling, I think this is a debatable point.  While Caleb has apparently suggested that the One Ring's setup also occurs in Step 7 during the same time as Contracts (though I haven't actually seen this firsthand myself and don't have a direct link, so apologies if it was not the case, though lots of people have been talking about it), the actual rule book for Shadow in the East specifically says that the One Ring's setup occurs immediately after Heroes are put into play.\n\nThis leaves several possible resolutions to this direct conflict (Shadow in the East Rules - Step 2 VS Caleb's Response - Step 7):\n\n(1) Change One Ring's setup to Step 7: Take Caleb's response as an errata to the rules of SitE, and instead put the One Ring into play at Step 7.  The question, then, becomes what if the One Ring finds itself in a discard pile via some effect before Step 7 (e.g. Galdor or possibly encounter card effects revealed during Scenario Setup).  We know from rulings on Beorn that cards in the discard pile are considered to have \"blank\" text unless an effect specifically mentions it can be triggered while in the discard pile (e.g. Elven Light).  So, presumably, if it's sitting in the discard pile, you cannot put the One Ring into play and it's not necessarily clear that you can put into play should it happen to be in your hand either (the SitE ruels do not specify, but do say \"If more than one player has the One Ring in their deck...\" which suggests the One Ring needs to be in a deck and not in a hand / discard pile to put into play.  This would mean in these circumstances all of the Master cards in a player's deck would then become dead cards.\n\n(2) Split the One Ring setup into Step 2 and Step 7: Caleb's ruling parses the two set-up effects of the One Ring: the one that puts into play and the one that searches for a Master card.  Putting the ring into play should occur, as per the SitE rules, after putting heroes into play, but then you wait until later in Setup Stage 7 to search for the Master card and add it your hand.  The issue with this interpretation is that it isn't precisely what Caleb said, nor is there anything about the single Setup: text on the One Ring that would suggest it's resolved separately.  It's written as one Setup ability, and beyond that, a single sentence \"Attach to a hero you control and search your deck for a Master card.\" There's no reason to think these effects should be separated in timing, and it clearly wasn't the intent.\n\n(3) Retain full One Ring setup in Step 2: Caleb's response was incorrect, and should not include the One Ring.  It's setup should be entirely done during Step 2, as the rule book in Shadow in the East original suggests.\n\n\n\nI love this game and it has brought me an incredible amount of enjoyment in the short time I've owned it, but a lot of the rules and rulings are a total mess (e.g. like Loyal Hound + Archery damage -- I cannot make sense of how or why it works as ruled).  I think there's at least some reason to adopt any of the above positions, but (2) seems like more of a stretch than (1) or (3).  Given everything above, sorry Caleb, I think (3) is the right path forward regarding the One Ring and it's how I intend to continue using it.   But ultimately, I think it's up to each individual and play group to decide on which interpretation they find best, by whatever metrics they want to use.  The beauty of a cooperative game is that an issue like this is much less problematic than in a competitive game.  So there's that.\n\n \n\nEdited March 27 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920322","commentId":3920322,"userName":"Alonewolf87","timestamp":1585324321,"content":"> 7 minutes ago, EBerling said:\n> \n> (3) Retain full One Ring setup in Step 2: Caleb's response was incorrect, and should not include the One Ring.  It's setup should be entirely done during Step 2, as the rule book in Shadow in the East original suggests\n\nIf I have to say I think this might possibly be the most correct solution, as in by general rule player cards Setup should happen in Step 7, but The One Ring is an exception since the rulebook of A Shadow in the East clearly states otherwise.\n\nI have tried to ask Caleb a follow up answer to the ruling I mentioned before, regarding The One Ring and hero Setup effect (like Thurindir which in a previous ruling was mentioned pulling the side quest from the encounter deck before drawing the first hand), but still no answer on that front.\n\n> 11 minutes ago, EBerling said:\n> \n> I love this game and it has brought me an incredible amount of enjoyment in the short time I've owned it, but a lot of the rules and rulings are a total mess (e.g. like Loyal Hound + Archery damage -- I cannot make sense of how or why it works as ruled).  I think there's at least some reason to adopt any of the above positions, but (2) seems like more of a stretch than (1) or (3).  Given everything above, sorry Caleb, I think (1) is the right path forward regarding the One Ring and it's how I intend to continue using it.   But ultimately, I think it's up to each individual and play group to decide on which interpretation they find best, by whatever metrics they want to use.  The beauty of a cooperative game is that an issue like this is much less problematic than in a competitive game.  So there's that.\n\nYeah recently the rulings are starting to get confusing, not sure if it's because Caleb is busy with Marvel Champions/the game is going into an hiatus (and perhaps they are getting ready for a revamp of the rules, like with the stealth errata on reprints of old cards) or some other reason."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920331","commentId":3920331,"userName":"EBerling","timestamp":1585324669,"content":"> 8 minutes ago, Alonewolf87 said:\n> \n> If I have to say I think [3] might possibly be the most correct solution, as in by general rule player cards Setup should happen in Step 7, but The One Ring is an exception since the rulebook of A Shadow in the East clearly states otherwise.\n\n\nAgreed.  Just realized I had a typo in my initial reply, but I too meant to say that (3) seems like the best solution.  So I'm basically ignoring Caleb's ruling on this one and attaching and searching a Master card at Step 2 of setup as the SitE book suggests, because it's unclear how to handle all the other problems that emerge in (1) or (2) so it seems like more of a can of worms than a solution.  \n\nEDIT: this would, of course, mean that a Messenger of the King ally-hero could not be given the One Ring, since it's put into play five steps too early. \n\nEdited March 27 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920383","commentId":3920383,"userName":"bdavis969","timestamp":1585327822,"content":"In the same Shadow in the East rule book,\n\nUnder contracts:\n\nEach player may choose on contract to put into play along with his heroes at the beginning of the game with its \"A\" side faceup.\n\nUnder The One Ring:\n\nThe One Ring has Setup text that instructs you to attach it to a hero you control. This is done immediately after placing your starting heroes in your play area.\n\nSo you can argue that the \"along with his heroes\" wording of playing a contract should then execute the Setup before the \"immediately after placing your starting heroes\" wording of playing the The One Ring.\n\n \n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920395","commentId":3920395,"userName":"bdavis969","timestamp":1585328418,"content":"Since the argument is to honor The One Ring Setup as step 2, you can also argue moving the Contract Setup to step 2 as well, since it is a \"special player card\"? In which case my above argument would place contracts higher in play order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920443","commentId":3920443,"userName":"Alonewolf87","timestamp":1585333124,"content":"> 1 hour ago, bdavis969 said:\n> \n> Since the argument is to honor The One Ring Setup as step 2, you can also argue moving the Contract Setup to step 2 as well, since it is a \"special player card\"? In which case my above argument would place contracts higher in play order.\n\nFor The One Ring we have an explicit rule from the booklet, for the Contracts we have a rule that says to put them into play with the heroes (but does not reference their Setup effect) and a ruling (probably only about Contracts, but not definitely) from Caleb about Setup effect.\n\nBasically as EBerling was saying we have not some official clarification about this stuff and you can decide with your group how you want to resolve the matter, since it's a cooperative game where you all want to have fun together."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920451","commentId":3920451,"userName":"rees263","timestamp":1585333809,"content":"> 2 hours ago, EBerling said:\n> \n>  The question, then, becomes what if the One Ring finds itself in a discard pile via some effect before Step 7 (e.g. Galdor or possibly encounter card effects revealed during Scenario Setup).  We know from rulings on Beorn that cards in the discard pile are considered to have \"blank\" text unless an effect specifically mentions it can be triggered while in the discard pile (e.g. Elven Light).  So, presumably, if it's sitting in the discard pile, you cannot put the One Ring into play and it's not necessarily clear that you can put into play should it happen to be in your hand either\n\nThe relevant distinction is that effects only function on in play cards unless it's obvious from the effect that they are meant to work out of play. The One Ring's effect says to put it into play, so it obviously must work from out of play. As far as I know, this is the only card where there is any uncertainty about where it might come into play from, but I see no reason why this effect shouldn't function from anywhere - deck, hand, discard whatever.\n\nHaving said that, I'm in the camp that will be doing setup effects in step 2 until someone comes up with a compelling reason why I shouldn't and I'm not currently finding Caleb's ruling particularly compelling."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920453","commentId":3920453,"userName":"stimpaksam","timestamp":1585333839,"content":"> 4 minutes ago, Alonewolf87 said:\n> \n> Basically as EBerling was saying we have not some official clarification about this stuff and you can decide with your group how you want to resolve the matter, since it's a cooperative game where you all want to have fun together.\n\nEven when it becomes official I'm still going to house rule against it. I'm going trigger all player cards with Setup at Step 2. And you get to choose the order. I hate the idea that you need a \"backup plan\" in case you drew the ally you wanted to use with Messenger of the King. The whole reason I want to play with MotK is to use its effect. My backup plan would be to scope, reshuffle and try again? No thanks.\n\nPlus I also trigger The Grey Wanderer contract during step 2 but have the card read: \"Setup: Search your deck for a non-Guarded attachment...\" because I think this is how all this started."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920491","commentId":3920491,"userName":"bdavis969","timestamp":1585336811,"content":"Thank you to everyone who has commented on this subject. I get that I can create house rules, and I probably will because I find the idea of having a 4 threat Spirit Bilbo carry around The One Ring totally awesome. But I also wanted to see what the official rules were so maybe I can be following as many as possible."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920576","commentId":3920576,"userName":"rees263","timestamp":1585343638,"content":"It feels like it's been done to death at this point, but as I was just reading the rules booklet for The Road Darkens, I thought I'd share what it has to say about setup instructions:\n\n> Quote\n> \n> If a player card with Setup instructions is in a player's deck at the beginning of a game, that player searches his deck for that card and follows its instructions before drawing his first hand.\n\nNot that an expansion rule necessarily translates to the rest of the game, but I think it's pretty clear that at least originally, cards with Setup were intended to come out of the deck before draw/mulligan."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3920634","commentId":3920634,"userName":"dalestephenson","timestamp":1585349172,"content":"When contracts were introduced, the article introducing them also said they would be done in Step 2 with the heroes.  I too think this was a reaction to Guarded cards that Caleb chose to double down on, despite how ill-fitting it is in some cases.\n\nAnd the thing is, it wasn't even necessary.  An encounter deck *exists* at Step 2, the only possible wrinkle would be a Guarded card fetching an enemy/location that was supposed to be set aside when encounter setup happens.  But that would usually work against the player -- who chose the Guarded attachment in the first place -- I don't see why it's an issue that even had to be fixed."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3934674","commentId":3934674,"userName":"Yepesnopes","timestamp":1588665501,"content":"> On 3/27/2020 at 10:18 AM, Alonewolf87 said:\n> \n> We asked Caleb a similar question about Messenger of Kings and the answer is that the setup effects of player cards occurs in step 7 of the general setup of the game, but after scenario setup\n\nWith all due respect for Caleb he did not think his answer properly, he did not even had in mind the rules of the game when he did that.\n\nThis text is from the Black Riders box:\n\nNew Setup Instructions\n\nSetup instructions appear on some player cards and encounter cards in The Lord of the Rings: The Black Riders. If a player card with Setup instructions is in a player’s deck at the beginning of a game, that player searches his deck for that card and follows its instructions before drawing his first hand. Similarly, if an encounter card with Setup is in the encounter deck at the beginning of a game, search the encounter deck for that card and follow its instructions before resolving the Setup instructions on the quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3934857","commentId":3934857,"userName":"AllWingsStandyingBy","timestamp":1588696103,"content":"> 8 hours ago, Yepesnopes said:\n> \n> With all due respect for Caleb he did not think his answer properly, he did not even had in mind the rules of the game when he did that.\n> \n> This text is from the Black Riders box:\n> \n> New Setup Instructions\n> \n> Setup instructions appear on some player cards and encounter cards in The Lord of the Rings: The Black Riders. If a player card with Setup instructions is in a player’s deck at the beginning of a game, that player searches his deck for that card and follows its instructions before drawing his first hand. Similarly, if an encounter card with Setup is in the encounter deck at the beginning of a game, search the encounter deck for that card and follow its instructions before resolving the Setup instructions on the quest.\n\n\nTo be fair, I think those rules are pretty dated and I believe they exist from before the Set-Up Stage of the game was explicitly broken into 7 steps.  At this point, I *think* they only really exist to tackle the Boon cards of the Saga Campaign (I don't think any other player cards with Set-Up existed at that time).  Caleb's ruling does, however, contradict much more recent Set-Up rulings that have been put into place in alignment with the creation of the 7 Steps of Staging, such as Thurindir Hero (from the Harad Cycle) and The Master Ring which is from the most recent Deluxe of the current contract-containing cycle.\n\nFor what it's worth, it sounds like Caleb has been pondering this after discussions with @Alonewolf87 [https://community.fantasyflightgames.com/profile/329691-alonewolf87/], who posted here\n\n> Quote\n> \n> Caleb says he will take some time to check all the rules/rulings again when he has all his material available (since right now he is not going to the office to work) and look at the whole matter again.\n> \n> One thing he said is that if you Grey Wanderer a Guarded attachment which get some stuff out of the encounter deck which is then put aside during the quest card setup he would imagine that the Guarded attachment is put aside with the encounter card.\n\n\n\n\nWhich, given the caveat about Guarded attachments pulling stuff out before Quest Set-Up, sounds to me like Caleb is leaning towards returning all \"Set-Up\" effects to their proper place (generally, Step 2 of Set-Up), but is waiting until he gets back into the office to double-check everything and make an official ruling.\n\n\nFor what it's worth, my group has returned to resolving Contract Set-Ups, Thurindir, and the Master Ring back at Step 2 for now."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3939878","commentId":3939878,"userName":"Yepesnopes","timestamp":1589552819,"content":"It is good that Caleb is thinking it over, it was obviously a rushed answer.\n\nI have the Set Up stage of the game broken in 7 steps in the rules of my core box from 2013, which is before the release of the black riders saga box.\n\nIn any case, the unofficial-official ruling that Caleb did complicate things unnecessarily, it would be easier just errate the interaction between guarded attachments, the grey wanderer contract and set up encounter cards.\n\nEdited May 16 by Yepesnopes"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307221-timing-questionsmessenger-of-the-king-contract/?do=findComment&comment=3939886","commentId":3939886,"userName":"MikeGracey","timestamp":1589553569,"content":"I kinda wish you could just play a guarded attachment with grey wanderer for free. I mean, playing with 1 hero is a big disadvantage and having 1 guarded card attach for free would seem fair.\n\nWhile possibly helping the above rules, it would also add some more variety in attachment options. Seems like everyone takes strider, but throw the guarded cards in and now there are choices to be made."}]}