{"url":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/","title":"Solo League 20 -- WoR/Ered Mithrin with Mirkwood player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3924734","commentId":3924734,"userName":"dalestephenson","timestamp":1586218603,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the Ered Mithrin cycle. The quests are:\n\n1) Roam Across Rhovanion (AP #2)\n2) Fire in the Night (AP #3)\n3) Fate of Wilderland (AP #6)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Haldan, Thranduil, and Radagast.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.  This can be done *anytime* during setup.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Roam Across Rhovanion and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing The Fate of Wilderland it does not matter how many tokens I needed to defeat Fire in the Night.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside WoR/Ered Mithrin, Mirkwood and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\n5) Tiebreakers have frequently mattered in this league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from WoR/EM, Mirkwood or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from WoR/EM and Mirkwood. More is better.\n\n3rd) The number of heroes used from this list: Haldan, Thranduil, and Radagast. More is better.\n\n4th) The number of cards in the deck outside WoR/EM and Mirkwood. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Roam Across Rhovanion, Fire in the Night, and Fate of Wilderland. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in March's Solo League (if you didn't play or finish March's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for June's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in April's league. May's cycle will be chosen by the winner of March's league.\n\n7) Weekly deadlines will at 11:59pm Eastern on the 14th, 21st, and 28th. Only the final deadline really matters for scoring and cannot be extended -- the first two deadlines are only to be included in intermediate standings.\n\nRoam Across Rhovanion: April 14th\nFire in the Night: April 21st\nThe Fate of Wilderland: April 28th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1ThO_2LgNaF1zROfid28UajAeHLrJPHQXcBByBB3566k/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1ThO_2LgNaF1zROfid28UajAeHLrJPHQXcBByBB3566k/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results, but only the first entry will be considered for the competition itself.\n\nEdited April 15 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3924983","commentId":3924983,"userName":"player3351457","timestamp":1586275798,"content":"Point of clarity, would a loot deck count towards the tie break rules or not?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3925112","commentId":3925112,"userName":"dalestephenson","timestamp":1586290982,"content":"I'm going to rule that a loot deck is *not* considered part of the player deck and has no impact at all on tiebreakers.  A contract will also not be considered part of the deck either.  Further, I'm going to rule that *if* you do a MotK hero and have 50+ other cards in the deck, the MotK hero does not count as part of the deck for tiebreaker purposes.  However, it *will* count as a hero for tiebreak purposes.  If you can't use your designated MotK hero due to Caleb's stupid ruling, you may restart the quest at absolutely no penalty.  If you use the Master Ring, the Ring does not count as part of the deck (as long as there are 50+ other cards in the deck), but the selected Master card will be counted as part of the deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3925246","commentId":3925246,"userName":"player3351457","timestamp":1586308037,"content":"Two more points of clarification, if you don't mind...\n\n1) are spoiled, unreleased proxies allowed? If not, I already disqualified myself 😅\n\n2) I take it this is played in normal mode -- gold ring cards included and no extra resources besides the valar tokens?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3925295","commentId":3925295,"userName":"General_Grievous","timestamp":1586317527,"content":"Those are some great rulings and it helps out the more lackluster Burglar'a Turn Contract"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3925369","commentId":3925369,"userName":"dalestephenson","timestamp":1586343474,"content":"Since I didn't exclude spoiled content in the rules I will allow it, my inclination for future leagues would be to exclude spoiled player cards, but not contracts as those only affect setup.  I think if copies of a pack are circulating in the wild, as appears to be the case with Under the Ash Mountains, it should be considered released.\n\nYes, this is in normal mode, the escalating help from Grace of the Valar is intended to help you beat a quest without removing its most difficult cards.  You *may* play Nightmare quests instead of regular quests if you prefer (not an option with this cycle, obviously), but it would be purely to make it more interesting for yourself, it grants no tiebreak advantages."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3925928","commentId":3925928,"userName":"player3351457","timestamp":1586458275,"content":"Ok, time for my AAR!\n\nIt was fun to revisit these quests, especially with a new and improved Eagles deck. There was not much to report when it comes to scenarios 1 and 3 -- blew through them both without a whole lot of trouble. \n\nBut Fire in the Night... boy was that tough.\n\nI started with 0, 1, and then 2 tokens, each time for resources because I just couldn't get enough eagles in to balance everything. The constantly bad side quest flips were not helping. It was frustrating on 3 tokens because I thought I finally had it under control, and then a few too many attacks by the dragon beast had me reeling. I really thought my deck had it... it felt so close. I wanted to replay it on 3, but the rules are the rules.\n\nSo I jumped to 5 just to guarantee I could get through it. I took 2 cards and 3 resources. I played my cards, keeping 3 resources to put Descendant of Thorondor into play after questing successfully, courtesy of Hirgon, so that I could, in theory, place some damage on a new enemy. Alas, what should flip but Swarm of Bats... discard all the resource tokens. So, essentially, wiping out my 3/5 Grace of Valar.... 🙄 Annoying. But I knew I was close last time so I was hopeful and started playing through.\n\nIt was a slog, but I finally started staying on top of questing and clearing locations and side quests. Gwaihir got the Support of the Eagles, and could usually take the first and second shots of from the dragon without sweating (courtesy to a lot of eagles under Eagles of the Misty Mountains). I started using the Staff to ready eagles instead of lowering costs.\n\nGwaihir, as a whole, is... an interesting hero. He is a great early-mid round hero. Early game, he is a little weaker because eagles are expensive, and you can usually only get one ready out of him. Once you get eagles in and out, he is providing multiple actions each turn. But as the game turns into a marathon, he begins to slow down as you slowly run out of eagles and ways to get them in and out of play. You don't want to turtle for too long with him. He is definitely unique in that aspect of being an absolute powerhouse but only after setup and not for very long. I could tell in the three quests that I was coming to the end of his viability and had the urgency to end the quest as soon as possible because after the last of the eagles are gone... he is not readying again.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3927745","commentId":3927745,"userName":"dalestephenson","timestamp":1586980050,"content":"I decided to tweak my Radagast Eagles deck that failed against Angmar and try it out again, substituting Grimbeorn for Aragorn.  It was good enough to take down Roam Across Rhovanion with 0 tokens, though the stages came out in the best order, I think.  The other two players who have posted so far also took zero tokens, and are also using Radagast Eagles decks -- one with TaEowyn and Amarthiul, the other with the spoiled Gwaihir hero and Hirgon.  And their decks, not being bloated like mine, are ahead on tiebreakers (outside cards in parens):\n\n0 Thanee (12)\n0 player33514557 (14)\n0 dalestephenson (15)\n\nI also dusted off my Play Gandalf Every Turn deck, since it uses Thranduil, and turned it loose as well, it took zero tokens but does not count for the competition.  That got the Horn first so had extra reveals the rest of the quest, but managed to get Gandalf set up before it got location locked.\n\nTwo weeks remaining in the league, it's not too late to join."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3927798","commentId":3927798,"userName":"General_Grievous","timestamp":1586984785,"content":"I have one put together, just finding time to play it this month has been busy for me."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3928196","commentId":3928196,"userName":"General_Grievous","timestamp":1587075336,"content":"Alright I got some time and assembled my Burglar's Turn deck, it's definitely the most lackluster of the contracts for me but since it's ruled that the contract and loot deck aren't part of your deck I figured I would mash-up a Beorning/Eagle deck I had been working on with a Haldan Burglar's Turn deck and see what happened. Other than the contract and Loot deck I used no other cards outside of those cycles since most of the needed cards are contained within. \n\n \n\nRoam across Rhovanion went really well with me managing to get all three Skin-changers out pretty early and into Beorn and two Bears, that ended up being more of the focus then Eagles but Messenger Raven + Gleowine + Haldan did help summon most of my deck by end of game so that helped for options. My loot deck yielded Wizard's Pipe, Burning Brand and two weapons for Haldan which were quite helpful.  \n\nFirst quest 0 tokens used, now onto some crazy harder ones haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3928524","commentId":3928524,"userName":"General_Grievous","timestamp":1587154669,"content":"Super rough first go at the quest, I couldn't get any decent defenders into play and kept drawing useless at the time loot deck items, Hrogar's hill was destroyed after completing three side quests.\n\n \n\nTried again with 1 token and managed to get a much better system going, lots of locations for decent loot, plus three rounds back to back of Gwahir's Debt and Gandalf to soak up the dragon's attacks and by then I had a super powered Eagles of the Misty Mountains in play that was able to withstand the dragon. I literally finished with a single hit point left in Hrogar's Hill while Haldan dual-wielded Durin's Axe and Glamdring to strike the Dragon down. Awesome fun and first time trying this quest true solo, it was brutal haha.\n\nTotal tokens used: 1\n\nOnto the finale"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3928735","commentId":3928735,"userName":"General_Grievous","timestamp":1587222038,"content":"And The Fate of the Wilderland has been decided for my motley band. I managed to draw all three Forest Road travellers fairly early and use those to help quest successfully while a shape-changed bear and Radagast held off attacks, also the second Attachment I looted happened to be Radagast's Staff which was huge for playing Eagles the rest of the game. I had a primarily location and treachery based series of encounter draws and two of those were Dwarven Watchtowers which really helped me get the heroes defense up to 5 with the Goblin's Assault sitting at 12 at the end of the game. All in all I really enjoyed playing with the Beornings and the Woodman, two traits I haven't used before. The Woodman specifically had great synergy with A Burglar's Turn and that helps make that contract better, still not as good the others, but better haha. And if I'm going to be pillaging loot in the future I'll be sure to include them. \n\n0 tokens used for the final quest."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3929847","commentId":3929847,"userName":"dalestephenson","timestamp":1587550959,"content":"I haven't posted scores against Fire in the Night yet, but the other four players have (actually, they've all finished the league).  Here's how they did (outside cards in parens):\n\n0 Thanee (12)\n1 General_Grievous (0)\n4 Rob Logan (14)\n5 player33514557 (14)\n\nAnd cumulative through the first two quests:\n\n0 Thanee (12)\n1 General_Grievous (0)\n4 Rob Logan (14)\n5 player33514557 (14)\n\nStill a week left for me to catch up, and for any additional players to join up and knock off these three easy quests...."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3929853","commentId":3929853,"userName":"Alonewolf87","timestamp":1587553090,"content":"> 33 minutes ago, dalestephenson said:\n> \n> Still a week left for me to catch up, and for any additional players to join up and knock off these three easy quests....\n\nI had half a mind to try this time but I have seen that my deck would have been basically identical to General Grievous so I think I will pass and stay tuned for the next league.\n\nBy the way good job creating and hosting those, they are quite entertaining as deckbuilding and play exercises."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3929904","commentId":3929904,"userName":"General_Grievous","timestamp":1587571283,"content":"> 5 hours ago, Alonewolf87 said:\n> \n> I had half a mind to try this time but I have seen that my deck would have been basically identical to General Grievous so I think I will pass and stay tuned for the next league.\n> \n> By the way good job creating and hosting those, they are quite entertaining as deckbuilding and play exercises.\n\nYou should still try it, I had a rough go with fire in the night. Maybe you can do better "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932207","commentId":3932207,"userName":"dalestephenson","timestamp":1588170290,"content":"I ended up taking two tokens against Dagnir -- lost with zero tokens fairly easily, eked out a win with two tokens, I nearly threated out, but managed to keep combat under control with the help of Beorning Skin-changer (brought Beorn into play twice). I was almost in position to win with one token until I foolishly chumped a Dagnir attack with a Vassal, trying to boost my Misty's attack/defense (and therefore Grimbeorn's as well thanks to Support) to 8 -- the shadow let the excess damage be applied to the Hill, and sitting at 47 damage that was that.\n\nFate of the Wilderland was a close-run thing, I ended up having to use Landroval to rescue Grimbeorn en route to 15 progress token -- on the final turn I had 15 progress tokens against me, used Wizard's Pipe and Gwaihir's Debt (fetched the previous turn via Word of Command) to set up Gandalf and nuke the Stray Goblin from orbit to give me my fifth resource.  Then I just had to not get a progress token from Urdug's shadow or the encounter card, and I was finally able to squash him.\n\nMost of us were able to take Fate down with zero tokens:\n\n0 General_Grievous (0)\n0 Rob Logan (14)\n0 player33514557 (14)\n0 dalestephenson (15)\n3 Thanee (12)\n\nFinal Standings:\n1 General_Grievous (0)\n2 dalestephenson (15)\n3 Thanee (12)\n4 Rob Logan (14)\n5 player33514557 (14)\n\nGeneral_Grievous takes first and will choose the cycle for June's league\nI take second and get to choose a quest from that cycle\nThanee takes third and gets to exclude a quest from that cycle.\nplayer33514557 gets to choose a cycle for supplemental player cards.\n\nThank you for playing, and look for May's league on Friday.  We'll be returning to the Haradrim cycle for Long Arm of Mordor, Mumakil, and Black Serpent.\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932301","commentId":3932301,"userName":"General_Grievous","timestamp":1588180016,"content":"I think it would be fun to go back to the first cycle of the game and do some quests from Shadows of Mirkwood, especially since we have so many new players picking up the game, might be nice to make something they can try. Plus I have the nightmare versions of the quest haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932319","commentId":3932319,"userName":"dalestephenson","timestamp":1588185545,"content":"I will pick Journey to Rhosgobel.  It's a quest that encourages very specific deckbuilding, which should make the other two quests more of a challenge."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932364","commentId":3932364,"userName":"General_Grievous","timestamp":1588189454,"content":"> 1 hour ago, dalestephenson said:\n> \n> I will pick Journey to Rhosgobel.  It's a quest that encourages very specific deckbuilding, which should make the other two quests more of a challenge.\n\nAwesome choice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932582","commentId":3932582,"userName":"dalestephenson","timestamp":1588240061,"content":"Thanee has excluded Passage Through Mirkwood.  RNG picked Journey Down the Anduin and Escape From Dol Goldur.  I've never played Esacpe solo before... but with enough help from the Valar, I guess I will.  Mandatory heroes are core + Prince Imrahil\n\nOver to player 33514557 to pick the supplemental player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932666","commentId":3932666,"userName":"player3351457","timestamp":1588256307,"content":"Curse you Dagnir! It is your fault I am dead last in the league with my awesome eagle set!\n\nAm I allowed to pick a saga set? If so, I'd like to select the Two Towers boxes (treason of saruman/the land of shadow). \n\nIf not, I will select Angmar Awakened cycle."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932675","commentId":3932675,"userName":"dalestephenson","timestamp":1588257104,"content":"You are allowed to pick a saga set, but only each saga as a block (i.e. either LOTR or Hobbit).  Should I put you down for LOTR saga for supplemental player cards?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307511-solo-league-20-worered-mithrin-with-mirkwood-player-cards/?do=findComment&comment=3932755","commentId":3932755,"userName":"player3351457","timestamp":1588268573,"content":"yes!"}]}