{"url":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/","title":"The Three Trials","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927513","commentId":3927513,"userName":"Vince79","timestamp":1586922092,"content":"I've been stuck on The Three Trials for a little while now.  I play one handed solo progressive, and I know this particular quest is not friendly for one handed play, but that's  the way I play.  I know it is possible, because I've read others in the community who have done it.  I've been using variations of this deck here:\n\nhttps://masteroflore.wordpress.com/2014/08/04/theme-deck-the-three-trials/ [https://masteroflore.wordpress.com/2014/08/04/theme-deck-the-three-trials/]\n\nI just want to say I find this whole process incredibly annoying.  Yeah, if I keep at it, I'm sure I will beat it at some point.  But what makes it no fun at all is I know I'm just waiting for luck to bring about the right combination of encounter card draws (and random guardian/barrow combinations) that will let me win.  I might as well be rolling a couple of dice hoping to get boxcars.  Maybe the supposed LOTR LCG grandmasters can beat this quest 95% of the time, but I'd like to see how they do it.  I doubt very much that it's one handed.  For some reason, this is one of the favorite quests from the Ring-Master cycle, from what I've read, but I'm not seeing it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927533","commentId":3927533,"userName":"Alonewolf87","timestamp":1586930601,"content":"> 2 hours ago, Vince79 said:\n> \n> I've been stuck on The Three Trials for a little while now.  I play one handed solo progressive, and I know this particular quest is not friendly for one handed play, but that's  the way I play.  I know it is possible, because I've read others in the community who have done it.  I've been using variations of this deck here:\n> \n> https://masteroflore.wordpress.com/2014/08/04/theme-deck-the-three-trials/ [https://masteroflore.wordpress.com/2014/08/04/theme-deck-the-three-trials/]\n> \n> I just want to say I find this whole process incredibly annoying.  Yeah, if I keep at it, I'm sure I will beat it at some point.  But what makes it no fun at all is I know I'm just waiting for luck to bring about the right combination of encounter card draws (and random guardian/barrow combinations) that will let me win.  I might as well be rolling a couple of dice hoping to get boxcars.  Maybe the supposed LOTR LCG grandmasters can beat this quest 95% of the time, but I'd like to see how they do it.  I doubt very much that it's one handed.  For some reason, this is one of the favorite quests from the Ring-Master cycle, from what I've read, but I'm not seeing it.\n\nDo you want some suggestions while keeping the same hero lineup or can we change it?And if we change it are there some limitations?\n\nI have yet to play a progressive style one handed game against this quest, but I can definitely try it.\n\nEdited April 15 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927562","commentId":3927562,"userName":"Durins_Father","timestamp":1586947677,"content":"This is probably one of the most difficult scenarios to play true solo, and one that I will recommend playing 2 handed if that is an option. The final stage is way too brutal if you are unprepared, as you have to deal with all 3 Guardians at once. I have both a scenario analysis and a guide to deckbuilding on this quest on VotP, which might be worth looking at: \n\nhttps://visionofthepalantir.com/2018/08/02/the-three-trials/ [https://visionofthepalantir.com/2018/08/02/the-three-trials/]\n\nhttps://visionofthepalantir.com/2019/08/24/deckbuilding-the-three-trials/ [https://visionofthepalantir.com/2019/08/24/deckbuilding-the-three-trials/]\nNote that these articles also tend to assume there are multiple players in the game, as a true solo run has to rely on a lot of luck with the random enemies and locations for this quest. \n\nOnly solo playthrough I could find was this one: https://www.youtube.com/watch?v=OlDCm1TOYIU [https://www.youtube.com/watch?v=OlDCm1TOYIU]\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927605","commentId":3927605,"userName":"dalestephenson","timestamp":1586958959,"content":"We actually played this quest last month in the solo league, and the other two competitors took the quest out first try.  But neither was using a progression-style deck, one was using the new Saruman hero and the other was using a Vilya deck with Gandalf hero (Road Darkens was released later the same year, so wasn't available yet at the time Three Trials was released -- though it *was* released during the Ringmaker cycle, so if you played progression by cycle rather than by quest it would be available.)\n\nAs one of the most solo-unfriendly decks I think it's likely not one of the 95% quests, but like Escape From Dol Goldur, if the random order of barrows/guardians is setting you up for inevitable failure, why use random?  One-deck players in Dol Goldur routinely choose the prisoner, and just multiply by three to estimate the number of tries it would've taken normally.  You could do the same thing -- if you think you can't win unless the five-ally limit Barrow comes out in the first trial (for example), just choose that barrow and then estimate your number of real tries by three.  Life's too short to play out sequences you know are unwinnable."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927606","commentId":3927606,"userName":"dalestephenson","timestamp":1586959419,"content":"It's not a complete playthrough, but this is the write-up for General Grievous taking down the Trials:\n\n---\n\nFinal mission The Three Trials went much better, I chose the trials in this order: intuition, perseverence and then strength, drawing Wolf + Cave Barrow, Raven + Hill Barrow and then Boar + Stone. Worked out great as I was able to build up a major Ent force and then immediately progress through the last trial because it was during the combat phase that I gained the key. Allowing me to kill off the Wolf again once all three engaged me for the finale.\n\n----\n\nPlaying progression you aren't going to have an Ent army, but if you can put an army together you can kill one of the bosses immediately in the last trial, leaving only two bosses to attack you in the next round.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927609","commentId":3927609,"userName":"Alonewolf87","timestamp":1586960122,"content":"> 8 minutes ago, dalestephenson said:\n> \n> I chose the trials in this order: intuition, perseverence and then strength\n\nYes, with an ally swarm strategy keeping the Strength Trial for last is key (pun intended) to handle the last stage since you can advance in the player attacks portion of the combat phase (as you report) and kill one of the just come back three Guardians before the next round."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927613","commentId":3927613,"userName":"PocketWraith","timestamp":1586961216,"content":"This may be of interest: https://wardenofarnor.wordpress.com/2016/11/21/minor-challenge-solo-progression-three-trials/ [https://wardenofarnor.wordpress.com/2016/11/21/minor-challenge-solo-progression-three-trials/]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927682","commentId":3927682,"userName":"Vince79","timestamp":1586971804,"content":"> 11 hours ago, Alonewolf87 said:\n> \n> Do you want some suggestions while keeping the same hero lineup or can we change it?And if we change it are there some limitations?\n> \n> I have yet to play a progressive style one handed game against this quest, but I can definitely try it.\n\nI'm always open to any suggestions, and if you try it I'd be curious to hear what you think.\n\nI wrote that last night as a bit of a rant, I feel a little silly about it today.  I have a few ideas for other cards I want to try out that could be helpful.  I'm sure I'll get it sooner or later.  I'm just finding this  quest more annoying than fun.  It's not just the difficulty, it's also a little tedious to setup - plus you have to fiddle with the time counters on each of the guardians.\n\nI've read some people use Beregond instead of Prince Imrahil, but I find Imrahil defends just fine for the most part, plus he has some offensive punch that Beregond lacks.\n\n \n\n> 6 hours ago, Durins_Father said:\n> \n> Only solo playthrough I could find was this one: https://www.youtube.com/watch?v=OlDCm1TOYIU [https://www.youtube.com/watch?v=OlDCm1TOYIU]\n\nI didn't even know there were any one handed videos of this one.  That's not progressive though.  I appreciate the two handed suggestion, but I'm pretty stubborn about playing one handed.\n\n \n\n> 3 hours ago, dalestephenson said:\n> \n> like Escape From Dol Goldur, if the random order of barrows/guardians is setting you up for inevitable failure, why use random? \n\nDefinitely something to consider.  The Wolf Guardian/Stone Barrow combination is especially deadly to start out with.  I have been using the Intuition/Perseverence/Strength order."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927899","commentId":3927899,"userName":"Vince79","timestamp":1587007278,"content":"Finally got a win on my first try with Bob Piepho's deck from this thread here:\n\nhttps://boardgamegeek.com/thread/1230778/how-do-you-beat-one-solo [https://boardgamegeek.com/thread/1230778/how-do-you-beat-one-solo]\n\nI think it could even be improved a bit.  \n\nMaybe I should complain more often."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3927975","commentId":3927975,"userName":"Valhalla Gaming","timestamp":1587034806,"content":"Interesting how player count can warp experiences. When I played this with two players I found it to be wayyy too easy, and we beat it in one attempt on nightmare mode when we revisited it. The encounter deck itself is super weak, but I never considered how the final phase is hardest on a single player due to the bosses.\n\nI'd imagine that a solid way of handling the situation would be having a hero like Beregond, suited up with unexpected courage or some other means of readying him. A good option for quests with insane/abrupt combat spikes in difficulty is light the beacons, I can't really overstate how incredible that card is for enduring pressure and then being able to counter attack."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3928138","commentId":3928138,"userName":"Vince79","timestamp":1587061801,"content":"> 7 hours ago, programdude said:\n> \n> Interesting how player count can warp experiences. When I played this with two players I found it to be wayyy too easy, and we beat it in one attempt on nightmare mode when we revisited it. The encounter deck itself is super weak, but I never considered how the final phase is hardest on a single player due to the bosses.\n\nFrom what I've read, this is a very popular quest.  I'm guessing that comes mostly from people playing it in multiplayer.  You can lose all ways in solo, but I think location lock may be the biggest threat.  There's only one type of enemy in the encounter deck.\n\n \n\n> 7 hours ago, programdude said:\n> \n> I'd imagine that a solid way of handling the situation would be having a hero like Beregond, suited up with unexpected courage or some other means of readying him. \n\nA lot of people use Beregond for this one.  I think Prince Imrahil defends qutite well though, with some buffs.  He readies automatically if another character leaves play, and if you put Blood of Numenor on him (combined with Steward of Gondor) and Gondorian Shield, you can get a lot of defense out of him.  Throw in an Unexpected Courage or two and he can absorb a lot.  Plus Imrahil has the added bonus of packing more offensive punch when needed.  Plus pairing him with Eomer (also a nice offensive weapon) gives you a nice Leadership/Tactics combo."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3928160","commentId":3928160,"userName":"dalestephenson","timestamp":1587067934,"content":"> 1 hour ago, Vince79 said:\n> \n> From what I've read, this is a very popular quest.  I'm guessing that comes mostly from people playing it in multiplayer.  You can lose all ways in solo, but I think location lock may be the biggest threat.  There's only one type of enemy in the encounter deck.\n\nI've read people using this as a testing scenario for one-deck solo, but essentially just playing through the stage twos and omitting the final stage, which few all-around decks can handle.  Simply having a location-heavy encounter deck doesn't automatically threaten location lock in one-deck play, since as long as you can clear the active location you can travel to a new location.  Higher player counts can get location lock even when they quest well enough to clear the active location each turn.  All the locations in the encounter deck are 3-5 points, which is manageable enough; the obnoxious Time effects on the Guardians are the real stressors, I think."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3928230","commentId":3928230,"userName":"Vince79","timestamp":1587088318,"content":"> 5 hours ago, dalestephenson said:\n> \n> Simply having a location-heavy encounter deck doesn't automatically threaten location lock in one-deck play, since as long as you can clear the active location you can travel to a new location.  Higher player counts can get location lock even when they quest well enough to clear the active location each turn.  All the locations in the encounter deck are 3-5 points, which is manageable enough\n\nI wasn't saying location lock was a problem just because there are a lot of locations.  I've read a lot of complaints about location lock with this quest, and my personal experience has been that it is a problem.  The barrows and Hallowed Circle have very high quest points, although admittedly you don't have to clear all of them - you have to at least clear two of them.  Then there are three copies of Grim Foothills which requires you to clear its quest points before you can add any progress to the active location.\n\nI'm not saying those problems are insurmountable, but they come up sometimes.  I'm not convinced I have an optimized deck yet, so I'll probably be playing this one more until I feel like I have a good handle on it.  No doubt the location lock I've experienced is partly the fault of the cards I'm using.  I'm wanting to get Celebrian's Stone into the deck, for one thing.  Anyway, like I said, I've lost this one all sorts of ways - location lock, threating out, getting killed early on by repeated attacks from shadow effects.  And if you get the wrong random guardian/barrow combo at the wrong time, that can hurt.\n\nI agree the Time effects are obnoxious though, I don't even like fiddling with them. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3931416","commentId":3931416,"userName":"Vince79","timestamp":1587954295,"content":"> On 4/16/2020 at 7:00 AM, programdude said:\n> \n> I'd imagine that a solid way of handling the situation would be having a hero like Beregond, suited up with unexpected courage or some other means of readying him. \n\nAfter playing several more games of this wretched scenario, and using a variety of different decks, I want to retract what I said earlier.  I do think Beregond is a better choice than Prince Imrahil since he is a bit stouter on defense.  My last win used Aragorn, Eowyn, and Beregond as heroes, and I feel more comfortable with that deck than the others I've tried.  It at least has the tools to deal with all the problems of this quest, although there's no guarantee they'll come up before you need them.\n\nThat win happened to be pretty comfortable, but things can blow up pretty fast, depending on what kind of card draw (on both sides) that you get.  This has some nasty shadow and treachery effects that can really mess you up if you get them at the wrong time, and haven't drawn the spirit cards to cancel them.  On several occasions I've had a guardian attack three times in a row when I wasn't ready for it.  \n\nI also want to thank Dale for pointing out that you can kill one of the guardians when they all engage at once.  I hadn't really considered that the combat phase was still going on when you advanced to the 3A quest card (assuming you use the Intuition, Perseverence, Strength order).  That tip helps a lot."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307698-the-three-trials/?do=findComment&comment=3932505","commentId":3932505,"userName":"Vince79","timestamp":1588215325,"content":"Okay, I think I'm moving on from this awful scenario.  I don't think I can improve this particular deck much more.  It won't win every game, but it appears to have the most solid chance that I've found so far, at least the way I play.  This deck borrows from several other different players' decks, but I thought I would post it:\n\nHeroes: (3)\n1x Aragorn \n1x Eowyn \n1x Beregond \n\nAlly: (10)\n3x Galadriel's Handmaiden\n3x Envoy of Pelargir \n3x Gandalf \n1x Faramir\n\nAttachment: (21)\n3x Ancient Mathom \n2x Blood of Numenor \n2x Celebrian's Stone \n1x Gondorian Fire \n2x Gondorian Shield \n3x Dagger of Westernesse\n1x Path of Need \n2x Steward of Gondor \n2x Sword that was Broken \n3x Unexpected Courage \n\nEvent: (20)\n3x A Test of Will\n2x The Galadhrim's Greeting \n3x Feint \n3x Unseen Strike\n3x Hasty Stroke \n3x Sneak Attack\n3x Gondorian Discipline\n\n \n\nI would mulligan for some willpower help, preferably Celebrian's Stone, or you could run into location lock.  And it's best not to run into the wolf guardian before you're ready for it.  Steward of Gondor can go almost anywhere, I've used it on all three heroes successfully, depending on the situation."}]}