{"url":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/","title":"New player cards to fix old player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3927342","commentId":3927342,"userName":"player3351457","timestamp":1586887896,"content":"So I thought of this idea when I saw GrandSpleen's wish for a final contract. Here's the post:\n\n\"Ok I’ve got my final contract prediction. Gives us Gandalf the White and simultaneously rehabilitates BROK IRONFIST, yeah!  \n\nBeyond All Hope\n\nside A: when a hero you control is destroyed, this contract gains Forced: When a unique ally enters play under your control, flip this card to side B and attach it to that ally.\n\nSide B: Heroes cannot leave your discard pile via player card effects. Attached ally loses the ally type and gains the hero type. Treat attached character’s text box as blank, except for traits. Attached character gains Action: Exhaust Beyond All Hope to choose Willpower, Attack, or Defense. Add that character’s cost to the chosen attribute. Then, attached character cannot be readied by player card effects until the end of the round. If attached character leaves play, place this contract unattached and on side B next to your remaining heroes.\"\n\nThis absolutely does fix Brok and you could actually have a really good build around this. Beorn is worthwhile too, if you can finagle the skin-changer.\n\n \n\nAnyway, I had the idea of us creating a card that could single handedly fix other cards. Here are some ideas I have:\n\n1. Quick Cover (I am not going to be good at naming these)-- Lore, 1 cost, attachment.\n\nAttach to a hobbit hero.\n\nAfter you raise your threat by X from attached hero's ability, discard Quick Cover to draw X cards.\n\nFixes: Spippin, Fatty\n\nSupercharges: Sfrodo\n\n \n\n2. Many Thanks-- neutral, 2 cost, attachment.\n\nAttach to a character. If attached character is a hero, it gains the Gondor trait.\n\nAfter attached character adds its willpower, attack, or defense to another character, exhaust many thanks to ready the attached character. Attached character gains +1 willpower, attack and defense until the end of the phase.\n\nFixes: dori (+gondorian shield for massive bonus)\n\nSupercharges: galadriel+nenya, tale of tinuviel\n\n \n\n \n\n3. Buried Miner -- Leadership, 2 cost, 1, 0, 0, 2\n\nIf Buried Miner is discarded from the top of your deck, put him into play as if he were played from your hand. Then, he gains +1 willpower, attack, defense until the end of the round.\n\nResponse: When Buried Miner leaves play, add him to the victory display to choose a non-unique card in the encounter discard pile and add it to the victory display.\n\nFixes: The end comes, dwarf mining decks\n\nSupercharges: Rossiel, The Door is Closed\n\n \n\nEdited April 14 by player3351457\nMore space"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3927351","commentId":3927351,"userName":"Felswrath","timestamp":1586889761,"content":"How does Buried Miner help The End Comes?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3927353","commentId":3927353,"userName":"Flrbb","timestamp":1586889910,"content":"> 32 minutes ago, player3351457 said:\n> \n> . Many Thanks-- neutral, 2 cost, attachment\n\nalso supercharger for Rosie"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3927367","commentId":3927367,"userName":"player3351457","timestamp":1586891970,"content":"> 36 minutes ago, Felswrath said:\n> \n> How does Buried Miner help The End Comes?\n\nPull out whatever bad card you want from the discard pile and then dilute the encounter deck otherwise. Plus you have a dwarf already leaving play in order to trigger it.\n\nEdited April 14 by player3351457\nTypo"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3931606","commentId":3931606,"userName":"player3351457","timestamp":1588004892,"content":"Resist the Palantir - 2 cost, attachment, lore, unique\n\nAttach to Denthor or Aragorn.\n\nAttached character gets +1 willpower.\n\nResponse: While attached character is exhausted, deal one damage to attached character to cancel a treachery card just revealed from the encounter deck (limit once per round)\n\n \n\nFixes: Ally Denethor\n\nSupercharges: Lore Denethor and Lore Aragorn (red and purple aragorn probably would not make use of this ability)\n\nPerhaps not a perfect fix, but would at least prompt the carrying of ally denethor with this card as a way to cancel treacheries. Plus it mitigates ally denethor's discard effect. I'm not sure if you would use the willpower with lore denethor but the ability to choose to toss to the bottom or just straight up cancel would be helpful.\n\nI don't know if I should also include \"then reveal another encounter card\" as that essentially nonbos with lore denthor."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3931607","commentId":3931607,"userName":"player3351457","timestamp":1588005059,"content":"I also thought of\n\n\"Gondor will answer\" leadership, event 0 cost\n\nReduce the cost of the next Gondor ally you play by the willpower of the ally."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3931612","commentId":3931612,"userName":"General_Grievous","timestamp":1588005969,"content":"> 14 minutes ago, player3351457 said:\n> \n> I also thought of\n> \n> \"Gondor will answer\" leadership, event 0 cost\n> \n> Reduce the cost of the next Gondor ally you play by the willpower of the ally.\n\nBut isn’t it “And Rohan will answer?”"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3931614","commentId":3931614,"userName":"player3351457","timestamp":1588006618,"content":"> 10 minutes ago, General_Grievous said:\n> \n> But isn’t it “And Rohan will answer?”\n\nYes. I was trying to think of the line aragorn used in the two towers. \"Gondor will come\"?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307688-new-player-cards-to-fix-old-player-cards/?do=findComment&comment=3936237","commentId":3936237,"userName":"player3351457","timestamp":1588896432,"content":"Okay so I struggled a little bit on this one, and this is named purely out of lack of creativity. \n\nThree golden hairs -- unique, 0 cost, neutral, attachment.\n\nAttach to a hero. Limit 1 copy of three golden hairs in the victory display.\n\nResponse: when a player plays an event with printed cost X, add three golden hairs to the victory display to have each other player trigger the event themselves.\n\nVictory X.\n\n \n\nFixes: Gandalf's search, the white council\n\nSupercharges: reforged, stand and fight.\n\n \n\nThis still makes Gandalf's search and white council weak in solo play, and arguably people would just play this card for the supercharges. But at least individuals might be tempted to bring the events if someone ie running this card in a fellowship. "}]}