{"url":"https://community.fantasyflightgames.com/topic/307757-tireless-hunters-and-shadow-cards-when-engaging-from-staging-area/","title":"Tireless Hunters and shadow cards when engaging from staging area","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307757-tireless-hunters-and-shadow-cards-when-engaging-from-staging-area/?do=findComment&comment=3928186","commentId":3928186,"userName":"steve83","timestamp":1587072942,"content":"I used Tireless Hunters to bring down an enemy from the staging area that couldn't be optionally engaged. The card reads:\n\n> Quote\n> \n> Play only before the resolving enemy attacks step.\n> \n> Combat Action: Choose an enemy not engaged with you. Engage that enemy. Then, discard a shadow card from that enemy, if able.\n\nThis is my thinking: the enemy is brought down after shadow cards have been dealt, so I can't discard a shadow card from it. But when it attacks I will still have to deal it a shadow card, as it was never dealt one, and (I think) you have to deal a shadow card when an enemy attacks outside of the combat phase or makes an additional attack during the combat phase.\n\nSo my question is: when an enemy is pulled out of the staging area with this card, does it get a shadow card before attacking or not?\n\nEdited April 16 by steve83"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307757-tireless-hunters-and-shadow-cards-when-engaging-from-staging-area/?do=findComment&comment=3928189","commentId":3928189,"userName":"dalestephenson","timestamp":1587073949,"content":"I think not, if shadow cards have already been dealt it has missed its chance.  Note that if you borrowed it from another player instead of staging and it already has a shadow card, you can still discard it -- it doesn't get a new one to replace the one discarded."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307757-tireless-hunters-and-shadow-cards-when-engaging-from-staging-area/?do=findComment&comment=3928194","commentId":3928194,"userName":"steve83","timestamp":1587075130,"content":"OK, thanks.\n\nIn the end I dealt it a shadow card then discarded it, which was probably the wrong thing to do. (And I did this twice in the game.) It probably didn't matter too much in the end as neither of the discarded shadow cards were particularly bad cards.\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307757-tireless-hunters-and-shadow-cards-when-engaging-from-staging-area/?do=findComment&comment=3928390","commentId":3928390,"userName":"rees263","timestamp":1587136057,"content":"> 17 hours ago, steve83 said:\n> \n> you have to deal a shadow card when an enemy attacks outside of the combat phase or makes an additional attack during the combat phase.\n\nThis is correct, but when you engage an enemy with Tireless hunters neither of these applies (barring enemy or quest specific effects) - the enemy will just get a regular attack during the combat phase so it won't get a shadow card. If it did there would not be much point in the discard effect on the card."}]}