{"url":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/","title":"Top 5 PODs you want to see.","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929085","commentId":3929085,"userName":"Felswrath","timestamp":1587326192,"content":"What would be the top 5 PODs that you would want to see, but probably won't because of the hiatus. \n\nGenCon 2020 The Citadel of the Stars: First Competitive Gondor pack (Focus on Osgiliath) Alt Art Tactics Beregond\n\nFellowship 2021 The Contested Forest: Second Competitive Gondor pack (Focus Ithilien) Alt Art Spirit Frodo\n\nGenCon 2021 The Scouring of the Shire Alt Art Sam Gamgee\n\nFellowship 2022 The Battle of Dale (Epic mode quest) Alt Art Dain Ironfoot\n\nGenCon 2022 The Assault of Cair Andros (Epic mode quest) Alt Art Gandalf\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929175","commentId":3929175,"userName":"General_Grievous","timestamp":1587349157,"content":"Those are all excellent and logical next picks for PODs, that being said you said which ones we want to see so I'll put in my most hoped for packs:\n\n \n\n1. Scouring of the Shire, we all know we need it to truly complete the Sagas and take on the Isenguard villains one final time. Alt Art Pippin (since Merry already has a slightly battled up-looking version, and if they make it the spirit version they could errata it to make it actually good haha)\n\n \n\n2. The Islands of Tol Fuin and Himling, Dreamchaser competitive scenerio part 1, (with new ships!) where you are pursuing a fleet of corsairs north that have recently sunken a Gondorian ship laden with treasures north.\n\n3. Voyage to Forochel, a Dreamchaser sailing competive scenerio part 2, (also more ships) where freed captives of the corsairs who turns out to be members of the Forodwaith asks you to return them to the north. This could even lead into a brand new cycle of sailing, ice breaking and adventuring in the far north, one of the few unexplored realms.\n\n4. Defense of Lothlorien, epic multiplayer where you team up with Haldir and have to hunt down a growing number of enemies attempting to pass through and even eventually Assaultig your Elven realm.\n\n5. Pursuit of the Urak-Hai, one where you are leading a group of Rohan men led by Eomer to stop the enemy from reaching Isenguard, similar to the saga edition but much harder with an epic group fight at the end when you catch up.\n\n \n\nEdited April 20 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929180","commentId":3929180,"userName":"Felswrath","timestamp":1587350638,"content":"> 23 minutes ago, General_Grievous said:\n> \n>  \n> \n> 5. Pursuit of the Urak-Hai, one where you are leading a group of Rohan men led by Eomer to stop the enemy from reaching Isenguard, similar to the saga edition but much harder with an epic group fight at the end when you catch up.\n> \n>  \n\nI was thinking that an idea like this would be great seeing as we have only one non-Saga quests in Rohan. I'd personally prefer the battle at the Fords of Isen where Theodred dies, though."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929196","commentId":3929196,"userName":"AllWingsStandyingBy","timestamp":1587353416,"content":"I would really love to see two types of new PODS:\n\n(1) New Saga Quests (like Old Forest and Barrow-Downs) that add another quest to the Saga Campaign, also adding additional Boons/Burdens to be earned.\n\n(2) Campaign Rules added to turn the existing cycles into a campaign experience like the LotR Saga.  They could do a separate PoD for each of the existing cycles, and each pack could include a Campaign Mode Reference Card and Boons/Burdens added for each of the 9 Quests of a cycle.  Even if they did on average two Boons and two Burdens for each of the 9 quests, that'd be 45 cards in the PoD, still leaving about 20 cards to possibly add either a new type of campaign-only card OR to add a few new cycle-thematic player or encounter cards.\n\n\nAside from that, I don't really have much particular interest in one-off PoD questing experiences.  But I would buy the heck out of those two styles of PoD.\n\nEdited April 20 by AllWingsStandyingBy"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929208","commentId":3929208,"userName":"General_Grievous","timestamp":1587359342,"content":"> 2 hours ago, Felswrath said:\n> \n> I was thinking that an idea like this would be great seeing as we have only one non-Saga quests in Rohan. I'd personally prefer the battle at the Fords of Isen where Theodred dies, though.\n\nYes that would be great too! Side note for cycle requests for me it would be:\n\n-A daring Mordor raid/rescue if we don't get that in the final pack (getting inside the mountains on covert operations, maybe you Threat out at a lower number since you are in his realm)\n\n-Rohan proper one, basically hooking up with Eomer's band and rescuing villages, stopping war parties, assisting Lothlorien, and even intercepting a suspicious convoy bound for Isenguard. \n\n- Hobbit Chill Shire where you are literally living the Hobbit life and just let the Developers go wild with creativity and parties... hahaha jk but seriously something like aiding the the Hobvit sheriffs as they respond to crimes, then meeting up with Dunedain and uncovering plots and more dark enemies sneaking about, even helping protect Elves traveling to the Grey havens, and too aggressive trees near Farmer Maggot's house.\n\n- Dreamchaser 2.0 but to the North this time, so many more islands and people groups to explore, for bonus points they could also make up 4 new ships and allow them to be used in either sailing campaign. This could be the final cycle as your last mission you sail west across the sea with the elves. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929209","commentId":3929209,"userName":"Felswrath","timestamp":1587359626,"content":"> 2 minutes ago, General_Grievous said:\n> \n>  \n> \n> - Hobbit Chill Shire where you are literally living the Hobbit life and just let the Developers go wild with creativity and parties... hahaha jk but seriously something like aiding the the Hobvit sheriffs as they respond to crimes, then meeting up with Dunedain and uncovering plots and more dark enemies sneaking about, even helping protect Elves traveling to the Grey havens, and too aggressive trees near Farmer Maggot's house.\n> \n>  \n\nI would love to see a goofy Shire mission. Back in the day, I had suggested (and I'd still love to see it) a scenario in which we have to help Farmer Maggot guard his fields from thieving young Hobbits. The Big Bad of the scenario would be a young Frodo Baggins!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307840-top-5-pods-you-want-to-see/?do=findComment&comment=3929210","commentId":3929210,"userName":"General_Grievous","timestamp":1587360677,"content":"> 1 hour ago, AllWingsStandyingBy said:\n> \n> I would really love to see two types of new PODS:\n> \n> (1) New Saga Quests (like Old Forest and Barrow-Downs) that add another quest to the Saga Campaign, also adding additional Boons/Burdens to be earned.\n> \n> (2) Campaign Rules added to turn the existing cycles into a campaign experience like the LotR Saga.  They could do a separate PoD for each of the existing cycles, and each pack could include a Campaign Mode Reference Card and Boons/Burdens added for each of the 9 Quests of a cycle.  Even if they did on average two Boons and two Burdens for each of the 9 quests, that'd be 45 cards in the PoD, still leaving about 20 cards to possibly add either a new type of campaign-only card OR to add a few new cycle-thematic player or encounter cards.\n> \n> \n> Aside from that, I don't really have much particular interest in one-off PoD questing experiences.  But I would buy the heck out of those two styles of PoD.\n\nFair points, Scouring of the Shire would definitely fit that bill. I also think it would be really cool to have some of the side battles going on while the ringbearers and main heroes are taking the ring. Like Erkenbrand battling off Orcs before Helm's Deep, the aforementioned Fords of Isen, and even a post helm's deep pursuit into fangorn where you have to eliminate the fleeing orcs using the trees, and your forces to pincer and let none survive to spread more evil elsewhere. \n\nI'm also totally on board with campaign style upgrades to the base quests. Either they could make new quests and just reuse the encounter cards and tell their own story (especially in the case of the mismatched first and second cycle which aren't always heavy on connectivity or story), or just keep the quest cards the same and make it follow connecting rules and you gain boons and burdens based on choices. Things like gifts from the lady Galadriel and Celeborn after the core missions are complete but also a hunting Nazgul pursues you, and you know you are getting some emotional treachery card trauma from Dol Goldor haha.\n\nFor the next six quests, things like a ranger ally that starts aiding you in your search for Gollum, and Hunters that pursue you if they got any clues. As well as you having to keep the clues with you as boon player attachments so they would still get some bonus in future quests.\n\nCatC get some honey that can help heal/ready you. Burden of one of the trolls survivors and starts hunting you.\n\nRhosgobel would be awesome to have it be gained as player location that you could start from on your next quest and stop by when returning from mirkwood. Burdens of eagle dying PTSD for everyone.\n\nHills would need a bit of a work over as is without nightmare cards.\n\nDead Marshes, some otherworldly enemies haunting you, but perhaps some ancient weapons if you go puddle grave robbing.\n\nAnd return to Mirkwood is the end so only boon is some good rope to lessen the load from Gollum on solo players.\n\n \n\n> Just now, Felswrath said:\n> \n> I would love to see a goofy Shire mission. Back in the day, I had suggested (and I'd still love to see it) a scenario in which we have to help Farmer Maggot guard his fields from thieving young Hobbits. The Big Bad of the scenario would be a young Frodo Baggins!\n\nYes they would be a great intro mission, even the first couple could be just normal Shire stuff, defending against wolves, finding lost hobbits, helping fix up neighbours houses. Then like a Johnny Goblin fingers shows up and does what he does hahaha."}]}