{"url":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/","title":"Ranking Contracts","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929550","commentId":3929550,"userName":"GrandSpleen","timestamp":1587447761,"content":"There's still one unannounced contract, but I'm wanting to exchange thoughts with others on the contracts that we've got so far. So, here are the contracts, ranked for me in the order that I enjoy using them, along with my thoughts on them. Would love to see your own list and hear your thoughts.\n\n1. Council of the Wise: definitely going to be in the minority here, but I love this contract. It pushes you toward a deck type that's been almost entirely unseen in LotR LCG on two accounts: singleton decks, and event heavy. The only other event heavy decks I can think of are Silvan and victory display decks, but this is still a whole different beast. These decks are hard to build (mmm... time consuming to build, I should say) but I've built several so far and I'm just enjoying it.\n\n2. Burglar's Turn: I play exclusively multiplayer. When on my own, it's 2-handed solo, and I play 3- and 4-player events regularly. So, Burglar's Turn works for me. It's definitely got a \"solo-no\" quality, but that doesn't affect me. I've had a blast with this deck, adding some drama and shared enjoyment to the table in multiplayer games.\n\n3. Three Hunters: Straightforward and super thematic, but its setup time does push the deckbuilding toward redundancy (meaning: too many restricted attachments, eventually being cards you can't play). Still, the payoff is well worth it, and it brings the \"voltron deck,\" already a favorite of mine, to all new levels.\n\n4. Fellowship: Straightforward and thematic, and powerful. I like it. 'Nuff said.\n\n5. Messenger of the King: The most cardpool-enriching contract that we have seen, I suspect this will be the favorite of many. Somehow I have ended up liking it less than I expected to, but that's not to say I don't like it. It adds new heroes to the cardpool but doesn't really allow you to do things you couldn't already do without it--- it just enables shenanigans from turn 1 and saves you a hunt for an ally and sword-thain. Definitely unlocks a million decks you wouldn't have dared to build otherwise, just not my favorite.\n\n6. Grey Wanderer: I think I don't like it. It's the only contract I can say that about. I guess it should be seen as a Secrecy contract. I'm not a fan of Secrecy, it's never really landed with me.  If you don't think of it as Secrecy, then the contract can only be seen as compensating for what you're giving up by starting with only 1 hero--- and doing very little else for you (arguably nothing else at all).  I've spent a good deal of time deckbuilding with this contract at this point, without anything I'm really happy with.  Please convince me otherwise?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929619","commentId":3929619,"userName":"General_Grievous","timestamp":1587480902,"content":"1.  Three Hunters, this has been the most fun I have had playing LOTR LCG. It's a completely different experience and much more thematic for many missions with just three armed heroes instead of an army horde. And anything that boosts tactics up in solo is good in my book. Finally the options with 3-4 restricted attachments on one Hero has made for some sweet combos.\n\n2. The Burglar's Turn, it's definitely the weakest contract in my opinion as almost every deck has key attachments you lose out on by bringing this. But the fun of the random draw every turn more than makes up for it, they actually made the travel phase the most exciting phase of the game with this. And it's quite the deck-building challenge for true solo using some lesser-played cards to make it shine.\n\n3. The Grey Wanderer, similar to Three Hunters, a focus on only one starting hero really shakes the game up and presents a unique deck-building challenge, which Attachment do you start with? Which hero is strong enough to take on everything by himself (Haldir!) and how do you employ your secrecy mode (Haldir sniping, Treebeard power questing, Damrod/Faramir Traps, running a wizard).\n\n4. Messenger of the King, love how they really opened up the card pool with this one, and gave us tons of new \"heroes\". And some fantastic new secrecy heroes as well as key heroes are now available.\n\n5. Fellowship, another fun challenge with just uniques and a super thematic win.\n\n6. Council of the Wise, like MOTK I haven't used this yet (pack keeps getting delayed) but event focused is a trickier one for sure, but I already run a lot of one card each in my deck so it won't be a major shake up for my play.\n\nEdited April 21 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929655","commentId":3929655,"userName":"EBerling","timestamp":1587488765,"content":"I think Contracts are the best thing to happen to LotR LCG, givne how much additional design space and play experience they open up for players with just six (eventually seven) new cards.\n\nThat said, I'm not sure to rank them.  There are a at least three different metrics one might employ:  (1) How Powerful is the contract, (2) How much does the contract shake-up and re-invigorate deck-building/game-play, or (3) How fun is it?\n\nTake something like Messenger of the King.  It's an incredibly nice contract in that it adds a few dozen hero choices to the game, which is great for thematic and mechanical party-assembling reasons, but beyond that it's exactly like playing a standard game.  After the new hero choice, nothing changes.  On the other hand, Council of the Wise totally shakes up deck-building and makes playing the same deck again and again far more interesting and less stale, since you're not just relying on the same 15 cards (x3) to carry you through every quest.  On top of that, there is a meaningful decision added every time you play an event, and as a gamer I tend to really valuable having lots of meaningful decisions to make over the course of a game.  That said, MotK probably makes for a greater range of reasonably powerful decks, whereas CotW probably only has a few niche usages likely centered around Secrecy reuse of the same events.\n\n\nSo, given that, here's my take:\n\n\nLEAST FAVORITE to MOST FAVORITE\n\n6. Fellowship -- this is my least favorite contract.  It doesn't shakeup deck-building or deck-function that much, other then perhaps requiring a less thematic smattering of unique allies than a player might otherwise want in their ally pool.  It also feels like a \"win-more\" card to me.  Until you flip the contract you're basically playing a couple rounds of \"normal\" LotR LCG, but then once you flip the contract it's pretty much an auto-win at that point (but with six allies out, you were probably on a road to victory anyways).  Even if something takes one of your allies out of play, it's often trivial to just drop a new one and reflip the contract again.\n\n5. Burglar's Turn -- I've played a lot with this one in a 3-Player group, where I ran the contract and the other players ran the few key attachments my deck wanted/needed in order to play them on me, and we used tricks like Haldan and Strider's Path to really milk this contract.  Even in three player (where a contract like this should shine) it's \"meh\" and never really felt worth the trouble.  in theory, it makes traveling kind of exciting AND allows for using all these neat Guarded player cards no one ever uses.  Nevertheless, this Contract still rarely feels worth the trouble.  A lot of locations either (1) start as an active location already or (2) are immune to player card effects, both of which prevent this contract from doing anything.  Coupled with the fact that even in three player you might not see enough locations to travel every turn, and there's a lot of the game this contract isn't necessarily doing anything.  And even when it is firing, there's about a 50/50 shot you get a high quality item that changes the flow of the game (vs a nice but ultimately superfluous item that doesn't really matter whether or not you claim).  From a power-level perspective, I'd say that even when min-maxing the output of this contract, it's probably always slightly worse than not running the contract, and at best maybe a push (especially since many decks simply explore staged locations rather than waiting to travel to them and pay their travel cost).  Still, a fun option to have in the pool and it's great to use those Guarded cards sometimes. This contract would be a lot better if it also applied to locations that were immune to player card effects and/or if it triggered when a location became the active location (rather than just through traveling).  Those things alone would let this contract actually do something a lot more often than it can currently.\n\n4. Gray Wanderer -- I've played the most games with this contract, in part because I'm trying to see how far my Gray Wanderer deck can go on a true solo run (through HoN, minus Dol Goldur), but I suspect that most \"viable\" Gray Wanderer decks end up looking very much the same at the end of the day regardless of the hero: exploit Secrecy and big allies, use the Ring, etc..)  It's fun, but it's really repetitive in the game play experience.  It's also terribly hamstrung (at least in true solo) by the fact that a lot of quests or encounter cards don't scale well to a deck with only one hero (e.g. the \"prisoner\" in Dol Goldur, Sacked!, Lost and Alone, Biter Cold, enemies that can't be fought by allies, etc.).  Quite a few quest elements go from \"interesting/annoying element\" to \"you lose\" real fast when you only have a single hero in play, and that's kind of obnoxious to work around when trying to Gray Wanderer in solo (though also part of the challenge and fun).\n\n3. Forth, Three Hunters! a decent shake-up to deck-building, since allies are arguably the most powerful resource in the game.  Also far more thematic for most quests than \"a legion piles onto the raft and starts sailing down the Anduin,\" so at least two reasons to really like this one.  \n\n2. Messenger of the Kings -- A contract I really like that opens up so many new thematic hero line-ups, which is great, but beyond that isn't anything terribly novel or exciting.  Still, new heroes are arguable the most exciting part of any new pack, so having one card throw a few dozen into the mix is awesome and appreciated.\n\n1. Council of the Wise -- A really neat contract and makes playing the game a much more interesting and a less predictable/mechanical/reliable prospect.  To use a crude example, it weakens your deck's strategic strength while forcing you to contemplate and make a lot more tactical decisions than you normally would during the game.  That's one reason to love it, in theory.  Probably isn't that powerful outside of Secrecy decks that look to exploit the recycle cards, but as far as challenge and variety and offering a totally new feel to the game, it's great.  That staid, still haven't actually thrown a deck together using this contract despite several sessions of theory-crafting, but I like that it's out there to always think about and look forward to running.\n\n \n\nEdited April 21 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929681","commentId":3929681,"userName":"EBerling","timestamp":1587492162,"content":"B\n\n> 13 hours ago, GrandSpleen said:\n> \n> 6. Grey Wanderer: I think I don't like it. It's the only contract I can say that about. I guess it should be seen as a Secrecy contract. I'm not a fan of Secrecy, it's never really landed with me.  If you don't think of it as Secrecy, then the contract can only be seen as compensating for what you're giving up by starting with only 1 hero--- and doing very little else for you (arguably nothing else at all).  I've spent a good deal of time deckbuilding with this contract at this point, without anything I'm really happy with.  Please convince me otherwise?\n\n\nI think this is right.  It's absolutely a secrecy contract, and beyond that it's really a \"how much can you exploit Timely Aid?\" deck-building exercise, in my opinion.  Essentially, it's a blitz ally horde contract.  Which is fun and can be viable, but can get a little redundant and repetitive.  There may be lots of other ways to play this contract, but if so they haven't occurred to me yet.\n\nEdited April 21 by EBerling"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929707","commentId":3929707,"userName":"General_Grievous","timestamp":1587499154,"content":"We have definitely been house-ruling it that when a location becomes the active location you may attach a burglar's Turn card to it, as well as the old ruling about you are allowed to attach a card to immune to player effects locations (the old ruling being that the attachment doesn't affect the location but can benefit you, like the contract).\n\nEdited April 21 by General_Grievous"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929714","commentId":3929714,"userName":"EBerling","timestamp":1587502108,"content":"> 46 minutes ago, General_Grievous said:\n> \n> We have definitely been house-ruling it that when a location becomes the active location you may attach a burglar's Turn card to it, as well as the old ruling about you are allowed to attach a card to immune to player effects locations (the old ruling being that the attachment doesn't affect the location but can benefit you, like the contract).\n\n\nYea, those changes probably almost double the applicability of the Contract during the average quest.  Out of curiosity, above you described it as \"definitely the weakest contract,\" is that factoring in these house-ruled changes?  That is to say, do you think that even with this changes it's likely the weakest contract, or do you think it's only the weakest when it's played as-written (and these house-ruled changes bump it beyond that last place spot)?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929763","commentId":3929763,"userName":"Valhalla Gaming","timestamp":1587517834,"content":"Hard to say since I only have experience personally playing a few of them. I basically like them all, and even the one that I am not drawn to I still don't hate.\n\nWhile the Fellowship Contract was a pretty perfect first contract as it was simple but got the brain used to the idea of contracts and deck building around them. However whereas a lot of the contracts wildly open up deck design possibilities, the fellowship narrows them. Again I don't hate it but my brains reaction to the idea of building a fellowship deck is the most \"meh\". \n\nSurprised the Grey Wanderer has gotten such a meh response when its amazing in combination with heroes like Grimbeorn/Treebeard. And yes while secrecy is something that inevitably comes to mind, you can build a very nifty secrecy encounter deck control deck as opposed to just timely aid abuse. I'd say its just about my favorite, although  messenger of the kings will probably usurp it."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929819","commentId":3929819,"userName":"GrandSpleen","timestamp":1587534459,"content":"The contracts have definitely spurred a lot of novel decks for me personally. But another thing I really like about these is going back to one of my old tried-and-true \"pre-contract\" decks and then converting it into a contract deck using one that fits. The contracts even breathe life into old friends like that!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929851","commentId":3929851,"userName":"Alonewolf87","timestamp":1587552224,"content":"> On 4/21/2020 at 7:42 AM, GrandSpleen said:\n> \n> There's still one unannounced contract, but I'm wanting to exchange thoughts with others on the contracts that we've got so far. So, here are the contracts, ranked for me in the order that I enjoy using them, along with my thoughts on them. Would love to see your own list and hear your thoughts.\n\nIn general I found the Contracts the best new mechanic ever introduced in the game, period.\n\nThe Contracts I used more often and had more fun with are The Three Hunters and The Burglar's Turn. They force you to go outside the usual builds by basically removing two of your deckbuilding pillars. I really enjoyed the random aspect of The Burglar's Turn and how it let me use more easily the Guarded attachments. Also finally the Travel phase can be a little bit exciting\n\nThe Council of the Wise also intrigues me a lot but I still haven't had the time to extensively try it. I really really appreciate going outside the usual \"3x of each staple card\" approach and this finally enables it, though I can't still vouch for its efficacy.\n\nFellowship was probably a good example Contract, but while it can be higly thematic I found also to be the most \"flat\" of the Contracts.\n\nMessenger of Kings open a lot of heroes combinations but otherwise does not really shake up the deckbuilding.\n\nThe Grey Wanderer can be fun if one goes outside the usual Timely Aid/Strider builds but surely is heavily geared towards Secrecy (despite the threat cost of activating the contract itself.\n\nSo I guess my personal list in order from more to less appreciated would be\n\n1) The Three Hunters/The Burglar Turn\n\n2) Council of the Wise\n\n3) The Grey Wanderer\n\n4) Messenger of King\n\n5) Fellowship\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3929918","commentId":3929918,"userName":"General_Grievous","timestamp":1587574001,"content":"> 19 hours ago, EBerling said:\n> \n> \n> Yea, those changes probably almost double the applicability of the Contract during the average quest.  Out of curiosity, above you described it as \"definitely the weakest contract,\" is that factoring in these house-ruled changes?  That is to say, do you think that even with this changes it's likely the weakest contract, or do you think it's only the weakest when it's played as-written (and these house-ruled changes bump it beyond that last place spot)?\n\nIt's still the weakest I think, just base S off how important attachments are. Currently it's almost unplayable outside of decks that heavily focus on it or multiplayer ones, because many quests completely shut it down as well (ones where the active location is discarded when you travel to it and you replace it with another, or sometimes the quest card straight up replaces the active location, not to mention all the locations immune to player card effects. With the changes I think it gets bumped up to playable and decent but still not as strong as the other more straightforward boosting stats contracts. For example someone come up with an amazingly strong Burglar's Turn deck that can true solo most quests... You can do that for the other contracts much easier."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3930722","commentId":3930722,"userName":"player3351457","timestamp":1587762137,"content":"So I will try to put the contracts in with my favorite decks to run with them, to give each a fighting chance. Since my builds are always about trying to optimize the contract, I think this is a fair way to do it. I will also do it by favorites, because the general power of each contract kind of depends on the type of scenario up against it.\n\nRanking Least favorite to most:\n\n6. Council of the Wise -- \"Council of Wise Little Ones\" https://ringsdb.com/decklist/view/15185/acouncilofwiselittleones-1.0 [https://ringsdb.com/decklist/view/15185/acouncilofwiselittleones-1.0]\n\nHere we see a little bit of recursion of the events in order to get the maximum amount out of the contract itself. It lends itself well to secrecy and thus acts more in a supportive role than an all-around solo play. Swarms work ok, but otherwise this lacks some serious attack power. Nonetheless, this deck beat journey down the anduin without much trouble, and kept the threat below 20 most of the game. Because of the lack of consistency, some might find this a fun deck to play over and over again, but the lack of flash kind of bores me. This contract would be annoying to build with physical cards and I haven't even bothered with it, playing only on OCTGN. But, I do feel like this deck gets the most out of the contract, so if you're into it, I highly recommend it.\n\n5. The Gray Wanderer -- \"Theodred Buys an Army\" https://ringsdb.com/decklist/view/14467/theodredbuysanarmy-1.0 [https://ringsdb.com/decklist/view/14467/theodredbuysanarmy-1.0]\n\nOkay I admittedly haven't tried to maximize this contract, mainly because I've seen so many variations on Ringsdb. I honestly think there are some great builds out there that do a solid job with this contract, which, I will say, even though it is 5th on my list, I really, really like. However, I am finding that there is little variation in the free attachment to begin. I appreciate the Gandalf and Saruman decks built with this contract. If the Council of the Wise was not great because of lack of consistency, decks built around this one are boring because of lack of variety . The variety comes in the versatility, though. Theodred was my \"Stretch\" of the use, and I like devoted trap decks (Damrod or Haldir) and odds and ends decks with it. Honorable mention to the suicide decks featuring Folco, Boromir, Caldara, or Treebeard. \n\n4. Messenger of the King -- \"A Messenger for the Outlands\" https://ringsdb.com/decklist/view/14801/amessengerfortheoutlands-1.0 [https://ringsdb.com/decklist/view/14801/amessengerfortheoutlands-1.0]\n\nAnother extremely versatile contract and one that I feel like was a great way to go into the hiatus, as it basically injected the community with another hundred or so possible hero combinations. Of course, that's on paper... once you dive into the language and timing of setup, suddenly the possible number of ally-heroes begin to dwindle. What saves it? Sphere combos. You can run tactics silvan heroes, round out some noldors, etc. Or for me? Outlands. Here we go. Finally get three outlands heroes. Get them in, get them all juiced. Ready them. Oh no, did one of them leave play? Get ready to feel the wrath of Prince Imrahil. They all happen to be purple which works well with the Lord title. I have not play-tested this deck yet, but I will guess that this one will destroy enemies better than any mono-leadership deck I've ever run.\n\n3. The Burglar's Turn -- \"Quest til the Forest Burns\" https://ringsdb.com/decklist/view/14297/questtiltheforestburns-1.0 [https://ringsdb.com/decklist/view/14297/questtiltheforestburns-1.0]\n\nHave I mentioned how much fun these contracts are? I originally thought this one was an absolute whiff. But once you play with it, especially in multiplayer, you realize how much fun it is... to travel and clear locations! That's right. You are constantly hoping for more locations and are looking for ways to clear them. Bonus if you can travel twice in a turn! It's possible... especially if a friend is running hero, core Legolas to help with the clearing of locations each round. If you want to join up with some friends in a multiplayer game, bring this deck. You will have an absolute blast.\n\n2. Fellowship -- \"A Fellowship of Haradrim and Elves\" https://ringsdb.com/decklist/view/14016/afellowshipofharadrimandelves-1.0 [https://ringsdb.com/decklist/view/14016/afellowshipofharadrimandelves-1.0]\n\nOkay, so one stipulation here -- running this contract can be a little bit frustrating. If you are on your way building a deck and find you have 1 non-unique for every 6 or so unique, it is tempting to just roll with this contract. But that really, at the base of it, is not how this contract works. You must build FOR it. I.e. Bring cards that help get you to 9. I've seen a lot of dedicated decks to this contract that work with it and are able to flip it in a couple turns. They're on the right track. But this deck? Well, it's just not even fair. The only going against it is cost. It's not going to flip for a while, so yes, this deck needs to turtle a little. But once the flip occurs, it's over. I'm serious. I've ran this deck against a bunch of different scenarios and the theme is always the same: Will the decks survive long enough for the contract to flip? Consider: Firyal will quest for 5 with the help of the headdress. Elrond with light of valinor is another 4. Arwen is good for 4. Do you have another repeat haradrim in hand? Great, because you exhausted one character, discarded another, and quested for 13, looking at the top card of the encounter deck to see if there's anything else you need to do. It's a joke. But it's fun. A race against time towards total domination of an encounter deck.\n\n1. Forth! The Three Hunters -- \"Two Contracts\" https://ringsdb.com/fellowship/view/7680/twocontracts [https://ringsdb.com/fellowship/view/7680/twocontracts]\n\nI cheated. This last one is a fellowship, and I didn't follow my own advice by including a contract on the support side of the three hunters. But my goodness was this deck fun as two-handed fellowship. On one side, you've got three hunters. Na'asiyah's downside is now a strength, and she gets to hold onto the ring. Eowyn is there bringing the early willpower and is ready to take snowmane, herugrim, and golden shield. Question -- when bringing restricted attachments what do you think to bring? Weapons of course... and mounts. So why not bring Elfhelm as well? And that brings me to Aragorn. Oh yes. He is getting all the spheres. All his toys. And a juice unlike the world has ever seen. The fellowship side is providing cash (hardly ever needed), some early readying, and all the off-sphere toys for everyone. How much do these three hunters quest for? 20? 30? Who knows. I built this deck as soon as the contract was announced, so there are some missing pieces that make it even more fun. Golden belt, more weapons, mounts, etc. The contract is so well rounded. You figure you have tactics cards that carry a good chunk of the restricted key words. Then the contract boosts willpower, which you might be lacking in. But the kicker is healing. To have a built in healer of such great power is worth the cost of the allies. And oh by the way, cheaper attachments to start lead the way to flipping this contract early. This fellowship had no problem clearing the Agmar Awakened cycle and I have no doubt with all the newer toys coming out this current cycle that this deck has mastery over most."},{"commentUrl":"https://community.fantasyflightgames.com/topic/307869-ranking-contracts/?do=findComment&comment=3930805","commentId":3930805,"userName":"General_Grievous","timestamp":1587782192,"content":"Thanks for the deck shares! Cool to see what you've done with each contract."}]}