{"url":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/","title":"Beating Under The Ash Mountains","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3931961","commentId":3931961,"userName":"asgardianphil","timestamp":1588096949,"content":"My pack came today.\n\nI've had a quick look at the quest and a friend sent me a screen shot of someone frustrated with the shennenigens in this quest. Looks like the player deck is your dwindling resources/supplies. The encounter deck is going to make you discard cards like crazy. The quest cards do this based on side quests in play. I haven't looked at any other encounter cards yet.\n\nI'm guessing a dwarven deck that triggers off discarding cards would work well here, but not the dwarven tropes that actually do the discarding.\n\nDiscard pile cards would shine such as Spirit ally Glorfindel. Stand and fight, reforged, Caldara Galadhrim Weaver, knight of Belfalas, Elven-light, Will of the West. Dwarven Tomb. (A lot of Spirit cards)\n\nCards that reorder the top of the deck. Might be useful to make sure you only draw what's essential. Cards that search and pull. So many cards across all spheres.\n\nAnd of course side quest loving cards like East Road Ranger, Thallion, legacy blade etc.\n\nSo, I think I might build a Spirit Dwarven Deck.\n\nBefore I dive in what are your thoughts about this quest?\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3931985","commentId":3931985,"userName":"Alonewolf87","timestamp":1588099940,"content":"> 48 minutes ago, asgardianphil said:\n> \n> I'm guessing a dwarven deck that triggers off discarding cards would work well here, but not the dwarven tropes that actually do the discarding.\n\nDwarven Pipe will be super useful in this quest and also Ever My Heart Rises would probably shine.\n\nDwarves seems indeed the way, but not the mining ones. Might be time to take off some dust from your old Leadership Dain Ironfoot swarm decks.\n\n> 48 minutes ago, asgardianphil said:\n> \n> My pack came today.\n\nLucky you, I doubt I will see mine before this summer."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3931997","commentId":3931997,"userName":"asgardianphil","timestamp":1588101835,"content":"Side quests are going to need to be cleared quickly if they cropup too. Spirit sphere has Rider of Rohan to helponce a side quest is cleared.\n\nAlso just noticed both stages of the quest ban Will of The West. 'Event cards cannot shuffle cards from a players discard pile'\n\nVery carefully worded so as not to prevent card fetchingfrom the discard pile by other means.\n\n\n\nI feel very lucky getting this pack. I thought it would be weeks.\n\nI ordered my pack from boargameextras 24th April.\n\nAlso, a friend of mine got his pack from Games Lore as part of his subscription last week which prompted me to search and buy."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3931998","commentId":3931998,"userName":"CaffeineAddict","timestamp":1588102238,"content":"I got mine delivered from gameslore a few days ago, but I haven't gotten around to trying it yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3932086","commentId":3932086,"userName":"asgardianphil","timestamp":1588117890,"content":"I haven't put together a deck yet, but I had a thrown together trap deck that I created for something else. I'm going to get stuck in with this deck and see what I'm up against. I don't have any hope of winning at this point.\n\n\n\nGame #1\n\nHeroes Lore Aragorn, Damrod and Mirlonde. Threat Dial 26.\n\n51 card deck.\n\nDraw Mithrandir's Advice, Strider's Path, Firyal, Entangling Nets, Warden of Healing and Ranger Spear. No mulligan.\n\n\n\nQuest setup. Discard 11 cards from top if player deck. StageTorech Gorgor Patrol. Discards cards until The Tunnels of Torech Gorgor becomes the target side quest. Add it to staging.\n\n\n\nTurn 1\n\nDraws Woodmen's Clearing.\n\nPlanning: play discounted Entangling Nets into staging area. Play Mithrandir's Advice drawing Woodmen's Path, Interrogation and Gandalf core.\n\nQuest: Can't choose side quest TToTG until 3 active locations have been explored.\n\nCommit Aragorn, Damrod and Mirlonde for 6WP.\n\nStages Narrow Opening.\n\n6 threat vs 6WP. No progress.\n\nTravel: to Narrow Opening.\n\nRefresh: TD 27. Discards Interrogation, Self Preservation and Strider (this was in because I was going to play a 2 handed game against escape from Dol Guldur).\n\n\n\nTurn 2\n\nDraws Poisoned Stakes.\n\nPlanning: due to Narrow opening can only play 1 card a round. Play Firyal.\n\nQuest. Commit everyone for 9WP. Firyal peeks at Spawn of Shelob (hasSurge). Discards it.\n\nStages Orc Passage.\n\n7 threat vs 9WP. 2 progress on Narrow Passage.\n\nRefresh: TD 28. Discards Explorer's Almanac, Ranger Spikes and Mithrandir's Advice.\n\n\n\nTurn 3\n\nDraws Master Of The Forge.\n\nPlanning: play Warden of Healing.\n\nQuest: commits everything for 10WP. Firyal peeks at Twisted Tunnel and discards it as it will search and add another enemy to staging.\n\nStages Crumbling Passage. Which swaps place with the active location.\n\n10threat Vs 10 WP.\n\nRefresh: TD 29. Discards Woodmen's Path, Firyal and Gandalf.\n\n\n\nTurn 4\n\nDraws Woodmen's Clearing.\n\nPlanning: play Woodmen's Path and Woodmen's Clearing on Crumbling Passage\n\nQuest: commit Mirlonde, Damrod and Firyal for 7WP Firyal peeks at Ash Mountain Werewolf and puts it back.\n\nStages Ash Mountain Werewolf. Entangling Nets grab it. Damrod draws Keen Longbow.\n\n12 Threat vs 7 WP. TD 34.\n\nEngagement: Werewolf engages.\n\nCombat: Werewolf attacks undefended. (Shadow is Nameless Beast. +5(cost of top card of discard pile which is Gandalf. ) 7 damage to Mirlonde (she had no rezources). Werewolf discards lore Farimir and Explorer's Almanac. Aragorn Attacks Werewolf putting 3 damage on it.\n\nRefresh: TD 35. Discards Forest Snare, Master of the Forge and Forest Patrol.\n\n\n\nTurn 5\n\nDraws Warden of Healing.\n\nPlanning: play Gandalf whoKills the Werewolf.\n\nQuest: commits Damrod, Aragorn, Firyal and Gandalf. For 11 WP. Firyal peeks at Fiery Chasm and discards it.\n\nStages Fearful Shadows doomed 1.TD 36. Each character has no text for the round.\n\nThreat 10 vs 11WP. 1 progress on Crumbling Passage explores it dealing 1 damage to questers. Reduce threat by 3. TD33. Put 1 resource on side quest TToTG.\n\nTravel: to Narrow Passage.\n\nRefresh: TD34. Gandalf leaves play.\n\n\n\nTurn 6\n\nDraws Woodmen's Path.\n\nPlanning: play Warden of Healing.\n\nQuest: commit Aragorn, Damrod,Firyal and Warden of Healing for 8WP. Firyal peeks at Hideous Deeps and discards it.\n\nStages . Writhing Shadows.Damages Aragorn, Damrod and Firyal. Exhaust Warden of Healing to heal Aragorn and Damrod.\n\nThreat 7 vs 7 WP.\n\nRefresh: TD 35. Discards Gildor Inglorion, Anborn and Entangling Nets.\n\n\n\nTurn 7\n\nDraws Explorer's Almanac.\n\nPlanning: play Poisioned Stakes into staging area.\n\nQuest: commits Aragorn, Damrod, Firyal and both healers for 9WP. Firyal peeks at Twisted Tunnel and discards it.\n\nStages Overwhelming Darkness side quest.\n\n8 threat vs 9 WP. 1 progress on Narrow Passage explores it. Discards Interrogation randomly from hand. Puts 1 resource on side quest TToTG.\n\nTravel to Orc Passage.\n\nRefresh: TD 36. Discards Gandalf, Faramir, Forest Snare and Anborn.\n\n\n\nTurn 8\n\nDraws Keen Longbow.\n\nPlanning: I can't play a card as only have 1 left in my player deck and Overwhelming Darkness will discard it.\n\nQuest: make Overwhelming Darkness the current quest. Commit all in for 9 WP. Firyal peeks at Fiery Chasm and discards it.\n\nStages Fearful Shadows. Doomed 1. TD 37. all characters have no printed text.\n\n4 threat vs 9 WP. 5 progress made. 4 on Orc Passage and 1 on Overwhelming Darkness. Searches for TorechPatrol and poisoned Stakes impales it. (Damrod might as well draw the last card)\n\nGame over.\n\nWell, it was a rubbish deck and I was going to use it and another deck to punish myself against nightmare Escape from Dol Guldur just for fun. But then this pack turned up.\n\nThis was a fun quest and there is a lot to build a deck against.\n\nSide quests\n\nUnderground\n\nLow cost cards\n\nQuesting\n\nDiscarding and Discard pile manipulation\n\nHigh WP.\n\nThe encounter deck locks out direct progress on locations by having an explore effect rather than a travel effect. Hates will of the west and has high HP enemies that use # of quests I play and discard cards.\n\nDefinitely needs strong questing to quickly get the side quests into the victory pile.\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3934567","commentId":3934567,"userName":"asgardianphil","timestamp":1588633841,"content":"I've been away playing some other games.\n\nI'm back but not with a dwarf deck. It started out as being a dwarf deck but I wanted to do some discard pile shennenigens so it's ended up a mess of an elven deck.\n\nOk here goes.\n\nGame #2\n\n\n\nHeroes Thranduil, Kahliel and Arwen. Threat Dial (TD) 28\n\nDraws Dwarf Pipe, Kahliel's Tribesman, Stand And Fight, Yazan, Reforged and Elrond's Council.\n\nMulligan for Bilbo Baggins, Jubayr, The Elven King, Kahliel's Tribesman, Stand And Fight and Dwarf Pipe.\n\nSet up: discard 10 cards:\n\nElrond's Council, Galadhrim Weaver, Elven-light, Kahliel's Tribesman, Galadhrim Weaver, Galadhrim Weaver, Glorfindel, Hidden Cache ( adds 2 resources to Arwen), Ered Luin Miner (goes into play) and Stand And Fight.\n\nAdds Torech Gorgor Patrol to staging.\n\nDiscarded 3 cards to add Overwhelming Darkness side quest to staging.\n\nSide quest (after a player plays a card he discards the top of his deck )\n\n\n\nTurn 1\n\nDraws Dwarf Pipe.\n\nPlanning: play Dwarf Pipe on Ered Luin Miner. Discard ATest of Will. Exhaust pipe to put it onbottom of deck.\n\nPlay Bilbo Baggins. Forced to discard Celebra铆n's Stone. Bilbo searches for and findsDwarf Pipe.\n\nQuest: choose Overwhelming Darkness as current quest.\n\nCommit all characters for 9 WP.\n\nStages Mordor Cave Troll.\n\n6 threat vs 9 WP. 3 progress on Overwhelming Darkness.\n\nRefresh: TD 29. Discards A Test Of Will, Kahliel's Headdress and Haradrim Spear.\n\n\n\nTurn 2\n\nDraws Reforged.\n\nPlanning: Arwen discards Jubayr to give herself 1 resource. Plays reforged to put Celebra铆n's Stone into play on her. Discards The Elven King.\n\nPlay Kahliel's Tribesman using Thranduil's resources. Discards Hidden Cache (adds 2 resources to Arwen)\n\nPlay The Elven King on Thranduil using a resource from Kahliel. Discards Firyal.\n\nPlay Stand and Fight to play Galadhrim Weaver from the discard pile. Discards A Test of Will. Dwarf Pipe gets it back.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nall characters commit for 13 WP.\n\nStages Spawn of Shelob. Surges into Narrow Opening.\n\n10 threat vs 13 WP. 3 progress on Overwhelming Darkness clears it. Shuffles Stand and Fight, Firyal and Hidden Cache back into the draw deck.\n\nReturn Galadhrim Weaver to hand to ready Thranduil.\n\nTravel: to Narrow Passage.\n\nEngagement: Spawn of Shelob engages and discards Hidden Cache (adds 2 resources to Arwen)\n\nCombat: Thranduil defends for 3. (Shadow is Fearful Shadows. Cannot ready Thranduil until the end of the round. No damage.\n\nRefresh: TD 30. Discards The Elven King and Ancestral Armour.\n\n\n\nTurn 3\n\nDraws Ered Luin Miner.\n\nPlanning: Arwen discards the miner to add a resource to herself.\n\nPlay Galadhrim Weaver and shuffle the miner back in the deck.\n\nQuest: commit everyone except Thranduil (exhausted) for 12 WP.\n\nStages Firey Chasm.\n\n7 threat vs 12 WP. 5 progress. 3 explores Narrow Opening ( Discards 1 of the 2 Dwarf Pipes randomly from my hand) and 2 progress on the main quest. Exhaust Dwarf pipe to save the discarded Dwarf Pipe.\n\nTravel to Firey Chasm.\n\nCombat: exhaust Elven King to return Galadhrim Weaver to hand to ready Thranduil.\n\nThranduil defends Spawn Of Shelob for 3. (Shadow is Lost in the Dark side quest. No effect). No damage.\n\nRefresh: TD 31. Discards Firyal and hidden Cache (adds 2 resources to Arwen). Dwarf Pipe saves it.\n\n\n\nTurn 4\n\nDraws Reforged.\n\nPlanning: play Reforged to put Ancestral Armour on Thranduil. Play Galadhrim Weaver to shuffle back Reforged.\n\nQuest: commit Arwen, Galadhrim Weaver, Bilbo and the miner for 9 WP.\n\nStages Nameless Beast.\n\n8 threat Vs 9 WP. 1 progress on Fiery Chasm.\n\nEngagement: Nameless Beast engages.\n\nCombat: Thranduil defends the spider for 5 def. (Shadow is Ash Mountain Werewolf. Effect won't trigger.) No damage.\n\nExhaust the Elven King and return the weaver to ready Thranduil. Using Thranduil's resource play the weaver again and shuffle Firyal back into the deck.\n\nThranduil defends the Nameless Beast for 5 def. (Shadow is Fearful Shadows. Thranduil cannot ready until the end of the round. ) also discard Ered Luin Miner which goes into play. Nameless Beast gains +3 att. 1 damage on Thranduil.\n\nKahliel and his tribesman attack the spider for 3 defeating it.\n\nRefresh: TD 32 discards Silver Circlet. (Dwarf pipe saves it) and Southron Refugee.\n\n\n\nTurn 5\n\nDraws Armoured Destrier.\n\nPlanning: play dwarf Pipe on Ered Luin Miner #2. Play Armoured Destrier on Thranduil (paid for by Thranduil and Kahliel.)\n\nExhaust Elven King to return the weaver to hand and ready Thranduil.\n\nPlay Galadhrim Weaver to shuffle back the Southron Refugee.\n\nPlay Elven-light from discard pile. Draws Southron Refugee.\n\nQuest: commit Arwen, Bilbo, Kahliel, Weaver and both miners for 12 WP.\n\nStages Ransacked Supplies. Discards Dwarf Pipe. +1 threat to staging.\n\n6 threat vs 12 WP. 6 progress made. 4 explores Fiery Chasm (discarding Elven-light and O L贸rien!) Dwarf Pipe saves it. 2 progress on the quest.\n\nCombat: Thranduil defends the Nameless Beast for 5 def. (Shadow is Narrow Opening. No effect) discards O L贸rien! +1 to att. No damage.\n\nRefresh: TD 33. Discards Southron Refugee and Elrond's Council. Dwarf pipe #1 gets it back.\n\n\n\nTurn 6\n\nDraws Southron Refugee.\n\nPlanning: Arwen discards Elven-light and plays it to draw Stand and Fight.\n\nPlays 2 Southron Refugees using 2 resources from Kahliel and 1 from Thranduil.\n\nQuest: commit Both miners and both refugees, the weaver, Bilbo and Arwen for 12 WP.\n\nStages Spider of Shelob which surges into Spider of Shelob which surges into Crumbling Passage. (Wow! perfect storm)\n\n7 threat vs 12 Wp. 5 progress made. 3 on Crumbling passage exploring it so 1 damage on each exhausted character. Defeats the weaver. 2 progress on the main quest.\n\nPlays Stand and Fight to put the Weaver from further down the discard pile into play. She shuffles Stand and fight back in the deck.\n\nEngagement: Mordor Cave Troll engages first followed by the spiders. Discard Stand and Fight. Dwarf Pipe saves it and the other spider I'll take the +2 att.\n\nThranduil defends the 4 att spider for 5 def. (Shadow is Writhing Shadows. Enemy makes an additional attack. ) no damage.\n\nExhaust the Elven King to return the weaver to my hand and ready Thranduil. Play the weaver using Thranduil's resource. Shuffle back in the weaver on the top of the discard pile.\n\nExhaust the Tribesman to buff Kahliel to defend against the 4 att spider. (Shadow is Hideous Deeps. No effect). 1 damage on Kahliel.\n\nThranduil defends Namless beast for 5. Discards Reforged which adds 0 att. (Shadow is Burning Reek. I'll return it to staging after attack. ) No damage.\n\nArmoured Destrier readies Thranduil and removes shadow from Mordor Troll.\n\nThranduil defends the Troll for 5 def. Takes 1 damage.\n\nSpider attacks undefended for 2. (Shadow is Ransacked Supplies. Discards Dwarf Pipe. 2 damage on Kahliel.\n\nRefresh: TD 34 discards Firyal and Silver Circlet. Dwarf Pipe saves.\n\n\n\nTurn 7\n\nDraws Yazan.\n\nPlanning: Arwen discards Elven-light and plays it to draw Hidden Cache.\n\nQuest: commit Arwen, Bilbo and the weaver for 8 WP.\n\nStages Writhing Shadows. 1 damage on tribesman and 1 damage on Arwen.\n\n5 threat vs 8 WP. 3 progress on the main quest (9 total out of 25)\n\nEngagement: Namless Beast engages.\n\nCombat: Thranduil defends Namless Beast. Discards Stand and Fight adding 0 to attack. (Shadow is Fiery Chasm. No effect). No damage.\n\nExhaust Elven King to return weaver to hand and ready Thranduil. Thranduil pays for Galadhrim Weaver. Shuffles Stand and Fight back in the deck.\n\nThranduil defends a spider for 5 def. (Shadow is a Haunt for Beasts side quest. No effect. ) no damage.\n\nArmoured Destrier readies Thranduil and removes the shadow card from the Troll.\n\nThranduil defends the Troll and takes 1 damage.\n\nSpider makes an undefended attack for 2. (Shadow is The Tunnels of Torech Gorgor side quest. No effect.) 2 damage on Thranduil.\n\nSo, every character is 1 away from death.\n\nKahliel and his Tribesman kill one spider and the refugees and miners kill the other.\n\nRefresh: TD 35. Discards Galadhrim Weaver and reforged. Dwarf pipe saves it.\n\n\n\nTurn 8\n\nDraws Silver Circlet.\n\nPlanning: Discard Hidden Cache to add 1 resource to Arwen. Exhaust 2 refugees to play Yazan for 3 resources from Kahliel. Play Silver Circlet on Arwen.\n\nQuest: commit Arwen, Bilbo and the weaver for 10 WP.\n\nStages Mordor Cave Troll. (Game over!)\n\n5 Threat vs 10 WP. 5 progress on main quest\n\nEngagement: Troll #2 engages.\n\nCombat: Thranduil defends Namless Beast for 5 def. Discards Kahliel's Tribesman to add 2 att. (Shadow is Namless Beast. +2 att.) 7 vs 5 is 2 damage. Thranduil is defeated\n\nMiner # 1 defends Troll #1. (Shadow is Torech Gorgor Patrol. No effect). Miner defeated and 4 cards discarded.\n\nMiner #2 defends Troll #2. (Shadow is Ransacked Supplies. Discards silver Circlet). Miner defeated and discards 4 cards.\n\nKahliel, Yazan and a tribesman attack the nameless beast for 6 att. Yazan puts a direct damage on it. 4 damage on the enemy.\n\nRefresh: TD 36. Discards 2 cards. Only one\n\n\n\nTurn 9.\n\nDraws Reforged. Deck is now empty. Game over.\n\n\n\nWell. I had some bad luck with the 10 discarded cards at the start. My stewards never came out. Warden of healing never came out for stand and fight. I couldn't get any Haradrim out. Yep, need to stick with Dwarves.\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936908","commentId":3936908,"userName":"asgardianphil","timestamp":1589031765,"content":"Game #3.\n\nI've tweaked myKahliel deck a little bit. (Deck building is not something I'm very good at, but this is my deck rather than one from online.)\n\n\n\nHeroes are Kahliel, Elrond and Glorfindel. Threat 28. 50 card deck.\n\nDraws: Dwarf Pipe, Elrond's Council, Galadriel, Warden of Healing, Ered Luin Miner, Hidden Cache.\n\nAs much as I want the Warden I don't want the cache or the miner so I'm going to mulligan.\n\nMulligan: Steward of Gondor, Dwarf Pipe, Hidden Cache, The Elven King, Reforged and Light of Valinor.\n\n\n\nAt this point I now realise in my first two games I have been discarding too many cards. Set up says if your deck has more than 40 cards discard down to 40. I was taking the amount of cards I had before drawing my starting hand. So where before I'd of discarded 10+ cards I only need to discard 4.\n\nSetup. Discard cards so that you only have 40 cards in your deck:\n\nStand And Fight\n\nYazan\n\nA Burning Brand\n\nEred Luin Miner ( is put into play.)\n\nAdd Torech Gorgor Patrol to staging\n\nA Haunt For Beasts side quest is added to staging.\n\n\n\nTurn 1\n\nDraws Haradrim Spear.\n\nPlanning: play Light of Valinor on Glorfindel.\n\nQuest: Can't choose the side quest while there is an enemy in staging.\n\nCommit Glorfindel only. For 3 WP.\n\nStages Lost in the Dark side quest. Places top 10 cards of player deck face down under threat dial. (Brutal!)\n\n4 threat vs 3 WP. TD 29. Discards Elrond's Council from TD.\n\nEngagement: engage the Torech Gorgor Patrol.\n\nEred Luin Miner defends its engagement immediate attack for 1 def. (Shadow is Spawn of Shelob. Exhausts Kahliel. Defeats the miner.\n\nCombat: Elrond defends the patrol for 3 def. (Shadow is Ransacked Supplies. Discards Light of Valinor from play.) 2 damage on Elrond.\n\nThings are looking grim already. Perhaps I shouldn't have engaged. However, I thought I needed to in order to clear the side quest quickly before more enemies appear.\n\nRefresh: TD 30 discards Stand And Fight from under TD.\n\nDiscards 4 cards due to # of quests. Ancestral Armour, Silver Circlet, Kahliel's Tribesman and Firyal.\n\n\n\nTurn 2\n\nDraws Jubayr.\n\nPlanning: play Reforged to play Light of Valinor from the discard pile.\n\nPlay Steward of Gondor on Kahliel and exhaust it to add 2 resources.\n\nPlay Haradrim Spear on Kahliel.\n\nQuest: choose A Haunt For Beasts as the current quest.\n\nCommit Glorfindel and Elrond to the quest. For 6 WP.\n\nStages Firey Chasm.\n\n4 threat vs 6 wp. 2 progress made on A Haunt for Beasts.\n\nCombat: Kahliel defends the Patrol for 2 def. (Shadow is Ash Mountain Werewolf. No effect.) 3 damage on Kahliel.\n\nDiscard Jubayr from hand to ready Kahliel.\n\nKahliel and Glorfindel attack the patrol for 8 att (discarding the spear). Patrol takes 4 damage.\n\nRefresh: TD 31 and discards Elrond's Council from under it. Discard 4 cards due to quests, Warden of Healing, Southron Refugee, Elrond's Council and Stand And Fight.\n\nTurn 3\n\nDraws Bilbo Baggins.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Bilbo Baggins using Elrond's resources. Bilbo searches the deck and finds no pipe.\n\nElrond pays to Play hidden cache and draw Galadriel.\n\nQuest: choose A Haunt for Beasts as the current quest.\n\nCommit Glorfindel, Elrond and Kahliel for 8 WP.\n\nStages The Tunnels of Torech Gorgor side quest. (This is really, really bad.)\n\n5 threat Vs 8 WP. 3 progress made on A Haunt for Beasts. Clears it to the Victory Display.\n\nTravel: forced to travel to Firey Chasm.\n\nCombat: poor Bilbo defends the Patrol for 0 def. (Shadow is Namless Beast. Gains +0 attack [Hidden Cache]. Bilbo is defeated.\n\nRefresh: TD 32 and discards Dwarf Pipe from under it. Quest forces 4 cards to be discarded: O L贸rien!, Southron Refugee, Kahliel's Headdress and Kahliel's Headdress again.\n\n\n\nTurn 4\n\nDraws Ered Luin Miner.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay Galadriel using Kahliel's resource. Searches top 5 cards and puts Asfaloth into play on Glorfindel. Reorders Hidden Cache, Southron Refugee, Elf Friend and Galadriel top to bottom.\n\nPlay Ered Luin Miner using Elrond's and Kahliel's resources combined.\n\nPlay Dwarf Pipe on the miner.\n\nQuest: choose Lost In The Dark as the current quest.\n\ncommit Glorfindel, Elrond and Kahliel for 8 WP.\n\nStages Mordor Cave Troll.\n\n3 threat vs 8 Wp. Exhaust Asfaloth to put 2 progress on Fiery Chasm.\n\n5 progress made. 3 on Fiery Chasm (exploring it)and 2 on Lost in the Dark. Forced: adds resource to Lost In the Dark anddiscard 4 cards: hidden Cache [puts 2 resources on Glorfindel], Southron Refugee, Elf-Friend and Galadriel who is saved by the Dwarf Pipe.\n\nCombat:\n\nGaladriel defends the Patrol for 0 def. (Shadow is Overwhelming Darkness side quest. No effect.) Galadriel is defeated.\n\nRefresh: TD 33 and discards Haradrim Spear from under it. Quest discards 4 cards: Light of Valinor, Ered Luin Miner [is put into play], Hidden Cache [adds 2 resources to Glorfindel] and Reforged [saved by Dwarf Pipe]\n\n\n\nTurn 5\n\nDraws Kahliel's Tribesman.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay Kahliel's Tribesman using Kahliel's resources.\n\nQuest: choose Lost In The Dark as the current quest.\n\ncommit Glorfindel, Elrond and Kahliel to the quest for 8 WP.\n\nStages Burning Reek. doomed 1. TD 34 and discards Light Of Valinor from under it. Also have to discard 6 cards due to having 6 characters in play. Only have 5 cards remaining so this is game over.\n\n\n\nReally bad first turn. I think if I hadn't engaged the Patrol it would still have been really difficult to win due to the side quests comming out.\n\n\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936943","commentId":3936943,"userName":"MikeGracey","timestamp":1589037492,"content":"Oops I forgot to post that, I noticed you were discarding too many cards but forgot to mention that... Sorry. Yeah since you drew 6 cards you only discard 4 (assuming your deck is the standard 50 card size)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936970","commentId":3936970,"userName":"asgardianphil","timestamp":1589042082,"content":"Game #4.\n\nA double bill today.\n\nJust threw this deck together. It's a dwarf deck and has 56 cards in it. It's probably trying to cram too much into it. But there is so much it needs to do in this quest that it's a struggle to think on what to focus on.\n\nStill, most people probably play a deck and then need to tweak. So here goes my pre tweak attempt.\n\nHeroes are (Leadership) Dain Ironfoot, (Spirit) Nori and (Leadership) Thorin Oakenshield. Threat Dial 32.\n\nDraw starting hand. Durin's Song, Galadriel, Elf-Friend, Erebor Hammersmith, Durin's Song and Bofur. This hand has no set up cards so I'll mulligan\n\nMulligan: Gandalf (core), Ered Luin Miner, Dwarven Shield, Untroubled by Darkness, O L贸rien! And Bofur.\n\nNot much better.\n\nSetup: 50 cards left so I need to discard 10.\n\nElf-Friend\n\nNarvi's Belt\n\nDwarven Sellsword\n\nHardy Leadership\n\nGaladhrim Weaver\n\nErebor Record Keeper\n\nReforged\n\nGaladriel\n\nThe Elvenking\n\nErebor Toymaker.\n\nStages Overwhelming Darkness side quest (discard a card from deck after playing a card) and Torech Gorgor Patrol.\n\n\n\nTurn 1\n\nDraws Erebor Hammersmith.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nCommit Thorin and Nori for 7 WP.\n\nStages Writhing Shadows. Assigns 3 damage. (2 to Nori and 1 to Thorin. They are already exhausted so no further effect).\n\nPlay Bofur from hand (which doesn't trigger the side quest's forced effect.\n\nThreat 3 Vs 10 WP. 7 progress made o the current quest moving it to the Victory Display. Top 3 discarded cards are shuffled back into the player deck. Bofur returns to my hand.\n\nRefresh: TD 33. Quest discards Dwarven Sellsword and Dwarven Sellsword.\n\n\n\nTurn 2\n\nDraws Gandalf.\n\nPlanning: play Dwarven Shield on Dain using Thorins resources.\n\nQuest: commit Thorin and Nori for 7 WP.\n\nStages Twisted Tunnel. Which puts a Spawn of Shelob into staging.\n\nPlay Bofur from hand.\n\n5 Threat vs 10 WP. Places 5 progress on main quest.\n\nBofur returns to my hand.\n\nTravel: to Twisted Tunnel.\n\nEngagement: Spawn of Shelob engages. Discard Erebor Hammersmith.\n\nDain defends the spider for 4 def. (Shadow is Ransacked Supplies. Discards the shield.) No damage.\n\nRefresh: TD 34. Discards Untroubled by Darkness and Bombur.\n\n\n\nTurn 3\n\nDraws Steward of Gondor\n\nPlanning: Dain pays to play Steward Of Gondor on Thorin and exhaust it.\n\nPlay Ered Luin Miner using Dain and Thorins resources. Nori reduces threat to 33.\n\nQuest: commit Nori and the miner for 5 WP.\n\nStages Ransacked Supplies. Discards Dwarf Pipe. Adds 1 threat to staging.\n\n3 threat vs 5 WP. Makes 2 progress on Twisted Tunnel exploring it.\n\nCombat: Dain defends the spider for 3 Def. (Shadow is Fearful Shadows. Defender cannot ready.) No damage.\n\nThorin attacks spider for 3. Defeats it.\n\nRefresh: TD 34. Discards Dwarf Pipe and Galadhrim Weaver.\n\n\n\nTurn 4\n\nDraws Galadriel.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay Galadriel (Thorin and Dain pays) she searches and pulls nothing (Ancestral Armour is only Attachment). Re orders top to bottom: Hidden Cache, Ancestral Armor, Reforged, Erebor Toymaker and Galadriel.\n\nQuest: commit Thorin, Nori and the miner for 6 WP.\n\nStages Crumbling Passage\n\n2 Threat vs 6 WP. 4 progress made. 3 explores Crumbling Passage (each exhausted character takes 1 damage) and 1 progress on the main quest.\n\nRefresh: TD 35. Galadriel leaves play. Discards Hidden Cache [2 resources on Nori] and Ancestral Armour.\n\n\n\nTurn 5\n\nDraws Reforged.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Reforged to play Narvi's Belt on Thorin from the discard pile.\n\nExhaust Narvi's Belt to give Thorin lore. Play Erebor Hammersmith. Returns Ancestral Armour to hand. Nori reduces threat to 34\n\nPlay Ancestral Armour on Dain. Dain and Thorin use all of their resources.\n\nQuest: commit Nori and Erebor Hammersmith for 5 WP.\n\nStages Ransacked Supplies. Discards Erebor Toymaker adding 3 threat to staging.\n\nPlay Bofur from hand.\n\n5 threat vs 7 WP. 2 progress made on main quest.\n\nBofur returns to hand.\n\nRefresh: TD 35 discards Galadriel and Durin's Song.\n\n\n\nTurn 6\n\nThorin receives an extra resource as 5 dwarves in play.\n\nDraws Narvi's Belt.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Gandalf paid by Dain and Thorin. Puts 4 damage on the Torech Gorgor Patrol.\n\nQuest: commit Nori and Erebor Hammersmith for 5 WP.\n\nStages Hideous Deeps.\n\nPlay Bofur from hand.\n\n5 threat vs 7 WP. 2 progress made on the main quest (10).\n\nBofur returns to hand.\n\nTravel: to Hideous Deeps.\n\nEngagement: engages Torech Gorgor Patrol. Makes an immediate attack. Gandalf defends for 4 def. (Shadow is Crumbling Passage. No effect. 1 Damage on Gandalf.\n\nCombat: Dain defends patrol for 5 def. (Shadow is Mordor Cave Troll. No effect) no damage.\n\nRefresh: TD 36 discards Dwarf Pipe and Elf-Friend. Gandalf leaves play.\n\n\n\nTurn 7\n\nDraws Galadriel.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Gandalf (Dain and Thorin pay) puts 4 damage on the patrol.\n\nQuest: commit Nori and Erebor Hammersmith for 5 WP.\n\nStages Orc Passage.\n\nPlay Bofur from hand. Play Untroubled by Darkness.\n\nThreat 4 vs 14 WP. 10 progress made. 6 explore Hideous Deeps shuffling the 3 face down cards into my deck. 4 progress on the main quest\n\nBofur returns to hand.\n\nCombat: Gandalf defends for 4 def. (Shadow is Writhing Shadows. Makes another attack.) 1 damage on Gandalf.\n\nDain now defends the Patrol for 5 def. (Shadow is Twisted Tunnel. Discards Burning Reek. No other effect.) No damage on Dain.\n\nRefresh: TD 37 discards Durin's song and Gandalf.\n\nGandalf leaves play.\n\n\n\nTurn 8\n\nDraws Ered Luin Miner.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Galadriel. Searches: no attachment. Reorders- Ered Luin Miner, Stand and Fight, Galadhrim Weaver, Warden of Healing and Stand and Fight.\n\nPlay Ered Luin Miner. Nori reduces threat to 36\n\nQuest: commit Nori, Erebor Hammersmith and a miner for 7 WP.\n\nStages Narrow Opening.\n\n7 threat vs 7 WP.\n\nCombat: Galadriel defends for 0. (Shadow is Burning Reek. Discards Ered Luin Miner (now enters play.) And Stand and Fight. Galadriel is defeated. Thorin and a miner defeat the Patrol.\n\nRefresh: TD 37. Discards Galadhrim Weaver and Warden of Healing\n\n\n\nTurn 9\n\nDraws Stand and Fight.\n\nPlanning: exhaust Steward of Gondor\n\nExhaust Narvi's Belt to give Thorin spirit.\n\nPlay Stand and Fight to put Bombur into play.\n\nQuest: Exhaust Bomber to make Orc Passage threat 0.\n\nCommit Thorin, Nori, Erebor Hammersmith, and 2 miners for 13 WP.\n\nStages Ash Mountain Werewolf.\n\nPlay Bofur using Nori's resource.\n\nThreat 5 vs 16. 11 progress made. Advance to stage 2. Puts A Haunt for Beasts into play. Stages Torech Gorgor Patrol (just caused a loss).\n\nBofur returns to hand.\n\nTravel to Narrow Passage.\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat: Dain defends for 5 def. (Shadow is Spawn of Shelob. Exhausts a miner) Werewolf discardsHidden Cache [adds 2 resources to Thorin].\n\nRefresh: TD 38. Discards The Elvenking x2 and The Steward of Gondor.\n\n\n\nTurn 10\n\nDraws Erebor Toymaker.\n\nPlanning: exhaust Steward of Gondor\n\nEhaust Narvi's Belt to give Thorin spirit.\n\nPlay Erebor Toymaker using Thorin's resources. Nori reduces threat to 37\n\nQuest: exhaust Bomber to make Orc Passage Threat 0.\n\nCommit Nori, Erebor Hammersmith and Toymaker for 8 WP.\n\nStages Crumbling Passage switches with active location. (And can now play more than 1 card a turn)\n\nPlay Nori plays Bofur from hand.\n\n6 threat vs 11 WP. 5 progress made. 3 explores Crumbling Passage and 2 on main quest. 1 damage on each exhausted character. Nori is defeated.\n\nBofur returns to hand.\n\nTravel: to Narrow Passage\n\nCombat: Dain defends Werewolf for 5 def. (Shadow is Hideous Deeps. No effect). No damage. Discards O L贸rien!.\n\nThorin, and 3 miners attack the Werewolf defeating it.\n\nRefresh:TD 38. Discards Stand and Fight, Durin's Song and Reforged.\n\n\n\nTurn 11\n\nDraws Hidden Cache.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Hidden Cache to draw Erebor Hammersmith.\n\n2 cards left in player deck. Can't win as they'll be discarded this round.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936974","commentId":3936974,"userName":"asgardianphil","timestamp":1589042441,"content":"I think what makes this quest so hard is the '1 more than X' text on numerous cards. I think it should just have been X as there is always a main quest in play so X would always be 1.\n\nI feel that the Galadhrim Weaver is the only way to rescue cards from the discard pile. And the only way to reccur her without discarding a card is with The Elvenking. And that means either playing a Silvan Hero or having Elf-Friend. All that takes a lot of set up. So you need to pull those attachments or get them back with Reforged, Stand and Fight and Erebor Hammersmith etc.\n\n\n\nDoes anybody else have an idea on how to use the card discarding mechanics to an advantage or at least prolong your life in thequest?\n\nEdited May 9 by asgardianphil\nSpelling errors"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936977","commentId":3936977,"userName":"Alonewolf87","timestamp":1589043699,"content":"> 19 minutes ago, asgardianphil said:\n> \n> feel that the Galadhrim Weaver is the only way to rescue cards from the discard pile.\n\nDwarf Pipe is another.\n\n> 20 minutes ago, asgardianphil said:\n> \n> Does anybody else have an idea on how to use the card discarding mechanics to an advantage or at least prolong your life in thequest?\n\nHidden Cache and Ered Luin Miner are one way. Another is a Noldor deck which wants some copies of other cards in the discard pile already (Elwing's Flight, Lords of the Eldar and so forth). Whenever the quest will be up on OCTG I will try it a few times."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3936984","commentId":3936984,"userName":"asgardianphil","timestamp":1589045203,"content":"Yep, I had 3 off the Dwarven Pipes. They are really good, but you need a shuffler too otherwise the cards you save sit on the bottom. So the Galadhrim Weaver helps with that.\n\n\n\nI've made a few tweaks and exchanged Nori for spirit Legolas so that I don't need Elf-Friend or O L贸rien! Although I've left in that so that she becomes free to play.\n\nMore importantly I've got the deck down to 50 cards.\n\nI guess if I use the one ring and a master card I could get the discard down to just two cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937073","commentId":3937073,"userName":"asgardianphil","timestamp":1589060177,"content":"Game #5.\n\n50 card deck tweaked.\n\nHeroes Legolas (spirit), Thorin and Dain Ironfoot (leadership)\n\nThreat 32.\n\nDraw Durin's Song, Reforged, Dwarf Pipe, Ancestral Armor, Galadriel and Narvi's Belt.\n\nKeeping this hand.\n\nSet up: search and play The One Ring on Dain. Search for Inner Strength and add to hand.\n\nPut Torech Gorgor Patrol in staging\n\nDicards until The Tunnels of Torech Gorgor and put it in staging. (Can't quest here till explored 3 locations)\n\nDiscard down to 40 cards-\n\nEred Luin Miner (enters play)\n\nGandalf (core)\n\n\n\nTurn 1\n\nDraws Ered Luin Miner.\n\nPlanning: plays Narvi's Belt on Thorin.\n\nPlay Dwarf Pipe on Thorin.\n\nQuest. Commit Thorin,miner and Legolas for 7 WP.\n\nStages Fearful Shadows. Doomed 1. TD 33. Each text box is blank.\n\n3 threat vs 5 WP. 2progress made on stage 1.\n\nRefresh: TD 34. Discards Galadriel (smoked pipe to save), Bombur and Untroubled by Darkness.\n\n\n\nTurn 2\n\nDraws Steward of Gondor.\n\nPlanning: Play Steward of Gondor on Thorin. Exhaust Steward of Gondor.\n\nPlay Inner Strength on Dain.\n\nQuest: commit Thorin, miner and Legolas for 7 WP.\n\nStages Writhing Shadows. Assigns 3 damage. Put 1 on Legolas, Thorin and the miner.\n\n3 threat vs 7 WP. Makes 4 progress on stage 1.\n\nRefresh: TD 35. Dicards Erebor Toymaker, Dwarven Sellsword and Stand and Fight (smokes pipe to save S.A.F)\n\n\n\nTurn 3\n\nDraws Hidden Cache.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Galadriel. Puts Dwarf Pipe on to Dain. Reorders: Erebor Galadhrim Weaver, Erebor Toymaker, Durin's Song and Stand and Fight.\n\nPlay Hidden Cache to draw Galadhrim Weaver.\n\nPlays Galadhrim Weaver to shuffle in Hidden Cache.\n\nQuest: Commit Thorin, Galadriel a miner and Legolas for 10 WP.\n\nStages Ransacked Supplies. Discards Stand and Fight to add 0 to staging. Dwarf Pipe saves it.\n\nThreat 3 vs 10 WP. Makes 7 progress but is limited to 5 due to the Patrol. (Stage 1 total now 11).\n\nRefresh:TD 36. Discards Galadriel (saved by pipe 1), Warden of Healing (I'll risk loosing him to get him back with Stand and Fight) and Erebor Record Keeper (pipe saves).\n\nGaladriel leaves play.\n\n\n\nTurn 4\n\nDraws Stand and Fight.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay Ancestral Armour on Dain.\n\nNarvi's Belt gives Thorin spirit.\n\nPlay Stand and Fight to play Warden of Healing.\n\nQuest: commit Thorin, Miner and Legolas for 7 WP.\n\nStages Firey Chasm.\n\n6 threat vs 7WP. 1 progress made on stage 1\n\nTravel: to Firey Chasm.\n\nWarden of Healing heals miner and Legolas.\n\nRefresh:TD 37. Discards Stand and Fight (pipe saves), Elven-light and Galadriel (pipe saves)\n\n\n\nTurn 5\n\nDraws Narvi's Belt.\n\nPlanning: exhaust Steward of Gondor. Play Elven-light to draw Erebor Hammersmith.\n\nPlay Ered Luin Miner.\n\nQuest: commit Thorin, both miners and Legolas for 9 WP\n\nDiscards Elven-light to ready Thorin.\n\nStages Firey Chasm. Play Durin's Song on Thorin.\n\nThreat 6 vs 11 WP. 5 progress made. Explores Fiery Chasm and none on stage 1. Discards Gandalf, Hidden Cache [adds 2 resources to Thorin] and Dwarven Sellsword. Add 1 resource to TTOTG side quest.\n\nTravel: forced to travel to 2nd Firey Chasm.\n\nWarden heals Thorin.\n\nRefresh:TD 38. Discards The Elvenking, Hidden Cache [add 2 resources to Thorin] and Hidden Cache [adds 2 resources to Thorin]\n\n\n\nTurn 6\n\nDraws Galadhrim Weaver.\n\nPlanning: exhaust Steward of Gondor.\n\nExhaust Narvi's Belt to give Thorin lore.\n\nPlay Erebor Hammersmith and put The Elvenking into hand.\n\nPlay The Elvenking on Legolas.\n\nPlay Galadhrim Weaver and shuffle Hidden Cache back into deck.\n\nQuest: commit Thorin, Legolas, Galadhrim Weaver, Erebor Hammersmith and 1 miner for 10 WP.\n\nLegolas discards Narvi's Belt to ready Thorin.\n\nStages Burning Reek. Doomed 1. TD 39. Discards 9 cards:\n\nErebor Record Keeper\n\nStand and Fight (pipe saves)\n\nStand and Fight (pipe saves)\n\nErebor Hammersmith\n\nReforged\n\nBofur\n\nBilbo\n\nErebor Toymaker\n\nGaladhrim Weaver.\n\n3 threat vs 10 WP. 7 progress made. 5 explores Fiery Chasm. Add 1 resource to stage 1 and discards 3 cards: Ered Luin Miner (enters play), Dwarf Pipe and Reforged. 2 progress on stage 1.\n\nEngagement: Torech Gorgor Patrol is engaged. Makes an immediate attack.\n\nDain defends for 6 def. (Shadow is Ash Mountain Werewolf. No effect.) No damage.\n\nCombat: take attack undefended. (Shadow is Orc Passage. No effect). 5 damage on Dain.\n\nWarden heals Dain\n\nElvenking exhaust to ready Legolas. Returns Weaver to hand.\n\nLegolas, Thorin and 2 miners attack for 8. 4 damage on the Patrol.\n\nRefresh:TD 40.\n\nExhaust Narvi's Belt to give Thorin spirit.\n\nPlay Reforged to put Dwarf Pipe on Erebor Hammersmith.\n\nDiscard Dwarven Sellsword (piped), Galadriel (piped) and Galadriel (piped)\n\n\n\nTurn 7\n\n5 dwarves in play. So Thorin gains an extra resource.\n\nDraws Gandalf.\n\nPlanning: exhaust Steward of Gondor.\n\nPlays Galadhrim Weaver shuffles Reforged back to deck. Play Gandalf to reduce threat to 35.\n\nQuest: commit Thorin, Legolas, and Erebor Hammersmith for 8 WP.\n\nStages Mordor Cave Troll.\n\n3 threat vs 8 WP. Makes 5 progress on stage 1\n\nEngagement: Cave Troll engages.\n\nExhaust Elvenking to ready Legolas\n\nCombat:\n\nExhaust warden to heal Dain.\n\nDain defends the troll for 6 def. (Shadow is A Haunt for Beasts side quest. No effect.) No Damage.\n\nEred Luin Miner defends Patrol for 1 def. (Shadow is Writhing Shadows. Makes an additional attack). Defeated miner.\n\nGandalf defends. (Shadow is Narrow Passage. No effect). 1 damage on Gandalf.\n\nLegolas and 2 miners attack patrol for 1damage.\n\nRefresh:TD 36. Discards Steward of Gondor (piped), Erebor Hammersmith (piped) and Galadriel (piped)\n\nGandalf leaves play.\n\n\n\nTurn 8\n\nDraws O L贸rien!\n\nPlanning: exhaust Steward of Gondor.\n\nPlay O L贸rien! on Legolas.\n\nPlay Galadhrim Weaver for free. Shuffles Gandalf back in the deck\n\nPlay Elven-light from discard pile to draw Reforged.\n\nQuest: commit Legolas, Thorin, and 1 weaverfor 6WP\n\nDiscard Elven-light to ready Thorin.\n\nStages Twisted Tunnel. Adds Torech Gorgor Patrol to staging. (#梅$$###!!!) That's probably just lost me the game)\n\n5 threat vs 6 WP. 1 progress made on stage 1.\n\nTravel: forced to go to Twisted Tunnel.\n\nCombat: exhaust warden to heal Dain.\n\nDain defends the cave troll for 6 def. (Shadow is Lost in The Dark side quest. No effect.) No damage.\n\nEred Luin Miner defends the Patrol for 1 def. (Shadow is Orc Passage. No effect.) Defeats the miner.\n\nLegolas, Thorin and a miner attack Cave troll for 7 att. Deals 4 damage.\n\nEhaust The Elvenking to ready Legolas. Return Weaver to hand.\n\nRefresh:TD 37. Discards Erebor Hammersmith (piped), Steward of Gondor (piped) and Stand and Fight (piped).\n\n\n\nTurn 9\n\nNo longer have 5 dwarves in play.\n\nDraws Galadriel.\n\nPlanning: exhaust Steward of Gondor\n\nExhaust Narvi's Belt to give Thorin spirit.\n\nPlay Galadhrim Weaver. Shuffles Ered Luin Miner into deck.\n\nPlay Galadriel. Searches and there's no attachment. Reorders Gandalf, Galadriel, Dwarven Sellsword, Durin's song and Stand and Fight.\n\nPlay Elven-light from discard pile to draw Gandalf.\n\nPlay Gandalf. Put 4 damage on Torech Gorgor Patrol defeating it.\n\nQuest: commit Legolas, Thorin, a Weaver and Erebor Hammersmith for 8 WP.\n\nDiscards Elven-light to ready Thorin.\n\nStages Crumbling Passage. Switches with active location.\n\n5 threat vs 8 WP. 3 progress made. Explores Crumbling Passage. Damages Thorin, Legolas, and Erebor Hammersmith. Defeats a Galadhrim Weaver. Adds 1 resource to TToTG\n\nTravel: forced to go to Twisted Tunnel.\n\nEngagement: engages Torech Gorgor Patrol. Makes an immediate attack. Galadriel defends for 0. (Shadow is Spawn of Shelob. Exhausts Galadhrim Weaver. ) Galadriel is defeated.\n\nCombat:\n\nWarden Heals Dain and Erebor Hammersmith.\n\nExhaust Elvenking and return weaver to hand to ready Legolas.\n\nGandalf defends cave troll for 4 def. (Shadow is Ransacked Supplies. Discards O L贸rien!) Gandalf takes 2 damage.\n\nDain defends the Patrol for def 6. (Shadow is Narrow Passage. No effect.) No damage.\n\nLegolas, Thorin and a miner attack cave troll for 7. 4 damage on it defeating it\n\nRefresh: TD 38. Discards Galadriel (piped) Dwarven Sellsword (piped) and Durin's Song (piped)\n\nGandalf leaves play.\n\n\n\nTurn 10\n\nDraws Stand and Fight.\n\nPlanning: exhaust Steward of Gondor.\n\nExhaust Narvi's Belt to give Thorin spirit.\n\nPlay Galadhrim Weaver to shuffle Gandalf back into deck.\n\nPlay Reforged to put O L贸rien! On Legolas.\n\nPlay Stand and Fight to play Dwarven Sellsword.\n\nPlay Elven-light from discard pile to draw Hidden Cache.\n\nQuest: choose TTOTG as current quest.\n\nCommit Legolas, Thorin, a minerand dwarven Sellsword for 9 WP.\n\nDiscards Elven-light to ready Thorin\n\nStages Spawn of Shelob, surges into Namless Beast.\n\n4 threat vs 9 WP. 5 progress made. 2 on Twisted Tunnel explores it and 3 on TTOTG clearing it to Victory Display.\n\nEngagement: Namless Beast and Spawn of Shelob engages. Choose not to discard a card for the spider giving it a +2.\n\nCombat: ready Legolas using Elvenking and weaver.\n\nWarden heals Dain and Thorin.\n\nDain defends Namless Beast. Discards stand and Fight to add 0 attack. (Shadow is Hideous Deeps. No Effect. ) no damage.\n\nTorech Gorgor Patrol attacks undefended. (Shadow is Ash Mountain Werewolf. No effect.) Dain takes 5 Damage.\n\nThorin defends Spawn of Shelob for 1 def. Shadow is Spawn of Shelob. Exhausts Legolas. ) 3 damage on Thorin.\n\nRefresh:TD 39. Discards Galadriel (piped), Ered Luin Miner (put into play). Pay 1 resource to keep Sellsword.\n\n\n\nTurn 11.\n\n5 dwarves in play.\n\nDraws Steward of Gondor.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay Galadhrim Weaver for free to shuffle Stand and Fight back into deck.\n\nPlay Elven-light light to draw Stand and Fight.\n\nExhaust Narvi's Belt to give Thorin spirit.\n\nPlay Stand and Fight to play Bombur.\n\nQuest: commit Erebor Hammersmith and 2 minersfor 6WP.\n\nStages Overwhelming Darkness.\n\n0 threat vs 6 WP. 6 progress made on stage 1. Advances to stage 2. Finds and stages A Haunt for Beasts side quest. Discards until Ash Mountain Werewolf is staged.\n\nEngagement: Ash Mountain Werewolf engages. Now have 4 enemies engaged.\n\nWarden heals Thorin and Dain.\n\nSellsword defends Namless Beast for 2 def. Discards Gandalf to add +5 att. (Pipe saves Gandalf. Shadow is Burning Reek. Move nameless beast to staging after attack. ) defeats Sellsword.\n\nBombur defends Spawn of Shelob for 1 def. (Shadow is Cave Troll of Mordor. No effect.) Bombur takes 1 damage.\n\nDain defends Torech Gorgor Patrol for 6 def. (Shadow is Crumbling Passage. No effect.) No damage.\n\nNext either Thorin or Legolas is going to die so it has to be Legolas due to pipe and resources on Thorin.\n\nLegolas defends Ash Mountain Werewolf for 1 def. (Shadow is Torech Gorgor Patrol. No effect.) Legolas is defeated.\n\nThorin attacks and defeats Spawn of Shelob.\n\nRefresh:TD 40 discards 4 cards. Dwarven Sellsword (piped) Durin's Song (piped), Erebor Hammersmith and Galadriel (piped).\n\n\n\nTurn 12\n\nDraws Gandalf.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Gandalf put 4 damage on Ash Mountain Werewolf. Discard Dwarven Sellsword.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nCommit Thorin, 2 miners and Erebor Hammersmith for 10 WP.\n\nStages Narrow Opening.\n\n6 threat vs 10 WP. 4 progress made on quest.\n\nEngagement: Namless Beast engages.\n\nCombat: exhaust Narvi's Belt to give Thorin Lore.\n\nExhaust warden to heal Dain and Thorin. Spend 2 resources to repeat. Spend 2 resources to ready warden. Exhaust warden to heal Dain and Bombur. Spend 2 resources to ready warden. Exhaust warden to heal Dain.\n\nNamless Beast attacks undefended. Discards Durin's Song to add 1 att. (Shadow is Ransacked Supplies. Discard Steward of Gondor.) Thorin takes 4 damage.\n\nAsh Mountain Werewolf attacks undefended. (Shadow is Writhing Shadows. Makes another attack.) 4 damage on Dain. Discards Galadriel.\n\n\n\nNo cards left in deck. Game over."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937113","commentId":3937113,"userName":"asgardianphil","timestamp":1589063789,"content":"So what have I learned..\n\nThe enemies are Gandalf proof. (None can be killed by him except the Spawn of Shelob which is a waste for Gandalf, so yeah he's Gandalf proof too.\n\nThe starting enemy Torech Gorgor Patrol shuts down uber questing. He maximises your progress to 5 on the main quest. But you need to make 50 progress over the 2 stages.\n\nThe side quests are brutal adding to staging threat. Onecan't be quested unless you've explored 3 locations. One cant be quested whilst enemies are staged. One punishes you for each card played and one grabs 10 cards off you.\n\nLocations want you to come with direct progress effects. They all trigger on being explored rather than travel effects.\n\nAny strategy you try to build is broken by the constant discarding or imprisoning of cards.\n\nThe game is over if you run out of cards and you only start with 40.Draw 1 card each turn and discard on average 3 a turn. Means you have to do this quest in 10 turns or find ways to get cards back.\n\nHaving high costing cards in your deck or discard pile can ruin your day from a couple of encounter cards.\n\nLocks out Will of the West\n\nDirect damage willkill your 1 HP questers.\n\nShadow effects cause additional attacks.\n\nSwarming of characters is checked with a nasty treachery.\n\nAll characters' game text can be cancelled by treachery.\n\nAttachment discarding effects.\n\nAll in all a very difficult and nasty quest. The synergy between staging effects and Shadow effects is tight. There's no card you want to see come up. Nothing really whiffs. It all combos nicely together.\n\nWhat you need to do to win is basically engage and/or kill the Torech Gorgor Patrol and quest hard ignoring everything else.\n\nBut the encounter deck won't let you get off so easily.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937139","commentId":3937139,"userName":"Alonewolf87","timestamp":1589067006,"content":"> 9 hours ago, asgardianphil said:\n> \n> nd/or kill the Torech Gorgor Patrol\n\nWhich is also TaEowyn-proof since it requires a total of 13 Attack and since it makes at least two attacks (one on engagement and one on the combat phase) can't be just Feinted away.\n\nAlso how lovely that basically almost all the enemies have just over 4 (or 8 in case of the Patrol) Hit Points so that if Haunt of Beasts is in play you have to deal with them for at least 1 extra turn.\n\nEdited May 10 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937182","commentId":3937182,"userName":"Ely Hill","timestamp":1589074297,"content":"Just a reminder in case you are feeling frustrated.\n\n493654d6ef.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_05/493654d6ef.thumb.jpg.af5a9b981c0ba57b3432ee767bae4b36.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_05/493654d6ef.jpg.e3a4c577d22102b26a0784727146eb20.jpg]"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937297","commentId":3937297,"userName":"asgardianphil","timestamp":1589106814,"content":"> 8 hours ago, Ely Hill said:\n> \n> Just a reminder in case you are feeling frustrated.\n> \n> 493654d6ef.jpg [//content.invisioncic.com/Mfantflight/monthly_2020_05/493654d6ef.thumb.jpg.af5a9b981c0ba57b3432ee767bae4b36.jpg] [//content.invisioncic.com/Mfantflight/monthly_2020_05/493654d6ef.jpg.e3a4c577d22102b26a0784727146eb20.jpg]\n\nききき\n\nThis is so true..\n\nBut I fear secrecy won't cut it either.\n\nI think frustration is part of the game, in fact any game. I'd be lying if I hadn't felt frustrated at being killed in a computer game (the Dark Zone in the Division is particularly frustrating when a clan swoop down on you and steal your stuff and slaughter you.)\n\nI reckon if you feel frustrated at this game then the game makers will be chuckling to themselves and congratulating themselves on creating a particularly challenging scenario.\n\nOn the one hand it forces you to think out of the box but on the other hand it makes you reach for the must have staples and the big powerful guns that you can't win without.\n\nI wonder if this quest could be beaten with the contract it came with?\n\nBack to the drawing board... maybe I'll try a Rohan questing deck.."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937379","commentId":3937379,"userName":"asgardianphil","timestamp":1589125225,"content":"Game #6\n\nI thought about hitting the enemies in staging so I found a Fastred/Dunhere deck that does it. I made a few tweaks but it has none of the discard manipulation I had in before, so no stand and fight/reforged or Galadhrim Weaver shenanigans.\n\nIn fact the deck also has no healing or resource acceleration which I'm a little worried about.\n\nSo here goes nothing...\n\nHeroes Fastred, Dunhere and (tactics) owyn. Threat Dial 26\n\n50 card deck.\n\nDraw hand: Elrond's Council, A Test of Will, Open The Armoury, Galadriel's Handmaiden, Dagger of Westernesse and Strength And Courage.\n\nI'll mulligan as I don't want the master card.\n\nMulligan: Arwen Und贸miel, Pippin, Golden Belt, Galadriel's Handmaiden, Knights of The Swan and Ancient Mathom.\n\nSetup: reduce threat by 3 TD 26.\n\nSearch for The One Ring and put it on Dunhere.\n\nSearch for a master card. Finds Strength and Courage and adds to hand.\n\nDiscard 2 cards: Captain Of Gondor and Silvan Refugee.\n\nAdd Torech Gorgor Patrol to staging.\n\nAdd Lost in the Dark to staging and it puts 10 cards under threat dial.\n\n\n\nTurn 1\n\nDraws Dagger of Westernesse.\n\nPlanning: play Golden Belt and Dagger of Westernesse on Dunhere.\n\nPlay Arwen Und贸miel.\n\nQuest: choose Lost in the Dark as current Quest.\n\nCommit owyn and Arwen for 6 WP. +1 def to Fastred.\n\nStages Firey Chasm.\n\n6 threat vs 6 WP. No progress.\n\nTravel: to Firey Chasm.\n\nCombat: Dunhere attacks Torech Gorgor Patrol in staging for 5 att. Deals 1 damage.\n\nRefresh: TD 24 and discards Dagger of Westernesse from under dial.\n\nDiscard 3 cards: Open the Armory, Ethir Swordsman and Arwen Und贸miel.\n\n\n\nTurn 2\n\nDraws Spear of The Mark.\n\nPlanning: play Spear of The Mark on Dunhere. (Now has 3 restricted attachments)\n\nPlay Galadriel's Handmaiden. TD 23.\n\nQuest: choose Lost In The Dark as the current quest.\n\ncommit owyn, Arwen and Galadriel's Handmaiden for 8 WP. +1 def to Fastred.\n\nStages Narrow opening.\n\n6 threat vs 8 WP. 2 progress made on Fiery Chasm.\n\nCombat: Dunhere attacks Torech Gorgor Patrol in staging for 7. Deals 3 damage.\n\nRefresh: TD 24 and discards Golden Belt from under it.\n\nDiscard 3 cards: Galadriel's Handmaiden, Elrond's Council and another Elrond's Council.\n\n\n\nTurn 3\n\nDraws Spear Of The Mark.\n\nPlanning: play Strength and Courage on Dunhere.\n\nPlay Ancient Mathom on Firey Chasm.\n\nQuest:\n\nChoose Lost in the Dark as the current quest.\n\nowyn, Arwen and Galadriel's Handmaiden for 8 WP. +1 def to Fastred\n\nStages Nameless Beast.\n\n9 threat vs 8 WP. +1 threat. TD 25 and discards Open the Armory from under it.\n\nCombat:Dunhere attacks Torech Gorgor Patrol in staging. Use The One Ring with Strength and Courage to double printed att. TD 26 and discards Elrond's Council from under it. Dunhere attacks for 10. Defeating the patrol.\n\nRefresh: TD 27 and discards Ancient Mathom from under it.\n\nDiscards 3 cards: Silvan Refugee, Rainment of War and Unseen Strike.\n\n\n\nTurn 4\n\nDraws Unseen Strike.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit owyn, Arwen and Galadriel's Handmaiden for 8 WP. +1 def to Fastred.\n\nStages A Haunt for Beasts side quest. (Just in time to protect namless beasts)\n\n6 threatVs 8 WP. 2 progress made on Fiery Chasm.\n\nCombat: Dunhere attacks Namless Beast for 8. Deals 4 damage.\n\nRefresh: TD 28. And discards Unexpected Courage from under it.\n\nDiscards 4 cards: Open the Armory, Golden Shield, A Test of Will and Ethir Swordsman.\n\n\n\nTurn 5\n\nDraws Honour Guard.\n\nPlanning: play Pippin.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit owyn Arwen, Galadriel's Handmaiden and Pippin for 10 Wp. +1 def to Fastred.\n\nStages Orc Passage.\n\n10 threat vs 10 WP. No progress made.\n\nCombat: Dunhere attacks and defeats Namless Beat in staging.\n\nRefresh: TD 29 and discards A Test of Will from under it.\n\nDiscard 4 cards: Dagger of Westernesse, Galadriel's Handmaiden, Honour Guard and Arwen Und贸miel.\n\n\n\nTurn 6\n\nDraws Knight of The Swan.\n\nQuest: choose A Haunt for Beasts as the current quest.\n\nCommit owyn, Arwen, Galadriel's Handmaiden and Pippin for 10 WP. +1 def to Fastred.\n\nStages Torech Gorgor Patrol.\n\nThreat 11 vs 10 WP. TD 30 and discards Unseen Strike from under it.\n\nCombat: Dunhere attacks Torech Gorgor Patrol for 8. Dealing 4 damage.\n\nRefresh: TD 31 and discards Ethir Swordsman from under it.\n\nDiscard 4 cards: Bofur, Spear of The Mark, Unexpected Courage and Gondorian Shield.\n\nWith only 3 cards left I'll scoop. It well and truly beat me. Couldn't even clear the first location.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937413","commentId":3937413,"userName":"MikeGracey","timestamp":1589128161,"content":"Hey the deck u used in game 5 was good. I have a suggestion. Add 3 copies of hunting party. Thats lets you discard an enemy in staging for something else."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937459","commentId":3937459,"userName":"Alonewolf87","timestamp":1589135302,"content":"I was thinking if perhaps a Caldara heavy willpower deck might be a good choice for this quest, make use of the starting discard to seed good allies to take back. Possibly a SpEowyn/Arwen/Caldara lineup to hopefully play Prince Imrahil in the first turn to get back some good allies. You could maybe start with more than 60 cards to raise the chance of discarding something useful like Glorfindel/Jubayr/Elfhelm/Northern Tracker in the quest setup.\n\nEDIT: possibly something like this\n\nhttps://ringsdb.com/decklist/view/16038/monospiritundertheashmountains-2.0 [https://ringsdb.com/decklist/view/16038/monospiritundertheashmountains-2.0]\n\nEdited May 11 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937518","commentId":3937518,"userName":"MikeGracey","timestamp":1589140680,"content":"> 1 hour ago, Alonewolf87 said:\n> \n> I was thinking if perhaps a Caldara heavy willpower deck might be a good choice for this quest, make use of the starting discard to seed good allies to take back. Possibly a SpEowyn/Arwen/Caldara lineup to hopefully play Prince Imrahil in the first turn to get back some good allies. You could maybe start with more than 60 cards to raise the chance of discarding something useful like Glorfindel/Jubayr/Elfhelm/Northern Tracker in the quest setup.\n> \n> EDIT: possibly something like this\n> \n> https://ringsdb.com/decklist/view/16023/monospiritundertheashmountains-1.0 [https://ringsdb.com/decklist/view/16023/monospiritundertheashmountains-1.0]\n\nI don't see how this deck is gonna handle enemies. Its got great willpower but other than ride them down, not to many ways to deal with big enemies, like the patrol who prevents more than 5 progress. If the wild beasts sidequest comes out I think your deck would be doomed..."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937521","commentId":3937521,"userName":"Alonewolf87","timestamp":1589141009,"content":"> 53 minutes ago, MikeGracey said:\n> \n> I don't see how this deck is gonna handle enemies. Its got great willpower but other than ride them down, not to many ways to deal with big enemies, like the patrol who prevents more than 5 progress. If the wild beasts sidequest comes out I think your deck would be doomed...\n\nIt stil has quite a bit of decent combat allies (Elfhelm, the Trackers, Glorfindel, Rider of Rohan) and Eowyn with Herugrim is attacking for 5+ so not too shabby either. For defense we have Jubayr, Against the Shadow, the Watchmen or a \"sneak attack\" ally with Stand and Fight. It might have some problems handling big enemies, you are right, I won't know for sure until I playtest it a bit.\n\nThe main idea was to try and take advantage of all those discard, especially the Setup ones, and Caldara seemed a good fit for that.\n\nAnother idea might be to use Saruman or Revelead in Wrath to get rid of the Patrol restriction on progress without actually having to engage it.\n\nEdited May 10 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937554","commentId":3937554,"userName":"MikeGracey","timestamp":1589147083,"content":"Caldara is certainly an interesting option with pulling allies out of the discard. She would probably be best with a tactical deck across the table.\n\nAnd deck that can fit hunting party in should probably do it for this quest. Discarding the patrol is incredibly powerful"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937601","commentId":3937601,"userName":"asgardianphil","timestamp":1589154052,"content":"I did toy around with the idea of putting in a load of cards to get a good portion of them into the discard pile. So maybe 70 cards of which 26 would be discarded hopefully putting in there a load of stuff I could work with.\n\nIt might dilute the deck so that there's less chance of something important being discarded. But you're more likely to loose all 3 copies of an important card you can't get back. After erroneously discarding too many cards in my first few games I realised that any amount of cards discarded was bad news.\n\nSo what cards are going to work in this deck? (Not necessarily together)\n\n Discard Pile shennenigens:\n\nAnborn\n\nAnchor Watch\n\nBeorning Skin Changer\n\nBook of Eldacar\n\nCaldera\n\nDwarf Pipe\n\nDwarven Tomb\n\nElven-light\n\nElwings Flight\n\nErebor Hammersmith\n\nFortune or Fate\n\nGaladhrim Weaver\n\nGlorfindel ally\n\nG煤thwin毛\n\nGwaihir\n\nH谩ma\n\nKahliel's Headdress\n\nKnight of Belfalas\n\nLords Of The Eldar\n\nMap Of Earnil\n\nMaster Ironsmith\n\nMen Of The West\n\nMithlond Sea-watcher\n\nNori ally\n\nOrophin\n\nPrince Imrahill\n\nReforged\n\nSailor of Lune\n\nScroll of Isildur\n\nSecond Breakfast\n\nSkyward Volley\n\nStand and Fight\n\nThe Evening Star\n\nThe Houses of Healing\n\nTo Me! O My Kinsfolk!\n\nTo The Eyrie\n\nTome Of Atanatar\n\nVeteran Sword-Elf\n\nWarden Of The Havens\n\n\n\n Saves discarded from Play/hand/discarded from deck\n\nGamling\n\nEred Luin Miner\n\nHidden Cache\n\nRallying Cry\n\nSilver Harp\n\n\n\n Counter productive:\n\nEred Nimrais Prospector\n\n\n\n Prohibited Cards:\n\nThe White Council\n\nWill of The West\n\n\n\n\n\nEdited May 11 by asgardianphil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937677","commentId":3937677,"userName":"Alonewolf87","timestamp":1589177363,"content":"> 8 hours ago, MikeGracey said:\n> \n> And deck that can fit hunting party in should probably do it for this quest. Discarding the patrol is incredibly powerful\n\nThe Great Hunt too."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937680","commentId":3937680,"userName":"asgardianphil","timestamp":1589178440,"content":"> 5 minutes ago, Alonewolf87 said:\n> \n> The Great Hunt too.\n\nBefore the Dunhere deck I was seriously considering a Haldir deck. Mono lore. Great Hunt would work and also put off Pursuit; providing you got a location.\n\nThe plan would also be to Get The One Ring and Strength and Courage on Haldir giving him an attack 7 before any other weapon buffs but that would require a Tactics icon so Rivendell Minstrels and Songs of Battle to combo. Then he could also get a Rivendell Blade for more impact. Golden belt and Dagger of Westernesse thrown in too.\n\nI think I'll build that deck next"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937687","commentId":3937687,"userName":"asgardianphil","timestamp":1589180260,"content":"Chuck in Galadhrim Minstrels and East Road Rangers and the Scroll of Isuldur too I think.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937692","commentId":3937692,"userName":"asgardianphil","timestamp":1589181769,"content":"> 56 minutes ago, Alonewolf87 said:\n> \n> The Great Hunt too.\n\nBefore the Dunhere deck I was seriously considering a Haldir deck. Mono lore. Great Hunt would work and also put off Pursuit; providing you got a location.\n\nThe plan would also be to Get The One Ring and Strength and Courage on Haldir giving him an attack 7 before any other weapon buffs but that would require a Tactics icon so Rivendell Minstrels and Songs of Battle to combo. Then he could also get a Rivendell Blade for more impact. Golden belt and Dagger of Westernesse thrown in too.\n\nI think I'll build that deck next"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937696","commentId":3937696,"userName":"asgardianphil","timestamp":1589184261,"content":"I've quickly put a deck together\n\nhttps://ringsdb.com/decklist/view/16036/haldirtakesonmordor-2.0 [https://ringsdb.com/decklist/view/16036/haldirtakesonmordor-2.0]\n\nI'll play it as soon as I can."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937715","commentId":3937715,"userName":"MikeGracey","timestamp":1589196502,"content":"> 5 hours ago, Alonewolf87 said:\n> \n> The Great Hunt too.\n\nThats a great option too, if you can manage to play mono lore.\n\nAsgardianphil played a deck with Sp legolas and Thorin and had the necessary traits to play hunting party from the start. Seems like a perfect addition for this quest patrol and trolls)"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937730","commentId":3937730,"userName":"Alonewolf87","timestamp":1589201007,"content":"This might be too much janky but how about Revealed in Wrath + Hirgon + Knight of Minas Tirith to take care of the Patrol? It will have 0 Threat and won't limit the progress and you would also avoid the engagement forced attack.\n\nEdited May 11 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937746","commentId":3937746,"userName":"MikeGracey","timestamp":1589203602,"content":"> 42 minutes ago, Alonewolf87 said:\n> \n> This might be too much janky but how about Revealed in Wrath + Hirgon + Knight of Minas Tirith to take care of the Patrol? It will have 0 Threat and won't limit the progress and you would also avoid the engagement forced attack.\n\nInteresting... Hard to pull off for sure but would be nice"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937747","commentId":3937747,"userName":"asgardianphil","timestamp":1589203954,"content":"> 41 minutes ago, Alonewolf87 said:\n> \n> This might be too much janky but how about Revealed in Wrath + Hirgon + Knight of Minas Tirith to take care of the Patrol? It will have 0 Threat and won't limit the progress and you would also avoid the engagement forced attack.\n\nThat's a really good combo but the Patrol has def 4 so knight of Minas Tirith would not damage it. However I guess you're just trying to get it out of staging at this point to avoid its threat hike and 2 attacks.\n\nFrom there Forest Snare it or make sure you cancel its shadow effect as there are some that return enemies to staging."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937749","commentId":3937749,"userName":"Alonewolf87","timestamp":1589204300,"content":"> 10 minutes ago, MikeGracey said:\n> \n> Interesting... Hard to pull off for sure but would be nice\n\nAnother slightly easier option would be Revelead in Wrath + Sneak Attack Son of Arnor/Mablung"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937778","commentId":3937778,"userName":"asgardianphil","timestamp":1589208123,"content":"I think Revealed In Wrath is not a bad shout in general as Namless Beast can really sting if you aren't using cards to track the top card of your deck, or even if you are and you know it's a high one like what happened to me. I revealed Gandalf adding +5 for an 8vatt + shadow effect. Cave Troll really hurts too as you cant chump block him. Revealed in Wrath will letyou."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937911","commentId":3937911,"userName":"asgardianphil","timestamp":1589217606,"content":"Game #7\n\n\n\nHeroes: Haldir of Lorien, Mirlonde and Thurindir.\n\nThreat Dial 22.\n\nDraws Wingfoot, Galadhrim Minstrel, Warden of Healing, The Evening Star, Woodmen's Clearing and Gildor Inglorion.\n\nNeed to get a song or song grabber.\n\nMulligan: None Return, Warden of Healing, Song of Battle, None Return, Scroll of Isuldur and Woodmen's Clearing.\n\nSet up: search for The One Ring and put it on Haldir.\n\nSearch for Strength and Courage and add it to hand.\n\nAdd Torech Gorgor Patrol and The Tunnels of Torech Gorgor side quest to staging. (Not the best but not the worst either.)\n\nDiscard 2 cards: The Houses Of Healing and The Great Hunt.\n\nTurn 1\n\nDraw Rivendell Minstrel.\n\nPlanning: play Song of Battle and Strength And Courage on Haldir. (Leaving 1 resource on Thurindir)\n\nQuest: commit Mirlonde and Thurindir for 4 WP.\n\nStages Spawn Of Shelob which surges into Writhing Shadows. Assigns 1 damage to Haldir and 2 to Mirlonde. (Clap! Clap! Clap! The encounter deck has just pulled a blinder... I'll be engaged so Haldir can't attack the patrol and the treachery has damaged them up nicely. ) at this point it's as if the encounter deck is sentient and evil. The Dark Lord himself.\n\n4 threat vs 4 WP. No progress made.\n\nEngagement: Spawn of Shelob engages. Choose to discard 2 cards: Warden of Healing and Gildor Inglorion.\n\nCombat: Spawn of Shelob attacks undefended for 2. (Shadow is Burning Reek. Either discard 2 cards or return to staging. Discards The Evening Star and Golden Belt). 2 damage to Thurindir.\n\nHaldir attacks the spider for 4 att. Defeats it.\n\nRefresh: TD 23.\n\nDiscard 3 cards: A Burning Brand, The Evening Star and Rivendell Minstrel.\n\n\n\nTurn 2\n\nDraws Mirkwood Explorer.\n\nPlanning: play Scroll of Isuldur on Haldir for 1 resource off Thurindir.\n\nUse the scroll to play The Great Hunt from discard pile (1 resource from each hero) and put under the player deck. Discard Torech Gorgor Patrol.\n\nAlthough that's super cool. I'm at risk due to the damage and no other questers.\n\nQuest: commit Thurindir and Mirlonde for 4 WP.\n\nStages Burning Reek. Doomed 1. TD 24 discards 3 cards: Scroll of Isuldur, None Return, and Mirkwood Explorer.\n\n0 threat vs 4 WP. Makes 4 progress on the main quest.\n\nRefresh: TD 25\n\nDiscards 3 Cards: Galadhrim Minstrel, Rivendell Blade and Scroll Of Isuldur.\n\n\n\nTurn 3\n\nDraws A Burning Brand (for Gildor)\n\nPlanning: play Mirkwood Explorer\n\nQuest: commit Mirlonde, Thurindir and Mirkwood Explorer for 6 WP.\n\nStages Spawn of Shelob. (Really!) Surges into Overwhelming Darkness side quest.\n\n1 Threat vs 6 WP. 5 progress made on stage 1. And 1 progress on Mirkwood Explorer.\n\nEngagement: Spawn of Shelob engages. Choose the 2 cards to discard: Gildor Inglorion and The Great Hunt.\n\nCombat: Haldir defends the spider for 1 def. (Shadow is Crumbling Passage. No effect). 1 damage on Haldir.\n\nRefresh: TD 26\n\nDiscards 4 Cards: Warden of Healing, Woodmen's Clearing, Rivendell Blade and Wingfoot.\n\n\n\nTurn 4\n\nDraws The Evening Star.\n\nPlanning: play Warden of Healing. Discards Bombur.\n\nExhaust him now to heal Haldir and Mirlonde. (There's a treachery that adds 1 direct damage soni had to do this now but it leaves the warden exposed)\n\nQuest: Choose Overwhelming Darkness as the current quest.\n\ncommit Thurindir and Mirkwood Explorer for 4 WP.\n\nStages Fearful Shadows. Doomed 1. TD 27. Each Character has a blank text box. [NOT SURE IF THIS AFFECTS THE THREAT DIAL DUE TO MIRLONDE?]\n\n0 threat vs 4 WP. Makes 4 progress on Overwhelming Darkness.\n\nCombat: Mirlonde defends the spider for 1 def. (Shadow is Hideous Deeps. No effect. ) 1 damage on Mirlonde.\n\nHaldir attacks and defeats the spider for 4 attack.\n\nPlay None return on it. Discard East Road Ranger.\n\nRefresh: TD 28\n\nDiscard 4 cards: Golden Belt, The Houses Of Healing, Song of Battle and Song of Battle.\n\n\n\nTurn 5\n\nDraws Dagger Of Westernesse.\n\nPlanning: play Rivendell Minstrel. Discard Galadhrim Minstrel.\n\nUse warden to heal Haldir and Mirlonde.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nCommit Thurindir, Mirkwood Explorer and Rivendell Minstrel for 6 WP.\n\nStages Ash Mountain Werewolf. (28 encounter cost just as I reached 28 threat! Unbelievable Geoff!)\n\n2 threat vs 6 WP. 4 progress made on side quest clearing it and put 1 progress on Mirkwood Explorer. Shuffles back top 3 cards.\n\nGoing to lose a Hero now. And both copies of the Houses of Healing and Scroll of Isuldur are deep in the discard pile I'm scooping.\n\nGame over\n\n\n\nWell this time the deck pulled everything out that would stop this deck dead in it's tracks. No locations, 2 side quests and the only 2 enemies that would cause it a problem.\n\nThe deck is like a glass house though no defense. However the idea was not to engage anything and destroy it in the staging.\n\nI think I'll give it another go though.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937924","commentId":3937924,"userName":"Alonewolf87","timestamp":1589219022,"content":"> 23 minutes ago, asgardianphil said:\n> \n> NOT SURE IF THIS AFFECTS THE THREAT DIAL DUE TO MIRLONDE?\n\nNo Mirlonde's effect came into play when you set the starting threat, it's not a passive effect so your threat will not change if her text box is blanked (or if she dies for that matter)\n\nEdited May 11 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3937945","commentId":3937945,"userName":"asgardianphil","timestamp":1589221016,"content":"> 27 minutes ago, Alonewolf87 said:\n> \n> No Mirlonde's effect came into play when you set the starting threat, it's not a passive effect so your threat will not change if her text box is blanked (or if she dies for that matter)\n\nCheers\n\nI was 98% sure that it had no effect, but then I've been playing in my own bubble and may have got it wrong. I mainly play this solo.\n\nIt's really good for me to write out my moves for all to scrutinise so that any mistakes I've been making get picked up.\n\nDuring this loss I had the feeling that no strategy is safe.. the discard effect tore threw my deck at unbelievable speed. All my combos were disappearing before my eyes.\n\nIf you have a strategy you have got to get it going within the first couple of turns."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3938581","commentId":3938581,"userName":"asgardianphil","timestamp":1589313490,"content":"Game #8\n\nMore tweaks. Thurindir has been switched for Treebeard for his defense. East Road Ranger has been switched for WellingHall Preserver. As I now have a higher threat i need to not engage enemies so i put in Ranger Spikes and Anbon (taking out Gildor who is too costly at 5).\n\nI also took out Houses Of Healing in favour of more ally healing. Preservers, wardens and trackers.\n\n\n\nHere goes\n\n50 card deck\n\nHeroes: Haldir Of Lorien, Mirlonde and Treebeard. Threat Dial is 27.\n\nDraw: x2 Rivendell Minstrel, x2 Warden of Healing, Song of Battle and Ranger Spikes.\n\nKeeping this hand.\n\nSetup: search and put The One Ring on to Haldir.\n\nDiscard 2 cards: Woodmen's Clearing and Dagger of Westernesse.\n\nSearch and add Strength and Courage to my Hand.\n\nPut Torech Gorgor Patrol into staging\n\nDiscard cards until Lost in the Dark side quest and put it in staging. Grabs the top 10 cards of my deck.\n\n\n\nTurn 1\n\nDraws: Silvan Tracker.\n\nPlanning: play Ranger Spikes to the staging area. Play Song Of Battle on Haldir.\n\nQuest: chooses Los In The Dark as the current quest\n\nCommit Haldir, Mirlonde and Treebeard for 6 WP.\n\nStages Firey Chasm.\n\nDamage Treebeard 4 times to add 4 WP.\n\n6 Threat vs 10WP. 4 progress made on LITD.\n\nTravel: to Firey Chasm.\n\nRefresh: TD 28 and discards Song of Battle from under it.\n\nDiscard 3 cards: Warden of Healing, Galadhrim Minstrel and Wellinghall Preserver.\n\n\n\nTurn 2\n\nDraws: The Evening Star.\n\nPlanning: play Warden of Healing.\n\nPlay Strength and Courage on Haldir.\n\nExhaust Warden of Healing to heal Treebeard.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Mirlonde and Treebeard for 4 WP.\n\nStages Ransacked Supplies. Discards Rivendell Blade. +1 to threat in staging area.\n\n4 threat vs 4 WP. 0 progress made.\n\nCombat: Haldir uses Strength and Courage to boost his attack. TD 29. Discards A Burning Brand from under it. Ring exhausts.\n\nHaldir attacks the patrol in the staging area for 7 att. Deals 3 damage.\n\nRefresh: TD 30 and discards Scroll of Isuldur from under it.\n\nDiscards 3 cards: Wellinghall Preserver, wingfoot and The Great Hunt.\n\n\n\nTurn 3\n\nDraws Song Of Battle.\n\nPlanning: play Rivendell Minstrel. No search needed.\n\nExhaust Warden of Healing to heal Treebeard.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Mirlonde, Treebeard and Rivendell Minstrel for 6 WP.\n\nStages Mordor Cave Troll. Ranger Spikes cannot trap it. (Doh!)\n\nThreat 6vs 6WP. 0 progress made.\n\nCombat: exhaust Strength and Courage to double Haldir's combat. Exhaust One Ring. TD 31 and discards Ranger Spikes from under it.\n\nHaldir attacks the patrol for 7. Dealing 3 damage.\n\nRefresh: TD 32 and discards A Burning Brand from under it.\n\nDiscard 3 cards: Wellinghall Preserver, Golden Belt and Woodmen's clearing.\n\n\n\nTurn 4\n\nDraws the Great Hunt.\n\nPlanning: the warden heals Treebeard.\n\nPlay Great Hunt to discard the troll.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Mirlonde, Treebeard and Rivendell Minstrel for 6WP.\n\nStages Fearful Shadows. Doomed 1 TD 33 and discards Woodmen's Clearing from under it. Text box of each character is blank. (F#^#%#%#%! Stops Haldir from killing the Patrol. F#%@%@%#^#%!F#^#%#%!)\n\n3 Threat Vs 6 WP. 3 progress made on Fiery Chasm.\n\nHaldir of course can do nothing.\n\nRefresh: TD 34 and discards Mirkwood Explorer from under it.\n\nDiscards 3 cards: Silvan Tracker, Galadhrim Minstrel and Ranger Spikes.\n\n\n\nTurn 5\n\nDraws Mirkwood Explorer.\n\nPlanning: play Mirkwood Explorer.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit: Mirlonde, Treebeard, Rivendell Minstrel and Mirkwood Explorer for 8WP.\n\nStages Ash Mountain Werewolf. Ranger Spikes trap it making it -2 threat and doesnt make engagement checks.\n\nDeal 1 damage to Treebeard to increase his WP.\n\nEhaust warden to heal Treebeard.\n\n3 Threat vs 9 WP. Makes 6 progress. 2 clears Firey Chasm. Discards 3 cards: Golden Belt, Scroll of Isuldur and Rivendell Blade. 4 progress on LITD clearing it. 3 cards left to shuffle back into deck. Add 1 progress to Mirkwood Explorer.\n\nCombat: exhaust Strength and Courage and the One Ring. TD 35.\n\nHaldir attacks the patrol defeating it.\n\nRefresh: TD 36.\n\nDiscards 2 cards: Scroll Of Isuldur and Mirkwood Explorer.\n\n\n\nTurn 6\n\nDraws The Great Hunt. And realise I played the Great Hunt in the wrong phase during turn 4. Meaning the troll would have engaged me.\n\nScoop due to a mistake but to be honest I was going to loose this anyway. With 50 progress yet to make and at least 1 more guaranteed side quest I can't last with only 9 cards left.陈\n\nBack to the design board. I'm thinking I now need to prevent these locations from hurting the board state so that I can get the side quests even quicker. It's taking all game just to clear 1."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3938836","commentId":3938836,"userName":"Onidsen","timestamp":1589348703,"content":"I just beat it twice with this deck: https://ringsdb.com/deck/view/169183 [https://ringsdb.com/deck/view/169183]\n\nOriginally, I was thinking Tactics Theoden + Tactics Eowyn to kill the Torech Gorgor Patrol on the first turn (with Inner Strength on Beregond, you can defend with impunity, and so all you need is a Feint or a chump blocker for the second attack). But I couldn't muster enough willpower to blow through the quest fast enough, so I decided to go for Spirit Eowyn for the sphere balance. I took inspiration from a Seastan deck with the same hero lineup, because it can get Tactics Theoden up to 6 attack on the first turn with Herugrim, which can be very valuable, and just added a few more questing allies and some stuff to interact with the discard mechanic of the quest.\n\nI left it at 56 cards in hopes of seeding the discard pile with good cards for Stand and Fight or Reforged (or getting Hidden Cache/Ered Luin Miner into play) before the game even started, but you could pretty easily cut it down to 50 (I'd probably cut Open the Armory - it's normally an essential card for this kind of deck, but card draw can be a liability in this quest - and Hidden Cache - the extra resources are useful for getting set up but become pointless in the late game).\n\nIt's not a guaranteed win, to be sure. I lost once on the last turn of the game. Questing for 19 against 0 threat in staging, and only needed to make progress. Then Burning Reek came out and I only had 6 cards left in the deck but 13 characters out. I lost a couple other times, less memorably - this quest is unforgiving. But this deck can do it. The first time I won, I got out 2 Ered Luin Miners and a Hidden Cache in the opening discard (8 cards), and I had 2 Ethir Swordsmen in the opening hand. That 4 willpower let me clear the opening side quest (can't remember what it was), and it was pretty smooth sailing after that. The second quest was much harder-fought. At one point, I ended up with all 3 Patrols out and I couldn't find Herugrim, Veteran Axehands, or Stand and Fight to pull the ones out of my discard pile. I didn't discard an Ered Luin Miner until the late game, and I ended up playing 2 from my hand just to play the Dwarf Pipes on them. But I consistently handled willpower, and I eventually whittled down the Patrols. (I finally did find Herugrim with an Open the Armory). The win took 14 rounds, and I only had 5 cards left, so Burning Reek or Lost in the Dark would have sunk me if it came out.\n\nThe priority of the deck is getting out willpower - I mulliganned for Ethir Swordsmen or Galadriel's Handmaidens. Both wins, I had 2 or more willpower allies in hand on turn 1. Second priority is readying on Beregond - that's the guaranteed way to engage a patrol, and you can afford to let it sit there for a while, even if you get a second enemy. Third priority is Herugrim on Theoden or - failing that - Veteran Axehands/Ered Luin Miners. On multiple occasions, I actually left the Ethir Swordsmen ready so they could contribute their attack to kill a patrol. Reforged gets you Dwarf Pipes out of the discard pile, Stand and Fight gets you whatever you need. I always quest with Theoden turn 1 (and often 2 and 3 as well) because I found clearing the side quests to be the most important thing.\n\nI think there might be a variant of this that uses a 3-attack Spirit hero (Lanwyn or Idraen) and Tactics Eowyn to kill the Patrol turn 1 and still have the willpower mustering you need. Perhaps it uses Eowyn + herugrim as a primary attacker?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3938850","commentId":3938850,"userName":"asgardianphil","timestamp":1589355194,"content":"The beacons are lit...\n\nBeregond calls for aid\n\n... And Rohan shallanswer!\n\n\n\nThanks for sharing your deck and victories.\n\nI'll give it a go, although I might not get to play it now until Thursday. Wednesday night is my boadgaming group night but due to lock down we still all meet up every Wednesday;but on the Division 2 to play and chat.\n\nI'm excited for this. I thought a Rohan deck would be the way to go.\n\nAnd those 4 retrieval staples: miner, cache, reforged and Stands with Fists... err stand and fight they are the key to mitigating the damage of the unending discarding effect of the quest.\n\nBravo sir!Bravo!\n\n\n\nEdited May 13 by asgardianphil\nCouple of typos"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3939138","commentId":3939138,"userName":"Onidsen","timestamp":1589398824,"content":"Just found out that my wins are tainted. Apparently, the new Setup rulings mean that you do the Ash Mountain's discard from your deck effect before your resolve player setup cards. Which means that the One Ring and it's Mastery card could potentially get discarded before the ring comes into play.\n\nWhich is a ruling that I'm not a fan of, but apparently it exists. So there's no way to reduce the number of cards you discard from your deck by using player setup effects (unless Caleb revisits the ruling in the future and reverses it)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3939562","commentId":3939562,"userName":"asgardianphil","timestamp":1589484568,"content":"Thanks for the heads up.\n\n\n\nGame 9\n\nHeroes: Beregond spirit, owyn spirit and Theoden tactics. Threat Dial 31\n\n56 card deck.\n\nDraw: Westfold Horse-Breeder, Feint, Galadriel's Handmaiden, Gondorian Shield, Eithir Swordsman and The One Ring.\n\nThe ring aside, this is a really good starting hand. Ok soni don't have Herugrim yet but I have the Ring and it can't now be discarded. I have a way to get Snowmane. I have combat cancelation and questers.\n\nSet up:\n\nDiscard 10 cards:\n\nHonour Guard\n\nEthir Swordsman\n\nHidden Cache (2 res to owyn)\n\nVeteran Axehand\n\nSnowmane\n\nWestfold Horse-Breeder\n\nGaladriel's Handmaiden\n\nFeint\n\nFeint\n\nReforged\n\nAll in all not too bad. And importantly no Inner Strength.\n\nSetup:\n\nAdd Torech Gorgor Patrol to staging.\n\nDiscards cards and adds A Haunt for Beasts to staging. Shuffle encounter deck.\n\nAttach The One Ring to Beregond. Search and put Inner Strength in to hand\n\n\n\nTurn 1\n\nDraws Galadhrim Weaver.\n\nPlanning: play Gondorian Shield on Beregond.\n\nPlay Galadriel's Handmaiden. TD 30.\n\nPlay Westfold Horse-Breeder. Search and (fingers crossed) find Snowmane. (Both remaining copies were in the top 10 cards.)\n\nPlay Snowmane on Theoden.\n\nQuest: can't choose the side quest.\n\nCommit everyone except Beregond for 10 WP.\n\nStages Lost In The Dark. Put top 10 cards under threat dial.\n\n4 Threat vs 10 WP. Made 5 progress on stage 1. (Limited to 5 by the patrol) Ready Theoden.\n\nRefresh: TD 31 and discards Reforged.\n\nDiscard 4 cards: Galadhrim Weaver, The Master Ring, Dwarf Pipe and Unexpected Courage.\n\n\n\nTurn 2\n\nDraws: Herugrim.\n\nPlanning: play Galadhrim Weaver and shuffle Unexpected Courage back into deck.\n\nPlay Inner Strength on Beregond.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit everyone except Beregond for 11 WP.\n\nStages Spawn of Shelob which surges into Fearful Shadows. Doomed 1. TD 32 and discards Dwarf Pipe from under it. All characters now have blank text boxes.\n\n5 Threat vs 11 WP. 6 progress made on side quest. Ready Theoden.\n\nEngagement: Spawn of Shelob engages. (Was hoping to engage and feint the Patrol this turn but spiders and shadows say otherwise). I'll accept the +2 attack.\n\nBeregond defends the spider for 7 def. (Shadow is Fiery Chasm. No effect.) No damage.\n\nTheoden attacks and defeats the spider.\n\nRefresh: TD 33 and discards Ered Luin Miner. (Alas, as it is not off the too of my deck it stays discarded.)\n\nDiscards 4 Cards: Open the Armory, Hidden Cache (2 res on owyn), Gondorian Shield and Ethir Swordsman.\n\n\n\nTurn 3 (and only 19 cards left in my deck. What a brutal quest this is)\n\nDraws Snowmane. (Either owyn discard fodder or insurance against Ransacked Supplies)\n\nPlanning: play Herugrim on Theoden (discounted).\n\nPlay Ethir Swordsman.\n\nQuest: choose Lost in the Dark as the current quest. Commit owyn, Theoden, Galadriel's Handmaiden and Galadhrim Weaver for 10 WP. ( the only thing to ruin me here is another spider surging into a 4 threat location or patrol.)\n\nStages Twisted Tunnel. (Oh ****, I forgot about that) puts an Ash Mountain Werewolf in staging.\n\nThreat 8vs 10 WP. Makes 2progress on the side quest clearing it to the Victory Display. Shuffles 7 cards back into deck.\n\nPhew did it... but how evil is this quest.\n\nReady Theoden.\n\nTravel: to Twisted Tunnel.\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat: Beregond defends the Werewolf for 7 def. (Shadow is Ransacked Supplies. Saving my threat by not using Inner Strength I'll discard Snowmane) no damage so TD reduced to 32. Werewolf discards Stand and Fight.\n\nTheoden uses Herugrim and attacks the Werewolf for 6 att. Due to damage limit from side quest deals 4 damage to the Werewolf.\n\nRefresh: TD 33.\n\nDiscards 3 cards Open the Armory, Galadriel's Handmaiden and Westfold Horse-Breeder.\n\n\n\nTurn 4\n\nDraws Ered Luin Miner.\n\nPlanning: play Snowmane on Theoden\n\nPlay Ered Luin Miner (leaving 1 res each on Theoden and Beregond.)\n\nQuest: still can't choose A Haunt for Beasts.\n\nCommit owyn, Theoden, Galadriel's Handmaiden, Galadhrim Weaver and Westfold Horse-Breeder for 11 WP.\n\nStages Firey Chasm.\n\nThreat 6 vs 11 WP makes 5 progress. 2 explores Twisted Tunnel and 3 on Stage 1.\n\nReady Theoden.\n\nCombat: Beregond defends the Werewolf for 7 def. (Shadow is Fiery Chasm. No effect.) No damage. Discards Honour Guard. Reduces threat to 31. Theoden uses Herugrim to attack the Werewolf and defeats it.\n\nRefresh: TD 32\n\nDiscards 3 cards: The Master Ring, The Master Ring and Galadhrim Weaver.\n\n\n\nTurn 5\n\nDraws Honour Guard. (Can't afford him as I need to feint this round)\n\nQuest: commit owyn, Theoden, Galadriel's Handmaiden, Westfold Horse-Breeder and Galadhrim Weaver for 11 WP.\n\nStages Ash Mountain Werewolf (situations not improved)\n\n8 threat vs 11 WP. Makes 3 progress on stage 1. Ready Theoden.\n\nEngagement: (Whatever! Can't wait any longer... I have to get rid of that side quest.) Optionally engage the Patrol.\n\nEred Luin Miner defends the Patrol for 1 def. (Shadow is Namless Beast. (Galadhrim Weaver is topof the discard pile. +1 att)). Miner is defeated.\n\nAsh Mountain Werewolf engages.\n\nCombat: play Feint on the Werewolf (to save a card from being discarded) good job as it's shadow was going to discard an attachment.\n\nBeregond defends the Patrol for 7. (Shadow is Ash Mountain Werewolf. No effect). Reduce TD to 31.\n\nTheoden uses Herugrim and attacks the Werewolf for 4 damage.\n\nRefresh: TD 32\n\nDiscards 3 cards: Unexpected Courage, Herugrim and Unexpected Courage.\n\n\n\n\n\nTurn 6\n\nDraws Dwarf Pipe.\n\nPlanning: play Honour Guard.\n\nQuest: choose A Haunt for Beasts as the current quest.\n\nCommit owyn, Theoden, Galadriel's Handmaiden, Westfold Horse-Breeder and Galadhrim Weaver for 11 WP.\n\nStages Crumbling Passage. Becomes the active location.\n\n2 threat vs 11 WP. Quested successfully so I'm sure I can use Snowmane here to prevent the damage. Ready Theoden.\n\n9 progress made. 3 on Crumbling Passage. Deals 1 damage to each exhausted character. Defeats Galadriel's Handmaiden, Westfold Horse-Breeder and Galadhrim Weaver (completely destroying my quest power.)\n\n6 progress on A Haunt for Beasts clearing it to the Victory Display.\n\nCombat: Beregond defends the Werewolf for 7 def. (Shadow is Namless Beast. Top card of discard is Galadhrim Weaver so +1 att.) No damage. Reduce threat to 31. Discards Open The Armory.\n\nHonour Guard defends the Patrol. (Shadow is Narrow Opening. No effect.\n\nTheoden uses Herugrim to attack and defeat the Werewolf.\n\nRefresh: TD 32\n\nDiscard 2 cards: Herugrim and Veteran Axehand.\n\n\n\nTurn 7\n\nDraws Reforged.\n\nPlanning: playReforged to playUnexpected Courage on Beregond.\n\nQuest: commit owyn ,Theoden and the Ethir Swordsman for 9 WP. (I'd forgotten the swordsman quest for 2. Good job though as he'd be in the discard pile now. I was saving him for his 1 att though.)\n\nStages Torech Gorgor Patrol. (Situations not improved!)\n\n4 threat vs 9 WP. Makes 5 progress on stage 1. (Total 16. I've got no chance of winning this now) ready Theoden.\n\nEngagement: optionally engage the Patrol. He makes an immediate attack. Honour Guard defends. (Shadow is Spawn of Shelob. Exhaust Theoden.) Defeats the guard.\n\nCombat. Beregond defends the Patrol #1 (shadow is Ransacked Supplies. Use Inner Strength and the Ring. TD 33. Cancel shadow. No damage reduces threat to 32.\n\nReady Beregond.\n\nBeregond defends the Patrol #2. (Shadow is Orc Passage. No effect.) No damage.\n\nRefresh: TD 33\n\nDiscards 2 cards: Stand and Fight and Gondorian Shield.\n\n\n\n5 cards left in the deck gives me 1 more turn.\n\nScooped\n\nLost again.\n\nFeels hopeless. The encounter deck'sjust too crippling to the player deck. Each side quest comes with built in protection.\n\nGood deck though.\n\n\n\n\n\n\n\n\n\nEdited May 14 by asgardianphil"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3939735","commentId":3939735,"userName":"asgardianphil","timestamp":1589507802,"content":"Game 10\n\nNew deck. 55 cards.\n\nA lore deck designed to avoid enemies.\n\nHeroes: Aragorn, Denethor and Rossiel.\n\nTD 28\n\n\n\nDraws: Woodmen's Clearing, Firyal, Bombur, Out of The Wild, Wellinghall Preserver and The Evening Star.\n\nI really need a Great Hunt.\n\nMulligan: Put Off Pursuit, Woodland Sentry, Bombur, Mirkwood Explorer and The Great Hunt x2.\n\nSetup:\n\nDiscards 9 cards:\n\nFiryal\n\nThe Evening Star\n\nIthillien Lookout\n\nWellinghall Preserver\n\nGaladhrim Minstrel\n\nIoreth\n\nWoodmen's Path\n\nWoodland Sentry\n\nMirkwood Explorer\n\nput Torech Gorgor Patrol in staging.\n\nDiscards cards and puts Overwhelming Darkness in staging. After playing a card discard a card.\n\n\n\nTurn 1\n\nDraws Wellinghall Preserver.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nDenethor peeks at Narrow Opening and puts iton top.\n\nCommit Aragorn and Rossiel for 4 WP.\n\nStages Narrow 3\n\n6 Threat vs 4 WP. TD 30.\n\nCombat: play The Great Hunt to discard Torech Gorgor Patrol. Discards Out Of The Wild.\n\nRefresh: TD 31\n\nDiscards 3 cards: Put Off Pursuit, Galadhrim Minstrel and Scroll Of Isuldur.\n\n\n\nTurn 2\n\nDraws Scout Ahead\n\nPlanning: Denethor peeks at Ransacked Supplies and puts it on top.\n\nPlay Bombur. Discards The Door is Closed!\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nBombur exhausts to reduce Narrow Opening to 0 threat.\n\nCommit Aragorn and Rossiel for 4 WP.\n\nStages Ransacked Supplies. Discards The Great Hunt. Adds 3 to Staging.\n\n3 Threat vs 4 WP. Makes 1 progress on Overwhelming Darkness.\n\nRefresh: TD 32\n\nDiscard 3 cards: Ithillien Lookout, Scroll Of Isuldur and The Door is Closed!\n\n\n\nTurn 3\n\nDraws The Evening Star.\n\nPlanning: play Mirkwood Explorer. Discards Out Of The Wild.\n\nDenethor peeks at Ransacked Supplies and puts it back on top.\n\nQuest: choose Overwhelming Darkness as the current quest\n\nBombur makes Narrow Opening 0 threat.\n\nCommit Aragorn, Rossiel and Mirkwood Explorer for 6 WP.\n\nStages Ransacked Supplies. Discards The Hidden Way. Adds 2 threat.\n\n2 threat vs 6 WP. Puts 1 progress on Mirkwood Explorer. Makes 4 Progress on Overwhelming Darkness.\n\nRefresh: TD 33\n\nDiscards 3 cards: Woodmen's Path, Woodland Sentry and Woodmen's Clearing.\n\n\n\nTurn 4\n\nDraws Ithillien Lookout.\n\nPlanning: Denethor peeks at Writhing Shadows and puts it on top.\n\nPlays Wellinghall Preserver. Discards Firyal.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nBombur makes Narrow Opening 0 threat.\n\ncommit Aragorn, Rossiel and Mirkwood Explorer for 6 WP.\n\nStages Writhing Shadows. Assigns 3 damage to characters and exhaust them. Deals 2 to Wellinghall Preserver and 1 to Bombur. Characters were already exhausted.\n\n0 threat vs 6WP. Add 1 progress to Mirkwood Explorer. 6 progress to Overwhelming Darkness clearing it to the Victory Display. Shuffles back top 3 discarded cards.\n\nRefresh: TD 34. Heal 1 damage from the ent.\n\nDiscards 2 cards: Woodland Sentry and Out of The Wild.\n\n\n\nTurn 5\n\nDraws Wellinghall Preserver.\n\nPlanning: Denethor peeks at Fiery Chasm and puts it on top.\n\nPlay Scout Ahead.\n\nPlay Wellinghall Preserver.\n\nQuest: choose Scout Ahead as the current quest.\n\nBombur makes Narrow Opening 0 threat.\n\nCommit Aragorn, Rossiel, Mirkwood Explorer and Wellinghall Preserver for 9 WP.\n\nStages Firey Chasm.\n\n3 threat Vs 9 WP. Put 1 progress on Mirkwood Explorer. Makes 6 progress on Scout Ahead clearing it to the Victory Display.\n\nSearches and puts Orc Passage into the Victory Display.\n\nReorders:The Tunnels Of Torech Gorgor, Ash Mountain Werewolf, Lost in the Dark and Twisted Tunnel.\n\nRefresh: TD 35. Heal 1 damage from ent #1\n\nDiscards 2 cards: The Door is Closed! And Scroll of Isuldur.\n\n\n\nTurn 6\n\nDraws Ioreth.\n\nPlanning: Denethor peeks at The Tunnels of Torech Gorgor and puts it on the bottom.\n\nPlay Ioreth.\n\nPlays Ithillien Lookout and discards Ash Mountain Werewolf off the top.\n\nQuest: Bombur Makes Narrow Opening 0 threat.\n\ncommit Aragorn, Rossiel, Mirkwood Explorer, 2 Wellinghall Preservers and Ithillien Lookout for 13 WP.\n\nStages Lost In The Dark. Puts 10 cards under threat dial.\n\n3 Threat vs 13 WP. Add 1 resource to Mirkwood Explorer. Makes 10 progress on stage 1.\n\nTravel: to Narrow Opening.\n\nRefresh: TD 36 and discards Woodmen's Clearing. Aragorn reduces threat dial to 28.\n\nDiscards 3 card: The Hidden Way, Leave No Trace and Bombur.\n\n\n\nTurn 7\n\nDraws Woodmen's Clearing.\n\n\n\nPlanning: play Woodmen's Clearing on active location.\n\nDenethor peeks at Twisted Tunnel and puts it on the bottom.\n\nQuest: choose Lost in the Dark as the current quest.\n\nBombur makes Fiery Chasm 0 threat.\n\nCommit Rossiel (4wp), Mirkwood Explorer, x2 Wellinghall Preservers and Ithillien Lookout for 13 WP. (Not Aragorn incase I draw an enemy. )\n\nStages Twisted Tunnel... (heh, the one card I didn't want.) It puts Spawn of Shelob into staging. (Surge doesn't trigger in this case.)\n\nPlay The Evening Star. There is one other copy in the discard pile so put 2 progress on Twisted Tunnel exploring it and 2 progress on the active location.\n\n4 Threat vs 13 Wp. Put 1 progress on Mirkwood Explorer.\n\n9 progress made. 1 on active location exploring it. Discards The Great Hunt Randomly from my hand. Woodmen's Clearing reduces threat to 25. 8 progress on Lost in the Dark clearing it to the Victory Display.\n\nShuffles cards from under threat dial back into deck.\n\nEngagement: Spawn of Shelob engages. Choose the +2 attack.\n\nCombat: Aragorn defends the spider for 2 def. (Shadow is Crumbling Passage. No effect). 2 damage on Aragorn.\n\nIroreth heals Aragorn.\n\nRefresh: TD 26.\n\nDiscards 2 cards: Hidden Cache (adds 2 resources to Denethor. And Hidden Cache again. Adds 2resources to Rossiel.\n\n\n\nTurn 8\n\nDraws Woodmen's Path.\n\nPlanning: Denethor peeks at Hideous Deeps and puts it on top. Pay Woodland Sentry.\n\nQuest: commit Rossiel, Mirkwood Explorer, 2 Wellinghall Preservers, Ithillien Lookout and Woodland Sentry for 12 WP\n\nStages Hideous Deeps. It grabs 3 cards from my deck.Bombur makes it threat 0.\n\n2 threat vs 12 WP. Put 1 resource on Mirkwood Explorer. 10 progress made on stage 1. (Total 20).\n\nTravel: to Hideous Deeps.\n\nCombat: Aragorn defends Spawn of Shelob for 2 def. (Shadow is Ash Mountain Werewolf. No effect). No damage\n\nRefresh: TD 27.\n\nDiscards 2 cards Leave No Trace and Woodmen's Clearing.\n\n\n\nTurn 9\n\nDraws The Evening Star.\n\nPlanning: Denethor peeks at Spawn of Shelob and puts it on the Bottom.\n\nPlay Woodmen's Path on the active location.\n\nQuest: commit Rossiel and Wellinghall Preserver x2 for 10WP.\n\nStages Orc Passage. Bombur makes it Threat 0.\n\n2 threat vs 10 WP. Makes 8 progress. 1 on active location exploring it. Shuffles 3 cards back into deck. 7 progress on stage 1 clearing it.\n\nStage 2: searches and pulls A Haunt for Beasts. Discards and stages an Ash Mountain Werewolf.\n\nWell as good as this looks I'm about 3 or 4 turns short.\n\nIts 2:55 am and I've got 7 cards left in my deck and 29 progress to make.\n\nScooped this game.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940347","commentId":3940347,"userName":"asgardianphil","timestamp":1589615409,"content":"Game 11\n\n\n\nI've put a questing deck together with 3 of e very card I need. I've deliberately gone way over in order to get Viligant Dunedain intobthe discard pile.\n\nThe idea of buffing up vigilant Dunedain came from a deck I saw on Rungs DB.\n\nI also realise I just need to quest hard and use Thrors Key where I can to negate some of the locations text.\n\n\n\n60 card deck.\n\nPlay C铆rdan The Shipwright, Galadriel and owyn spirit.\n\nThreat 30\n\nDraw: Ethir Swordsman, Galadriel's Handmaiden, Thr贸r's Key, Tale Of Tin煤vuel, Map Of Earnil and Silvan Refugee.\n\nMulligan: Elrond's Council, Light Of Valinor, Ethir Swordsman, Nenya, Ered Luin Miner and Galadriel's Handmaiden.\n\nApart from the miner in hand a great start with the attachments.\n\nSetup.\n\nDiscard 14 cards:\n\nStand and Fight\n\nElrond's Council\n\nMap of Earnil\n\nPelargir Shipwright\n\nMap of Earnil\n\nVigilant D煤nadan\n\nThr贸r's Key\n\nSilvan Refugee\n\nReforged\n\nVigilant D煤nadan\n\nStand and Fight\n\nTale of Tin煤vuel\n\nThr贸r's Key\n\nDwarf Pipe.\n\nAdd Torech Gorgor Patrol to staging.\n\nDiscard and add The Tunnels of Torech Gorgor.\n\nSearch and put the One Ring on C铆rdan.\n\nSearch and add Inner Strength to hand\n\n\n\nTurn 1\n\nDraws Silver Harp and Thr贸r's Key (discard)\n\nPlanning: play Nenya and Silver Harp on Galadriel.\n\nQuest: commit C铆rdan and owyn for 8 WP.\n\nGaladriel uses Nenya to add 4 WP toC铆rdan.\n\nStages Twisted Tunnel. Puts Spawn Of Shelob into play.\n\nPlay Elrond's Council on C铆rdan. TD 27\n\n6 threat vs 13 WP. 7 progres made. Limited to 5 on stage 1.\n\nTravel: forced to travel to Twisted Tunnel.\n\nEngagement: Spawn of Shelob engages. Choose to discard Narya.\n\nCombat: spider attacks undefended for 2. (Shadow is Ransacked Supplies. Discards Silver Harp.) 2 damage on Galadriel.\n\nRefresh: TD 28\n\nDiscards 3 cards: Ethir Swordsman, Nenya and Galadriel's Handmaiden.\n\n\n\nTurn 2\n\nDraws Arwen Und贸miel and Pelargir Shipwright (discard)\n\nPlanning: play Arwen Und贸miel. Play Light of Valinor on C铆rdan.\n\nQuest: commit C铆rdan, owyn and Arwen (doesn't exhaust)for 10WP.\n\nGaladriel uses Nenya and buffs C铆rdan.\n\nStages Burning Reek. Doomed 1 TD 28. Discards 4 cards: Silver Harp, Light Of Valinor, Dwarven Tomb and Silvan Refugee.\n\n3 threat vs 14 WP. 11 progress made. 2 explores Twisted Tunnel and puts a resource on TTOTG. 5 progress made on stage 1\n\nCombat: Arwen Und贸miel defends the spider. +1 def to herself. (Shadow is Hideous Deeps. No Effect.) No damage.\n\nC铆rdan attacks the spider and deals 1 damage.\n\nRefresh: TD 29.\n\nDiscards 3 cards: Silvan Refugee, Tale of Tin煤vuel and Galadriel's Handmaiden.\n\n\n\nTurn 3\n\nDraws Dwarven Tomb and Vigilant D煤nadan (discard)\n\nPlanning: play Inner Strength on C铆rdan.\n\nPlay Dwarven Tomb to pull Silver Harp from the discard pile.\n\nQuest: commit C铆rdan, owyn and Arwen for 10 WP. Arwen buffs Cirdan's defence\n\nGaladriel uses Nenya to buff C铆rdan.\n\nStages Mordor Cave Troll.\n\n6 Threat vs 14 WP. Makes 8 progress. Limited to 5 progress on stage 1.\n\nCombat: C铆rdan defends the spider for 4 def. (Shadow is Ash Mountain Werewolf. No effect.) No damage.\n\nRefresh: TD 30\n\nDiscard 3 cards: Ethir Swordsman, Dwarf Pipe and Hidden Cache (add 2 resource to C铆rdan).\n\n\n\nTurn 4\n\nDraws Arwen and Silver Harp (discard)\n\nPlanning: play Silver Harp on Galadriel.\n\nPlay Galadriel's Handmaiden. TD 29\n\nQuest: commit C铆rdan, owyn and Galadriel's Handmaiden (doesn't exhaust) for 10 WP.\n\nGaladriel uses Nenya to buff C铆rdan.\n\nStages Ransacked Supplies. Discards Pelargir Shipwright. +3 threat to staging.\n\n9 threat vs 14 WP. 5 progress made on stage 1\n\nCombat: Arwen defends the spider for 2 def(buffs herself). (Shadow is Crumbling Passage. No effect.) No damage.\n\nC铆rdan attacks and defeats the spider.\n\nRefresh: TD 30\n\nDiscards 3 cards: Reforged, Stand and Fight and Light of Valinor.\n\n\n\nTurn 5\n\nDraws Hidden Cache and Map of Earnil (harp saves)\n\nPlanning: play Ethir Swordsman.\n\nQuest: commit C铆rdan, owyn, and Ethir Swordsman (doesn't exhaust) and Galadriel's Handmaiden for 12WP\n\nGaladriel uses Nenya to buff C铆rdan.\n\nStages Twisted Tunnel. Pulls Ash Mountain Werewolf.\n\n10 threat vs 16 WP. 5 progress made on stage 1 clearing it.\n\nSearches and takes A Haunt for Beasts. Adds Namless Beast to staging.\n\nTravel: forced to travel to Twisted Tunnel.\n\nEngagement: Ash Mountain Werewolf and Namless Beast engages.\n\nI really needed to engage the Patrol this round in order to race through the quest uninhibited in 2 turns but I've got too many enemies now. I really need the Vigilant D煤nadan.\n\nI think making this deck 60 cards was a mistake. Most of my cards I needed were discarded.\n\nI'll trim it down and try again.\n\nScooped.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940458","commentId":3940458,"userName":"asgardianphil","timestamp":1589642767,"content":"Game 12.\n\nSame deck but trimmed to 50 cards with a couple of tweaks.\n\n\n\nHeroes C铆rdan The Shipwright, owyn and Galadriel.\n\nTD 30\n\nDraws: Ethir Swordsman, Thr贸r's Key, Light of Valinor, Elrond's Council, Dwarf Pipe and Ioreth.\n\nMulligan I need Silver Harp and Nenya.\n\nDraws: Nenya, Light of Valinor, Nenya, Map of Earnil, Stand and Fight and Elrond's Council.\n\nSetup.\n\nDiscards 4 cards\n\nErebor Toymaker\n\nErebor Toymaker\n\nTale of Tin煤vuel\n\nGaladriel's Handmaiden.\n\nPut Torech Gorgor Patrol in staging.\n\nDiscard cards and put The Tunnels Of Torech Gorgor in staging.\n\nSearch for the One Ring and put it on C铆rdan.\n\nSearch and add Inner Strength to hand.\n\n\n\nTurn 1\n\nDraws Elrond's Council (discard)and Arwen Und贸miel.\n\nPlanning: play Nenya on Galadriel. Play Light of Valinor and Inner Strength on C铆rdan.\n\nQuest: commit C铆rdan and owyn. And Galadriel uses Nenya to boost C铆rdan. 12WP\n\nStages Firey Chasm.\n\n6 threat vs 12 WP. 6 progress made. 5 on Stage 1.\n\nTravel: forced to travel to Firey Chasm.\n\nRefresh: TD 31\n\nDicards 3 Cards: Narya, Arwen Und贸miel and Nenya.\n\n\n\nTurn 2\n\nDraws Reforged (discard) and Stand And Fight.\n\nPlanning: play Arwen Und贸miel.\n\nQuest: commit C铆rdan, owyn and Arwen Und贸miel (doesn't exhaust). Galadriel uses Nenya to buff C铆rdan. 14 WP.\n\nStages A Haunt for Beasts.\n\n4 Threat vs 14 WP. 10 progress made. 5 on Firey Chasm explores it. Dicards 4 cards: Dwarf Pipe, The Galadhrims Greeting, Silver Harp and Reforged. 1 resource on TTOTG and 5 progress on stage 1\n\nEngagement: engage Torech Gorgor Patrol. Immediate attack. Arwen defends for 1. (Adds 1 def to C铆rdan). Shadow is Ash Mountain Werewolf. (Discrds 2 cards if destroys a character). Arwen is destroyed. Dicards Dwarf Pipe and Ethir Swordsman.\n\nCombat: C铆rdan defends the Patrol for 4 def. (Shadow is Orc Passage. No effect). 1 damage on C铆rdan.\n\nRefresh: TD 32\n\nDiscards 4 cards: Ioreth, Map of Earnil, Vigilant D煤nadan and Light of Valinor.\n\n\n\nTurn 3\n\nDraws Pelargir Shipwright and Galadriel's Handmaiden (discard).\n\nPlanning: play Stand and Fight to play Arwen Und贸miel. Play Stand and Fight to play Ioreth. Play Map of Earnil on owyn. Leaves 1 resource on Galadriel.\n\nQuest: choose a Haunt for Beasts as the current quest.\n\nCommit C铆rdan, owyn and Arwen Und贸miel (doesn't exhaust). Galadriel uses Nenya to buff C铆rdan. 14 WP.\n\nStages Lost in the Dark. Puts 10 cards under threat dial. 14 progress made clears A Haunt for Beasts side quest.\n\nCombat: C铆rdan defends the Patrol for 3 def. (Shadow is Spawn of Shelob. Exhaust Arwen. She buffs Cirdan's def.) 5 att vs 4 def. 1 damage.\n\nRefresh:TD 33 and discards Erebor Toymaker from under it.\n\nDiscards 3 cards: Reforged, Pelargir Shipwright and Narya.\n\n\n\nTurn 4\n\nDraws Silver Harp and Thr贸r's Key (discard)\n\nPlanning: play Silver Harp on C铆rdan. Leaves 2 resources on Galadriel\n\nQuest: choose Lost in the Dark as the current quest. Commit C铆rdan, owyn and Arwen. She buffs Cirdan's defence. Galadriel uses Nenya to buff C铆rdan. 14 WP\n\nStages Torech Gorgor Patrol.\n\n4 threat vs 14 WP. 10 progress made on Lost in the Dark clearing it. Shuffles 9 cards back into deck.\n\nCombat: C铆rdan defends the Patrol for 4 def. (Shadow is Crumbling Passage. No effect). 1 damage to C铆rdan. Ioreth heals C铆rdan.\n\nRefresh: TD 34.\n\nDiscards 3 cards: Silver Harp, Dwarf Pipe and Tale of Tin煤vuel.\n\n\n\nTurn 5\n\nDraws Thr贸r's Key and Map of Earnil ( Harp saves)\n\nplanning: use Map of Earnil to play Stand and Fight from discard to play Vigilant D煤nadan. Cost 4 spirit resource.\n\nQuest: commit C铆rdan, owyn and Arwen Und贸miel. Arwen buffs the Vigilant D煤nadan. Galadriel uses Nenya to buff C铆rdan.\n\nPlay Elrond's Council to buff C铆rdan. TD 31\n\n15 WP\n\nStages Mordor Cave Troll. (Wow. Lowered threat just in time)\n\n6 threat vs 15 WP. 9 progress made. Limited to 5 on stage 1. (15 total)\n\nLooking at the board state now. I can't win with only 9 cards left in my deck. And loosing 3 a turn. I have to make 10 more progress on stage 1 and 25 on stage 2.\n\nI really like the idea of questing hard like this deck does bit it also has to be able to pull the Patrol out and be able to deal with it every round. The Vigilant D煤nadan is a great idea to defending everything but I need to seriously buff it's defense. Maybe switching to tactics owyn might help to get some defense. And she can also deal with 1 Patrol or Troll."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940471","commentId":3940471,"userName":"asgardianphil","timestamp":1589645213,"content":"I think I Have an idea. Scrap the Vigilant D煤nadan part of the deck. Put in 3 Unexpected courages for C铆rdan. Boost his defense with Lords of The Eldar which is playable only from the dicard pile. And put in 3 copies of Ride Them Down. Which will allow the quest points to take out the Patrol."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940628","commentId":3940628,"userName":"asgardianphil","timestamp":1589681222,"content":"Game 13.\n\n\n\nHeroes C铆rdan The Shipwright, owyn and Galadriel.\n\nTD 30 55 card deck.\n\nDraw: Pelargir Shipwright, Silver Harp, Lords of The Eldar, Erebor Toymaker, Elrond's Council and Ioreth.\n\nKeep this Hand due to Silver Harp.\n\nSerup\n\nDisards 9 cards\n\nElrond's Council\n\nArwen Und贸miel\n\nGaladriel's Handmaiden\n\nNenya\n\nReforged\n\nEthir Swordsman\n\nSilver Harp\n\nUnexpected Courage\n\nStand and Fight.\n\nAdd Torech Gorgor Patrol to staging\n\nAdd Overwhelming Darkness to staging.\n\nSearch and put One Ring on C铆rdan.\n\nSearch and add Inner Strength to hand.\n\n\n\nTurn 1\n\nDraws Lords of the Eldar (discard) and Ride Them Down.\n\nPlanning: play Erebor Toymaker. Discards Thr贸r's Key. Play Silver Harp discounted by the toymaker on Galadriel.\n\nExhaust Galadriel. TD 29. Draws Map of Earnil.\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nCommit owyn, C铆rdan and Erebor Toymaker (doesn't exhaust) for 10 WP.\n\nStages Twisted Tunnel. Puts Spawn of Shelob in staging.\n\nPlay Elrond's Council. TD 26 discards Silver Harp.\n\nDiscards Lords of The Eldar to buff owyn. Silver Harp returns it.\n\n6 threat vs 12 WP. 6 progress made on Overwhelming Darkness clearing it. Shuffles 3 cards back into deck.\n\nTravel: to Twisted Tunnel.\n\nEngagement: Spawn of Shelob engages. Choose to discard Nenya.\n\nCombat: Spider attacks undefended. (Shadow is Narrow Opening. No effect). 2 damage on Galadriel.\n\nRefresh:TD 27.\n\nDiscards 2 cards Erebor Toymaker and Elrond's Council.\n\n\n\nTurn 2\n\nDraws Nenya and Pelargir Shipwright (harp returns)\n\nPlanning: play Nenya on Galadriel. (Paid by C铆rdan)\n\nPlay Ioreth.\n\nQuest: commit C铆rdan, owyn and Erebor Toymaker. Galadriel uses Nenya to buff C铆rdan. 14 WP.\n\nStages Nameless Beast.\n\n5 Threat vs 14 WP. 9 progress made. 2 on Twisted Tunnel explores it. 5 progress made on stage 1.\n\nCombat: spider attacks undefended. ( shadow is Spawn of Shelob. Exhaust Ioreth). 2 damage on owyn.\n\nRefresh: TD 28.\n\nDiscards 2 cards Lords of the Eldar and Map of Earnil.\n\n\n\nTurn 3\n\nDraws Stand And Fight and Ride Them Down (Harp returns to hand)\n\nPlanning: play Pelargir Shipwright.\n\nQuest: commit C铆rdan, owyn, Erebor Toymaker and Pelargir Shipwright (doesn't exhaust). Galadriel uses Nenya to buff C铆rdan.\n\nStages Mordor Cave Troll.\n\nPlay Ride Them Down and Choose Torech Gorgor Patrol.\n\n8 threat vs 17 WP. 9 progress. Puts 9 damage on the Patrol defeating it.\n\nCombat: Spider attacks undefended. (Shadow is Ash Mountain Werewolf. No effect). 2 damage on C铆rdan.\n\nRefresh: TD 29\n\nDiscards Arwen Und贸miel and Ethir Swordsman.\n\n\n\nTurn 4\n\nDraws Ethir Swordsman and Galadriel's Handmaiden (Harp returns to hand).\n\nPlanning: play Stand and Fight to play Arwen Und贸miel from discard pile.\n\nQuest: commit owyn, Arwen Und贸miel (doesn't exhaust), Pelargir Shipwright and Erebor Toymaker. Galadriel uses Nenya to buff owyn. 15 WP.\n\nStages Firey Chasm.\n\n8 Threat vs 15 WP. 7 progress made on stage 1.\n\nCombat: Arwen defends the spider. +1 def to herself. (Shadow is Torech Gorgor Patrol. No effect). No damage. C铆rdan attacks the spider and deals 1 damage.\n\nRefresh: TD 30.\n\nDiscard 2 cards Ride Them Down and Thr贸r's Key.\n\n\n\nTurn 5\n\nDraws Silver Harp and Light of Valinor (Harp returns to hand).\n\nPlanning: play Light of Valinor on C铆rdan.\n\nQuest: commit C铆rdan, owyn, Pelargir Shipwright and Erebor Toymaker. Galadriel uses Nenya to buff owyn. 17WP.\n\nStages Hideous Deeps. It grabs 3 cards from too of player deck.\n\nPlay Ride Them Down. Choose Namless Beast.\n\nThreat 11 vs 17 WP. 6 progress made. 6 damage on Namless Beast defeating it.\n\nTravel: to Hideous Deeps.\n\nCombat: Arwen defends the spider. +1 def to herself. (Shadow is Twisted Tunnel. Discards The Tunnels of Torech Gorgor side quest. No effect) no damage.\n\nC铆rdan attacks and defeats the spider.\n\nRefresh: TD 31\n\nDiscards 2 cards Unexpected Courage and Galadriel's Handmaiden.\n\n\n\nTurn 6\n\nDraws Light of Valinor and Arwen Und贸miel (harp returns to hand)\n\nPlanning: play Galadriel's Handmaiden. TD 30.\n\nPlay Inner Strength on C铆rdan.\n\nQuest: commit C铆rdan, owyn Galadriel's Handmaiden (doesn't exhaust), Arwen, Pelargir Shipwright and Erebor Toymaker. (Arwen buffs Cirdan's defence). Galadriel uses Nenya to buff C铆rdan. 21 WP.\n\nStages Writhing Shadows. Assigns 2 damage. 1 to owyn and 1 to Pelargir Shipwright.\n\nThreat 5 vs 21 WP. 16 progress made. 6 on Hideous Deeps exploring it and shuffles the 3 cards back into deck 10 progress on stage 1 (22 total).\n\nRefresh: TD 31\n\nDiscards 2 Cards: Stand And Fight and Thr贸r's Key.\n\n\n\nTurn 7\n\nDraws Dwarf Pipe and Map of Earnil (harp returns to hand.)\n\nPlanning: play map of Earnil on owyn.\n\nPlay Dwarf Pipe on Erebor Toymaker.\n\nQuest: commit C铆rdan, owyn Pelargir Shipwright Arwen and Erebor Toymaker for 15 WP. Arwen buffs C铆rdan.\n\nStages Crumbling Passage. Becomes active location. (Wow... this is exactly why I didn't commit everything this time as i only need to make 3progress).\n\nThreat 5 Vs 15 WP 10 progress made. 3 on Crumbling Passage explores it. Damages each exhausted character. 7 progress on stage 1 clearing it.\n\nAdvances to stage 2.\n\nSearches and puts A Haunt for Beasts in stageing. Shuffle and discard until Spawn of Shelob. Add it to staging.\n\nEngagement: Spawn of Shelob engages. Choose its attack buff. C铆rdan defends for 4 def. (Shadow is Burning Reek. Would return to staging or discard 2 cards. Use Inner Strength to cancel. TD 32. ) no damage.\n\nIoreth heals owyn.\n\nGaladriel exhausts to reduce threat TD 31 and draws Unexpected courage.\n\nRefresh: TD 32\n\nDiscard 3 cards: Pelargir Shipwright, Erebor Toymaker and The Galhadrims Greeting (pipe saves)\n\n\n\nTurn 8\n\nDraws Dwarf Pipe and Lught of Valinor (harp returns)\n\nPlanning: play Pelargir Shipwright.\n\nQuest: commit C铆rdan, owyn, x2 Pelargir Shipwright (1 doesn't exhaust), Galadriel's Handmaiden, Arwen, and Erebor Toymaker.\n\nArwen buffs Cirdan's defence.\n\nGaladriel uses Nenya to buff C铆rdan.\n\nDiscard Lords of the Eldar to buff owyn.\n\nTotal WP. 25.\n\nStages Spawn of Shelob. Surges into Fiery Chasm.\n\n10 threat vs 25 WP. 15 progress made on stage 2\n\nEngagement: Spawn of Shelob engages. Chooses the attack buff.\n\nCombat: C铆rdan defends the 4 attack spider with 4 def. (Shadow is Fiery Chasm. No effect.) No damage.\n\nSpawn of Shelob attacks for 2 undefended. (Shadow is Ransacked Supplies. Discard Map of Earnil. ) 2 damage on owyn.\n\nRefresh: TD 33\n\nDiscards 3 cards: dwarf Pipe, Elrond's Council (pipe saves) and Reforged.\n\n\n\nTurn 9\n\nDraws Thr贸r's Key and Reforged (harp returns to hand)\n\nPlanning: nothing. Saving resources to play Lords of the Eldar as I have 3 Noldor in play.\n\n2 cards left in my deck, I have to make 10 progress to win this turn.\n\nQuest: commit C铆rdan, owyn, x2 Pelargir Shipwrights, Galadriel's Handmaiden, Arwen Und贸miel and Erebor Toymaker. 20 WP. Arwen buffs Cirdan's defence.\n\nPlay Lords of the Eldar from discard pile. +1 stats to Galadriel, C铆rdan and Arwen.\n\nGaladriel uses Nenya to buff C铆rdan 5 WP\n\nDiscard Light of Valinor from hand to buff owyn.\n\nTotal WP 28.\n\nStages Torech Gorgor Patrol (#%#%@%@!) Limits progress to 5.\n\nGame over.\n\n\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940670","commentId":3940670,"userName":"Alonewolf87","timestamp":1589703244,"content":"> 6 hours ago, asgardianphil said:\n> \n> Stages Torech Gorgor Patrol (#%#%@%@!) Limits progress to 5.\n> \n> Game over.\n\nDang so close, sorry"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940694","commentId":3940694,"userName":"asgardianphil","timestamp":1589715897,"content":"Cheers. It definitely teaches respect for the game. It's a difficult lesson.\n\nI've trimmed some cards out that weren't getting a lot of use to get to 50 cards again.\n\n( took out x2 Lords of the Eldar. I only need one in the deck. 1 copy each of the pipe, map and key.)\n\n\n\nGame 13\n\n50 cards\n\nHeroes C铆rdan the Shipwright, owyn and Galadriel.\n\nTD 30\n\nDraws Stand And Fight, Nenya, Galadriel's Handmaiden, Thr贸r's Key, Pelargir Shipwright and Erebor Toymaker.\n\nNo silver Harp or light of valinor.\n\nNeed to mulligan.\n\nDraws: Ride Them Down x2, Map of Earnil The Galadhrims Greeting, Arwen Und贸miel and Pelargir Shipwright.\n\nSetup.\n\nDiscards 4 cards:\n\nUnexpected Courage, Ioreth, Nenya and Arwen Und贸miel.\n\nPut Torech Gorgor Patrol in staging.\n\nPut The Tunnels of Torech Gorgor in staging.\n\nSearch for the One Ring and put it on C铆rdan. Search for Inner Strength and put in hand.\n\n\n\nTurn 1\n\nDraws Unexpected Courage and Elrond's Council (discards).\n\nPlanning: exhaust Galadriel. TD 29 draws Dwarf Pipe.\n\nPlanning: play Arwen Und贸miel. Play Inner Strength on C铆rdan.\n\nQuest: commit C铆rdan, owyn and Arwen Und贸miel (doesn't exhaust). 10 WP\n\nStages Hideous Deeps. Grabs 3 cards.\n\nThreat 6 vs 10 WP. 4 progress made on stage 1\n\nTravel: forced to travel to Hideous Deeps.\n\nRefresh: TD 30\n\nDiscards 3 cards: Nenya, Erebor Toymaker and Silver Harp.\n\n\n\nTurn 2\n\nDraws Ethir Swordsman (discard) and Silver Harp.\n\nPlanning: play Silver Harp on Galadriel.\n\nExhaust Galadriel. TD 29 draws Arwen Und贸miel.\n\nQuest: commit C铆rdan, owyn and Arwen. 10 WP.\n\nArwen buffs Cirdan's defence.\n\nStages Writhing Shadows. Assigns 3 damage and exhausts character. (2 on Galadriel and 1 on owyn).\n\nThreat 3 vs 10 WP. Makes 6 progress on Hideous Deeps exploring it. Shuffles 3 cards back into deck. Put 1 resource on TToTG.\n\nRefresh: TD 30\n\nDiscards 3 cards: Stand And Fight, Light of Valinor and Ride Them Down.\n\n\n\nTurn 3\n\nDraws Reforged and Stand And Fight (harp returns).\n\nPlanning: play Reforged to play Light of Valinor on C铆rdan. (AS FAR AS I UNDERSTAND IT REFORGED AND STAND AND FIGHT WONT WORK ON NEUTRAL CARDS. HAVE I GOT THAT RIGHT?)\n\nPlay Stand And Fight to play Ioreth.\n\nExhuast Galadriel. TD29. Draws Ethir Swordsman.\n\nPlay Unexpected Courage on C铆rdan.\n\nQuest: commit C铆rdan, owyn and Arwen. 10 WP. Arwen buffs Cirdan's defence.\n\nStages Spawn of Shelob which surges into Burning Reek. Doomed 1. TD30 discards 5 cards: Nenya, Elrond's Council, Map of Earnil, Reforged and Silver Harp.\n\nSpider turned up just in time to stop me engaging the Patrol.\n\nThat's it, no more Nenya in this game.\n\nThreat 4 vs 10 WP. 6 progress made. 5 on stage 1.\n\nEngagement: Spawn of Shelob engages. Choose the +2 attack.\n\nC铆rdan defends the spider for 4 def. (Shadow is Crumbling Passage. No effect). No damage.\n\nC铆rdan readies with Unexpected Courage.\n\nC铆rdan attacks the spider for 2. Deals 1 damage\n\nRefresh: TD 31\n\nDiscards 3 cards: Galadriel's Handmaiden, Erebor Toymaker and Light of Valinor.\n\n\n\nTurn 4\n\nDraws Unexpected Courage and Pelargir Shipwright (harp returns)\n\nPlanning: play Ethir Swordsman. Play Unexpected Courage on C铆rdan.\n\nQuest: commit C铆rdan, owyn Arwen Und贸miel and Ethir Swordsman (doesn't exhaust) 12 WP\n\nArwen buffs Cirdan's defence.\n\nStages Narrow Opening.\n\n6 threat vs 12 WP. 5 progress on stage 1.\n\nTravel: forced to travel to Narrow Opening.\n\nEngagement: engage Torech Gorgor Patrol. Makes an immediate attack. C铆rdan defends for 4. (Shadow is Narrow Opening. No effect) 1 damage onC铆rdan.\n\nC铆rdan readies with Unexpected Courage.\n\nCombat: C铆rdan defends the spider for 4 def. (Shadow is Ash Mountain Werewolf. No effect.) No damage.\n\nC铆rdan readies with Unexpected Courage.\n\nC铆rdan defends the Patrol for 4 def. (Shadow is Fiery Chasm. No effect) 1 damage on C铆rdan.\n\nRefresh: TD 32\n\nDiscards 3 cards: Light Of Valinor, Lords of the Eldar and Erebor Toymaker.\n\n\n\nTurn 5\n\nDraws Galadriel's Handmaiden and Thr贸r's Key (harp returns)\n\nPlanning: play Galadriel's Handmaiden. TD 31.\n\nI want to play Thr贸r's Key on owyn but Narrow Passage prohibits me.\n\nQuest: commit C铆rdan, owyn, Arwen, Ethir Swordsman and Galadriel's Handmaiden (doesn't exhaust) 14 WP. Arwen buffs Cirdan's defence.\n\nStages Crumbling Passage. It becomes the active location.\n\n3 Threat vs 14 WP. 11 progress. 3 explores Crumbling Passage. Deals 1 damage to each exhausted character. Defeats Ethir Swordsman. Puts 1 resource on TToTG. 8 progress on stage 1. (Total 22)\n\nTravel: forced to travel to Narrow Opening.\n\nCombat: C铆rdan defends the spider for 4 def. (Shadow is Namless Beast. +2 att.) No damage. C铆rdan readies with Unexpected Courage.\n\nC铆rdan defends the Patrol for 4 def. (Shadow is Fiery Chasm. No effect.) 1 damage on C铆rdan. C铆rdan readies with Unexpected Courage.\n\nC铆rdan attacks the spider and defeats it.\n\nIoreth heals C铆rdan.\n\nRefresh: TD 32\n\nDiscards 3 cards Pelargir Shipwright, Reforged and Galadriel's Handmaiden.\n\n\n\nTurn 6\n\nDraws Stand And Fight and Ethir Swordsman (harp returns)\n\nPlanning: play Pelargir Shipwright.\n\nQuest: commit C铆rdan, owyn, Arwen, Galadriel's Handmaiden and Pelargir Shipwright (doesn't exhaust). 15 WP Arwen buffs Cirdan's defence.\n\nStages Ransacked Supplies. Discards Elrond's Council adding 0 threat.\n\nThreat 0 vs 15 WP. 15 progress made. 3 on Narrow Passage exploring it. Discard Dwarf Pipe from hand. Put 1 resource on TToTG. 12 progress on stage 1 clearing it\n\nAdvance to stage 2. However only 2 cards left in my deck.\n\nGame over. C铆rdan is great and his card draw is welcome but ultimately he's helping the encounter deck by drawing an extra card each round.\n\nThe Dwarf Pipes are useless without a dwarf and the Ered Luin Miners whiff in your hand more than getting out for free.\n\nI think I'm almost there but I need to tweak some more.\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940699","commentId":3940699,"userName":"Durins_Father","timestamp":1589718074,"content":"During a livestream last night, me and the Card Talk crew finally beat the scenario 3p.unknown.png?width=1158&height=658 [https://media.discordapp.net/attachments/453351730428510228/711406451071123516/unknown.png?width=1158&amp;height=658]\n\nWe got lucky though, we had to use 2 players to take on all enemies and I had to rely on a lucky draw for Untroubled by Darkness to quest through to the end. Final encounter card was a Hideous Deeps, which took 3 of the 4 cards left in my player deck. So with 1 card left in my deck and 2 dead players (Mono-Lore VD deck and a Silvan deck) we eventually won. But we wouldn't have made it for another turn, and if that Reek treachery came up, or the Torech Gorgor Patrol, then we would have lost.\n\nThe strategy used was to have the mono-Lore deck use high cost Lore cards to deal with the quest, for instance The Great Hunt for the Patrol and Gildor's Counsel to reduce the encounter cards per round. Haldir+Legacy Bladehelped out with ranged attacks to kill Werewolves and Spiders. Dwarves had to rely on Untroubled by Darkness and Dain Ironfoot to quest hard whenever we could. We used Naith Guides from the Silvan deck to keep Sulien ready and used Lore resources to use her ability to basically quest double and not be affected by location lock. Dwarves also had a lot of recursion with Dwarf Pipe, To Me O My Kinsfolk, etc. Silvan deck provided additional support with questing and Ranged attacks, but was the first to die. The good thing is that if you know you are going to get decked, you can have that player take the biggest enemies and help the other players as much as possible so that they have an easier time. Including Ered Luin Miners and Hidden Caches is also highly advised! I discarded 3 Hidden Cashes at once, setting me up with enough resources to afford my allies. Ered Luin Miner got discarded for setup, so I started with a free ally, which is nice for the deck to get to 5 Dwarves quickly. Ever My Heart Rises eventually got discarded to a shadow effect, but it was free threat reduction and readying for my Dwarves since all locations are Underground.\n\nAll in all, the quest is very brutal, and we won by YOLO-questing on the final turn, with 2 encounter cards that could have cost us the game. But the victory was very sweet in the end (especially since it was 4am for me at the time)\n\nBest of luck with your games everyone. Looking forward to your strategies."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940742","commentId":3940742,"userName":"MikeGracey","timestamp":1589727493,"content":"> 2 hours ago, Durins_Father said:\n> \n> During a livestream last night, me and the Card Talk crew finally beat the scenario 3p.unknown.png?width=1158&height=658 [https://media.discordapp.net/attachments/453351730428510228/711406451071123516/unknown.png?width=1158&amp;height=658] [https://media.discordapp.net/attachments/453351730428510228/711406451071123516/unknown.png?width=1158&height=658]\n> \n> We got lucky though, we had to use 2 players to take on all enemies and I had to rely on a lucky draw for Untroubled by Darkness to quest through to the end. Final encounter card was a Hideous Deeps, which took 3 of the 4 cards left in my player deck. So with 1 card left in my deck and 2 dead players (Mono-Lore VD deck and a Silvan deck) we eventually won. But we wouldn't have made it for another turn, and if that Reek treachery came up, or the Torech Gorgor Patrol, then we would have lost.\n> \n> The strategy used was to have the mono-Lore deck use high cost Lore cards to deal with the quest, for instance The Great Hunt for the Patrol and Gildor's Counsel to reduce the encounter cards per round. Haldir+Legacy Bladehelped out with ranged attacks to kill Werewolves and Spiders. Dwarves had to rely on Untroubled by Darkness and Dain Ironfoot to quest hard whenever we could. We used Naith Guides from the Silvan deck to keep Sulien ready and used Lore resources to use her ability to basically quest double and not be affected by location lock. Dwarves also had a lot of recursion with Dwarf Pipe, To Me O My Kinsfolk, etc. Silvan deck provided additional support with questing and Ranged attacks, but was the first to die. The good thing is that if you know you are going to get decked, you can have that player take the biggest enemies and help the other players as much as possible so that they have an easier time. Including Ered Luin Miners and Hidden Caches is also highly advised! I discarded 3 Hidden Cashes at once, setting me up with enough resources to afford my allies. Ered Luin Miner got discarded for setup, so I started with a free ally, which is nice for the deck to get to 5 Dwarves quickly. Ever My Heart Rises eventually got discarded to a shadow effect, but it was free threat reduction and readying for my Dwarves since all locations are Underground.\n> \n> All in all, the quest is very brutal, and we won by YOLO-questing on the final turn, with 2 encounter cards that could have cost us the game. But the victory was very sweet in the end (especially since it was 4am for me at the time)\n> \n> Best of luck with your games everyone. Looking forward to your strategies.\n\nHi Durins Father will you guys be posting the video somewhere? if like to watch that play through"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940799","commentId":3940799,"userName":"asgardianphil","timestamp":1589739625,"content":"Well done guys. Super victory. I'm almost there with solo play.\n\nI've tweaked my deck again. Substituted C铆rdan for Beregond. I'm thinking of engaging the Patrol as early as possible and capturing it with Forrest Snare using Reforged to play it from discard. If I draw it then owyn will discard it.\n\nI was toying with the idea of replacing Galadriel with Glorfindel spirit but I want the threat reduction and card draw she brings in searching for Nenya. I've changed the Toymaker for Miners too.\n\n\n\nGame 14\n\n50 cards\n\nHeroes: Beregond, Galadriel and owyn\n\nThreat Dial 28\n\nMono spirit.\n\nDraws: Ride Them Down, Forrest Snare, Galadriel's Handmaiden, Nenya, Ered Luin Miner and Unexpected Courage.\n\nGreat starting hand bar theminer. Almost too good to be true.\n\nSetup\n\nDiscards 4 cards:\n\nIoreth\n\nArwen Und贸miel\n\nUnexpected Courage\n\nEred Luin Miner (put in play)\n\nPut Torech Gorgor Patrol in staging\n\nPut The Tunnels of Torech Gorgor in staging. (I think this is the toughest one due to taking a minimum of 4 turns if you get locations out).\n\nSearch for the One Ring and put it on Beregond.\n\nSearch for Inner Strength and add to hand.\n\n\n\nTurn 1\n\nDraw Pelargir Shipwright.\n\nPlanning: play Inner Strength and Unexpected Courage on Beregond.\n\nExhaust Galadriel. TD 27. Draws Ride Them Down.\n\nQuest: commit owyn and Ered Luin Miner. 5WP. owyn discards Forrest Snare. +1 WP.\n\nStages Mordor Cave Troll.\n\n6 threat vs 6WP. No progress made.\n\nEngagement: optionally engage the Patrol. Makes an immediate attack. Beregond defends for 5. (Shadow is Twisted Tunnel. Discard Ash Mountain Werewolf. Add to staging).\n\nI took a gamble here thinking if I use Inner Strength the next shadow might remove an attachment. Hopefully I can ride it down) no damage to Beregond and he reduces threat. TD 26. Beregond readies with Unexpected Courage.\n\nCombat: Beregond defends the Patrol for 5 def. (Shadow is Fearful Shadows. Cannot ready... Use Inner Strength to cancel it. TD 27.\n\nRefresh: TD 28\n\nDiscards 3 cards Galadriel's Handmaiden, Stand And Fight and Thr贸r's Key.\n\n\n\nTurn 2\n\nDraw Dwarf Pipe.\n\nPlanning: play Galadriel's Handmaiden. TD 27.\n\nPlay Dwarf Pipe on Ered Luin Miner.\n\nGaladriel exhausts. TD 26. Draws Reforged.\n\nQuest: commit owyn, Ered Luin Miner and Galadriel's Handmaiden (doesn't exhaust). 7 WP.\n\nStages Spawn of Shelob; surges into Crumbling Passage. Becomes the active location.\n\n6 Threat Vs 7 WP. 1 progress on Crumbling Passage\n\nEngagement: Spawn of Shelob engages. Choose to buff its attack.\n\nCombat: Beregond defends the spider for 5 def. (Shadow is Writhing Shadows. Makes an additional attack. Cancel with Inner Strength. TD 27. No damage. Beregond reduces threat. TD 26. Beregond readies with Unexpected Courage.\n\nBeregond defends the Patrol for 5 def. (Shadow is Spawn of Shelob. Exhaust Galadriel's Handmaiden.) No Damage.\n\nRefresh: TD 27\n\nDiscards 3 cards Forrest Snare, Map of Earnil and Unexpected Courage (pipe saves)\n\n\n\nTurn 3\n\nDraws Thr贸r's Key.\n\nPlanning: play Nenya on Galadriel. Play Thr贸r's Key on owyn. Leaves 1 resource on Galadriel.\n\nQuest: commit owyn and Ered Luin Miner for 5 WP.\n\nGaladriel uses Nenya to buff owyn.\n\n9 WP\n\nStages Ash Mountain Werewolf... really! Another friggin enemy?\n\n7 Threat vs 9 WP. Makes 2 progress on Crumbling Passage. Deals 1 damage to each exhausted character.\n\nPut 1 progress on TToTG.\n\nCombat: Beregond defends the spider for 5 def. (Shadow is Fearful Shadows. Cannot ready use Inner Strength to cancel. TD 28.) No damage. Reduces threat. TD 27. Beregond readies with Unexpected Courage.\n\nBeregond defends the Patrol. (Shadow is Narrow Opening. No effect). No damage.\n\nRefresh:TD 28\n\nDiscards 3 cards Elrond's Council, Ethir Swordsman and Well Preserved (pipe saves)\n\n\n\nTurn 4\n\nDraws Dwarf Pipe.\n\nPlanning: play Pelargir Shipwright. Leaves 2 resources on Galadriel.\n\nExhaust Galadriel. TD 27. Draws Forrest Snare.\n\nQuest: commit owyn, Pelargir Shipwright (doesn't exhaust), Galadriel's Handmaiden and Ered Luin Miner. 10 WP.\n\nStages Firey Chasm . Attaches Thr贸r's Key. X threat now becomes 0.\n\n7 Threat vs 10 WP. 3 progress made on stage 1.\n\nTravel: forced to travel to Firey Chasm.\n\nCombat: Beregond defends the spider for 5 def. (Shadow is Ransacked Supplies. Destroy an attachment. Use Inner Strength to cancel. TD 28) no damage. Reduces threat.TD 27. Readies with Unexpected Courage.\n\nBeregond defends the Patrol for 5 def. (Shadow is Orc Passage. No effect.) No damage.\n\nRefresh: TD 28\n\nDiscards 3 cards Elrond's Council, Map of Earnil and The Galhadrims Greeting (pipe saves)\n\n\n\nTurn 5\n\nDraws Nenya.\n\nPlanning: play Forrest Snare on Torech Gorgor Patrol. (Galadriel had 3 resources)\n\nGaladriel exhausts. TD 27. Draws Ethir Swordsman.\n\nQuest: commit owyn, Ered Luin Miner, Galadriel's Handmaiden and Pelargir Shipwright for 10 WP.\n\nStages Ash Mountain Werewolf. No way!\n\nowyn discards Nenya.+1 WP.\n\n9 threat Vs 11 WP. 2 progress made on Fiery Chasm.\n\nCombat: Beregond defends the spider with 5 def. ( Shadow is Overwhelming Darkness. No effect). No damage. Reduce threat. TD 26.\n\nRefresh: TD 27.\n\nDiscards 3 cards Galadriel's Handmaiden, Pelargir Shipwright and Map of Earnil (pipe saves)\n\n\n\nTurn 6\n\nDraws Nenya.\n\nPlanning: play Ered Luin Miner. Play Dwarf Pipe on Ered Luin Miner.\n\nQuest: commit owyn, Galadriel's Handmaiden, Pelargir Shipwright and 2 Ered Luin Miners. (1 doesn't exhaust). 11 WP.\n\nGaladriel uses Nenya. +4 WP to owyn.\n\nStages Hideous Deeps. Grabs 3 cards.\n\nThreat 12 vs 15 WP. 3 progress on Fiery Chasm explores it. Put 1 resource on TToTG.\n\nTravel: forced to travel to Hideous Deeps\n\nEngagement: optionally engage 1 Werewolf.\n\nCombat: Beregond defends spider for 5 def. (Shadow is Burning Reek. Return to staging. ) no damage. Beregond reduces threat to TD 26. Beregond readies with Unexpected Courage.\n\nBeregond defends the Werewolf for 5 def. (Shadow is Ransacked Supplies . Uses Inner Strength to cancel TD 27. No damage. Werewolf discards Stand And Fight.\n\nRefresh:TD 28\n\nDiscard 3 cards Ethir Swordsman (pipe saves), Arwen Und贸miel (pipe saves) and Reforged.\n\n\n\nTurn 7\n\nDraws Stand And Fight.\n\nPlanning: play Reforged to put Forrest Snare on the Werewolf.\n\nGaladriel exhausts. TD 27 draws Dwarf Pipe. If had used her for the quest I'd have to engage the 2 Werewolves and the spider.\n\nQuest: commit owyn, Pelargir Shipwright, Galadriel's Handmaiden and 2 Ered Luin Miners. 11WP\n\nStages Lost in the Dark. Puts 10 cards under threat dial. Deck contains exactly 10 cards.\n\nGame over.\n\n\n\nSeems no matter what deck I bring the encounter deck performs in exactly the right way to stop me. Every thing bad happens just at the right time in just the right way.\n\nStill feel the Ered Luin Miners are weak if you have to pay to get them out. But they do go out for free which is nice.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3940973","commentId":3940973,"userName":"Durins_Father","timestamp":1589786170,"content":"> 16 hours ago, MikeGracey said:\n> \n> Hi Durins Father will you guys be posting the video somewhere? if like to watch that play through\n\nThe playthrough can be seen here:\n\n\n\n2 games and a bunch of filler, so don't be alarmed by the runtime"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3941014","commentId":3941014,"userName":"asgardianphil","timestamp":1589806333,"content":"That's awesome I'm watching it in stages. I'm 1 hr 18 mins in and Galadriel has just exhausted to draw Orophin. And it's given me the bug to have mynext game.\n\nI'm keeping my deck the same for this 15th run. I feel like I had the full force of the encounter deck thrown at me early in the last game... troll, spider and 3 werewolves in the early turns.\n\n\n\nGame 15.\n\n50 card deck.\n\nHeroes owyn, Beregond (spirit) and Galadriel. Threat Dial 28\n\nDraws Forrest Snare, Ethir Swordsman, Ered Luin Miner, Stand And Fight, Galadriel's Handmaiden and Unexpected Courage.\n\nThe snare and the Unexpected Courage is a great combo, but without Nenya or Reforged I can't play it.\n\nMulligan\n\nDraws Galadriel's Handmaiden, Dwarf Pipe, Forest Snare, Pelargir Shipwright and Thr贸r's Key.\n\nMuch better. I could really use a Steward of Gondor but couldn't fit it in the deck.\n\nSetup: discards 4 cards-\n\nMap of Earnil\n\nUnexpected Courage\n\nStand And Fight\n\nGaladriel's Handmaiden.\n\nAdd Torech Gorgor Patrol to staging.\n\nAdd Tunnels of Torech Gorgor to staging (oh crap!) I guess Dunedain Pathfinder would be great against this side quest.\n\nSearch and play The One Ring on Beregond.\n\nSearch and add Inner Strength to hand.\n\n\n\nTurn 1\n\nDraws Ered Luin Miner. (See, these hardly ever get discarded for me. )\n\nPlanning: play Inner Strength on Beregond, Nenya on Galadriel and Thr贸r's Key on owyn.\n\nQuest: commit owyn. 4 WP\n\nGaladriel uses Nenya to buff owyn.\n\nTotal 8 WP\n\nStages Narrow Opening. (I think I'll save Thr贸r's Key for a worse location.)\n\n6 threat vs 8 WP. 2 progress made on stage 1.\n\nTravel: forced to travel to Narrow Opening.\n\nRefresh: TD 29\n\nDiscards 3 cards: Pelargir Shipwright, Thr贸r's Key and Ethir Swordsman.\n\n\n\nTurn 2\n\nDraws Nenya.\n\nPlanning: can only play 1 card due to Narrow Opening. Play Ered Luin Miner.\n\nQuest: commit owyn and Ered Luin Miner (doesn't exhaust.) 5 WP. (I'm not trying to clear the location as I don't want to loose my Dwarf Pipe.\n\nStages A Haunt for Beasts.\n\n4 threat vs 5 WP. 1 progress Narrow Opening.\n\nExhaust Galadriel. TD 28. Draws Ered Luin Miner. (Where's an Imladris Stargazer when you need one?)\n\nRefresh:TD 29\n\nDiscards 4 cards Thr贸r's Key, Forrest Snare, Ethir Swordsman and Elrond's Council.\n\n\n\nTurn 3\n\nDraws Reforged.\n\nPlanning: play Reforged to put Unexpected Courage on Beregond. (I need to get the Patrol out of staging.) Leaving 1 resource on Galadriel. (I'm guessing that even though Reforged states to play the attachment at no cost, I haven't actually played 2cards here for the purposes of Narrow Opening? As far as I understand it, the restriction is on playing cards from your hand and paying the full cost)\n\nQuest: commit owyn and Ered Luin Miner.\n\nGaladriel uses Nenya to buff owyn.\n\n9 WP.\n\nStages Firey Chasm. Attach Thr贸r's Key.\n\n4 threat vs 9 WP. 5 progress made. 2 on Narrow Opening explores it. Discards Ered Luin Miner from hand at random. 3 progress made on stage 1. Puts 1 resource on TToTG.\n\nTravel: forced to travel to Firey Chasm.\n\nEngagement: optionally engage the Torech Gorgor Patrol. Makes an immediate attack. Beregond defends with 5 def. (Shadow is Torech Gorgor Patrol. No effect.) No damage. Beregond reduces threat. TD 28.\n\nBeregond readies with unexpected courage.\n\nCombat: Beregond defends the Patrol with 5 def. (Shadow is Twisted Tunnel. (This is what screwed me over last game pulling out an enemy.) Beregond uses Inner strength to cancel it. TD 29. As the side quest can't be cleared if another enemy appears. No damage to Beregond.\n\nRefresh:TD 30\n\nDiscards 4 cards: Ethir Swordsman, Ride Them Down, Nenya and Unexpected Courage.\n\n\n\nTurn 4\n\nDraws Dwarf Pipe.\n\nPlanning: play Dwarf Pipe on Ered Luin Miner. Have 2 resources on Galadriel so next turn can play Forrest Snare on the Patrol.\n\nQuest: chooses A Haunt for Beasts as the current quest.\n\ncommit owyn and Ered Luin Miner. Galadriel uses Nenya to buff owyn.\n\n9 WP.\n\nStages Narrow Opening.\n\nowyn discards Nenya to add 1 WP.\n\n3 threat vs 10 WP. Makes 7 progress. 5 o Firey Chasm explores it. No effect due to Thr贸r's Key. Puts 1 resource on TToTG. 2 progress on A Haunt for Beasts.\n\nTravel: forced to travel to Narrow Opening\n\nCombat: Beregond defends the Patrol with 5 def. (Shadow is Ash Mountain Werewolf. No effect). No damage. Beregond reduces threat. TD 29\n\nRefresh:TD 30\n\nDiscards 4 cards: Pelargir Shipwright, Dwarf Pipe, Forest Snare and Arwen Und贸miel (pipe saves)\n\n\n\nTurn 5\n\nDraws Reforged.\n\nPlanning: play Pelargir Shipwright.\n\nQuest: chooses a Haunt for Beasts as the current quest.\n\nCommit owyn, Pelargir Shipwright (doesn't exhaust) and Ered Luin Miner. 8 WP.\n\nStages Spawn of Shelob. Surges into Namless Beast.\n\nGaladriel uses Nenya to buff owyn.\n\n4 threat vs 12 WP. 8 progress made. 3 on Narrow Opening explores it. Discard Reforged from hand at random. Pit 1 resource on TToTG. 5 progress made on A Haunt for Beasts clearing it.\n\nEngagement: Namless Beast and Spawn of Shelob engages. Discards Ered Luin Miner. (Finally!) And puts it into play.\n\nPelargir Shipwright defends the spider with 1 def. (Shadow is. Ransacked Supplies. Oh No! Have to discard an attachment. Discards Dwarf Pipe. 1 damage on the Shipwright.\n\nBeregond defends Namless Beast with 5 def. Discards Well Preserved and adds 1 to it's attack. (Shadow is Burning Reek. Namless Beast returns to staging.) No damage. Beregond reduces threat. TD 29. Beregond readies with Unexpected Courage.\n\nBeregond defends the Patrol with 5 def. (Shadow is Orc Passage. No effect). No damage.\n\nRefresh:TD 30\n\nDiscards 3 cards Elrond's Council, Stand And Fight and Stand And Fight.\n\n\n\nTurn 6\n\nDraws Map of Earnil.\n\nPlanning: play Map of Earnil on owyn for 1 resource.\n\nUse map to play Reforged from discard pile. Reforged puts Dwarf Pipe on Ered Luin Miner #2. Reforged goes tobottom of deck.\n\nPlay Galadriel's Handmaiden (leaving 2 resources on Galadriel). TD 29.\n\nOnly have 1 card left in hand (Forrest Snare)\n\nQuest: choose TToTG as current quest.\n\nCommit owyn, Pelargir Shipwright and Galadriel's Handmaiden (doesn't exhaust) 9 WP.\n\nStages Mordor Cave Troll.\n\n6 threat vs 9 WP. 3 progress made on TToTG clearing it.\n\nCombat: Beregond defends the Patrol with 5 def. (Shadow is Ransacked Supplies. Relentless! This quest keeps on bringing the hurg. Use Inner Strength to cancel. TD 30. No damage. Beregond reduces threat. TD 29. Beregond defends with Unexpected courage.\n\nBeregond defends the spider with 5 def. (Shadow is Writhing Shadows. Makes an additional attack. ) no damage.\n\nSpider attacks undefended for 2. (Shadow is Fiery Chasm. No effect.) 2 damage on Galadriel.\n\nBoth Ered Luin miners attack the spider for 2. Deals 1 damage.\n\nRefresh:TD 30\n\nDiscards 2 cards: Ride Them Down (piped) and Ride Them Down (piped).\n\n\n\nTurn 7\n\nDraws Ioreth.\n\nPlanning: play Ioreth.\n\nQuest: commit owyn, Pelargir Shipwright and Galadriel's Handmaiden. 9 WP.\n\nStages Ransacked Supplies. Discards Arwen Und贸miel. +2 threat.\n\nGaladriel uses Nenya to buff owyn.\n\nTotal 13 WP\n\n8 threat vs 13 WP. 5 progress made on stage 1. (10 total)\n\nEngagement: Namless Beast engages.\n\nCombat: Beregond defends the Patrol with 5 def. (Shadow is Fiery Chasm. No effect.) No damage. Beregond reduces threat. TD 29. Beregond readies with Unexpected Courage.\n\nBeregond defends the Nameless Beast with 5 def. Discards Unexpected Courage +2 att making 5. (Shadow is Hideous Deeps. No effect).\n\nSpider attacks undefended. (Shadow is Crumbling Passage. No effect. ) 2 damage on Beregond.\n\nBoth Ered Luin miners attack the spider for 2. Deals 1 damage defeating it.\n\nIoreth heals Beregond.\n\nRefresh:TD 30.\n\nDiscards 2 cards: Elrond's Council (piped) and Map of Earnil (piped)\n\n\n\nTurn 8\n\nDraws Reforged.\n\nPlanning: play Reforged to put Forrest Snare on to Namless Beast.\n\nQuest: commit everyone except Beregond and Ioreth. 11 WP\n\nGaladriel uses Nenya to buff owyn.\n\n15 WP.\n\nStages Fearful Shadows. Doomed 1. TD 31. Characters text boxes are blank.\n\n3 threat vs 15 WP. 12 progress made on stage 1. (Total 22)\n\nCombat: Beregond defends the Patrol with 5 def. (Shadow is Ash Mountain Werewolf. No effect. No damage.\n\nRefresh:TD 32\n\nDiscards 2 cards. The Galhadrims Greeting (piped) and Arwen Und贸miel (piped)\n\n\n\nTurn 9\n\nDraws Galadriel's Handmaiden.\n\nPlanning: play Galadriel's Handmaiden. TD 31.\n\nQuest: commit owyn, Pelargir Shipwright and both of Galadriel's Handmaidens. (1 doesn't exhaust.) 11 WP.\n\nStages Burning Reek. Doomed 1 TD 32. Discards 9 cards from top of deck. Only have 8.\n\n\n\nGame over\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3941510","commentId":3941510,"userName":"asgardianphil","timestamp":1589913644,"content":"Game 16\n\nThe Dwarven Pipes are the only things that can recur 3 cards reliably and the side quests generally discard 3 cards.\n\nAlso need a ton of quest power and need to get the Patrol out.\n\nThe various methods of getting the Patrol take some patience and can't necessarily be done on turn 1 without mono lore reducing questing and finding the Great Hunt.\n\nThe one way of guaranteeing taking the Patrol out of staging on turn 1 or 2 is to engage it which means getting a readying effect or throwing an ally or dwarf under the bus.\n\n\n\nSo... here goes nothing. This deck will need some tweaking after this game.\n\n50 cards\n\nHeroes leadership Aragorn and Dain Ironfoot. in.\n\nThreat dial 31\n\nDraws: To Me! Oh My Kinsfolk!, Narvi's Belt, Stand And Fight, Ered Luin Miner, Stand and Fight and Hidden Cache.\n\nBar the belt a terrible starting hand, although I've put in a dunedain pipe to put some undesirable cards back in the deck when they pop up.\n\nMulligan.\n\nDraws: Smoke Rings, Steward of Gondor, Bilbo Baggins, The Sword That Was Broken, Stand And Fight and Nori.\n\nSetup. Discards 4 cards: Stand And Fight, Smoke Rings, Narvi's Belt and To Me! Oh My Kinsfolk!\n\nPut Torech Gorgor Patrol in staging.\n\nPut A Haunt for Beasts in staging by discarding.\n\nShuffle encounter deck.\n\nSearch for The One Ring and put it on Dain Ironfoot.\n\nSearch for Inner Strength and add to hand.\n\n\n\n\n\nTurn 1\n\nDraws Hidden Cache.\n\nPlanning: play Inner Strength on Dain Ironfoot.\n\nQuest: commit Aragorn and in. 5 WP.\n\nAragorn readies himself.\n\nStages Ransacked Supplies. Discards Dunedain Pipe. Adds 1 to threat in staging.\n\n4 threat vs 5 WP. 1 progress made on stage 1.\n\nEngagement: optionally engage Torech Gorgor Patrol. Makes an immediate attack. Aragorn defends with 2 def. Shadow is Mordor Cave Troll. No effect. 3 damage on Aragorn.\n\nCombat: Dain defends the Patrol with 4def. Shadow is Fiery Chasm. No effect. 1damage on Dain.\n\nI just need Narvi's Belt and Ioreth now before the Patrol kills Dain.\n\nRefresh: TD 32\n\nDiscards 3 cards: Ever My Heart Rises, Kili and Dwarven Sellsword.\n\n\n\nTurn 2\n\nDraws Dwarf Pipe.\n\nPlanning: play Steward of Gondor on Dain and exhaust it.\n\nPlay The Sword That Was Broken on Aragorn.\n\nPlay Dwarf Pipe on in.\n\nQuest: choose A Haunt For Beasts as the current quest.\n\nCommit Aragorn and in. 7 WP.\n\nStages Ransacked Supplies. Discards Dwarf Pipe; adds 1 threat to staging. (in smokes his pipe to save it)\n\n1 threat vs 7 WP. Clears a Haunt for Beasts to the Victory Display.\n\nCombat: Dain defends the Patrol with 4 def. Shadow is Namless Beast. +1 att. Dain uses Inner Strength to cancel it. TD 33. 1 damage to Dain.\n\nRefresh: TD 34\n\nDiscards 2 cards: Gimli and To Me! My Kinsfolk! (Pipe saves) perhaps I should have saved Gimli, but I was worried about loosing another pipe.\n\n\n\nTurn 3\n\nDraws Steward of Gondor.\n\nPlanning: exhaust Steward of Gondor.\n\nDain plays Hidden Cache to draw Unexpected Courage.\n\nI have 1 spirit resource. I could get the sellsword out of the discard or hold my nerve to play Bibo to fetch a dwarf pipe.\n\nI'll hold my nerve.\n\nQuest: commit Aragorn and in for 7WP.\n\nAragorn readies himself.\n\nStages Nameless Beast. Oh crap!\n\n3 threat vs 7 WP. 4 progress made on stage 1.\n\nEngagement: engages Namless Beast. This is going to kill a hero.\n\nCombat: Dain defends the Patrol with 4 def. Shadow is Ash Mountain Werewolf. No effect. 1 damage on Dain.\n\nAragorn defends Namless Beast with 2 def. Discards Celebra铆n's Stone adding 2 att. 3 damage on Aragorn defeating him.\n\nKilled by Arwens pendant... ouch! Now, thereis a tale to tell.\n\n\n\nScoop this game. I can't win now. Where the frig were my dwarves and Narvi's Belt.\n\nHeh just peeked and next card was Reforged.\n\nLooks like I should have left the Patrol for a few turns.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3941611","commentId":3941611,"userName":"asgardianphil","timestamp":1589927647,"content":"Game 17\n\nTweaked slightly to include x3 Galadriel to help pull pipes or unexpected courages.\n\n\n\n51 cards\n\nHeroes Aragorn, Dain and in.\n\nThreat dial 31\n\nDraws Armoured Destrier, Steward of Gondor, Nori, Hidden Cache, Helm of Secrecy and Stand And Fight.\n\nMulligan: Smoke Rings, Unexpected Courage, Dwarven Sellsword, Stand And Fight, Dwarven Sellsword and Ioreth.\n\nSetup:\n\ndiscard 5 cards: Sword That Was Broken, The One Ring, Dwarf Pipe, Smoke Rings and To Me! My Kinsfolk!\n\n(Presumably I can still take the One Ring from the discard pile during Setup?)\n\nPut Torech Gorgor Patrol in staging.\n\nPut Lost In The Dark in staging. Shuffle deck. Put top 10 player cards facedown under threat dial.\n\nTake The One Ring from discard pile and attach to Dain Ironfoot. Search the player deck and take Inner Strength and add to hand. (Very lucky!)\n\n\n\nTurn 1\n\nDraw Steward of Gondor.\n\nPlanning: play Steward of Gondor and exhaust it.\n\nPlay Dwarven Sellsword.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Aragorn, in and Dwarven Sellsword. 8WP.\n\nStages Ransacked Supplies. Discards Gl贸in and adds 3 to staging.\n\n6 threat vs 8 WP. 2 progress made on LitD.\n\nRefresh:TD 32 and discards Galadriel from under it.\n\nDiscards 3 cards: Gimli, Unexpected Courage and Reforged.\n\nPay to keep Dwarven Sellsword.\n\n\n\nTurn 2\n\nDraws Helm of Secrecy. (This is a flight of fancy to bring in lore Aragorn later)\n\nPlanning: exhaust Steward of Gondor\n\nPlay Unexpected Courage on Dain.\n\nPlay Dwarven Sellsword #2\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Dain, Aragorn, in and the 2 sellswords.\n\nDain readies with Unexpected Courage.\n\n13 WP.\n\nStages Nameless Beast.\n\n6 threat vs 13 WP 7 progress made. Clears LitD to the Victory Display. Shuffles 9 cards back into deck.\n\nEngagement: Namless Beast engages.\n\nCombat: Dain defends the beast with 3 def. Discards Ever My Heart Rises. Adding 0 to att. Shadow is Spawn of Shelob. No effect. No damage.\n\nRefresh: TD 33\n\nDiscards 2 cards Azain Silverbeard and Unexpected Courage.\n\nDain pays2 res to keep both Sellswords.\n\n\n\nTurn 3\n\nDraws Galadriel.\n\nPlanning: exhaust Steward of Gondor\n\nPlay Inner Strength on Dain.\n\nDain pays to play Galadriel. She puts Celebra铆n's Stone on Aragorn. Reorders Hidden Cache, Stand And Fight,Stand And Fight and Dunedain Pipe.\n\nQuest: commit Galadriel, in and Dain.\n\nDain readies with Unexpected Courage.\n\n8 WP.\n\nStages Firey Chasm.\n\n4 threat vs 8 WP. 4 progress made on stage 1\n\nTravel: to Firey Chasm.\n\nCombat: Dain defends the beast with 4 def. Discards Hidden Cache +0 att ( adds 2 resource to in) Shadow is Orc Passage. No effect. No damage.\n\nAragorn and the two Sellswords attack the Beast for 7. Deals 4 damage.\n\nRefresh: TD 34\n\nDiscards 2 cards Stand And Fight x2\n\nAragorn pays 2 to retain the Sellswords\n\nGaladriel leaves play.\n\n\n\nTurn 4\n\nDraws Dunedain Pipe.\n\nPlanning: exhaust Steward of Gondor\n\nin plays Stand And Fight to play Azain Silverbeard from discard pile.\n\nQuest: commit Aragorn, 1 Sellsword and in. 10 WP.\n\nStages Overwhelming Darkness.\n\n3 threat vs 10 WP. 7 progress made. 5 on Fiery Chasm explores it. Discard 3 cards: Reforged, Steward of Gondor and Hidden Cache (adds 2 resource to Aragorn). 2 progress on stage 1.\n\nCombat: Dain defends the Beast with 4 def. Discards Ered Luin Miner. +3 att. Puts miner into play. 6 att vs 4 def. Shadow is Narrow Opening. No effect. 2 damage on Dain.\n\nDain readies with Unexpected Courage.\n\nSellsword #2, Azain and Ered Luin Miner att Namless Beast for 9 att defeating it.\n\nRefresh: TD 35\n\nDiscards 3 cards Ever My Heart Rises, Dwarf Pipe and Armoured Destrier.\n\nDain pays 2 resources to retain the Sellswords.\n\n\n\nTurn 5\n\nDraws Dwarf Pipe.\n\nPlanning: exhaust Steward of Gondor\n\nAragorn pays to play Dwarf Pipe on in. Discards Nori (Pipe saves)\n\nQuest: choose Overwhelming Darkness as the current quest.\n\nCommit in, Aragorn and both Sellswords. 13 WP.\n\nAragorn readies himself.\n\nStages Torech Gorgor Patrol.\n\n6 Threat vs 13 WP. 7 progress made on Overwhelming Darkness clearing it to the Victory Display. Shuffles 3 cards back.\n\nEngagement: optionally engage one Patrol. Makes an immediate attack. Dain defends with 4 def. Shadow is Hideous Deeps. No effect. 1 damage on Dain.\n\nDain readies with Unexpected Courage\n\nCombat: Dain defends the Patrol with 4 def. Shadow is Burning Reek. Uses Inner Strength to cancel. TD 36. 1 damage on Dain.\n\nAragorn, Azain and Ered Luin Miner attack the Patrol for 7. Deals 3 damage\n\nRefresh: TD 37\n\nDiscards 2 cards Narvi's Belt and To Me! My Kinsfolk! (Pipe saves)\n\nDain pays 2 resources to retain the Sellswords.\n\n\n\nTurn 6\n\nDraws Narvi's Belt.\n\nPlanning: exhaust Steward of Gondor\n\nAragorn pays to play Narvi's Belt on Dain.\n\nNarvi's Belt gives Dain Lore.\n\nPlay Ioreth.\n\nPlay Dunedain Pipe on Aragorn.\n\nExhaust Dunedain Pipe to put Smoke Rings on bottom of deck to draw Ever My Heart Rises. Play it on in.\n\nIoreth heals 3 damage from Dain.\n\nQuest: commit Aragorn and in. 7 WP.\n\nAragorn readies himself.\n\nStages The Tunnels of Torech Gorgor.\n\n3 threat vs 7 WP. 4 progress made on stage 1\n\nCombat: Dain defends the Patrol with 4 def. Shadow is Narrow Opening. No effect. 1 damage on Dain.\n\nDain readies with Unexpected Courage.\n\nAragorn, both Sellswords, Azain and Ered Luin Miner attack the Patrol with 15 att. Deals 11 damage. Defeats it. in spends 1 tactics resource to allow Azain to put 2 damage on the other patrol.\n\nRefresh: TD 38\n\nDiscards 3 cards Ever My Heart Rises, Bofur (pipe saves) and Galadriel.\n\nDain pays 2 resources to retain the Sellswords.\n\n\n\nTurn 7\n\nDraws To Me! Oh My Kinsfolk!\n\nPlanning: exhaust Steward of Gondor\n\nAragorn smokes his pipe to put Helm of Secrecy on the bottom of the deck and draws Dwarf Pipe. in pays to put Dwarf Pipe on Dain.\n\nQuest: commit Aragorn and in for 7 WP\n\nAragorn readies himself.\n\nStages Twisted Tunnel. Puts Ash Mountain Werewolf in Staging.\n\n7 threat vs 7 WP. 0 progress made.\n\nTravel: forced to travel to Twisted Tunnel. in's heart rises and he readies. TD 37.\n\nEngagement: optionally engage the Patrol. Makes an immediate attack. Dain defends the Patrol with 4 def. Shadow is Spawn of Shelob. Exhaust Ioreth. 1 damage on Dain.\n\nDain readies with Unexpected Courage\n\nAsh Mountain Werewolf engages.\n\nCombat:\n\nDain plays To Me! Oh My Kinsfolk! To play Gimli from the discard pile.\n\nDain defends the Patrol with 4 def. Shadow is Orc Passage. No effect. 1 damage on Dain\n\nGimli defends the Werewolf with 2 def. Shadow is Fiery Chasm. No effect.2 damage on Gimli. Werewolf discards Nori. (Dain smokes pipe to save)\n\nAragorn, in and Ered Luin Miner attack the Werewolf with 6 att. Dealing 5 damage defeating it.\n\nBoth Sellswords and Azain attack the Patrol with 7 attack. Deals 3 damage.\n\nGimli goes to the bottom of the deck.\n\nRefresh: TD 38.\n\nDiscards 3 cards Ered Luin Miner (goes into play), Narvi's Belt (pipe saved) and Ered Luin Miner (put into play)\n\nDain pays 2 resources to retain the Sellswords.\n\n\n\nTurn 8\n\nDraws Power of Command.\n\nPlanning: exhaust Steward of Gondor\n\nAragorn smokes Dunedain Pipe to put Power of Command on bottom of deck to Draw Smoke Rings.\n\nQuest: commit Aragorn, in and 3 miners and both Sellswords19 WP.\n\nAragorn readies himself.\n\nStages Ransacked Supplies. Discards Reforged. +0 to staging. Dain smokes his pipe to save it.\n\n0 threat vs 19 WP. 19 progress made. 2 on Twisted Tunnel explores it. 1 resource on TToTG. 17 progress on stage 1. Advances to stage 2.\n\nSearches and puts A Haunt for Beasts in stageing. Discard until Ash Mountain Werewolf appears. Add to staging.\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat: Narvi's Belt gives Dain lore. Ioreth heals 3 damage from Dain.\n\nDain defends the Patrol with 4 def. Shadow is Mordor Cave Troll. No effect. 1 damage on Dain. Dain readies with Unexpected Courage.\n\nDain defends the Werewolf with 4 def. Shadow is Ash Mountain Werewolf. No effect. No damage on Dain. Werewolf discards Hidden Cache. (Adds 2 resources to Dain.)\n\nAragorn and Azain attack the Werewolf with 6 attack dealing 4 damage. (Limited by side quest)\n\nRefresh:TD 39.\n\nDiscards 4 cards: Armoured Destrier, To Me! My Kinsfolk! (Saved by pipe), Smoke Rings and Bofur (saved by pipe)\n\nDain pays 2 resource to retain the Sellswords.\n\n\n\nTurn 9\n\nDraws Helm of Secrecy.\n\nPlanning: exhaust Steward of Gondor.\n\nAragorn smokes pipe and puts Helm of Secrecy on the bottom of deck to draw Nori.\n\nin pays 3 tactics resources to play Nori.\n\nQuest: choose A Haunt for Beasts as the current quest.\n\nCommit Aragorn, in and 2 Ered Luin Miners. 11 WP.\n\nStages Firey Chasm.\n\n4 threat vs 11 WP. 7 progress made on the side quest clearing it to the Victory Display.\n\nTravel: forced to travel to Firey Chasm. in's heart rises and he readies. TD 38\n\nCombat: Dain defends the Patrol with 4 def. Shadow is Crumbling Passage. No effect. 1 damage on Dain. Dain readies with Unexpected Courage. Narvi's Belt gives Dain Lore.\n\nIoreth heals 3 damage fromDain.\n\nDain defends the Werewolf with 4 def. Shadow is Namless Beast. +2 att (Smoke Rings) 6 att vs 4 def. Dain takes 2 damage. Werewolf discards Gimli.\n\nNori attacks theWerewolf with 2 att and defeats it. Nori returns Gimli to the bottom of the deck.\n\nBoth Sellswords, in and Azain attack the Patrol with9 att. Deals 5 damage. Defeating it.\n\nRefresh: TD 39\n\nDiscards 3 cards: Narvi's Belt, Power of Command (pipe saves) and Reforged (pipe saves)\n\nDain pays 2 resources to retain the Sellswords.\n\n\n\nTurn 10\n\nDraws To Me! Oh My Kinsfolk!\n\nPlanning: exhaust Steward of Gondor.\n\nQuest: play To Me! Oh My Kinsfolk! To put Gl贸in into play.\n\nCommit, Dain, Aragorn, in, both Sellswords, 3 Ered Luin miners, and Gl贸in.\n\nDain readies with Unexpected Courage.\n\nAragorn readies himself.\n\n24 WP.\n\nStages Ransacked Supplies. Discard Bofur to add 3 to threat area.\n\n3 threat vs 24 WP. 21 progress made. 5 on Fiery Chasm explores it. Discards 3 cards: Helm of Secrecy, Gimi and Power of command. 16 progress on stage 2. Put 1 resource on TToTG.\n\nGl贸in returns to bottom of deck.\n\nRefresh:TD 40\n\nOnly 2 cards left in player deck and I know 1 of them is reforged. So fingers crossed. Aragorn smokes his pipe to to put Smoke Rings to the bottom of the deck. To draw Reforged. (This game is going to be soooooo close. )\n\nDain exhausts Narvi's Belt to give him spirit. Play reforged to put Dwarf Pipe from the discard pile on Nori.\n\nI think that's saved me for this turn.\n\nDiscards 3 cards: Gl贸in (pipe saves), Smoke Rings (pipe saves) and Gl贸in (pipe saves).\n\nDain pays 2 resource to retain the Sellswords.\n\n\n\nTurn 11\n\nDraws Smoke Rings.\n\nPlanning: exhaust Steward of Gondor.\n\nQuest:\n\nin pays to play Smoke Rings. TD 36. Each hero gets +1 WP.\n\nQuest all in bar Ioreth.\n\nDain readies with Unexpected Courage\n\nAragorn readies himself\n\n27 WP.\n\nStages.... Writhing Shadows. Assigns 3 damage to Aragorn.\n\n0 threat vs 27 WP.\n\nBoom! Quest beat with 1 card left in my player deck. Holy crap!\n\nIf you can get the three dwarf pipes and Nori out early you can get through it easier than I did. It needs someone to make a more efficient deck with that concept.\n\nHowever I'm still elated I won.\n\nYay me.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEdited May 19 by asgardianphil\nCorrected turn numbering mistake."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3941631","commentId":3941631,"userName":"asgardianphil","timestamp":1589929630,"content":"This was the deck.\n\nhttps://ringsdb.com/decklist/view/16147/smokingpipesundertheashmountains-1.0 [https://ringsdb.com/decklist/view/16147/smokingpipesundertheashmountains-1.0]\n\nThere isn't a Card for Helm of Secrecy on Rings DB yet so I couldn't include it. However in hindsight I would have cut that card and put in an extra Nori. So that's what I've shown here.\n\n\n\nMy win all depends on whether I was allowed to play The One Ring from the discard pile. Technically it hadn't gone out of play. It was never in play.\n\nI still need an answer on playing Reforged or Stand And Fight on neutral cards. I've treated it as you can't but I'm not 100% sure."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3941701","commentId":3941701,"userName":"Onidsen","timestamp":1589940848,"content":"> 3 hours ago, asgardianphil said:\n> \n> This was the deck.\n> \n> https://ringsdb.com/decklist/view/16147/smokingpipesundertheashmountains-1.0 [https://ringsdb.com/decklist/view/16147/smokingpipesundertheashmountains-1.0]\n> \n> There isn't a Card for Helm of Secrecy on Rings DB yet so I couldn't include it. However in hindsight I would have cut that card and put in an extra Nori. So that's what I've shown here.\n> \n> \n> \n> My win all depends on whether I was allowed to play The One Ring from the discard pile. Technically it hadn't gone out of play. It was never in play.\n> \n> I still need an answer on playing Reforged or Stand And Fight on neutral cards. I've treated it as you can't but I'm not 100% sure.\n\nWe don't have an official ruling, but the current consensus in the Discord is that the Ring's Setup text is still active even when it is in the discard pile. (You couldn't retrieve a Master card from the discard pile, because the Ring only says to search your deck, but Setup text that doesn't directly reference your deck should be fine.)\n\nAlso - congrats! Amazing use of ally Nori. Hadn't thought to use him yet\n\nEdited May 20 by Onidsen"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3942282","commentId":3942282,"userName":"MikeGracey","timestamp":1590031186,"content":"You never tried hunting party asgardianphil?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3943141","commentId":3943141,"userName":"asgardianphil","timestamp":1590164971,"content":"> On 5/21/2020 at 4:19 AM, MikeGracey said:\n> \n> You never tried hunting party asgardianphil?\n\nHi, alas no.\n\nI kept considering the card but I didn't like the trade off of drawing something else such as a side quest or Cave Troll. (Come to think of it no card wasnice in that encounter deck, even the Spawn of Shelobs were nasty due to their surge.)\n\nI think I would have tried Hunting Partybut by game 16 I realised that removing it with Great Hunt hadn't worked for me, trying to engage and Forrest Snare (without a fighting deck) hadn't really worked either. Attacking it with direct damage also hadn't worked.All mainly because of the set up required to get those cards in play from a fastshrinking player deck. Also they discard the target and it will be shuffled back into the encounter deck when stage 1 advances leaving 2 patrols to still be drawn.\n\nI came to the conclusion that the best way to deal with the starting Patrolis with a deck that can engage the Patrol very early and clobber it or just keep it engaged with defending or Reforged Forrest Snare (reforged is better as you can place it before it attacks) so basically Beregond with Inner Strength can defend from turn 1. It's just the immediate attack for engaging you need to handle so Cram, Unexpected Courage, Armoured Destrier and Lembas Bread or any chump. However there are some nasty chumping countermeasures in the encounter deck.\n\n\n\nThe trouble I had with Beregond was his 0 will power. He needed to double as a quester. I think this is why Dain and Aragorn did what Beregond couldn't. Dain boosted all the dwarves and defended too. Aragorn was able to ready from turn 1. I also needed dwarves out from turn 1 for the pipes incase I drew one, so that's the only reason why I used 2 dwarf heroes."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3943152","commentId":3943152,"userName":"asgardianphil","timestamp":1590166593,"content":"I don't have the next two quest packs yet so I might just build a Hunting Party deck and give it a try. See if I can beat my win with more player cards left than 1.\n\nNow, where did I put my pipe?\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3943170","commentId":3943170,"userName":"MikeGracey","timestamp":1590168274,"content":"> 26 minutes ago, asgardianphil said:\n> \n> I don't have the next two quest packs yet so I might just build a Hunting Party deck and give it a try. See if I can beat my win with more player cards left than 1.\n> \n> Now, where did I put my pipe?\n> \n> \n\nWell good job on your successful playthrough, would be interesting to see how hunting party would do. Alas, I do not have my pack yet."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3943942","commentId":3943942,"userName":"asgardianphil","timestamp":1590358145,"content":"New challenge. Win the game using Hunting Party.\n\nI've built a deck however it's proved quite difficult. There are only 8 scout heroes in the game and only 1 in Leadership which is in sphere for Hunting Party. Obviously the scout trait doesn't need to be in leadership but it's still slim pickings throughout the spheres.\n\nFearless scout attachment could be used or any number of allys but I really want to be able to use the hunting party turn 1 if I can and I don't want to rely on other set up cards that could end up being discarded. Fearless scout is Spirit sphere and so are the Dwarf pipes and recurring cards so Spirit is needed and Leadership for the hunting party. Dwarves are needed from turn 1 and I need two spirit heroes to be able to play unexpected Courages and Handmaidens etc without needing any resource smoothing or acceleration.\n\nSo I came up with Gimli and Legolas duo and ended up with Dain spirit over in or Dwalinin spirit. Dain leadership was a good choice but I need 2 spirit heroes otherwise I need other cards to grant spirit. Gimli is needed to defend to ready Legolas and he's not going to be good enough as he has a poor defense and has to spend a resource. However he can pay for Elvenking to go on Legolas and the Galadhrim Weaver will be the target of that combo to readyblegolas and recur a card.\n\nThere's still too much to pack into this deck and so it's lacking any healing or threat reduction at the moment but that may come when I tweak it.\n\n\n\nEdited May 25 by asgardianphil\nDwalin not Gloin in spirit"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944025","commentId":3944025,"userName":"asgardianphil","timestamp":1590371817,"content":"Game #18\n\n50 cards\n\nHeroes: Dain Ironfoot, Legolas (both spirit) and Gimli (leadership)\n\nThreat 31\n\nDraws: Dwarf Pipe, Reforged, Thr贸r's Key, Dwarven Tomb, Bilbo and Galadhrim Weaver.\n\nOk so this is a great starting hand. I would like to mulligan to try and get Hunting Party into hand first turn. However, Hunting Party can bring in another enemy or even worse another Patrol. I really need pipes out turn 1 and I have 2 here ( Bilbo counts as a pipe)\n\nSo.. no mulligan.\n\nSetup\n\nDiscards 4 cards\n\nArwen Und贸miel, The Elvenking, Curious Brandybuck and Unexpected Courage.\n\nStages Torech Gorgor Patrol.\n\nStages Lost In The Dark. Places 10 cards under the threat dial.\n\nSearch for the One Ring and put it on Dain.\n\nSearch for Inner Strength and add to hand.\n\n(Cannot believe they were both in there. Good job the deck is not built around them)\n\n\n\nTurn 1\n\nDraws Galadriel's Handmaiden.\n\nPlanning: play Bilbo Baggins. He searches and pulls a Dwarf Pipe to hand.\n\nI could could do with 9 spirit resources to play everything.\n\nQuest: choose Lost in the Dark as the current quest.\n\ncommit Gimli, Legolas and Bilbo. 5WP (pretty thin)\n\nStages Ransacked Supplies. Discards Hidden Cache. +0 threat to staging. Adds 2 resources to Legolas.\n\n3 threat vs 8 WP. 5 progress made on Lost in the Dark.\n\nRefresh:TD 32 and discards Galadhrim Weaver from under it.\n\nDiscards 3 cards Bofur, Arwen Und贸miel and Dwarven Tomb.\n\n\n\nTurn 2\n\nDraws Unlikely Friendship.\n\nPlanning: play Dwar Pipe on Dain and Gimli.\n\nPlay Unlikely Friendship. Add resource to Legolas and draws Ered Luin Miner.\n\nPlay Galadriel's Handmaiden. TD 31\n\nPlay Thr贸r's Key on Dain.\n\nQuest: choose Lost in the Dark as the current quest.\n\nCommit Gimli, Legolas, Bilbo and Galadriel's Handmaiden. 7 WP.\n\nStages Spawn of Shelob. Surges into Writhing Shadows. Assigns 3 damage ( Bilbo 1 and Legolas 2.\n\n4 threat vs 7 WP. 3 progress made on LitD. Clears it to Victory Display. Shuffles 9 cards back into the deck.\n\nEngagement: Spawn of Shelob engages. (With Dain defending I'm going to have to discard a card to buff him). Choose to discard a card to not add 2 to spiders defense.\n\nDiscards Galadriel's Handmaiden. Dain smokes his Pipe to save.\n\nDain defends the spider with 3 def. Shadow is Writhing Shadows. Makes another attack.\n\nSpider attacks undefended. Shadow is Fiery Chasm. No effect. 2 damage on Gimli.\n\nRefresh:TD 32\n\nDiscards 2 cards: Ered Luin Miner (puts intoplay) and Elven-light. (Now we can get Legolas Readying)\n\n\n\nTurn 3\n\nDraws Mirkwood Long-Knife\n\nPlanning: play Elven-light from discard pile. Draws Unexpected Courage.\n\nPlay Inner Strength on Dain.\n\nQuest: (realising that questing with Legolas and using Elven-light isn't going to work without buffing up Gimli's defense. I need to use Elvenking)\n\nCommit Gimli, Legolas, Bilbo and Galadriel's Handmaiden. Discard Elven-light to ready Gimli. 8 WP\n\nStages Ash Mountain Werewolf.\n\n4 threat vs 8 WP. 4 progress made on stage 1.\n\nEngagement: Ash Mountain Werewolf engages.\n\nGimli defends the spider with 2 def. Spend 1 resource to ready Legolas. Shadow is Fiery Chasm. No effect. No damage.\n\nDain defends the Werewolf with 4 def. Shadow is Spawn of Shelob. Exhaust Ered Luin Miner. Werewolf discards Curious Brandybuck. Dain smokes and saves it.\n\nLegolas attacks the spider with 4 att and defeats it.\n\nRefresh:TD 32\n\nDiscards 2 cards: Thr贸r's Key (piped) and Reforged (piped).\n\n\n\nTurn 4\n\nDraws Dwarf Pipe.\n\nPlanning: play Dwarf Pipe on Ered Luin Miner.\n\nPlay Galadhrim Weaver. Shuffle Elven-light back into deck.\n\nQuest: commit Bilbo, Galadriel's Handmaiden and Galadhrim Weaver. 5 WP\n\nStages Ash Mountain Werewolf.\n\n4 Threat vs 5 WP. 1 progress made on stage 1\n\nEngagement: Ash Mountain Werewolf engages.\n\nDain defends the Werewolf with 4 def. Shadow is Fearful Shadows. Cannot ready. Uses Inner Strength to cancel. TD 33. No damage. Werewolf discards Thr贸r's Key.\n\nGimli Defends the other Werewolf with 2 def. He spends a resource to buff Legolas +1 att (he was already ready) Shadow is Crumbling Passage. No effect. 2 damage on Gimli. Werewolf discards Galadhrim Weaver (miner pipe saves)\n\nLegolas and miner attack Werewolf with 5 att. Deals 4 damage.\n\nRefresh:TD 34\n\nDiscards 2 cards: Dwarven Tomb (piped) and Hunting Party (piped)\n\n\n\nTurn 5\n\nDraws Curious Brandybuck.\n\nPlanning: play Unexpected Courage on Dain.\n\nQuest: commitBilbo, Galadriel's Handmaiden and Galadhrim Weaver. 5 WP\n\nStages Hideous Deeps. Puts top 3 player cards under it. (Going to save Thr贸r's Key for a worse location).\n\n5 threat vs 5 WP. 0 progress made.\n\nTravel: to Hideous Deeps. Play Curious Brandybuck for free.\n\nCombat: Dain defends a Werewolf with 4 def. Shadow is Namless Beast. (Top card is Thr贸r's Key) +1 att. 1 damage to Dain. Werewolf discards Arwen( pipe saves). Dain readies with Unexpected Courage.\n\nDain defends the other Werewolf with 4 def. Shadow is Hideous Deeps. No effect. No damage. Werewolf discards Reforged.\n\nLegolas, Gimli and Miner attacks the undamaged Werewolf with 6 att. Defeats it.\n\nRefresh:TD 35\n\nDiscards 2 cards: Bilbo (piped) and Curious Brandybuck (piped)\n\n\n\nTurn 6\n\nDraws Unexpected Courage.\n\nPlanning: play Reforged to put The Elvenking on Legolas. Play Dwarven Tomb to return Arwen Und贸miel to hand.\n\nQuest: commit Bilbo, Galadriel's Handmaiden, Galadhrim Weaver and Curious Brandybuck. 7 WP. Stages Firey Chasm. Attaches Thr贸r's Key to it.\n\n2 threat vs 7 WP. 5 progress made on Hideous Deeps.\n\nCombat: Dain defends the Werewolf with 4 def. Shadow is Ransacked Supplies. Discard an attachment. Uses Inner Strength to cancel. TD 36. No damage. Werewolf discards Galadriel's Handmaiden (piped)\n\nLegolas attacks the wounded Werewolf with 3 att. Defeats it.\n\nRefresh:TD 37\n\nDiscards 2 cards Unlikely Friendship (piped) and The Elvenking (piped).\n\n\n\nTurn 7\n\nDraws Elven-light.\n\nPlanning: play Arwen Und贸miel.\n\nQuest: commit Bilbo, Galadriel's Handmaiden, Galadhrim Weaver, Curious Brandybuck and Arwen Und贸miel (buffs Dain) 9 WP.\n\nStages A Haunt for Beasts.\n\n3 threat vs 9 WP. 6 progress made. 1 on Hideous Deeps returning 3 cards and 5 on stage 1. Put Curious Brandybuck on bottom of deck.\n\nRefresh:TD 38\n\nDiscards 3 cards (pipes will save each one): The Elvenking, Curious Brandybuck and The Elvenking.\n\n\n\nTurn 8\n\nDraws Hunting Party (yay!)\n\nPlanning: play Mirkwood Long-Knife on Legolas.\n\nQuest: Commit Gimli, Legolas, Bilbo, Galadriel's Handmaiden, Galadhrim Weaver and Arwen Und贸miel. Discard Elven-light to ready Gimli. Arwen buffs Dain's defense. 12 WP.\n\nPlay Hunting Party. Discards the Patrol. Draws Fearful Shadows. Doomed 1. TD 39. Printed text boxes are blank. (Presumably this doesnt affect Legolas as he already gave a +1 WP bonus until the end of the round)\n\nStages Narrow Opening.\n\n3 threat vs 12 WP. 9 progress made on stage 1. (Total 19)\n\nTravel: to Narrow Opening.\n\nReturn Galadhrim Weaver to hand to ready Legolas.\n\nRefresh:TD 40\n\nDiscards 3 cards. Pipes will save them all. Galadriel's Handmaiden x2 and Unlikely Friendship.\n\n\n\nTurn 9\n\nDraws Ered Luin Miner.\n\nPlanning: can only play 1 card. Play Galadhrim Weaver and shuffle Hunting Party back into deck.\n\nQuest: choose A Haunt for Beasts as the current quest. Commit Gimli, Legolas, Bilbo, Galadriel's Handmaiden and Arwen Und贸miel. Discard Ered Luin Miner to ready Gimli. Arwen buffs Dain's def. 12 WP.\n\nStages Crumbling Passage. Becomes the active location. (Oh crap!)\n\n3 threat vs 12 WP. 9 progress made. 3 on Crumbling Passage. Damages Legolas and Arwen. Defeats Bilbo, Galadriel's Handmaiden and Galadhrim Weaver. (In Hindsight I should have readied Legolas before staging. 6 progress on A Haunt for Beasts clearing it to the Victory Display.\n\nTravel: to Narrow Opening.\n\nRefresh:TD 41\n\nDiscard 2 cards (pipes will save them both.) Hunting Party and Bilbo\n\n\n\nTurn 10\n\nDraws Hidden Cache.\n\nPlanning: play Ered Luin Miner (paid by Gimli)\n\nQuest: commit Gimli, Arwen and both Ered Luin Miners. Arwen buffs Dain's defense. 6 WP.\n\nStages Mordor Cave Troll.\n\n3 Threat vs 6 WP. 3 progress made on Narrow Opening explores it.\n\nGimli pays to play Hidden Cache. Draws Curious Brandybuck.\n\nEngagement: Mordor Cave Troll engages.\n\nCombat: Dain defends the Troll with 5 def. Shadow is Burning Reek. Return to staging. 1 damage to Dain.\n\nRefresh:TD 42\n\nDiscards 2 cards (pipes will save them) Curious Brandybuck and The Elvenking.\n\n\n\nTurn 11\n\nDraws The Elvenking.\n\nPlanning: play Curious Brandybuck. Play Unexpected Courage on Legolas. Play Elven-light from discard to draw Reforged.\n\nQuest: commit Legolas, Gimli, Arwen and Curious Brandybuck. Discards Elven-light to ready Gimli. Arwen buffs Dain's defense. Unexpected Courage readies Legolas. 9WP\n\nStages Nameless Beast.\n\n6 threat vs 9 WP. 3 progress made on stage 1.\n\nEngagement: both the Troll and beast engages.\n\nCombat: Dain defends the Beast with 5 def. Discards Galadriel's Handmaiden (piped) +2 att. Shadow is Orc Passage. No effect. No damage. Dain readies with Unexpected Courage.\n\nDain defends the Troll with 5 def. Shadow is Mordor Cave Troll. No effect. 1 damage on Dain.\n\nLegolas, Gimli and both miners attack the Nameless Beast with 8 att. Deals 5 damage.\n\nRefresh:TD 43\n\nDiscard 2 cards (pipes will save) Galadhrim Weaver and Galadriel's Handmaiden.\n\n\n\nTurn 12\n\nDraws Hunting Party.\n\nPlanning: play Reforged to play Thr贸r's Key from discard pile on Dain.\n\nPlay Elven-light from discard pile to draw Unlikely Friendship.\n\nPlay Unlikely Friendship to put 1 resource on Legolas and draw Hunting Party.\n\nQuest: commit Gimli, Legolas, Arwen and Curious Brandybuck. Discard Elven-light to ready Gimli. Arwen buffs Dain's defense. Legolas readies with Unexpected Courage. 9 WP\n\nStages The Tunnels of Torech Gorgor.\n\n0 Threat vs 9 WP. Advances to stage 2.\n\nPut Overwhelming Darkness into staging. Put Spawn of Shelob into staging.\n\nEngagement: Spawn of Shelob engages. Choose to discard 2 cards. Thr贸r's Key and Arwen.\n\nCombat:\n\nDain defends the Nameless Beast with 5 def. Dicards Dwarven Tomb. +1 att. (Pipe saves). Shadow is Ash Mountain Werewolf. No effect. No damage. Dain readies with Unexpected Courage.\n\nDain defends the Troll with 5 def. Shadow is Hideous Deeps. No effect. 1 damage on Dain.\n\nGimli defends the spider with 2 def. Spends 1 resource to ready Dain. Shadow is Ransacked Supplies. Discard the Elvenking. No damage.\n\nLegolas attacks the beast with 4 att. Defeats it.\n\nDain and both miners attack the spider with 4 att defeating it.\n\nRefresh:TD 44\n\nDiscards 4 cards Mirkwood Long-Knife (piped), Unlikely Friendship (piped), Hidden Cache (adds 2 resources to Legolas) (piped) and Hunting Party.\n\n\n\nTurn 13\n\nDraws Bilbo Baggins.\n\nPlanning: play Bilbo Baggins (discard Curious Brandybuck)\n\nPlay Elven-light from discard pile to draw The Elvenking. Discard Galadriel's Handmaiden.\n\nQuest: commit Gimli, Legolas, Bilbo, Arwen, Curious Brandybuck and both miners. Discard Elven-light to ready Gimli. Arwen buffs Dain's defense. Legolas readies with Unexpected Courage. 13 WP.\n\nStages Twisted Tunnel. Attaches Thr贸r's Key (not really sure about the timing of Thr贸r's Key. I presume it stops Twisted Tunnels when reveal text. It attaches before it completes? Or are you supposed to do the when reveal effects before you place th location in staging?)\n\n\n\nAnyway this is game over as threat is going to be 45 and I have the One Ring.\n\nIt all went wrong because I didn't ready Legolas and I Lost the Weaver.\n\nI'll tweak and try again. I'm glad I used the Hunting Party but it is useless against enemies that are staged that round. So with this high starting threat lineup it's only going to be useful against the Patrol.\n\n\n\n\n\n\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944053","commentId":3944053,"userName":"MikeGracey","timestamp":1590376685,"content":"That was a great play through, you almost beat it on your first try with that deck! Nicely done"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944114","commentId":3944114,"userName":"asgardianphil","timestamp":1590398421,"content":"Cheers, it was a few secondsof terror when playing Hunting Party and then relief once it was gone and nothing worse came out.\n\nhttps://ringsdb.com/decklist/view/16226/smokingpipesafterhuntingorcs-1.0 [https://ringsdb.com/decklist/view/16226/smokingpipesafterhuntingorcs-1.0]\n\nThat was my deck. First draft.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944261","commentId":3944261,"userName":"asgardianphil","timestamp":1590433296,"content":"Game 19\n\nAll I've tweaked at the moment is to remove 2 Unlikely Friendship and put in 2 Steward of Gondor to put on Legolas.\n\n\n\nHeroes are Spirit Dain and Legolas and Tactics Gimli.\n\nThreat Dial 31\n\n50 cards\n\nDraw: Elven-light, Galadriel's Handmaiden, Hidden Cache, Reforged, Reforged and Steward of Gondor.\n\nMulligan: Galadhrim Weaver, Dwarven Tomb, Ered Luin Miner, Reforged, Unexpected Courage and Curious Brandybuck.\n\nPossibly a worse hand. I should have stuck with Steward and Elven-light.\n\nSetup\n\nDiscards 4 cards: Galadriel's Handmaiden, Curious Brandybuck, Unlikely Friendship and Galadhrim Weaver.\n\nPut Torech Gorgor Patrol in staging\n\nPut A Haunt for Beasts in stageing.\n\nSearch for the one ring and put it on Dain.\n\nSearch for Inner Strength and add to hand.\n\n\n\nTurn 1\n\nDraws The Elvenking.\n\nPlanning: play The Elvenking on Legolas.\n\nPlay Galadhrim Weaver shuffle a Galadhrim Weaver back into deck.\n\nPlay Inner Strength on Dain.\n\nQuest: commit Legolas, Gimli and Galadhrim Weaver. 4 WP\n\nStages Fearful Shadows. Doomed 1 TD 32. All text boxes are blank.\n\n3 threat vs 4 WP. 1 progress made on stage 1.\n\nThe Elvenking returns Galadhrim Weaver to hand to ready Legolas.\n\nRefresh:TD 33\n\nDiscards 3 cards: Mirkwood Long-Knife, The Elvenking and Dwarven Tomb.\n\n\n\nTurn 2\n\nDraws Dwarven Tomb.\n\nPlanning: play Galadhrim Weaver to shuffle back Dwarven Tomb.\n\nQuest: commit Legolas, Gimli and Galadhrim Weaver. 4 WP.\n\nStages Twisted Tunnel. Adds Mordor Cave Troll to staging.\n\n8 threat vs 4 WP. TD 37\n\nThe Elvenking returns Galadhrim Weaver to hand to ready Legolas.\n\nPlay Dwarven Tomb to put Curious Brandybuck in hand.\n\nTravel: travel to Twisted Tunnel. Play 2 copies of Curious Brandybuck for free.\n\nEngagement: Cave Troll engages.\n\nCombat: Dain defends the troll with 4 def. Shadow is Hideous Deeps. No effect and 2 damage on Dain.\n\nGoing to scoop this game as hopeless cause. Really bad Mulligan and start.\n\nI have another deck I'm working on designed to get Hunting Party to hand asap using Heed the Dream and Word of Command.\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944283","commentId":3944283,"userName":"MikeGracey","timestamp":1590437214,"content":"> 1 hour ago, asgardianphil said:\n> \n> Game 19\n> \n> All I've tweaked at the moment is to remove 2 Unlikely Friendship and put in 2 Steward of Gondor to put on Legolas.\n> \n> \n> \n> Heroes are Spirit Dain and Legolas and Tactics Gimli.\n> \n> Threat Dial 31\n> \n> 50 cards\n> \n> Draw: Elven-light, Galadriel's Handmaiden, Hidden Cache, Reforged, Reforged and Steward of Gondor.\n> \n> Mulligan: Galadhrim Weaver, Dwarven Tomb, Ered Luin Miner, Reforged, Unexpected Courage and Curious Brandybuck.\n> \n> Possibly a worse hand. I should have stuck with Steward and Elven-light.\n> \n> Setup\n> \n> Discards 4 cards: Galadriel's Handmaiden, Curious Brandybuck, Unlikely Friendship and Galadhrim Weaver.\n> \n> Put Torech Gorgor Patrol in staging\n> \n> Put A Haunt for Beasts in stageing.\n> \n> Search for the one ring and put it on Dain.\n> \n> Search for Inner Strength and add to hand.\n> \n> \n> \n> Turn 1\n> \n> Draws The Elvenking.\n> \n> Planning: play The Elvenking on Legolas.\n> \n> Play Galadhrim Weaver shuffle a Galadhrim Weaver back into deck.\n> \n> Play Inner Strength on Dain.\n> \n> Quest: commit Legolas, Gimli and Galadhrim Weaver. 4 WP\n> \n> Stages Fearful Shadows. Doomed 1 TD 32. All text boxes are blank.\n> \n> 3 threat vs 4 WP. 1 progress made on stage 1.\n> \n> The Elvenking returns Galadhrim Weaver to hand to ready Legolas.\n> \n> Refresh:TD 33\n> \n> Discards 3 cards: Mirkwood Long-Knife, The Elvenking and Dwarven Tomb.\n> \n> \n> \n> Turn 2\n> \n> Draws Dwarven Tomb.\n> \n> Planning: play Galadhrim Weaver to shuffle back Dwarven Tomb.\n> \n> Quest: commit Legolas, Gimli and Galadhrim Weaver. 4 WP.\n> \n> Stages Twisted Tunnel. Adds Mordor Cave Troll to staging.\n> \n> 8 threat vs 4 WP. TD 37\n> \n> The Elvenking returns Galadhrim Weaver to hand to ready Legolas.\n> \n> Play Dwarven Tomb to put Curious Brandybuck in hand.\n> \n> Travel: travel to Twisted Tunnel. Play 2 copies of Curious Brandybuck for free.\n> \n> Engagement: Cave Troll engages.\n> \n> Combat: Dain defends the troll with 4 def. Shadow is Hideous Deeps. No effect and 2 damage on Dain.\n> \n> Going to scoop this game as hopeless cause. Really bad Mulligan and start.\n> \n> I have another deck I'm working on designed to get Hunting Party to hand asap using Heed the Dream and Word of Command.\n> \n> \n> \n> \n\nYour using Leadership Dain right? Gimli should be questing for 3?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944284","commentId":3944284,"userName":"asgardianphil","timestamp":1590437629,"content":"No, it's spirit Dain. I wanted leadership Dain but I needed more spirit resource for the questing and Reforged. I'd have to put in songs or Narvi's Belt otherwise to resource smooth.\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944307","commentId":3944307,"userName":"asgardianphil","timestamp":1590442666,"content":"Game 20\n\nNew line up\n\n50 card deck\n\nHeroes Gimli, Legolas and Radagast (leadership, spirit, lore)\n\nTD 31\n\nDraw: The Elvenking, Word of Command, Longbeard Elder, Ioreth, Hunting Party and Narvi's Belt.\n\nNo mulligan.\n\nSetup\n\nDiscards 4 cards: Reforged, Longbeard Elder, Narvi's Belt and Heed The Dream.\n\nPut Torech Gorgor Patrol in staging.\n\nPut The Tunnels of Torech Gorgor in staging.\n\nSearch for the One Ring and put it on Radagast.\n\nSearch for Inner Strength and add to hand.\n\n\n\nTurn 1\n\nDraws Galadhrim Weaver.\n\nPlanning: play Ioreth.\n\nPlay Galadhrim Weaver. Shuffles Heed The Dream back.\n\nQuest: commit, Gimli, Legolas and Galadhrim Weaver. 4 WP.\n\nPlay Hunting Party on Torech Gorgor Patrol. Reveals Mordor Cave Troll.\n\nStages Firey Chasm.\n\n6 threat vs 4 WP. TD 33\n\nTravel: forced to travel to Firey Chasm.\n\nEngagement: Mordor Cave Troll engages.\n\nCombat: Radagast defends the troll with 3 def. Shadow is Crumbling Passage. No effect. 3 damage on Radagast.\n\nIoreth heals Radagast.\n\nRefresh:TD 34\n\nDiscards 3 cards: Galadriel, Ranger Spikes and Reforged.\n\nThink the game is now over.\n\n\n\nTurn 2\n\nDraws Galadriel\n\n\n\nSo yeah, Hunting Party isn't really a first turn card. Youbuabe to set up first to be able to take what's comming. So in light of that I don't really need the scout to be a hero I could use scout allies or Fearless Scout attachment.\n\nPlanning: play Word of Command to find Steward of Gondor and add to hand.\n\nPlay Inner Strength on Radagast.\n\nQuest: commit Gimli, Legolas and Galadhrim Weaver. Legolas discards The Elvenking to ready Radagast. 4WP.\n\nstages Ash Mountain Werewolf.\n\n2 threat vs 4 WP. 2 progress made on Fiery Chasm.\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat:\n\nRadagast defends the troll with 4 def. Shadow is A Haunt for Beasts. No effect. 2 damage.\n\nAsh Mountain Werewolf attacks undefended. Shadow is Fiery Chasm. No effect. 4 damage on Gimli. Werewolf discards Longbeard Elder.\n\nRefresh:TD 35\n\nDiscards 3 cards: Bofur, Ered Luin Miner (puts into play) and Hunting Party.\n\n\n\nTurn 3\n\nDraws Dwarf Pipe.\n\nPlanning: play Dwarf Pipe on Gimli. Play Steward of Gondor on Gimli and exhaust it.\n\nQuest: commit Gimli, Legolas and Galadhrim Weaver. 4 WP.\n\nStages Writhing Shadows. Assigns 3 damage to 2to Legolas, and 1 to Ered Luin Miner.\n\n0 threat vs 4 WP. 4 progress made. 3 on Fiery Chasm explores it. 1 progress on stage 1. Discards 3 cards: Bilbo, Ered Luin Miner (put into play) and Steward of Gondor. Put 1 resource on TToTG.\n\nIoreth heals Radagast.\n\nCombat: Radagast defends the Troll with 4 def. Shadow is Ash Mountain Werewolf. No effect. 2 damage on Radagast.\n\nWounded Ered Luin Miner defends the Werewolf with 1 def. Shadow is Spawn of Shelob. Exhaust Ered Luin Miner 2. Defeats Ered Luin Miner 1. Werewolf discards 2 cards: Word of Command and Gloin (Pipe saves)\n\nRefresh:TD 36\n\nDiscards 3 cards Hidden Cache. (Adds 2 resources to Gimli.), Hidden Cache (adds 2 more resources to Gimli) and The Elvenking (pipe saves)\n\n\n\nTurn 4\n\nDraws Galadriel.\n\nPlanning: exhausts Steward of Gondor.\n\nPlay Longbeard Elder.\n\nPlay Galadriel. Puts Radagast's Staff on Radagast. Reorders: Ioreth, Reforged, Hunting Party and Ranger Spikes.\n\nPlay Narvi's Belt on Gimli.\n\nQuest: commit Gimli Legolas, Galadriel, Longbeard Elder and Galadhrim Weaver. Longbeard Elder peeks at Writhing Shadows.\n\nTotal WP 8\n\nStages Writhing Shadows. Deals 3 damage. 2 on Galadriel and 1 on Legolas.\n\n0 threat vs 8 WP. 8 progress made on stage 1.\n\nCombat: Radagast uses his staff to send the Werewolf to Staging. Ioreth heals Radagast.\n\nRadagast defends the Troll with 4 def. Shadow is Spawn of Shelob. Exhausts Ered Luin Miner. 2 damage on Radagast.\n\nRefresh:TD 37\n\nDiscards 3 cards: Ioreth, Reforged and The Hunting Party (pipe saves)\n\nGaladriel leaves play.\n\n\n\n\n\nTurn 5\n\nDraws Ranger Spikes.\n\nPlanning: exhaust Steward of Gondor. Exhaust Narvi's Belt to give Gimli Lore.\n\nPlay Ranger Spikes in staging.\n\nQuest: commit Gimli, Legolas, Longbeard Elder andGaladhrim Weaver. 6 WP. (Not using Longbeard's response.)\n\nStages Nameless Beast. Ranger Spikes catches it.\n\n3 threat vs 6 WP. 3 progress made on stage 1.\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat: Radagast uses his staff to send the Werewolf back to staging.\n\nIoreth heals Radagast.\n\nRadagast defends the Troll with 4 def. Shadow is Crumbling Passage. No effect. 2 damage on Radagast.\n\nRefresh:TD 38\n\nDiscards 3 cards: Hidden Cache (adds 2 resources to Gimli), The Elvenking and Dwarf Pipe (pipe saves)\n\n\n\n\n\nTurn 6\n\nDraws Heedthe Dream.\n\nPlanning: exhaust Steward of Gondor.\n\nExhaust Narvi's Belt to give Dain lore.\n\nPlay Heed the Dream. Puts Galadhrim Weaver into hand.\n\nPlays Galadriel. She puts Dwarf Pipe on Longbeard Elder. Reorders Ered Luin Miner, Narvi's Belt, Gloin and Galadhrim Weaver.\n\nQuest: commit, Gimli, Longbeard Elder, Galadhrim Weaver and Galadriel. 8WP.\n\nStages Torech Gorgor Patrol.\n\n6 Threat vs 8WP. 2 progress made on stage 1\n\nEngagement: Ash Mountain Werewolf engages.\n\nCombat: Radagast uses his staff to send the Werewolf to staging. Ioreth heals Radagast.\n\nRadagast defends the Troll with 4 def. Shadow is Spawn of Shelob. Exhaust a character. Uses Inner Strength to cancel. TD39. 2 damage on Radagast.\n\nLegolas and Ered Luin Miner attack Cave Troll with 4 att. Deals 1 damage.\n\nRefresh:TD 40\n\nDiscards 3 cards: Ered Luin Miner (put into play), Narvi's Belt (piped) and Gl贸in (piped)\n\nGaladriel leaves play.\n\n\n\nTurn 7\n\nDraws Galadhrim Weaver.\n\nPlanning: exhaust Steward of Gondor.\n\nPlay both Galadhrim Weavers. Shuffles back in Galadriel and Heed The Dream.\n\nQuest: commit Longbeard Elder, and 3 Galadhrim Weavers. 5 WP.\n\nStages Lost in the Dark. Puts top 10 cards under the threat dial. Only leaves 2 cards so...\n\nGame over.\n\n\n\n\n\n"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944309","commentId":3944309,"userName":"asgardianphil","timestamp":1590443219,"content":"The vibe I'm getting with Hunting Party is not to set it up early. Use unique allies. The warrior part is easy enough.\n\nAlso this deck wasn't a good questing deck. If the Troll hadn't turned up it might of worked. However the Troll was going to turn up anyway in turn 1 stageing.\n\nSo:\n\ndefinitely need spirit\n\nDefinitely need dwarves (for the pipe) it's a shame there'll be noDwarven equivalent of Elf-Friend now.\n\nDefinitely need leadership resource, unique warrior and unique Scout for hunting Party or their attachment skills.\n\nBack to the drawing board.\n\nDain Leadership is a must. Thorin and perhaps Leadership Gl贸in and splash spirit with songs or belt. I've been toying with the idea of tactics Dori to boost def from turn 1. He's in sphere for Dwarven attachments and buffs."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944352","commentId":3944352,"userName":"MikeGracey","timestamp":1590449738,"content":"Leadership Dain seems like a good choice, he boosts willpower and can defend great."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944884","commentId":3944884,"userName":"Alonewolf87","timestamp":1590568981,"content":"Since Under the Ash Mountains is finally on OCTGN I was able to play test it a bit. I had a close defeat with my Caldara Mono Spirit deck, getting just one round short of completing Stage 2, a comparatively easy win with a SpBeregond/TaEowyn/SpGlorfindel Three Hunters + Inner Strength deck and a hard win with my Arwen/Elladan/Elrohir Three Hunters deck.\n\nIt's definitely a very hard quest and I dread the moment when we will try to grapple it with our usual 4 players Fellowship."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944890","commentId":3944890,"userName":"Preotet","timestamp":1590570770,"content":"I got try 3H with Inner Strenght. Now I just have to read on the rulings with the one ring and setup cos I know there was some debate about it. ぃぃ"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=3944894","commentId":3944894,"userName":"Alonewolf87","timestamp":1590572186,"content":"> 1 hour ago, Preotet said:\n> \n> Now I just have to read on the rulings with the one ring and setup cos I know there was some debate about it\n\nIf you follow the latest rulings just hope to not draw Inner Strenght in your starting hand cause you would search for it at the last Step of Setup (after the quest Setup instructions), if you go by \"common sense\" you would simply add it to your hand before drawing the starting hand. Let's hope Caleb will reverse his ruling.\n\nIn the particular case of this quest, just hope you don't discard Inner Strength in the quest Setup...\n\nEdited May 27 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308032-beating-under-the-ash-mountains/?do=findComment&comment=4011358","commentId":4011358,"userName":"Alonewolf87","timestamp":1604706074,"content":"Ok we finally got our hands on this quest after a long wait and played it. The first time we were trashed by it, since we make a few bad timing decisions about wheter to clear side quests or advance the main quest. The second time around, courtesy also of slightly better initial hands we were able to prevail...with literally one card left in the deck.\n\nI must say that the quest is really good in making you feel the despair and dwindling resources of such and endeavor.\n\nNow onto leading a revolt among slaves..."}]}