{"url":"https://community.fantasyflightgames.com/topic/308034-black-riders/","title":"Black Riders","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308034-black-riders/?do=findComment&comment=3932089","commentId":3932089,"userName":"etmoore","timestamp":1588119453,"content":"I'm a new player and recently purchased the Core set, some adventure packs, and the Lost Realm expansion (just because it looked really interesting even though I skipped several along the way), but I also decided to try the Saga, so I just purchased the Black Riders expansion. My question is if I can use cards from the Black Riders in other decks, and vice versa. Can I use cards from the Core set with my new Hobbit cards, for example, while attempting the quest? Can I use the new Hobbits with cards like tactics Aragorn for example in a Lost Realm quest? And can I use the new Frodo (with the ring icon) in other decks, or is he specific to the Saga quests? Thanks for your help! \n\nEdited April 29 by etmoore"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308034-black-riders/?do=findComment&comment=3932108","commentId":3932108,"userName":"player3351457","timestamp":1588128088,"content":"The fellowship frodo (ring frodo) is the only technical restriction. He can only be played with the saga box and scenarios. Many players like to start and play \"progression style\" which means you only play with the player cards of the packs you unlocked before (i.e. start with core, then add in packs, then add in next set of expansion, etc).\n\nWelcome to the game and have fun! You got your hands on some really good player cards to start building decks! \n\nI would recommend you check ringsdb.com. they have a way to isolate decks based on the cards you have so you can see what kinds of builds you have. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308034-black-riders/?do=findComment&comment=3932163","commentId":3932163,"userName":"etmoore","timestamp":1588162353,"content":"Thank you so much! Appreciate the quick feedback. I'm loving this game so far! Is it going to be sticking around for a while? I heard something about this last set being the last? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308034-black-riders/?do=findComment&comment=3932182","commentId":3932182,"userName":"rees263","timestamp":1588166186,"content":"Aside from the Fellowship Frodo, you're also not supposed to use the other Fellowship sphere cards outside of the LotR saga quests (from the Black Riders that's only Frodo's Intuition), and the white Boon cards are for the Saga campaign mode only.\n\nAll the other \"normal\" player cards are fine to use however you like. The same (broadly) applies to all other expansions too."}]}