{"url":"https://community.fantasyflightgames.com/topic/308062-steward-of-gondoractions/","title":"Steward of Gondor/Actions","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308062-steward-of-gondoractions/?do=findComment&comment=3932624","commentId":3932624,"userName":"etmoore","timestamp":1588251175,"content":"This is more of a question I guess of how/when to use \"actions\" on cards, but I'll use Steward of Gondor as an example. When you play the attachment on a character during the planning phase, are you also able to then use the action on it to gain the 2 extra resources right away, or do you have to wait until one of those \"action windows\" between phases? Like... at the end of the planning phase as you are about to begin questing.  The \"action windows\" are a little confusing. Thanks for your help! This may seem like an amateur question, but I'm relatively new to the game. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308062-steward-of-gondoractions/?do=findComment&comment=3932650","commentId":3932650,"userName":"player3351457","timestamp":1588254476,"content":"The planning phase is really one big, special action window. So yes, you can play steward and then immediately exhaust it to gain the resources. In fact, there are many, many action windows that sometimes it's easier to ask \"when am I NOT allowed to trigger an action?\" There are individuals on here that know it better than I do but the four biggest ones for me are:\n\n1) no action windows during staging. Only \"response\"s trigger.\n\n2) no action windows at the beginning of the travel phase. You must choose a location to travel to before using actions.\n\n3) no actions are allowed when resolving shadows. You can do something just before flipping the card, and immediately after resolving the shadow. But nothing but responses in between.\n\n4) during the beginning of the refresh phase. The last action window does exist before the end of the round (to trigger one last action out of gandalf, for example) but you cannot trigger any threat reduction or other stuff before passing the first player token, readying your characters and raising your threat."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308062-steward-of-gondoractions/?do=findComment&comment=3932658","commentId":3932658,"userName":"Alonewolf87","timestamp":1588254698,"content":"> 58 minutes ago, etmoore said:\n> \n> The \"action windows\" are a little confusing. Thanks for your help! This may seem like an amateur question, but I'm relatively new to the game. \n\nIn case this deck [https://ringsdb.com/decklist/view/10407/a-guide-to-action-windows-1.0] is basically a master class in understanding in depth the action windows."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308062-steward-of-gondoractions/?do=findComment&comment=3932709","commentId":3932709,"userName":"etmoore","timestamp":1588260394,"content":"This is great! Thank you for your help! "}]}