{"url":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/","title":"Solo League 21 -- Haradrim with LOTR Saga player cards","comments":[{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933306","commentId":3933306,"userName":"dalestephenson","timestamp":1588363729,"content":"Welcome to the LOTR Solo League. This month we'll be playing three quests from the Haradrim cycle. The quests are:\n\n1) Long Arm of Mordor (Sands of Harad Deluxe)\n2) The Mumakil (AP #1)\n3) The Black Serpent (AP #4)\n\nHere are the rules:\n\n1) Each player will construct a 50+ card deck, then use that exact deck against all three quests. You may use that deck freely against any quests (include the three quests in the league) prior to the run for testing purposes, but you may not use any trial runs for your official results.\n\n2) At least one of the heroes must be from a box with those quests. This means that you must have at least one of Leadership Gimli, Spirit Legolas, Kahliel, and Fastred.\n\n3) Your score against each quest will be how much help you need to defeat it, based on the Grace of the Valar variant invented by Seastan. It works like this:\n\nFor each token you have, you can choose to draw a card or give a hero a resource. This happens one at a time, so if I use my first token to draw a card, I see the card before I decide whether to use my second token for a card or a resource.  This can be done *anytime* during setup.\n\nThe original variant starts at zero tokens and gains two tokens if you lose quickly (first five turns) and one if you do not -- however, for the purposes of this league I will allow you to start a quest at any number of tokens, and adjust by as many as you want. The only rules for adding/reducing tokens are these:\n\nRule 1) If you lose a quest with X tokens, you cannot play that quest again with X or less tokens.\nRule 2) If you defeat a quest with Y tokens, you cannot play that quest again with Y or more tokens.\n\nSo for example, if I start with six tokens against Long Arm of Mordor and defeat it, I can play it again with 0-5 tokens. If I then try with three tokens and lose, I can play it again with 4 or 5 tokens. If I try with four and lose, I can play it again with 5 tokens. If I win, my final score for that quest is 5, and if I lose my final score for the quest is 6. (Alternatively, I could've decided that 6 was a good enough score the first time I played it, and just have my final score be 6 without playing again.)\n\nRemember that tokens do not carry over between quests. When playing The Black Serpent it does not matter how many tokens I needed to defeat The Mumakil.\n\n4) You are not required to publish your deck, but providing a ringsdb link is encouraged (otherwise I may need to ask you for your decklist at the end of the month if required for a tiebreaker). You are required to reveal which Heroes you used, and how many cards in your deck came from outside SoH/Haradrim, LOTR saga and a single core. Do not include outside heroes in this count, only cards in the deck itself.\n\nNote: Contracts (from the most recent cycle) are not part of the deck and should not be counted.  A Loot Deck (from the Burglar's turn contract) is also not part of the deck and should not be counted.  The One Ring or the Messenger of the King ally/hero should also not be counted *unless* your deck uses those cards to reach 50 -- the Master card fetched by the One Ring should be counted.  You may follow contract/One Ring setup instructions at the same as hero setup, ignoring Caleb's ruling.\n\n5) Tiebreakers have frequently mattered in this league. Here are the tiebreakers, in order:\n---\n1st) The number of outside cards (i.e. not from SoH/Haradrim, LOTR saga or a single core) used in the deck. Do not count outside heroes in this count, only cards in the deck. Less cards is better.\n\n2nd) The number of heroes specifically from SoH/Haradrim and LOTR saga. More is better.\n\n3rd) The number of heroes used from this list: LeGimli, SpLegolas, Kahliel, Fastred. More is better.\n\n4th) The number of cards in the deck outside SoH/Haradrim and LOTR saga. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n5th) The number of cards outside Sands of Harad, Mumakil, and Black Serpent. Less is better, and core cards are considered \"outside\" for this tiebreaker.\n\n6th) Performance in April's Solo League (if you didn't play or finish April's League, a median performance will be assumed). Whoever did worst wins this tiebreaker.\n---\n\n6) 1st place gets to choose the cycle for July's league, 2nd place gets to choose a quest from that cycle, and 3rd place gets to choose a quest *not* to be used from that cycle. In an effort to expand the diversity of decks used, the last place player will choose an additional cycle that may be used for deckbuilding in July's league. June's cycle (Mirkwood) was chosen by the winner of April's league.\n\n7) Weekly deadlines will at 11:59pm Eastern on the 14th, 21st, and 28th. Only the final deadline really matters for scoring and cannot be extended -- the first two deadlines are only to be included in intermediate standings.\n\nLong Arm of Mordor: May 14th\nMumakil: May 21st\nThe Black Serpent: May 28th\n\n8 ) I've created a google spreadsheet for results here:\nhttps://docs.google.com/spreadsheets/d/1ILsrw0VNsx4jd0RrlA5ddQFrVtueBFrgeETFXvZhKs4/edit?usp=sharing [https://docs.google.com/spreadsheets/d/1ILsrw0VNsx4jd0RrlA5ddQFrVtueBFrgeETFXvZhKs4/edit?usp=sharing]\n\nTo join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required.\n\nIf you wish you may run additional decks against the quests and record your results, but only the first entry will be considered for the competition itself."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933323","commentId":3933323,"userName":"Alonewolf87","timestamp":1588365825,"content":"Ok I will throw my hat into the ring for this one."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933347","commentId":3933347,"userName":"Alonewolf87","timestamp":1588369524,"content":"> 1 hour ago, dalestephenson said:\n> \n> To join the league, merely add your name and information about your deck to the spreadsheet, then enter your results as you have them. Please give a link to your deck if you built or published it on ringsdb, but it is not required\n\nDoes the number of rounds or final threat for a quest have some relevance? Or only the number of Valar Token taken matters?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933381","commentId":3933381,"userName":"General_Grievous","timestamp":1588374168,"content":"> 1 hour ago, Alonewolf87 said:\n> \n> Does the number of rounds or final threat for a quest have some relevance? Or only the number of Valar Token taken matters?\n\nJust the Valar tokens, then onto tiebreakers "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933429","commentId":3933429,"userName":"Bobbymcbobface","timestamp":1588385195,"content":"Good luck, everyone! In my tests preparing for this, Black Serpent is brutal solo, especially with my deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933492","commentId":3933492,"userName":"Alonewolf87","timestamp":1588406644,"content":"Ok I posted my deck, I actually fear I might have some problems with The Long Arm of Mordor, but I shall see."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933508","commentId":3933508,"userName":"Alonewolf87","timestamp":1588415368,"content":"Another newbie question: do we have to play the quest in order or can I (say) play The Mumakil, then The Black Serpent and The Long Arm of Mordor for last?"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933587","commentId":3933587,"userName":"General_Grievous","timestamp":1588434707,"content":"> 5 hours ago, Alonewolf87 said:\n> \n> Another newbie question: do we have to play the quest in order or can I (say) play The Mumakil, then The Black Serpent and The Long Arm of Mordor for last?\n\nI think it’s in order but @dalestephenson [https://community.fantasyflightgames.com/profile/256741-dalestephenson/] would be the best one to answer that for sure. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933798","commentId":3933798,"userName":"Bobbymcbobface","timestamp":1588475949,"content":"Alright, so after a fail at 49 threat due to Overrun by Orcs (I only managed to get 14 progress on Stage 4), I eked out a win on Long Arm of Mordor with one token.\n\nI am now two losses into The Mumakil and will play with two tokens tonight.\n\nEdited May 3 by Bobbymcbobface"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3933863","commentId":3933863,"userName":"Alonewolf87","timestamp":1588501850,"content":"As I feared The Long Arm of Mordor put me in difficulty since my deck relies a lot on a combination of certain characters, so the first game (with 0 tokens) was a big loss. More prepared and thanks to a good starting hand I was able to squeeze out a win in the second game with all my heroes almost dead using only 1 token.\n\nThe Mumakil was definitely easier (thank to some luck with the Capture objective) and I won with 0 tokens at the first try.\n\nIn the next days I shall try and face The Black Serpent\n\nEdited May 3 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934028","commentId":3934028,"userName":"General_Grievous","timestamp":1588534008,"content":"Alright I already had this deck prebuilt which helped for setup time, since the release of Saruman I have been tinkering around with him trying to make him work and I find if you invest too heavily in his doomed cards that he basically becomes a once per round support piece as you can’t handle all the threat raises. I find that he’s quite good paired with Grima who can allow him to pull off a Peace and Thought the or Word of Command and then instantly ready if you used Grima. Together they are a solid combo and can help power up any archetype, but that is 2/3 lore heroes. My other thought was wanting to make a villains deck based off of the game boy advance game The Third Age (where Saruman was the evil hero I chose, and coincidentally Grima was always the first support hero I would pick). Kahliel, Gollum pr Na‘asiyah are the only other “villain” hero choices and since one of the required heroes this month was Kahliel I figured I would finally try him out for the first time and his Harad archetype (also in the videogame you do have an assortment of Harad allies, not so for Corsair or Gollum) It’s not super optimized for this month as far as cards (only the allies and his headress are from the cycle) and all of the events are from outside the allotted cards. But I wanted to try this villain combo at its strongest. \n\nAnd it definitely performed.\n\n \n\nLong arm of Mordor\n\nI chose Firyal as my starting objective hero and rescued Kahliel first round, Saruman next and Grima last. I managed to get the other big Harad characters out fairly early thanks to Tighten Our Belts and Captain’s Wisdom, Firyal was essential for keeping me in control of the encounter deck so I could plan for the round. I managed to finish the last questing stage with a threat of 48.\n\n0 tokens used\n\n \n\nThe Mumakil went quite well with drawing the Noose of Vines and knowing I had to work towards Kahliel and Jubayr combo. I had Kahliel’s Headress and Southern refugees to soak up attacks from the Wild Mumakil (which eventually turned into two Wild Mumakil!). I was able to slowly chip away at the beasts health and eventually use two Kahliel’s Tribesman boosting up Jubayr to defend and capture the Mumakil. Though Grima did die to a terrible fever he obtained in the jungle. Oh well you can’t win them all haha.\n\n0 tokens used\n\n \n\nThe Black Serpent \n\nThis was a really hard one for my deck, other than Jubayr I didn’t have much defending and I kept only drawing enemies which slowly began to pile up and kill off my heroes. Died off a few rounds in and had to take a token to restart. \n\n \n\nNext game I drew an extra card with my token and began to get a more even encounter card draw, thanks to some Legacy of Numenor and Captain’s Wisdom cards I was able to get both Firyal and Jubayr into play opening round for some solid questing and defending for the rest of the game. And thankfully the last objective card that was attached to The Black Serpant was the one that didn’t buff him at all. I had to sacrifice and bring back Saruman + Fall of Gil-Galad with Houses of Healing to keep my threat down and yet still finished at 47 threat. \n\n \n\nTotal tokens used 1\n \n\nTotal tokens for the three quests was 1\n\n "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934128","commentId":3934128,"userName":"Bobbymcbobface","timestamp":1588546311,"content":"Mumakil WOULD have been an easy win on 0 tokens, except I had Pit Trap and REVEALED 0 LOCATIONS THE ENTIRE TIME ON STAGE 2.\n\nWon handily with 2 tokens. On to Black Serpent!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934160","commentId":3934160,"userName":"General_Grievous","timestamp":1588552682,"content":"> 1 hour ago, Bobbymcbobface said:\n> \n> Mumakil WOULD have been an easy win on 0 tokens, except I had Pit Trap and REVEALED 0 LOCATIONS THE ENTIRE TIME ON STAGE 2.\n> \n> Won handily with 2 tokens. On to Black Serpent!\n\nOh man that’s terrible. At the mercy of the encounter deck right? I had never-ending enemies in the black serpent right from the start."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934286","commentId":3934286,"userName":"dalestephenson","timestamp":1588596593,"content":" \n\n> On 5/2/2020 at 6:29 AM, Alonewolf87 said:\n> \n> Another newbie question: do we have to play the quest in order or can I (say) play The Mumakil, then The Black Serpent and The Long Arm of Mordor for last?\n\nSince nothing in the rules requires you to play in order, you may play out of order if you wish."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934289","commentId":3934289,"userName":"dalestephenson","timestamp":1588596967,"content":"> 17 hours ago, General_Grievous said:\n> \n> Firyal was essential for keeping me in control of the encounter deck so I could plan for the round\n> \n>  \n\nFiryal is amazing, but since you have to plan before she uses her ability, I'm not sure how much she helps with planning.  At most you could exclude encounter cards that have only one copy remaining in the encounter deck."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934425","commentId":3934425,"userName":"General_Grievous","timestamp":1588611885,"content":"> 4 hours ago, dalestephenson said:\n> \n> Firyal is amazing, but since you have to plan before she uses her ability, I'm not sure how much she helps with planning.  At most you could exclude encounter cards that have only one copy remaining in the encounter deck.\n\nShe makes you immune to surge cards for one,  but if it’s another enemy and you already have one in play you can discard it to try your chance at something else, likewise dumping a nasty treachery or high threat location. Basically giving you a do-over for all those times you’re like “if only I hadn’t drawn another enemy” or “if this had been a treachery instead”. I still think of it as planning because you are controlling what is flowing into your battle space to deal with what you have available."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934545","commentId":3934545,"userName":"Bobbymcbobface","timestamp":1588630243,"content":"All right, so I finally finished black serpent with 13 tokens. Oof"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934721","commentId":3934721,"userName":"Alonewolf87","timestamp":1588681190,"content":"The Black Serpent really went against the whole side quest aspect of my deck so in the end it took me 4 tokens to win it (and with a dead Gimli in the last turn to boot). I totally forgot how brutal this quest was."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3934789","commentId":3934789,"userName":"General_Grievous","timestamp":1588688633,"content":"Agreed the Black Serpent was much more difficult then I remembered."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3935021","commentId":3935021,"userName":"Trumpet95","timestamp":1588712404,"content":"So I make my Solo League debut with a Kahliel Grey-Wanderer deck!\n\nThe idea came to me as a way to outsmart the Long Arm of Mordor \"captured heroes\" mechanic, and it worked a treat.\n\nI took Firyal as the objective-hero (the copies in my deck can be discarded to ready a Harad character, so not wasted), and got a good starting hand - the Headdress, Yazan, Silver Circlet, Southron Refugee, and 2 copies of ally Firyal, which were useful to generate early action advantage.\n\nChoosing Song of Travel as my contract-attachment, I put it into play on Firyal (the contract doesn't say anything about putting it on your starting hero!), allowing Silver Circlet turn 1, so I could immediately quest successfully and rescue Kahliel.\n\nOnce I had used the contract to afford Yazan, and disposed of the annoying Enforcer and his direct damage, I could stall for a little on Stage 2. I drew into copies of Resourceful, Kahliel's Tribesman, and Haradrim Spear. Once they were on the table, along with Kahliel's Headdress, and I had got Jubayr into play with Timely Aid, I was set to breeze through the next two stages, disposing of the Chieftain in a single turn.\n\nI will admit to having had a decent draw both from my deck as well as the encounter deck - I staged plenty of harmless locations at a good time, both the Wargs turned up with no other enemies in play, and even the side quest turned up at a convenient moment, giving me a buffer against over-questing stage 2, not to mention winning me those precious 10 victory points which... mean absolutely nothing...\n\nThe question is whether this deck will stand up to more conventional quests like Mumakil and Black Serpent. We shall see!\n\n \n\nLong Arm of Mordor: 0 Tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3935027","commentId":3935027,"userName":"Alonewolf87","timestamp":1588713142,"content":"> 14 minutes ago, Trumpet95 said:\n> \n> Choosing Song of Travel as my contract-attachment, I put it into play on Firyal (the contract doesn't say anything about putting it on your starting hero!), allowing Silver Circlet turn 1, so I could immediately quest successfully and rescue Kahliel.\n\nIndeed, you can definitely put the attachment from the contract on another hero, even another player's. Just one thing, is it worth going through the Song of Travel + Circlet route instead of the usual Strider? I mean sure you wont lose the Willpower bonus of the circlet late game and the second sphere icon could be useful (though only for the silver circlet in your deck, perhaps if you added some Test of Will I might see the usefulness more), but the action advantage is hard to pass on.\n\nAlso no Captain's Wisdom? It would be massively helpful for your deck.\n\nEdited May 5 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3935044","commentId":3935044,"userName":"Trumpet95","timestamp":1588714445,"content":"Strider and Captain's Wisdom are indeed no-brainers - but unfortunately I don't own the Dreamchaser cycle yet - and I prefer not to proxy if I can. Probably should have mentioned that in the deck description.\n\nSong of Travel is even less useful given that the contract allows one off-sphere non-unique in the planning phase. I did consider Test of Will and some other spirit splashing, but I was already over 50 cards, and there weren't any obvious cards to cut (in my mind anyway!). \n\nI could just cut the Circlet/Song completely, but I was worried about not having enough willpower early on. An obvious solution would be Celebrian's Stone, but aside from being thematically odd I only have one Core Set, and only running one copy isn't consistent enough. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3940091","commentId":3940091,"userName":"dalestephenson","timestamp":1589576190,"content":"My first attempt against Long Arm of Mordor had the potential to go well -- I had Vilya in my opening hand, and I had visions of powerful cards helping me cruis to victory.  But it was a trap -- I succumbed to the temptation to use Elrond for Vilya instead of using his excellent stats, Vilya kept whiffing, and the threat piled up beyond control until I was doomed.\n\nThe second attempt I again started with Elrond as my first hero out of staging, but this time Vilya never showed up.  I *did* have Steward of Gondor, so it didn't take long for Firyal and Elrond to get Yazan and Jubayr into play, and by the end of the quest 5/6 of the non-unique Haradrim were in play also as we cruised to victory.\n\nHere's how many tokens we took against Long Arm of Mordor (outside cards in parens):\n\n0 Trumpet95 (25)\n0 General Grievous (31)\n1 alonewolf87 (0)\n1 dalestephenson (11)\n1 bobbymcbobface (14)\n\nStill about two weeks left to join the league and finish the quests.  They are light hearted fun, except for the Black Serpent."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3940472","commentId":3940472,"userName":"Trumpet95","timestamp":1589645330,"content":"Next up for my Khaliel solo deck was The Mumakil...\n\nI pulled Resourceful in my opening hand, and two early Timely Aids drew Jubayr and Firyal, giving me a great base to build on. I was able to time my Mumakil release well, exploring Mumak Trail and completing 1B in the same phase. \n\nI also drew Pit Trap for my objective, but unlike Bobbymcbobface drew nothing but locations. I had managed to get 5 damage on the Mumak, but location lock got dangerous when the Guardians of the Jungle side-quest came out - at one point I had 17 threat in the staging area!\n\nOne of the areas this deck struggles with is top-end willpower; I was getting stuck at 14 or 15 willpower, and I also lacked the card draw to remedy it. Thankfully I had Faramir to save the day, and being a Grey Wanderer deck meant my threat was still low enough that I could quest all-out with impunity from enemies (mainly just the Mumak, as it happened). I just scraped enough progress to clear the active location, meaning I could travel to that 4-threat location (Jungle Path?), which thankfully reduces the threat of locations in staging by 1, offsetting the side-quest. \n\nThat was the breakthrough I needed, as I was able to quest all-in again next turn (only enemy in play was that Mumak), pulled a mild treachery, and actually made exactly enough progress to clear both the location (which was just enough to capture the Mumak) and stage 2B, winning the game.\n\nA few hairy moments, but I've made it through unscathed. I got decent luck with the objective - Pit Trap probably wasn't the easiest for my deck (Horse-Hair Lasso and my 5-cost allies) but I would have been in trouble had Noose of Vines turned up, I think.\n\nThe Mumakil: 0 tokens.\n\nI suspect Black Serpent will not be so easy!"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3943065","commentId":3943065,"userName":"dalestephenson","timestamp":1590155446,"content":"Mumakil's first reveal was a Terrible Fever, but a turn later blind Vilya played Sneak Attack in the planning phase, Gandalf happened to be in hand, and the card draw turned up a Warden of Healing who kept Arwen alive the entire quest.  I was able to get all the Haradrim out except Yazan, and had a 4-threat location to travel to for my Pit Trap.\n\nHere's how we did against Mumakil (outside cards in parens):\n\n0 alonewolf87 (0)\n0 dalestephenson (11)\n0 Trumpet95 (25)\n0 General Grievous (31)\n2 bobbymcbobface (14)\n\nAnd cumulative through the first two quests:\n\n0 Trumpet95 (25)\n0 General Grievous (31)\n1 alonewolf87 (0)\n1 dalestephenson (11)\n3 bobbymcbobface (14)\n\nOnly the brutal Black Serpent remains; still a week left to put a deck together and join the league."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3945839","commentId":3945839,"userName":"Trumpet95","timestamp":1590708836,"content":"And the wheels finally come flying off the wagon (oh wait, wrong cycle...)\n\nI was never really able to get a foothold in the quest; I basically had to have Silver Circlet, and then get the Harad allies into play as soon as possible. 0 and 1 tokens were quick washouts, so I jumped to 4 tokens and actually got off to a decent start, but then an ill-timed treachery left me with too many Haradrim Archers, and too much Archery to soak. Attempts with 8, 10 and 14 tokens all stalled out before I could even beat stage 1. The problem with the tokens is that I don't really want to be drawing all my Harad allies - I want Timely Aid etc, with the allies near the top of my deck! Spending tokens to draw them all just meant I needed a load more tokens in extra resources to get them into play as early as possible (notwithstanding the generation from the contract)\n\nIt was a case of needing the right cards to come out, and the encounter deck being kind enough whilst I set up. Eventually things went my way on token 20, getting Silver Circlet, two Harad allies out immediately with Timely Aids, and that gave me the platform to build on to deal with the quest. Firyal's direct damage was particularly handy to soften up enemies in the staging area.\n\nI think my deck wasn't brilliantly suited for this quest, but it is probably capable of beating it with fewer; it just depends how the cards fall out. Strider would have been a game-changer here; making it much more consistent. Any game where I was stuck with just Khaliel questing for 2 was almost an instant write-off.\n\nStill, beating 2/3 quests with no Valar is a decent effort, and I'll try and bounce back next month - I've been working on a cunning plan for Escape from Dol Guldor!\n\nBlack Serpent: 20 tokens."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3946535","commentId":3946535,"userName":"dalestephenson","timestamp":1590806074,"content":"Black Serpent is always tough, but the first attempt went well to start with; I started with Summons of Mordor attached to a Desert Bastion and I quickly had both Vilya and Steward of Gondor.  But without card draw I just piled up resources, and I kept needing to use Elrond for defense and couldn't spare a Vilya use.  The encounter kept hitting back with enemies, and evenutally I had four defenses needed with just three characters, I did a blind Vilya in hopes of pulling a Gandalf out of my hat -- instead it found my missing Elven-light and I scooped.\n\nThe second attempt (one token) started much worse with a Serpent Banner attached to a Southron soldier.  I was overwhelmed quickly.\n\nThe third attempt I again had Summons/Bastion for minimum impact, and using the two tokens I was able to get a headress and Firyal out in the first two turns.  Firyal kept the enemies away and I slowly worked my way through a succession of locations with threat steadily rising; I got the big three Harad allies out, but no Vilya or Elven-Light.  Eventually a Headress let me reshuffle and the cards started coming out, I was able to use Gandalf to lower threat immediately after claiming the headdress, and then survived combat long enough to get through stage two and three, finishing with 48 threat and success.  I got lucky....\n\nThe encounter deck was not so kind to some of the others (outside cards in parens)\n\n1 General_Grievous (31)\n2 dalestephenson (11)\n4 alonewolf87 (0)\n6 Thanee (26)\n13 bobbymcbobface(14)\n20 Trumpet95 (25)\n\nFinal standings:\n1 General_Grievous (31)\n3 dalestephenson (11)\n5 alonewolf87 (0)\n6 Thanee (26)\n16 bobbymcbobface(14)\n20 Trumpet95 (25)\n\nGeneral_Grievous takes first and can choose the cycle for July's league.  I will get to choose a quest to play from the cycle, and alonewolf87 will get to choose a quest to exclude.  Trumpet95 will get to choose a supplementary cycle for player cards.\n\nThank you for playing, and join us next month as we return to the first cycle of the game -- Journey along the Anduin, Escape from Dol Goldur, and Journey to Rhosgobel (with LOTR saga for supplemental cards)."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3946593","commentId":3946593,"userName":"Alonewolf87","timestamp":1590829318,"content":"> 7 hours ago, dalestephenson said:\n> \n> 1 General_Grievous (31)\n> 2 dalestephenson (11)\n> 4 alonewolf87 (0)\n> 6 Thanee (26)\n> 13 bobbymcbobface(14)\n> 20 Trumpet95 (25)\n> \n> Final standings:\n> 1 General_Grievous (31)\n> 3 dalestephenson (11)\n> 5 alonewolf87 (0)\n> 6 Thanee (26)\n> 16 bobbymcbobface(14)\n> 20 Trumpet95 (25)\n> \n> General_Grievous takes first and can choose the cycle for July's league.  I will get to choose a quest to play from the cycle, and alonewolf87 will get to choose a quest to exclude.  Trumpet95 will get to choose a supplementary cycle for player cards.\n\nIt was a fun experience, I look forward to playing some more of these.\n\nI am wondering if, going forward, I should stick with my decision of using only cards from the cycles pool or not. I wanted to try that way so that I had to play with some cards I usually neglect (though I strive to play different decks and playstyles) but I am not sure if it's too much of a limitation. Let's see how this going back to the basic cycle next month will end up playing out.\n\nEdited May 30 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3946827","commentId":3946827,"userName":"General_Grievous","timestamp":1590884630,"content":"> 15 hours ago, Alonewolf87 said:\n> \n> It was a fun experience, I look forward to playing some more of these.\n> \n> I am wondering if, going forward, I should stick with my decision of using only cards from the cycles pool or not. I wanted to try that way so that I had to play with some cards I usually neglect (though I strive to play different decks and playstyles) but I am not sure if it's too much of a limitation. Let's see how this going back to the basic cycle next month will end up playing out.\n\nI honestly go back and forth, sometimes I build using only allowed cards, other times I just play something new I want to try around a required hero they are all good options but the former is definitely harder haha."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3946828","commentId":3946828,"userName":"General_Grievous","timestamp":1590884714,"content":"It seems the villains worked out for me, I’ll choose the LOTR Sagas for the cycle. "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3946977","commentId":3946977,"userName":"dalestephenson","timestamp":1590928888,"content":"I will choose Flight to the Ford, I want to see how differently it will play out when you don't have to be so careful about Burdens.\n\nAlonewolf will select a quest to exclude.\n\nEdited May 31 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947210","commentId":3947210,"userName":"Alonewolf87","timestamp":1590960458,"content":"I will exclude The Dead Marshes, I really hated that quest in our 4 decks Saga playthrough, it was the one we had the most difficulty beating besides Mount Doom.\n\nEdited May 31 by Alonewolf87"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947218","commentId":3947218,"userName":"DurinVoronwe","timestamp":1590961456,"content":"How are you going to handle the Black gate and Valar tokens? "},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947259","commentId":3947259,"userName":"dalestephenson","timestamp":1590970810,"content":"If Black Gate is selected by the RNG, I figure there are three options for the unwinnable scenario:\n\n1) Just roll again\n\n2) Specify an arbitrary number of rounds to survive as \"winning\"\n\n3) Combine with Mount Doom, with the rounds from Black Gate providing a time limit for Mount Doom\n\nLet's see what the RNG pulls out of the hat....\n\nBreaking of the Fellowship and Mount Doom.\n\nSuggestions welcome for how Mount Doom *should* be handled, if it is ever selected (previous LOTR saga months it has been the excluded choice).\n\nMandatory hero list is Gandalf, LeEomer, and Tom Cotton.  Trumpet95 gets to choose a cycle for supplementary player cards."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947353","commentId":3947353,"userName":"Trumpet95","timestamp":1590999782,"content":"Let's go for Lost Realm/Angmar Awakened for some Dunedain fun."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947355","commentId":3947355,"userName":"Alonewolf87","timestamp":1591001267,"content":"> 8 hours ago, dalestephenson said:\n> \n> If Black Gate is selected by the RNG, I figure there are three options for the unwinnable scenario:\n> \n> 1) Just roll again\n> \n> 2) Specify an arbitrary number of rounds to survive as \"winning\"\n> \n> 3) Combine with Mount Doom, with the rounds from Black Gate providing a time limit for Mount Doom\n> \n> Let's see what the RNG pulls out of the hat....\n> \n> Breaking of the Fellowship and Mount Doom.\n> \n> Suggestions welcome for how Mount Doom *should* be handled, if it is ever selected (previous LOTR saga months it has been the excluded choice).\n> \n> Mandatory hero list is Gandalf, LeEomer, and Tom Cotton.  Trumpet95 gets to choose a cycle for supplementary player cards.\n\nWe could decide to exclude both The Black Gate Opens and Mount Doom due to their peculiar nature."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947486","commentId":3947486,"userName":"dalestephenson","timestamp":1591029551,"content":"Mount Doom is tough, but outside campaign mode you don't have the turn limit, making it a *much* more manageable quest.  I meant to solicit opinions on Black Gate, not Mount Doom -- my bad.\n\nEdited June 1 by dalestephenson"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947491","commentId":3947491,"userName":"Bobbymcbobface","timestamp":1591030012,"content":"Aren’t the black riders heroes also part of the mandatory group?\n\nAlso, will the same Frodo be required for all three scenarios, since we have to use the same deck?\n\nEdited June 1 by Bobbymcbobface"},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947521","commentId":3947521,"userName":"Alonewolf87","timestamp":1591033264,"content":"> 58 minutes ago, dalestephenson said:\n> \n> Mount Doom is tough, but outside campaign mode you don't have the turn limit, making it a *much* more manageable quest.  I meant to solicit opinions on Black Gate, not Mount Doom -- my bad.\n\nIt might be time consuming but we could take advantage of the Saga turn limit and decide that to claim an actual win against The Black Gate Opens you must also win against Mount Doom in the same number of turn we got for The Black Gate Opens with the same deck (basically having to play 4 quests instead of 3).\n\nOtherwise we could, as you said, set a minimum number of turns you must survive (let's say 10?) to declar the game against The Black Gate Opens a win."},{"commentUrl":"https://community.fantasyflightgames.com/topic/308102-solo-league-21-haradrim-with-lotr-saga-player-cards/?do=findComment&comment=3947609","commentId":3947609,"userName":"dalestephenson","timestamp":1591041454,"content":"> 3 hours ago, Bobbymcbobface said:\n> \n> Aren’t the black riders heroes also part of the mandatory group?\n> \n> Also, will the same Frodo be required for all three scenarios, since we have to use the same deck?\n\nRight, Flight to the Ford is in the first box, so that opens up the hobbits (Sam, LoPippin, Fatty, TaMerry) as mandatory hero choices.\n\nIn the past we've required the same Frodo for all Frodo-using quests, which this time around will be all of them."}]}